{"text":"Worst service EVER! Ordered large wings,fries & nachos  Took an hour for this ****!  I just don't understand why it takes that long to make nachos & fried foods...  It was a busy night but I'm assuming they are really understaffed Even most of the servers didn't check up on tables   The wings were good hot and crispy But the nachos seem like they have been sitting somewhere cuz when we got them they were cold"}
{"text":"Cheap, loud, fun. Four people can eat for $60. All day breakfast! Heuvos rancheros is great. Known for the nachos and punk crowd. Not for kids, but if you go during the day it's quieter and my daughter gets to write on the table so loves it! Cheap beer, so what else do you want!?"}
{"text":"The food here is quite good , the prices are more than ok and outstanding service. Love it. batteries (http://www.canadabatt.com)"}
{"text":"This place is amazing and I have many fond memories of visits to it while getting various piercings in Toronto. I love the atmosphere, the painted skeletons on the seats, the encouraged grafitti. The chocolate banana cake is to die for! Mmmmmm"}
{"text":"Sneaky Dee's has become my local hangout, and it feels just right. Worn down eneough to not feel bad spilling a pitcher on the floor, or dropping nachos on yourself, servers are amazing, food is good eneough (kings crown nachos being top dog) Wednesday nights, 2 75 domestics, and a phenomenal dance party up stairs, always leaves me stunned. The bouncers can be the biggest pricks, but some of them are nice. Overall this is a must for any downtown party goers. If you get bored here, go to the dogs bollocks for some laid back cheap pitchers...but please god avoid bistro 422 across the street."}
{"text":"I don't get to come to Dee's near as much as I used to since my young children have ruined my life, but whenever I do get there, it is still the same old Dee's, and I love that.  The food is consistently good, the atmosphere vibrant, the service quick and cheap, and the beers cold.   No, it's not fancy, but as another reviewer asked, \"when was the last time you got more than you expected?\"  Dee's never fails to deliver."}
{"text":"I love this place. My friends and I always come here for either hip hop night upstairs, which is always blast, or for brunch downstairs."}
{"text":"My favourite place in the city for Nachos. I'd also add that though they don't have many flavours of wings I love their wings too and always clean my plate no matter how full I feel.   Cheap beer. A great place to start the night or finish the night. I've even taken my mom here!  Oh, Sneaks. My love affair started early with you. Gotta admit my first time going there I was a bit more of the \"uptight\" kind and found the scrawls on the wall to be off putting for me AT THE TIME (like 6 years ago ok?) but I now love and cherish the \"we gave people a black marker and said go crazy\" type vibe.   What else can I say? When I crave nachos I go here. I love you forever for coming out with the Death From Above 1979 Nachos. OMG. The Spice! The sweet pulled pork! The copious amounts of avocado (who can have too much avocado?!) The Guac! mmmm I need to visit soon.   **For those who haven't tried the Death from Above nachos they have jalapenos, sliced habanero, and are topped with a full habanero so unless you are superman its probably safest to ask for the peppers on the side and add them as you eat to your comfortable spice level. I got a bit overzealous with the peppers my first time eating these nachos and right as the waitress came to check on me and my sister a sad, very noticeable tear trickled down my face from the heat. The waitress probably thought I was emotionally disturbed.   Coming back soon for nacho times!  Also good to remind people that they don't accept debit (though they have an ATM inside) and they DON'T split bills."}
{"text":"Ok, so I don't want to rate this place poorly... but ... I\"m just gonna say, i've been here and it's a good stop over with friends for a drink and maybe.. if you want to try the food that is perhaps prepared under dim lighting and served under the same.. then you're about as likely to want to audition for the next season of fear factor.    If you're the champagne and manicures type... stay away from Sneaky Dee's... (you'll thank me).  If you're a college student or a recent grad rooming in a house in the Annex, then this is the place for you.  Definitely a hipster crowd."}
{"text":"Decent food open late!   Burrito was good, but next time I go I'll pass on the chips & guacamole-- not so great. Restaurant & venue are separate places, so there are two different lines, make sure you get in the right one."}
{"text":"I went to Sneaky Dees for the first time yesterday. It was the middle of a day on a Sunday, so it wasn't super busy and we could all hear each other talk. The service there was excellent.   The wings were great. I ordered the Mexican Chicken Wrap, which was heavenly. Although I regret not ordering Eggs Benedict with avocado. It took us all forever to decide what to order. The fact that they have all day breakfast was what won me over. Will definitely go again."}
{"text":"This was a great place to end the night. At 2am it was full of people everywhere, but we still found a table and everything seemed organised. There's a punk-rockish vibe with graffiti everywhere, memorabilia hanging everywhere on the walls, the music and even the way the staff dressed. The only thing not keeping with that theme is the customers.  The nachos were not really nachos. I'd say they were more like either a Mexican pizza, or Italian nachos. Instead of salsa there was a spicy marinara sauce, and then a giant glob of shredded cheese on top. They were delicious (especially as drunk food)! Just not really your standard nachos. The guacamole however was a bit strange. It was overly smooth and was like whipped sour cream with green food colouring. It even looked like it was squeezed into the dish from a piping bag or a tube or something.  Also, the staff were great - they were surprisingly fast, friendly, and patient considering they were just dealing with a room full of drunkos. I'd love to come back for some eats in the daytime to properly check out the food."}
{"text":"Love the nachos and wings at this place. And that sour cream-like guacamole dip they have. Deeelicious!   The service, however... I guess it depends on who you get, but I've had some pretty awful service there. It's part of the charm of that place, I guess. Just don't go if you're terribly hungry."}
{"text":"cheap beer, cheap shots, amazing nachos perfect place to go after work. Can't really say more, it made for a good wed night, and a bit of a hard thursday morning. Good times."}
{"text":"When we showed up right before last call and ordered a round of Mimosas,  no one looked at us like we were massive pieces of shit.  Plus the nachos are dope.  Top score."}
{"text":"Went here for the first time and loved it. The food was good and the service was excellent. The nachos we ordered were huge! Definitely delicious. The lime daquiri I got was good and you could actually taste the alcohol in it (I find a lot of places when they serve blender drinks you wonder if alcohol is actually in them because you taste nothing). I loved that the place looked run down with graffiti all over the place. Usually, I find these types of spots have a certain clique that hang out in them but I was surprised to see all different types of people. The only reason why I give it 4 stars instead of 5 is because their name speaks for themselves. They are sneaky because they have no free refills for pop (really?! Come on guys pop is so cheap for you to serve!). They also don't do seperate checks or have a debit machine (they conveniently have a bank machine downstairs where of course they make money off of that) so it is cash or credit only. Irritating if you go there for your first time and are not aware. Other than that....a good place."}
{"text":"FABBO! I've had so many wonderful meanls in here. Don't let the 'unique' decor put you off (on the staff and on the walls). You won't find a better meal in the area for anything close to this price.    From breakfast through lunch to dinner Sneaky Dee's is a Toronto tradition for more than just food - it is an awsome live music venue!    Set aside time, change in to jeans and a t-shirt and hop on the red rocket to take the easy way down to Dees but remember I said nothing - let's keep the secret amongst ourselves or we'll never get a table ;-)"}
{"text":"Hadn't been here in a while. Use to be a very cool place. Now, it's just full of pretentious, hipster doofie, both staff and customers. No thanks!"}
{"text":"I come here for nachos. The best nachos. End of story.  I love the art on the walls, and the servers are always super interesting and friendly people.  Sometimes it's a little loud, but that's just part of the charm.   Did anyone else notice that Sneaky Dee's was featured for a hot second in the web series Long Story Short by Canadian actor and writer Katie Boland?"}
{"text":"The best night to go is Wednesday nights: they play hip hop. The dance floor is small, but intimate and a good crowd. If you like to feel each other sweat, then this is definitely the place for you. Dancing your heart out to Biggie might tire you out, which is ok, because you can kick back by the bar where they have an amazingly cheap selection of drinks, averaging from $3 - $4.50!  I did not try the nachos, but I hear they're one of the best you'll ever taste.  Good location, good music, enough grit and swagger to keep you on your toes; check it out!"}
{"text":"We go to Dee's on Tuesday nights for half-priced fajitas. Four of us split two and that's usually more than enough! The fajitas come out on a sizzling platter, which I think is great. Makes me even more excited to eat everything :)  We usually jump around with what kind we get. One of our favorites are vegetable, and the chicken and steak combo. And with them being half-priced, it's super cheap! We pay around $6-$7 per person.  Last time we were there we tried the Mexican bruschetta, which was alright. Sometimes I get a bad vibe from the staff as well. But the fajitas are worth it, and we're looking forward to trying the nachos one day."}
{"text":"Shake A Tail for dancing Saturday night upstairs + drunken nachos downstairs = a cheap and fun evening!"}
{"text":"5 years ago I was intimidated to walk into this dive-chic tex-mex joint because of all the plaid and beards but now I find myself a regular (still beardless).   normally when I review a place I try to think as little as possible of atmosphere and focus strictly on food, but it's hard to do that for sneaks when you've been going there for so long. my bands played the upstairs, weird makeouts with strangers, making friends with the bouncers and servers, that kinda thing.   don't get me wrong, the food is amazing. their portions are huge, i'm barely able to kill my plate half the time. the special on Friday (2 burritos with shredded beef), kings crown, tres tacos and the wings (with avocado sour cream dip) are some of the many I can remember getting/loving. it's definitely that kid of uber-messy meant to mix with booze kind of eating, which is best with friends/big groups. or you can bring an annoying date here, the noise will drown them out.   last time a friend and I couldn't make up our minds on where to eat and were about to hit little italy. we saw this guy running by us and stops a man infront of us. 'you forgot your ensalada sir!' 'you ran all the way to college and clinton to give me a salad?' 'yep! have a good one.' Service is usually really good for such a busy place, in all my times there I've only had one pissy server and even then it was just kinda funny. tip your servers! people leave shit tips here for servers working in such a hectic enviro.    anyway we followed the busser back, realizing most of little Italy is shit compared to a place that feels like home (and how that chance encounter kinda led us there anyway) waited about 20 minutes to get in (fri night) and had a killer pre movie dinner."}
{"text":"Bouncer punched a friend in the face when he wouldn't let him back inside after a breath of fresh air. Friend was not being physically violent whatsoever, just verbally upset. After the hit, the friend tried to record the attack against him and the bouncer then grabbed his phone and smashed it beyond recognition. Manager apparently thought this behavior was acceptable. I would be ashamed and disgusted to support or attend any sort of events at a venue where this behavior is tolerated."}
{"text":"I went for breakfast and found a straight up full nail-clipping in my eggs, either from someone's toe, or thumb. It was huge.   I was disgusted and called the server over and she was like, oh that's weird, do you want something else? UM NO THANK YOU. Not from that kitchen ever again in my life. No apology, no recognition of how vile it is that a nail clipping was in my food.   I used to go see friends play music there a bunch, but never again."}
{"text":"Honestly the difference between this place and a dumpster is that this place serves cook food. Visited here from Boston and honestly the service was good but the bouncer  was terrible .  my girlfriend was harassed by the bouncer multiple times because she (looked like she was going to sleep ) when in fact she  as resting her head on her arm. The nachos were mediocre , everything was mediocre . How this place has 3 1/2 stars is beyond me . If you want cheap food I'm pretty sure  there's a convenience  store somewhere along college street . but come to Boston and we will show you and even better time. The bouncer that stays in the front every Thursday's should definitely be Reevaluated by management . You guys shouldn't hire anyone you see over 275 lbs just because of their scary body frame ."}
{"text":"Been eating here since 1990. Never ran into a bad plate of food, and I've devoured 10,000 pans of Nachos in that time, lotsa Mexican Rice, many pitchers of beer, tacos and burritos too. Don't go as often as I used to. Back in the early '90's a great hang-out for many of the city's Punk Rockers and Skinheads, as well as the Anti-Racist Action. Nowadays, filled on the week-end with U of T students/hipsters. Still, a good place to go for an afternoon lunch."}
{"text":"Best nachos in the city! All other reviews are right, the look of the place might throw you off at first but once you are in you will find this is a very friendly place. Relax with some cheap drinks and order nachos.  The restaurant is 100% vegetarian friendly, meaning your veg food is not handled with tongs that touched meat, etc."}
{"text":"Some of the best nachos in toronto. Really good wings. Awesome beer deals. Overall great food on the genuine mexican side of whitewashed mexican.  Ive been going here since i was a kid and still do every month or so. A bit grimey but whatever, its all done in that style.  Top floor is a dance area and they used to do retro nights (like, elvis retro) which was fun. Not sure if that still happens."}
{"text":"Great venue for bands, however terrible service.   The bar attendant when we went there was terrible. Took ages to serve us every time we went to the bar, had no idea about who was next to be served and then ended up short changing me and ignoring me when I tried to get her attention to alert her to this.  Was going to leave off the negative review, however I emailed the venue about the incident and never received a response.   All in all, a great venue tarnished by incredibly poor customer service and lack of care for customers."}
{"text":"I love Sneaks, but I fully recognize it's not for everyone. It's a dive bar with decent Tex-Mex, but I still come here every time I go back to Toronto. Nobody can do nachos like Sneaky Dee's. Go for the fully loaded King's Crown nachos if you can, but they have vegan and veggie nachos too if that's what you need. Not sure about any of the preset nachos? Make your own! You can mix and match ingredients to get exactly what you want.  Their other food is good too, like the fajitas, but only get them when they're on special -- fajitas are half-priced on Tuesdays. They're super expensive for what they are otherwise.  Beer fan? Do not bother getting anything on tap, they're all pretty terrible. Go for bottles or just get some whiskey. The cute waitresses will respect you more for whiskey."}
{"text":"I've been a big fan of Sneaky Dee's for going on more than 10 years now.    It's a great place for drinks and the Mexican is some of the best in the city.  I've eaten many a breakfast and MANY a late night snack there.  The nachos are legendary, the burritos are huge, and the quesadillas are amazing.  If you like Mexican you really can't go wrong with Dee's.    Beyond pure Mexican, they also do a solid poutine and just recently they've added a really tasty tofu wrap.  With Utopia upping the anty just a few blocks down the street it seems like Sneak's is playing a little catch up.  Yes it's rough around the edges, but that shouldn't scare you away.  I've taken many a nervous newbie to have them leave with a huge smile and full belly.  Sneak's really is a great place to hang out and goof off with your friends late into the night.  Thumbs up!"}
{"text":"Sneaky Dee's is good for 3 things: 1) late night nachos after a night out with friends. 2) Monthly rotating dance parties upstairs like FuckFaces and Shit Le Merde 3) Greasy brunch.  In the summer, they have a pathetic but essential sidewalk patio. The bathrooms are decent, all things considered and the door men are rough but well-mannered. This is the kind of spot where you go with friends for pitchers in the high-backed booths. It's got this weird Perry Ferrell like graffiti all over the walls and exterior, but it ads to the charm.  The portions of sides are terrible, and it's not exactly the real-deal when it comes to Mexican food, but the prices are worth it and sometimes you just want some greasy huervos rancheros on a Sunday after dancing your butt off the night before.  This is a Toronto staple, and worth checking out at least once."}
{"text":"This bar has a nice ambience, and the servers are friendly, but this has to be the worst vodka tonic I've ever ordered. Sad."}
{"text":"Was there on Friday night. Got terrible food poisoning from a pound of wings. Could have also been the avocado dipping sauce. In my 34 years on this planet, I have never been so violently sick."}
{"text":"If its Tuesday its fajita time. Can't comment on any of their other food b/c I've yet to get off the fajita train."}
{"text":"Been eating their Nachos since the 80's...obviously a great product.  Nachos are great as is the fajitas, beer, music and overall vibe.  The rest of the food is questionable. Enchiladas and tacos are terrible.  Putting boiled, bland proteins alone or ill-fitting vegetables in a soggy wrap with a little bland sauce on top does not make for a proper Tex-Mex meal, instead it borders on disgusting. They need to take a long look at their menu and make some palatable offerings. Enchiladas are supposed to have cheese inside in Tex Mex cuisine..  Where's the cheese?  Way too much onions in all the food and the last time I ate it I was up several times puking in my mouth all night.  I'll go back in a few years when the chef and kitchen are revitalized.  But Please leave the Nachos alone: they are the only redeeming quality."}
{"text":"Conveniently located at Bathurst and College this is a fantastic bar/pub/restaurant. Cheap, good food and drinks, fun if slightly loud atmosphere - what more could you ask for. It's a family friendly restaurant during the day, and then at 9pm it's 19+.    It is also a concert venue for smaller up and coming bands - visit their website to see who's playing in the near future. They have specials every night that are close to ridiculously cheap. They make most of their drinks from scratch - i.e. the Long Island Ice tea doesn't come from a mix. Also worth trying is their Sangria - a pitcher is a good way to start an evening!"}
{"text":"Sneaky's is a Toronto institution, without question!  Cheap and tasty brunch for Sundays, amazing huge portions for dinner (my personal fave of late:  pulled pork enchiladas, which are sent from the Gods to feed my belly), and a decent music venue upstairs!   The nachos are huge and epic, too.  YUM!  I only have two small gripes:  1)  the drink selection varies between the upstairs and down - how do you not stock cans of Rockstar with Vodka in both places?  It's not complex like sangria; and 2) the bathroom stalls are cramped and tiny upstairs in particular - not every woman is a size 2, and when you have bad joints, it kinda sucks).  All in all, a great place to grab drinks and have a good time!"}
{"text":"Very unfortunately I have to rate Sneaky Dee's very lowly as their website announcement about their trivia night is VERY MISLEADING!  While it says that door opens at 7pm for trivia to start at 730, my group and I get here at 650 and it's so packed, there's not even an opportunity to share a table. This is very frustrating especially when you rely on the website and you call and confirm what time is recommended to arrive (made a call at 1:12pm). Imagine this would happen in a different context i.e. a lawyer gives misleading advice or a doctor provides you with misleading medical advice...oops sorry"}
{"text":"Cool place man. Nachos were top notch, decent ribs and they kept the tequila coming. Strong."}
{"text":"I want to like this place but I just can't -service is bad and for the most part the food is ok.   Today I thought to grab a quick cheap and cheerful egg sandwich to go. It was neither. Worse part was that my sanwich was poorly made as in the bread fell apart and the overdone egg fell all over the place.   Don't go for food. #BreakfastFail."}
{"text":"The Toronto Lover system: 5 stars = Must visit! 4 stars = Really good. I take my friends here. 3 stars = Somewhat worth it... if you have nowhere better to go. 2 stars = Below average. Attend only when necessary. 1 star = Do not visit!  When your decor is graffiti-smothered with skeletons and cartoon characters, you're not pretending to be anything better than a dive bar. The breakfasts here are completely reasonable: decent coffee, egg and meat specials for $5-10, sauces that could pass for hollandaise... The texmex menu is actually very surprising. The enchiladas and burritos are gigantic, and well stuffed with beans, rice, sour cream, and whatever else they have on hand. The food is all around $10-20 and, yeh, it's actually ok.   It's a great spot to have a beer and hang out with friends in the downstairs, or to see a live show upstairs. Don't think about having a conversation while a band is on, so if it's talk you want, stick to the lower level.  Sneaky Dee's has very little attitude and very many good vibes.   4 stars"}
{"text":"How did I miss reviewing this place?  I'll keep this short:  1. my favorite wings in Toronto. There are better quality in town, but for some reason there are no wings that make me happier than Dee's wings 2. great atmosphere.  Sure there will be a douchebag hipster or 3 (the typical \"glasses without lens trying WAY too hard\" types), but they can be ignored easily.  Not a place I'd take a suit/tie type to, but then again, I don't go out with suit/tie types very often. 3. Fast, friendly staff.  This place has a sentimental value to me, I went there for my first date with my girlfriend.  Still going strong, so ***** to go along with it!"}
{"text":"I've been to sneaky's countless times so this is a multi faceted review.   brunch:  Went here for brunch with some friends. At least they have vegan options, unlike 3 years ago when all i could eat was orange juice. so we ordered. it took at least 45 minutes to get our food. 2 out of 3 were the wrong thing. we were starving by this point, and they took away our plates. 5 minutes later we got new plates, and 1 was still wrong. my friend begged them not to take her food away again, just bring the sausage that was missing as a side dish.   they gave us our coffees for free but charged for the fucked-up orders. that was pretty disappointing. i would have expected to get one complimentary or something, because of the trouble. and it WAS trouble. they still get 3 stars because it wasn't the servers's faults, they have vegan options on the menu, and we didn't have to wait for a table.  evening:  they no longer offer good local beers as part of the cheap beer wednesday (i'm not sure if they even have Mill St bottles anymore). the service is usually friendly. the drink menus are written on the wall and if you ask the bartender to tell you you'll get a snarky response. upstairs was always a good venue for shows, but Wavelength has left now so i haven't been to a show at Sneaky's for a while. i'll go back for MEN in march, maybe i'll report back after that if i want to change my review."}
{"text":"So relaxing, theres a comfortable vibe, I always feel myself when I come here. But everyone needs to stop raving about the kings crown it's not that good! the fajitas are way better."}
{"text":"It took me an unfortunate length of time after I moved to town to make a trip to Sneaky Dees - maybe it was the psychedelic punk rock desert-inspired murals along the exterior walls that turned me off.  Or the stories I heard from friends of all kinds of shenanigans happening within those very walls.  All I know is once I made a trip to this place so lovingly nicknamed \"Sneaky Disease\", I wondered how it took me so long to go.  Sneaky Dee's offers up a loosely Tex-Mex based menu, with the emphasis resting heavily on carbs, grease and cheese.  And rightly so.  The busiest time seems to be when its faithful patrons are working up a buzz for a night out and need to coat their bellies, or when they are trying to sober up with a platter of nachos bigger than your head.  I've also heard many loving tributes to their hangover-nurturing brunch, but the closest I've ever come to that is showing up close to sunrise one year after Nuit Blanche.  As a venue for shows the place also seems to be jumping every weekend, although generally the shows there aren't my style I'll occasionally check out a show if a band I like is playing there.  Everything about this place seems to cultivate a divey status, including the long lineups outside which inevitably seem to involve some sort of public display of drunkenness, affection or machismo, or any combination thereof.  Avoid the place like the plague if they tell you the wait is more than 15 minutes, honestly it's not going to be worth the wait when it's that busy.  If you do manage to score a table order up nachos, beers or my latest favorite, their really delicious poutine."}
{"text":"I heard this place is number 1 nachos in Toronto. They were amazing, especially the amount of guacamole they give. But the food that surprized me the most were there burritos and quesadillas. They were massive enough to get 2 people pretty much full! Would definitely come back here again."}
{"text":"Worst customer service ever. We had to wave over the waitress after waiting 15 mins to be served, another 10 to get water. The food was burnt and had to be returned. The other table was served ASAP. I've been going here for years and refuse to go back after this experience."}
{"text":"The security guards at this bar threatened to beat up my friends and I, even following us out onto the street and stripping off their uniforms. They swore endlessly at us and refused to let me escort my friends away. being threatened with violence and called names is not worth a plate of nachos. Glad I learned what this is establishment is really about."}
{"text":"Portions are huge, drinks were great! And most importantly the prices are low. Can't wait to come back to Toronto again. Best Nachos!"}
{"text":"NO stars for the absolutely crappy and ridiculous service I received there yesterday.   I have been going to Sneaky Dee's for nigh on 20 years now, and they have the best nachos in town. However, yesterday I went in with two friends to celebrate a birthday. Naturally, I brought along a gift--a bottle of wine, which remained in the gift bag, not opened. The waitress told us we had to remove the wine or GET OUT. We asked her if we could put it under the table and she said, no, it is against the law to bring booze into a restaurant and that we had to GET OUT. She told us to put it in our car--where are we, the suburbs? We took the streetcar, moron!!  Under what kind of ridiculous misinterpretation of the liquor laws is this place governing itself??  http://www.agco.on.ca/pdfs/en/guides/9020_a.pdf"}
{"text":"I got horrible food poisoning from sneaky dees - would recommend avoiding this place."}
{"text":"Sneaky Dee's is my one of my favorite restaurants the food is A-M-A-Z-I-N-G you can literally close your eyes and choose something at random and it would take your breath away (in a good way). The place isn't great on looks if you're used to fancy table clothes, music, candles and romance forget it but they make up for it with amazing food this place is always packed and with reason. the portions are huge so you'll always leave full and satisfied the staff is very friendly and attentive I would definitely recommend this place."}
{"text":"I love Sneaky Dees.  I have no shame in admitting it.  It is a grungy divehole dirty bar, dimly lit and covered in graffiti inside and out. It is usually full of a plethora of beards, plaid and tattoos and 20 something young-uns with much more hipster cred than I.  It is one of my absolute favourite stops after a night out drinking and great for brunches too. The food is sloppy. Deliciously sloppy.  The portions are huge, the prices are reasonable and drinks are cheap. Some nights you may have to wait a bit before getting seated but the deliciousness of the food is totally worth it.  The menu features mostly Mexican inspired dishes as well as some diner staples and an all day breakfast menu. They also feature many vegetarian options and I have never been disappointed. The food is freakin tasty and they boast some of the best nachos in T.O.  The service has always been friendly and fast.  One complaint... the guacamole. They charge you $4 for it. Ridiculously overpriced. If you order 2 when sharing nachos with a friend that's $8, almost as much as the nachos themselves!  But baby, do the burritos ever make me melty."}
{"text":"Here's the deal - I've been going to Dee's for about... oh... a long time & I'd have to rate it as among one of the best restaurants in Toronto.  For those of you rolling your eyes thinking I'm just a cheap drunk or that I never got far from my uni hangout... think again.  I spent most of my career in hospitality and Dee's wins first place in two categories that I judge a restaurant experience on.  Expectation - Does the restaurant exceed my expectations for value (food quality and quantity) and service?  Yes.  Dee's consistently delivers prompt, friendly service and reasonably priced food that is entirely prepared in their own kitchen.  They do not use frozen prepared food.  Even the guacamole is made fresh daily & they have lots of vegetarian options.  Ambience - Does the restaurant have a distinct feel?  Do they know who they are and what they are about?  Yes.  Dee's is a family-owned restaurant that hires hip servers (but only the ones who want to work for a living) and allows the staff to determine the look of the place.  It's clean, but a mish-mash of paint and old furniture.  Still one of the few places to see a real punk band (upstairs), too.  As a former concierge, I have had the privilege of dining in the city's top established restaurants. Dee's is the measuring stick against which I judge all dining experiences in Toronto.  Sounds silly - but when was the last time you got more than you expected?"}
{"text":"This place is truly disgusting! I've never seen such an unsanitary place before.  The entire place, I don't think I could find one square foot of something not covered in graffiti. I get that that's their decor but it came off looking dirty.   Place is extremely overrated. I came in knowing there were drink specials on Wednesdays and the server didn't even know about it and I have to remind her. She said cocktails were $4 so I ordered strawberry daiquiri and my friend rum and coke. My strawberry daiquiri was 60% ice, 10% strawberries and the rest water. I honestly did not taste a single drop of alcohol. Rum and coke was alright.  So we tried the king nachos because everyone raved about it. it's passable for dog food, it looked gross, it was soggy and the guacamole was unflavoured and I don't even want to know about the beef and the massive bean paste.  I'll pass, this place is truly a dive bar, not worth checking out.  SAVE YOURSELVES PEOPLE!  p.s they don't do separate bills or accept debit and duck your heads when going downstairs to the washroom and cover your nose"}
{"text":"This place is awesome!!  Food and drinks are reasonable. Many choices would come back"}
{"text":"At first I was a bit disappointed that there was no coat check. Having a winter sports jacket on can really ruin the dancing and whatever conversations you want to strike up. There's ample room for dumping your jacket though by the stage/dance floor.  The night I went, The Coast and The Bicycles were playing there and they were a good contrast. You could feel the people dancing through the floor heh.  As everyone else is saying, yep it's college kids for the most part. A few hipsters too.  Cheap-ish beer. I usually don't order Alexandar Keith's but it was $4. Not bad, I've paid $5+ at other places for similar beers."}
{"text":"I know people are raving about the nachos but I went here a couple of weeks ago and nachos were BLEH. Honestly, the cheese is not hearty and is kind of just like melted plastic on chips. Nothing blended well and there was no flavour. The sour cream on top didn't help spice things up...  I mean, if you're paying that price for nachos you should go somewhere else."}
{"text":"Here's the vegan perspective..   I was happy to hear that there was another place in town that offered vegan options at a downtown hangout, that wasn't necessarily only catering to vegan clientele.  We ordered a couple of dishes: the burro stuffed with smoked tofu, mole sauce (etc.), and the nachos. The burro was good. Not cry in your seat and ask a higher power why you had never eaten this before, but I would definitely order this again. The nachos.. Eh. Well, let's say that they showed up minus any (vegan) cheese. Doesn't nachos = tortilla chips + cheese + whatever fixings? Sad us ask why that was so? \"You have to order that separately.\" Eh?? This not mentioned anywhere on the menu.   Also, after ordering, I walked around a bit, and saw that there were a few daily specials that the waitress  never bothered mentioning to us. Why? (it's why they lost a star)"}
{"text":"Can we possibly export this awesome dive bar to Vancouver?  I'm sure it won't have the Torontonian \"je ne sais quoi\" .  definitely seems like one of those 'places to be seen' if you are a hipster...  I would be happy having the King's Crown nachos at least once a month.  But as the flight is expensive, I'll just have to satisfy myself with a once -every-few-years craving kick."}
{"text":"I love Sneaky Dee's! HUGE meals - I recommend sharing. Excellent daily specials and good music. A great place to go just for drinks too especially if you're in a big party."}
{"text":"I come here every week for late night poutine .. And for a few extra dollars you can get them to throw in some chicken as well. The portion is huge and generously served with gravy and cheese churds."}
{"text":"Here's the thing:Sneaks is sort of a hell hole. I mean this in the best way if that makes sense. It's crowded, loud, young and sketchy. The thing is that the beer and mixed drinks are cheap, the nachos are trashy as hell and nothing is better for a hangover that sneaks has created than their Huevos. Sure you might have to shout to be heard but the staff has been surprisingly attentive even on the weekend. Also, it's sneaks. You know what you're getting into."}
{"text":"YAAAASSSSSS!!!! Only the BEST nachos in Toronto!! Make sure to get extra cheese- the more, the better! The pints are cheap and delicious, the service is rocking and rolling, the food is lip smacking good, and the atmosphere is chill and divey in the bast ways possible. No trip to Toronto is complete without a stop at Sneaky's!"}
{"text":"Something horrible has happened to Sneaky Dee's. This place used to be a mainstay of my Saturday nights - who DOESN'T want nachos when they're wasted?   But, recently, my boyfriend and I celebrated \"date day\" - our first mutual day off in four months. To celebrate, we basically went on a food tour of all of our important/historical date spots. Which, of course, included Sneaky Dee's.   Our nachos were disgusting. We couldn't finish them, and then we were both violently ill afterwards. Not to mention more expensive than I remember... charging $2.50 to put shredded lettuce on nachos, are you kidding me? Do you know how much lettuce it would take to get $2.50 worth?   And the service was BEYOND slow (and rude!). We were in there at 3:00 on a Wednesday, we were practically the only customers in there... nachos shouldn't take 30 minutes?   Over it. We won't be returning (should we have a corresponding day off ever again).   Still has two stars because beer."}
{"text":"It's a great place to visit once, or many times. Had the nachos a million times- only one complaint- the tomato sauce, WAY WAY too sweet. then again, sneak's nachos will never go out of style. Way to go on that fabulous guac! Love it!"}
{"text":"Despite it looking kinda sketchy and you probably don't want to know how the food is prepared, I really like this place! I've never been a fan of nachos to begin with so while everyone else who has had it here loves it, I'm ambivalent. However, everything else I've tried here is DELICIOUS! I prefer to come here around noon so I don't have to suffer in this dimly lit and over-packed bar at night. If it were closer to where I live, I'd definitely come here more often!"}
{"text":"Love this place!!!  Food is great.  Prices are reasonable.  Atmosphere is awesome and a great location/area to hangout in.  Been coming here for years!  Highly recommend people to try out their breakfast food.  Wow...I still crave their food after all these years..."}
{"text":"since the first time I had gone here I have been a huge fan!! their drink choices are good, and student salary friendly.  the nachos are heavenly, and cater to my vegetarian needs!! they even have DAIYA!! which was a very pleasant surprise!! these nachos are loaded with all the goodness I need and always satisfy!! just sensational!! they also have other options which I hate to admit, but I have not yet tried them out!! I am big on atmosphere as well and I had loved it from the beginning! the student and young adult crowd is always bustling and friendly!! on occasion there are not enough seats, but they now serve upstairs as well! the music is always entertaining, perfect mix of music for my musical tastes!! I have been there multiple times in a single week!! (unhealthy I know, but it was Christmas time)!  all in all cannot get enough of this place! highly recommend!!"}
{"text":"Total dive bar, if that's what you're into.  Good atmopshere, mostly younger people. The Kings Crown Nachos are the best nachos in the city.  The rest of the food is average Tex Mex at a mediocre price.  Sooo... 4 stars for the nachos, 3 stars otherwise.  Average score, 3.5 stars."}
{"text":"Lovely veggie burger and fries. Good location. Big portions."}
{"text":"great place to hang out and join canadian mousehead lager (of course other brands as well). don't miss the home made burger wih a 6 oz patty (d-e-l-i-c-i-o-u-s) and chickenwings with hot sauce (fab)! bonus: lovely staff!"}
{"text":"I decided to try Sneaky Dee's because I heard so much about it. However, both times I went I was not very impressed. The atmosphere and decor is awesome, probably the best thing they have going for them. The food and drinks however were pretty bad. The first time I went I got an appetizer and enchiladas. Basically, all of the food lacked FLAVOUR. Barely ate any of it. We just wanted to leave. The second time, I went for late-night drinks with a friend because I thought, hey, they probably cant mess drinks up too much. Besides not having a drink menu (??), the drink we ordered, a strawberry daiquiri, was weak and you could barely taste the strawberry! What this place needs to focus on is bringing the FLAVOUR, for both drinks and food."}
{"text":"Huge, huge, HUGE fan of this place!  Living in Little Italy has meant this place is now becoming our \"go to\" drinking hole and the BEER prices are befitting of a British pub - something that is tricky to find in the T.O.  Where the FOOD is concerned, this Mexican eatery is a dark horse. The portion sizes are quite simply humongous and I'm told by trusted sources the Nachos are the best in town. My favourite food item...the fajitas. On a Tuesday they're half price and good to share.  Package this all up with an atmosphere that's second to none and you see why I'm back here at least once a week."}
{"text":"Sneaky Dees is really something. When I was 20 and first moved to Toronto, these were the kind of places I LOVED.  Gritty, cheap and full of interesting people, with a lot to look at and general loudness.   Fast forward a decade and Sneaky Dee's remains covered in graffiti and stale beer and while I usually go to \"fancier\" places the overwhelming nostalgia brings me back every so often.  Out of all the Scratched-tables-college-kids-cheap-pitchers-no-wine-on-the-menu-super-popular-iconic-hole-in-the-walls in Toronto, Sneaky Dees by far has the most decent food. Its GOOD even. And where else can 3 girls, one platter of King's Crown nachos with half a side order of extra chips and guacamole stuff themselves silly by sharing? (for about $16)  If you are into domestic draft beer, a MAMMOTH platter of nachos and 60oz will set you back $20, an extra $3 for better beer and $5 for Keiths. I chose a bottle of Mill st Organic, which shock-and-awe came to $2 and change. For wine drinkers please note, the conversation about the wine list went as follows. \"Do you serve wine here\"  \"Yes\"  \"Oh Great, What Kinds do you have?\"  \"White, its from Greece.\" \"I'll have a gin and tonic\" (which was under $4!)  Service is mediocre, she forgot things constantly, but to be fair it was rammed full of college kids so its understandable. And boom! its cheap.   FYI --  Frijoles are re-fried beans.   One Full Extra Star for having drink prices circa 1998."}
{"text":"Everyones favourite late night place to fill their stomachs with some cheap delicious food to soak up the booze they drank before hand.  A huge variety of Mexican dishes that would please the pickiest of friends.  The vegan nachos are my go to dish, followed by their yummy vegan cupcakes.  The pumpkin cupcake is probably one of the tastiest treats you will ever have.  The drinks are really cheap, steer clear of draft beer.  I've always had really good service there, but depending on when you get there you might have to wait for a table to open up.  Open way late into the night  Sneaks is the perfect place to end or start your night."}
{"text":"I'm going here every time I'm in Toronto from now on. The perfect tex mex dive bar.  Service was 4 stars and only partly because the server was flirty and delightful. Bathroom graffiti 5 stars. (all other graffiti 4 stars) Nachos 4 stars because they were soggy but also delicious. Hot sauce: all the stars in the sky. We've almost finished out bottle of Sneaky Dee's jalapeno hot sauce and we're super pissed that we didn't stock up while we were there. Ambiance: 3 stars because the patrons weren't dive bar-y enough. Hipsters."}
{"text":"Sneaky Dee's is a classic grungey place to get together with friends. The King's Crown nachos are some of the best nachos in the city. Beer is cheap. Bring a group of friends and hang out."}
{"text":"Not much to add here that hasn't been said.  We stopped in for lunch on a Saturday.  Great space with graffiti over the walls.  The staff is tattooed, friendly, fast and rocking.  Music over the PA was a good mix of indie our afternoon.  The portions are huge.  We split the Kings Crown Nachos amongst three.  We made the mistake of also each ordering an entree, by the time we polished off the Nachos we were each so full that we all ended up taking our entrees to go.  My friends had the huevos rancheros and a taco, enchilada plate.  I had a fried egg sandwich.  All were solid.  This place is just cool.  Would love to come back here on an evening."}
{"text":"Love this place! great vibe and cool interior."}
{"text":"Sneaky Dees is one of those places with fantastic food and fantastic atmosphere! It's tex-mex food is delicious, with very generous portions!   The setup gives it that perfect lovably worn-down look, with super friendly staff. If all that wasn't enough to convince you to stop by, you can always check out the super cheap concerts they hold on their upper floor..."}
{"text":"Awesome Atmosphere!  This place has great service, so much better than the crappy Supermarket on Augusta Ave."}
{"text":"Amazing staff.  Great prices.  Food portions are crazy generous. A+ on all levels."}
{"text":"Wings are great. Nachos are pretty good. Drinks are cheap. What's not to like. Maybe just that buzzer sound?  Upstairs is a good venue, too."}
{"text":"I've been here twice and it is definitely a place I'd go back to. They have great Tex-Mex food and the beer isn't too expensive. The quantities that the food comes in is more than sufficient. I've shared a burrito with my girlfriend and it was enough to satisfy both of us. The beef burrito is definitely better than the chicken one.  I've never been to it but apparently they have a music hall ontop of the main restaurant area."}
{"text":"I really like Sneaky Dee's, its cheap, has great specials every day of the week and yes, it does have some of the best nachos in the city. Sneaky's might look a bit sketchy from the outside, but inside  the vibe is realy cool and relaxed, and you really can't get better tex-mex food for so cheap anywhere else.  And nachos and beer are not all they offer, they also have their \"combination plates\" which are tacos, burritos, and other tex-mex staples and all come with rice, beans and salad. The servings are HUGE and the prices are LOW. As a total bonus, vegetarians can also enjoy this awesometastic place, as they have several choices for those who do not participate in the compsumption of innocent animals.   The service is decent, nothing worth writing home about, but it is prompt and friendly enough. The only negative thing I can say about Sneaky's is that the last time I ate there, something definetly did not go down well. Consequently I spent the entire next day feeling ill and making constant trips to the bathroom. Call me crazy, but this incident hasn't managed to turn me off Sneaky's."}
{"text":"Just what you expect from a two level bar covered in graffiti. The food is good enough, the beer is cold enough, the service is friendly enough. If you expect more, you want too much. A fun place to hang out, but it does get very busy at times, and can be hard to get a table. I'm not the sort to wait in line (It's not THAT good, but few things are). The nachos are really good, depending on who you ask. If you want a noisy bar with tons of character, you found it.  Also, there are ample vegetarian options, which makes going there stress free."}
{"text":"GENERAL NOTES Angela's right, this is the punk rock bar of Toronto. Shows upstairs, crowded bar/restaurant downstairs, obligatorily graffiti-laden bathrooms downstairs. Cheap pitchers of slightly warm beer and a limited menu. Lots of black and pink but also plaid and denim. However, for such a \"punk\" bar there's no danger of you not fitting in. Unless you're wearing a sports coat.  MENU RECOMMENDATIONS Nachos. Years ago I was told by a regular either \"don't order anything that could be made bad by having the ingredients just sit out for hours\" or \"don't order anything you couldn't make drunk\". Either way, I haven't yet ventured past the nachos yet (which are usually very good) but have recently heard good things about the food. I know I'm willing to take the chance, but are you?  SERVICE NOTES This is one of the best things about Sneaky Dee's - I've always been able to get another pitcher very quickly. They seem to know their crowd (young, impatient drunks) and cater to them/us well.  LOCATION NOTES SE corner of College and Bathurst. Street parking or green P on the SW corner.  HUMOUROUS STORY I once wore a sports coat to Sneaky Dee's. I felt like a douche."}
{"text":"Excellent petit restaurant sans prétention où l'on peut manger du pseudo-mexicain à un prix abordable. Bruyant, souvent plein à craquer le week-end, au carrefour de deux lignes de tram, c'est un lieu de rendez-vous pour ceux qui ont besoin de caler leur estomac avant ou après une soirée de beuverie."}
{"text":"Been here a few times for food. I usually skip the line and head to Crown and Tiger for late drinks. Really good Tex-Mex menu with lots of choices and reasonable prices. Our server was super friendly and personable. I'll be back for sure. My ONLY complaint is that I ordered a bottle of beer and it arrived kind of flat, as though it had been sitting in the fridge with the cap off for a while. Awh well, still a good place to go!"}
{"text":"PROS:   Vegan/vegetarian friendly  Great place to take visitors as it is unique   The nachos and vegan cupcake (I doubt the cupcake is made in-house)  CONS: Terrible service, like really bad.  I am server and I would never treat people the way some of the staff does there.  Once my boyfriend and I were told to seat ourselves by a bartender and then when we had a server yell at us for it and mentioned there being a sign in the front about being seated.  In their defence it was very busy so maybe the staff wasn't communicating properly.  BUT you should never be rude to a customer, I mean unless you don't care about making money.... but then why are you a server?  Besides that it's generally poor service.  When I think about it the only time I can say with confidence that the service was good was when a bartender served us at our table.    The food.  Unless you're sticking with the nachos beware.  Once I tried the veggie-friendly breakfast and it looked like pile of garbage stacked onto a plate by a 3 year old.  Not only did it look messy and sloppy is tasted terrible.    Noise level.  Don't expect to hear what anyone is saying.  Overall, it's nowhere that I ever feel like going to.  I would love to go there even just for coffee and cupcake but my last experience with the staff left a bad taste in my mouth.  I would however take someone there if they haven't been before because it is unique for many reason, good and bad."}
{"text":"One time I went here with a girl who was the drunkest I've ever seen anyone. The bouncer asked \"how many drinks have you had tonight\" and she replied without thinking, \"oh, three of seven.\" After being refused entry and her staring off into space for a minute we went to McDonald's at Bath and Dun. DunBath.   Another time I came here was for shake a tail and it is a better shake a tail than Clinton's because there are more people and everyone is cool and wears cool clothes and doesn't smell or notice when I grind up against them. Much better vibes all around. It really is the pleasure dome."}
{"text":"Restaurant: Sneaky Dee's Cuisine: Mexican Location: Kensington Market Address: 431 College St Price Range: $10~15  1: Poor 2: OK 3: Good 4: Very Good 5: Excellent  Food: 3  Service: 3  Ambiance: 4 Overall: 3.5  Extra information:  * Open for lunch and late night * Breakfast on the weekends * 1/2 price fajitas on Tuesdays  I first experienced Sneaky Dee's when I attended the first Chicken wing festival of Toronto couple months ago. There were around 5~6 different wing places that participated in the event, and Sneaky Dee's happened to be one of them. I really enjoyed their wings and the special dipping sauce (it's magic!) so I've been meaning to check out the actual restaurant for awhile.  Finally on one day after work, I decided to drop by for some wings & nachos.  I always passed by Sneaky Dee's when I drive in downtown and realized how colorful their restaurant is. It's located on the corner of College and Bathurst so there is no way you can miss it.  Once I walked in, my eyes were almost blinded by so many colors popping at me from every direction. There is no one furniture in the restaurant that wasn't painted in bright, happy design- I love it!!  This is def a laid back, fun place to hang out after work with your friends.  Ordered: King's Crown Nacho 4/5  * Tortilla chips with salsa roja, frijoles, ground beef, tomatoes, onions, pepper, jalapenos, cheese with guacamole & sour cream for $15.95 * This is one of the biggest nacho I've ever seen in my life * Can be shared between 4 or more people if just sharing between drinks * There was so much guacamole & sour cream on top * I sort of wished the dips were on the side because everyone in the middle was getting very soggy * Entire plate was covered in cheese and it was gooey and hot * Very messy to eat but hey, who uses fork to eat nachos?  Ordered: Medium Wings 3/5  * Ordered Sneaky style served with avocado sour cream dip for $17.45 * Added side order of french fries for $2.80 * Honesty I was kind of disappointed with the wings * They were not as good as I remembered them to be at the Wing Festival * The wings I got were kind of cold and the meat was very tough * It almost felt like they were deep fried couple hours ago * Avocado sour cream dip was still delicious  Summary: Fun place to hang out with friends over food and drinks. Nachos are ginormous and a must get when you drop by Sneaky Dees. Everyone in the restaurant was having beer and nachoes, if not wings- will come back for drinks if I am in the area"}
{"text":"This is my second home.  Love the staff, the management, the food, the theme nights, and the drink prices! I'm a regular here so I always feel so welcomed and it's just the most unique dining experience. I always suggest my friends and tourists from out of town to stop over to Sneaks to try their famous nachos.   VEGGIE NACHOS 4 LIFE."}
{"text":"Sneaky Dees has the best nachos in the city, I recommend the kings crown nachos they're my personal favourite.  If you're craving mexican food this is tje place to be. Theyre tex-mex style mexican not authentic if thats what you're hoping to get but Tex-mex is good when you're in the mood for it. Thier plates are great and they have weekly special that you should watch out for. I love the fajitas and when theyre on sales theyre a great deal.   If you've ever been to Fernados Hideaway sneak dees is just a much better version of it. The crowd is a mix of locals mostly hipsters and music fans. Sneaky dees always has good bands playing in the evening. They're also know to have great breakfast and brunch.   Sneaky dees is one of my favourite places in the city. I recommend coming here to crush your tex-mex cravings. Cheap drinks, good music and friendly staff what more could you want."}
{"text":"A great dive-bar in the city! There's a reason why it's been around for 20+ years. There's always cheap beer and food specials each night of the week.   Over the past several years, the vegetarian menu has been growing to include several vegan items, including vegan cupcakes! One of the newest additions to the vegan menu items is the vegan burro favorito. The non-veg burro favorito is probably the best thing on the menu (It was my favorite when I wasn't veg).  I don't live in the city anymore, but this is the only place I miss in Toronto!  If you're visiting, go and experience what no other place in Toronto can offer!"}
{"text":"This place has you covered! Amazing breakfast, lunch and dinners. Really really amazing. Cheap drinks, great tunes, fun staff. Upstairs you've either got a great concert or a quality opportunity to get loose. Start your night, end it or recover the next day...this is the place to get it done in Toronto."}
{"text":"As a tex-mex/mexican/calexican enthusiast let me just say; King's Crown. Best nachos in town. Go try them now!  Also, 3 dollar jager shots and (selected) beers on Wednesdays! Love it! (well at least it was a year and a half ago when I could go partying on Wednesdays)"}
{"text":"Sneaky Dee's came highly recommended from a friend, so a few of us decided to check it out.  The drinks are reasonable priced, and this bar has better food than many of the restaurants I've been to. I would recommend the King's Crown nachos, and the Texas Egg.  Both the decor and music are punk-rock themed; there's \"graffiti\" on the benches and in the washrooms, and it all fits well with the theme. My only concern would be that they're a bit understaffed at times. This didn't take away from my experience too much, though. I really enjoy this place, and have a perpetual hard-on for it."}
{"text":"Classic dive bar with great nachos, atmosphere is so, so mostly university/college students. Service is hit or miss it's either piss poor or alright from my experience. Great place to go to get food and drinks to end or begin your night out."}
{"text":"DELICIOUS and huge plate of pulled pork enchiladas. Boyfriend got the fajitas and they were top notch too.  Service was meh, waitress kept taking off before the order was even finished. Love the everywhere-graffiti, I'm sure it's not to everyone's taste though.  I really should be back here more often."}
{"text":"Ok so mixed emotions about this place.  Food is ok if you like Mexican.  Generous portion sizes.  Atmosphere is pretty hip.  Here is what I don't like.  No debit...seriously what restaurant doesn't accept debit.  Oh but there's a cash machine on site...  No splitting of cheques.  So you and a buddy go for dinner or drinks...one bill only.  Makes it crappy if you each need to pay by a bank card or credit card.  Lastly no soda refills.  They'll gladly sell you another but despite having a fountain pop machine they don't offer any refills.    All in all I will probably avoid in the future."}
{"text":"I have been to Sneaky Dee's on a few occasions and the nachos do not disappoint!   On my last visit, we had the vegan nachos and they were so good! With a generous amount of toppings, Daiya cheese, salsa and guacamole, they were very tasty. My three star rating is for the nachos and only the nachos!  We had another dish similar to the nachos but with fries as the base and it was so bland! For that dish, Sneaky Dee's gets two stars.   Be forewarned, get the nachos!"}
{"text":"I came to Toronto on a spur of the moment trip back in 2012 and found this place! My friend and I didn't get any food because it was drinking time. Sat at the bar and my buddy started shooting the shit with the bartender who was a Football (Soccer) fan and he bought us a round of shots. After about 20 minutes we made some friends at the bar and kicked it with them. A few drinks later we ended up going up stairs and kept the night going. Not too expensive, great friendly atmosphere. It was Hipster-esque, which made for a decent party crowd. I had an awesome time! Always my first place to go when in Toronto! Coming back the end of August!"}
{"text":"Sneaky Dee's is a bar/restaraunt specializing in mexi-cali/bar type fare.  The food is good and reasonably priced.  It wouldn't stand out as the best food you've ever had - but it serves it's purpose: cheap, cheerful and tasty.  The chicken wings are huge and most of the mexi-cali items I've had have been tasty with generous portions.  The interior of the restaurant is covered with the graffiti of those who have been there prior and I don't think it's seen a renovation since it opened.  It's clean - however old, dated, and worn down.  This \"characteracter\" is probably intentional - but none the less a little sprucing up can go a long way to get a 4-star review vs. a 3."}
{"text":"Understaffed AF. All servers are constantly busy, we sat down 15mins before getting water, and another 15mins before getting any attention"}
{"text":"This place is legendary for its nachos. Legendary as in people talk about it all the time, but frankly I find that it's overrated. I will say though, they definitely don't skimp out on the toppings for nachos which I appreciate.  However, service is usually lacklustre.  But if you're here drunk, who cares?"}
{"text":"I went there for the 4th time last night, Aug 27, 2015. And Sneaky Dee's never lets me down.  I usually go for the nachos and the atmosphere is always lively.  I wish they had a bigger beer selection but that's just me being picky. The options they have are still good to choose from."}
{"text":"Sneaky Dee's is THE place to go for nachos in Toronto, hands down. It might not look appealing from the outside (to some) but you'll change your tune after the first bite.   I'm a vegetarian, and although I can't make friends with salad I certainly have picked up a few with the vegetarian Kings Crown.  Wednesday night is the Kings Crown + Pitcher special. If you're going to try their nachos, I highly recommend starting with Kings Crown (you'll never go back).   Don't worry vegans, they offer victimless nachos for you too :)  For all you beer lovers, there is a great selection to choose from (bottle and tap).   I *heart* Sneak's."}
{"text":"Must be into rock and roll to absolutely love this place.   The atmosphere is like no other. You'll always run into someone from the music scene here. Open 24 hours and can satisfy any craving. The breakfast is amazing, nachos and lunch is great, it's an a awesome place to drink, and is great for a late night greasy meal.   Good beer selection, their house hot sauces are great, the staff are friendly.  Favourite dish: the burro favorito. BUT, get gravy on top instead of salsa."}
{"text":"Never ate, only speaking from a bar perspective -- but this will always be a favorite staple stop on one of our many trips to the city."}
{"text":"Quiz night at Sneak Dee's (every Wednesday) is simply awesome.  You need to get there early (I'm talking 6:30-6:45 if you want a table). There are 6 rounds each with 10 questions.  1. Pictures 2. Questions (Winner of 1 and 2 gets free food)  3. Questions 4. Questions  (Winner or 3 and 4 gets free food)  5. Questions 6. Music  The top three overall winners get Sneaky Dees money to help cover their tabs.   Beers are only $3 on quiz night and the nachos are cheap too. It's an unspoken rule that you have to come up with a funny team name. The questions range from everyone can get this to only your smartest friend will know the answer and most of the time you can reason the majority of them out.  CASH ONLY. ID's required. Check it out."}
{"text":"Sunday nights are indie nights, live independent music, often quite astonishing - packing the upper place to the brim.  Inside below is your typical, but here, well-respected late-night tacos and beer kingdom."}
{"text":"Fish tacos.. not your typical fish tacos.. but were nicely toasted, crunchy, and gooing with melted cheese.  Enchiladas were subpar.  Mexican rice, beans, and salad were decent.  Overall average place.  Did not get a chance to go to the second floor for Wednesday trivia night (starts at 7:30pm!) since all the tables were full by the time 6:30pm rolled around.  So if you're looking to go to trivia, get there at least an hour early!  Perhaps would have been a better experience with trivia - will find out next time!"}
{"text":"Local joint that serves Mexican style dishes with bold flavours.  Came by Wednesday after work to enjoy a ginormous serving of nachos and a pitcher of sangria (red) between my friend and I. We obviously struggled to finish the nachos but no problem finishing the sangria (although not that great - one does not say no to alcohol!). I would come back to try their other items and check out their nightlife."}
{"text":"I really really liked Sneaky Dee's!   I shared a giant plate of nachos with two co-workers, along with two appetizers, and a pitcher of beer, and we all left feeling VERY VERY full!  The atmosphere is really laid back, and they have graffiti all over the place - walls, tables, etc.  They had standard beers available."}
{"text":"It's a little silly that for all my yelping over the past year or so that there are institutions that I have yet to visit. Simple places, famous for simple, yet amazing, regular items. In this case it's sitting down a the bar of this dive-y University/College friendly (apparently Mexican) establishment, and going to town on a plate of their famous Nachos!  Our tatto'd, surely and amazing bartender (slash new best friend) Jay, gave it to us straight when we asked what to have, his simple statement \"we were built on chos...\", followed by sideways glance and walk away, told us that we had better smarten up and order what he told us to.   Jay did not lead us astray, in fact we relied on his wisdom to guide us through this difficult decision and he advised us that we take on the Cactus in the Valley Nachos with chicken. He sold us when he described it as a \"goddamn fajita on a plate... and the chicken is done in a sauce that will change your F%^in life!\" OK good sir, I hear your argument, I will now investigate.  ORDER UP!  Two pints of local Ontario craft beer in, we were noshing on nachos at a rapid pace. They were DIVINE! Anyone who knows-chos-knows that to execute the perfect CHO, one must have a layer of chips, topped with layers of cheese and toppings (Now Bake it), and repeat. Then to add a little something extra you load the top with a bowl of guacamole and sour cream. SD's is the first place to do this top to bottom, layer to layer. All other nachos should bow down and die in shadow of the Cactus in the Valley. Aces... Aces!  Aside from the food, I love the look and feel of this place. The tables are carved up from patrons, the walls covered in graffiti and the beer is always flowing like wine **. Sneaky's is comfortable being exactly what it is and you instantly feel at home from the moment you walk in.   Jay works days at the bar, he's an avid conversationalist, I totally recommend you go say hi to him from the Yelp guys. He's swell and his reco's are stellar!! ________________________________ ** Dumb and Dumber reference."}
{"text":"Sneaky Dee's is by far my favourite bar in Toronto!  I'm more into dive bars instead of more upscale lounges, so I love Sneaky Dee's look.  Graffiti is everywhere, not only in the lady's bathroom stales, and for that reason, it gives off such a laid-back atmosphere.  With a couple of pitchers of beer and a gang of good friends, this makes for a perfect Friday night hang out."}
{"text":"Had heard of this place through word of mouth, not to mention passed it dozens of times when in the neighborhood, but had never gone in.  This particular, GORGEOUS Tuesday morning in March, a friend and I were on the hunt for Mexican using the GPS in her car.  Traveling east on Bloor from Etobicoke, we'd stopped at two that showed up on the GPS, only to find them both closed that time of day.  So driving aimlessly, we got to the U of T area and I remembered to stop into the Mexi-can Market (a small grocer with imported Mexican stuff).  While in there, we decided to check out Sneaky Dee's.  It is what I expected from the outside.  It isn't dirty, but it's a dive.  Not much light inside, but enough natural light flooding in from the street.  Tables & booths covered in marker from people scratching their initials into everything.  A bunch of random junk on the walls and above the bar.  Service not exactly the best either.  After asking twice, for water, the waitress made a grunting \"huh?\" sound, which seemed fitting with the atmosphere.  lol  However....the food = to die for.  Great selection with lots of vegetarian and vegan options as well.  The place is most famous for their nachos, so I will have to go back for those soon.  This day I just wanted breakfast.  Delicious avocado spring rolls to start, and no, they are not breakfast, but we got them anyway.  (two sliced in half, but a decent size, so for two people to split, would just tease the tongue).  I couldn't decide between three Mexican dishes, so ordered it customized and ended up with a fried egg on top of a big tortilla, with rice, beans, salad, guacamole and salad.  Mushed together it looked gross, but was fantastic.  A ton, so couldn't finish it and had the leftovers hours later.  Great prices.  I will be back."}
{"text":"I love Sneaks, but definitely don't go there enough! First time there my bro took me for vegan cupcakes on my birthday, which totally made my life. Between that and the vegan nachos and cheap beer it was a fantastic birthday meal!  More recently I went there with friends for brunch, we each got the $3.25 breakfast meal and split a pitcher of their Buzz Amber (think that was the name, it was a darker hemp based beer which wasn't spectacular, but decent enough). The bill came to $23 including taxes.   Also loved that we showed up tipsy before 2pm and we're a bit rowdy and still managed not to be out of place. Our server was really nice, everything came quickly and was delicious. Overall no complaints!"}
{"text":"I love this place when I'm sober.   I love it when I'm drunk.   Give me all your beer and nachos.   We can be best friends forever.   There's nothing like my Sneaky Dee's."}
{"text":"GET THE VEGAN NACHOS! They just need to get some Daiya cheese to add to the recipe but they are delish as is too. It's dark af in the restaurant but the outside patio is lovely."}
{"text":"The food here is alright. They give you huge portions. The service is great. The downside to this place is that if you have a group of 5 you will be charged the service tip of 18%. They also do not split bills so you have to sit there and calculate how much each person owes which is a headache when there are 5 people. I cannot imagine coming here when I am drinking and having to figure that out."}
{"text":"Sneaky Dee's est un bar avec au rez de chaussée un service de restauration type burger/nachos et un étage avec un énorme bar et scène pour les concerts. J'y ai été un lundi soir ce qui correspond à la soirée Karaoké : on choisit sa chanson dans le classeur et hop quand on vous appelle c'est à vous de donner tout ce que vous avez sur la scène. L'ambiance est très sympa, détendue et relativement jeune et internationale.  Choix de bières correct et service rapide."}
{"text":"I came here for the cheap drinks and nachos after cruising yelp reviews. $5 long island iced teas and $6.50 for margaritas and frozen daiquiris. Nachos albeit super unhealthy were good and very very filling for the price ($13.00 with extra toppings included). One plate of nachos is more than enough for two people as a meal. My friend and I shared a plate and couldn't even finish it, and they aren't stingy with the toppings. Service was good as well, but the music's pretty loud so be prepared to speak at a higher volume than normal."}
{"text":"Oh Sneaks- What memories I have from this place. From dancing and singing my heart out upstairs to eating brunch with my Dad downstairs I can actually say I have experienced it all here.  This was THE place to hang when I was in university. Cheap-ish food and drinks that always make me super full and happy by the end. I know everyone recommends their nachos-and don't get me wrong they are some of the best I've ever had( esp. because you can get Daiya cheese on them now yay!) but go for the Breakfast/brunch here. Best hangover decision you will ever make. The salad/rice/beans sides alone save me every time.   The crowd is always changing here too. You never know who you will see at Sneaks! My advice is if you haven't been here yet you totally have to try it out because it is, in my opinion a 416 staple."}
{"text":"My go to bar in Toronto for a casual night with friends in the city. Love the punk aesthetic, nachos and drinks are cheap which, who doesn't love?"}
{"text":"What can I say about Sneaky Dee's that already hasn't been said?  Probably nothing! :)  I can reiterate however, about how amazing their King's Crown nachos are!  Huge massive portion (3 of us shared it and couldn't finish) They just pile everything on top and it's DE-LISH!!  Great dive bar, love the ambience and the staff are very attentive and cool..... awesome place to get some late night munchies, their kitchen is open until 4am :)"}
{"text":"The Good: THE NACHOS! Wow, that plate is massive! And their poutine is the ultimate in pairing it with their cheap cocktails and beers. When you're knocking back that many bottles, better make sure your belly is well cushioned with some deep fried yummy goodness. All the dishes are big portions so be prepared.  It's loud, but creates a fun atmosphere. You'll find yourself yelling over others especially on any Thurs, Fri, or Sat night. They are packed for sure! Get there early if you want to get a good seat.  Servers are always nice and friendly.  The Bad: The washrooms are somewhat clean, but you wouldn't even think of that when see all the gravity plastered on the walls. Yes, it does give it personality, but you can only handle all that writing and color when you are sufficiently inebriated.  The Overall: It's a classic Toronto hotspot to hit up. You're not a true Torontonian if you haven't at least come here once.  Revisit: I'll end up here whether I plan to or not. It just has a way of attracting you when you're just looking for a place to hang out with friends minus the pretentiousness that other bars on the street may have."}
{"text":"This place is proof, you don't have to be good, you just have to be consistent and reliable to build a following and survive.  I use to be a bit of a regular here with my neighbor Chris. Back in the day when I cared less about nutrition and quality and  more about quantity and price.Nothing has changed in the many years I have dropped into this place. Same dirt on the walls. The pictures of the Nachos look good, I must return again and give them a try. I'm a follower but not a regular.  Everyone should go here at least once."}
{"text":"Very Hit and Miss!  We went for lunch around 2pm, it was not busy and the service was horrible.  The food was fairly priced for the taste.  Make sure you order something with Mexican influence, because anything else is very very very average.   I must say the only thing good about this place is that it serves an inexpensive breakfast, Amazing nachos, and the delicious buzz beer.   The atmosphere is open, casual, and carries very late-night party bar feel -- no matter what the time.   The only reason I would go back to this place is because of the Nachos.   Very Hit and Miss!"}
{"text":"Ok, I admit I got lured in by pictures of their nachos but this was one of the best decisions I've made in a long time! Even in a completely sober state, I thoroughly enjoyed every bite of that huge heap of chips, beans, rice, salsa, sour cream, guac, etc.   We ordered the Vegetarian Cactus in the Valley Nachos to share. That thing is huge - you can probably share it amongst a group of 4 people! I just wish it hadn't been so spicy, as the heat took away from the other flavors in the dish. Also, the broccoli and carrots taste pretty weird in nachos, I pulled mine all out. My favorite part about these nachos though was that guac is a right here, not a privilege - other places need to come here learn how to pile on the guac!   Do I love their nachos? Yes. Would I come back here? I'm not sure. As a student, if you can handle the vibe of a dive bar type place then sure. As a working professional, I'd only come back here if I was really looking to get smashed, or craving nachos."}
{"text":"Won a CBC radio contest to see the Sheepdogs for a live show taping at the Dakota and decided to finally hit up Sneaky Dee's to try the world famous nachos after the show. Was kinda surprised to see a line up at 6pm on a Saturday but it moved pretty quickly. Place was jammed and you could just feel the energy bouncing from every corner of the room. Great vibe - a bit loud but it suited the ambiance. So yep i ordered the Kings nachos or something like that and wow I have to say I was impressed!! All day Sunday I kept fighting the urge to go back for more! The girl said they were great but she's not as easily impressed I guess and suggested we try a different variation next time... But I give them a 10/10... Don't miss out!! Our sever was a pretty stylish young thing and was very accommodating and helpful."}
{"text":"This is the ideal trash bar. If you are in the mood for the ultimate last call nacho feast go here.  Tips: Kings Crown nachos for meat lovers and Mediterranean nachos for vegetarian babes are the ways to go.  They do a sours special, I can't remember which day, but it's a whiskey and bar lime, which I'm honestly down for, just don't expect shaken egg whites and bitters, which, I mean why would you at a bar that's literally coated in graffiti. I mean this in the most fond of ways.  Have your ID ready when you walk in, because there will be a bouncer at the door at night and you should just make both if your lives easier. Im pro bouncer at the door. Bar service is way faster that way."}
{"text":"Hmmmmm, disappointed about this place.  Nachos were a weird mishmash of ingredients with rice and did not feel or tasted like nachos, I ordered a quesadilla that barely had cheese and had tons and tons of onion instead (also onion was a bit raw and not very flavourful). My friend ordered a burger but it was so dry that she needed three bags of ketchup to be able to swallow it (and they charged her an extra dollar for it).   Beer and shots are OK.   Also they do not let you split the bill, which is weird."}
{"text":"The place is loud, definitely for the college & university age. Huge portions of food. Drinks all over the place. Went there on Saturday night at 11 PM. The place was packed. You can try it once but I am past that place for my age"}
{"text":"Even before I moved to Toronto, I heard that Sneaky Dee's was something of an institution, known for grungy music, grungy interior, late-night service and gargantuan portions of Mexican grub. I'm glad to report that it delivers on all these promises. The decor is like something out of the mind of Ralph Steadman, the ambience is totally anything-goes and unpretentious, the staff are friendly and there's a small patio available that lets you peer down toward the cafes of Little Italy. It's a dive, but it's got its own unique vibe among the myriad of eateries on College.   Though I haven't sampled the much talked-about nacho platters (does anyone dare to challenge Merlin's nachos in Whistler, BC?), I was impressed by the breadth of the menu. The food is classic diner fare mashed up with Tex-Mex classics. There are a decent number of vegetarian and even vegan options available. One menu tip: the avocado spring rolls are delicious! I expected wafery little Chinese takeout style things, but these are big, flaky, crisp guacamole-and-jalapeno stuffed marvels with a tangy sweet and spicy sauce. There's sadly not much available on tap - Amsterdam's Big Wheel amber was the only thing that really piqued my interest.   If you're going to come here, come hungry. They are not lying when they say that the burritos are \"grande!\" My meal was big enough to eat half, feel satisfied and save the rest in a takeout container for tomorrow's lunch. I can't argue with that as a value proposition - you get a decent salad and a side of saucy rice too! For those who are undecided, Dee's offers combo platters with mix-and-matchable burritos, enchiladas and tacos, all smothered in cheese and sauce. The vegetable options are quite good - you get hearty chunks of peppers, tomato and lots more - but for carnivores I'd recommend the pulled chicken fillings over the beef, which was slightly dry by comparison. There's hot sauce available to season things to your liking.   If you don't mind things on the loud and dirty side, and if you want to be able to pay relatively little, eat a whole lot, and have decent food too - and maybe even catch some live music while you're at it - Sneaky Dee's delivers."}
{"text":"You know when someone says that you are heading somewhere and you automatically feel you need a shower... well this place is that for me... (mainly the upstairs).  Anytime I've seen a show upstairs it's usually because either a friend is performing or it's someone's birthday and this is how they chose to celebrate. This was the case on Friday night... The music was loud and dirty (for lack of a better word) but it was packed.   My BF and I took all of the hearing loss we could handle so we headed downstairs for some late night eats... I would definitely say for great late night eats in the city.. this place is pretty top notch.. you can get anything from mexican to good ol' poutine... And with lots of seating, your wait time is minimal."}
{"text":"Had the fish burrito that came with rice and and a side salad.  The burrito was huge but very bland and flavourless.  Maybe I should have gone with the nachos as everyone keeps raving about them.  Oh well, maybe next time but I won't be rushing back."}
{"text":"I'd heard about the nachos at this place from EVERYONE, so maybe I had high expectations, but they were just OK, Americanized nachos. Unless you're really into the dive bar scene, save your money for somewhere else."}
{"text":"Here on a trip..I'm from Chicago..where the Mexicans and mexican food are plentiful. This place is one of the worst Mexican restaurants I have ever been to. No Mexicans in this city = bad Mexican food. Don't come."}
{"text":"This rough and tumble place can be a bit intimidating to the uninitiated, however it is Toronto landmark. for a good reason.   The atmosphere is authentic, the food and drink good and reasonably priced.   The crowd is grungy but varied.  The place is loud.  It is not a good place for a quiet romantic conversation, rather a good stop on pub crawl or place top go for night out with a raucous group.     I do not know how the waiters and bartenders manage to function over the noise, but they do it with an admirable degree of efficiency.    The Tex -Mex food is good, the  Maragitas properly done."}
{"text":"Thank you for existing Sneaky Dees. Half priced fajitas are the best. Shake a Tail is even better. If you go enough times you get used to the cash only, no bill splitting and you prepare for it and eventually come to realize it's really not that difficult. When I take people here from out of town and they don't like it, they're scared of it, they say it's sketchy... I feel bad for them. That they can't appreciate this amazing-ness. But they go back to their characterless-suburbia-comfort zones and I come back with my Toronto friends & we have a great time :)"}
{"text":"Mmmmm breakfast. I made my way downtown to Sneaky Dee's to meet friends for breakfast; I cannot say no to that.  The Avocado Eggs Benny caught my eye and I was sold. It was great! The homefries and their coffee are delicious. Hollandaise sauce was on point.  Service was friendly and quick. It was my first time there, so I was distracted by their busy decor. There is something to read or look at at every angle! From reading the other reviews, I'm having a bit of fomo. ;)"}
{"text":"The house beer is pretty meh, but cheap. The Mexican is super filling and huge portions. I don't know whether I would choose it over the very Mexican places in Kensington market but if you are with a big group and need big protions and cheap beer, Sneaks is a pretty fine choice."}
{"text":"Amazing french toast!! Best brunch in Toronto. College atmosphere (dive bar). Great!!!"}
{"text":"Rating: 3 1/2*   I know this place has been around since the mid 90's, back when I was in university. I have never been here even during my \"younger\" and \"wilder\" days.   My wife and I came over the weekend as we took advantage of being out during the nice weather. The place was fairly busy and we were able to get a booth.   The decor is more of a dive bar. Loud music, posters of upcoming concerts on the wall. Large amount of seats available whether it's at the front of the restaurant or near the back. No natural light available at the back.   Made the mistake of ordering the King Crown Nachos as appetizer as this could have been a meal unto itself. Huge portions along with all of the ingredients in abundance. This was pretty good.   However, we also ordered the Homemade Burger with fries along with the Chicken Burrito. Let's just say that we did not finish these dishes. The hamburger patty was delicious while the fries were average at best. The burrito had generous amount of chicken along with rice and beans. It was a wet burrito style.   Service was decent. There's no refills on soft drinks and menu has a large selection of Tex Mex dishes.   The food is not exceptional but at least they give you large portions of it.  #55 of 2018"}
{"text":"I came to sneaky dee's after not being here in years and had a really good time. The restaurant is brighter, cleaner and seemed much bigger. Perhaps it's because I was only seated in the front of the restaurant years ago. Our waiter was okay and the restaurant accommodated my lactose and gluten free diet.  The waiter informed me that the guacamole had dairy. Then he went to the kitchen to find out what I could order. He returned and told me the chef could make the guacamole lactose free. That gives them an extra star in my book.   They don't really have an extravagant alcoholic menu but I asked the waiter to have the bartender mix Sprite, lemon and vodka. The concoction was perfect. My drink was fantastic.   The one thing I didn't like was that they charged our group 18% gratuity. Out waiter was okay but he would ignore us at times. I would have preferred to choose how much I was going to tip since I think good tips mean good service. I would have liked our water refilled a bit more regularly and some of my friends wanted to place more orders but the waiter was avoiding eye contact with us.   Allover, I would say this is a three star establishment and it has significantly improved since the early 2000's."}
{"text":"Great place to lay back and chill with friends. The atmosphere is friendly with dimmed lights. If you go on a Friday night, they'll have a live concert right above for $20. When I'm in the area and craving nachos, this is definitely the place to be. I usually get the king's crown which is a mean nacho with every toppings you can imagine. This one dish can be shared amongst 3-4 people and actually fill or satisfy everyone :) I enjoy coming here once in a while and will definitely be returning!"}
{"text":"So, I'd heard a lot about Sneaky Dee's through the grapevine, and I finally got to check it out.  First off, I went on a Saturday night, so, as expected, the wait was ridiculously long. We ended up finally opting for a seat at the bar, especially in light of the fact that the tables didn't look all that much more appealing anyway. And it definitely beats eating on the floor.  First thing I noticed was that it was very loud. Again, saturday night packed house, nothing can be done about that. What the hell, my lungs needed the workout. I also highly dig the extra-late business hours.  The place itself is pretty grungey, but seemingly clean. The servers, though running around like headless chickens, were also very cute and friendly.  As for the food...my friend and I ordered the nachos, and I was a little frightened by what I was served. Not frightened due to what it tasted like, it was pretty tasty in fact. I was more alarmed that the sheer size of this friggin' thing was going to flip the goddamn bar over. Seriously, we both ate until we almost burst, and there was still half of it left! The drinks were also served in a timely fashion, and the price was right.  It should also be worth noting that the price of food was pretty cheap, considering the amount of food you get. I'll definitely be back at some point. Next time I'll have to be sure to adopt 17 kids to take with me, and maybe the food will end up being fully-eaten."}
{"text":"Sneaky Dee's has become somewhat of an iconic location in Toronto over the years. It's been around for decades and it's popularity has never seemed to wane at all.  They often host local bands and while the food isn't amazing, it's really very decent. I've always been a fan of their nacho plate which is large and generous with the toppings.  If you're in the area, you can't go wrong. :)"}
{"text":"The servers were generally nice except for one server I had, she asked 2 people at a table of 3 for their orders then walked away.   When I called her over and pointed out the mistake, she literally then asked one of the original 2 what the 3rd wanted instead of asking her directly.  No apology from her at all.  The fajitas are okay.   I love even a common fajita, and this is common.   The chicken or the beef are both completely bland.   After I throw a generous amount of hot sauce on it, it makes for a good meal.  The reason they get 3 stars instead of the 2 stars I would normally hand out for this kind of service/food is that they have nightly specials that are a pretty good value, and some of their servers are pretty cool."}
{"text":"Friends had raved about Sneaky Dee's mainly due to their Kings Crown nachos, which I've had the 3 times I've visited... probably the best thing you can order in whole place. Costs around $20, but it serves 2-3 and is loaded with toppings. The nachos feature a 'crown' of a second layer, which makes essentially doubles the toppings. Don't eat this thing if you are on a date - you'll end up using your fingers at the end!  The drinks are priced well, and I find the specials pretty fair. My only warning is that they don't split bills. I believe we once had a server who offered to split the table, but otherwise, they are quite clear about not splitting.  Yes, it's a dive bar with graffiti covering the booths, but there's plenty of tvs, cold drinks, and a streetcar nearby. The service is pretty decent considering how busy they can get.  If you are serious about nachos, go to Sneaky Dee's!"}
{"text":"I had gone to this place 2-3 times just to chill out and have some mexican food with friends late night. The servers were friendly & the service was fast. I always get the kings crown nachos and its serious. Sneaky Dee's is definately generous with the toppings which make these nachos to crave for. I also get the enchiladas, tacos & burritos and its all good! This is a great spot to hang out after class."}
{"text":"I came to this Toronto mainstay to evaluate two pretty serious claims: that the nachos are some of the BEST in the city, and that the bathrooms are NASTY, but I was disappointed on both fronts because the veggie nachos weren't particularly impressive (my companion pointed out that perhaps the meaty ones are the BEST) and the bathrooms were more Bushwick hipster bar than Trainspotting (clearly none of these bathroom evaluators had visited the pig troughs at The Cambie in Vancouver), but maybe that's because I was there in the middle of a weekday and not on a Friday night when people likely slam gallons of cheap beer and the bathrooms get grosser as they need to urinate more, but come to think of it, I might like to come back here to contribute to that mess because it seems like it would be a good time."}
{"text":"my boyfriend and i were tourists for a day in toronto and stopped at the placed for brunch hoping it would remind us of our favorite spot back home. we were right. there's definitely a \"dive\" type feel here yet everyone was very friendly. we enjoyed our bloody caesar's and both ordered from their mexican styled brunch menu. the food was unique but very very good. i would recommend this as a brunch spot while visiting toronto!"}
{"text":"This Toronto institution serves decent tex-mex as well as a punk/rock'n'roll environment. I've been here several times now and I've had everything from traditional breakfast, to burritos ,to nachos and it's all at least good, and some of it is great. The crowning jewel of this establishment is most definitely its nachos. They are expensive, but you WILL get your money's worth. I've had the King's Crown and the Cactus in the Valley and both superb.   Last time we went we split some nachos (King's Crown) and an off-menu special I THINK was called the Heart Attack or something to that effect. It had soooo many amazing breakfast items! Examples were home fries poutine, the best mushrooms ever, eggs, peameal bacon, sausages and and and!! It was definitely not for just one person, unless that person happens to be a Sumo wrestler. (And hey. Maybe you are. I am not here to judge.)   Despite it being three adults, the nachos and platter were so much food we didn't finish the two orders.   There was also plentiful beer. It was a good way to indulge after some pretty terrible family stuff we've been dealing with lately. I love the decor (so to speak ;)) and I love the service and of course, the food.   I can't speak for at night with the music, but Sneaky Dees during the day is comfort to me."}
{"text":"Good Old Sneakies...you never let me down!  This is NOT the place to take your fancy mother - the decor is otherworldly and the washrooms are scary - although packed with magic marker wisdom.   Rather, this is the place to go with friends for great food, drinks, music and overall good times.  The King's Crown nachos are top notch, and I'm not sure Ive ever had better.  They layer that stuff, so there's no bare chips at the bottom of your pile.  They are all covered with something delicious!  Fajitas are great too....as is the burrito and vegan cupcakes.  This place is tried and true, so of course I'll be back!"}
{"text":"Cheap drinks and a fun crowd make Sneak's a solid choice on most nights. Karaoke on Mondays is fun as hell. The staff are cool too! Score."}
{"text":"Fiiiinally made it in to try Sneaky's world-or at least gta, famous nachos and couldn't have asked for a more perfect plate of them! Had the King nachos and they had everything on them that I would put on my dream plate of nachos. The guac was divine and a definate generous portion. I think it will be tough to find a better heap of nachos in this city.   Had a pretty good selection of local beers which was ice cold and an obvious compliment to a plate of nachos.   Our server was great. Attentive and easy to track down when needed. Love the vibe and cool decor of this legendary establishment. Can't wait to return and would definately recommend."}
{"text":"Great place for late night nachos. Been here for brunch a few times and they've got an interesting tex mex fusion menu but I prefer their classic breakfast (really good hashbrowns and breakfast sausage)."}
{"text":"This past weekend, a group of friends and I were looking for somewhere lively and interesting to end the night. Sneaky Dee's fit the bill. Sneaky Dee's is an eclectic bar in downtown Toronto, that has a pretty heavy hipster feel. No shade intended to hipsters out there. It's just... not normal when you look at the decor. The interior is a mellow colour explosion, with plenty of wall art, booths, and a bar.  On suggestion of a friend who has frequented Sneaky Dee's a couple of times, I set my eyes on nachos, since they apparently stand out from your standard plate. As advised by the waitress, I grabbed the group a plate of Kings Crown nachos. With this dish you get a real healthy sized plate of corn tortilla chips topped with salsa roja, frijoles, ground beef, tomatoes, onions, peppers, jalapeños, melted cheese, guacamole, and sour cream. What you immediately realize about the nachos at Sneaky Dee's is that they play... no... games when it comes to their toppings! You know that feeling when you're enjoying a plate beautifully warm nachos with great toppings, but you seldom get a chip that actually cradles all the fixings (and sometimes none at all)?  Well Sneaky Dee's knows that feeling, and obviously made it their mission to satisfy your inner topping desire. Honestly, this is your wet dream equivalent of nachos. All the toppings that you could ever want. \"How's the quality of those toppings\" you ask? Bomb dot com. None of the flavours on this plate are going to remind you of some of the more predictably vibrant and zesty experiences of regular nachos. Rather, you're going to get the nacho equivalent of comfort food. The spiciness of the mixed peppers and jalapeños is neutralized by the big boy helpings of guac, sour cream, and cheese, and the salsa flirts as a tomato sauce. Lastly, I've got to mention the frijoles. For the non Spanish amoung us, frijoles is a thick bean dish. Once you've enjoyed the already excellent surface of this plate, you'll delight yourself with this stupidly comforting helping of frijoles, which can honestly stand as a dish on its own.  I can only wonder if their other food stands up to the nachos. Whatever the case may be, God bless this plate."}
{"text":"Brought an out of town guest here to refuel after a long walk from Riverdale Farm. Grabbed some drinks and nachos (obviously!)  I've been before, he hadn't. Love the decor and service is always laid back but good. Food and drinks are yummy and priced well (to suit broke college students :P).   Can't wait until they open up the patio! Just wish they had wifi."}
{"text":"Sneaky Dee's is a cool little spot with a lot of character!   The build-your-own nachos are a really great menu item. While they are a little on the pricey side (the portions are not small though so sharing is definitely an option), it provides a chance to make your dream nachos. The waitstaff were very friendly.  There is also ample seating for large groups, which is excellent as I have found many places in Toronto are not able to accommodate more than 4-6 people."}
{"text":"Came here last night for some nachos which are usually really good. I said I wanted the ground beef. She literally thought I just wanted ground beef and not the option with the peppers and all that stuff (which was on the menu and what I pointed at). Maybe it was my fault but she should have clarified.  Furthermore, the ceilings looking like it was going to collapse thanks to the party upstairs which probably exceeds capacity. The chandeliers were moving, the ceiling was literally vibrating and bending. It was very visible."}
{"text":"Best nachos, best chicken caesar salad, best chicken wings, best caesar drinks, best shitty Mexican breakfast and dirtiest shithole in the city. ALWAYS ask for your chicken well done here. My mom used to take me here as a kid so it's possible I'm biased but I fucking love it."}
{"text":"I've been walking past this place for years, and I finally decided that it was time to check it out for breakfast. Man, what a find! The place has a truly off the wall vibe, with bright colours everywhere, wooden tables and benches covered in graffiti and carved with more initials than a schoolyard tree. Service is friendly, efficient and prompt, always a plus. I had the concha con huevos,, and my wife had the huoevos rancheros. Both were excellent! The eggs were still runny, the beans and rice were delicious, and the sauce was soooo good! there are a couple of rules for my breakfast: don't overcook my food (check!), don't keep me waiting (check!) and make my tastebuds happy (check!). This place rocked it completely. I am so coming back again!"}
{"text":"Had the eggs bene here a while back after reading so many great reviews.  Service was extremely surly and food was lackluster.  Overall, I give it a Meh."}
{"text":"Hmmm... minus the great dive bar atmosphere, I'm afraid there's nothing very special about this place. I've been to Sneaky Dee's a few times and every single time it has not failed to disappoint me.   I've had the food a couple of times but I usually just stick to the nachos. There's nothing special about them except for the fact that they pack on the cheese (I love cheese). Other than that, they're not amazing nor are they bad.  The drink, on the other hand, are a different story. The drinks are EXTREMELY watered down and overpriced for what they are. I once had a round of tequila shots and they had to be 1/4 water and 3/4 tequila... and it was also warm. Gross.  This place has definitely lost its novelty. I can't stand to overpay for watered down liquor and meh food."}
{"text":"For some reason.. no! I know the reason.. my friends come back to this place again and again because of the cheap beer prices on Wednesdays. And the Vegan Nachos.   I have had the vegan nachos, bland and gross in my opinion. Nachos, no cheese, I think they were some lettuce, no fresh tomatoes or other veggies just their spicy salsa which I could not eat. Considering all the things that can go on nachos to still make it vegan, it is sparse for what I have experienced.   I have had the Fajitas which were fresh, hot and delicious! But the only reason for coming back.. other than my friends who insist on returning.. is the Peanut Butter dessert!! OMG!! It's amazing! I've tried recreating and I can't!! ha!  The place is dark, loud and dirty. I am partly deaf and my throat hurts after I leave this place. I try to NOT come very often. Some think it's part of the place's charm!! ha!"}
{"text":"Why is there so much hate over this little gem? I've heard time and time again to avoid it because it's beyond dirty and infested with nastiness.  but at a recent party with my friend where I visited this place I had only good times and good memories  5 Reasons why this place is more than a-ok:  1) I came on tuesday, which is half price fajita night (half price!-it's already quite cheap!).  I didn't get anything to eat at this place beause I was heeding the warning, but all the people at the table got something and it looked quite tasty indeed.  2) The servers.  good loooooord the servers.  My man-waiter was so incredibly nice and so incredibly friendly that, even if I didnt' need anything, I wanted to call him over and chat.  He was one of the nicest servers I have met in a long time and damnit..it was damn pleasant.  3) The cupcakes.  Now again, i didn't EAT here but the others on yelp have said the cupcakes are delish.  and when I ordered one they were OUT.  Now THAT is a good sign that they have good cupcakes- if they are sold out.   My amazing waiter told me they get them shipped in on thursdays so if I really want to catch it before it is sold out I need to start my cycles on the thursday  4) The washrooms are pleasantly clean.  No really.  I don't understand how people can say this is a disease-hole when the bathrooms are clean!  Like, a clean bathroom gets good points for me. There are some five stars on king west that have disgusting bathrooms that I would never visit again.  and finally, 5) The graffitied walls makes you want to come back with a sharpie in hand so you TOO can mark your spot on the walls.  It's like a yearbook gone WONDERFUL.  Like even if you go into the bathrooms and read the graffitti-it's like, nice notes asking you how you are, NOT little notes saying, \"call carla at 555...because she's a slut\".  So will I go to sneaky dees again?  yes. And will I order something to eat this time? you bet."}
{"text":"Sneaky Dee's is a must go to bar.  The booths near the bar are covered with awesome graffiti, giving current bar-goers a look into the character of those before them.  The bartenders are super friendly, down to earth, and love giving suggestions to tourists (as I was visiting from Pittsburgh, PA)."}
{"text":"Oh Sneaky's...I love you so. Disgustingly delightful. Everything is covered in grime and graffiti, and gets very loud and crowded. Sometimes the staff can be snappy and occasionally drunk bros get carries out by cops foe being belligerent. Its just part of the experience, though. I never regret going to Sneaky's, even though I don't go that often.  The food is tasty, full of simple satisfying flavour and the portions are huge, which is what any drunk person wants. I'm vegan and like that I have quite a few options, although I always end up ordering nachos or the vegan burro favorito. Why is it so expensive to add Daiya to the nachos, though?"}
{"text":"3 easy tips 1) go during the day 2) sit at the bar 3) Jay will take care of you!!  My friend and I went there both days we were in town and are already planning on coming back to town because of Jay at Sneaky Dee's."}
{"text":"What a hell hole this is! And you got to love it for what it is! Forget, Yorkville's snobbishness, Little Italy's dress to impress and fashion decals, no, this is all about just getting some cheap drinks with surprisingly better food than you think you would get. If you smoke, then the tiny patio at front is a great place to people watch people heading into Little Italy.   No attitude, laid-back and a great place to hangout with friends, no-tattoos for entry required! I have been coming here for 14 years or so, mostly for the alcohol. However for about 7 of those last 14 I have been dropping by for their brunches. Honestly, they are not bad at all and the locale is great for a lazy one. Maybe to cure the hangover you got from here the day before. Just sayin'  The place is plastered in graffiti which only adds to the grunge vibe this retro-ish Tex-Mex institution simple exudes. Most plates are in the $8 range for a huge plate of food. They make a great eggs benny simile that is worth what you are paying for. However the non-brunch menu is nothing to get excited about, at all. So I can only recommend the brunch. For the rest of the time, just go for the drinks and maybe for the Nachos as some friends claim they are great. I can't tell.   Also, remember \"Sneaky's 1/2 a second rule.\"  If your food touches anything outside the plate for longer than half a second, it's gone. Don't touch it. Give it it's freedom.   Fun Facts:. They used to have a pool table in the back about 14 years ago. Guess whose girlfriend's cousin lost her virginity on it? Not to mention a few years later they had that cross-dressing bartender that dressed like a 1950's waitress.   Yeah, this place is pretty laid back."}
{"text":"I've passed though Sneeky Dee's a hundred times but never prioritized visiting... I was at Manic Cafe on the opposite side as I decided to order a take-out.  I ordered for Avocado Spring Rolls, Jalapeno Poppers and Mexi-Dip Platter. While the size of platter was huge, I was quite surprised that even something basic like salsa and sour cream lacked flavor. While trying the avocado spring roll, the avocado seemed very raw and did not complement the overall dish.  Jalapeno poppers were saving grace, thought could have been better. I will give this place another try with dine-in option!"}
{"text":"Ok, here's the deal with College & Spadina's most visible landmark; you don't have to be from LA or any other major US city to see that plainly, the place is not that ggrrr8 ! The main floor feels like a dingy college caf. room / pub turned Mexican themed, gresy food joint. Did I mention the dingy, oh I mean dim, \"mood\" lighting!  But. . .it Is, downtown, has been having live shows 4ever, lets indie rock kids, rock the f -out, and has, half decent, fake Mexican cuisine.  Live shows happen upstairs on a small stage , which frequently gets packed when favorite buzz bands and are in town."}
{"text":"Love me some delicious Sneaky Dee's chicken wings. The one thing about these wings is that they are huge. No other place has chicken wings the size of these.  The other food is very good too. Potato skins are another great choice. The nachos are awesome with lots of toppings usually.  Definitely recommend to anyone that doesn't mind a more lived in restaurant look. You are not going to find beautiful table cloths and chandaliers here."}
{"text":"Feel like murdering a plate of nachos? Look no further. The DFA nachos at Sneaky Dees are the way to go. Piled with cheese, pulled pork, beans, jalapenos, green onions, avocado and a helluva lot of guac. Oh and the habanero peppers were alllmost as hot as my date.  10/10, would recommend. Bless."}
{"text":"My friends and I lovingly called it \"Sneaky Disease\" when it was one of our regular haunts back in university. It's sketchy looking as hell (and it used to be much worse in the past), covered in graffiti, plastered with old posters and junk on the walls and speakers pump out what amounts to my CD collection circa 1994 (grunge rock and brit-pop).   It also serves up some of the best tex-mex food and beer at a bargain. Brunch is excellent, and I love their Hawaiian nacho platter with ham and pineapple. Probably one of the best places in Toronto for nachos. They seem to understand that it is important to layer the cheese and chips, so as to not leave the chips at the bottom dry and naked.  Upstairs is a great bar for live music!"}
{"text":"What can I really say about Sneak's that hasn't already been said? This is one of the few, rare gems of the city that I have been to too many times to remember and have NEVER been disappointed. Every time I have eaten there the food has been delicious and my experience has been warm and pleasant.    First time at Sneaky Dee's was after a long and late night of bar hopping back in my school days. I was parched and I was hungry. A friendly tattooed beauty brought me nourishment and sustinance of the best kind: greasy nachos and apple pie! They were both spectacular!    Another memorable feast is a weekend brunch run. My favourite is the Heuvos Rancheros; eggs, beans, and a yummy salad all in a tortilla shell, which was the best Mexican breakfast I've ever had. To this day I still order it with anticipation and eat it with delight and end with satisfaction.     While the food at Sneaky Dee's is to die for, I think the thing I love best about this place is the atmosphere. They don't care who you are or where you came from, everyone is welcome here. It may appeal more to the punk rawker crowd or to the poor student movement, but once you grow out of that mentality, you can see that this place is truly come as you are. I've seen business people, moms with toddlers (though the music may deafen their baby ears) teenagers and tattooed freaks rubbing elbows at Sneak's and I love that!    Sneaky Dee's is usually very busy, but the turn over of tables is usually pretty fast too, so you never have to wait too long to eat. The booths, unfortunately are usually packed, so the front is a more viable option for seating as long as you don't mind meeting a few strangers. (The tables are very close together). If you're visiting Toronto, or want to take some company visiting you to a great place for some cheap and comforting grub, Sneak's is the place to go, bar none."}
{"text":"I've never been a bit Dee-ite; I never really lived close enough, so it was with almost fresh eyes that I dropped by last night.  The decor is basic - bare wood booths and graffiti - but it's clean-ish and comfortable.   I had the chicken enchiladas, which were a bit bland but hearty, and the texture of the chicken was gorgeous!  Very moist and tender.  What seasoning I could detect was very tasty, and the 'hot sauce' added some zip.  The enchiladas were warm, but the rice was tepid and the beans were barely room-temperature.  We were in a rush so I didn't get it reheated, but the service was generally great, so I bet they would have done it without a fuss.  Also: cheap beer.  The list isn't long, but at prices like these, why be picky?  A pint of domestic is $4.25, and a pitcher is $11.25.  A relaxing hangout, and a place I'd definitely go for pitchers and nachos with friends."}
{"text":"Pure...punk...rock...bliss!  If CBGBs had served food, it would have been Sneaky Dee's.  This small concert hall disguised as a bar disguised a Mexican restaurant is a graffiti-covered, tattooed waitstaff, band-influenced menu delight.  And they hate filler in their food as much as Ian MacKaye hates it in someone's head.  The nachos that I got there for an early lunch (other people were already at the bar drinking of course) were large enough for two people (which we supplied).  Our dressed all in black server didn't even blink an eye when we said we were sharing.  I think she might have even said, \"rock on.\"  It's that laid back and neighborhoody.  And rock on we did.  The real cheese, very spicy (if we got a bit with the salsa), nachos were piled to the sky with fixing (especially sour cream of which I'm a huge fan).  It was stick in your stomach heavy but it was extremely satisfying (like a good bass line at a hardcore show).  A yacht rock listener might not enjoy them - they'd probably look down their noses at them - but they were a hard rock dream come true.  Especially when washed down with a beer to cool the heat.  Now the bathrooms are as gross as at any rock club (but the graffiti in there is even better than the rest of the restaurant) and any white-gloved neat freak or germaphobe would probably hate this place.  But if someone likes their rock and their surroundings a bit dirty, Sneaky Dee's is heaven!"}
{"text":"Awesome place to hang with a group of friends. Loud atmosphere and a unique surrounding. I like all the christmas lights and the painted ceiling. We ordered the vegan and veggie nachos. The vegan nachos were ok but my friends loved the veggie nachos. Service is pretty quick. Portion sizes are huge! I can't imagine one person eating an order of nachos. Great place for those with vegan, vegetarian, meat eating or gluten free people. One star off because the bathrooms needed a bit of cleaning. No, the graffiti didn't bother me, the soaking wet floors and lack of napkins did."}
{"text":"This is a great spot to hang out. The vegan nachos were really good (but the pulled pork enchilada and burrito were quite horrible...they were soaked in barbecue sauce and that's really all I could taste).   I'd come back, but definitely sticking to the nachos!"}
{"text":"Sneeky Dee's, with its graffiti covered walls, booths and restrooms is a fascinating place to visit. A true dive bar known for its Tex-Mex. I'd personally recommend the nachos. Prepared several different ways, they're always good. My favorite's been the Cactus in the Valley nachos. Corn chips piled high with assorted veggies, beans, cheese, secret sauce, guac and sour cream. Awesome!  Our servers have always been attentive and there's plenty of beer on tap along with a full bar with surprisingly good cocktail prices.  This is cheesy, crunchy, salty Tex-Mex that's best shared between friends and a round of drinks. For the experience alone, I'd say it's one of the better places in Toronto. A must stop when I'm in town."}
{"text":"Worst bar ever. The waitresses are rude. One time a waitress told me it was last call. She took forever to bring our beers and five minutes after dropping them off she came back to \"confiscate\" them when it was barely past two. Another time a bartender told me she didn't have \"time\" for me to be in a picture with my friends when I was the only one buying a drink at the time. Seriously, I get it, you all went to art school and can't find jobs now but take it easy. Also the food is ridiculously bad."}
{"text":"On Wednesdays you can get a pitcher of beer and get $6.00 off the nachos. The nachos are HUGE and well equipped with guac and sour cream. It's cheap and the atmosphere is awesome. Even the bathrooms are cool, COVERED in grafitti."}
{"text":"Un incontournable pour les brunchs, y a de quoi s exploser la panse ! Les portions sont énormes,  et vachement bonnes ! Laissez tomber la carte Gringos et prenez la mexicano. Et essayez les nachos !"}
{"text":"The food is awesome. The breakfast choices, burritos and especially their nachos are all must eats here! This the only restaurant I've ever been to that plays music I like. Upstairs is a nice little venue for mostly local bands to jam around. Good place to grab cheap beer and just hang around with friends.   Thanks for reading!"}
{"text":"You wouldn't like it. Loud, abrasive and covered in graffiti.  My mum complained to me on my 30th birthday celebration at 1.00 in the afternoon on a weekday when we ate at the back of the restaurant, with no one else in sight save for the owners having their coffee, that it was too loud.  The bar was playing Johnny Cash. The American recordings. 'Nuff said. I've been going here since they opened it on college st. in 1990 and I was 16.  Saw some of the greatest punk shows of my life here-new bomb Turks, Cadillac tramps and plenty of others.  Bar fights were par for the course. Now they have security to deal with idiots like you.  Heaping plates of junk food cooked properly. Wicked hangover brunch.  Cheap beer. Still.  Staff are friendly and have balls. Don't give 'em no shit.  I won't come here on Friday night or Saturday night anymore because that's amateur hour, but we all had to start somewhere. I fucking love sneaky Dees.  But you wouldn't like it."}
{"text":"Their Wednesday's special gets me all the time. Pitcher + giant nachos = around $25.  The decor is so unique that I've never seen it somewhere else, you can paint on the walls, write on the tables, paste stickers, whatever you want, giving the place a very nice decoration.  Sometimes is sketchy tho"}
{"text":"The best food/bar in the city. Sneaks is an absolute landmark. Come any time and get great service, good food and cheap brews."}
{"text":"On my way home last night I called in an order of nacho's for take out from Sneaky Dee's (I live across the street). I go there to pick them up and the security guy IDs me, I don't have anything on me so I politely say \"sorry, ok i live across the street let me go grab it\"  I come back and the show my passport to the guy to which he yells at me \"WIPE YOUR F***ING HAIR OUT OF YOUR FACE\" and stares at the passport. He then says it isn't me and passes it to two other bouncers to look at it. After the second guy confirmed that is is actually me(photo was taken a year ago and I look the EXACT SAME, i'm also twenty seven years old!) the guy says he still isn't going to let me in cause I have a bad attitude (because I asked if he was serious when he said it wasn't me) and that he wouldn't let me in. I had already explained that I was just picking up food, but I reiterated that it was called in and waiting for me inside, at this point the guy says \"FINE, GO GRAB YOUR S**T AND THEN GO\".... spoiler alert: I didn't.  I had heard stories about security there before and obviously as a venue it SUCKS but this brought it to a whole new (personal)level. I strongly urge no one to ever go there again and feel like an idiot for thinking I should support their business, I was sort of in the mood for nachos but whatever right. The other food there is all bad. I honestly thought at one point the guy was going to confiscate my \"fake\" passport. Wow."}
{"text":"I've actually had food here that has tasted like faeces.  Its really a hit and miss with their beef based meat dishes, as sometimes they will taste as though a blind slaughterhouse employee accidentally packaged poop instead of ground hamburger.  I went here for brunch and they cant make cappuccinos, lattes or macchiatos, just black coffee. Welcome to the dark ages.  I find the staff also very judgemental, and just poor servers. One girl clearly didn't like me and I thought she was going to dump a pitcher of beer on me or shove my head in a toilet.  They have reasonably priced drinks, and the bathroom DIY graffiti soap operas are always amusing so two stars earned"}
{"text":"Sneaky Dee's is the equivalent of Mad Mex in Pittsburgh. I went on my first day of my vacation with my sister and boyfriend.  I wasn't comfortable in the restaurant there was too much going on it was overkill.  I wanted to tell the restaurant to grow up.   I probably would have had a taster meal had I eaten at home.   I orderd steak fajitas and they were alright but nothing impressive and my rice was dry. On my next visit to Toronto I will be avoiding Sneaky Dee's."}
{"text":"I came here for breakfast and ordered the pork Benedict special. Eggs are done right. Pork & potatoes are filthy in a good way. Bottomless coffee and the waiter was very generous when it comes to offering refills.  I know, you probably don't think breakfast when you think Sneaky dee's. But check it out if you are in the area, it's pretty good."}
{"text":"I liked it! I really did... But the nachos did not love up to the hype. Pretty avg tbh."}
{"text":"Two words: VEGAN CUPCAKES.  One compound word: TEX-MEX.  Tex-Mex cuisine is so hard to come by in Canada.  Know what's even harder to come by?  VEGAN Tex-Mex cuisine.  When I learned that Sneaky Dee's had vegan Tex-Mex fare I made a point to stop by every single time I visit Toronto.  Admittedly, I'm not sure how much the booze is here as I'm usually playing the role of \"guest\" and either don't pay for booze, pay a pitiful amount, or end up too drunk to pay for my portion.  I'm pretty sure it's reasonably priced as far as Toronto bars go though.  It gets pretty loud in here so this is probably a bad place to bring a date.  It is, however, a good place to bring a dozen people who are intent on having fun.  My only complaint is that I've gotten the, \"My shift is over, pay for the bill,\" rap from a server here before as a less-than-subtle, \"Please get the hell out of here so I can make more money.\"  I didn't leave and 2 hours later the same server was still serving other people, but ignoring me and my friends.  I didn't appreciate that; for the record, we hadn't been starting a ruckus or anything.  I regretted tipping her - why would a server who makes customers feel unwelcome deserve to be tipped?  Anyway go ahead and storm this place with your friends and eat as many burritos as you can."}
{"text":"I love this place. So great for drinks with friends and hanging out, meeting new people. The food is typical, nothing to rave about, but just an amazing atmosphere and great staff. sometimes theres live music which can be hit or miss depending upon your preferences.  TIP: the bathrooms are kinda dirty"}
{"text":"Went for dinner on Thursday August 6th with family. Have been there twice some time back but have not reviewed as of yet.   Started off with a customary veggie nachos and avocado spring roll.  Usually we have had the fried version, this time around we tried the grilled option. The veggie nachos were good as usual but the rest of group thought the quantity has decreased compared to last time. The grilled spring rolls are not worth it. Although good for you, the grilled does not make it worthwhile.   We ordered a veggie burger and fries (have the burger at Harvey's instead), Quesadilla, Burrito Grande and a Baja combination platter.   The quesadilla seemed more like a burrito rather than a quesadilla and with practically no cheese. We have had this before and it has come flat (not shaped like a burrito) and with tons of cheese. Had to send it back as it was not at par. The replacement came similar to the first one in spite of telling the waiter what we have had earlier. The Grande Burrito had no flavour or salt at all and so was the Baja. I have had better burritos at bandidos and Burrito Boyz.   No fault of the waiter, but I think something has changed in the kitchen / management.   Here is something else is going to change. We are not coming back."}
{"text":"Sneaky Dees it has been a few months since I visited you my friend.   I tend to frequent this place when I have been out drinking with my girlfriends. It is our post (College Street) club need something to eat place. Generally this will be a Saturday night/early hours Sunday morning affair. Have never had a problem getting a table, although friends who frequent the restaurant at a more civilized dining hour do tell of having to wait.   One word - nachos! The King nachos are fantastic...so tasty but huge! Definitely a share with a friend job unless you are starving. Basically everything piled on and some of the tastiest guac!   It is a great dive bar though, I have never experienced a problem with the service, always fast and efficient."}
{"text":"Best nachos. Hands down. I've tried to recreate at home to no avail. Clearly there's some sort of secret ingredient used in the mix."}
{"text":"Sneaky Dee's stays open really late at night. They used to have bands upstairs. I really like the King's Crown nachos. You get more toppings than you do nachos. All kinds of different people go here, and you can dress however you like. It's a comfortable atmophere."}
{"text":"The spot for getting an affordable drink and some tex mex. Staple spot of the neighborhood! Most of the nights pretty crowded!"}
{"text":"Food was subpar. Meant to give it zero stars but that's not an option.  We went on New Years Eve at 9:43 p.m. Our waitress, Amanda, blonde girl, was the rudest waitress we've ever encountered. My friend asked about the pita dip but decided to get the potato skins instead. Amanda didn't repeat nor write down our order but we thought she knew what she was doing - but apparently not.   Our food arrived and the pita arrived. We told the guy who delivered it that we didn't order the pita.   Next thing we knew, Amanda came and said \"Uh, you ordered the pita dip. I know it, otherwise I wouldn't have written it down. I know you did or I would have suggested you get two orders of potato skins as you can't just use half of a potato...\"   First of all, that makes absolutely no sense. She was being incredibly aggressive so suddenly as we were having pleasant exchanges prior to that attack she did on my friend. My friend explained to her what happened and Amanda kept saying, \"No, I know what you said. You're wrong. You ordered a pita.\"    It was loud and Amanda probably didn't hear my friend say, \"It's ok, I'll get the potato skins instead.\"  That is NOT how to speak to anyone. We were baffled. She was the most aggressive, rudest, most repulsive waitress ever. We had such a terrible experience that it's totally turned us off this mediocre place. Totally overrated. We didn't complain to the manager because it was NYE but she was the WORST."}
{"text":"Our group of friends have been meaning to try this place out for the longest time; the mentions of cheap beer and cheap quality food appealed to us a lot. After many, many months, we finally planned a night at this place.   We arrived early (6:30PM) and had no trouble getting a table. The place started to have line ups around 8:00PM. The inside is decorated in a style similar to its sign outside...have to say that it is quite unique. There are drawings/paintings inside on the walls, on the booths, in the washrooms...etc. We sat at a table relatively close to the door, so every time the door was open (which happened a lot) I shivered. I debated putting on my winter jacket but it is difficult to eat finger food with a jacket on and the sleeves hanging, so I just dealt with the cold breeze every other minute. The place is dark, so I had trouble reading the menus hung on the top of the bar and on the walls. Some items were written in with light coloured marker, so it wasn't difficult to read, I was actually unable to read it.   Anyways, onto the things you can ingest.  We went for the cheap booze. The pitcher only costs $12 or $13 (forgot) so we got one thinking how great of a deal it is. Hmm...but I was disappointed; speechless with the quality of the beer inside the pitcher. I complained about water-down beer at another place, but holy poo...the \"beer\" I drank wasn't even beer; it was some yeast-flavoured water, LIGHTLY flavoured. I think they put around a tablespoon of beer in every pitcher filled with water then add yellow food colouring to make it a bit more yellow. Actually, I think they're cheap about the food colouring too, because the beer is still very colourless.  Besides beer, we got the fajitas, it is half price on Tuesdays and we never had something like that. It was pretty enjoyable, it reminds me of the burritos I eat when I'm drunk and downtown. But I wouldn't buy something like that for the full price ($19.50? or $18.50). Our friends got King's Crown (or something like that) which is a nacho dish for around $15. It's topped with a lot of things and sounded delicious. It wasn't a disappointment, but the portion was smaller than what I'm used to at other places for the same price. So overall, the food wasn't all that cheap...or at least overpriced for the portions given.  They do have $2.50 bottles and shots were like $4.00 depending on what kind of shot you want. I didn't get any though, because I just wanted to get out of there as soon as I can. It isn't just the cold breezes or crappy pitcher that I have to complain about. There was this really LOUD buzzing noise that goes off every now and then. I am not sure what triggers the buzzing, but it was loud, it was annoying and it startled me every single time it buzzed. How the hell was I suppose to enjoy my half-price fajita and yeast-flavoured water when there is an obnoxious buzz every now and then?  The only reason I am even giving this place a 3 is because one of us (obviously not the not the one who wrote this review) really enjoyed the way this bar was decorated. Or else I'm giving this place a 2. and \"2 stars\" because the service was pretty good and the servers were friendly and attentive."}
{"text":"Sunday brunch was a bad experience. Bland food. Bad service. Long wait for food. Meh. Looks like it might be fun at night. But brunch... Pass. 2 stars for poor value to $ spent."}
{"text":"Delicious food and really cool interior. The only downside is they can't split bills which makes it difficult to go with other people."}
{"text":"This is the type of place that makes me feel old.  At some point in my life, I found it amusing to go to a washroom where all of the walls and dividers were covered in graffiti, but now I prefer clean toilets over customer illustrations of two people doing unspeakable things to one another.    Beyond bathroom cleanliness, the atmosphere is friendly and the noise level - even when packed - isn't too loud that you can't carry on a conversation.  We arrived here around 6:30 and left 4 hours later - at no point were we encouraged to speed things up - even when it did get crazy busy around 8:30/9:00.  The service was fine - at some hours more attentive than others.  They have a daily deal; when we came it was a pitcher + order of nachos for about $20.  The food is okay.  I had plain-ish nachos and didn't particularly like the texture of the roja sauce that coated every chip.  It reminded me of spicy tomato paste and was off-putting after a few bites.   I added guacamole but it was also pastier than I'd imagined for a place that advertises that they make it themselves.  The orders are big, though I still don't understand the pricing scheme of half of the dishes (they charge more for mushrooms than meats?)  Our order of 2 nachos, 3 pitchers and 2 drinks came to about $75 including tax."}
{"text":"Best nachos ever!!!! Great place to go for a piss up and tex mex, You can always stumble upstairs for some live music, which also has a bar and draft.  Saw \"the satellites\" there Canadian reggae band."}
{"text":"Definitely a place to remind you that you grew up long ago. The air is moist and the environment somehow both dingy AND vibrant. Without caution Sneaky Dees efficiently accommodates it's clientèle of college era partiers.   If you're hungry try the Grande Burrito stuffed with catfood."}
{"text":"Once again, Seaky Dee's saved the night last night.    This place is iconic.  Who in downtown Toronto hasn't eaten here???  Who hasn't taken their cousin here, visiting from Nowhere, Ontario after you moved to Toronto for college or work?  I can't add much: it is the young person's place for young person's grub: wings, nachos, tex mex, and beer.  Lots and lots of beer.  The great thing is that all of these staples are actually quite good despite the fair pricing.    Last night I was supposed to go to Phil's BBQ with a friend but found that it was closed because they were not paying the rent.  We walked along College, agreeing that if nothing caught our fancy, we'd go for \"cheap and cheerful\" at SD.  For us and our circle, along with many others, SD is just that default place.  You know you'll get a lot of decent food without paying too much--no surprises.  I went with the wings and have to say, they are some of the best in the city.  (Note that I am by no means a wing expert)  The fries were good too.  In the past I have had their Christmas meal, nachos (of course), plates of tex mex and probably the fajitas.      I have never tried breakfast here.  Bonus points on the cool 90s soundtrack that allowed us to relive our college days.  Service was particularly good last night too.  (Saturday, from about 7 to 9)  Highly recommended but do note: this is a young person's mecca, especially on Saturday night.  (underaged kids to grad school students)."}
{"text":"If these are not the best nachos in Toronto (at least for the price), I have no clue where else it would be. Super loaded and delicious. All the other food items, tex-mex style have also been delicious. Service is always great. I am a rock fan so this place's grungy dive-bar style, from the graffiti-ed washrooms to the carved out tables, and \"gringo\" style approach really appeal (It's NOT a dive bar though, just has the charms and none of the bad). Always good music, cheap and quality beer by the pitcher, busy and vibrant. Always a good time. If that's what you are looking for, it's the place, if you prefer finer dining and more quiet, then probably not."}
{"text":"Oh sneaky dees, you're amazing!!  From the kings crown (try it, you wont be disapointed) to the ceasar salad... the portions are HUGE and I don't think I've ever managed to finish a full meal, which is a very very good thing! The servers have always been super friendly and very fast and alert. I've also been to the venue upstairs a few times for shows and those times have def been some of my favorite shows I've been to.  Sneaky Dees is a must go to if you're visiting Toronto!!"}
{"text":"I use to come here to eat all the time in 2011. I always got the Guadalajara combination platter. A taco, 2 enchiladas, rice, beans and salad. Its very filling and presented perfectly. The snickers tart is perfect to finish off a great meal. I prefer here during the day, as the day goes on, it gets busier and much louder. The bathrooms are semi clean. The decor and amount of vandalism/art/doodling is a little over the top. Theres usually shows upstairs on certain days. Wednesdays has a $3/bottle special of local beers. I came here again a few days ago and was still very satisfied with the Guadalajara platter. Still made the same and tasted perfect. I highly recommend this restaurant to anyone looking to fill up on Tex mex food. The best around in my opinion. My friend for the lunch special with 2 tacos, one pork and one chicken. She was very satisfied with the food."}
{"text":"I've only once been on the ground floor to experience their food and it was pretty good.  The nachos are awesome and it's a decent sized portion.    Security is strict about people who have come in already having pre-drank so be careful if you have any friends like that (I don't typically drink anyway so it's never a problem for me)  I usually if anything would go upstairs for a live band that i've anticipated for a time but there hasn't really been many shows booked there for a while.  Don't know why.  The sound is REALLY REALLY LOUD. AND I MEAN LOUD.  I do typically listen to metal, yes; BUT: it can be played at normal and not turned up to full blast where you can't stand near the stage without feeling like you've lost your hearing on the way out.  They got great prices for beer on wednesdays just so you know..."}
{"text":"I used to frequently be at Sneaks regularly when I went to U of T, but not so much these days. I was there for lunch recently so figured I might as well write a review.   The day time scene differs vastly from the night time scene, where the place get VERY loud and super busy. All in all, the food is pretty good, and I like hanging here at night for drinks too.  And yes, the rumours ARE true, they do have some of the best nachos in the city. Even if you just get cheese, there is something about them that I love and no where else has really been able to live up to.    I would say I'm a fan."}
{"text":"I wanted to like this place due to hearing about their nachos being good. But this place just wasn't my vibe. I couldn't talk to my BF and it was just too loud for my liking. I understand that that's what makes this place fun. We had enchiladas and nachos. Giant portions. So I would suggest sharing everything. Food was very heavy and made us kind of sick after. The service was a bit slow and getting waiters attention was hard at times. It was packed so I understand.  So all in all, I can cross this place off my list of tries."}
{"text":"This place is great, assuming you know what you're going into. If you expected a clean dining environment with personable service, you're in the wrong place. If you was good satisfying food at fair prices and aren't worried about touching any surfaces in the bathrooms, then you should give it a go!  I come here more often than ever for breakfast. You can almost always get a table without waiting, and Its a good price for the standard eggs/meat/potato/toast breakfast and the quality is right up there with anything in the area that isn't a ridiculous price. I really like how they make the potatoes especially. Sort of a pan fried potato meets hash type vibe.   On the dinner tip, come early or expect to wait for a table, but the food is all pretty kick ass and worth a bit of a wait. I'm a huge fan of their chicken enchiladas, and the tacos are pretty good too, so check out the \"Combination Plates\" section of their menu where you can have a couple things along with a bed of refried beans and rice and \"salad\" (read: diced lettuce and tomato taking up 1/4 of the plate). Also worth mentioning is that their chicken wings and nachos are both great starters, although I learned this last weekend that the $22 mixed appetizer platter is worth passing on.   Drinks are all pretty decently priced. They have low end garbage like Kool beer on tap for $4.50 a pint, decent mid range independent stuff like Hannenberg Pilsner or Amsterdam Blonde on tap for $5.50 a pint which is pretty good in my eyes, and then Alexander Keiths for $6.50 (meh).  All in all, this place delivers what it promises, and doesn't try to pretend its something it isn't, so thats gotta be worth something. In this case, it's worth 4 stars."}
{"text":"Came here for dinner then made my way upstairs for the MEN concert.   First, the restaurant: the food is not that great. Not the worst Tex-mex I've ever had, but certainly nothing I'd crave, either. Decor is definitely divey and a great place if you like to be among hipsters (not really my bag, but... whatever). Portions are cheap and ludicrously huge. I had a chicken quesadilla that could easily have fed the half the families in Baja California.   As far as the concert venue upstairs, it's a fairly intimate place to see a show. Small stage and easy enough to get close to the action. Not very large selection of libations behind the bar, though, so hope you're not picky about the brand of booze you drink. MEN was amazing though, and unlike the crowds at some venues I've been to lately, super friendly and looking to have a great time. It reminded me of the old CBGB in NYC, where I used to go as an NYU student. Ah, memories. I'd go back to Sneaky Dee's for a show -- but probably not for the food."}
{"text":"Grungy, soaked in graffiti, and totally okay to write on the walls to leave your mark (bring a sharpie or two or three!), Sneaky Dee's is a great place to relax, catch some good bites, and, as a venue, a cool place to see bands perform.   My friends and I went in on a Saturday for lunch so, while we didn't get to see the place packed as it would be on a concert/party night, we got good food in our bellies. We ordered the Mexi-Dip ($12.00) and Tres Tacos ($14.00). For the three of us, it was a lot of food. I can see one really hungry person devouring the Tres Tacos but, paired with the Mexi-Dip and the big basket of corn chips it comes with, it was a bit of a mission to finish everything.   The Mexi-Dip comes with guacamole (yay for not having to pay extra for the guac), frijoles (beans), sour cream, & salsa and a basket of corn chips. Combine all the dips together with each chip and you get really delicious and flavour-packed crunchy bites. This is a great app to share with a group of people. It's big enough that the three of us had a hard time finishing up all the chips. The salsa is great and will be finished quick - so maybe ask for more when you order this app.   The Tres Tacos is three corn tortillas with salsa mole and topped with melted cheese. You have the option of choosing three of the following (or sticking to one or a couple): ground beef, chicken, pulled pork, fish, or vegetables. Each taco comes with onions, mixed peppers, salsa, and the melted cheese. The three packed and cheesy tacos also come with sides of frijoles, ensalada, and mexican rice. We chose: pulled pork, veggies, & ground beef. I got the pulled pork and I can say that there is no clean way to eat a pulled pork taco! All the juices, the melty cheese, and ingredients inside make for a slightly messy but really delicious meal. My friends liked their tacos and the melted cheese on top of all of them was a nice way to top them off - definitely added to their deliciousness.   The value you get at Sneaky Dee's is well worth it. While maybe not the most amazing Mexican food you'll ever taste, the dishes are bursting with flavour (and size). The atmosphere is super unique and even the washrooms are worth taking photos of (all that graffiti!). I'd love to see this place as a venue one day...but I'd definitely come back just for the food if I'm ever in the area."}
{"text":"Best nachos I have tried so far.  If you don't like lettuce, then ask the server to put beans instead."}
{"text":"I like sneaky dee's but it wouldn't be my go-to place for a Saturday night. Too busy and we had to wait in line for 30 minutes before getting a spot tucked in away in the back corner at 10:00 on Saturday. Probably not the best time to go though, maybe better for a late afternoon drink/nachos. The nachos are really amazing though and the servers are friendly. The bathrooms are disguuustttinnggg or at least they were last night."}
{"text":"Im a huge nachos fan and I've heard great things about this place and their giant portions of nachos. Overall, Im glad I tried this place, it was good but I don't think ill ever have the craving to come back.   We ordered the cactus of the valley and the king's crown, while the first one was overwhelmingly huge, the latter was of a modest size (yes, I'm a big nacho eater). The cactus of the valley unfortunately had a little too much spice for all of us: we had to tone down the level of spicy with large amounts of water and sour cream (flagging down for more water was also a pain since there was only one waitress for all of the back). The salsa in both nachos was a bit too liquid, making most of the nachos in the centre soggy (especially in the king's crown, maybe also because it was all stacked up on top of each other?).  Overall, glad I tried and lived the hype but the hype aint for me"}
{"text":"Grungy environment. The food is served in big portions, but I wouldn't say its the tastiest. I think people come here for more the experience than the taste of the food. Only takes cash."}
{"text":"Came in to Toronto for New Years weekend and heard we had to check out Sneaky Dees for that perfect drunk food- they weren't lying. The nachos were superb, I was elated. We also checked out the venue downstairs and had a good time grooving for a bit, though our moves were mostly bobbing after those nachos"}
{"text":"Huge portions, very convenient location, cheap and they close late, those are the highlights. The food it's ok, it's not bad, it's not the best, but you are probably coming to this place after a night out, after the club or the bar etc so you don't care about eating high end incredible food, you are drunk, tired and you are starving- this is the place you've been looking for."}
{"text":"I love love love Sneaky Dee's.    The food is good, if not great.  The guacamole is great, and I don't care how it is that they always have a never-ending supply of avocados.  The king's crown are amazing nachos if you like a billion things on tortilla chips (I do).  The fajita special (half price) on Tuesday is basically the cheapest thing ever but it does mean that it's hard to get fajitas on other days.  The guacamole equisito somehow makes it appropriate to order a main dish of guacamole.  These are the only things I ever eat there, but other people like other things, but I really can't imagine that anything is as good as a huge mound of guac, which is apparently vegan but I can't really believe this.  People go for the cheap beer, and then they are won over by the really really cheap Hemp or Cool beers.  Don't get these.  Only drink bottles at Sneaky Dee's, sorry.  This is coming from someone who loves the place, but the taps will make you seriously sick.  In terms of atmosphere, it's big and they play pretty funny music.  You can usually find a place to sit (my entire softball team can usually find a place to sit).  This is one of the reasons why it makes a great brunch place, as I hate waiting for brunch (again, guacamole for brunch, yes please!).  Also, I played Scrabble at Sneaky Dee's once a week for many years and they never made fun of us, bonus.  They re-did the washrooms a few years ago and it really shook my world.  I'm fine with it now.  Also, they will card you.  Even if you are an old.  Don't be flattered, but don't be embarrassed by not having ID."}
{"text":"My friend was famished (I ate dinner) and we walked by Sneaky Dees. I had always wanted to try this place. It was 2 a.m. so after last call. I asked the bouncer if we could still order food (expecting a no) but was surprised when he said yes! Wow, isn't Toronto great. Things are OPEN after 11!!! We were seated and didn't see a server for ten minutes. I was timing. When my friend politely tried to get his attention, he replied with a snarky \"I see you, bro\". Rude. He took our order and we waited FORTY FIVE MINUTES to get our food. That tainted my experience. I was so fed up as it was after 3 a.m. I asked the girl who carried it over to wrap it up. She gave a bit of attitude, started arguing with our original server, then put it in a to go container. We left immediately after. The food tasted good. The service was beyond horrible. I'd be willing to give it another try because it does look like a fun place. Maybe for drinks... not for food."}
{"text":"I was recently in town and I loved this place. All the same awesome atmosphere it had before when I use to live in Toronto. This place never gets old to me.   King Crown Nacho's... awesome. Beer Selection... awesome. Portion sizes... awesome.  and What's Poppin' upstairs was really fun. Had a blast hanging with old and new friends. I will def come back next time I am in town. Love this place!"}
{"text":"This place has nachos.  In fact, I would have to say that their nachos are the number one reason people come here.  With a kitchen that's open til 4am, I'd say that the people of Sneaky Dee's know it too.  Wednesday night is Kings Crown (nachos with ground beef) and a pitcher of beer for about $19, and Thursday is Veggie Nachos and a pitcher for about $18.  Their beer options are limited, and not very good to be honest, but when it comes to these nachos, you're willing to overlook things like that.  Dee's is also a popular breakfast place, with cheap prices and a Mexican twist to many of their plates.  If you like combining tortilla shells and eggs, Dee's is worth checking out.  Upstairs is a concert space which sees local bands, and the occasional smaller touring indie band, play for a cheap cover charge (which varies with each show)  You can also order food upstairs.  Nachos and local bands, together at last."}
{"text":"Brought my American friend and she was not impressed and neither was I. She's not even from the south and that says something. This place was cool and hip around 10 years ago though when there were no Mexican restaurants in downtown. Just go somewhere else."}
{"text":"Awesome place. Breakfast was 3 eggs, 3 sausages tons of hash browns and toast for $7.50. Bring you appetite. Saw people who ordered nachos and fajitas they looked amazing as well. So coming back again. Love this place."}
{"text":"Went here on a Friday night and it was a fun time. Decent selection of drinks and an interesting atmosphere, a great place to hangout with buddies. This food is pretty decent as well, just had the burger and fries and was happy especially for the price of $10. Everyone else had nachos and said they were also pretty good. Would go back to try the Mexican food."}
{"text":"Had the nachos which were huge and filling. Even though most people say these are the best nachos in the city I found them to taste pretty much the same as the rest. You're paying $17 so there is a lot of food, and it had a few layers with ground beef and beans.    The my favorite thing about sneaky Dee's was the interior which looked pretty gritty with graffiti and all."}
{"text":"I went to the music venue before I went to the restaurant. I was always a bit skeptical about the restautant, since the venue didn't leaves the best impression on me. The venue is small and kind of sketchy looking, but the bands playing there are usually great; I've seen a fair amount of good shows there.  As for the restaurant, I went for a friend's birthday celebration, who told me the nachos were really good. When I walked into the restaurant, it was packed and very noisy. There's graffiti on the walls and some art on the ceiling. The decor is kind of odd but has its charm.  We ordered the King Nachos for the carnivores in the group, and the vegetarian nachos for the vegs (myself being one of them). Portions were huge and are therefore ideal for sharing. There's nothing really unique about the nachos, but they're pretty tasty. The veggie nachos had a lot of cheese on them and are pretty basic in terms of toppings. You can add other toppings, but they're an additional $2-4 dollars each, which is asking a bit much. I can't comment on the King Nachos, but my friend seemed to enjoy them.  The beer selection is pretty limited. Oh yeah, and chances are they might id you too.   I'd probably go back here again with some friends for the same meal again."}
{"text":"Only have had the nachos. Still IMO the best nachos in the city, layered to perfection. It's actually hard to get anything else because all I crave when coming here is nachos"}
{"text":"I'm not sure why this place has been so popular, the food is terrible, the drinks are bad and it's extremely crowded."}
{"text":"This place is 3.8 for me.  These guys have the best nacho i ever so far. (two turns out fantastic out of three times so I'm not going to recommend to order it when its really busy like late Friday night.) Tried couple other dishes as well and they were all pretty good. I will go back there for late lunch or something.   Their bar is okay but nothing special. Ordered couple cocktails and they are all just good enough to get drunk but not fantastic.  This place get really busy and really LOUD on Friday and Saturday night so if you are looking for to have a conversation, i will recommend to check out other bars around the neighbour. They will have better atmosphere for conversation, less busy, less wait and quieter.   Service is just okay. They definitely need more server for evening.  Overall this is a good place to hang out with friends. I will definitely visit again."}
{"text":"Love the food - especially the Tuesday night fajita deal. So delicious!   This place has a great vibe, and I usually like coming here, but the wine selection is terrible.   Please please please get some cheap Chilean or Italian wine (those 1.5 litre bottles of Santa Carolina or a valpolicella would do)."}
{"text":"Tried this place for the first time because one of my good friends raves about it. Overall I was pretty satisfied with the restaurant. They had the hands down best Chicken Quesadilla that I've ever had. No joke! Decent service, nice atmosphere and good food.  Pros: Graffiti.. EVERYWHERE, you're encouraged to bring a sharpie with you and 'decorate' your table. The walls, booths, tables and washrooms are completely covered. Decent prices for food. Wide variety of food. Good service.  Cons: Restaurant ''CHOOSES'' to not separate bills and not accept debit. I say Choose because as a business who wants to gain clientele you'd think they would be more open to making their customers satisfied than saving a few bucks.  Pop refills are not free and cost $3 a glass.  Food can be pretty pricey if you don't opt in for one of their combos.  Wasn't too impressed with their ''kings crown'' nachos as it was very soggy in the middle however was a generous heaping of food.  Any sauces or dressing ie: sour cream costs extra.  Overall the food was pretty good, environment was cozy and we had a great visit."}
{"text":"It's right down the street for where I live so I have been going there a lot. The staff is very friendly and the beers are good on tap. Tried their food for the first time and the serving sizes are huge! Tried their cheeseburger but was not able to finish it. Good value for the money and a nice place for late night snacks and drinks."}
{"text":"Food is so shit but wednesday hip hop night is amazing!!!!!!"}
{"text":"Very hipster/punk/grunge. Tables are carved with graffiti. Beer is cheap and the fries/nachos are amazeballs. Get the Destroyer and share between two people, you will be glad you did. Apparently this is a Toronto institution to go to... I can see why. Those fries were boss!"}
{"text":"A Toronto landmark, the quintessential dive.  Sneaky Dee's is a Tex-Mex dive bar located right at College & Bathurst in little Italy, somewhat close to music venues like Smiling Buddha and Mod Club which are further along College. Sneaky Dee's is also a music venue, hosting local indie bands.  I only went to Sneaky Dee's for the first time yesterday to kill sometime before a show at Mod Club.   While I didn't eat much (I regret not getting the nachos but they looked amazing), they have nachos named after famous Toronto artists like Death From Above 1979 and LIGHTS. I only had garlic bread, namely because it was one of the cheaper things on the menu, that was decent but not incredible. The fajitas and nachos are what you'd want to get when you're here.  Drinks were actually pretty cheap $3.75 for a bottle of PBR, not bad!   When me and my buddy got the bill we were a bit surprised how Sneaky Dee's doesn't do separate bills. You're going to have to divide it on your own which is a bit annoying but didn't take away from the experience.  Overall, I'd definitely come back to Sneaky Dee's I have to try those nachos!"}
{"text":"Down to earth bouncers, great fun friendly service and a fun young & dumb atmosphere :)  Love the drink menu - Im always a sucker for blow jobs *cheeky smirk*. Huge portions and decent tex-mex for a bar with a full kitchen that stays open until at least 2am. Now I'm just dying to go back for that infamous Wednesday hip hop night upstairs!"}
{"text":"Sneaky Dee's is one of those really interesting places you just HAVE to check out. They have a really cool music selection as well as really awesome bands that come out on certain nights and I can't really sum this place up as \"wierd\" (more so unique) but it's something you just have to see and you'll definitely come back to.  It's definitely a great place to hang out with a bunch of friends, kick back a few beers (they actually have Hemp beer!) and have some of their must try Nacho platter (good for about 3-4 people). And if you stay long enough until breakfast, they have a super cheap basic breakfast that's yummy and easy on the wallet.  Nearly always packed at night, Sneaky Dee's is definitely an interesting place with a truly unique character that you must check out at least once."}
{"text":"All I can say is KING CROWN NACHOS.  I think this would be one of my \"last meal\" choices if I were on death row.  I don't really care if its gross inside or the bathroom smells like barf.  Its a freaking bar.  Get over it.  Get in, have a beer or ten, get a plate of King Crown nachos and get the hell out!"}
{"text":"What can I say about this place that hasn't already been said about Barbra Streisand.....   Ladies and Gentleman:   One night I went there dancing and saw two folks hitting it off at the bar upstairs - drinkin'. dancin', kissin', cuddlin', and 9 yards later they're downstairs swooning over nachos while dialing for a cab... AAANNND SCENE. On a major bender, the boys and I were out all night and decided to do a round trip back to Sneaky Dee's for some Breakfast.... as any drunk and restless 20something year old would do... but to our surprise we saw the SAME girl from last night WITHOUT the guy. She sat alone, poking away at the breakfast special with the same dress on, heels leaning on the other side of the booth - where the man once sat MERELY hours ago -, and her mascara running into the eggs.... not only were the eggs scrambled, but clearly her memory from last night.   This is Toronto. This is Sneaky Dee's.   There are too many positive attributes to give this place. Giving only 5 stars truly doesn't do it justice; If I could give a sixth star I totally would.... I'D BE ON THAT LIKE PEACHES ON TOAST. AND1.   Great location, flexible hours, accessible by legs or wheels, family run business, very cheap beer, very cheap food, very delicious eats, very vegan friendly, very friendly staff....this place is your home away from home. Often I find myself eating / drinking / partying here a couple times a month and not once does it get boring, not once does it get dated, this place is as consistent as the warm bath mama used to make you... or still does.... how would I know?! I AIN'T YOU!   Not only does this place offer delicious eats, a punk rock decor, and the dirtiest washrooms you can stomach.... but the upstairs concert venue has a spectrum of entertainment as as wide as Streisand's nose...   BOOM! TWO - FER ! YEAH!   Every night of the week something is happen' - Legends of Karaoke, MFOY, WHAT'S POPPIN',  Live Bands, Shake a Tail ..... you name it! It's graced the upstairs venue.   If you don't come for the nachos, the dance parties, bringing home hot chicks, the bouncers pummeling morons, that drunk girl falling down the front steps, the juggler outside, loud music, drunken shenanigans.... then you probably just stepped in just to use the washroom... in which case, the joke is on you.   Have a cheeky glance at Sneaks -  This place is magic.   Sincerely,   Abraham Lincoln"}
{"text":"It is cleaner than it looks.  Cheap beers and cheap food.  This is an excellent place to start, then end your binge."}
{"text":"Went there with some friends after work.  I had vegan nachos, was pretty good! Everyone was happy with the food and they have cheap beer so that's a plus. However, the service... Our waitress was a bit rude, sometimes too busy cuddling with her bf probably to ask her what we wanted. And in the end, she demanded a huge tip...  Also, they don't do seperate cheques! Be aware of that as It can be quite annoying for a party of 6 people. The place is really nice, with all the graffitis it has character!"}
{"text":"I'm giving this place a 5 because I think I've been here more than anywhere else in the entire city...for serious!  Cheap drinks, amazing tex-mex food and a punk rock ethos so unabashed it can only be admired. I know people who say this place is overrated yet never turn down an invitation to join me. It used to be all about the nachos and $3 Jack Daniels for me, but now I mostly find myself there on Sundays for the avocado eggs benny--to which I always swap out the potatoes for their ensalada--and endless cups of diner java. Plus it serves food late (for Toronto) and it's always consistent.   Upstairs you've got a decent little rock venue, downstairs you've got anything tex-mex you could ever imagine (including many custom creations that are partnerships between Sneak's and bands such as Cancer Bats and Lights), and down downstairs you've got a grungy little bathroom with so much graffiti it reads like a gritty history book.    A little more history for ya: Sneak's used to be located up the street at Bathurst and Bloor before moving to its current location in 1990. A wise man once told me it got its namesake because it was opposite \"Honest Ed's,\" hence the \"Sneaky,\" plus Ed=Dee backwards."}
{"text":"Great food and friendly staff! I got the breakfast special: 2 eggs w/ bacon, ham, or sausage and home fries and toast. It was only $4.99 (even better because I'm American) and so big that I couldn't finish it. Available from (11-4 M-F). Try the Laredo hot sauce on your hash browns. I will definitely be coming back here soon."}
{"text":"A 5 star establishment for many reasons: a music venue drenched in nostalgia from my university days, best late night nachos in the world, and friendly staff that hustle into the late hours.   The vibe: Busy, large, dive bar vibes with big booths, and a music venue upstairs where the floor actually moves when there's enough people dancing. Late night snacks, pitchers and cheap breakfast.   The food: Sure, it might not be gourmet, but Sneaky Dee's food has satisfied me many of late nights. The veggie king's crown nachos are my absolutely favourite. So much guacamole, so much cheese, so much good. These people know their nachos. Even their poutine with their shredded cheese (blasphemy, I know) is delicious in my mind. Their breakfast is pretty good too. It's pub food, but whatever.  My go to meal: Veggie King's Crown  Secret: You can customize the nachos. Some of my friends are hooked on plain nachos with guacamole baked into the cheese. It's divine."}
{"text":"I had the pulled pork burrito which was good but my wife had the chicken burrito. The chicken was not seasoned well at all and the service was good looking at how pack it was. I just wish my wife's food was better."}
{"text":"Strange crowd, very loud, none of the food tasted good so if your just hanging for drinks it's okay and drinks were also very cheap.  But service was also good so that goes a long way aswell."}
{"text":"Portions grandes comme ailleurs mais temps d'attente assez long pour une salade et deux sandwichs...  table pas très attrayantes pour manger mais ça va avec le style de l'établissement! par contre mention spéciale pour la musique top!!"}
{"text":"I have heard great things about Sneaky Dee's from many people and love tex-mex so have been wanting to try it for awhile.  After my first experience, however, I was very unimpressed.    Our server was good, and the menu LOOKED good, but that was about the only two things I liked about the place.    We ordered the famous King Crown nachos to share.  For the price we paid they were surprisingly small.  I'm a huge fan of nachos and these were some of the worst nachos I've had.  They were not layered at all and there was barely any cheese.  It was mainly just a massive pile of refried beans with a few chips over top.    While we were walking out, I glanced at other people's plates which all looked like slop - not very appetizing.    Most importantly, however, the bouncer was VERY rude.  It was a Thursday night and my boyfriend and I just wanted to grab a snack.  Having never been here, we didn't realize we had to show our ID.  I honestly thought the plain clothes bouncer was a guy waiting for someone in between the double doors.  He barked something to us, and we stopped to show our ID.  When my boyfriend went outside for a cigarette, upon coming in he went to show his ID to the bouncer again in case he didn't remember him and the guy just stared at him like he was an idiot.  When we left, it had started pouring, so we stood under the awning for a moment to pull our umbrella out to open it so we wouldn't get wet.  The bouncer immediately yelled at us and told us we couldn't stand there even though his friend was standing there smoking with him.  - Based on other reviews, it appears we aren't the first to be treated like shit by the bouncers for no reason."}
{"text":"I am scared to go to this place, literally remembering my two visits here I literally cringe.  Ok did I mention that I am a germaphobe?  I really wanted to like this place, honest....Some co-workers told me the wings here are amazing and cheap.  I thought they were alright, nothing fancy.    This place is a hole in the wall there is no mistaking that.  Now I'm not pretentious.  But it is dark and dingy inside, there is writing all over the place.  I wouldn't come near here with a ten foot pole but that is just me.  Now people who like this place realize it's a hole in the wall but it doesn't make it any better.  I guess some of the food can be considered cheap but ambiance is sometimes worth it.  Ok now I'm not talking five star restaurants (though those are good too) just a place that looks clean is good in my books and this place it ain't.  Service isn't the greatest here and we went when it wasn't even peak hours.  If you like dives, then this dump is for you!"}
{"text":"Most people associate Sneaky Dee's with amazing Nachos. I on the other hand did not have the greatest experience.   I walked in at around 2pm on Friday, there were maybe 8-10 people in the whole restaurant. I slid into a booth and waited for about 10 minutes for a server (not the biggest deal), I then waited another 10 minutes for my whiskey ginger, I overlooked it. I didn't really like the service, it always took more than 20 minutes for the server to come back with water or drinks. Regardless of my server, I was there to check out the famous nachos. I ordered the most popular; King's Crown (salsa, ground beef, tomatoes, onions, peppers, jalapeños peppers, melted cheese, guac & sour cream)...... what a disappointment. If this place was busy, I would be able to forgive them for this order but it was dead so why were the nachos so bad?   First off, there was no flavour in the Guac, they should change it from Guac to Mashed Avocado because that's what it was. The beef also didn't have much flavour but was masked with the salsa and peppers. You know what happens to cheese when it cools? That's exactly what I got. Cold, hard cheese. I was expecting some melty cheese.   I don't think I would go back, it's not worth my time and don't bother speaking to anyone or maybe my server was just tired.   Keep Eating,   Angela"}
{"text":"got the northern blues nachos the other night- soooo good! these aren't on the paper menu but on posters stuck on the walls. bbq sauce, bacon, steak, all the usual toppings.   very friendly service by one girl (casey I think) but there's another girl who works there with red hair who really really needs to get some lessons on customer service. it doesn't hurt to smile or say hello when customers enter.. she just looks at you blankly and hands you a menu and storms off."}
{"text":"Pretty nice vibe and good service at this fine establishment. Some things I remember trying here:  Cactus in the valley nachos: this is a massive dish, and has a good level of heat, just enough heat to add to the dish without detracting from it. Tons of everything.  Hot wings: these were pretty tasty, a reasonable amount of sauce and a good size. I think they could survive as a wings place.  Jalapeno poppers: lots of cheese, but a lack of heat. Taste-wise it's not my thing though."}
{"text":"6 years ago I visited Sneaky Dee's for the very first time and it changed my nacho eating life forever. Ever since then I've made it a point to take every single person i show around the beautiful city of Toronto to  Sneaky Dee's to get the same experience. I came here on Saturday night with a couple of friends from Connecticut who were both hungry and probably annoyed by how much I said  i wanted to come here. When we arrived there was a little bit of a wait since it was a Saturday night (definitely not a complaint, busy ain't a bad a thing). Once we were seated our drinks were served and my friends took a bit to look at the menu. My major complaint is the 3 people I was with DID NOT WANT NACHOS, WHAT IS WRONG WITH THEM????? Okay, moving on, I ended up ordering the Sloppy Jose which was a sandwich with homemade chili and served with french fries. Like everything else I've ever had at Sneaky Dee's, I absolutely loved the Sloppy Jose! The meat inside had a great unique taste that I'm honestly drooling over as I type this. The french fries were pretty basic, but also really good.  Overall, this place continues to exceed the expectations for both my appetite and the appetite of whoever I take here. I've never personally had a bad experience with any of the body guards or staff members because I've never given them a reason to get pissed off. If you like good fun, a cool environment, and nachos, you definitely need to check this place out."}
{"text":"This is my favourite place to go for a post-work hangout/wind down. The beers are relatively cheap, the food is amazing! I'd recommend the wings and the destroyer fries, I order these every time. Their nachos are fan favourites but I think the destroyer fries are underrated.  Some of my friends don't like how \"sketchy\" it looks but it's actually cleaner than most.  The only negative is that there could be more options for beers; but that has never stopped me."}
{"text":"Great for late night eats. Decent pricing. If you're into street style Mexican food it's a good option.   3.75/5 *"}
{"text":"As if someone resurrected CBGB from the NYC Rock Graveyard and melded it with an enormous chunk of South-of-the-Border flair and dropped it into Toronto, Sneaky Dee's a a delightfully divey bar, plastered with teenagers, rockers and punk kids yammering away above a healthy does of ear-splitting volume. A good coating of graffiti finishes the picture.  The standout of my experience here are the the monster-sized nachos. Not for one person, or maybe even two, these overflowing plates of chips, cheese, beans, salsa, guacamole, lettuce and sour cream will defeat with ease any singular human attempting to consume them at once. Me included. I had no idea what was coming and I ordered them for myself. Let this be a warning to you."}
{"text":"When I was little I was mortified by the mural  and the signage this place had - I always looked away when we passed college. It was not my kinda place at age 8.  Now I am old and drinking, I realize what a good joint  it is overall. It's great for : breakfast, brunch, drunken wanderings and drinking.  I love the food here and the relative cheap booze.  The only kitchen open at 2am when you're wildly drunk and require some greasy food ASAP. I've even come to enjoy the extra gritty feeling the whole place conveys, and reading the randoms on toilet doors and walls.  Breakfast is wonderful as well - it really is a great place to get together with others for whatever the reason -and have GREAT timewithout breaking your wallet."}
{"text":"I think this would be the kind of place that would be good to go drinking in. We had gone to get supper after work, and I dont know if it was because it was busy or what but my food was burnt and cold : /       I dont think this place is necessarily bad,but I have definitely had better and its just really not for me. seems more like a bar that has food than a restaurant that has alcohol"}
{"text":"We only time for chips&salsa & a cocktail and it was super reasonable but I wish the salsa had more of a kick to it. Was really hoping to try the texas eggs"}
{"text":"It has been years since I'd been to Sneaky Dee's and it had been a while since I'd been able to take in local talent at a live venue.  Sneaky's downstairs has fantastic decently priced food and a decent cheap beer list that will forever endear it to the younger crowd of students that pack in regularly.  Not having been a student for over 20 years, yes, I felt like I was the oldest guy in the joint, but thankfully, I wasn't the oldest guy in the joint.  Sneaky's upstairs is a fantastic live venue and I'm glad they've reopened it.  A long room that runs parallel to Bathurst Street, the stage where the acts perform is found at the College Street end of the bar, giving great noise bleed to the street below so you're able to hear the act before you enter the bar.  The wooden floors and the wooden bar provide great acoustics and the stage and crowd area are well balanced to give the bands a good place to perform and yet enough space for a crowd to pack around the stage.  Truly intimate feel here.  The beer by the way is excruciatingly cheap compared to other places.  Two bottles and a pint of Cool ran me less than $12.00, and as such provided a degree of jeopardy for the night.  The bathrooms are fun if for no other reason, trying to figure out that if someone wanted to add more graffiti to the wall, where exactly would they be able to do so?"}
{"text":"This place is just special. It is what it is and doesn't try to pretend to be anything else. If you want cheap drinks, some of the best Mexican late night eats, big portions, and and place to chill after a night or dancing or a concert- this is your place. There's graffiti everywhere, the tables are carved up, and the bathrooms are sketchy. But that's part of the charm. I've always had a great time here."}
{"text":"Get the nachos. Any of them. Avoid the fish sandwich. Fries are good. Atmosphere is decidedly very casual. A great spot if you're looking for a cold PBR on a Friday, or just hungry as all get out and the kitchen sink is the cure. Good service too."}
{"text":"Food was okay but this place has a phenomenal vibe. Great music too. Had the huevos rancheros. Ive had better but will surely come back for the awesome vibe and service."}
{"text":"Never Been here. My friends always ordered it for Super Bowls. The food we got was just amazing. Kings crown with  jalapenos never had nachos this great. The chicken wings taste great medium and spicy. Only thing is chicken wings are skinny with little meat"}
{"text":"Went here after work with a couple friends and they had (surprisingly) amazing food! I've only known Sneaky Dee's as a small concert venue and a bar, but never figured they served decent food. Definitely worth a try.  Food: 4/5  I got the Jalisco (1 enchilada & 1 taco served with rice, frijoles & ensalada) and it was pretty filling. The enchilada is pretty big and it is filled with your choice of meat. The taco was very cheesy and like the enchilada, packed with meat. There was also a decent portion of rice and a very generous portion of beans that I unfortunately didn't finish  Price: 4/5   For bar food the price was pretty reasonable. You are getting decently good food for fair prices. The Jalisco that I ordered was $13 and was enough as dinner. I also got a beer for $4.50, which is an alright price"}
{"text":"Went on bar rail mondays, They bumped the price from 3.75$ to 4.25$  per drink but still a good deal! I also got the veggie burger that was absolutely delicious. Cant wait to go again!"}
{"text":"This is my fiance's favorite restaurant in Toronto, and although I find that pretty much everything on the menu tastes the same, everything is good, so I humor him and we eat here on a very frequent basis. Great for brunch, dinner, late night snacks, anything. Not authentic Mexican, it's very Tex Mex. Prices are decent, not exorbitant but not cheap either. TONS of vegetarian and vegan options. The nachos and home fries are our favorite!"}
{"text":"The food was good; service could have been better. Definately come for the atmosphere;."}
{"text":"This is the kind of bar you go to either to drink or to have breakfast the next day after drinking! It's casual and fun and so amazing! People are forgetting that this isn't fine dining at some five star gourmet place! This is a bar! Best stuff is always messy and greasy and filling! So worth it!"}
{"text":"It's dark, cheap, and a little bit dirty.  You know what I'm talkin' about.  Hulking portions and really and truly the biggest chicken wings in Toronto...like sideshow big.....like don't ask questions big(shudder)...  And the servers are always friendly and hardworkin' so tip 'em good people. A minus, upstairs layout is frustrating and not my favourite place for partaking in the rock n' roll....and sometimes the burley bouncer guys can take their jobs a little too seriously but they seem like generally reasonable people. A plus, you can eat nachos while watching a band so it sort of makes up for it in my book.  Why can't other venues in Toronto get this together?"}
{"text":"Saturday night a couple friends and I were enjoying a late night at Sneaky Dees and everything was fine until the end.  Our waitress came to the table, we left her a nice tip ($10 on $60), and she gave us a ten minute warning for last call.  1 to 2 minutes later a blond guy covered in tats came to the table and demanded that we pony up not only the beers the 3 of us had in our hands, but a full pitcher.  When we told him we had just received a ten minute warning and were going to down everything ASAP, he proceeded to rip the pints from our hands and pulled off the FULL pitcher of beer from our table, gave a cocky smirk and poured everything out.    We received no compensation of any sort, and the manager's priority seemed to just be to get rid of us because we were on the verge of causing a scene.  Everything else was fine and the night was going great, but this was definitely one of those power tripping moments that quickly ruined the mood for everyone.  Shame on you, and shall your children be born with tails, I hope the surgery to remove them goes horribly."}
{"text":"I've spent many birthday's here, and frankly wayyy too much time and money here when I lived at Bathurst and College back in the day.  Just go for the Kings Crown nachos and a pitcher of Cool. You'll be happy with all of it. Even when you hear the incessant buzzing (orders going through), or when Weezer's Blue album skips over and over and over again. Even their faux poutine is good. Everything about this place is the best!"}
{"text":"Sneaky Dee's has, in my mind, long-since established itself as one of Toronto's foremost and most reliable purveyors of top-notch nachos. I've ordered the King's Crown many, many times over the years, and I've never been disappointed.  We decided to meet at Sneaky's after work on a hot, humid Friday, and I was happy to note that the patio was almost empty. (If the weather provides for a patio experience in late September, one is more than willing to jump at the opportunity.)  Though I'd love to try something else on their menu, we of course ordered the King's Crown nachos (Crisp corn tortilla chips covered with salsa roja, piled high with frijoles, ground beef, tomatoes, onions, mixed peppers, jalapenos, melted cheese, topped with guacamole & sour cream).  Many restaurants and pubs across the city offer nachos with a similar list of toppings, and yet most prove unable to create the singular experience of the Sneaky Dee's plate of nachos. The biggest advantage the joint has over its various competitors is its refusal to skimp on any of the aforementioned toppings; virtually every nacho contains a bite of something delicious, and it goes without saying that there are hardly any naked nachos to be found here (which is sadly all-too-common with most plates of nachos).  It's clear, as well, that the use of seemingly homemade ingredients plays a significant role in the King's Crown's massive success. I can't tell you how many times I've ordered nachos and almost wept at the use of canned salsa. The other ingredients are prepared equally well and although the bottom layer does tend to get soggy (a common complaint, I've noticed), I'll happily take a few mushy nachos over a heaping assortment of undressed ones.  The whole thing is topped with an almost ridiculously generous helping of sour cream and guacamole, and honestly, I was in nacho heaven the entire time I was eating.  Sneaky Dee's, do not change a thing."}
{"text":"It's a dive bar. But it has character. Good on Wednesdays: $2.75 bottles"}
{"text":"A little loud but you really can't argue with these nachos. Huge, hearty, and enough to feed a family of 5 the King's Crown hasn't disappointed me once in the last 10 years.  Their breakfast food is really what does it for me though, I could eat nothing but Dee's huevos for days if it were up to me.  The atmosphere is a little gritty at times but generally cheerful. Some nights the crowd can be a little too 19-21 for my tastes but that's more of the personal preference.  Go, you'll like it!"}
{"text":"Good ol' faithful.  I may not come here as often as I did in my 20s, but it's a place where I know I can buy cheap beer and eat Tex-Mex food at 3 am.   Nowadays, I mainly come to Dee's for the shows which are held upstairs. It plays host to a lot of indie music festivals like NxNE and Canadian Music Week, and I've rarely seen the place empty because it's a popular concert venue.   Helpful tip: If you happen to be stuck in the middle of the floor, you will get wrapped up in a moshpit. These even happen at folk-rock shows, not just punk shows. I know, it's weird. But who knew that kind of music inspires people to mosh?   And when the crowds gets going you might also feel that the floor is bouncing. I've often wondered if one day it will cave in onto the restaurant below. But rest assured that it hasn't happened and it hopefully won't.   Sneaky Dee's has maintained its high level of grittiness over the years. The washrooms are not a place you ever want to get sick in. The tables are uneven and the booths are an archeological collection of scribbles describing past loves and eternal friendships.   Their menu is pretty extensive but a must order item is King Crown special. Even the poutine, not being an authentic one, is damn good. Well, it tastes damn good at 3 am. All of the portions are very large so make sure to come here hungry.  I've enjoyed many special moments here, even dancing on stage with the local electro-indie band, Rouge, at 3 am. Sneaky Dee's will always remain dear in my indie rock heart."}
{"text":"This place is a great grungy/dive bar. It's food is plentiful and cheap, and it's beer selection is... er.... well it's OK... Just stick to the food, and the milkshakes. I actually love going here for lunch, of all things. There are better drinky bars nearby but the nachos, fajitas, burritos and enchiladas are all super tasty and worth going to."}
{"text":"A friend and I were in Toronto for a concert in May, and after doing some drinking at a small Kensington Market bar the night before, started getting pretty hungry. It being around 2am and us being unable to use Yelp to figure out which restaurants were still serving, we decided to ask two local passers by where we could eat. Turned out to be the best possible thing we could've done.  Our new friends walked us over to Sneaky Dee's, which I loved as soon as I stepped foot in the door. (I have a weakness for dive bars with gratuitous graffiti.) We all got a big booth, and on the local's recommendation, ordered the vegan nachos. I was silently upset by this because HOW COULD NACHOS WITHOUT CHEESE BE GOOD? But here's the thing--THEY WERE BETTER THAN GOOD! They were nothing short of amazing...very generous portions, between three of us, one order of vegan nachos filled all of us up! On top of the awesome atmosphere and food, the staff is friendly and they play great music. Definitely a place that I would recommend to anyone who happens to find him or herself nearby, or even just in the city (the nachos are definitely worth going out of your way for)."}
{"text":"I like this place for what it is. Has a big collage crowd, nothing fancy a bit grungy. Depending on what night you go, you'll get a bit of a different crowd. They have everything from shows upstairs to themed night. It's not really a typical place for a date but a good time to meet up with friends & let your hair down.   The menu is good. Not a 5 star restraint but really good food. Have a good amount of gluten free & vegan options on top of meat eating options. Drinks are good priced, decent beer list.  I think it's a place you need to check out if your from Toronto."}
{"text":"Can someone tell the dumbass bouncers to not aSk for I.D for people who are approaching 50 years of age. I kid you not!"}
{"text":"I can hardly believe it's been over half a year of my Yelping and I haven't yet reviewed Sneaky Dee's!!!!!  Good gravy, what have I been waiting for?!?!  I was introduced to Sneaks within a week of moving to the city many moons ago; not quite sober yet not quite trashed, I came across their guac and nachos and fell in love.  I've gone through many Must Have's over the years (my current are the Greek Nachos with guac), and never been disappointed.  Well....except with the poutine (Sorry, SD, but you're tex mex!  Stick with those goods).  I have only been able to order an alcoholic beverage a handful of times I've been, and I usually go with a Big Wheel, but the fact they HAVE Big Wheel does say something.   The service wavers: some nights have been exceptional, with our server coming and checking on us and bringing our tipsy selves jug after jug of water, while other nights we've wondered if our booth is located in an alternate universe which can't be seen by mere mortals.  Sometimes pretentious and haughty, other times laid back with the relaxation of someone you'd like to have join your party, if they weren't to bring you your beloved nachos in the next 15 minutes.  That said, these guys deserve a lot of props for handling the sheer number of drunken idiots (self included, at times!) until 4:30 or 5am.    I've been a handful of times to the concerts and dance parties upstairs as well.   Saturday night's Shake a Tail leads to line ups down College Street.  An enjoyable evening, usually topped off with, you guessed it, a trip downstairs, though that does require potentially lining up again.    An institution in Toronto; if you're coming for a visit, or have just moved into town, you really must check it out!"}
{"text":"WEDNESDAY. F-ING. NIGHTS. 90's hip hop. Huge fan, although the music has gotten progressively worse over the past year :( I think they changed up the DJs. Admittedly, a groupie of the naked rapper.  PROS: Nice security/bouncers, good drunk food, $4.50 mixed drinks CONS: Hipster central"}
{"text":"Best nachos ever. The real deal. The greatest. Great vibe. it's a dive but it's rad.  the drinks are cheap. regular nachos!"}
{"text":"This was my second visit to this fine establishment, I had a lovely time chowing on a tasty breakfast and checking out the graffiti discourse of Torontonians and other visitors of Sneaky Dee's.This is bar/restaurant/music venue that is a welcome respite from the mean streets of Toronto at any time of day.  I've been told that Sneaky Dee's is the place to go for a big plate of nachos and some beers - I happened to be here for my first meal of the day so nachos and beer weren't necessarily what I was looking for but they did have an excellent selection of Mexican style breakfasts (Served all day!) I went for the Burro Favorito and wasn't disappointed: Scrambled eggs and cheese in a tortilla and then topped with salsa mole and then served with rice, beans (frijoles) and salad. The meal was good, could have used a bit more spice - but that is what hot sauce is for! It normally comes with sausage as well so perhaps if I had not omitted it the spice factor would have been enhanced. The one thing that wasn't so great were they frijoles (which is too bad because I really, really love baked beans). They were bland and I ended up leaving the majority of them on my plate being to enamored with the remainder of my meal.  The place has a very specific aesthetic - random tidbits of knowledge and thoughts to ponder graffitied all over the walls and benches. It's what makes Sneaky Dee's Sneaky Dee's. It is what it is, and I am a fan."}
{"text":"There has not been one Mexican resto in Toronto that really impressed me.. and the Guadalajara (2 enchiladas & 1 taco served with rice, frijoles & ensalada) I had was medicore.  King's Crown (mountain of nachos with every topping imaginable) is a great sharing dish though.  The decor is pretty retro and fits the feel of that street well, grungy hipster.  I'd come here for cheap drinks if I'm around the area, but def wouldn't go out of my way to come for anything"}
{"text":"After reading the reviews, my husband and I decided to give this place a go while we were in the city.  We walked in and the place was packed, which made me more excited about the place.  Upstairs, there was a dance area and downstairs was the restaurant area.  Since the place was full, we waited about 15 minutes to be seated.  We waited for a while to be greeted by our waitress.  I decided to be patient since it was packed, but when she did greet us, she was not very nice.  After about 30 minutes, we gave our orders.  I ordered the chicken burrito and my husband ordered the pulled pork burrito and a drink.  We waited again for quite some time for the food.  When we finally got our food, I was so upset.  To wait so long to get something of such poor quality was definitely not impressive.  The chicken was not seasoned at all and tasted like it came out of a can.  I ate the tortilla and cheese around it and finally decided that I did not want it.  The side salad was pretty good, but I was over it after that disgusting burrito.  My husband's food was ok.  Finally, our waitress came back and asked me why I was not eating my food.  I explained to her why and she frowned a little and took my plate away.  I assumed she would do something to rectify the situation, but instead she just brought us our bill (with the chicken burrito included).  I expected some sort of solution to my complaint but she did not seem to care that I paid $15+ for something I barely touched.  I will NEVER visit this place again."}
{"text":"Quite arguably the best wings and nachos you can find in the city. If you haven't been here, it's high time you plan a visit.   Tip: No need to wear your Sunday best... :)"}
{"text":"This rating is for the nachos only. Because as far as I'm concerned, their nachos will more than compensate for any bad experience you could possibly have here.  There are so many nachos that even yo momma couldn't finish them all (...is that an inappropriate comment on a public forum?). They come in a huge pile.  I went on Wednesday. There's a special with a pitcher of beer and Kings Cross nachos (salsa, frijoles, ground beef, tomatoes, onions, mixed peppers, jalapenos, melted cheese, guacamole, sour cream...are you drooling yet? because I am, writing this description...) all for around $20. yumm!!  Wednesday is officially the best day of the week. Move over, Friday. We we we so excited for Wednesday.  PS, valuable life lessons all over the walls, in the bathroom, over the tables..."}
{"text":"By far one of the best brunches in the city. It is a bit of college grunge which gives its character.   Not so much on the drink selection but still on the cheap side."}
{"text":"I Always get the nachos cause they are fully loaded and delicious, but this last time we also decided to share the avocado spring rolls- not bad, not great the sweet Thai sauce is the saving grace. Total Dive bar, definitely not my idea of a date spot but a cool, chill place to go with friends l"}
{"text":"Oh this place is where you should be when you're craving mexican comfort food. It's so good here and the atmosphere just makes it better. Graffiti walls, pitchers of beer, hipster waiters. It's literally the place you should be on a Friday night!! Food is good never lets you down, and it's not too expensive either for the huge portions they give you. If you're a night owl this is the place for you because the close at 3 on Weekdays!"}
{"text":"Me and my husband came here for a Thanksgiving dinner. We recently moved here from Europe and have never experienced a real Canadian/American Thanksgiving dinner so we were extremely excited to try our first one. We called several restaurants, trying to book a table, however they all seemed to be overbooked. Finally we called Sneaky Dee's and they informed us they don't take reservations but assured us there would be plenty of space in case we decided to come there for dinner. So we went... Ordered the turkey dinner and didn't have to wait long at all before the food was served. It consisted of carved turkey, both white and dark meat so everyone can be satisfied. This was a big plus in our eyes since let's face it, everyone likes different parts of the turkey. Turkey was so moist and tender. In fact so tender that it was falling apart. So delicious! Mash potato, delicious stuffing, gravy and cranberries. On the side we got some caramelised vegetables which were very tasty. Oh and as if this wasn't enough they also served dinner roll. The meal was so good and filling.  Following this amazing meal we decided to share a piece of pumpkin pie. Portion was pretty big and pie delicious! Have nothing to complain about!  Our server was so nice and made sure we were happy with the service and everything else. The price for this amazing turkey dinner was only $19!!! Compare that to all other restaurants we called, which were in the range $40-$90!!!  Needless to say we left the restaurant very stuffed and pleased! We'll definitely return next Thanksgiving and we recommend anyone who can't cook a full Thanksgiving meal at home to enjoy this delicious turkey dinner at Sneaky Dee's."}
{"text":"The food was filling but not particularly impressive. As iconic as this place is, I don't see myself returning anytime soon. Seating was okay, but there is something that feels dirty..."}
{"text":"I really like this place. The food was surprisingly good, but service was just ok.   It was packed and we asked for fajitas. Boy, they were HUGE. They got our order wrong (chicken instead of shrimp) but this was no big deal. Prices are VERY reasonable, I strongly suggest sharing the platters with one OR MORE friends.   I can't wait to come back for more unhealthy food there."}
{"text":"My sister and I were going on a bit of a food tour and I was happy we stopped here. We ordered the Kings Crown Nachos and they did not disappoint. The chips were delicious and the whopping helpings of guacamole and sour cream were perfection. I just wish the beef and the beans were a bit more spread around. It turns out they were all in the center. Service was also super quick and kind. All in all a good experience and I'd definitely go back!"}
{"text":"I couldn't believe it. Tex Mex so far from home!!! Yes, I am a Texan girl through and through, born and raised in Houston.   I really only came here because everyone told me this place was great for music, drinks, and nachos!  I didn't have the nachos, but the wraps were pretty tasty. IDK if I would say its legit Tex-Mex, but I was happy with the food in general. 3 out of 5 stars.  But the nightlife upstairs is two thumbs up, the drinks and prices are very good!"}
{"text":"Finally I return to Sneaky Dees now that I finally won't be turned away for being underage. Came in on a Monday and there were tons of specials for everyone. The place was pretty busy for a Monday night but service was awesome!  Ordered an amaretto sour which was part of the special for the day so it was only $4 it was super good why can't my attempts at making an amaretto sour at home be this good. For food we had the mexi-dip platter to share and it was pretty tasty chips and dips. Then for my main I ordered the Burrito grande and it was awesome! I was so full there is tons of food in the order and they were really friendly about my customization (no veggies) which a lot of people don't take too well.  It's Tex-Mex so you should expect that when going in but when you're in the mood for some awesome Tex-Mex this is your place! It's delicious and not over priced one of my all time favourite places downtown. If you've never been to Sneakys you have to go!"}
{"text":"I'd heard amazing things about the nachos at Sneaky Dee's. Since I consider myself somewhat of a nacho connoisseur, I came twice to try them out.  The King's Crown is the way to go. Even if you don't eat meat, get the King's Crown without meat instead of the vegetarian nachos. The food here is a bit better than you'd expect for the price."}
{"text":"Sneaky Dee's serves up affordable and filling Tex mex food. On top of that they have daily specials you'll want to take advantage of. The nachos there are legendary. They are gigantic and as I remember pretty good. Definitely something you'll want to share. One time I ate a whole plate of nachos myself and that was a mistake. The enchilada and taco combos are a good value. My wife is also a big fan of the huevos rancheros and gets it for brunch and dinner. The highlight is that it comes in a tortilla bowl.  Th ambiance is very punk. From the graffiti on the walls and the music that is pumping through the speakers. It's generally a place for the young adult to hang with friends, or perhaps share a plate of nachos on a first date.   The downsize is that none of the food is spectacular. The bigger downsize is they do not separate cheques which is a reason why I felt I needed to update my review to a 3 star. I've been there multiple times in the past and I'm sure I will find myself there again in the future. It's an institution and right of passage for every Torontonian."}
{"text":"What took me so long to review you, my Mexican lover???   I am sorry I forgot about you, old friend. You are the most dependable nightspot near my apartment, where I don't feel guilty about spending because you provide food and drink at little cost. You also tempt my friends with these offerings so I often run into a couple other friends each time I am there.   Your music is sometimes too loud and you never have enough tables, but you know what, Dees? You introduced me to Billy Corgan once, sitting in that booth under the TV, and therefore I am forever grateful.   Long live the dirtiest Mexican bar in Toronto!  (Useful tip: NEVER order the draft)"}
{"text":"I know this will come across as unfair, but I am from LA-- home to the best Mexican and true indie rock. Sneaky Dees has fake mexican (who knew salsa was ketchup + tabasco?) and fake rockers with skinny ties who want to make anyone over 25 feel like dinosaurs. Not so great in any aspect."}
{"text":"One of the best dives in town, this place is a Toronto institution. Huevos Rancheros on the breakfast menu is the best hangover cure, and make sure to go on Tuesday for half priced fajitas night.  Yeah, the service usually isnt the greatest, and occasionally my tummy hurts after, but cant beat this dive for amazing fajitas, nachos, and cheep beer.  I love Dee's though, and will always return."}
{"text":"The first night I arrived in Toronto, I was told multiple times by random encounters that the nachos at Sneaky Dee's are to die for. \"They're the best nachos in town.\" I looked at MCPhresh and I wondered how good could it be?   Enchiladas? Wait, that looks like a nacho chip. What am I eating? I swear, when you can't even distinguish the food, that's just a culinary blasphemy. My friend and I ordered a nacho plate with pulled pork, guacamole, avocado, beans and a ton of cheese. It's a very confusing dish. I think Torontians made a mistake in calling this a nacho. It's filled with so many toppings, I was a little disturbed halfway through. Sometimes I got a whole glob of avocado, other times I just get a bunch of beans on a nacho chip. I came to this place twice during my Toronto trip. The first one was in the afternoon and not knowing where to eat, I came in here and ordered the fajitas. As a daily special, it was definitely worth it, but I doubt I would pay full price for the item. The prices are a little hefty if the target is college students, but the quantity definitely redeems it. When I came in during the afternoon, I definitely had a hard time finding a place to sit because several seats were covered with a liquid of some sort. I've also ordered their wings because I have a wing fetish and it was drenched in so much sauce, I couldn't even recognize the bones or meat. Overall, it's comparable to a Pappy's back in Berkeley, except I would refrain from trying the food again. This is one place I would not miss for a long time.   My head feels a little heavy just from thinking about the food."}
{"text":"NO, Sneaky Dees does not have the best nachos in the city. I regret to inform you Jack Astors actually serves up better nachos. I tried the loaded veggie nachos and the plain nachos and both were nothing too special. The veggie ones came with way too much lettuce and were so soggy, we resorted to eating them with a fork. The portions were big when I was here for lunch (ordered fajitas) but it was rather difficult to stomach. The Mexican lunch options are pretty much identical and all come with the standard rice and beans. I also tried the plain nachos (just salsa and cheese) and they were pretty good but how hard is it to mess that up? The last night I was here, they ran out of Alexander Keiths for pitchers so the server suggested another brew in \"the same price range\". However that pitcher turned out to actually cost around $20, say what? The bill is also so confusing as theres 3 taxes listed and I'm still baffled to this day. Service is alright. I do like the atmosphere here but it tries too hard to be so relevant that it doesn't do it for me anymore. I'd come back,  but not that often. Sneaky Dees seems sneaky indeed."}
{"text":"Mediocre but cheap beer? Check. Hilariously graffiti covered washroom? Check. Often surly waitstaff that's seen it all? Check. Full Tex-Mex menu served after last call? CHECK!  I've had some great memories at Sneaky Dee's. Dozens and dozens of concerts and dance nights upstairs. Being there every Sunday evening for an entire summer for after kickball drinks and nachos. We even had Thanksgiving dinner there one year.  Sneak's isn't perfect. Yeah the service can be spotty. And yeah they've kicked out or cut off my friends before, but really it's their fault - you've got to know if you lie down in a bar you're done for the night. And yes the food isn't ever what I would classify as \"good\" - I'm well past the point of ever wanting to eat their sober or when the sun is out.  But the nachos! I'll order anything from the standard nacho platter (with guac baked in) to the mexi-dip platter to the epic king's crown. And the newest addition to their menu -THE DESTROYER - goes from epic to EPIC. Take the standard king's crown. Now replace the chips with fries. That's it. Welcome to the future of greasy food designed to soak up beer.  If I were 5 years younger I'd give Sneak Dee's 4 stars. Maybe 5 if I was writing this review at 4am, full of Cool lager and nachos. But now I'm a littler older and a little more discerning. Sneak's is still a pleasure, not even a guilty one, but one that I partake in less and less."}
{"text":"There are three things I remember distinctly about the last meal I had here: the hugeness of the portion size, the loudness of the atmosphere, and the deliciousness of the food. My friend and I ordered the veggie Cactus in the Valley nachos to split. I was really tempted to order the avocado spring rolls, but after getting the nachos, I realized that really wasn't necessary.  The nachos came on a huuuge plate. They were good and very filling. Definitely don't get an order for yourself. They're way too big for just one person. We kept eating and asking when they would end. I'd say the food was more than worth the money.  The service was good, quick, and friendly. A caution though: if you're not a fan of loud environments, don't go. Just don't. Also, be warned, they start carding after 8:30 or so. Despite the loudness, it was definitely well worth it, and I will be back."}
{"text":"Half price fajitas Tuesday + amsterdam blonde pitchers = need I say more? Consistently good tex-mex for cheap."}
{"text":"Full Disclaimer here. I once moonlight as the Door Girl for the Wednesday night shitstorm that is What's Poppin. A 90's hip hop night with a VERY young but enthusiastic crowd.   Now that that's out the way...I can honestly say I love this place. It's gross, greasy and grimey but to me it epitomizes MY Toronto.  It was the first recognizable landmark I that I used to navigate my way around Toronto when first exploring downtown Toronto in my youth.   My first experiences with Sneaky Dee's were at The Wavelength Music Series ( http://www.wavelengthtoronto.com ) which once called this place home. My life became centered around seeing some of today's best known Toronto based bands in their formative years. Fast forward to years later, not only is Sneaky Dee's consistently great for live music, you can always count on having a great time both upstairs and downstairs in the actual restaurant.   It is probably one of my all time favourite brunch places, it's RIDICULOUSLY affordable, it suits my hangover cravings for Eggs with a side of grease and toast. Their Nachos are to die for too.   I loved this place even before I \"worked there\" which is not to say that it doesn't have it's faults. Sometimes the security guards are a bit to intense. (Which I understand goes with the demographic of people coming out in droves) Most of their wait/bar staff are phenomenal, and considering how tough it can be to work in the service industry I commend them, there are a few bad apples nonetheless, but I tend to not sit in their section to avoid any issues. (Yup I'm there lots).  They also don't take debit so bring cash to avoid any issues.  Another notable thing: If bringing a big group, heads up that they don't take reservations. If you are wanting to take a big group to brunch go early (before 12) or you probably won't get a table.    Dee's is a true dive but it is the first place I take all my visitors from out of town, it's the only way to explain what Toronto means to me.  I know it seems kind of silly to have a level of nostalgia attached to a restaurant, but it's been nearly 10 years and I still keep rolling in all hours a day. Don't see myself stopping to go there any time soon."}
{"text":"Fresh yet flavorless; pretty much sums up my first visit back to this old landmark in 5 years. I don't mind the kitschy dive bar atmosphere with decent offerings on tap but the food needs a lot more oomph for sure. Ordered the Guadelajara which is a mix of a taco with some enchiladas and there was little to no flavor or salt throughout. I could tell the chicken was fresh and moist but the seasoning was nowhere to be found to be even considered standard Tex Mex. The house hot sauces are laughable and taste like watered down tabasco sauce. The plate price doesn't warrant the bland and overcooked state of most of the dishes, redo your recipes and you'll do fine. If you want (yes you SD management), you can message me and I'll give you my traditional mexican tinga recipe that'll wow your guests.  Double check your bill, I noticed some other charges that didn't come from our table though it was rectified in short order after bringing it up to the waiter."}
{"text":"What can I even say about Sneaks that hasn't already been said? I frequent the Bathurs &  College area A LOT, and Sneak's has that quintessential, almost ICONIC bleach smell emanating from the corner where it's back faces the alley way. Walk in, and you're hit with that smell again, but only with more Nacho aroma. Ahhhhh Bleachy bleach smell, I know I am home when I smell that smell. And then I get to thinking, holy schniekes! How dirt infested and germey is this place that they need to use enough bleach that you can smell from OUTSIDE to sanitize their restaurant?! But hey, points for cleanliness? And I guess smelly dirty hipsters & hippies stink up the place too.  The food: Sneaky Dee's like to pretend it serves authentic Tex Mex, but for them, Tex Mex is: Mexican food, westernized with LITERALLY NO FLAVOUR. I've had the beef tacos, and the meat just tasted like chopped cardboard. Their refried beans - you guessed it, like cardboard...but mushy...They just tend to slather everything in canned salsa and shitty cheese and call it a day. But portions are on the large side, and depending on what you order, you can get yourself a pretty good hangover meal.  The Nachos are what make them truly glorious. Oh god, my mouth is straight-up watering thinking about the Nachos. Seriously, get the Nachos, the King Nachos, you will get your life right if you split the nachos with a friend, because sharing Sneaky Dee's Nachos is a special moment and you and your friend will be tied for life forever, like NACHO BROTHERS or NACHO SISTERS. It's a beautiful thing.  They also have an amazingly fun Wednesday dance night with Hip Hop, the songs are great and I danced till I was SICK (which means doing so much of Rihanna's pussy pat move, so aggressively, that my body just couldn't take it any more.)"}
{"text":"VIBE  It's dirty; dilapidated; there's always a scene outside. Let's just say I wouldn't want to use the bathroom here. But you can't call yourself a Torontonian until you've been here. It's a rite of passage.   I ATE I've only been here once but it was only for the nachos. On an empty stomach with a friend, you can polish it off. And it is so.worth.it. Bring a mini knife so you can engrave your initials in the booth or on the wall or on your waiter...whatever.   OBLIGATORY CATCHY REMARK  Don't let this one sneak you by even if it does look disgusting and you're cringing the whole way through. Maybe don't wash your hair for one night before you go?"}
{"text":"Cheap Beer, HUGE Portions and some dirty TexMex food.  It's so good your body is going to feel it the next day.  Sneaky Dee's is a Toronto institution, it's great for dinner, drinks or after drinks munchies.  The Kings Crown Nachos are by far the best in the city (just be sure to get the beans on the side, or everything goes mushy).  Anything Tex-Mex on the menu is kick-ass, and the Chicken Wings are big and surpringly tasty for a TexMex restaurant.  I dont' care how dirty this place is, it's fuckin' great!"}
{"text":"The food is horrible yet it is seemingly popular place and has been in business for yonks.... I think it's supported by the college aged kids who will eat about anything after a night out!"}
{"text":"This place is a gem, from the best damn nachos I've ever had, to the sweatiest dance parties I've ever wanted. It's a dive bar, that's the charm (and not one if those \"fake\" dive bars... You know the ones...). The graffiti is fun to read, the 90's era ceiling paintings are yin-yang-rific, yet the staff have almost always surprised me with their friendliness (don't ask for a split bill though... Bring your maths). I even got a really nice hug from the bouncer when I was having a tough night.   I'd go here almost any time of day for different reasons, even though I don't have enough tattoos to really blend with the scenery. Daytime for food, night time for dancing upstairs.   Warning to my single girls on dance-party-convoys: this not a great place to pick up bearded-tattooed boys at night. They're here, but they've been dragged by girlfriends or they aren't interested in your 'equipment' *achem*. At least that has been something me and my ladies have noticed.... Great place for a retro dance night with just the girls though!"}
{"text":"Their nachos maybe expensive but taste sooooo good! I also tried the tofu avocado roll with a side of fries. The fries where okay but the roll so very tasty. Their food is made to order so it's fresh. The interior is pretty funky as they have presented street art. If u go downstairs to the washrooms the lighting is great to take some pics"}
{"text":"After a couple of visits now I can safely say I don't see why the reviews of this place are so high. Sure it's a dive bar, so I won't dock stars for the decor. I can honestly say they got one star for having my fave beer in bottle, I don't think I'd want anything from the taps here.   The Jays game was on, bonus, the crowd was into it, being the first time we've seen playoff baseball in this town in 22 years I was happy to be here to watch.   We were sat quickly considering the crowd, wicked timing. We perused the menu, I decided on the steak quesadilla. Unfortunately that was where the good times ended as our food arrived and sheer disappointment as I ate my quesadilla. Bland at first, way to much cheese I realized the cheese was probably covering a poor cut off meat as my next bite was full of fat. I gagged almost vomiting if back out. Unfortunately for me, my wife likes this place, hopefully she won't drag me with her next time. I'd be really hard pressed to eat here again."}
{"text":"I love Sneaky Dees so much sometimes I dream about it. It's always one of my favourite places to stop in Toronto! I love the king nachos! and the hangover breakfast options are great too!"}
{"text":"I've only ever been to SD's in the afternoons and it feels very much like an outpost in the wild, wild west. Think of your favorite Western and that's SD for y'all in the afternoons, but with a very mixed crowd.  Had the washrooms been even an iota more inviting, I would've spent hours just absorbing the teachings of various patrons, penned haphazardly on the walls. Scribbled on the wall are nuggets of wisdom touching almost every aspect of life:sex, drugs, violence and rock and roll!  Their food can be hit or miss. We had the King Nacho's and were disappointed. Piled high  with some great guac but also with too much refried beans. There was barely any meat and not much cheese or anything else for that matter. It also felt that the fillings were unevenly distributed, all the cheese, beans etc were concentrated on one end! The King Nachos can easily feed a group of 4 people, which we were.  Their suicide and mild chicken wings are both good: crispy, juicy and delicious. Their hot, hot sauce is g-r-e-a-t: not very vinegary, and not very watery.   All that food washed down with a couple $4 large Grolschs put me in a food coma.  They have this thing that sounds like a bug zapper but I hope it isnt. It make a loud sizzling/sparking noise at periodic intervals, which is jolting. Does anyone know that exactly that thing is?  The service is pretty efficient.  Grungy SD's is A-OK!"}
{"text":"While visiting Toronto I was brought to Sneaks for pop punk Tuesday. This is an interesting little place. I was not too stoked on paying five dollars cover so that I could listen to The Used and Moneen all night, but sucked it up as my friend was rather excited to show me this place, and was buying drinks.   Had I scoped Yelp before hand and realized the food ruled here, I probably would have dragged myself downstairs for some vegan tex mex as mentioned in some of these other reviews. Instead, I hung out upstairs drinking from their shitty selection of beers and watching grown men in their 30s who hadn't grown out of their \"scene kid\" stage try and pick up 19 year old girls, all to the soundtracks of my youth. If you feel like yelling out Taking Back Sunday lyrics really loudly into the faces of strangers, this might just be your place.   SHE SAID \"DOOOOON'T.... DON'T LET IT GO TO YOUR HEAD! BOYS LIKE YOU ARE A DIIIIME A DOZEN! BOYS LIKE YOU ARE A DIME A DOZEN!\" SHE SAID, \"YOU'RE A TOUCH OVER RAAATED, YOU'RE A LUSH AND I HAAATE IT\" BUT THESE GRASS STAINS ON MY KNEES THEY DON'T MEAN A THING.  If you stay until last call, you even get to witness what jerks the bouncers can be when they kick everybody out for the night.   Now I want nachos."}
{"text":"I don't get it.   Over the years living and working in Toronto, Sneaky Dee's has come up in conversation more than once. So when my friend and I were wandering in the direction of this popular restaurant, I was game to see what they had to offer.  Sneaky Dee's is a cleanish place that I could see live bands and some serious drinking happening at every weekend (and possibly during the week). Service was prompt and relatively friendly but nothing to write home about. They have a very large menu, lots of things to choose from, but after reading lots of reviews about the nachos, my friend and I decided to split an order of the Kings Crown: crisp corn tortilla chips covered with salsa roja, piled high with frijoles, ground beef, tomatoes, onions, mixed peppers, jalapenos, melted cheese, topped with guacamole & sour cream.   Food came out quickly and in front of me was a towering pile of nachos with sour cream and quac piled generously on the very top of this stack. And so we dug in.   First of all, love how generous they were with some of the toppings but as I was eating and at the very end, I noticed that whoever came up with this dish really wasn't thinking about the person who would be dining on said nachos. It wasn't until I'd eaten almost half my side that I found the ground beef, all stacked in the middle. Not only that, but the cheese wasn't actually melted all the way through. I get it, you put the plate of nachos in the salamander and melted it that way. Fine. But when I'm pulling apart the cheese to adorn my nacho and the bottom is still in its hardened state, while the top has melted to make a chunky mess, I'm not a fan. There were far too many beans lying around and since I didn't get to the meat for a while, it was fine, but I was annoyed once all that glorious meat was discovered in the middle of the stack. Meat over beans anyday. But the toppings were haphazardly thrown on and if I was sharing with a group, I probably would have entirely missed a few toppings, much as I missed the beef. When it came to actually eating this mess of nachos (\"mess\" meant in both ways), the sour cream and quac weren't well placed. It started to fall over to my friend's side of the plate.  Super disappointed with this place, especially after reading all the stellar reviews online. Unless you're a regular or you're coming here for drinks and a show, don't waste your time. There are lots of better eats around Toronto than Sneaky Dee's."}
{"text":"A true gem of kitch and hipster trashiness in our majestic city. They just need to sort out their hot sauce situation. Bring back the different flavors! Get your nacho on and never look back."}
{"text":"This review will focus on chicken wings (like many of my pub reviews).  Like Chirs P's burrito, the wings here were 3 stars but everything else was a solid 4 stars.  We finished up the Yelp cupcake crawl here and it was amazing good times.  The beer here is CHEAP.  under 6$ a premium pint.  Amazing.  They made room at the back for our large crew and the waitress was amazingly patient and nice.  It was a great place to wrap the day.  The washrooms are not clean, down some sketchy stairs, and the only way to distinguish the ladies from the gents is the presence of or lack of urinals.  It was strange to me that they had updated sinks when everything else about them was so horrific.  On to the wings... They were unbreaded (good), crispy (good), saucy (good effort) and plentiful.  I didn't like the sauce.  It was ketckupy but still hot... which was not what I wanted.  My real issue here was the dip with the veggies.  It was avacado sour cream... and just not my thing.  It was bland (probably a bonus if you got the hot wings) and not as good as dill or bleu cheese.  I am willing to branch out and try new dips, but they have to be good.  That's how dill found it's place in my heart.... sour cream avacado, never will."}
{"text":"Really crappy beer options. The portions are good, but the food is mediocre. Not a bad place to just hang with friends to socialize, but not a place I would visit for good food and drinks."}
{"text":"Love the vibe here. It's always busy any night of the week. Beer is cheap and the Nachos are great. I love how they will play a whole cd as well. Live music upstairs most nights of the week. Just a great dive bar."}
{"text":"Pub food with a hipster vibe. Service was somewhat absent and cold. The food is decent-tasting but terrible for your health: nachos, jalapeño poppers, and potato skins full of runny chili with sour cream on everything.  When asking if they had certain beer, the answer was \"no, we don't have any high class beer.\" It was informative with an underlying hint of hipster snobbery. They are focusing on local beer (Mill St., Amsterdam) but also have some regular kinds. No white beer. Mostly draught.  This is a decent place to go if you're poor, are a hipster, or wanna have a  down-to-earth night out. The crowd appears to be mostly students.  They also have a $3.25 breakfast special Monday through Friday.  The location is central. This is a very popular spot . I like the idea of this spot and wanna like it more but our server kinda took away from the experience."}
{"text":"I was recently in (what quickly turned into) a heated debate in defense of my beloved Dee's. My friend who once lived briefly in Toronto recalled in horror, referring to it as \"disgusting\" with \"sticky-ass\" floors which she was only willing to go to if she \"really had to\".  To each their own (I begrudgingly suppose), but if you were smart enough to ask me though, Sneaky Dee's, is a good bet for drinks and dinner on almost any night of the week and even some reckless dancing and live shows if you're in luck and the right mood. And if the floor has ever been sticky, I haven't noticed - especially after sharing a few too many $10 jugs of Cool beer that may or may not taste like warm pee. Yes, a few of you know what I'm talking about.  It was not until last night while sitting in front of the beer fridge pointing out all the local and national beers to my friend who's from out of town, did I realize that there were so many in stock. To think that I've been kept such a happy regular with just their draft offerings!  The food is Mexican enough if you're not a Mexican connoisseur. The vegetarian ($11) and crown ($13) nachos are more than satisfying and perfect for sharing. The wings can be a bit too vinegary, but are huge and a great deal when ordered with a pitcher of beer on Mondays. Daily specials like fajita night are a good reason for a casual weekday catch up with friends.  Come with unpretentious friends, share some good eats, drink some cheap beer, and take some advice from the graffiti on the bathroom walls."}
{"text":"This place is overrated. I heard many good things about this place and how big their fajitas and nachoes are. Honestly, they weren't that big. Both nachoes and fajitas had a disporportionate amount of beans and not enough of everything else.   More specifically about their fajitas, they did not come with cheese or shredded lettuce. Downer. And also, my table ordered 4 fajitas and only got 12 tortilla wraps. They charged us 50 cents for additional wraps.  Regarding the drinks, my friend ordered a vodka cranberry double. They made her a single in a taller glass and then when I asked them about it, they shot me down. Finally, they realized they were wrong and sent another shot to the table.  This location also does not separate bills and only takes cash.   Overall, I did not have a good experience. The atmosphere was good and the music was good, however  food and service was mediocre."}
{"text":"KINGS CROWN NACHOS = DELICIOUS   Went to Sneaky Dee's on a not-so-busy afternoon. I understand the whole graffiti interior is a part of the restaurant and its theme, but I wasn't much of a fan. My cousin and I ordered Kings Crown Nachos and it was really good and delicious. Between us two, it was somewhat filling, we were gonna onder a another dish but we decided to just leave and get dessert at another place. Anyways, the sour cream, guac, and frijoles were plenty but I kinda expected a bigger portion. Nevertheless, the nachos here are really good."}
{"text":"When I forst came here I thought it was a bit pricy ubtil I got my plate of food. Its a lot. I come for brunch on weekends all the time. More of the rock alternative atmosphere.  But dont let that intidimate you everyone is welcome. Staff are kind. They dont take debet and dont spilt bills. Who dosnt split bills?"}
{"text":"Lively vibe. Very loud. Decent food. Great drinks and service is good. It gets pretty busy so make sure you beat the rush so you wont have to wait outside in a huge line."}
{"text":"Ever see that Simpson's episode that ends with President Ford asking Homer if he likes beer and nachos?   Well, if you did, you've pretty much captured Sneaky Dee's culinary strengths.   Sure, the breakfast is a perfect greasebomb of a hangover cure, and the plated mexican food harkens back to the glory days of ChiChis (in the best possible way), but really, Dee's is about cheap pitchers of cold beer, and huge plates of nachos.   Lie to yourself. Call the salsa and guac a salad. I don't care.   Beer.   Nachos.   That is all."}
{"text":"I only experienced the concert venue and not the restaurant.  The place is upstairs and long and narrow. It's small-ish but not tiny. The stage is a few feet off the ground. The acoustics were fairly decent. They were at about 2/3 capacity on a Friday night with semi-popular local bands.  It's got a sort of dive bar feel. Good for metal shows. Don't expect anything clean or polished.  Would return."}
{"text":"I'd heard so many good things about Sneaky Dee's from people I know who live in Toronto. My trip was strictly for food (I would love to go back to experience Emo Night).  Ambience was right up my alley when I was 16. I loved the graffiti walls and punk rock look. Nothing to rave about but it gave me lots of feelings of nostalgia. My only complaint however was the blaring metal to the point where even our server couldn't hear our orders. I didn't mind the metal, but others in my group weren't thrilled.    The food was delicious (could've been a teeny but more seasoned for a Mexican place). The frijoles were amazing and I could've eaten a disgusting amount of them. We had the Kings Crown nachos and Sneaky's Dip. The nacho were loaded with toppings and pretty tasty. I would've liked more chips though. The guacamole they put on top, holy shit was the best guacamole I've ever had, I would've eaten it with a freakin spoon it was so good. The sneakys Dip was basically a quesadilla with hot sauce on the side but it was delicious. Lots of cheese and the tortilla was crispy on the outside.   For the main course, my sister had tacos which looked delicious and didn't fall apart, a huge bonus! My fiancé had pulled pork enchiladas which were amazing as well. The pulled pork had great flavour, he said it was his new fave pulled pork. My parents both had enchiladas and both said they were stuffed full of meat. The only negative was we had to pay for refills for our pop. I don't remember the last time I went somewhere where soft drink refills weren't free.   Service was okay. Our waiter was polite but we waited quite a while for simple desserts (ice cream and pie). They didn't really have the place split into sections.   I'd definitely go back strictly for the guac and frijoles."}
{"text":"Best toddler friendly tex-mex punk bar around. Children welcome until 9pm (then 19+). Staff are very accommodating, you can get a side order of pretty much anything if you ask politely. Sometimes they have crayons. And no one judges when your kid gets bored or dances in the aisle to metal or decides to nap in the booth."}
{"text":"Only go if you want the King's Crown Nachos, Tuesday Fajita special and maybe the avocado spring rolls (I'm a sucker for a good spin). Also go with money in hand, as they don't take debit and can't split bills.  Expect to: - Eat a large portion of average food - Not see anything for awhile unless you know the pirate trick to seeing in dim light or you have really good night vision - Not be seated, though there's a sign there telling you to wait - Be treated like a chore by *some* of the wait staff, who ask you if they can give you the bill early because they'd really like to leave now. Oh and that empty water glass? Get up and fill it yourself because no other server will stop as you wave your to get their attention as they walk by quickly with their head down - Read funny things in the bathroom stalls. Find the \"make him pay for the date\" one and you're sure to laugh at the comments.   The washrooms have always been clean the 5+ times I've been there.  Update: Blech, seriously just order the above mentioned food items. Everything else is CRAPOLA. Waitress didn't even ask if everything was okay when we answered with a resounding \"NO!\" to her offer of packing our food to go."}
{"text":"Everyone seems to love this place! This was my second time there. It's not bad. But it's not great either. The food prices are decent, and so are the pints. They've got specials pretty much every day, and they have a pretty good all day breakfast that goes right into the evening too.   The servers are friendly though and I've heard of the servers that people have crushes on. I can see why. There's this really cute inked up server with glasses and red hair that I particulary like. The place seems to attract the whole suicide girl and hipster scene. The place is all graphed up from the people to the walls to the seating area.  Food was nothing special though other than the monster portion sizes. I have yet to try the signature dish, their nacho platters. I've seen them walk by when I was there, and it always made me wish I had ordered them as a meal.   I'd recommend this place if you're looking for cheap eats and comfort food. Other than that, nothing really catches my eye other than good price, ok food, great portions."}
{"text":"Five weeks into my Toronto experiment, I was starting to get just a tad homesick.  It's been since January that I enjoyed the greasy, spicy and cheap Tex-Mex that so defined my Dallas childhood and most of my adult years.  I love international foods, and Toronto delivers on my expectations for this, but sometimes you just want that dinner that reminds you of Friday nights at the local restaurant with your family and friends.  Now, Sneaky Dees still maintains some Toronto flair, and I would classify it as just a standard dive before calling it a true Tex-Mex restaurant., burgers and wings being a substantial portion of the menu.  But they get the spirit of my favourite cantinas very well.    The decor is tacky but balanced, sports are playing on just a few TVs, there is no bullshit standard dress code for the wait staff and the patrons are smiling.  Yes, my friends, we have comfort food.  We began with a pitcher of beer, I chose Amsterdam Blonde for no other reason than it enabled me to explain to my friends that I just like blondes.  The beer was a perfect choice, as it was cheap (finally, a drink value!), light and had a minor undertone of honey.  I had a hankering for nachos, and ordered the veggie version.  I've been on a tirade for weeks that, likely based on my own poor decisions on where to eat, that I just can't find food that delivers the spicy kick I require.  Between Indian and Thai, two foods known for making westerners beg for a glass of milk, I just can't find anything more than a slight tingle to my tongue.  After advising my waitress of this problem, she decided that she could prescribe a remedy - house habanero sauce.  Oh caustic capsicum filled bonnets of fury.  While the habaneros were certainly diluted for the tastes of the mere mortal, I was finally able to enjoy food that caused the mildest of sweats upon my brow.    The nachos, somewhat pedestrian, using thin bagged chips, a salsa roja that tasted more like tomato sauce and lacking in jalapenos (an oversight by the chef), were wonderfully filling vessels for this ulcer inducing liquid.  I do look forward to trying some other items, such as the restaurant's take on burritos and tacos.  Rest assured, though, that I'll be returning for fun, hot sauce and cheap beer.  Give this place a shot when you're wearing some jeans, a tee shirt and hanging out with good relaxing friends."}
{"text":"I kind of adore Sneaky Dee's. It's grungy and loud, the service is passable, the beer selection is kind of crappy, but the prices are so cheap, the food is fun and you can write on the walls. After a few years without going to sneaky dee's, I returned last night to its warm embrace. $12 pitchers of beer and nachos can make for a hell of a night. And I love the buzzer, you can hear when your food is ready before it gets to you. Inc-red-ible."}
{"text":"I have been to Sneaky Dee's a few times for drinks, but when I first moved to Toronto but I never tried the food. After reading that Sneaky Dee's had some of the *best* nachos in the GTA, I had to try them. Me and my husband tried the King's Cup nachos ($24), with beef, beans, cheese, a huge scoop of guacamole and sour cream and the other traditional toppings. These didn't disappoint, and I'm already wanting to go back for more. The chips were very good quality - crisp, salty and fresh. The toppings were extremely generous. It was actually a challenge to finish the guacamole (one which I will accept). When it comes to nachos, I generally have a wooden leg, but I was very full after eating these nachos. These are probably the best restaurant nachos I've had - huge win!"}
{"text":"went there on two occasions, one for the 60s night and another time to grab dinner.  the 60s night was awesome.  the food on the other hand, i was kind of left with a bland feeling of the ambiance and food. i do not recommend the guacamole or anything i got (for that matter) but the service was friendly and the beer was cold."}
{"text":"Honestly, it looks like your average dirty college bar, rough around the edges. But after spending a couple of afternoons hanging out with coworkers and coming to a couple of Wednesday trivia nights, I can't think of a better social watering hole with affordable decent beer (I'll have an Amsterdam Big Wheel), that offers giant plates of nachos. The nachos are a MUST if you come with friends. They are generous with all the toppings and it's a glorious mess going through it. If you're looking to grab a quick bite without breaking the wallet, I recommend the BLT with fries (which isn't on the menu)."}
{"text":"Fun atmosphere, classic toronto hangout. The food is mostly fantastic, I'm not a huge fan of the nachos though. For a place that's famous for them, they're pretty generic. It's a little pricey. Beer selection isn't very broad. Don't take debit either!"}
{"text":"Hi! Sneeky dees is neat. Its grungy and unprotentious. The food is feel good mexican food, and its great! Limited gluten free options...but the ones that are, are great!   Ask for a glass of spumunte with your lunch or bfast and revel in the hilarity of your servers look of disgust lol. Spunte is great!   Service is great...very friendly. Treat them with respect and they will treat you with kindness."}
{"text":"Food quality excellent... Good place for young crowd to hangout in town... Service was good.. avacado spring roll was mouth watering.. good place for drinks and snacks... They serve breakfast as well.. Mexican style breakfast... Which sounds something different"}
{"text":"The food is great, nobody can deny that. Stellar nachos, awesome hot sauces. However, we got bad service two nights in a row.   The first night, the bouncer was rude, and the server treated me like an idiot for daring to ask if they had a cocktail menu (sorry, most places do, it's not that crazy of a request!).   The second night, our server virtually ignored us while giving other tables near us acceptable service. Our drinks were empty for a long time before we managed to finally flag him down. He seemed to keep walking by us as if we didn't exist, didn't even check to make sure our food was tasting fine.   I would go back because the food was just that good. It's a neat bar, and I know it's a Toronto favourite. Maybe that's why the service has slipped - they know people will come regardless. Still, service that atrocious isn't acceptable. Don't expect too much from the staff."}
{"text":"I had a pretty bad experience for my second visit. My friend and I sat down and it took awhile for our server to bring us the menus. It wasn't too busy when we arrived. After about 5 mins, the menus finally came and we were finally asked what we would like to drink from our server. After bringing us water, we were never attended again by our server. I tried waving down a server and this was when things went south. Both I and the server made eye contact, I thought he would attend to us, instead he acted as if he never saw me and walked away. He then came back and attended all the other tables around us except for ours. So, I tried again, this time I tried to wave down our server but, he was too busy attending other people. When he had a bit of time, he would talk with other employees there and was just inattentive. We sat there for 15mins trying to get the servers attention and in the end, I was just fed up and we left. I was really disappointed...   Attentive service is a major aspect to me when it comes to dining. I don't know if I'll give it another shot at this establishment, but until then, my 1 star rating will remain until I regain a positive experience."}
{"text":"I got the jalapeno poppers and enjoyed them but they taste like the frozen ones you get at the grocery store that you pop into the oven.   The Tres Taco's werent any good, the taco shells were soggy by the time it got to my table and the when I asked the waitress for salsa she seemed put off. She was so cranky.   My friends ordered \"cactus in the valley\" nacho's but found it extremly spicy and wasnt able to finish it.  The place was so loud and all the tables were so close together the other person could practically kiss me without leaning over.   I wasn't impressed at all and probably wont be back...sorry"}
{"text":"I am sure my review is, by this time, redundant. But I'll go for it, anyway. Seeing the famous and time-stopped sign while I ride the College streetcar (my second-home) is always an immense comfort, especially if I have been out of the city for awhile.  I won't usually turn down a request to hang out here, but it does not have quite the same allure it did for me a few years ago. To be honest, I never had the kind of cosmic relationship I know a lot of others did/do/will, but it will always be cool and 100% itself. I think the food's great for what it is, maybe just cuz \"Mexican\"- (yes, I know) is not all that common around here.   The nachos are over-rated and it's too expensive if you actually wanna get them super-loaded (nachos are one thing I would always rather make myself, at home. Infinitely better and cheaper). It also seems to be a given that service will be surly, almost like it's expected/done on purpose/creating an endless cycle. I hate that kind of thing, sfm. It's also kinda too dark for me to see my food, which I sometimes find distressing. The upstairs level has a pretty wide-range of events which have given me a wide-range of feelings over the years. Mostly good, usually interesting."}
{"text":"Sneaky Dees is a Toronto institution, I'll give it that. The drinks are cheap, the decor and atmosphere are retro-Toronto cool... But that's sorta it.   The glasses always smell strongly of bleach, the food is, frankly, revolting. I used to have their 3 dollar breakfast often. Over time it become progressively more disgusting until I just couldn't do it. People may say, \"but it's a 3 dollar breakfast, what do you expect?\" I expect to not be disgusted by my food no matter how much it costs. The bouncer's are total jerks and the serving staff is pretty inattentive. I've also had a few people tell me they got food poisoning... Not surprising.   Last time I had breakfast here the toast tasted like garlic on the edges, like someone had grabbed a random knife to cut it. Ugh.   I'd have drinks here - stay away from the food."}
{"text":"Came here to try their famous nachos. They were good but I wish they had a deconstructed version as the nachos got quite mushy after a bit. Still good though, but the price is pretty steep for a plate. Next time I'm giving the fajitas a try!"}
{"text":"I see some other reviews say they have the best nachos in Toronto - I'm going to elevate that to the best nachos I've had in my entire life. So many toppings - so much deliciousness! And they had a special: a pitcher of beer plus nachos for 20-something dollars. The last time I was at this bar, I was a 20-something. So great to revisit an old watering hole and so pleased it looks and feels the same... and tastes even better!"}
{"text":"Another mediocre burrito...sigh...  The burrito itself is 3 stars but everything else about Sneaky Dee's is 4 stars.  The burrito was very bland as it was just meat and refried beans with cheese melted on top (yeah I know that's the traditional Mexican way but I'm going to bitch about it anyways).  The plate came with rice and a \"salad\" which was a great addition to give the meal some flavour.  The vegan pumpkin cupcakes were awesome (for a vegan cupcake).  The service was pretty good but not anything worth cheering for.  The beer specials were great also ($3.95 for a pint)."}
{"text":"Excellent margaritas and nachos. The atmosphere was fun and relaxed. Considering how busy it was, the service was super friendly and really fast. I will definitely be back!"}
{"text":"Oh, Sneaky Dee's. I don't care that you've been infiltrated by U of T fraternities. I don't care that I've heard bad rumours about you. I don't care that I can't have my Wing Night (yes, it should be capitalized) without having it trashed by scantily clad seemingly 16-year-olds stumbling in drunk at all hours. I don't care that I can't step in there without seeing 15 people I know, 10 of whom I probably don't want to see.  I don't care because I will love you unconditionally no matter what. You have amazing cheap food, the best bar/restaurant atmosphere I've come across, and I have a memory at every booth. You have specials every night (my favourites are Monday's cheap wings + beer, and Wednesday's cheap beer), and you have cheap alcohol to drink all night long. And if you drink too much somewhere else, stop in and grab some legendary nachos (and poutine, if it was a really bad night) and they'll make everything awful disappear.  Best part is, you can spend the whole night there, and then come back for brunch. God, their brunch is good. I thought I would be grossed out by beans next to my eggs but I actually kind of loved it. And their eggs benedict is actually amazing. Who woulda thought.  I'm over your dance parties upstairs, but you do still have some awesome shows, which just means I'll get to eat more nachos. And because I love you so much, I'll probably keep coming back until I can't, and maybe I'll even end up being a parent who takes their kids there for dinner. THAT is how much I love you."}
{"text":"I'll make it quick since there are so many who have come before me: super good nachos in a packed place that has a my-roommate's-weird-stoner-friend ambience.  Appropriate for beginnings, middles, or ends to riotous binge nights."}
{"text":"Ah, good ol' Sneaks. It is great for partying on a Friday or Saturday night, and for nursing a hangover on Sunday afternoon.  I think I speak for a lot of Torontonians when I say that Sneaks has watched my penmanship transform over the years. Nestled in between a drawing of a butt and a boob, is the subtle evolution of my name in handwriting. The place has been violated by many a pen, marker and sharp object. Names, drawings and quotes are carved into the worn-out furniture. What's not to love about a somewhat organized chaos??  Other than its unique interior, Sneaky Dees has decent specials and a good menu. I love coming here for a good predrink and then the next day for brunch. They offer Mexican-style breakfasts and Gringo-style -- all 10 bucks and under. My personal favourite is the Eggs Benedict. If you come here for brunch, expect to be surrounded by half-dead hungover zombies.  Sneaks is busy on weekdays and on weekends. It's an awesome place for big groups, small groups and loners. The place is huge and seating options seem endless..although on a busy night, you might be waiting for a seat. Hipster Central.  BONUS: PERFECT SPOT FOR LATE-NIGHT NACHOS!  BONUS 2: CLUB UPSTAIRS WITH GREAT MUSIC"}
{"text":"It's always packed here but there's a lot to like when you can get a booth. Reasonable tv spread, good bet selection, and solid bar food. Notable especially for their nachos. Music is loud but not so much that you can't hear other people."}
{"text":"The only place in Toronto where I've ever been rejected for using my actual, government-issued, for-real ID.  The \"bouncer\" (doubt he actually has a security license) not only was rude to us, but he had to throw in some good, old-fashioned condescension when he called me \"sweetheart\" and made the implied threat that he was going to take my driver's license away from me because he thought it was a fake (and, once more, it was not).  All complaints I've made to the management have yet to be followed up on."}
{"text":"This is by far my favorite place to eat in Toronto. Why? Because nachos that's why. What more could a girl want then a giant plate a beautiful delicious nachos with extra cheese.  Let's start from the beginning. From the outside you might be confused as to what exactly Sneaky Dee's is. There's graffiti everywhere and when you come inside there's writing all over the walls. It's very interesting and obviously a fun environment.  On to the menu, there's a few things to choose from. Honestly, I can't bring myself to order anything other than nachos for my meal every single time. They also have brunch here which looks amazing. Now onto what you're here for-the food. Hands down best nachos I've ever eaten in my life. They come on a huge plate so plan on sharing or taking some home. There's so many different nacho options to choose or you can personalize them however you want. I truly love it here."}
{"text":"Depending on what you're looking for, you'll probably either love or hate Sneaky Dee's. This place is the definition of dive bar - super laid back and chill, but kind of grungy and all graffiti-ed up. Between three people we shared the King's Crown, which is a GIANT plate of nachos piled high with salsa, beans, ground beef, tomatos, peppers, onions, jalapenos, cheese, guac and sour cream. We also got a combination plate which had 2 enchiladas and 1 taco, with beans, rice and salad. Maybe it was because I was slightly tipsy when I came, but everything was SO DAMN GOOD. The nachos were a delicious work of art, and I didn't even care that they were slightly spicy, I just couldn't stop stuffing my face. I couldn't even tell the difference between the enchiladas and the taco on the plate, everything was just delicious and carby and meaty and hearty. All of that very satisfying food ended up being about $12/person, after tax and tip. Maybe I wouldn't like this place as much if I was completely sober, and quite honestly the thought of coming here at peak late night hours when this place is probably overflowing with drunk students makes me crinkle my nose... but at any other time, this is a good place to come for cheap eats!"}
{"text":"Sunday brunch was really good. Love this place :D"}
{"text":"If I were drunk and in my 20s, this would be the best place ever.  I like nachos and beer. They are not the best nachos ever, but they are relatively abundant.   There are lots of tables. It's shabby and worn in a well-loved sort of way that's kind of nostalgic."}
{"text":"Is it possible to have 2 people eat for under 15$ ?  It is at Sneeky Dees!  My sister and i got breakfast today and the bill was 12$. I got the 2 eggs, bacon, homefries, toast and fruit for 8$ with tax and it was huge and so filling i couldnt finish it. She got grilled cheese and fries for like 5$ with tax.and it came with tonnes of yummy fries!  Love this place!"}
{"text":"I haven't really felt compelled to give a place a 2/5 before but I didn't expect the issues I had at a place that is supposedly known for nachos and decent Tex-mex fair. I Ordered a quesadilla and it comes wrapped up like a burrito with the same sides as a burrito? I had to confirm I had the right order, that's never a good surprise. Also, at the time of ordering, the waitress asks if I wanted guacamole and sour cream- I say yes. At this time please tell me it costs 3$ each and also that I can't dunk the quesadilla into them because it's a burrito."}
{"text":"Good spot if you're looking for some gnarly drunk food. The nachos aren't anything special ...they're just massive in quantity. Beer selection is okay"}
{"text":"If you like alternative music and venues, this spot is perfect for no BS Tex-mex. Food was delicious PLUS they stay open suuuuper late. If we're ever back in Toronto, I'd go back. :)"}
{"text":"\"Best Nachos in Toronto\" is a dubious claim at best.  The fact that Sneaky's now has Daiya cheese as an alternative for those who do not eat dairy is a definite bonus and being open late certainly hasn't hurt the appeal.  This place has an excellent beer list, but mixed drinks are very hit or miss.  Try the vegan cupcakes.  When they have them, they are awesome."}
{"text":"Came here on a Saturday night around 7:30pm, there was a bit of a wait but that's to be expected. After about 20 minutes we were seated. The menu had lots of options to choose from but i went with the Jalisco with pulled pork (1 enchilada, 1 taco, salad, rice). Our table also ordered the king crown nachos. The entrees came out before the nachos which I thought  was a bit strange. The potions here are HUGE. The food was delicious! The pulled pork taco was juicy and the enchilada was soft and cheesy. I'd highly recommend this place their Tex-mex is the best!"}
{"text":"Do you like getting drunk for cheap and eating dirty Mexican food?? Sneaky Dees has a great atmosphere absolutely lacking in pretension, great staff and (apparently) actual Mexicans making the Mexican food! Extra points for opening well past last call as well."}
{"text":"One of the city's classic institutions. A must for any Toronto thoroughbred. Probably the best Nachos I have ever had. I also heard wonderful things about their chicken wings.   Wednesdays is a very popular night where they play rap music in their party room upstairs. Plan on eating downstairs around 9pm, and make your way up to hip-hop even right after."}
{"text":"Oh Sneak's, my trusty and reliable old pal!  Every mischief-making night out should conclude with a default visit to Sneaky Dee's, and it usually does. There really isn't anything not to love about this place.   The server turnover is low - you'll always see the same servers over and over again. There's the smokin' hot, bashful tattooed girl that every single customer (male and female) has a monster crush on, the smiley, friendly (white) girl with cheeky Trinny accent, the dude with the epic goatee that could be a Pantera stand-in...there must be something especially awesome about working at Sneak's that keeps these people employed there because the clientele certainly can get out of control and whiny.  The menu is epic. You have your choice of Tex Mex fare, wings, breakfast, soup, sandwiches and whatever else. I'm partial to the grilled cheese and veg burrito - just watch out for that \"side order\" of fries, because what it really is is a bulk shipment of potatoes from P.E.I. thrown on a plate. The portion is MONSTROUS. Easily enough for four people to share.  This isn't the place to go on a date or to have a quiet and serious conversation - your train of thought will most certainly be interrupted by: a) a pint of beer being spilled into your lap  b) drinking games c) soccer chants/singing d) general yelling and hootenanny  TOUCHING ANECDOTE: I once lost my metropass three days into the month (I know) and when I retraced my steps I realized it may have been somewhere in the depths of Sneaky Dee's. Not exactly ideal. At 4am I called them and asked the server to take a look around for it and after putting me on hold for five minutes she came back to announce that she'd found it. She left it in an envelope with my name on it and I picked it up the next day. WHO DOES THAT?! Someone who kicks seven kinds of asses, that's who.   Bring ID, cause you'll be asked for it."}
{"text":"Came here for the nachos as I heard they were fantastic and they did not disappoint - they are nothing short of amazing.  One of the few places where you actually wish they have you more chips than toppings.  Went for the 'Kings Crown' and the heap of guacamole went a long way.  A little light on the beef side but with so much toppings, it really didn't matter.  You can easily make it a meal for 2 with just one order.  I can't wait to go back and suspect I won't be able to order anything beside the nachos.  Definitely a Toronto staple.    Try and get a booth."}
{"text":"I love this place!  The nachos are amazing -- piled high with toppings of whatever you want, and there's so many to choose from!  The menu is NOT mexican food so don't expect authenticity, this place is all about dishing up the best TEX-MEX they can, and it's pretty great!  Brunch is awesome, too.  Prices are cheap!  Drinks are meh, they have beer.    It's open super late at night.  All of the tables and booth seats are old, carved up and covered in graffiti.  It's dark, really noisy, and gets crazy busy.  Young crowd mostly.  The bouncers are used to dealing with underage and 20-something kids, so at 2am they come around with flashlights to make sure that no one is hiding booze under the tables -- hey, I get it.  If you're looking for giant nachos at 2am, you're obviously not looking out for class and sophistication anyways.  You can literally wear whatever you want here, they are about as far from a dress code as you can get.   If you're not from the city, or if you're new here, then Sneaky Dee's is a MUST at least once.  It's an experience, and all Torontonians know about it and have been there at some point in their lives."}
{"text":"This is definitely one of the cooler places in Toronto. Unless you get jalapenos on your nachos, then it can get hot. Ba-dum tss.  Okay, bad jokes aside, Sneak's is great. The aforementioned nachos are beyond delicious, although they're quite expensive. ($9 to for cheese and salsa with extra toppings ranging from $2 to $4.50 each! Yikes!) I also had the chicken enchilada, which was equally amazing.  The graffiti in here is crazy. I love it. It covers the tables, the booths, the stairs leading down to the bathrooms, the bathroom stalls themselves... everything.  And lastly, Sneaky Dee's get's major points for appearing in Scott Pilgrim."}
{"text":"Loved everything about this place . The vibe , the noise and the food . Can't wait to go back and try a new dish"}
{"text":"This place has huge portions for pretty cheap. We had planned on going to an Italian joint down the street but yours truly messed up the reservation, making it a week later than I had intended to. We had walked by Sneaky Dee's on our way and had heard of it before, so decided to walk back and give it a try. The bouncer at the door told us that trivia was starting upstairs. We decided to give that a try. There were no more tables available, so we sat at the bar. Trivia was tough, but it was fun.   We ordered a big plate of nachos to share. Definitely enough to share. It was spicy, but not too hot. They had a good choice of beers and tons of food to choose from. I ordered a # something and got rice, beans, a taco, salad, and I think 2 burritos or something like that. Huge amount of food for the price. Food was tasty, but nothing exceptional.   The 2 things that I didn't like about the place was 1) if you sit upstairs, you have to pay cash... This is a problem for a lot of people in my generation... We had to scrape together enough money for everyone and then paypal/venmo later... The ATM that was supposedly across the street was not working. They did have an ATM in the restaurant, but who wants to pay the $3 + convenience fee for it... and 2) I asked the server if they had any small portion options... like maybe one taco and rice or something more like a kids menu, she said that everything they had was huge... oh well. I just had dinner for two nights instead of one... just would have been nice to have that option."}
{"text":"There's nothing like a pitcher of sangria on a summer day.  Sneaky Dee's red sangria wasn't sickeningly sweet and they were generous with their alcoholic mixture. My friend and i also ordered their \"King's Crown\" nachos.   The portion was large and there were lots of toppings to accompany the nachos right to the end. The service was ok.  The waiter's recommendation of nachos was good.  But he took away our food without asking if we were done.  And also he thought we asked for white sangria when we asked for red.  Hopefully he was under the influence of good sangria what with the experience we had with him lol. The decor of the restaurant was pretty cool and casual.  Good for chillaxing without having to care about anything. Definitely go back for their food."}
{"text":"Are you kidding me? I've never reviewed Sneaky Dee's?   I once saw an older man who runs the place punch out a drunk and unruly bar customer. I think of him fondly as Sneaky himself.   The Mexican food here is brutal, and it smells like your Irish aunt trying to make fajitas (mispronounced) from a kit. The poutine, however, is excellent and the wings will do. Their nachos are legendary, but let's be real, you're pretty drunk... so are they really that good?   The big graffiti covered tables still fill up quickly, and the concerts upstairs are often decent. I have a soft spot for Mr. Dee, so I'm going to go ahead and call this bad boy A-OK."}
{"text":"A great place to go to start your night out. Amazing prices and you get so much bang for your buck. I definitely recommend the chicken quesadilla and  chicken tacos."}
{"text":"i love this place to death, but don't go here in a group of more then five.  they have implimented a new \"international\" rule of dining standard.  if your a table of six or more, there is an auto tip of 18% on the bill. pretty classy considering they do not split the bill up, nor was it advertised before i decided to make waves over this issue. also, pretty sad when the tip ends up costing more then any other item on the bill..."}
{"text":"I love Sneaky Dee's! Honestly one of the best college spots there is. Portions are big and prices are low, exactly what college students need. I went here for a friend's birthday lunch and I got the two enchiladas lunch special. They were \"smaller\" enchiladas than the one they usually sell but I could only finish one -embarassed- The enchiladas came with rice, refried beans, and salad. All for $8 which was amazinggg. The enchiladas were well seasoned and cooked perfectly. I had to pack up half my food as I was so stuffed.  I highly recommend this place to my fellow college students out there, and anyone in general really!"}
{"text":"oh my.. when I saw that photo up there, I thought it was some run-down place.... I probably wouldn't have stepped in at all, but my boyfriend (and many yelp reviewers) recommended it. So we went.  We had the Jalapeno Poppers, Onion Rings, and Hawaiian Nachos.   The nachos were to DIE FOR.. they were SOOO amazing. So glad we had leftovers and I ate them happily the next day!  Service was great as well :) Decor? You just got to see it! Visit the washrooms too!"}
{"text":"Great place, full of vibe and energy, the only good food item on the menu is the nachos and the wings !! DO NOT order anything  else, because if you do, you will be disappointed, anyways if you have big group of friends this is a great place to hang out,its worth a try."}
{"text":"One word: Destroyer.  Aside from that, I revel in the fact that you can be slightly rowdy in here without anyone batting an eyelash. Good food, good tunes, good brews."}
