{"text":"The food is far superior to the food that the old place had. I orderd the sliders. Very good! High quality beef and delish bun. The vibe isn't as fun though. It seems pretty low-key. Not as many people seem to come in. The old Iquana place held a certain charm that the new place seems to be lacking."}
{"text":"Finally, someplace that serves their full dinner menu late night.  The service was fantastic, the food was incredible.  First time there and certainly not my last."}
{"text":"Went for lunch with 8 of us.  We requested indoor seating.  We were seated in a room with garage doors that opened up the west side of the room to the outside patio.  We were bothered through the entire meal by pesky flies.  Our meals were brought to  3 of us as the rest waited over 15 minutes before being served.  I ordered the three tacos.  They were served in soft shells.  The chicken taco had dried chicken sitting on too much shredded lettuce.  The shrimp taco had mushy shrimp also with too much shredded lettuce.  The beef taco tasted too spicy and had very little shredded beef.  Those who ordered the classic burger said it was plentiful but nothing special.  I recommend staying away from this place."}
{"text":"Love this place! I've been here twice and both good food and service. The most recent visit was a few weeks ago and I had spicy mac n cheese.  Soooooooo yummy!!!!! Not a huge menu selection but great prices and generous portions. Love the outdoor patio too! I will definitely be coming back!"}
{"text":"The food is great. Just don't order it off of grubhub. It doesn't taste so good cold. It showed up 30 minutes past the grubhub time and ice cold. I called in and was told I would get a complete refund. But was lied to. I never received my refund. So I would suggest eating there or picking up your own food."}
{"text":"Decided to have lunch today at The Social Box, since I have never been. Got the cesar salad along with the pesto penne. Also got a pepperoni pizza well! all 3 dishes were superb! pesto pasta was delicious, ingredients were fresh and the pasta was cooked perfect! Pizza was also very well done. Pepperoni was a little spicy and there was a 2 different kinds of it on the pizza!  Pizza was cooked more on the well side which is great! nice crunch to the crust. Nice little gem of a restaurant in Chandler. Deff be back to try some more items on the menu and for a cold beer or 2! If you haven't been to the Social Box what are you waiting for?!?!?!? Check it out!"}
{"text":"I recently watched the Super Bowl and spent my birthday at Social Box and I was impressed by the service and the food.  The seafood guacamole is AMAZING!!! I don't normally even like avocados and I couldn't get enough of it. I also loved the hummus and the egg rolls.  They have a signature drink that they bought me for my birthday - Cosmo Azul - it was extremely good! For dessert we had the tower of cotton candy and it was so good.  I highly recommend this restaurant."}
{"text":"The breakfast was really good. However, the French toast was a little dry, one peace tasted like egg. But every other thing about the French toast was great. I would definitely come back to this place. The server was awesome too. The games, Jengo ,and Match 4 are awesome. I love that they have something for people to do while they are waiting for their food to be served."}
{"text":"Me and the Girl wanted a night in, so I ordered our meal from here using grubhub.  Good delivery time, decent prices, and pretty good food...

But then as I checked the bag, I realized they forgot my sandwich. No big deal. I gave them a call and they said they will have delivered ASAP. After about an hour, I recieve a call that I will not be getting my dinner tonight, and they are going to refund the cost of the sandwich.  The delivery driver had a flat.  

Needless to say, I wasn't too happy. I'm still on the fence whether to try it out again or not."}
{"text":"So a friend recommended we try the place Sat night. I really liked the casual relaxed design. Band playing outside by the fire, rolled up garage doors but place was empty. How could it be empty on a Sat night?  Order drinks and food. I swear booze was not the premium I ordered as I get it straight and know the difference. Food comes after 30 minutes?? Remember place is dead. Friends prime rib and remaining plate was ice cold. My steamed veggies were ice cold as well. Chicken and artichoke was luke warm. Forgot my salad. My friend was pissed and discusses with waitress. She handles poorly and gets manager. Manager says he will handle. Comes back another 20 minutes - same plate prime rib now done medium but still cold. Finally get my salad after I finished my meal. Manager brings me warm veggies to go. Really?  Food was a bit overpriced a well. $12 appetizers doesn't make sense to me. I don't mind paying a lot for good food but this placed missed the boat on service and food preparation. I really wanted to like the place but can't say I would come back. I guess there was a reason place was empty on a Saturday night. Too bad. Doubt the place will make it unless it gets a real chef and better servers."}
{"text":"We are so impressed with SoBo. We held a Celebration of our daughters' Life at this establishment and could not have been more pleased. The banquet room was perfect, our servers were attentive yet not intrusive, and the food was delicious. We received compliments from so many people about the choice of restaurant, I'm sure SoBo will have many people returning time and time again.
I know we will be regular patrons."}
{"text":"Loved the patio!! After awhile they even lit the fire pit! It was really great! The food...not so much! We ordered the chili relleno appetizers.  It was awful!!! I had to spit it out of my mouth it was so terrible!  The chicken sandwich was pretty good, the fries were just ok and the ribeye lacked flavor. Might come back for the patio and drinks bymot not likely to come back for the food!"}
{"text":"This place is lacking one thing, consistency. My husband and I have visited the Social Box probably 5 times, 3 of which we ordered the brick sticks. Each time they have been different. The first time we ordered them they were AWESOME but have declined each time we ordered. Same with what would seem to be a simple salad. From the house dressing to the way the tomatoes were cut, it has been different every time. This may seem nitpicky but consistency is what creates consistent business, something the Social Box also seems to lack. A Saturday night at 7 should be prime time for this place but it's definitely a the spot to head to if you don't want to wait for a table in Downtown Chandler. I will more than likely return in hopes that someone will crack the whip and get everything on point. I think this place has a ton of potential and could be a really cool spot for the 30-50s crowd looking to spend some money and unwind."}
{"text":"It was terrible. We ordered the pizzas, and I don't recommend them at all. One was a chicken pizza that used cheddar as the main cheese, it was super dry and not appealing. The other pizza was a cheese pizza. The cheese gets a plastic look when it gets cold, meaning their cheese is the lowest quality out there. The server was sweet but the food was horrible and disgusting. Needless to say I'll never be coming back."}
{"text":"This place is exactly what it says: a neighborhood eatery. It seems like a very friendly crowd especially looks like the bartenders were friendly. Our waitress was nice. The other waitress pushed in front of us holding a beer, not waiting for us to walk through. It didn't start our vibe out to great. Beer and drinks were okay. It was good tasting food, it just was nothing special. I don't think my wife and I will be back."}
{"text":"Fun place. It was a bit cold when I visited but I enjoyed the food and staff was courteous."}
{"text":"Tasty place! Came here for brunch during restaurant week. Servers were very friendly and warm. I had mimosa and a breakfast pizza which was great. The wife and I enjoyed it. We are glad to see this place in Chandler and look forward to coming back for dinner later this week. : )

Thanks."}
{"text":"Excellent drinks and food is phenomenal. Specialty drinks are the bomb 

We ordered the pig wings, pretzel plate and one of the wood fired pizza and they were all way above my expectations. 

The owner and staff were knowledgeable and very attentive. 

Coming back tomorrow for Sunday Brunch!!!!"}
{"text":"The Iguana Macks has upgraded a bit and changed its name.  This includes a new menu.  Had the Grilled Cheese with Tomato Bisque Soup.  The sandwich was great, the soup, not so much! The soup was orange in color and tasted nothing like tomato. When I inquired about the soup I was told that is normal.  My advice is to avoid the tomato soup. The staff was friendly and courteous, but slow.  The real kicker was when they decided not to honor the frequent lunch card they had just handed out a few weeks ago. Goodbye Iguana Macks....Social Box I won't be back!!!"}
{"text":"Worst experience I've ever had at a restaurant. I'm a patient person and really wanted to love this place. It's near our home with a dog friendly patio and a Sunday brunch, sounded great! Reality is the wait time to get food after ordering was over 45 minutes. 2 tables that came in after us with the same amount of guests and near identical entrees got their food while we waited. Food finally arrived and fries were ice cold and egg was raw. Seriously?! What a disappointment!"}
{"text":"I'm a known lazy ?$&@ so I order grub hub a lot. Like a lot. I had developed a habit at this place due to: the Reuben, the sliders, the chicken Italiano. Reuben still kills, but since a recent menu revision I'm confounded by this ubiquitous green chile pineapple marmalade insanity. Also thought the artichoke chicken thing could be decent but it was way overcooked and bland. BUT WAIT. I finally ordered the SOBO Mac and cheese thinking a branded classic dish would have some finesse but I paid $9 for a modestly portioned styrofoam clamshell of macaroni and velveta. REALLY.  Also the pizza made me laugh literally not out of resentment but because it's just effing hilarious. Soggy and burnt at the same time. Could be such a great place but I need to slap these people. I want to love you but you make it so hard!"}
{"text":"Food is amazing, but the waitresses were slow and took a long time to do things. It took us shout 15 minutes to return the bill."}
{"text":"Please change your hours on your website. Putting a piece of paper on the door does nothing for people. Are you even still open?!!! We've attempted twice already. First time we show up and they have keg issues. Second time was brunch at 10am and the have a piece of paper saying they are open at 11am due to financial issues.
Ever think you are losing business because you're never open??!!! Never been there and never will because the 2+ times we've attempted you have had some silly excuse for being closed!!!!! No wonder you are going out of business. Very disappointing... even tried emailing the company and it got kicked back"}
{"text":"This place is a really good place for a bar n grill. The people that work here are nice, friendly and attentive. They are the best aspect of this place. The wood fried pizza is truly a delicacy. I love it. 
The only downside i have with this place is two things:
1) lime is always never fresh.. It's tastes and smells like its been cut open for more that 3 days. 
2) the chicken wings are never consistent. Mostly i get them smoked with a dryish rub which i definitely love but sone times they are like any low quality wings ( fried and dumped in hot sauce). I don't know if thats just a different cook that make them his/her way but this place should stick to one recipe and have their all cooks follow the same one."}
{"text":"This is a great lil with some great food!! Come try it!****

Bistro Steak Sandwich was good. Their Macaroni and cheese was excellent with a lil bit of spice!"}
{"text":"In love!!!  Phenomenal food, drinks, atmosphere and staff.  Everything my husband and I love and more!!"}
{"text":"worse salad I've ever had in my life.  McDonald's or Wendy's has a better salad.  Low quality wilted iceberg & romain lettuce.  Gross.  Dried out chicken, which I paid an extra $3.00 for.  Was disgusting.  I gave the chicken to my dog and now I feel extreme guilt about it.  My dog probably thinks I hate him.  My friend had the bruschetta, also low quality crappy ingredients.  Save your money and go buy a bag of lettuce at Safeway."}
{"text":"Ordered food for delivery via Grubhub. Food was bad. Lettuce core in my salad and black slime on lettuce. Sandwich looked thrown together. Sent email to business trying to get refund on two occasions, included pictures and never acknowledged either email. Would not waste my money trying this place. Too bad as it's in the neighborhood ."}
{"text":"My review is similar to others I've read for this restaurant.  We went on a Saturday evening to celebrate a Girlfriends Birthday.  There were 12 of us and we didn't have a reservation, so we were happily surprised when they were able to seat us right away.  There was only 1 other table and a few people at the bar.  The waitress took our drink orders fairly quickly, but it took over an hour for her to take our dinner orders and I believe that only happened because one of us asked her to do so.  The food took a considerable amount of time considering there were only a few other people in there.  We were all pretty satisfied with our food.  The appetizers were tasty and my Husband especially loved the egg rolls (which were presented beautifully as well) and we were all pretty happy with our entrees.  Props to the chef!  Sadly however, the service was just awful.  My glass was dry on several occasions and it was difficult getting anyone's attention for a refill and once we were finished eating it took nearly another hour to get our bill.  I just don't understand why there was such a lack of service.  From start to finish over 3 hours had passed which I find unacceptable.  There are some positive changes made to this restaurant decor with the new ownership, I just don't see it lasting if they don't make some radical changes in the staff.  My advice... Keep the cook and fire everyone else!!"}
{"text":"This was my second time coming in for brunch on Sunday. Our waitress today, sarah d was very nice, went above and beyond, and made sure we 100% enjoyed our experience.  Its great that you're mimosas come with your meal, the atmosphere is fantastic, and I love that its dog friendly, huge draw for my friends.  The reason I only gave this 4 stars is because the food.  It seems to be hit or miss. To be fair, I've only ordered the eggs benedict & I get poaching isnt easy.  But if you're going to offer it, you need to master it, and both times theyve been overdone, and frankly the muffins a tad dry unless you drown on the hollandaise, which you can do but you'll have to ask for a side of it.  That said, mastering the potatoes that came on the side has already been done. They were delicious and amazing!  Fruit bowl was fresh & not the typical cantelope, well worth the $6.  Hope to be back again to an even better benedict!"}
{"text":"I was excited to see Iguana Mack's close. Between the thumping music every weekend and the midlife crisis biker crowd it did nothing for the neighborhood. This place looked very interesting so I had to check it out. 

The menu was interesting with a good variety and good prices. We went on a weekday evening and the weather was great to so the patio was awesome. Staff was super friendly and our server was well-versed on the menu.

Unfortunately that is where the positives end. We waited almost an hour for our food and when it arrived it was disappointing. My kids had a grilled cheese and chicken fingers and they were fine. It's hard to screw those up. I had the chicken and waffles. The chicken was pan fried and the breading was scorched. It was topped with bacon and cheese. The waffles were bland and doughy and topped with a strange honey mustard sauce. The combination just didn't work and burning the chicken didn't help. I only ate a few bites before I lost interest. The sweet potato fries were bland, cold and boring. 

After another 45 minutes we were finally able to get our dessert (I also gave the server my card to expedite our departure.) We picked the s'mores so the kids could make them on the fire pit (cool idea). I was hoping for something a bit more interesting than Hershey's bars, marshmallows and out-of-the-box graham crackers but oh well. Unfortunately all of it came on a hot, fresh out of the dishwasher plate and the chocolate was a melted mess. When we asked for napkins we received paper bar napkins instead of the nice cloth ones we had with dinner. Sorry, but wiping marshmallow and chocolate off your hands with paper is almost pointless. 

I credit the server for asking my opinion as he cleared our plates and I believe they're trying to get better, they're just not quite there yet. Refine the menu, pay attention to the details and speed up the service and this place will be a winner."}
{"text":"Iguana Mack's was a dive with good prices and decent food, the Social Box is an upgraded dive with Scottsdale prices . I'll give it 2 stars because to food was good, but the most  memorable part of the food was the high prices. I have to mention the 9 dollar weak drinks. 
I say it is still a dive since the floors needed sweeping and tables were dirty. Increase the quality and maybe I'll come back during happy hour."}
{"text":"If youre anything like me: you saw this place from the road, and thought-that place looks plain. but the name interests me. sounds like a hangout/bar...but with class. the kind of place I would like.
If youre anything like me: you walk in, and are almost immediately a fan.
we were looking for a place to eat, but it was almost 10PM, and most places were closed. we had thought about Dos Gringos, and knew that SocialBox was right there. so if one failed we had the other. there was a line out the door at Dos Gringos, so we opted for SocialBox.
Awesome environment. relaxed, slightly quirky. definitely a hangout, and not a BOOM boom music pumping place. (not that im against that, but I am also a hang-out kinda person) the dining area is surrounded by 3 walls and an open garage door, the patio looked nice, but we sat inside. there is also a enclosed area for parties and such, where there was a birthday party. the service was a little slow, but it was alright because they seemed understaffed and a bit tied up with the party. the host(?) was awesome! he was very friendly and enthusiastic about his job(it was also his birthday). 
He recommended the seafood guacamole, which despite the strangeness of the idea, is actually delicious! I definitely recommend it as well. we also had the tacos, which were also very good. the chicken was just alright, but the shrimp had a kick with lots of flavor, and the beef was good but very spicy (just take off some of the salsa and it is perfect. the three tacos were easily split between the two of us and we were full (we didn't even finish the guac).
we will definitely come back! we want to try their brunch and their pizza!"}
{"text":"The only thing right about this experience was the Bloody Mary I ordered. Ordered half house salad first.... It never came... Ordered Mac n cheese w/ bacon... Came over 27 min later, still no salad... And the best part, no silverware... Bartender is out on patio shootin' the breeze with 2 patrons... Mac n cheese gets cold, then salad shows up a few minutes later after I told expediter that I had ordered that first.... Still, no silverware... Bartender finally comes in and asks if I want another drink... No, I want to leave at this point. She did offer to fix everything as she then states she's also \"the manager\" today... Are you kidding me? One other thing I'd like to mention, there were a total of 8 people in the entire place... No excuse for this Horrible kitchen/staff service. Too many other places with outstanding service that I would rather give my $$ to."}
{"text":"I have given ole SoBo a few tries and unfortunately they haven't really given me a reason to return.  The food is good, don't get me wrong...but it's the service that I just can't get down with.  

The last time I was there kind of sealed the deal, here let me paint you the picture:

Three of us in our party, we walked in and got a booth right away as there were only a few other tables being occupied.  It was a weird time of day, so I didn't think much of it.

We were greeted by a nice little server girl full of hickies on her neck, but then again maybe she just forgot how to vacuum or she and her pet leech had a disagreement.  We ordered drinks and those came out pretty quickly, then it was time to order food.  One guy ordered a pizza, the other guy ordered a sandwich and I ordered a turkey burger, which I was asked how I wanted it cooked.  Um, what? For turkey? Girl, that always gets cooked well done.  I ordered it with a side salad with their vinaigrette and added avocado to it.

So, the food was taking a while and our server came over to apologize saying \"sorry guys, it'll be out soon we just got like 50 million tickets in!\"  Hmmm...for the three other tables in here? 

Then the pizza arrived.  Yep, just the pizza...the sandwich and my burger arrived about ten minutes later.  My burger lacked the avocado I asked for, and the side of \"dressing\" that came with my salad was actually just a solo cup of oil...I thought maybe all of the vinegar and herbs might be at the bottom but when I poured it all out, it was just oil.  

Sorry Social Box, it's you not me."}
{"text":"I loved that they delivered!!!! The burger was cooked to perfection and the Ruben was great!  Give it a try."}
{"text":"I'm usually a really patient person. But waiting 20 minutes and having multiple employees walk by and not acknowledge, and ignoring me when I try to get your attention does me in. It's really hard to enjoy a place when the only thing you are enjoying is the company you are with."}
{"text":"The food was so good! The server was super attentive and very knowledgeable! The restaurant is really nice and well kept. I recommend the pork wings! We also had a delicious burger and the chicken sandwich which was super juicy!!! I'll definitely come back!"}
{"text":"I love the patio here. Plenty of shade and a good vibe. Their burgers are great and they offer a decent lunch special ($7 for a burger with fries). I would love to try the rest of their menu, but the burger is so good that I order it every time."}
{"text":"My husband and I went in for brunch. There were a few folks in there. We were seated promptly, the girl that seated us brought us water.  We were never recognized by ANY waitresses. Seriously 3 of them kept walking by our booth to clean up booth next to us. Not one of them acknowledged our presence. They just Took Turns cleaning up a booth that had 2 diners.  
We opted to leave,  if they didn't want our money we'd go somewhere who did,  Chases Diner 2 miles on Alma School Great food - Great Service!
I give Social Box -10 for a restaurant with Social in your name ~ perhaps training staff to be Social should be high on your on boarding or recruiting plan. I hate having to give them a 1 star rating cause they aren't!!!!!!"}
{"text":"Visited Social Box on a Saturday night with a friend. Initial experience was indoors at the bar. We were served by Nate, who was humorous and attentive and wonderful to work with. Absolutely no complaints whatsoever.

We then left for an hour or so to pick up a friend's dog that we had committed to dog-sit for the weekend. Went back to Social Box with the dog and sat outside. This time we were helped by Ryan, the manager on duty that night.

Ryan was exceptionally attentive and personable without being overly involved or intrusive. He gave a lot of attention to the dog and was quick to serve us as well. He even brought a bowl of water out for the dog.

We sat outside for several hours, talking. We were the only ones on the outside patio all night (from about 10:00p till 12:30a). At one point, two female employees came out just to meet with the dog and check up on us. Ryan came by very regularly to do the same.

We ordered drinks initially, then one of their Bianco Wood Fired Artisan Pies later in the night. Ryan was very excited to describe their new menu to us and we both enjoyed the pizza, although it wasn't too exciting compared to others available in the valley.

I give Social Box five stars because of the service experience more than anything. There aren't enough places where a patron can feel absolutely at home and unpressured relaxing for several hours at a time.

The drinks were ok, the food was acceptable, the atmosphere was average, but the service was truly exceptional. Thanks Ryan and Nate and the rest of you over there at Social Box for helping to make our night a pleasant one!"}
{"text":"I've been here twice and both times were ok. The first time, my burger was under cooked. This time over cooked. Too salty. Got the pretzel appetizer and it was disappointing. $1 more for cheese for 2 pieces of pretzel? Seems excessive. Honestly, this appetizer is over priced for what it is. Mall pretzels are better. Ordered delivery, which is a perk, but the driver was rude. I handed him a cash tip and he walked off counting it. No \"thank you\". Seemed irritated that it wasn't more. I'm regretting tipping at all! Will I come back here? Probably not. To expensive for sub par food."}
{"text":"I was pleasantly surprised the menu has a big variety. The staff was all great. Nice fire pit on the patio. I will definitely return. Location is quiet."}
{"text":"My wife and I had a date night and did all the things to prepare:  hired sitter, got ready, etc.  We received a mailer on SB and it looked like an upgrade to Iguana Mack's which we both consider a welcome upgrade from the dive scene.

That said we were seated promptly, cozy feel but would say they need to work on some decorations as the place felt bare if the xmas lights were taken down.  If sports is your thing there are ample flatscreens.  

Wait staff were okay, attentive and brought out drinks and apps right at the point of us starting to wonder.  Appetizer of egg rolls were good and decent beer selection.  Our main course was delicious (chicken italiano) which was light and tasty. 

The part this place needs to be mindful of is some of the seemingly regulars seem to need basic lessons on manners.  One regular was using a loud voice from the bar with liberal smattering of f bombs, sexual talk and innuendos that did not fit the scene at all.  Given there were older ladies, children and a young teen less than 20 feet away you would think someone would have corrected this cretin.  Not so, so we brought it up to the manager who assured us this issue would be taken care of.  Regardless, we had to sit through our otherwise great meal to this single guys unchecked behavior.

I suggest this place figures out what they want to be:  Iguana upgrade or just another dive on Alma School.  I would suggest management be mindful that patrons dining experience during family/dating hour times (6-8)."}
{"text":"I have been to the Social Box several  times and the food is consistently quite good.  Everything I've tried has looked and tasted great. I am glad they are in the neighborhood and I have hopes for them.  That said, the service has been ridiculously spotty.  The first time I went, a person I took to be the floor manager checked with us every few minutes and the service was wonderful.  With such a great start, I couldn't believe how badly things went in subsequent sittings.  I had touted the place to my friends and family; I was embarrassed by the reality.  Our waitress disappears, the drinks don't come, the appetizer finally arrives after the entree does, you name it....is the back of the house fighting with the front of the house?
Like I said, the food is high quality and, if it stays in business, I'm sure they will correct the service failings. At some future date I'll go for another sit-down but for a while I'll just do take-away."}
{"text":"When you're a new business it's probably a good idea for the hostess and the server to make you feel welcome. That didn't happen. I felt like I was interrupting their break. First both the hostess and waitress were upset that we picked a different table outside then the one they wanted us to sit in, but we wanted to be in the shade. Then they had an inappropriate conversation over our heads as they complained about cleaning our table. Lastly the waitress got upset when we asked for straws. At that point we left to go elsewhere. We will not be returning!"}
{"text":"Loved the atmosphere, cool new restaurant, but still has some kinks to work out. 

A member of our party got the wrong item brought out to her, and our server profusely apologized, but it still took about 15 minute to get the right item brought out. I was almost finished with my meal (granted, I'm a speed eater) by the time it was delivered. He didn't even comp that item. :/

It seemed like the restaurant is understaffed, as our server was manning the bar, tables surrounding it, and some on the patio across the restaurant. It took a while to get more water, to-go boxes, and the check. 

The food was just par, a little on the salty side. 

This place definitely has potential. I may consider trying it again when it has been around for a bit longer."}
{"text":"More upscale reinvention of the old Iguana Mack's.
Food is very good and very good value especially during happy hour.

You can get a glass of beer as one of your \"side items\" with the entrees.  Love that.

Atmosphere is laid back but modern.  Secret party room available (very cool) as well.

Also, they deliver."}
{"text":"Love this place! Big shout out to Jamie J., for taking this joint to the next level. Great place for lunch, hh or dinner. Close to Falcon Field and the 101 also."}
{"text":"Good place to drink not eat. Went on a Sunday afternoon and the food was very average if that. Will not go back.. Fail"}
{"text":"Really wanted to try this place since it's so close to my house. Tried to place a phone order for pick up, guys answers the phone, I say I'd like to place a pick up order  then he starts talking to someone else and then the phone went silent. Called back twice and no one would pick up. Probably won't try to go or order from again."}
{"text":"Went for brunch. The restaurant was nearly empty, yet we still had an overly long wait for our food. Part of our order never got to us. Really didn't care for the food, perhaps I just don't like the type of sausage they use, who knows. However my fiance will eat anything that doesn't eat him first and he didn't care for it either. We then sat there with our plates off to the side waiting for God knows how long for boxes (my dog enjoyed the food at least) and our check. Finally got it, immediately put our card in the book, stood it in the edge of the table, waited another 15 minutes while the server chatted with some guy at the bar like there weren't other tables. My fiances drink stood empty for half the meal. Will not be coming back.

Oh, and the unopened bills stamped \"PAST DUE\" in red sitting on the hostess stand was a classy touch. Yuck."}
{"text":"I really hate to even write this. The owner is an incredibly nice guy and the front of the house help are great people! If the kitchen could just be consistent and keep the quality of food in the same ballpark as the price, this place will be busy once again. At $1.00 a wing, you would only hope they would be as good as Native or at least BW's. The wings we got were very small, over cooked and under seasoned. The meat was dry and the sauce couldn't right the wrongs. I ordered the Ruben and received the sliders, which were absolutely delicious. However, when I order sliders, I would expect 3 in an order. Even though the cost of an order of sliders is a fairly priced $7.00, I just can't justify 2 little burgers as a meal. My suggestion would be to find a supplier with larger wings. Don't over cook/reheat your wings. Lastly, I would hope that you could some day bring in a chef consultant to come in and change up the menu, especially your pizza dough. I want this place to not only survive, but thrive in this area. It is a great concept and a great location. Please go visit and don't be afraid to voice your opinion. They have great food, service and more importantly a great owner that will listen to what his patrons are saying. Please support and help grow your local establishments. SoBo is a great public house and should be a place that we all visit for years to come!"}
{"text":"I've been here twice - both times had pizza so a bit of a limited review.  It was very quiet because they don't have a large lunch crowd however that works in your favor since the wait staff is more attentive.  It was clean and they have several beers on tap.  Overall I liked it and will probably go back."}
{"text":"Came for Sunday brunch, my meal was absolutely delicious. I had the biscuits and gravy, my brother had the traditional breakfast and my sister in law had the eggs benedict. delicious, service family fast. atmosphere more of a sports bar than a restaurant pricing 10 bucks that included is very nice Bloody Mary. Highly recommend this place the family and friends"}
{"text":"Love to be Social at the SOcial BOx!! Bre who was tending bar is so sweet and our breakfast today has us wanting to come back and try 'em all!! The Short Rib Bennies were so delicious...rib meat was tender and tasty! Steak n Eggs = Eggcellent!! The Scrambled Egg Pizza is a pizza art!! Love this place...see y'all soon! :)"}
{"text":"Ambiance, check. Friendly staff, check. Waitress that was in top of it, check. My salad pleasing my pallet, not so much. I ordered the kale salad with steak and house dressing which also comes with a side of their buttered garlic bread. To start, kale really doesn't have a whole lot of flavor so you gotta jazz it up! It had candied walnuts, but it was just not enough. My steak was under seasoned and the dressing was too sweet. It would be a whole lot better it there was some crumbled Gorgonzola & some sliced grapes or pears in it. Also, the bread had a weird after taste, like spray on butter was used or something funky like that. My boyfriend ordered the prime rib, which I took a bite of; freakin' yum! Cooked & seasoned perfectly and the creamed corn was crazy good! I could have eaten an entire pot of it! I also ordered the Beam & Basil, a cocktail containing whiskey and basil which was chopped, Chiffonade style. Great flavor, but the basil kept getting stuck halfway in my straw and mouth; perhaps a muddle would have been better or chopped up. At any rate, I will be giving it another go and it's nice to see something more classy and trendy in my neighborhood other than the run down Iguana Mack's."}
{"text":"I rarely leave poor reviews, but I felt I had an obligation.  I made reservations for 13 people here for Easter brunch- worst decision ever.  Service was absolutely horrible!  Food arrived at different times (2 people did order ahead of the rest of the group, but the rest of the group ordered at one time).  From the time 2 of the meals from the group order came out, it was another 10-15 minutes before the next plates came out.  When it was finally brought to us, the food was lukewarm or cold.  We sat outside and our water glasses stood empty - a couple of us actually took our glasses to the bar to get water refilled.  There was no salt/pepper on the table, so when it was requested, it took another 10 min.  The most disappointing was that the 1st 2 people who ordered with the main group didn't even get their food after waiting almost an hour - they ordered the giant pancakes with a side of eggs and bacon!  When my kids got their pancakes, their meat sides were not given and I had to ask for those as well - still no giant pancakes or bacon for the other two in our group.  To make matters worse, they have an Easter egg hunt in the restaurant that our kids were excited about - we were never informed it started. By the time, I noticed the other kids rushing and grabbing eggs, my daughter had just gone to the bathroom.  When she got back to the table, all the eggs were already taken or left opened/broken and there were less than 10 kids in the whole place!  That took me over the edge in my dissatisfaction.  I demanded to speak to the manager, who 1. didn't introduce himself with his name and 2. didn't appear to be genuinely apologetic as he gave reasons for the poor service - lost 2 cooks, waitress out with a sick kid, our waiter was new (he tried placing a lot of blame on the waiter), he told the host to tell the kids the egg hunt started, etc.).  But a table that had been seated at least 30 minutes after us got their food (I definitely saw one of them receive their giant pancakes) before all of our meals came out! AND there were less than 5 tables seated in the whole place!!  He ended up \"taking care of our meals\" AFTER I verbalized how unacceptable the whole experience was.  We have gone here the past few years for Easter brunch and have enjoyed it, but I will not return again.  The first sign I shouldn't have gone there - when I tried calling multiple times on different days a few weeks before to make a reservation and there was no answer.  I should've read the recent Yelp comments before making reservations.  Completely ruined our Easter family time."}
{"text":"We've been wanting to try this place since it changed hands.  We took the whole family which consisted of 5 adults and 2 children.  They were able to easily accommodate our group.  It's a happening place with music and lots of TVs.  You can sit inside or outside on a nice patio with a fire pit.  My impression is it's more of a bar that also serves food.  
We sat down and the place was pretty full.  We were greeted by the server and our drink orders were taken and served.  We placed our food order and it took over 45 minutes for our food to be delivered.  All the while we waited we didn't see much food coming out of the kitchen.  Not all the food came out at once and the appetizer was the wrong one.  We had 2 children with us and they were served next to last and the person who ordered a sandwich was the last to be served and she had to ask for her sandwich.  The food was delicious and hot once it was served.  I had the Under a Brick Chicken with the sautéed spinach & fresh vegetables.  The chicken was cooked to perfection and was moist and flavorful.  The vegetables were wonderful, the spinach had mushrooms which in my opinion just added to the flavor.  The kids had the chicken strips and they were in a beer batter which was unfamiliar to them, but they were also delicious and not greasy.  The fries were a bit mushy for my taste I like them crispier.  Every one else enjoyed their food and the only complaint was the wait time for the food to be served.  Our waitress was very pleasant and courteous and the temporary acting Manager took care of the situation to our satisfaction.  We would definitely come back again and would recommend it to our friends."}
{"text":"Service is really bad. Ive been sitting here for 15 mins with no one attending to us. It seems the place is understaffed. The food is average and with so many good places to choose from in this area it's hard to recommend it. They allow dogs on the patio which is a plus but don't think I will go back here."}
{"text":"Ok the bad... Cheesy fake plants on the patio.  Cmon get some real cactus.  The good... Nice waitress, great pizza, awesome party music playing on the patio.  Overall good atmosphere.  But seriously plant some REAL plants..plastic plants are not attractive.  Just saying."}
{"text":"The bar will not make it drinks are way do high for that area. Lower your drink prices and bring the bread back and live patio music. During happy hour I ordered  ONE appetizer and ONE fish fry on Friday with 2 drinks came to $50.00  will never go back. Drink was not worth $9.00 a piece I should have tasted some booze in that small tall glass. Also are water jar was warm and so was the water."}
{"text":"Our first visit, probably our last.  We were seated in a dining room that looked like Iguana Macks.  I was expecting a fresh vibrant look, like the exterior, but it looked the same.
I think our waitress or drunk or high...she didn't last long as shortly after taking our order she was out the door.
Our food came out it was prepared well and looked great!  I got the chicken and waffles.  Chicken was cook perfectly, but it had not flavor.  Waffle was a bit dry but tasted good.  My wife got the Ruben which she said was delicious.  It came out on a house made marble rye bun!
Overall, it was just ok.  I had higher expectations for this place, and was a bit disappointed."}
{"text":"Love this place! Really nice atmosphere/ambience. It's great for bringing your pooches out on the patio area (misters included). The Sobo Bloody Mary is a must try as it comes with a grilled cheese...as is the Sobo Burger...yum.

This place is perfect for a nice lunch or for a date night out. Definitely worth checking out!"}
{"text":"So I did my best to put aside any preconceived notions because this location used to be the old Iguana Macks bar (a joint I used to play pool at). They did a nice job of remodeling this place. The restaurant itself is pretty big with a large patio area, a dining room and a pretty good sized bar. The menu consists of  your basic American food selections - burgers, salad and pizza. I have to say they have very reasonable prices here. My server (Kat) did a great job of taking care of us and answering any questions we had. We ordered the pepperoni pizza, sliders and a pesto pasta. The sliders were delicious and my son enjoyed his pizza. I found the pasta a little bland, but all the food came out relatively quick and hot. Social Box has a nice friendly vibe to it. It's a great place for families or just hanging at the bar to watch a game. That have great happy hour selections and open till 2am on the weekends (I'm always on the hunt for late night eats)."}
{"text":"Awful.  Went for a teachers recognition event. The food was tasteless.  The wings were not cooked enough and still raw inside. There was fried stuff that looked like it came from Costco. The pasta was tasteless and overcooked. Most people filled up on salad. It was a paid event. I should have just bought a gift for my child's teacher. I will take my business elsewhere."}
{"text":"We ordered food from so box the other night. Words can not express my disappointment. It was so much better as iguana macks. Our food was late and completely cold. Our pizza was burnt over the entire bottom. When I called to complain the manager was ridiculously rude. Although we did get a new hot order on the house the pretzel sticks we ordered were totally burnt and inedible just like our pizza had been. I recommended you order from any other place than this one!"}
{"text":"Been here three times since it's opened. Very impressed with the food and service. Keep up the good work!"}
{"text":"WORST PLACE EVER. I always read the yelp reviews before I try a new place but the super nice patio drew me in. We had 8 drinks and two appetizers --- $130. tab. Our second round of drinks was completely watered down, we told our waitress who \"checked\" on who made it but never offered to remake our drinks (red flag). We ordered the lump crab guacamole, the kitchen was out, so we ordered the the calamari and the bruschetta of the day. Food was gross to say the least. When we got our tab, the waitress goes out of her way to mention that she took the guacamole off my tab.... What?!? Why would I get charge for something you don't have! She's lucky that I'm a decent citizen and still tipped her. This place is a joke."}
{"text":"We went right after work so we arrived at 4:30.  Was not crowded and service from Kat was excellent.  We had drinks, my husband started with the pretzel and cheese sauce, he loved it.  I tasted the sauce and could defiantly taste jalapeno, a bit of a spice to it.  He then ordered the spicy mac n cheese with sausage, huge portion and he loved it.  He did not finish it but I noticed in the morning it was gone, so he had a late night snack.  I has the caprese salad and I am so glad I ordered the 1/2 size.  It was very good but I could not finish, too big.  I liked the dressing.  
Kat our waitress was great, friendly attentive at just the right times and put up with my husbands jokes."}
{"text":"This place is a joke! We've tried to go several times, they've been closed every time, and can't be bothered to update their hours on their website. They've lost $100's of dollars from our business already, and we will never attempt to go there again."}
{"text":"Have been here a few times, at first i wasn't a fan but they have a new menu that's great and are SUPER dog friendly so its awesome to come and bring our 2 dogs who have the option of a dinner bowl also :)"}
{"text":"I will break it down to make it quick and short so you can get to eating. The good -nice ambiance and defintely did not have the overly crowded Saturday night wait for subpar food wait.  The bad- food came out cold even though it came out quickly ...happy to have my food quickly but why was it all cold? That was confusing. Of three different customers  tables with three seperate orders all food came out at once for all of us which we all appreciated until realize all our foods were cold..weird.  Now for the patio situation which is \"dog friendly\" First let me say yes i have 3 dogs ....and I might get some haters for this ...buuuttt......not everyone likes your dogs...sorry but true fact of life. While I do not understand why some people  feel you must bring your dog to lay or walk around while you eat a meal in public place I understand some people like that buuuttt I do not want your dog walking around my table or around my legs while I am trying to eat my meal without an animal staring me down in my space. Just because your dog is on a looong leash does not mean you should let your dog walk all the way to the end of the leash.  No your dog is not awww so cute...if you can't be without your dog for the length of a meal stay home and eat.  And no I should not have to give up eating on a patio if I don't like dogs...."}
{"text":"SUNDAY FUNDAY.....Stop #1.
About noon, we were the only people in here. It's starting to get hot. Looked at the menu, nothing really jumped out at me, so I just stuck with a couple beers. They were out of Jameson, so the owner introduced me to Hell Cat Maggie Whiskey.....almost an exact match. I liked this place to come back on our Sunday Sunday again. The staff was great, owner was super nice."}
{"text":"Thank you for honoring the check-in deal, SOBO! My experience here was pleasant. Was actually in the plaza to go to the restaurant next door but noticed this gem so I quickly Yelped and saw that I bookmarked it so my bf and I decided to change our plans. Proving that the exterior is inviting. The restaurant has a warm tone to it at the entrance with a large waiting area with a cute vintage couch and some art. We were greeted and seated right away. The menu is pretty overwhelming, we had a hard time deciding what to order but the fact that we came during happy hour helped us narrow it down. We decided to start with the mac n cheese and cashew calamari. The calamari was my favorite item of the hour. At first we were disappointed that it didn't come with any sauce (we're big sauce people) but upon tasting, it didn't need it at all. Excellent. The mac and cheese was good, but nothing special. Next, we ordered the Meat, Meat, Meat pizza. This too was just okay. A little soggy. I wish we went with the SOBO Bianco though. I liked this place enough to come back and try the other things I had my eye on. Not blown away but not disappointed either. SOBO is a great new addition to the neighborhood."}
{"text":"Just wanted to let you know that my husband I and I went to have Breakfast on Sunday to watch the  game (Cardnails vs Cowboys) and we where heading to the competitor side to eat but my husband said \"lets try that place\" (Social Box). So glad that we did. The mimosa was great and the Eggs Benedict I had was spot on. My husband had the breakfast quesadilla. We did find ourselves comparing your restaurant to the former digs but to be honest I don't see your restaurant living in the shadow of what was but enjoying the limelight that is to come..... Well done and congrats to you all of you.  We will be back that is for sure."}
{"text":"Great food, and everyone is social. If you don't like to talk with people then stay home or choose a different place to go. I had the eggs Benedict with a Bloody Mary for $10. It was great!!!!"}
{"text":"Went in a slow Sunday night waited over 15 minutes to have our order taken and about a 1/2 before it came out.  Food was average priced and average tasting.  Won't be rushing back."}
{"text":"Please bring back a legitimate happy hour!!! My friends and I are regulars there and I fear 10 dollars a drink is overpriced for a margarita or a Jameson and ginger. Your food is amazing but who would want to frequent a bar that charges so much compared to the other bars in the area."}
{"text":"Had the chicken alfredo it was so very bland. No flavor at all. I will say however the clam chowder was great."}
{"text":"So bummed the food was so bad. The place itself is great. Service was ok. The salmon, short rib and chicken were all horrible. Would not recommend it go back."}
{"text":"Nachos, and the Turkey Pretzel Melt sandwich are awesome!!! Great Atmosphere, friendly staff, and will return again for sure!!"}
{"text":"First visit since the change from Iguana Mack's to the Social Box. I really like the changes, with one exception. Each table has 3 wood chair and one orange metal chair. Ditch the orange metal chairs, pleaseeeeee! They are ugly and unbelievably uncomfortable. We were there on a lovely 80 degree day and the doors to the patio were open. It gave the dining area a light, airy feeling, but I can see where customers with airborne allergies would have a problem with this.

Service was prompt and friendly. My friend and I had the tomato bisque soup with a cheeseburger for $9. The food was tasty and the burger is cooked to order. Portion size is large enough that both my friend and I took half of the burger home for dinner.

The biker dudes are gone (probably because the remodel eliminated the pool table). The decor is more subdued and less quirky than when it was Iguana Mack's. I would return and sample other items on the menu."}
{"text":"It was a little pricey for two cheeseburgers but they were tasty!! We each had a dessert and they were good too. I think we'll check it out again sometime."}
{"text":"I am basing the star review on my last experience at Social Box, which was different than my two prior experiences.  

The first time I was at Social Box, we had dinner and drinks.  We ordered the Calamari as an appetizer and I had the short ribs as an entree and my GF had a different entree which I don't recall at this moment.  The Calamari was the best I had had in a long time - very unique Asian twist on an old favorite.  The entrees were also good.  We also went for weekend brunch and again, everything was good although the breakfast pizza was way too huge for a single individual.  

This last weekend we were back there for an early dinner and were excited to order the Calamari again since we liked it so much the last time.  It was completely different this time.  In fact, we sent it back once thinking they had screwed it up but it came back less greasy but still relatively inedible.  I don't know what is going on in their kitchen, but within weeks their dish went from the best I had had to something I couldn't even finish.  

I again order the short ribs and they were a little dry, but over all edible.  My GF had the chicken Alfredo and, while still edible, the chicken was again a little on the dry side and the noodles were stuck together.  Edible, but not worth the price paid.  

The drinks were ok, although I noticed my beer glass was sticky, most likely from a foam over, but the bartender did not do a good job of wiping down the glass.  

As far as service goes, the waitstaff were pretty good.

I hope they can fix what's going on in their kitchen but unfortunately I probably won't bother going back to find out.  They have a great patio but without consistent food quality, I can't see myself making the trip out there."}
{"text":"Went mid-day on a Thursday. Very dead (only one other table taken). Service was good, was greeted with a smile. Food was super oily; there was a puddle at the bottom of my order. Also portions weren't very big for the price paid. Wouldn't recommend for the food: typical bar food, overpriced, not that good.

Maybe worth the drinks or the weekend night atmosphere, wouldn't try them again for anything else."}
{"text":"Open seating so we sat ourselves at a...booth, of course.

Hardly anyone else was in the establishment except at the bar. Some of the tables seemed dirty including the one we ending up sitting at. We were hoping the waitress would wipe it down but she did not.

We were given a newly revised version of the menu (according to the waitress).

Side note: You shouldn't have to debate if typos on a menu are on purpose or not. 
We ended up agreeing that the mistakes were not on purpose. Hopefully, in the future, they make new copies with the errors corrected. 

It almost seems as if presentation is more important than tasted based on what we received. The egg rolls look super cute but were average and would most likely not be ordered again. The Bianco pizza (supposedly their most popular pizza and our waitress's favorite) was pretty tasty but based on the menu's description (and other Yelp reviews) it was missing the balsamic drizzle. That's disappointing because it probably could have made the flavor pop. I will say I did like the cheese dip that came with the pretzels. Though, I bet it was not made from scratch. The S'mores plate we received had a disproportional amount of gram-cracker to chocolate to marshmallow ratio and was kind of small for the price but you get to do them yourself in their outdoor fire pit which was pretty fun. 

Highlights were the bathrooms are pretty nice and the outdoor fire pit was pretty nifty. 

There is definitely potential for Social Box but it seems like the consistency is lacking and additional effort is needed. The food is average and nothing is worth coming back for that you could not order somewhere else that does it better."}
{"text":"Great food and fantastic ambiance. Finally, a grown-up, hip-yet-casual place for everyone.  Love the fact that dogs are welcome on the patio and if you want to bring kids, that's fine as well (obviously the kids don't have to stay on the patio). This place is exactly what we needed in the area. To sweeten the pot..their happy hour is AWESOME!"}
{"text":"Came in for lunch. Jessy was our server. She was a lot of fun and was amazingly patient and easy going with our diversive smart Alec group. Overall we had a great experience and the food was very tastey. I'll be back for sure!"}
{"text":"Very disappointed ...made reservations for Father's day  on yelp for noon. Upon arrival  the resturant was packed. The hostess offered us a high top table which we declined and offered to wait. After 10 minutes of waiting  another server came  up to the hostess and told her looks like nobody  is moving inside  and offered to sit outside  after they turn on the misters in 100 degree weather. No thanks ! Understandable  it is a special day but when you make reservations  a few days earlier  you expect better accommodations ."}
{"text":"The delivery took a while and was a little cold but it was still pretty good except for the Caesar salad, it was marginal at best, but some of that might've just been that it took a while to get here. The reason they aren't getting another star is the customer service. They gave me half an order instead of a full so I waited for over an hour for a meal that left me hungry and they only offered to refund me a couple of dollars for the difference. Thank goodness my friends were willing to share a bit of theirs! Really though, I'd be willing to try it again if I actually go to the restaurant."}
{"text":"Really great food! I like that they are dog friendly too. It's too bad that their service is terrible. Both times I've been there our server rarely checked our tables or refilled our drinks. The wait staff doesn't seem to care about their tables. Which is probably why they are rarely busy."}
{"text":"Really enjoyed the delicious food - AZ omelet, side salad, coffee made with adjustments for my diet with no complaint!  The best mimosa I have ever tasted.  Friendly, efficient server.  Wish I had noted her name.  Fun food choices - we had the 3 foot cotton candy tower - best flavor!  The patio looked very inviting about 10 degrees cooler from today.  I will be returning."}
{"text":"Almost two years later and this place is still awesome. I love the staff! Food is great and the crowd is friendly. My go to for Sunday Funday football."}
{"text":"Hubby loves their wood fired pizza. I'll be trying the gluten free option next time. We get the monster fries EVERY time: so delish! Tonight they had live music on the patio. Very cool vibe."}
{"text":"I really wanted to like this place. It is so close to home and they have great neighborhood deals every night of the week.  Unfortunately I went twice and I don't think I'll be going back.  
My first visit was not terrible, I got a turkey pretzel sandwich and that was really good, my boyfriend got the pizza and did not like it at all.  Our server was really great and super knowledgable, however the beer we ordered was not cold, it had to be refrigerated and we had to order something else while we waited for that to get cold. 
Our second visit I had to drag my boyfriend reluctantly.  This time we had a terrible experience. It took ten minutes to be seated, no one was in line in front of us.  Then it took another 15 minutes for our server to get to us.  We ordered appetizers first, then when our waitress came back ten minutes later we ordered dinner.  We waited 45 minutes after that for our appetizers because of a kitchen back up and two minutes after those came out we got our entree. While our waitress apologized, she was no where to be found most of the night.
We ordered a burger and the chicken and waffles sandwich and neither were very good.  We gave it two tries and unfortunately unless we hear of some major changes we will not be returning customers."}
{"text":"You want to eat here. Chicken basil sandwich is awesome and the fact that you can choose a beer as a side is fantastic.  

Great service and great feel."}
{"text":"How is this place not busier? Great varied menu and daily & happy hour specials - definitely coming back!

Started with a pretzel appetizer - so soft and buttery. 

I had the pasta bolognese which was a generous portion - took half home for tomorrow's lunch."}
{"text":"Social Box, formally Iguana Macs is a cool place where you can go with a group of friends enjoy a cool mellow atmosphere and just be social. A huge change from Iguana Mac environment. If you require the constant boom, boom, boom of music pounding this may not be your venue.The Box features a medium size outside patio with a glass covered fire pit where you can toast your S'mores which are a menu item.  There are a few big screen TV's (no volume that I noticed) throughout the place and four lined up next to each other in the patio area. The bar\dining area have garage doors which open to the patio. Very nice. Service was great. Our server was very attentive and kept checking on us every few minutes. We weren't really hungry but decided to try some sliders $7.00 (came on a stick of four) they were okay. I had a few Tequilas with lime and club soda $4.00 each. Our server informed us blender in a mixer drinks are not available . Cool with me I normally just drink beer. The restroom was relatively clean with is pretty important to me. Some of the chairs didn't match the decor which kinda cheapens the place, but that's nit picking. Overall I really enjoyed my experience here and would definitely return on my next visit to Chandler. So, if your in Chandler and would like to go to a cool place where music is at a moderate level and you just want to enjoy your company I do recommend this place."}
{"text":"Food was ok, nothing special at all. It's bar food. Service not great at all. This isn't someplace I'd go again."}
{"text":"Was looking forward to trying this place out. We went on St. Patrick's day around 7pm and the place was pretty dead. When we walked in, no one greeted us and we had to look around to find someone to be seated. Once seated, servers walked by us multiple times with with no acknowledgement of us being seated. Again, we had to get up to grab someone in order to be served. The service is horrendous here.

We ordered the queso burger, wedge salad, Reuben sandwich and pretzels for a starter. The food is good but nothing above your average bar food, and it was pretty pricey to top it off. They have a nice set up with an good sized open patio and large indoor bar area. But nothing else to really make me want to go back."}
{"text":"Food was cold and the restaurant wasn't busy. Guess we will try for brunch, hey who can mess up eggs and mimosas!!!"}
{"text":"We went here today to try a new place and chose it because the menu looked pretty nice. Upon arrival, we felt it was a bit pricey. The place is pretty neat inside.  It has a old tavern feel. The service was decent and everyone was nice but my fiance's food was terrible. So much so that it grossed us out. She got the steak and eggs off the brunch menu, which includes a mimosa or Bloody Mary. The steak was so tough she couldn't even cut it with a steak knife. It was not over cooked, in fact it was undercooked, just a terrible piece of meat. I tried a bite and had to spit it out. Her eggs were undercooked, they arrived sunny side up, she ordered them hard. They replaced them with over medium... The manager came over and apologized and said she would take care of the meal. When the check arrived, she charged us for a mimosa,  $6 which was supposed to be part of the meal price.  An item we would have otherwise not ordered. Very confusing. Not the best customer service. Not saying don't try the place but just don't go in with high expectations. We don't plan to return."}
{"text":"Hi, I rarely leave any personal reviews (good or bad), but I feel I need to leave one for Social Box in Chandler. First I would like to say we did have good service and the food was generously portioned for each dish. They were very accommodating to our group of 4 plus one infant for brunch. Our server Sarah was great and very enthusiastic to serve us even with a crying infant. This good service prompted a cash tip of 15-20%. 

My review is based on the aftermath that I was charged an additional 45% tip on my credit card. I specifically wrote \"cash\" as a tip, which was provided separately. Credit card alert prompted it as an issue and my customer copy clearly states no additional tip is to be charged. I do not place any blame on the server as I cannot prove that a specific individual is at fault, but this is unethical none the less."}
{"text":"Stale pretzels, mediocre ribeye, salmon I make better at home. So sad. I wanted to like. Service was good. It needs to decide if it wants to be a neighborhood bar or a restaurant."}
{"text":"I was in the restaurant biz for a bit during school (a while). The frontline order takers, expo and kitchen can ruin a great menu and business model. That almost happened here, but on a swivel a fantastic manager (I don't throw that around often) turned the experience completely around. Mistakes are made even with great restaurants. It takes an astute, in the moment manager with EXCEPTIONAL customer service (sincerity & problem solving) abilities to turn a less than perfect situation into memorable. Bravo, Social Box and the manager working Sunday morning/afternoon June 13th! Clearly your culture of excellence is inclusive and you've built a highly talented management team. Best regards."}
{"text":"I have been to this place two times. Each time I have had an awesome experience! Today, Jana was my server. She was nice and happy! She engaged in conversation and was very attentive to our questions and needs. I will recommend this place to anyone! :)"}
{"text":"This was my first time here and will be my last time 20 minutes to get a table anther 20 minutes to get food and drink and my hamburger wasn't cooked all the way very disappointed I would not recommend coming here"}
{"text":"If you're coming here at night, be careful since there isn't a streetlight depicting where the entrance is (unless you've been here/live around here and know where it's at)! I almost missed it, but luckily Social Box's string of lights outside led me to the right plaza!

Parking is a plenty, even though there's a restaurant next door, you'll be able to find a spot around 7:30pm on a Saturday night, which was amazing - I didn't have to park too far from the door (cue lazy elevator music here)!

We were there to enjoy Joyce W. b-day dinner with a bunch of other friends, I noticed they were possible understaffed since an hour in, another group of about 6 or so people appeared and they had to pull out all the help they could get!

BUT! Even though our waiter had mysteriously been replaced (O_O) our new waitress was fantastic! The place is really nice, the patio too, which welcomes dogs! We saw a lot of adorable and well-behaved dogs (someone had brought their Great Dane, and s/he didn't bark at all at the roaring motorcycles from the other people leaving the restaurant next door)! We were seated in the bar area, which was pretty spacious and well lit, I really like the whole late 90's mid-2000's music they had playing (MY JAMS - I'M [pleasantly] OLD!!), and it wasn't too loud where we couldn't hear ourselves talk which was an A+ in my book!

FOOD! Okay, well first everyone ordered a ton of alcohol lol. I stayed off it since I wasn't in a very alcohol mood, but instead got the Mock-tini Shirley Temple with Grenadine and Pop Rocks! It was interesting to say the least, I've never seen a drink so red before! It was a bit too over sweet for me... but the lime they used on the rim of the glass to roll in the Pop Rocks balanced it out a bit for me!

I ordered the SoBo Bacon Burger with herb fries - the burger had a fried egg on it which is my ultimate weakness where burgers are concerned... the herb fries weren't tossed very well though, so not all my fries were coated. Burger was also a bit dry, but I mean, overall it still tasted amazing! My mom got the Spinach & Artichoke Chicken, which, unfortunately, left something to be desired for her. My sister got the White Pizza w/Chicken, which was also very yummy, a bit too much balsamic glaze for us though, but it still tasted pretty good!

I would really like to stop by here during the day though, when it's not too busy! I would really like to get one of their pizzas next time!"}
{"text":"Sunday brunch was amazing. Great price, great product, limited but good menu, and very good service."}
{"text":"Wow! What an experience! This place really has really changed, for the better. Take a look at the menu and you'll find winners. We had the calamari and wings and loved every bite. My wife had a kale salad and she raved about it. I had the under the brick chicken and it was to die for. 

You must stay for dessert! Bread pudding, hot fudge brownie sundae and COTTON CANDY! 

Bre was awesome! She really knows what's she's doing! 

Will come back again. Great tvs to watch the game and great environment for a nice dinner"}
{"text":"I know this place is relatively new, so I gave it quite some time to work out any kinks before I actually stopped in. I came here late on a Friday night with my friend and our kids. I was glad that the place and the menu were kid friendly. That's a huge plus for me. The hostess was nice as was the waitress who was super sweet. But let's get down to the real business here, the food. 

I was completely unimpressed with the food.  The entire menu should be completely revamped because none of the appetizers correlated with the food that was served. For example, we ordered a seafood guacamole appetizer with lump crab and shrimp, yet no where on the rest of the menu is there any other crab entrees. Usually in other restaurants, these appetizers serve as a tease for what's to come or give a hint as to what is offered with the larger entrees. The only other fish was salmon and trout. And may I also add that my daughter and I got food poisoning from this guacamole because it was the only thing in common that her and I ate and 24 hours later we were super sick. 

The pretzel twist appetizers were a complete joke. Two pretzel pieces and to add cheese it was a dollar extra. The cheese should be included instead of used as an add-on. The appetizer itself was so small that my kids were literally laughing. They are definitely skimping customers on this one. 

I ordered 3 tacos. 2 chicken and a shrimp. They were completely tasteless and the chicken was so dry that I pulled it out and just ate the tortilla instead. My son ordered the chicken and waffle meal. While the presentation was impressive, the meal itself was awful. The chicken, waffles, cheese and pickles were all layered on top of one another and honestly should have been separated. My son has a very good palette and he nearly vomited at the table. I ended up getting it boxed to bring home and even my husband hated it. 

Here are my hopes for this place....clean up the menu, bigger portions on the appetizers (especially that joke of pretzel twists) and hire a new chef. This place actually has great potential. They have an awesome location, and the place itself is great for large groups and families. I could really see this place take off if the menu were a lot better."}
{"text":"The bartender (pregnant) I hope! Is the most unpleasant broad I ever met. Refused to replace a skunked beer told my 66 year old friend if he didnt like that one he wouldn't like the next.... Go to hell this place sucks. Don't tip LARA PEOPLE."}
{"text":"Had an old friends reunion from our old neighborhood in chandler. Sunday night , not too slow, not too busy, ordered a wine and bourbon at the bar while we waited for everyone to show up. Great prices and decent selection. Seated us quickly, great variety on the menu. The pretzel appetizer easy die for. The calamari was also great. Mozzarella sticks were great, but the marinara was \"different \" great variety of menu choices one of our party had the salmon while another had a burger and fries. Across the spectrum was great food and service. Definitely going to make this a regular stop."}
{"text":"Booked a painting with canvas event through Groupon and it was held here. Decided to check out the brunch before the painting class. I thought the place was trendy and relaxed at the same time. But, it was showing its age and could have used a bit of a remodel, mostly in the bathrooms. We sat on the patio and had a lovely brunch with great service. They offered $3 mimosas which were generously sized. The brunch menu was very reasonably priced. Fiancé got the \"giant pancakes\" for $8 and when they say giant they mean giant. I got the omelette with tomatoes and avocados, hash browns, and toast for $9 and it was delicious. The serving was more reasonable than the pancakes. All in all we spent $35 including tip and that was for two mimosas each and one entree each. Not a bad deal. We did not order any additional menu items during the painting class but the waitress was kind enough to bring waters and continue to check up on us. Great location for a painting with canvas event and would definitely consider returning for brunch."}
{"text":"We totally were struggling to accept that Iguana Mac's was gone... all the way up until we experienced our first taste of the new menu."}
{"text":"Love coming here because they have a dog friendly patio and their happy hour prices are the best!"}
{"text":"Lots of TVs to watch games. They have local beers, which is great! Lots of seating. Looks way better then the iguana Mack. Serves is alright not bad but not amazing. Chili atmosphere"}
{"text":"I would give this place 5 stars if I was rating just their pretzels. Pretty darn good soft pretzels. I went to this restaurant once and ordered it twice through GrubHub. The in-house service was great but you are paying a pretty penny here so should expect great service. Unfortunately, I won't order it for delivery again. Although everything I've tried is yummy, portion sizes are a bit of a let down. Again, for the money, I want to be satisfied. Not just with the service, but the meal delivery (no bread, no utensils, no napkin, nothing - and my food had slid all over the place during transport and was a sloppy mess), and how much food I get for what I paid. Don't need anything to totally WOW the pants off me - just need to feel satisfied."}
{"text":"As soon as we were seated the smell of stale beer was overwhelming.  The menus were sticky and obviously never wiped clean.  The pizza looked pretty but that was about it.  Way too much cheese and it was not even cooked....still doughy...waste of money"}
{"text":"One of the waitress that was off duty felt the need to pick a fight with me.   I'll gladly spend my money elsewhere. Good luck with your business"}
{"text":"The girlfriend and I decided to try this place because we always drive past it on Alma School. We didn't really know what to expect, but had checked out the menu prior to heading out.

Upon arriving it looked like a pretty cool place from the lobby, but once we were seated we realized the place was pretty basic. The booth we were seated at was dirty. Crumbs on the table and the seats. We had to clear them off ourselves. Someone (not a waitress) came and took our drink order because we had been sitting a while without being attended to. Immediately after, our actual waitress came and took our drink order, but I told her it was already taken.

The girlfriend ordered a Moscow Mule, it was $9. After I tried it, didn't think it was worth that much. On top of that, the waitress asked for a credit card to hold in case they didn't get the glasses back. I get that people steal glasses but come on. 

I ordered the Queso Burger and the girlfriend ordered some sort of chicken sandwich. We both agreed they were mediocre at best. In fact, I later told her that the burgers consistency reminded me of a frozen burger I once bought at the grocery store. 

The waitress was nice, and I can't blame everything on her. They're working out the kinks. We just weren't that impressed, and will probably not be going back."}
{"text":"Menu was extremely limited and the food was fair. Not bad but not great, doubt I would come back based on tonight's meal"}
{"text":"The food is pretty darn good. But service was bad. Especially considering the restaurant was nearly empty (on a Saturday night!). But the food was good enough that we will be back - thus the 4 star review instead of 3 (really should be a 3.5). 

Bloody Mary was awesome! A huge grilled cheese sandwich on top with a pickle and pepper. Prime rib was yummy! Also got the brick sticks (cheesy bread) - good and huge. And got the pretzel platter - good but cheese dip was not that good."}
{"text":"The food here is really good and perfectly priced for a casual  fun night with friends!  The drinks are generously blended and the atmosphere is engaging.  The servers are prompt and attentive, too!"}
{"text":"Do you ever walk into a place for the 1st time and think \"Wow, this place is cool!\" -- Well that is what I thought when I walked in here for the 1st time. I love the ambiance. I love that it is open with Big Garage doors open to the outside. I loved the decor. It seemed like a cool place to hang out at in the evenings. But----My love ended about as quickly as it started. 
I went here today for a late lunch with a friend. We were pretty much the only ones there. She ordered the lunch pizza and I had the lunch burger. She said her pizza was ok but a big greasy on top. My burger was nothing special at all, pretty bland in my opinion. My fries were very soggy, not crisp at all. 
Our waitress was very friendly and attentive. But unfortunately I don't think Ill be back. The prices on the regular menu seemed to be over priced. And after trying a few things I dont think I would be willing to pay those prices. 
I hope that they will make some changes and step it up but thus far its lacking. The place definitely does have potential though. Good Luck Social Box."}
{"text":"Honestly I was reluctant to consign because of the negative reviews but decided to give it a try. My boyfriend and I came on Friday night and were both seated right away. The temp was a little warmer than I would have liked it but I quickly forgot about it. We sat and looked over the menu deciding what we wanted. The very kind waiter suggested the sobo wings with the green chili pineapple marmalade which WAS SO GOOD!! Then for our actual entree my boyfriend got a pepperoni pizza which was huge and delicious and I got the short rib, which was also amazing. Idk why there are any negative reviews. Give this place a chance, it was worth it to me :)"}
{"text":"Social box is my new favorite neighborhood bar. Good beer selection, amazing food and impeccable service. I've never had a bad experience or even subpar. 

The nachos are insane. I definitely recommend sharing with a friend. 
Try the daily bruschetta, the chef comes up with a new combo every day.
ALL OF THE FOOD IS GOOD."}
{"text":"Yeah... I've gotten several deliveries from the good people at Social Box, and I have to say... for me, this is as good as it gets. Everything that I've gotten from them has been top-notch, and their delivery has always been accurate and timely.

A few standouts:

1)  Pig Wings. They are AMAZEBALLS incredible. They'll change how you feel about meat on a bone. I'm serious- you have to get them, and you will love them, and you will crave them, and Scott P for President because he put you on to them. Church.

2)  Carnivore Pie. It's got fries, and meat, and an egg, and veggies, and all sorts of crazy shit on it. Stick your hand in, grub around, and pull something up. Stuff it in your face. Repeat until you have a heart attack.

3)  Everything from my previous reviews. Read them, and you'll see what else you need to eat. I'm not kidding- everything that I've gotten from them has been top-notch. I don't understand why they have a three-star average... seems like people are getting snatchy over their service, and maybe that's a thing, but I've never actually set foot in the restaurant so I can't comment on that. Their delivery has been top-notch, their food is spectacular, and it's just such a great option for when you don't want either pizza or Americanized Chinese food (not that I'm knocking either... I crave both... but sometimes you just wanna throw some 4's in the mix).

Chuch."}
{"text":"So far. Great first impression.   

This used to be Iguana Macks and talk about a complete 180.   Before the renovation this place was a dump.  Staff was friendly, but couldn't make up for the poor decor and  dirty look.  Now it's contemporary, vibrant, and open.   While I can't review just yet on the food, I did hear it was pretty good from people in other tables. Service was good and staff was friendly.   

I hadn't been to the old place in years, but I can say I will come back to give to the food a try and have some drinks."}
{"text":"Went for lunch today.  I had the cheeseburger and fries.  I loved the cheese burger but the fries were not very warm.  My friend had a salad with the shrimp.  The shrimp were great but the salad itself had way to much salad dressing on it."}
{"text":"The Queso Burger is very good. We also had the Cheese Logs for an appetizer. These were like 3 cheese sticks in one - very delicious! Came once in the afternoon for lunch it was quiet and a nice atmosphere then came again at night which had a nice vibe. Bar had the typical chatter when we first arrived around 10:30pm then by 11pm it quieted down. Loved the vibe here."}
{"text":"I went here on a Saturday night. The service was great and no one was hardly in there. I ordered the grilled cheese and it was not very good at all.  The bacon inside wasn't crispy and the bread wasn't very good either.  The fries were average. I tried a red sangria and a white sangria. The red sangria was just average and I didn't like white sangria.  I might come back to try another item on the menu."}
{"text":"So I went to eat some dinner and this place looked good.  The menu was good everything looked clean however, I sat down and waited for 15 minutes for someone to even say hello.  Mind you this is after the hostess had seated me.  I got up and went next door and they didn't even say a word to me as I left.  Never ever ever even trying to return to a place where they can't even try to say hello."}
{"text":"Love the queso burger and Mac and cheese! It's also unique that they don't just offer you fries but chips and salsa or a 12 ounce beer as your side."}
{"text":"My review is strictly based on service. I've been in the bar/restaurant industry for 10+ years and if I ever got caught talking the way these bar tenders were behind the bar, I'm sure I would have been fired. Very unprofessional. They were cussing, joking around and not taking into regard the customers who may be listening. The drink (Moscow Mule) was good. The bar tenders next door at Dos Gringos may be more professional than these ones."}
{"text":"solid new comfort food/gastro pub in Chandler. Great patio, friendly staff great games set up that is also kid friendly. all dishes were good, but best of all my entree had 'beer' as one of 2 side choices. why have I never seen this before?! Brilliant execution fit for a fat foodie like me. we will be back!"}
{"text":"Don't order pizza unless you are willing to wait an hour. We had to ask multiple times about it and got it 45 minutes after ordering it. Half of it was burnt and the half that wasn't was fine hence 2 stars review. No compensation or discount was provided."}
{"text":"Two words - identity crisis.  From firepits, to loud music, swanky entry way, large patio, and big screen tvs, their identity is hard to peg for me; feels like a cross between what should be le grande orange, suede in scottsdale, marjerles, and dos gringos.  Pros include the large patio which could be a great spot for day drinking, Papago orange blossom on tap, and friendly staff.   Food was ok not great and they need more craft beers on tap.   With all that said this place has tremendous potential to be super hip but tries too hard, I will give it one more chance - this time in the day time."}
{"text":"This is our second time and we wanted to know if this place was consistant......AND the answer is yes ~!    OMG~!  DONALD OUR SERVER was BEYOND reproach~!   We wanted for nothing~  Our steak, eggs, and potatoes were made to order~!   .....AND SOOOO YUMMY~!   SUCH A WELL KEPT SECRET....UNTIL NOW~!   ;)"}
{"text":"Good service... gross food.. pasta noodles were hard. Coke tasted like sugar water. Not returning"}
{"text":"The place is really trendy in the decor is great. However due to this they make the food expensive and there's no quality associated with it. It's just expensive to be expensive."}
{"text":"Tuesday nights special is the Burgers and Local Beers offer.  $10 burger basket with choice of any AZ beer selection.

How could I not?

Slowly looking around, with Staind's It's Been Awhile playing on the speakers, I notice only six other customers... all sitting at the bar.  Six customers, comprised of three duos.

As Eddie Vedder now purrs along to a mandolin, my focus shifts to the redhead and a young man in a button up shirt, engaged in a spontaneous conversation... seeming to truly enjoy each others company.

Feeling a little jealous, in part due to this emotionally charged Lynyrd Skynyrd song, I wish I had someone sitting across from me... someone that could draw me in with her words and wit.

At the corner of the bar sits a rad looking young black couple.  Her dreds are interwoven with blonde, giving off a striking look.  They sit quiet, seemingly watching a tennis match on the overhead flat panel.

Feeling a little jealous, since this is a long winded Skynyrd song, I wish I had a tennis partner, someone whose serve was as blistering as her wordplay.

Closest to me, sits two plus size girls, friends... sympathetic to each others social awkwardness, in turn, able to be there for each other.  The barkeep asks them how the \"Za\" is.  Something from the depth of my heart rages at the hipster pizza pie nickname. 

My heart also rages against this loneliness that I feel, the desolation I see playing out before me in this empty restaurant, illustrated by the few patrons who are frequenting it this forlorn evening.

As Kirk's 12 string acoustic leads in to Metallica's Nothing Else Matters, my heart sinks, as I fear the haunting melody will chaperone more emotion my way.  If I try hard enough, I can almost see her sitting across this dimly lit quaint booth, but not for long, as James' vocals chase her apparition away.

All in all, the burger special didn't disappoint, and I got to try Sleepy Dog Red Rover Irish Ale.  However, the people watching and soundtrack were unparalleled"}
{"text":"Main Points:
-Casual venue, good for groups
-Draught beer counts as a side!
-Fresh tasting comfort food

Review:
What used to be Iguana Mack's is now Social Box, an American comfort food restaurant with great food and big hearts (they will be donating monthly to local causes around Chandler).  They offer reasonable prices, with appetizers, salads, sandwiches, wood-fired pizzas, and misc. entrees ranging from $7-$16.  Sandwiches come with one side (of which, a 12oz draught beer is an option) and their misc. entrees come with two.  They had about 10 beers on tap, and I was pleased to see Papago's Orange Blossom Beer and Firestone Union Jack IPA amongst the selection.  

We tasted the Queso Burger, Corned Beef Reuben, and Green Chili Chicken soup-of-the-day. The burger was juicy and delicious, it tasted like there were minced onions and spices in the patties, and the Reuben was just right .  The soup was peppery and full of flavor, very satisfying.  A carafe of water with chilled glasses was placed at the table when we got there and was filled diligently throughout our lunch, which speaks on their great service as well. 

Overall, yummy choice if you're looking to satisfy your comfort food craving!"}
{"text":"We came here for some day drinking at iguana Max. However it's closed it is now called the social box. Since we were here we decided to try it. We went to the patio where we were expecting bikers, pets and smoking, however, we were greeted with about six children and a clean patio. Not our idea of what we were thinking about for day drinking. While the food exceeded our expectations, I had a cheeseburger and fries that was just absolutely amazing, the atmosphere is completely different. We drove 8 miles to this restaurant for the atmosphere and only stayed one hour. While the food was amazing, I don't think will be back because we are looking for the biker atmosphere. I give it a rating of the four simply because of the food and service was amazing, but I'm looking for a different atmosphere. They lose the one star because of the change."}
{"text":"Food was fabulous, service on the other hand sucked!!! They forgot to place the order for half of our table, I asked for ranch when my sandwich arrived and finally got the ranch a half hour later once my food was all gone. We got the checks and yup took another 20 minutes to bring us back our check."}
{"text":"Food was good but I could do without the cigarette smoke. The restaurant is open to the outside, so you get to breathe the smoke of those smoking at the side of the building. So, sadly, my first and last time there."}
{"text":"Came at 9:30 on a Sunday night so no one but one other table was here. Service was okay took a while for someone to greet us and take our order. Prices are around $9-17 so not bad. Ordered a chicken & bacon Mac n cheese was enough food to split between two people. Was a little dry so I would ask for it extra creamy. Other than that it was good might come back sometime"}
{"text":"So disappointed. I had told my friend fro. Flagstaff about this place and so she came down we decided to go and check it out. It was awful! We ordered the spinach and artichoke dip and it came in a cup like soup, nothing at all what we were  expecting. Then we ordered the Caprese salad with chicken it came with all the ends of the romaine leaf, old mushy tomatoes, the mozzarella had hard pieces in it. It was the worst salad I'd ever had. We ordered the cotton candy for desert but when we hadn't received in after 10 min we told the waitress to forget it, she acted like we offened her. I will never go back."}
{"text":"The fam decided to try SoBo again. Kind of a Deja Vu experience. We sat in the same booth, got the same server, Kat, and had an eerily similar experience. The difference this time was the place was empty. Thursday night, almost 9. Hmmm. The last time we were here it was a Monday & football was on all the TV's. Not tonight. Regardless.
Kat was great again. She brought our waters, took our order and had a short pleasant conversation with us.
Since we loved the Mac & Cheese with Bacon ($11) last time we started with it again. It was really very good again.
C got the Kids Sliders with Fries ($5). This is a great deal. C said the 2 beef sliders were a bit over cooked but good just the same.
K got the Ruben ($10) again. And like before said it was awesome. One of the best she's had. Meat was perfect. The bread seemed fresh.
I got the Shortrib Sliders ($12). Sorry to say the kitchen missed on mine again. The Shortrib was dry. Way overcooked. Like a roast left in the slow cooker for 15 hours. The onion straws were very similar in texture to French's French Fried Onions. The Pineapple Green Chile was barely noticeable as was the Marmalade and the Au Jus was fairly salty. I left the horsey sauce off. The rolls were fine but nothing great. Such promise without delivery.
Great service, great Ruben, otherwise inconsistent food quality, fair prices. 3.5 Stars"}
{"text":"I came here for a late dinner with the love. I haven't been over here since it used to be iguana macks. 

To start I ordered the peachitini. The martini was delicious and very tasteful. For dinner I was very torn between the Mac and cheese and their pizza. I ended up ordering the Mac and cheese and added chicken to it. This was extremely delicious and very cheesy. They did a really good job on it. The only downside was it was extremely spicy for me! I don't remember it saying spicy on the menu so I wasn't warned about this. Lol. It's one of those things where you want to keep eating it though because it was so good. 

Another plus is you get a glass of beer that is included as a side when you get an entree. Very good idea social box. 

The customer service was really good. The only thing I recommend is dimming the lights a little but. It was extremely bright in the restaurant. I definitely want to come back to try their brick oven pizzas!!"}
{"text":"Obviously this place caters to a night crowd....

I met up with  9 other girlfriends on a recent Sunday afternoon.  When I made the reservations, I told them we wanted to sit outside if it was nice - it not, we would sit inside.  The man I talked to on the phone assured me we would be able to have a nice conversation at the table and not have to shout at each other.  

When we got there, Marcus, the hostess, said he had room for us all inside. Well, that was pretty evident by the fact that there was only one other table occupied.  Since it hadn't begun to rain yet (but it had rained prior that morning), I asked if we could sit outside.  Marcus said he didn't have anything to wipe the wet tables off with, only napkins....I asked him if he couldn't get any bar towels?  He looked at me as if I was speaking a foreign language.  So, needless to say, Marcus didn't want to go out of his way to accommodate us outside.  

In the end, it was a good thing that we didn't end up outside because as the day progressed, it got pretty windy and rainy...

After we were all seated, it took over 10 minutes for the waitress to offer us water or take our drink order.  Then, once she took our drink order, only two of the drinks were delivered!  5-10 minutes later, we all had drinks - but remember, there was only one other table with people at it! Not once during the whole two hours we were there, were any of us asked for a refill for our drinks

The good news is that once the food was delivered, everyone was pleased with their order. However, the menu could probably use some sprucing up with some more appealing descriptions.  Things like french toast - plain - no special bread or toppings...I could make that at home and they charge 8$.  

When we got there, one of my friends went to the restroom.  She said there was no soap and let the waitress know.  An hour and a half later, still no soap in the ladies room.  What the heck!!????  How do the employees wash their hands?  We had to use the soap in the men's room.  Apparently we were told, they didn't get their shipment in.  So, can't someone run to the grocery store and buy some for a dollar just this one time???  When we were ready to leave, there was finally soap in the women's restroom.

I tried to catch the bartenders eyes several times.  I did not see him smile once.  I did talk to him at the very end of our visit there and expressed our disappointment with some of the things.  His name is Nate.  He said they had to have someone go next door to Dos Gringos to borrow the soap.  I got the impression he wasn't too thrilled with the fact that we had made such a big issue out of it.  

The other thing that made us a bit uncomfortable was the fact the as the day got colder, they couldn't shut the garage doors because there was another party sitting outside under the cover of a patio.  So, there's no other door for the waitress to get outside?

Because we were the only ones there (one guy on his computer at the bar), it was nice and we were able to linger and talk for almost two hours. But again, no offer of refills for our drinks or were asked if we wanted dessert or anything.  They probably wanted to get rid of us!

Pro - good food.

Con - bad service"}
{"text":"Tue. night I was looking to try a new place for dinner in the Chandler area...Came across a place called  Social Box Neighborhood Eatery ...Nice place as soon as we came to the door lady seated us , menu had a good selection, just what I was looking for ( I had the Tue.special ) Service was off the hook , they took care of us...Now the only thing missing if i come back on a weekend is some Live Music ...So stop on by check it out.....Cheer's Bluesman Mike"}
{"text":"Well I've been coming here a while for a weekly Thursday chamber of commerce meeting. How is it you show up 10 minutes before the meeting and have to wait almost 1 hour before your told your food is not ready. Totally disgusted. I could cook a pizza from scratch in 40 minutes. Very very disgusted by this horrible service. In fact I might ask the group to consider alternative venue"}
{"text":"The food is delicious, we went on a Sunday at Brunch time, which sadly is also game time during football season, the game day menu is pretty good but the shouting and loud tv's were not to our liking even though we expected it.  I had an omelette which comes with hashbrowns and toast.  You can add a mimosa for $3 which I did and it was fantastic!  Also ordered the tower of cotton candy mostly because I needed to see it, it was pleasantly watermelon flavored!! They also have make your own Smores which I'm always a fan of."}
{"text":"Beam & Basil, Peachtini, Orange Madras, a weird cocktail with raspberry puree and hatch chili vodka, Shirley Temple with Pop Rocks, lots of beer, a Bloody Mary with a grilled cheese \"garnish\"...

Our night started off with a parade of alcohol.  Drinks were ordered and served to our table of 13.  Although we all filtered into the place at different times, the drink order was taken first and we didn't actually order food until like 8:20PM.  Aw man!  I want some foods!  After our server ran off and a new one stepped in, food was placed and more waiting ensued.  Please be patient at Social Box.  It might not be the speediest but the food comes out hot!

I had ordered the Spicy Mac with added jalapeños.  The waitress had told me the Spicy Mac wasn't really that spicy and only had a mild kick and she's wasn't wrong --- the Spicy Mac was made for a baby-level tolerance.  Not even the jalapeños could add heat.  They were actually more fruity than spicy.  Oh well.  I still finished off my plate.  I later ordered the Cotton Candy Tower [advertised at 3ft. but I think it's more like 2ft. served in a foot tall martini glass] for the table.  It was some seriously fruity and sweet cotton candy!  As a note, the pizzas are huge and I want to try that the next time I pop in.

All in all, it was a nice night at a decent restaurant.  If I could give 3.5 stars, I would.  Ambiance is nice, it's brightly lit inside, and they have a dog-friendly patio.  

Tip:  If you reserve a table on the Yelp app, call in and double-check with the staff.  My reservation was not received even though I got an e-mail and text notification from the establishment.  At 7:30PM on a Saturday night, it was slow enough where even though my reservation didn't go through, we were seated without a problem."}
{"text":"It can be super slow to dine in even with no one around so come when you have time to enjoy your food. I like that they host paint events here because I can eat lunch after i finish. My favorite thing is the salmon and risotto side. The mac and cheese is also good, I love that they will work with me to substitute broccoli instead of meat. My boyfriend has had the prime and sirloin and both didn't disappoint."}
{"text":"Went for lunch.

Lunch pizza was good.  Would actually have it again.

Chicken casar salad was meh.  Chicken was good.  Lettuce was wilted and seemed to be watery.

Place wasn't crowded...not a good sign for a lunch.

Service was good."}
{"text":"This place is the worst,  they deserve NO STARS but Yelp wouldn't allow that. Terrible service,  bad food. DON'T GO!!!"}
