{"text":"We were extremely disappointed with this place. It has been recently renovated (used to be Turtle Jack's) and looks nice inside, I will give them that much. It would have been a one star otherwise. The service was lacking and unattentive even though they were not busy at all. Our glasses would sit empty for long periods of time until we could manage to flag someone down. The wine is only served as 6oz, no option for a larger glass, and they serve it in giant glasses which gives the appearance of you paying a high price for a thimble of wine. I ordered a berry basil drink that was supposed to have a 'splash' of soda....but tasted like nothing but soda water. It was quite gross. The food was not great and my gluten free bun was completely inedible, it was hard as a rock. I ate my burger with no bun with a fork and knife. It was brought to the attention of our server, however they didn't do anything about it. We only live a few minutes away however we won't be returning at any time. So many other great restaurants nearby!
Such a shame as we love Union social eatery, but this place is nothing in comparison."}
{"text":"Average - but not in a bad way! This place is good if you just want to eat out with friends and have drinks. The food isn't anything mind blowing but it's dependable.

I ordered the California burger. It's basically a veggie burger. It was a bit too salty for me though. You get lots of fries (yea carbs!!!) so I was super happy. The food is affordable and I think the portions were huge based on the price you pay.

Unfortunately there was an issue with what they charged me. They charged me more for the drink instead of the promo they had going on for Saturday."}
{"text":"The fish and chips and the bacon salt fries were very very tasty!  The service was top notch and they went out of their way to get some cup cakes for my wife's birthday from nearby Dolled Up Cupcakes.  I highly recommend this place and great to see an awesome restaurant in the Meadowvale area. We will be repeat customers."}
{"text":"So my wife and I dropped in here a couple of weeks after the Social Eatery had opened.

This location used to be the Turtle Jacks before the franchisee was talked into opening a location at Erin Mills Town Centre that never did open.  The new owners did a complete rebuild of the interior and exterior of the restaurant, opening it up a lot.

We were asked if we had reservations, which of course we didn't because this is Meadowvale and its a local restaurant - not the Keg.

I had the Cashew Chicken Curry.  I've been eating too many cashews lately, so a few more won't hurt.  My wife had the Grilled Mediterreanen Chicken salad.  I would rate mine as really good, my wife called hers par for the course.

Our waitress was very charming and so forth, dropped by to see how we were doing.

We will definitely repeat."}
{"text":"First things first - much better than Turtle Jacks. It was good to see a green \"Pass\" sign at the front door.
The renovation is nice and it's nice that they opened up the restaurant. They will get more corporate lunch time crowds for sure.
The menu has a lot of great stuff on it. I went with co-workers who ordered the bacon salt fries and loved them. The chicken curry dish smelled amazing. My food - I ordered the edamame and the salmon salad - was WAY too salty. I don't know how a salad had so much sodium on it - it must have been the salmon, but it was over the top.
They don't say so on the menu, but their burgers and sandwiches have a gluten free bun option. I suggest they add a little note on the bottom of the menu to say so.
We were greeted right away and our server was nice and very patient with someone who had a lot of allergy questions."}
{"text":"Great new eatery that took over the turtle jacks! Went there on opening night and what a great new restaurantant for the area. One thing I will say the desserts are to die for! I clarified with Matthew who was the Manager in charge because the name was oddly familiar to Union Social Eatery but they are a different brand by the same owners. I can say they are off to a good start with this being their first location for the new brand! Can't wait for the patio in the summer!!!!"}
{"text":"Went here on a Saturday night for a low-key bachelorette dinner and had a great time. 

The name is straightforward but doesn't pay much to the casual, sophisticated interior I was surprised to find on the inside. Great choices in tiles, line drawing murals, and dark shades. Our main server was great and a pleasure to chat with, though I suppose the quieter atmosphere still had a few other servers less attentive. 

The food and drink was a big surprise to me. The special was $5 cocktails and I really enjoyed the blackberry smash. Though it was only 1oz of gin, the drink was definitely enjoyable and complimentary to the food. 

My table and I started with the spinach dip - pretty basic albeit, however, more spinachy than I've seen elsewhere. Our mains were classic dishes done SO well. Mountains of fresh cut and well seasoned shoestring fries with our lamb burger and almond chicken tenders. The chicken tenders were perfectly cooked; moist on the inside with an I burnt almond breading which is so hard to come by, served with a really good honey mustard vinaigrette. The lamb burger was juicy, moist, and reminiscent of kefta inside a brioche bun. Super yummy, though I could have used a pickled vegetable in there to give it some brightness. The fettuccine was like a homestyle mac and cheese with black pepper, ham, and fresh peas. 

I look forward to trying some more out of this little surprise of Meadowvale. Everyone else's sandwiches looked really well taken care of... and the drink specials are no joke either. See you soon!"}
{"text":"Forgot to take pictures as we were so hungry! Had lunch here at around 2:15pm ish. The place was not busy bit had a few patrons. We ordered the Buffalo chicken sandwich and the almond crusted chicken. Very fresh and good portions. Under the union social Eatery, similar concept. The waitress Michelle L. was attentive, made suggestions and checked on us a few times. The manager, Ross came to check on us and offered us a free round d of drinks out of nowhere! Great service for sure!"}
{"text":"It's so funny because I almost left after seeing how empty it was at 1pm on a Saturday (never a good sign), but I'm so happy my friend convinced me to stay. The inside decor is very stylish and spacious, and we were happily seated on some comfortable benches (this is important as I find cramped restaurants and rickety chairs to put a damper on any dining experience).

Everything at this restaurant is under $20, and their menu items range between $14-$18 (mains). I ordered the buffalo chicken sandwich with fries, and it was honestly one of the best sandwiches I've ever had. The fried chicken was very large and generously brushed with buffalo sauce. The sandwich comes served with lettuce, tomato, and a blue cheese sauce/spread. The fries were thin and deliciously crispy. The entire plate came to $15, which is very well priced for the amount and quality of food you get. 

On Saturdays, their drink special is $5 cocktails. I ordered the blackberry smash, as recommended by our waitress, but unfortunately was very disappointed in it. The drink was very bland and if I have to compare it, I would say it tasted like barely flavoured water (if you poured water into a glass that previously held juice then drank that, it'd taste similar to this \"cocktail\"). I don't think there was any alcohol in it at all, and it wasn't sweet or sour so I'm still confused what I paid $5 for (probably just water with three blackberries floating in it). 

Luckily I very rarely base my reviews on their drinks, so I'm still going to give the Social Eatery a 5 star rating based on their service, food, and ambience. I will definitely be returning again, and if you plan on visiting in the future, please give the buffalo chicken sandwich a try!"}
{"text":"1st visit Feb. 16th and won't be going back anytime soon. It's loud and it's  a totally open concept; something like my high school cafeteria but with the lights turned down.  
10 minutes sitting at the bar and despite bar tenders seeing us there, not one even said \"Hello.\"
The tall bench we were sitting in kept shifting 6\" ever time we got up; not surprising when there are no walls to anchor a bench to.
The food was reasonably good; the burger, the pasta and a dinner salad but the \" steak and frites\" was a disappointing, over-priced dish."}
