{"text":"This place is fantastic. Some of the best pasta and sauces I have ever eaten. The prices are reasonable, the staff are amazing, and the selection of olive oil is the best around! They have great lunch specials too!"}
{"text":"What a great little shop jam packed with gourmet treats and flavours for all levels of cooks or take home chef's.

We started going here for the amazing fresh home made pasta's, then we started buying all of our olive oil's and balsamic (probably 100+ to choose from). We get cheeses, delicatessen meats, sausage and takeaway ready made meals.

The owner and the staff are engaging, friendly and also into what they do. Can't say enough about this Calgary gem!"}
{"text":"Very good place for lunch. Have tried the Italian sub, pulled pork, pasta dishes so far. All very good. The price is excellent too, and you can even get fresh pasta to make at home.

Very friendly people and a wonderful place for a simple lunch. Will be going again."}
{"text":"Came here today to grab some lunch - I love how the store is small with a personal feel to it, the friendly staff acknowledge their customers and offer their assistance, which I very much appreciate given that part of the lunch menu is build your own pasta. The food is authentic and home made with good ingredients and the prices are reasonable for the quality you get. Also, there is no option when you pay to tip the staff, so the prices you see are the prices you pay. To top it off, I was treated to a cappuccino on the house as I waited for my pasta to be cooked. I highly recommend Soffritto for your italian market, lunch option and coffee!"}
{"text":"Ahhh....love this place! Previous reviews covered the amazing array of high quality olive oils, vinegars, fresh pastas and homemade sauces, cheeses, take home meals, etc BUT...did you know that Gord also does catering? We hired him to cater our daughters wedding last Sunday and, oh my, the food was great!! He was at the site to make sure all details were taken care of, the presentation and TASTE of each dish was fabulous! If you are looking for a caterer for your next event, give Soffritto a call!!  Mmmmm!! Thanks Gord!!"}
{"text":"Nice little shop fresh pasta and a great selection of Fresh Olive Oil and flavored Olive Oil as well as having balsamic vinegar. The shop owner was very helpfully and educated us in the oils and vinegars. If in the area give it a visit he makes lunch specials as well"}
{"text":"Wow, where to start with Soffritto?? We have been eating here for years. Whether it be their lunch specials (BEST meatball sub I have ever tasted), or their fresh made pasta, their food is always so mouthwateringly delicious. The staff is always friendly and knowledgable about new and interesting oil and vinegar combos and Gord, the owner, is very passionate and knows his stuff! This is why we decided to hire them to cater our wedding last week and let me just say,  we were not disappointed!!!! The menu they put together was just what we had hoped for, Gord came to the venue ahead of time to make sure he could make it work, and he was there on the day of, serving food with a smile and ensuring the best service was delivered. All of that service was fantastic in and of itself, but the food was to die for!!! Many of our guests commented on how great the food was and we couldn't have agreed more! We have loved Soffritto's for years and we are so happy they could be a part of our day. You should definitely consider making them a part of your day too!!!"}
{"text":"I walked in with no intention of buying anything and left a hundred bucks poorer. What did I purchase? Cheese curds, wild mushroom gravy mix, lots of fresh pasta, mango pasta sauce, chocolate croissants, cinnamon buns, and olive oil. The frozen croissants/cinnamon buns are from Pascal's Pastries. It was worth every penny - puffed up beautifully and it taste even better.  I could have easily spent another two hundred on pate, homemade dinners/lunches to go, pizza, balsamic, meatballs, soups, award winning cheeses, and duck confit. What really impressed me was despite the fact it was very busy, the woman helping me was patient and never rushed me. She offered me sample after sample of olive oil and took the time to ensure I knew what I was buying and how to use/cook it."}
{"text":"Visited Sofritto's today and they are outstanding. I got some stuffed pasta with mango curry sauce. It was AWESOME. There are many different sauces, pastas, and olive oils in order to satisfy different appetites. I would highly recommend checking it out."}
{"text":"Soffritto has a decent selection of fresh made meals, pastas and sandwiches as well as a great selection of various spices other cooking ingredients. Although a touch on the pricey side, the quality of their product and service is definitely worth it."}
{"text":"OMG! Come here for a taste of Italy! Lots of fresh ingredients to choose from. There is essentially an olive oil and balsamic vinegar bar along with pastas and sauces and lots of other little treats. There are even a few homemade meals waiting in the fridge for you to take home and pop in the oven. They would be great if you wanted to impress a date with a \"homemade\" meal! The staff is great and friendly. The shop is tucked in the strip mall behind the old block buster at the corner of Lake Fraiser and Canyon Meadows Drive.

For a life changing experience try the curry mango pasta sauce or the black truffle oil!"}
