{"text":"This place is DISGUSTING; the floor hasn't seen a broom in a few days and has clearly never seen a polisher, all the booths and tables are streaky and barely wiped off, let alone clean, there is a disgusting layer of visible dust on the pendant lights, and I can't even bring myself to actually look at the kitchen but the glass in front of the grill looks like it's never been cleaned. Cross your fingers I don't get sick! Side note: the food isn't even that good."}
{"text":"Upon walking into this place I noticed things immediately that were red flags. I decided to give it a chance anyways... First I noticed that the floors were not clean with bits of food on and under the booths. When I got my food it didn't look as bad as if anticipated (other than the fact it was served on a styrofoam plate). It was some of the most strange chicken hibachi I've ever tasted LOL. I could help but notice that everyone in the kitchen was Hispanic and this definitely showed in their food. The only thing Asian in the dish was teriyaki and shrimp sauce. The rice was like that of a burrito and the chicken was that of a fajita. One day this may be the next big think but for me... I'll pass."}
{"text":"Sogo Express was exactly what I wanted; friendly and fast. The prices are great and the portions are huge!"}
{"text":"Eewww. Dirty restaurant, dry chicken, bland, everything -  even the unsweetened tea tasted off."}
{"text":"I called about 4 times and no one picked up. Then when I got there, online it said it was open at 11, so I went through the drive thru and sat there for 5 minutes and I saw people in there but no one came to the window, then I parked and went up to the door and it was locked and it said on the window it opened at 11 and it was 11:20 and no one would come let me. Extremely rude and annoying. If the hours say it opens at 11, that's when the door should be opened."}
{"text":"Ate here for the first time today (at this location ) and the girl working was so extremely rude that I was scared to even ask for a to go box! The atmosphere  was completely ruined by her conversation  (in spanish) to the cook.... she was SO incredibly loud that we couldn't even do my son's homework at the table. Besides the rudeness the food was horrible.... I ordered the steak n chicken  and received 3 pieces of steak and the chicken was hard and dry! My daughter ordered the same thing but without mushrooms and apparently that meant she got no carrots either! Definitely not happy customers!"}
{"text":"Bad service was in there 10 mins. Before anyone came out the back to help us. Teriyaki sat to long in rice and was nasty"}
{"text":"A typical hibachi place on the less tasty side of average.  Carrots were tough and the rice was forgettable but the chicken was the saving grace from a 2 star review. I'll probably eat there again but this place is low on my list of go to restaurants"}
{"text":"I was so disappointed in this place. After all the good reviews, I tried this place and with regret I wish I didn't. I don't know if I came at the wrong time @ 3pm, but regardless the food should always be prepared fresh. The carrots were burnt and chewy, and the chicken was dry."}
{"text":"Love this place, food is great and it's very clean in there as well. I been to many of Japanese place and came up short with  how the food taste. BUT HANDS DOWN GREAT!!!!"}
{"text":"GROSS!  The food was awful.  My husband and I couldn't even finish our meal.  He got the hibachi steak and I purchased the Hibachi chicken.  The only one in the house that liked the food was my dog.   The rice tasted old, the carrots tasted liked they were canned and gave me a stomach ache.  It must have been leftovers. Why  are people raving about the shrimp sauce........it too was gross!  This was a $14.00 waste of money."}
{"text":"Good lord this place great. Soooo much food for less than $7 I swear they should charge more but I'm not complaining. 

The crew that works here are cool very fast at getting your food cooked and out. I work out next to this place so the meals are perfect with chicken and rice plenty of it too. 

I'll eat here at least once a week love it!"}
{"text":"This used to be one of my favorite places to eat. Now, everything's gone down hill. 
Steak is so over cooked, I can't chew it. 
Carrots are like trying to eat little rocks. 
Fried Rice is so dry , I wonder if it was even cooked. 
Service.... Way below par. The little chick is too busy on her cell phone to give me a refill. 
And duck sauce... They don't have it any more. 
But for $1.00, I can buy another shrimp sauce. 
Needless to say, I probably won't return here."}
{"text":"This place is so dirty!!!!! I am not sure why I placed an order for food! Sitting at the table to wait and it just gets worse when I pull out a chair and it's sticky and gross! 
Hope I don't get food poisoning! 

Just to add to the experience something smells dead right outside the front door.

I won't be back to this one! I will go to the one in Kannapolis."}
{"text":"Unable to sub onions and mushrooms for not wanting the side order of sweet carrots.   Just because you don't want your vegetables coated in sugar, you have to pay more.  
The AC is our.  It is hot in the building and it has been that way for at least a month.   
Way to run a restaurant guys..."}
{"text":"Floor is sticky and dirty , booths dirty . Staff sitting behind counter eating and watching videos on his phone. Glass for hibachi grill is dirty. Overall this place needs a good bath."}
{"text":"This used to be a good place to go for lunch but, now the newer owners have decided to charge 50 cents for a small Styrofoam cup of water. I'm done with you sogo. I'm not about to get nickle and dimed over lunch. Annoying. But, the food is good...(still... I charge sogo 50 cents to kiss my a..)"}
{"text":"I've never tasted Asian food so bland. Carrots were cold, egg roll mushy and dripping with grease. Chicken tough and fried rice plain and not seasoned. WOULD NOT RECOMMEND!"}
{"text":"My food is always tasty and hot
but where is the express. Go to the other Sojo express in Concord"}
{"text":"The only reason I'm not giving Sogo one star is because I actually do enjoy the food. I would give 2 1/2, but unfortunately there are no 1/2 stars. I've attached several pictures of what I just opened up my bag to when I came home with my to-go food: a pool of teriyaki-and-whatever-else juice. This is not the first time I have been served my teriyaki chicken and veggies in a pool of unappetizing liquid. 

This is, however, the first time I've brought my food home and had this gross juice everywhere. I feel like I shouldn't have to ask for my food to be drained, but I guess from now on I will have to. I would hope the chef and whoever else working would notice that they're giving me my food in a literal pool of disgusting looking brown liquid. 

The last time I ate inside, I even asked for a plate so that I could drain my food myself. From now on, I will definitely ask that my food be drained. The actual inside of the restaurant is dirty as well. There have been many times that I have come in and the person working the cash register is sitting down on their phone when they should be making the inside a little less dirty. The floors are sticky, as well as the table tops and booths. 

The floor also has a coat of brown filth on it. There is dust on the windowsills and pretty much everywhere else. Not sure how they even have a sanitation score of 95. I'll continue to come here, because the food is actually good. But I really hope the right person reads this and makes some changes to give customers a better experience."}
{"text":"Years ago, this was a great place. Now.... It SUX! Filthy, and the food isn't cooked by people who know what they're doing. Forget it!"}
{"text":"Incredibly delicious!  I will definitely be back! Plenty of food to fill you up. We had the Hibachi Chicken. Can't wait to go back!"}
{"text":"Fast, friendly and always good. I love their hibachi chicken! It's not the nicest place ever and not necessarily the cleanest at all times but nonetheless a great place to eat. It is well worth the money!"}
{"text":"Best place to eat for hibachi and it's super quick. This is the best sogo express out of all of them. It is well worth the stop if this is the food your craving. Hibachi chicken is so great and their homemade shrimp sauce is superb!"}
{"text":"Place is always dirty.Floor sticky and everything in this place needs to be cleaned. This is the only location that I have seed with this problem. And this is just not this one time. I have been there 3 different times over the past several months and it's always the same.

Our chicken smelled a little like fish. I brought this up to them and they could not really care. I assume they cook the shrimp and other products on the same spot then just throw the chicken on after.

If you want a good sogo then go to Sogo Japanese Seafood & Steakhouse
970 Branchview Dr NE Concord, NC 28025. You can sit here and eat like traditional hibachi dining where they cook it at your table."}
{"text":"Wow, this place is awesome. I'm surprised nobody has wrote a review about this location. I am a guy that can eat a ton of food and this is the first place I have EVER eaten at that gives me so much food, even I can't eat it all at once. The Chicken Hibachi is phenomenal. They give you a side of mushrooms and those delicious carrots. What do they marinate those things in? My goodness......The  biggest highlight about this place is it's cheap. If you get coupons on the back of Harris Teeter receipts, you can buy one entree and get a second one half off. Definitely a place you must check out and I guarantee you that you'll be back. I eat there at least twice a week"}
{"text":"I came here today against my better judgement (bad experience last year) and instantly regretted it! I tried to call in my order for about 15 minutes, but got the busy signal every time. I decided to use the drive thru. The young man working the window asked me two separate times what I had ordered. He kept forgetting. I ordered Hibatchi chicken with mushrooms. They weren't busy, but there was two other families inside ordering. I sat in the drive thru for 22 minutes! I called the restaurant from my vehicle while in the drive thru line just out of curiosity. It didn't surprise me that no phone ever rang inside and yet I got the busy signal. No one was on the phone, which means they had the phone off the hook just to avoid having to take phone orders. That is absolutely ridiculous. Once I finally got my food and got home, I realized that they had given me hibachi chicken/carrots/broccoli. NO MUSHROOMS?!?! This place is SLOWWW, dirty and the guy working tonight honestly seemed like he was on drugs. The worst part about this whole experience? My chicken was not cooked completely! I could have gotten sick had I eaten it. I picked the chicken out and tried to eat the rice and veggies but it, just like my whole experience, was disgusting. I tried to call to speak to someone, but to no surprise got the busy signal. I will not be coming back and I urge anyone thinking about coming here not to."}
{"text":"Great place to come for a quick lunch! Very cheap and great portion sizes! And they have shrimp sauce that comes with all there meals! Yum! The only thing that's off is they charge you for water...."}
{"text":"I often stop in here for lunch. Always delicious and usually quick service. Great for someone who has an hour lunch break. I always get the hibatchi steak with carrots and mushrooms and its always delicious. Big fan of Sogo"}
{"text":"We live very close by and decided to give them a try after two years.  We went twice this week and got the same result both times.  Overall, the food is probably a three, maybe a four.  However, the cleanliness of the place is a 2 on a good day.  The windows are covered in grease.  It looks as though someone washed them with a dirty, grease soaked rag.  The sun shinning on it only makes it more noticeable.  On our second visit, we dined in.  Four other tables finished their meals and left before we did.  Not one staff member came over to wipe the tables off.  My toddler had to use the bathroom while we were there.  Not THE dirtiest bathroom I have ever been in, but I needs a good scrubbing.  Also, there was no soap in the dispenser on the wall next to the sign that states employees must wash their hands.  Lovely.  I honestly think this place has potential.  I do not believe there is a manager on site because of its relatively slow traffic.  The staff takes your order, cooks it and then basically just sit around chatting and playing on their phones.  We will stick to Toyama."}
{"text":"I have been eyeballing this place for over a year now and TODAY was the day my fiancé and I tried it! I regret not trying it any sooner! This place is great! It's right down the road from me which really sweetens the deal. It's fast and well made Japanese! The best bang for your buck. $7 for my teriyaki steak with mushrooms! I just finished my left overs for dinner tonight = 2 meals!"}
{"text":"This place is really an express stop.
We were in and out very quickly.  The food was much better than the previous Sogo Express.  

This chicken wasn't over cooked or dry.  I also notice that they did not give as much food as the previous place.  

They had a sanitation rating of 94.0.  Nothing to brag about, but nothing to concern yourself with either.

They also had some ginger sauce which I suspect is soy sauce with ginger in it.  It's delicious!"}
{"text":"Great place for quick hibachi takeout! The shrimp sauce is delicious and you can watch them prepare your food through a window. My favorite place for Japanese takeout!"}
{"text":"I would give this place a zero star but that's not an option. First time coming here and it was horrible !!! I got the steak and shrimp teriyaki, the shrimp taste like dirt, the steak was salty, there was no teriyaki sauce what so ever, the sweet carrots were sitting in the pot for too long they were so mushy and tasted very old, the rice had no flavor and not to mention the shrimp sauce which it was pure mayo with pink dye in it . Would not recommend this place at all."}
{"text":"My husband and I come here on a fairly regular basis for take-out....we have yet to be disappointed! They are fast, efficient, and the food tastes great...plus, they'll make substitutions for the sides, like broccoli instead of carrots or mushrooms. Great place!"}
{"text":"Had a place like this in my hometown. Good prices, decent food, clean inside. 
Cashier was friendly and helpful. 
Got our food quickly. 
I give this 5 stars because it meets expectations. Didn't expect gourmet so wasn't disappointed."}
