{"text":"Today we had Easter Brunch at Soleil.  It was amazing!  The food was delicious and the staff was wonderful.  The lobster bisque was the best we have ever had and it had huge pieces of lobster.  All of the items were perfectly prepared.  It is by far the best buffet experience for Easter Brunch that we have ever been to.  We are very excited for our next visit to Soleil."}
{"text":"We decided to eat dinner at Soleil in the Renaissance Hotel before going to the Thursday Coyotes game. Soleil was closed but we sat at the bar and were able to order from the Soleil's menu. I had the Tavern Burger and my hubby had the BLT with egg. Both of our meals were delicious.  We will definitely go there again. To make the experience even better the singer/guitarist playing in the lounge sang Happy Birthday to our granddaughter via FaceTime. The evening started off perfect with great food, friendly prompt service and great Happy Hour prices."}
{"text":"This is a strange review, since I never got eat there, but here's the story.  To begin, I wanted to make reservations for dinner before a hockey game.  But it turns out you can't call this restaurant directly ... the phone number is to the hotel switchboard instead.  So, I called the hotel twice ... first time it rang endlessly, then I called back an hour later and was then put on hold for over 5 minutes.  Then, they passed me to the restaurant where it just rang until I got voicemail saying that if I wanted to make a reservation to leave a message.  Well, I did, and nobody called me back.  Tried it again the next day with pretty much same result.  Not sure if these guys are still in business, but clearly customer service is not their priority.    Maybe it's a great restaurant (although I suspect not), but in any case not worth this hassle."}
{"text":"Decent place to have a quick lunch if you are attending an event at the hotel.  Our server was extremely friendly and made us feel welcome.  The grilled cheese with tomato was tasty too!"}
{"text":"My family has stayed at the Glendale Renaissance a few times and always enjoyed their restaurant for breakfast. We have always stuck with their breakfast buffet that is very good and has many food options to choose from. I am not sure of the exact price, as being a platinum member of Marriott does have the perk of getting two free breakfasts. If I am guessing, I think the price is around $12-14 a person and in my opinion it is worth it. The options are donuts, cheese blitzes, sausage, eggs, bacon, yogurt, fruit, cereal, granola, a staffed waffle station with all the fixings, and a staffed omelet station with all the fixings. I know I a missing items here but you get the point. Each time here the omelets and waffles are very good. Overall, when it comes to hotel dining, this is a worthy spot to dine for breakfast."}
{"text":"Lots of options for eating in the area - but this is by far the best option. Spent a week at the Renaissance, and had breakfast, lunch, and a late night dinner in the courtyard - and it was hands down the best meals I had all week, including plenty of stops at the nearby Westfield chain restaurants."}
{"text":"We hadn't been to Soleil at the Renaissance Hotel in a while, but decided to try it out, again.  First of all, it's about 6:45 on a Saturday night, the place should be hopping and we were the only ones in there.  We were seated by Therese, who was also our waitress.  She was very nice, friendly and always had a smile on her face.  The first thing we noticed, was the menu had completely changed since the last time we'd dined here.  But, there were lots of interesting options, so we just went for it.  We opened with some delicious appetizers, hubby got the street white sweet corn (which was 3 cobs that were grilled, and served with cilantro and a chipotle sauce).  He loved them!!  I got the lump crab spinach dip, which was soooo good!  I ended up taking about half of it home, and plan on finishing it while watching a movie tonight.  We also received house salads, that came with our meals.  They were really tasty...and large.  For our entrees, hubby got the ribeye, which was served with broccoli rabe, wasabi mashed potatoes and a chimichurri sauce.  All that was left was the bone from the ribeye on his plate...I think he liked it!  I got the braised and grilled spare ribs, which came with roasted garlic smashed potatoes and a five spice broth.  OMG!  The ribs literally fell off the bones, and had an amazing Asian flavor to them.  The entire dish was so unexpectedly wonderful.  I truly wasn't sure whether I'd like it, or not, but after tasting, I couldn't stop.  Everything we had was so delicious, and it has a nice atmosphere.  They truly need to advertise this restaurant, because there is no reason why it's empty on a Saturday night.  I understand that Westgate is right outside its doors, but a hotel dining room should have some traffic.  I hope more people give it a try, they may be pleasantly surprised!"}
{"text":"We had to plan a large group dinner on a Saturday night, which can be hard to do in this part of town. Thankfully Matt, the manager of Soleil, was happy to accommodate us. He helped us put together a custom that fit within our budget but still offered attendees several options. The service was excellent, and everyone enjoyed the food. The quinoa chile relleno and the chorizo halibut in particular got rave reviews. Overall, we had a great experience!"}
{"text":"We had the recent pleasure of dining at Soleil, the restaurant inside of the Renaissance Glendale Hotel & Spa and wanted to share our experience. Menu:  The menu has a lot of variety which is really nice.  We could have ordered so many more things to eat because they all sounded so good!  We dined here for dinner and were eyeing things for lunch on a future visit as well.  We also were really impressed with the Asian influence on the menu in addition to and the Latin items, it really is a nice and diverse menu.  We also really appreciated the high quality items such as Niman Ranch meats, free range eggs, and other ingredients from select sources.   Ambiance:  The restaurant was easy to find and we were greeted and seated by the very friendly hostess.  The dining area was bright, colorful, and well maintained.  The tables were clean and nicely set.   Dining:  We started off our meal for 2 with the Shrimp Kimchee Pancake and the Hoisin Pork Ribs.  Both were outstanding!  The Shrimp Kimchee Pancake arrived on a very hot cast iron skillet and we loved the crispiness it added to the pancake.  The Hoisin Pork Ribs were very large and tender bones with the meat easily falling off with a fork and knife.  For the main entrée, we ordered the Pan Roasted Niman Ranch Rib eye Steak and a New York steak.  We have eaten at many steakhouses fine and casual and we both agreed that these steaks had the taste of the fine dining establishments at a less expensive price. Well flavored, great cuts, very tender and perfectly cooked to perfection!  We loved the sides they came with, broccoli with carrots, parmigiana-reggiano truffle fries, sesame rice, and sautéed purple potatoes.  To top off such a wonderful meal we shared the chocolate lava cake with a scoop of vanilla ice cream, which was also sinfully delicious.  The portion sizes are very generous. We could of shared easily shared the 20oz. ribeye just the two of us, but wanted to taste more items and are glad we did!  We took part of our meal home for leftovers the next day (which still tasted fantastic even after some reheating!).   Service:  The staff was wonderful, friendly, and knowledgeable.  Our water glasses were refilled frequently and we were checked on throughout the meal to see if we needed anything.  You can definitely feel a sense of pride with the kitchen and the wait staff that works together making it such pleasurable dining experience.  The food plates were nicely decorated and we enjoyed the presentation.  Overall:  We were extremely pleased to find this place! Not only is it great for travelers to dine at but it is also such a hidden gem for the locals!  We highly recommend it.  We would much rather dine here than at some of the large chain restaurants nearby.  Keep up the good work and we look forward to returning with friends and family!"}
{"text":"While staying at the Marriott Renaissance, I decided to grab a quick bite at Soleil.  There are only a few minor issues with my experience. During the football season, they have a very limited menu on Sunday nights after the game. They did suggest that we call for 'In Room Dining' as they do have an expanded menu for the hotel guests. So instead of having a nice ribeye steak in a restaurant, I had to have it in my room. Okay, so they'll cook a couple of steaks to deliver to my room, but not to eat there? So off to my room I went. Upon ordering, I was told there was a 1 hour wait. Again, that was fine... I wanted a steak.  30 minutes later our food arrives. Hot, and with everything we could need... Almost. They did forget the creamy horseradish that I requested. Instead of waiting while my steak cooled off, I passed on asking the gentleman to bring some.  The steak was perfectly cooked, however, the large amount of garlic butter on it killed the flavor of the beef. And it was not a Prime Grade cut. It was Choice. For the price, I would have expected a better grade of beef. Quite disappointing.   I'd definitely think twice before doing that again."}
{"text":"Food is excellent and drinks by Kim are phenomenal!! A little pricey but that's most restaurants in hotels."}
{"text":"You expect in a hotel like the Rennaisance a restaurant that would have a menu choice and food quality that does not disappoint.  You can see where this is going.  We had tortilla soup.  It was awful.  We've lived in southern Arizona for 25 years and know what tortilla soup is.  This was an over seasoned peppery broth with beans that were soft and disgusting.   The menu was reduced for the week, we were told because of all the events they were having.  The reduced sized menu was supposed to improve service and efficiency.  It did neither. The hotel, wasn't much better. PS. We spend 60-70 days a year in hotels around the country.  The Renaissance in Glendale is off our list."}
