{"text":"Not the most beautiful site for sore eyes but definitely great food at a great price. The servers are wonderful. I always am seated in Annie's section and she's always so cheerful and energetic! Really adds to the experience. She busts her butt to make sure your dining experience is always enjoyable. Money well spent, generous tip and all."}
{"text":"Cheap, fast, greasy spoon kind of food. Normally I'd only go 3 stars but in contrast to other options in the area (the little island of hotels near it) it really shines. Much better bang for your buck than the hotel restaurant."}
{"text":"No too bad.  Had first visit to the place this weekend.  Had the Buffalo Chicken Pannini wrap.  Menu could use a description other than \"includes chips and a pickle or coleslaw\" considering the wrap is stuffed with fries and coleslaw.  Needed more sauce, other wise tasty.  Boyfriend had the Carnegie Wrap and would most like to have it again.  Extensive menu, worth the value."}
{"text":"First time in a LONG time I've been led astray by other reviewers, and I'm really not one to leave 1 star reviews, but this place deserves it.  I should have known when we pulled in the lot and there were only 3 cars that it was a bad first sign and we should have just LEFT.    But it was Friday night and other reviewers had raved about the all you can eat perch, so I decided to give it a shot.  The hostess who seated us was severely tatoo'ed, not the end of the world, but her appearance was extremely unkempt, and she bumped into the light above our booth while seating us and dislodged dust all over the table.  Again, should have just LEFT.    Then, the waitress who was going to help us for the rest of the night comes over to the table and she could barely speak English through her Russian accent.  She didn't understand what I meant when I asked if I could substitute something for the potatoes, so I gave up trying to explain it to her.  I thought to myself, everybody needs to start somewhere and decided to give her the benefit of the doubt.  But again, should have LEFT.  The salad that came before my fish was decent, but it was clearly right out of a bag and all iceberg.  I could have made the same salad at home in the 2 seconds it takes to open one of those bags.  The potatoes she brought (since I couldn't get  her to figure out how to substitute things) were bland at best.  Only ate 1/2 a bite and left them sit til the end of the night.  The vegetables were clearly out of a frozen bag and limp, I'm talking about one of those little generic brand bags of frozen brocolli mixed with carrots that is like $0.69 at Walmart.  But still, I held out for the \"all you can eat\" perch even though I should have LEFT.  So finally, the perch comes and she gives it to me and walks away.  No tartar sauce, no lemons to squeeze on, no malt vinegar, nothing, even though this sad excuse for fish NEEDED some sort of seasoning to give it flavor.  And she didn't come back for like 15 minutes to check on me!  (And this with only 2 other tables with people (3 total) and 2 waitresses working!! Like she was purposely trying to see how slow and unresponsive she could be?!?) So I ate the first helping dry like that.  And the flavor was totally bland and yuck, and it was clearly frozen OCEAN perch.  I mean, come ON.  I'm in Cleveland, Ohio for crying out loud, in the middle of perch season, and they give me frozen ocean perch from Gordon Food Services???  The breading was AWFUL too and full of filler crap, I peeled off as much of it as I could.  And then ate the slimy fish underneath that was LEFT.  And the all you can eat part?  What a JOKE.  This was one of those places where they all you can eat you to death in slow motion.  ie, they bring 2 teeny pieces of fish, wait for you to eat, then you have to put another order in, wait for them to cook it, bring it, eat it, reorder, etc.  It took like 45 mins to an hour to eat 6 teeny pieces of fish.  If they would have just brought me 6 pieces to BEGIN with...  By then I was still hungry for more, but they had accomplished their goal and worn me out, the fish really wasn't good enough to wait another 10 minutes for another 2 little pieces.  I asked for the check and she dropped it off at the table.  Since I didn't want to wait another hour for her to finally come and get my credit card I finally gave up waiting for the last time and just slapped some cash down on the table and LEFT.  Yes, the prices were fairly reasonable as others have stated, but this place is clearly a living example of \"you get what you pay for.\"  I was happiest when I finally LEFT."}
{"text":"Great breakfast and friendly service - stopped in here en route to the airport to enjoy a traditional breakfast - highly recommend it!"}
{"text":"The food was horrible! My smothered chicken had no cheese on it And my mashed potatoes smelled rancid. The chicken and dumpling soup had questionable meat in it that didn't even resemble chicken. Not planning to ever go back."}
{"text":"I am upping my star rating for this place after a second visit.  The quality of the food (given the extremely reasonable price for the meal) makes this a pretty good value for the money spent.  Every part of my two-egg breakfast was cooked exactly as I requested...and the coffee kept on flowing!  Nice job, gang!"}
{"text":"The closest to a good old-fashioned New Jersey Diner I have found in Cleveland. Good food, great prices, fair portions. The only draw back for me, a Jersey native, are the earlier closing hours."}
{"text":"No. Just no.   Here's what was good: - the hostess who seated us was kind and cheerful.   Here's what was not good:  - dishwater coffee  (seriously the worst coffee I have ever had) - soda (ordered to replace the terrible coffee, and it was cloyingly sweet) - biscuit was damp, not buttered, just damp  - omelettes were barely mediocre, and mine had canned mushrooms - hash browns were partially burned and partially undercooked, and they were completely unseasoned  This meal tasted of that feeling when you realize you have settled for far less than what you wanted and were capable of in life, but you're stuck in your crummy soul-destroying job with kids you never really wanted, but you're too duty-bound to change anything.   Also, an urgent trip to the bathroom was required almost immediately. New rule: if the coffee is that bad, just leave."}
{"text":"I know it's hard to believe that a restaurant that is known for it's great prices would get a five star review, but I'm basically writing this review for the All You Can Eat Perch they have every Wednesday and Friday. I love all you can eat fish Fridays and have had my share of them and then some all around the Cleveland area, and I guarantee you that you simply can not find a better tasting perch dinner than here, and at a great price and all you can eat.  You need to give this a try next time you've got a taste for perch, even if you don't visit for the all you can eat, it really is the best perch I've tasted in the Cleveland area."}
{"text":"Great lil family run restaurant,  all day breakfast lots of lunch and dinner specials  Great fish fry! Cant beat lake erie perch this price! Service can be hit or miss \"slow\"depending  on time or day.     But staff are always great! Tip them well:)"}
{"text":"kind of like an upscale dennys if dennys had upscale and upscale meant a 5 on a scale of 10 LMAO. I passed by and was starving and it looked inviting but after waiting 15 minutes to even be acknowledged i knew i made a mistake. It wasnt horrible, but i honestly felt like i was in a rinky dink diner. Greasy breakfast food, the fryer oil was black because my french fries were brown, pretty sure they were sweet potato fries (giggles). The meal was your normal ihop, dennys type meal. service was average, smiles but you knew they were forced. Overall if i lived in the area i would probably make it my soak up my liquor spot but its a little far for me."}
{"text":"I've eaten here a few times.  Somer's is near a strip of hotels/motels close to, but not that close to, CLE Airport.  It is also across the parking lot and a block away from the RTA Red Line's Puritas - W. 150th station.    I seriously don't know what people are looking for.  A standard Denny's gets a standard 3 stars from me and, depending on what goes down, could get bumped up a little.  This place is better than a Denny's where all the dishes have that uniform, reliable taste across the board.  Not only that, Somer's is less expensive.  Being fairly tasty, I stuck to the farmer's omelette - eggs, cheese, ham, bacon, mushrooms, onions, and green peppers.  It also comes with a starch and bread.  The starch consisted of hash browns and the bread was sliced wheat bread and, thankfully, they do have strawberry jam packets.  To that, I added decaf.  The breakfast platter cost $ 6.49 and the coffee was $ 1.89.    The omelette was very tasty but then I love omelettes with these ingredients.  The potatoes weren't as crispy as I would have liked but the toast was fine.  House coffee is house coffee.  The service at Somer's is amicable and informal.  Many customers appear to be neighborhood or local employee type regulars.  The servers don't mess around ... they answer your questions, take your order, let you customize it to some degree, give the order to the kitchen, and out comes the food.  This place is funky and could just as well be on a lonely stretch of highway.  It has dated decor that is endearing in its own weird way, a gumball machine, and throw away newspapers for local goings-on and, of course, local area used cars for sale.  They have ample parking for their customer load.  Keep in mind that Somer's is a breakfast and lunch joint.  They close in the early afternoon after a ~ 6 a.m. opening for early birds.  It's a good value and you support a local small business.  Don't expect to be too, too impressed, but go for it."}
{"text":"Warm inviting place for a reasonably priced  non-franchised restaurant.  The food is consistently good whether having breakfast, lunch or dinner. Staff was friendly and efficient making for a pleasurable dining experience."}
{"text":"The wife &  I went here for an early morning meal and it was great. French toast was cooked to perfection and I had a burger that was also cooked and seasoned just right. Well definitely look to eat here again."}
{"text":"I just attempted to eat breakfast at Somer's. It was awful. The paper thin breakfast potatoes were both burnt and undercooked. My cheese omelette had mysterious crunchy brown things in it. The coffee was weaker than a bargain trash bag.   When the server returned to remove my plate, she didn't ask why I left more than half of my food behind.   When we we went to pay for our plates of sadness, I noticed a handwritten sign taped on the wall in the back room. It read that employees will be charged if they use a styrofoam cup. That's when it all clicked. This place is trying to cut so many corners it might as well be a circle."}
{"text":"This is the worst lunch I had in Cleveland yet , I ordered shawarma wrap .. my mistake .."}
{"text":"I have been to this place many times, and usually I love it! The owners are amazing and the food is good..... But tonight I placed a pick up order. It's been forever since we've been there. We ordered country fried steak, smothered chicken, and a lumberjack burger. My son enjoyed his burger. The country fried steak was so bland. The mashed potatoes were spoiled and inedible. The smothered chicken didn't even have cheese on it! Both soups had no flavor. Such a waste of $40! I'm not sure if this place is under new management or something, but it's changed, and not for the better! Although it saddens me, I probably won't go back!"}
{"text":"Very reasonable prices and always great food. The staff is always friendly and eager to please. I have yet to try any of the desserts in the front area where you cash out but they all look amazing.  They also have an early bird special where breakfast is like $2 or $3 before 8am.  The all u can eat perch on Fridays is also a great deal and the fish tastes great. A basic diner w a really friendly staff and very good prices."}
{"text":"I was staying at the Holiday Inn next door but i wasn't in the mood for Italian food which was what the place served inside my hotel. I checked yelp to see what was close by and decided to give this place a try.  My waitress Stephanie was very friendly and the service was super quick. My cup was never empty and my food was out hot and fresh. I tried the carniege wrap that a reviewer mentioned and it was really good. I also asked for fries instead of coleslaw or chips. The fries were great and tasted like they were just made from potatoes and not frozen and out of some bag.  The restaurant has a divey diner feel, which isn't a bad thing. You just won't be blown over by the decor but that's okay because the food is good, the prices and reasonable and the portions are plenty.  I did get dessert to go.... chocolate cheesecake. When I opened the takeout container I was suprised at how HUGE the slice was and it was tasty."}
{"text":"decent hearty breakfast for only $6 a person. Interior is nothing special, service was ok. Good place to just grab a cheap sit-down breakfast."}
{"text":"Don't do it. I got terrible food poisoning thanks to my breakfast (omelette with spinach, cheese & mushrooms with potatoes and an English muffin...pretty safe)."}
{"text":"My girlfriend is obsessed with this place for some reason i cant understand. The food is super cheap, they make their own chips which are really good. Portions are good and price is great. Breakfast is epic, you can get alot for very little. We normally only pay around $20 for the both of us. Staff is friendly. I reccomend sitting in the older gals sections. The place is packed on saturday and sunday mornings, parking lots full."}
{"text":"We stayed at the La Quinta across the street and Somer's Place seemed to be one of the few dining options in the area. Like Kari said, the place has a divey diner feel, but that's part of the charm. I got the perch and pierogies and my wife got the smothered chicken. We were satisfied with our meals and the price was very reasonable.  The waitress was very friendly and attentive to our needs. We appreciated the good customer service and desert recommendations. The Snickers cheesecake was delicious!! Will definitely come back if we're in the area."}
{"text":"We arrived there at 8:10pm on a Monday night(february 13th) and were greeted at the door by being told the restaurant closed at 9pm and it was up to us if we wanted to be seated or not which I thought was very rude since we had almost an hour until they closed. We had a gift card that I purchased from restaurants.com and we had already looked at the menu online so we had an idea of what we wanted to order so we said yes we would like to have a table. We were the ONLY table in the entire place kinda strange but with that kind of greeting at the door, if we didn't have the gift card we would have left. We ordered an appetizer sampler and an order of the mozzarella sticks they were brought out to us very fast and they were good, nothing special. But we were not given any appetizer plates or silverware to eat with we sat for several minutes thinking the server would bring them before I got up and found them myself, this was very disappointing, our meals came out shortly after and they were both good we had a roast beef sandwich and a chicken sandwich, the portions were generous the prices were cheap and overall the food was good. The service was less than standard, and dissapointing. While we were eating (I was sitting were I could see the clock on the wall) a man walked in at 8:40 and the server told him \"I'm sorry we are closed\" really with 20 minutes till they told us they closed? And at 8:50 a group of about 4-5 people came in the door and she also told them they were closed one of the people said to her thats not what your sign says and she turned to the man working in the kitchen and told him to turn the sign off outside because they were closed. The server was enough reason for me to never return but the food and reasonable prices might make me give it a second chance someday, but not any time soon."}
{"text":"Stopped in for breakfast on a recent visit to the city. Service was excellent and fast. Coffee was good and hot. Food was tasty and prices were good. Atmosphere portrays as though the place has been there for awhile. Not a newer fancy or chain restaurant. Food is homestyle and portion size was good."}
{"text":"We came on a Sunday morning and the restaurant had some people there, but not crowded at all.  Our waitress was friendly and nice, though we did have a mix up of a few drinks and some bacon from one order on another orders plate, but that might have been the kitchens fault, not her's.  The food was just okay, the prices are good and the place is clean.  My reason for the 3 stars is the restrooms. It was very clean, even cleaner than most I would say. But the smell of mold and sewage was absolutely overwhelming. It was so bad that I actually felt sick after going in to wash my hands, which I couldn't even finish doing. I hope they get whatever the problem is fixed, because other than that it is a nice place."}
{"text":"Great little place.  It is older. But one can tell it is loved by the owners.  There is art and fresh plants Ll over.  The food is fantastic!  Farmers omelet well done hash browns.  The fruit cup was spectacular.   I will defiantly return next time i am in the area.  Thanks Sandy"}
{"text":"Thought I had a review for this place already, but it's gone so whatever. We've been coming here for a couple times a year for a couple years now. We always remarked how quick the service is and how super friendly the staff is.  But Saturday morning, I had about the best visit here ever. I took 480 home from the shithole of Avon where I work overnight and landed at 150th around 6: 30 am. Never drove that way before, so that was cool.  The place was empty. One very friendly gal took my to go order and we chatted a bit.  Sat in the shadow of a cheesy framed poster of Cleveland from what I can only assume was the Hopkins airport periodical shop from 1988. Watched the sun come up on our sleepy burg through the window. Charming.  Food was ready(gyro omelet, my usual, and two eggs two-hotcakes for the wife). I was given an even friendlier sendoff with bags full of butter, salt, utensils, etc. That's when I had an epiphany. Cleveland girls are the most beautiful girls in the known universe. No pretense, no sense of superiority. The same goes for this diner. Just homey and down to earth as possible. The food was great. Overly generous portions and way better than that overpriced dump, Slob Evans. This place is not trendy, it's just real."}
{"text":"Perfect little greasy spoon breakfast diner! 2 people ate for under $15.  Restaurant is clean and service friendly; no waiting at 10:00 on Sunday morning. Coffee isn't great"}
