{"text":"Korean-Chinese Restaurants are a category unto themselves.  Chinese food with Korean influences.  Typically owned and operated by Chinese families who grew-up in Korea and later immigrated to the US.

Jjampong (spicy seafood noodle soup), Jajangmyeon (black bean noodles), Mongolian Beef, Mapo-ToFu are just some of the more popular items on their menu.  Spellings all vary depending on where you go.

This ownership has been around for a long time serving the BEST Korean-Chinese food in the Valley.  Actually, I would say that it would be a serious challenge to find a similar restaurant serving better food anywhere in the US.  And I've been to plenty from NY to LA.

They recently opened again inside the Korea Mart grocery store.  Previously, they operated from a large standalone restaurant and then shared space with a Japanese place before moving here.

There is No Visibility from the street.  You have to walk into the grocery store.

They do suck at promoting themselves but they serve great food at reasonable prices."}
{"text":"This is the best soup ever!!!!!!! Seafood spicy soup with noodles made onsite, they have the best black noodles and fried pork also, hidden in the Korea mart across from Dillards, noodles for life!!!!"}
{"text":"Today we went to Asiana food court to find that food was sold out. :/ I had a craving for spicy rice cakes and remembered the secret intel the Korea Mart workers gave me. A new place called Song San was opening inside Korea Mart. It was pretty quiet inside the market but we found Song San a hidden gem in Korea Mart. I was surprised and happy to find out that Song San has Korean Chinese food! 

There is a pretty extensive menu. I chatted with Song San's worker and found out she used to work at Sun Dining a popular Korean Chinese establishment in Mesa for 10 years! After hearing that and tasting the food I could have cried tears of joy. It felt like I had just reunited with a long lost family member! I found you Song San!! =*) 

The takeout order we got was a little pricy but it had lots of nice garlic and peppers. The Kang Po Ji #K9 Hot Braised Chicken is sooo bomb! I thought I would never taste this stuff again until visiting Orange County but now I can purchase it right here in Korea Mart.

For our takeout order they were generous with the kimchee and yellow radish. I hope more people come here and support this small business and plaza because the food is good!"}
