{"text":"Excellent pizza. I was in town for a working weekend and found this place based on the good reviews. I was not disappointed, the half sheet with mushrooms, pepperoni, and sausage was amazing and at $18 was quite a good deal. Two people had enough for a large dinner and lunch the next day. If I am ever in town again I would look them up in a heartbeat! well done pizza land!"}
{"text":"Very good pizza! Really fresh tasting toppings and the crust is not greasy. We've ordered from here a handfull of time ( we don't order pizza that often really) but this has become our go to place. We ordered 2 sheets pizzas and 1 half sheet for our daughter Birthday party and it was delivered on time ( to the mall theatre) and was delicious! All the parents complimented us on it actually and ask where it was from. Glad to support a locally owned spot. Haven't tried much else besides the pizza but the other offerings seem pretty typical of a pizza joint."}
{"text":"I like to try different pizza places .. having worked at pizza shops for a few years I have a pretty good gauge on decent pizza. I can tell you this pizza was very good , solid ingredients and the dough was excellent, obviously made fresh which is very important . Keep up the good work ."}
{"text":"I stumbled upon Sorella's while browsing through pizza joints on Yelp. I placed an order over the phone, and 35 minutes later the delivery driver is knocking on my door. He delivered a still piping hot pizza and subs, along with jo jo's and bacon bombs. The food was excellent and you get lots of it! So in review, Sorella's gives you great food, lots of it, with fast courteous delivery. What's not to like? This was my first order...but not my last!"}
{"text":"Unless pizza is coming from the City of Chicago, I'm not going to be ecstatic about it.  Period.  However, Sorella's is pretty darn good.  The fresh ingredients push the star level to 5.  I had a vegie pizza with sausage and a pepperoni pizza.  The tomatoes, mushrooms and onions tasted like they just came out of the garden....and this is February!  More importantly, the sausage is fresh and awesome!  None of those rabbit turds you get on other pizzas.  The crust is fresh and my wife and daughter thought it was very good.  I, however, was not overwhelmed.  It's too think to be thin and too thin to be thick.  Nice taste, just nothing special.    I will also agree with a previous review that there could have been more sauce.  What I tasted was good, but I like a bit more on my pie than they delivered.  Cheese was what I expected.  I walked in and ordered, took 25 minutes.   Tells you they are making it up fresh.  It was ready right when they said it would be...just enough time to walk down to Bilo's and have a couple of beers."}
{"text":"The pizza here is great!  The crust is not greasy and the toppings are generous and fresh.  We've been super happy with each new pizza we've tried!"}
{"text":"First time trying... we were outside the delivery area but they said would deliver this one time! Awesome pizza, had a Supreme and Pepperoni and also fried ravioli and bacon bombs!! Really good.. good enough where I'll drive and pick it up!!"}
{"text":"Got a large mushroom and pepperoni. Can't say enough about how good this pizza was. Perfect amount of sauce, cheese, and toppings. Everyone who ate it loved it. Wish there was one near my house..."}
{"text":"Had carry out pizza recently.  We were really happy with the pizza.  Crust, sauce, toppings, all great.  We ended up with one pizza with some toppings we didn't order, not things we didn't want, just didn't order.  I should have checked them in the store.  Had it not been for that minor item it would have been 5 stars.  Will get pizza from them again for sure."}
{"text":"Ordered pizza and wings here for the first time and absolutely loved both ! Good job Craig !!"}
{"text":"Favorite Pizza place in Strongsville. We are loyal customers because the pizza is always amazing!"}
{"text":"Very good pizza!  The place is small and hidden in the corner of a plaza.  It's family run, sparse inside.  Their menu is decent size and has a nice mix.  The pizza is not quite thin crust, and a little bread like.  If you like a bunch of sauce on your pizza, you'll be disappointed. The toppings (deluxe has pepperoni, sausage, green pepper, onion, and mushrooms) were really fresh and sausage has way too much flavor for frozen.  The cheese was a little lean, I would prefer extra cheese next time.  The sauce is light and a touch sweet.  I tried the Stromboli.  It's done as a bread filled with cheese, pepperoni, ham, hard salami and peppers.  It was great covered in chunks of garlic and Parmesan cheese.  Better than the pizza."}
{"text":"This was our first visit.  I loved the counter painted in Italian colors!  The store is very clean.  Everyone was very friendly, especially the young man at the counter.  We just got home and started eating our pizzas.  They are the BEST we've had in a while. We are new to the area and have been searching for a true pizza place that isn't a chain and goes for taste and quality!  We will be back."}
{"text":"What happened to our fave pizza place ?? Did it change owners? Our past 3 pizzas have been horrible. Tonight they admitted that they were training their 8 year old son to make the pizzas? Cute but not a cool way to run a business. Please go back to the great pizza place you used to be!!"}
{"text":"Amble into this establishment after a quick review of what was in Strongsville. I'm not from the area and was looking for something casual. Pizza's as casual as it gets.  Anyhoo. I'm greeted in a prompt and friendly manner. I place my order and ask if I might be able to eat at the lone adult table with chairs in the front of the store (there's a very tiny table with chairs for toddlers across the room). I'm told I could and I have a seat.   The side salad was tasty and the pepperoni bacon bombs were delectable. My BBQ chicken pizza was brought fresh from the oven with the promise it would burn my face off if I didn't let it rest for a few minutes. Desiring my face to remain as is, I let it sit for a bit. It was every bit as scrumptious as I hoped it would be.   I'm not sure when I'll be back this way, but this will be the place to go if I'm peckish for pizza."}
{"text":"Fresh. They grow their own herbs, and you can really taste it. Nice people and dedicated. I just did not like their toppings."}
{"text":"This is now our go to pizza place. I love the pizza, fresh veggies and authentic flavor like you would find on Murray Hill. My son loves the wings and cheese steak sub, the ladies that run the place are super friendly. Nice to see a family business among all of the chains in Strongsville."}
{"text":"I tried Sorella's for the first time last night. It's a small family-owned pizza shop tucked away in the shopping center behind Elevated Fitness and Old Carolina BBQ on Pearl Rd. If you didn't know it was there, you would never see it from the street.   I phoned in my order for pick-up on my way home from work. We agreed to a pick-up time, and when I arrived I was greeted by a nice young man (13 years old maybe?) and my order was ready just as agreed. Painless.   A little unorthodox for me, because I usually stick to the basics when trying a pizza place out for the first time, but instead I opted for a pepperoni, mushroom, sausage for myself and a white gourmet supreme (garlic sauce, chicken, bacon, red onion, tomato, spinach, and feta) for my girlfriend, and their fried ravioli as an \"appetizer.\"   All-in-all, the pizzas were both really good and the fried ravioli were good too. Nothing that I would say sets them apart from the others in the area with regard to their pizza or sauce, so my \"quest for the best\" continues, but I wouldn't hesitate to call Sorella's again."}
{"text":"Legit the best pizza place in the area. Love the crust, the fresh ingredients and everything I've ever tried. Amazing Philly cheesesteak sandwich, gyro and cheesy bread. The prices are a joke, for the quality and the size of the food - wow!! So cheap. I would recommend this place to anyone! Also, I love supporting a local small business."}
{"text":"hello foodies ,it me again steven ok ,now back to  serious bussbess ,LIke i always do in everthing ,ok first this is the place to try thier pizza 2 sisters own this place ,ok the scenry is not bad ,it could you alittle more ,the pizza is THE MOST TASTEE I EVER TRIED THE CRUST IS THE REAL DEAL !!!!!!!!!!!!!!!!!!!!!!!!!! i thought serious the crust again is the best in STRONGSVILLE!!!!!!!!!!!!!! in my opion  it like chewy type thart just melt in your mouth ,like liquid gold ,the pizzaa topping are SUPER FRESH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! and they ARENT AT ALL SKIMMPY  on thier toppings ,the pizza box is all white which is nice  ,,and thier sauce is supreme and i will most deff be back ,as a repeat customer,i wish they where open a little bit earlier then at 4pm ,there PIZZA DESCRIBE IN ONE WORD ;AMAZING:"}
{"text":"Just moved to a new house and of course had to try out the pizza place that's close to us and delivers. The gentleman taking our order was friendly. The order arrived in the time promised. The pizza was really good. I was feeding four teenage boys. Their favorite was the bacon cheeseburger pizza. (Without onions and pickles on half) The boys also really liked the baked potato pizza, the fried ravioli and the pepperoni bacon bombs. I thought the bombs were good but a bit dry. The marinara dipping sauce fixed that AND tasted really good! I really liked the regular pepperoni and cheese pizza. Everything in our order was hot and fresh. We will definitely order from them again!! Thanks!!!"}
{"text":"Thanks to Yelp we decided to give this place a try.  The pizza is good.   It is our new place for pizza. We have tried the Hawaiian and the supreme. Both were good.   We like to try different pizza places. The family still agrees they like this one the best. The crust is a little thinner and a little more  cheese to sauce. It is on top of our rotation."}
{"text":"This place was great right after they opened but then a few months back we noticed the quality of the food was declining.  The cheese isn't as fresh and the toppings seemed old as well. I also noticed perforations (little holes) in the crust which is a good indication that it's frozen.  Today I ordered pizza with spinach and they used the soggy stuff that comes out of a can. Gross!  Sorry....on to a new Strongsville favorite."}
{"text":"This the best pizza in strongsville. Service is outstanding. Family owned and operated the taste shows the love. I would recommend this establishment to anyone"}
{"text":"This place came recommended by a close friend and let me say, it did NOT disappoint!!! I had FOUR slices, I just couldn't stop eating it. I finally had to walk away or I would still be eating. We ordered 2 large pizzas and a chicken salad and the 5 of us were in awe of how good it all was. We will definitely be ordering here from now on, so nice to have a really good pizza place to order from. I can't wait to try more items on the menu!"}
{"text":"If you are hungry for pizza and I mean good pizza this place is it. I stumbled upon their name by accident and I am so glad I did. They have great pizza, meaty wings and fabulous bread sticks. The customer service is awesome especially from the little kid that takes the orders ;) will definitely be a regular with them."}
{"text":"Family owned business that is pretty good. One of the best, if not best pizza place in Strongsville area."}
{"text":"I've had pizza as good, but long enough ago that memory fails exactly where. Just 3 tables, so carryout/delivery. Delicious! The usual toppings, including anchovies (yes!), delicious sauce and crust, overall delightful. Just a couple miles off the Ohio Turnpike. Perfect to take a short pike break and get back on the road with the perfect road food!  The baby girl loves it so much! Nice friendly staff!"}
{"text":"We just tried Sorella's for the first time today, and it was a hit with the whole family. We tried the taco pizza, one with old world pepperoni and onions and a side of the pepperoni bacon bombs. They were all great, lots of flavor. We will be ordering again soon."}
{"text":"Used a coupon and got a large specialty pizza, large 1 topping.  We added a large salad to it.  It was $30.  That's a pretty good deal.  I picked up the order and it was on time.  The large specialty was a supreme.  The toppings all tasted fresh and were very good.  The dough had a yeasty taste to it.  It was tender and almost undercooked.  The large 1 topping was split as an extra cheese and black olive for the kids.  They both ate 2 pieces each.  In my book that is a win.  Chef salad reminded me more of an antipasta because of the slices of lunch meats on it.  It was also fresh tasting.  Not from a bag.  Their dressing was a Ken's dressing packet.  Overall it was tasty pie.  Not the best I've ever had.  But served its purpose and was a great value."}
