{"text":"Went here the other day with a friend of mine. I tried 3 different tacos jackfruit, chicken and pulled pork. Espescially the jackfruit which we also had on our nachos. All 3 were excellent and seasoned to perfection. We also split the sriracha fries which were also great.The service was excellent. My only criticism is the taro bubble tea i got was a bit too sweet for my liking. But the food was fantastic and I would highly recommend this place to anyone."}
{"text":"This place is amazing!!! They just open! You have options of sandwich, tacos, buns, and salad. And in terms of mead choices, there are chicken, pulled pork, and beef! I have tried the chicken and pulled pork, they are so tasty! The owner makes everything in house. And those meat are marinated long hours, so it is full of flavours. The portion is also HUGE for its price! During 11-3pm, they also have $5 sandwich special.  I would highly recommend this place!!!"}
{"text":"Cheap and cheerful. Friendly staff, large portions and great selection of sandwiches and bowls - perfect for lunch! So happy we tried this place."}
{"text":"Just passed by on my way home and figured I'd give this new place a try. I got the pulled pork tacos and they were HUGE! Everything is made fresh and in-house, the only thing I regret is not seeing the fried pork belly on the menu before I ordered...oh well there's always next time :-). This place is a winner, great food and great people run it. Keep it up guys!"}
{"text":"Looking for a great place to get freshly made sandwiches in Vaughan? Look no further than Southeast Sandwiches. I came here on their 3rd day of opening. The restaurant is located in an outdoor mall, so there's plenty of parking. They also have lots of tables, which makes it very convenient of dine in. Given that they're relatively new, the ordering and preparation process was fairly slow, so don't expect to get in and out quickly.  The staff suggested that the restaurant is known for their Portuguese buns, which they get from a local bakery every other day. We ordered the  braised beef steak and the cod on a Portuguese bun. Those buns were stuffed and that was without the topping. You can add any toppings you want and any sauce that you want. Once the sandwich is constructed, it is then toasted on a flat top. I thought the sandwiches were tasty. The braised beef was quite savory and was my favorite of the two. The cod was delicious as well, but I thought the braised beef had a lot more flavor. I didn't think that a single sandwich alone would fill you up, so definitely get a side as well."}
{"text":"This place just opened up and it's amazing! They have a variety of meat, tofu, seafood and toppings to put in your sandwich. All their sauces are made in house and are delicious. The sandwich i got was the \"chicken unskewered\" on a bun and the sriracha fries. You can customize your sandwich and choose what you'd like on it. I got all the toppings and a few sauces. The hot sauce was my favourite! After you choose your toppings they put the sandwich on a flat top and toast the bun (nice touch if you ask me) The sandwich was sooooooo good (I'm craving another one right now ). The sriracha fries were perfectly seasoned. I'd really recommend this place! The staff are friendly and are ready to answer any questions or concerns you have and the food is exceptional! I wish i lived closer"}
{"text":"So my review is based on taste and the sandwich tasted good however I'm not a fan of seeing a perfectly nice bun flattened into a panini, it just doesn't make sense to squish every beautiful ingredient down like that, i had the pulled pork which tasted amazing. Next time I'm going to ask to just lightly toast the bun and add everything in after plus i don't like my veggies to be all wilted and warm, thats just my preference."}
