{"text":"Wonderful little spot, glad I found it! Staff is super friendly and courteous, food was AMAZING, had the crazy 8 with French toast and a blueberry waffle 6/5. Will definitely come back if I'm in the area and would recommend to a friend!"}
{"text":"I have been to this place on a Sunday morning somewhere around 9. Most of the tables were occupied already. We were lucky to get one by the window. The food tasted really good. There hash and french toast are worth going for."}
{"text":"This place was legit. My fiance and I were first timers and we were blown away by the food. I am not a big breakfast food fan, but I got this corn beef hash omlette... and it was phenominal. Such a small establishment, but the food comes in big portions and is really something special."}
{"text":"Stopped by Southside diner for the first come today and I was impressed. The setup was nice and the waitress (Kim) was very attentive and personable. My food came quickly and was perfectly cooked. Kim recommended the French toast which was delicious. Great place for a quick breakfast."}
{"text":"Never fails to beat my expectations.  Best breakfast  in Cleveland,  I don't think I'll ever stop coming here. Eggs are always perfect.  Hash is always perfect.  The bacon is the epitome of crunchy. Love it."}
{"text":"Breakfast tacos. Hash specials. Athenian breakfast. French toast specials. Get them all, in that order. I've tried most of the menu, and I've never been disappointed. If you are lucky enough to be there while barbacoa hash is the special, don't hesitate. Order it. Order two. You won't regret it. 
Also: corned beef anything. Hash. Sandwich. Amazing. Made in house."}
{"text":"I was looking for someplace new to try for breakfast and based on the other Yelp reviews I thought I'd give the Southside Diner a try. The restaurant was small and cozy and all the employees were friendly and had a smile on their face. My friend ordered the special, cinnamon coffee cake french toast and I had eggs, sausage, and breakfast potatoes which we shared. It was delicious! Bottomless cup of coffee was great too! We thoroughly enjoyed our breakfast and will be coming back soon!"}
{"text":"The Mexican tacos were amazing. Very nice place and definitely worth a try. I plan to make this my \"go to\" spot."}
{"text":"The best hash I have had in a long time. Last time in I tried the special on the menu \"gyro hash\", I can't tell you how delicious it is with words. You have to try it !"}
{"text":"Really don't understand the great reviews.  My husband and I tried this diner since we were staying down the road and the reviews were good.  We each had a dish and even got one to share as we were very hungry. All three were just ok.  Are diners so bad in Cleveland that this is rated so highly?  The other restaurants we tried on our trip were great, so there are clearly great places out there.  The people were nice, but as the food was mediocre, we didn't understand the hype."}
{"text":"Very good.  Had the corned beef hash omelette. It was huge and not overly greasy. It was a little crowded and loud but that is another sign of a good restaurant. Also the serving staff were very attentive even though they were busy."}
{"text":"The service is horrible. The waitress brought us coffee and never returned to take our order. After 20 minutes we realized she had taken the orders of everyone who came in after us. This is an 8 table establishment so the neglect was inexcusable. The decor is shabby \"velvet Elvis\" and none too clean. After 25 minutes we paid for the coffee and left. We received a half hearted apology from the waitress. 
We won't  be back."}
{"text":"You want to eat at the best breakfast restaurant in Parma?  If you are reading this review you have found it.  Family owned, excellent cook, super friendly staff.  Menu is continuously changing so your taste will never get bored!   Try the specials of the week, you will not be disappointed!!!!"}
{"text":"Solid diner! Breakfast was great, quick and friendly service. Very small place so when people are waiting to be sat you feel a little pressure to eat and get out quick. Will go back again for sure tho."}
{"text":"Had a FANTASTIC BREAKFAST. EGGS Poached PERFECTLY, Hollandaise Sauce right consistency & seasoned just right.
The Hash was MARVELOUS, spicy, seasoned well, generous portion.
I even ordered one to go.
   To compliment & add to my Wonderful Dining Experience was my server. 
She was very knowledgeable about the menu & ingredients in specials & rest of menu. She was attentive but did not hover or pester.
A True Professional. She was keeping the front of the House clean & orderly while still maintaining High Service Standards set up by the Owner.
I will Definitely be a Frequent Guest at South Side."}
{"text":"Love south side diner! We spend a lot of Sunday mornings here. The food is always good and the staff is always courteous and attentive!"}
{"text":"Everything about this place is amazing! I've sampled several items on their menu and my favorite items are definitely the chorizo tacos and the French toast. The service is awesome and food is even better. I can't get enough of this place, however, I wish they served freshly squeezed orange juice. Next time I go in, I'll bring it up to management. 

I'll definitely be back to Southside!"}
{"text":"Plain food. Patty Melt, fries and Iced Tea. $11.13 before tip. Chatty waitress was helpful ..Kim was her name I think. Did that notice the food was not over salted. Wheel chair accessible. TV."}
{"text":"A truley hidden gem. Out of the world customer service. Came in with my family of 12 and everyone left happy. The owner was very friendly and ensured we all were satisfied. Taking those extra steps to make our visit enjoyable. Next time I am in Cleveland this will be our first daily stop. Best breakfast in Cleveland!"}
{"text":"Southside Diner is more than what it appears from the road. Situated off Pleasant Valley near York Rd in a small plaza, it is easy to miss.  My husband and I stopped in on a whim and were immediately struck by the friendliness of the place.  We felt welcomed as we found a table in the eclectic 50's style diner.  Vintage Coke memorobilia was dotted throughout the restaraunt and the walls featured posters of James Dean and Norma Jean, in and around Hollywood roadside diners. A large display of antique state license plates decorated one wall, while napkins holders on the tables looked as though they were saved from our childhood. The front of the restaurant included a full wall of windows bringing in loads of light.  

As a side note: My college-aged daughter has been dining here off and on, for over a year and each time she comes home and tells me how much she loves this place.  I just didn't give much credence to her comments at the time. My loss.

The back of the diner featured a bar and stool set-up while smaller tables were located in an open area.  It was small and intimate, but I happen to like that! Behind the bar was the grill and food prep area.  We could see everything that was happening, however it wasn't the least bit distracting.  The cooks were calm and worked diligently on the orders being placed.  I would guess there were close to 12 or so guests, two at a table and perhaps 2 or 3 guests at the front bar on stools.   

Our server was friendly and genuine. She described the specials and didn't even finish before we landed on what would soon be our favorites! For drinks, my husband ordered a coke, but he had to choose between the fountain, twist cap or a nostalgic bottle.  He opted for the vintage classic-style bottle.  I enjoyed a steaming cup of coffe and spied fresh creamer on the table. My coffee was consistently topped off so that it was never cold. Our server checked on us, but was not interruptive. 

The special I was eager to try was the vegetarian benedict. Oh my! I coudn't believe the presentation. Why didn't I take a picture? It wasn't the first thing on my mind at the moment.  The eggs were perfectly cooked as they lay across a bed of fresh baby spinach leaves and thickly sliced, perfectly ripened tomato.  Below that was a combination of finely chopped grilled onions, peppers, mushrooms and other seasonings spread over an opened faced toasted english muffin.  The eggs were topped with perfectly made hollandaise sauce. Along with the vegetarian eggs benedict were piping hot, fried potatoes.  Did I say this meal was perfect?  It really was!  And, it tasted delicious.  The flavors were fresh and everything was seasoned just right.  I was completely impressed and enjoyed every bite of what I could finish!  

My husband ordered turkey hash and eggs.  I can't tell you what exactly was on his plate (I was too busy enjoying mine!), but it looked great and he quickly pointed out the dried cranberries that were included in the presentation of the meal.  Each corner boasted a couple of dried cranberries that added a delightful flavor to the eggs and turkey hash. He was unable to finish his meal, so we boxed up what remained to bring home.  

Truly, this is not your ordinary diner.  I have been to many fine restaurants and have never enjoyed a breakfast as much as I did today.  The presentation alone made it worth our visit.   

Our bill was reasonable for the quality and quantity of each dish.  Clearly a lot of heart goes into each guest's meal and if each visit is like our first, we are most likely to stop in more often. Our bill came to $34, however the full menu did boast lesser priced breakfast and lunch options.  We simply wanted to try the breakfast specials for the day. 

All in all, I would say that Southside Diner is a gem of a place and I encourage anyone who lives nearby to give it a try.  Be sure to come hungry!"}
{"text":"This place deserves 5 stars. Southside Diner has the best breakfast tacos I've ever had. The owner/chef even came out and spoke with us to give his personal recommendations. All of the staff was engaging and friendly. The perfect stop on our cross country road trip!"}
{"text":"Great food. 

Service a bit slow; half of our meals came out a good 10 minutes before the rest, and they forgot our toast. Also took a while to get a spot for 4 people as its a small place.

Nice staff!"}
{"text":"Best breakfast place! Never gets old seeing the cooks put on a show as they cook your food in the open kitchen. Every week the specials change, best so far has been the muffin French toast! Service is quick and all the employees are especially hospitable. Although the restaurant isn't too large the wait is never long and definitely worth waiting for."}
{"text":"I wish there were more diners like this. Food is very good and reasonably priced. Every table was filled but people were still seated quickly. Bacon is so good, also love their French toast!! Definitely recommend!"}
{"text":"I went in on a whim. Its decor is very retro-chic, the servers were super friendly and personable, the cook was chatty and happy, the chairs were comfortable and the food was really good! There are daily specials and you can order breakfast or lunch at any time during the day. It's very clean inside and it really is a gem for Parma. It's a little pricier than some other breakfast spots but it definitely won't break the bank."}
{"text":"Yelp helped!
This was a great \"find\" for us today while going thru Parma.  Nothing better than a mid day breakfast.  I had the homemade corn beef hash and eggs.....Awesome!  Best corned beef ever.
My wife went with lunch.....homemade chicken salad sandwich.  Great and overflowing.  Will stop in when we are in Parma again."}
{"text":"When you think of neighborhood diner, what are the things that come to mind? Small space (check). Filled with locals and regulars (check). Unassuming decor (check). Friendly although hurried, staff (check). Good coffee (check). Good (really good) food (check). Then you have just described Southside Diner. 

We had a waffle -- crispy and light, and sausage biscuits and gravy that were rich and homemade and a croissant sandwich that was filled with meat and eggs and cheese and was very good.
Parking was easy too.
We will go back as often as we can. It was great to be in a place, where you felt appreciated and the food beat expectations.
Well done."}
{"text":"Absolutely love this little diner.  Don't let the size of this diner fool you.  John Paul is amazing.   He makes the best breakfast in Parma.   From pepper bacon to home made sausage gravy to the spectacular muffin french toast.   The staff is Friendly & fast.  The  price for the quality & quantity of the food is spot on.  My friends often as where to go for a great bite to eat and this is always on my list.   Bee knows food and this is good eats!!!"}
{"text":"Went for breakfast and server asked if we wanted cheese on our eggs. Charged us for cheese even though they didn't put on the eggs and refused to credit bill for one dollar. Asked them to show me the cheese and they couldn't.  Very poor business practice. Very loud atmosphere.  Couldn't even carry a conversation. So hot that we were sweating."}
{"text":"Decent food for a decent price, quick service which was nice.  Tables are a little bit too close together for my liking, especially if it is busy.  But that's the only negative thing I can say about this place. Give this place a try!"}
{"text":"Stop here after the kids basketball game just to have a quick brunch I enjoyed the food had the chicken and waffles which was excellent don't remember what everyone else had but everyone said they enjoy there meals, will be back"}
{"text":"This place rocks! Little diner and a gem. Breakfast is so good and the corned beef is amazing! Prices are good and again food is awesome. Service is excellent especially the two sisters that work there. Try it! You won't be disappointed!"}
{"text":"For sure my new breakfast spot! Really good food and generous servings. The servers are always nice, and I like the variety. Breakfast specials change every few days. I am still waiting to try one of the hash dishes other reviewers have talked about!"}
{"text":"Very,very good best breakfast I have ever had. Chicken and waffles are awesome!!!!
Really small place but the service is great."}
{"text":"By far... The BEST breakfast/brunch diner in the area! I live in Texas and make it a DELIBERATE EFFORT to come here at least once every visit for breakfast."}
{"text":"Great food!  Also one of the best breakfasts in Cleveland.  Staff is very friendly and attentive to customers."}
{"text":"Nondescript spot in corner strip mall. GO HERE ANYWAY!!
Food was absolutely SUPERB!! Chicken & Waffles were ON POINT, and the breakfast burrito was more than a 13 year old boy could eat in one sitting!!
Gals serving were not fake, slow or attituded-up. Genuine and nice to talk to.....where do you get that anymore!!
5 star diner."}
{"text":"Did not get a bang for my buck. The food was okay but for a small privately owned diner I would expect better prices. My husband and I went for breakfast one morning and we got our bill we were surprised, things just did not add up. We were trying to explain the charges to the waitress but after explaining several times and not getting far we just paid the bill. With the amount of our bill we could've ate at the cheesecake factory for breakfast. The only reason I gave it to stars is because some of the staff was friendly and the diner has a cool design inside. We won't be going back though."}
{"text":"I have been coming to this place for years now. And every single experience has been beyond perfect. They have a PHENOMENAL staff that are friendly, responsive, and respectful. The place it's self is very cozy, relaxing, and creates a good atmosphere. The food is EXTRAORDINARY. Everything is made from scratch and the chefs certainly know what they're doing. The quality and quantity of what you get for the price is what makes this place so great in my opinion. Whether it's breakfast or lunch, you'll definitely get your money's worth."}
{"text":"Stopped there as I was passing through Ohio and had the corn beef Reuben. Best one I've ever had. Very nice people in there too"}
{"text":"Went here on a whim and I must say that they didn't disappoint.  The diner is small, there's not a lot of tables, that's my only complaint.  The service was prompt and the food was plentiful and excellent!  They also serve breakfast all day.  The prices are good and I highly recommend it!"}
{"text":"Great little breakfast diner catering to the local crowd. Found it on yelp and went for a nice breakfast on our way to Canton. The place was packed and the entire staff gives excellent service and very friendly and the cooks know how to cook eggs over medium without burning them and their bacon is very tasty! Definitely going back for breakfast again. Prices are very reasonable"}
{"text":"Wonderful food - I stopped in while visiting Cleveland and tried the corned beef breakfast. It was amazing. The biscuit and gravy is fantastic too - the biscuits are light and fluffy and gravy is savory with real sausage and a slightly sweet taste. The place was packed wall to wall the whole time I was there and the service was still fast and friendly. Highly recommend this joint - it's a lovely little dive that's worth the wait."}
{"text":"If you are in the Cleveland area and need an authentic American breakfast experience, this is your place. The diner is spotless and the staff is very welcoming.  You must try their bagel sandwich.  Service was prompt and friendly and our server was very knowledgeable about the Cleveland area.  She directed us to the water front and recommended other sites to visit. Great breakfast experience.  Cool retro decor too."}
{"text":"What a great little hole in the wall. Came in for breakfast and the food lived up to the reviews. Ordered the Irish Benedict and a traditional omelette. The Benedict had corned beef, sauerkraut, a poached egg and hollandaise sauce all over an English muffin...times 2!  Included a side of breakfast potatoes that were perfectly prepared and tastey. I enjoyed it 4 hours ago and am still stuffed!  Not sure I'm a fan of eggs and kraut, but it has nothing to do with this place. The dish was expertly prepared and looked fabulous. 

Daughter had the omelette and was equally impressed.  Service was polite and fast. Will go back in a heartbeat."}
{"text":"Went to check out the place due to the good reviews!..  A bit over priced..  but tasty food for sure!!!"}
{"text":"What's not to love about a simple diner, with a simple menu and great food?! They have 4-5 specials listed a day and they serve breakfast and lunch all day (until 3pm when they close). The place seats about 25 people at a time and had one waitress and 3 cooks while we were there. The child I was with was super happy to get a mickey mouse pancake with chocolate syrup and whipped cream.  I ordered the special pumpkin muffin french toast and it was just perfect for the fall season. Other reviews state that the hash is delicious and that just gives me another reason to come back!"}
{"text":"We stopped in on a trip to Cleveland after reading the Yelp reviews (thanks, Yelp!). It's diner fare but . . . like, a really good version. You know how sometimes you go to a diner and there's just enough carelessness that you're really not happy with the result? Southside is the opposite of that.

I had a patty melt and some home fries. Their home fries were stellar; they reminded me of my dad's Lyonnaise potatoes. I don't remember what my husband had, but he also was really happy with his meal; he gave the place his stamp of approval, which doesn't often happen. (He's even pickier than I am about restaurants. It's true.)

Definitely will stop here again next time I'm in the area."}
{"text":"Looked for popular diners in the Parma area and saw Southside Deli. Always try to support/patronize independent restaurants. Quaint 50's style decor with seating for approx 20 people. Polite and efficient waitress served us. Food was typical diner fare. I had a gyro w/fries. Ample portions and fresh. Nice place."}
{"text":"Excellent restaurant!! Food was amazing service was great. Friendly vibes. I am coming back next time I visit Ohio!!!!!!"}
{"text":"Fantastic spot. It appeared to be a \"locals\" spot. Food was great and the coffee was really good as well."}
{"text":"I love supporting local no matter where I am. There are about 30 total seats on the joint. We had our infant in a car seat with us and the staff was VERY friendly. We had to wait a little bit on a Saturday around noon, but the kitchen did a great job of turning food out thus rotating customers. Great laid back, friendly atmosphere."}
{"text":"As far as diners go, I really like this place.  Went there for breakfast with the family (6 of us) and we had to sit at the bar because the seating is very limited.  Not a problem though, it's a nice bar and we enjoyed our experience.  

The food was very good and the service was perfectly fine.  Met a lot of nice people who were picking up orders and it seems like they already have a pretty good group of \"regulars\" who eat there.  The open kitchen was good entertainment while we chatted and waited on our orders.

Aside from the occasional cramped dining room situation, this place it tops for an affordable delicious breakfast."}
{"text":"I had been craving a good biscuit and gravy, so my boyfriend and I decided to try this diner. We were NOT disappointed! I also tried the \"Kitchen Sink,\" and they were both absolutely delicious. The sausage gravy is some of the best I've found in the Parma Heights area, and the biscuits were light and fluffy. The atmosphere was super fun and groovy too! It felt like an old school diner. Definitely check it out if you're in the area!"}
{"text":"We stopped in to South Side Diner around noon on a Friday. Despite a lot of snow there were many people in the restaurant. This diner features a retro feel with vintage model cars, license plates and art featuring 50s Icons. Counter seating and table seating is available; about 10 counter seats and tables for about 20. We were greeted immediately and service was fast and courteous. We had the corned beef and eggs breakfast and country fried steak and eggs breakfast. The food was excellent. We paid about $20 for breakfast for two people with one coffee.

The price was good, the food was good, the service was good. It's not some white tablecloth place, the grills are in full view as the guys cook. It's small and not quiet. If American Diner food isn't your thing, this isn't your place."}
{"text":"Visit on 11/22/2016

We loved this small, friendly diner near Parma. The decor is definitely retro, and interesting, the food is delicious and the service is excellent! The homemade corned beef hash is awesome!! We really enjoyed our breakfast at Southside Diner. Highly Recommend!   Southside Diner was a great start to our day of driving to Chicago.  Will return anytime we are in the area! ."}
{"text":"You would never find this place without being from this area of Cleveland, or reviews like this and GPS. This is my favorite type place to eat! So glad I discovered here on yelp. It was a long drive from downtown but worth it! I had the $3.99 3-egg/3 bacon and home fries with toast, and also the French toast. WOW - it was great! Wife had the cheeseburger an loved it too. Large milk and pop and tax/all for $14. NEVER will you find food this good for twice the price. Busy place and justly so, only had to wait 10 mins for a seat but it took 20-25 mins for the food to arrive. If your in a hurry this is not the spot. But with 50 other reasons, unless you have no time either come back later or have a bad meal somewhere else!"}
{"text":"Great food; classic diner food with Greek and modern twists. Friendly community atmosphere. The chicken and waffles are my favorite."}
{"text":"Love it! Great wait staff, great food! We always have something delicious here! We've been multiple times and I'm impressed each time"}
{"text":"Such a good place. Everything you'd want from a diner... The potatoes are especially good!!"}
{"text":"my gosh is this place tiny. it didn't seem so small on New Day Cleveland. 

anyway, i liked it. i think i liked it considerably more than Danielle who said her food was good but hated the coffee. I thought it was good coffee once i figured out the sweetener to coffee ratio. 

my Country Fried Steak was delicious and huge. the home fries were perfectly as i like them. i could have used a longer cook on my eggs - which were a little too \"softly\" scrambled for my liking but i still ate them up without any issue.

there were so many other things on the menu i'd like to try. i hope we'll go back."}
{"text":"I do not normally complain about restaurants, but I was extremely disappointed. My family and I tried the diner because of the great reviews. I do have to admit that the waffles that my daughters ordered were really fluffy and delicious. The ultimate omelet my husband ordered was just full of potatoes and had very little bacon or sausage and was quite dry.  I ordered the benedict cordon bleu.  The muffins were so dry that I couldn't even cut through them. The poached eggs were well done, the yolks were like a hard boiled eggs, the ham was dry and tough.  Breakfast for a family of four was $41 dollars. A little over priced for me especially when you ordered one coffee and three waters.  I cannot recommend this place.  We definitely won't be back."}
{"text":"we went on a sunday at 12:30 and had about a 20 minute wait. its only a small dining room, and it was hoppin. when our table became available, my 91 year old father had a hard time sitting into the low chair, and the table was wobbly and he ended up spilling creamer all over himself and the floor. the staff were prompt getting him and table cleaned up.they went above and beyond to make things right.  the chairs and booth seating are all low and the tables rickety.
 service was great, for a busy as it was, food was very good. we were a table of 6 and everyone liked what they had (corned beef and eggs, home fries, gyro and egg, potato pancake with eggs/kraught. and special banana foster cheese cake pancakes.) coffee was pretty good.  for 6 people and coffee the bill was 65 dollars. so roughly 13.5 per person with 20+% tip.
I would go back, I would recommend for a causal dining experience. I  just caution that for someone that is elderly the furniture is not very sturdy and also not a lot of places to seat when there is a wait. (I am a therapist and work with elderly so can't help but be aware of accessibility and safety concerns).
 if they got some sturdy furniture I would give them a 5, for overall improved experience."}
{"text":"For your average small suburb diner, I liked Southside. If your looking for cheap but good breakfast food than I would check this place out. Coming in on a Saturday morning, it was packed and there was a line almost out the door. The employees were accommodating and made sure to seat people quickly so we did not wait long at all. We were served momentarily and the food came out quickly. There was a bit of a mix up with bringing out a gyro sandwich instead of an omelette but nothing that was an issue. They brought out the omelette very quickly, brought coffee around multiple times, and extra tzatziki sauce. The kitchen is very open and it was cool to see how they cut the gyro off of the stick. If I'm ever in the area again, I would come here again."}
{"text":"The employees of this diner work hard and the quality of their food shows it! A very good place for breakfast. The diner is clean and updated. The dining area is a little small but my fiancé and I sat down right away. Good prices too!"}
{"text":"Best diner in Cleveland area! It has classic diner food, but also interesting specials for a more adventurous eater. I had the chicken waffles, which was wonderful. A nice sugary glaze went well with the spicy sriracha sauce. We also had spicy chorizo hash (one of the daily specials) which was also really good. Lots of other things on the menu I look forward to trying in the future. The service is quick and friendly. Highly recommend!"}
{"text":"Excellent,  friendly service by Kim and outstanding breakfast choices, which are served all day. Try the Western or gyro omelettes, delicious and comes with fried potatoes and toast.

Reasonably priced, note the hours, before you plan a trip. This will be our breakfast place forevers! Found here on yelp."}
{"text":"This place never disappoints. Great service and great food! The food is prepared by the same cook every time. It's always perfectly seasoned and delicious. The corned beef hash is a favorite, the omelette' are unreal."}
{"text":"This place is an under rated diamond in the rough. Amazing for a quick and delicious breakfast :)"}
{"text":"I grew up in the Parma area and come back every so often to visit family.  We found Southside Diner over Christmas break when we saw the reviews on Yelp. We now make it a point to go there for breakfast anytime we're up that way.   
Definitely a unique breakfast experience from anything else in the area.   He loves Corned Beef Hash and says this is one of the best he's ever had.  I enjoy the \"The Parma\" in both an omelette and wrap.  Portion sizes are perfect and we've had great food both times.  There are many things on the menu we'd love to try.  

The only downfall to this place is that it's tiny!  Maybe 12 tables tops and it's not ideal for large groups.  There Sis a bar you can sit and eat.  Service has been great, especially for it being so busy and not a lot of space to work.  We will most definitely  be back that next time we're up that way!"}
{"text":"Cute place!  Super waitresses, knowledgeable about the menu, and local area 

We had the corned beef breakfast, it was amazing.  Big enough to share. We had a latke, super good. 

Go! If you enjoy locally owned, hole in the wall, loaded with locals.  

Maybe a stop on our return!"}
{"text":"Wow...  what a wonderful little place, in Parma of all places.  The Wife and I are not really diner people.  I mean, I like the idea and diners and Americana and all, but really when you are surrounded by so many other interesting ethnic eats, why go to a diner at all?  But I was intrigued by the idea of this Southside Diner and the reviews have been excellent.  So last Saturday we courageously gathered up The Kid and drove out to SS Diner to give it a go.  Suffice to say, we were impressed.

I was grateful to see that there was not a line to have breakfast at 8 AM or so.  We were quickly seated at one of the small tables to the side.  They did have child seats, which is a definite plus.  So many options available and it was hard to choose but we decided on the Sriracha chicken and waffles and chorizo hash.  Both interesting and different enough that it was not just diner food.  Our waitress was pleasant and efficient.  Decor of the place is definitely very dineresque/Americana- just what you'd expect.  Lots of TV's to watch if you're into that sort of thing.

Food took a while to come out, but you could tell it was freshly prepared.  Coffee was fine by me, but the Wife scrunched her nose at it.  I'm not gonna lie- I'm more of a coffee with my cream and sugar kind of person, so true afficianados may not find it up to snuff.

But the food- wow, so creative and interesting.  Loved the chicken and waffles.  Lightly crispy breaded chicken breast w/ a not overwhelmingly hot Sriacha sauce.  Fresh waffles drizzled with (a little too much) sugar syrup.  A perfect match.  Next time I'll get the sauce on the side though- it tended to get a little soggy as it sat on the waffle.  Chorizo hash was delicious.  Crispy hash done just right with a mix of other tasty veggies along for the ride.  We loved it.  Lots of other interesting choices on the menu to consider on future visits and prices were reasonable.

Would I come out of my way to visit SS diner?  Depends if I'm in a diner mood.  If I was, I definitely would come back.  And I'd probably bring guests who are looking for interesting American food.  There was a line queuing up as we were leaving so my suggestion would be to come early unless you like to wait.  Or maybe get take out."}
{"text":"This place has EVERYTHING one would want from a classy little diner.  The food was outstanding, priced very fairly, the atmosphere was great, very corner diner feeling.  The service was outstanding, coffee cup kept full and the best part is that it's right around the corner from my house.  Can't wait to go back again and again and well worth the drive if you're not close like I am."}
{"text":"Thank you for great service and a delicious breakfast bagel sandwich. Small diner is cozy and tight on a Saturday morning but pricing is worth it compared to chain breakfast eats."}
{"text":"Place I go to breakfast most. It is very small, so if your party is more than two, good luck. Even with only two, I leave without sitting at times. 

Good food, if a bit pricey. I like the gyro omelette and the Greek omelette. Coffee sucks sometimes.

A little pricey comparatively, but good food and service."}
{"text":"The best little hidden treasure.  We had a great breakfast.  Our waitress. Dina, was AMAZING!!!!  We were in town from Mi. and found this place on YELP.  I would love to go back again."}
{"text":"Great breakfast choices, well worth the drive from Strongsville. Try the fresh made corned beef hash. Friendly servers too. Not too crowded at 8:00 on Sunday."}
{"text":"I can't say enough amazing things about Southside Diner!  My friend and I were visiting from out of town and went here for brunch.  We shared the chicken and waffles and the bagel sandwich.  Incredible food, service and quaint atmosphere!  (Special shout out to Tori!). We sat at the bar area and also happened to notice how amazing all the other food looked as they took it away.  This will definitely be a regular spot when I return to Cleveland.  Thanks again so much!!"}
{"text":"Great breakfast every time! I've never had a bad meal! I have a high standard for food and they exceed it every time. I can't say enough good things about this place. You can tell the guy making your food takes pride in what he's doing! Get in this place for a meal! I promise you'll come back."}
{"text":"In town for work and was looking for a good breakfast spot. Look no further this is it. I did a corn beef hash omelette and it was outstanding. Service was fantastic, friendly and timely.
It's a small place so I'm guessing there will be a wait on weekends but it's worth waiting for."}
{"text":"This place is AMAZING! I had the Southside, it came with eggs, toast, hash browns, and my choice of meat (I went with the Gyro meat for $1 extra). My boyfriend had the pancakes. He went a little off menu and combined two toppings that weren't listed together, but they were more than happy to accommodate. The gyro meat is on a spit cooking fresh like it should be and the pancakes are so tasty! We paid $20 total, with drinks, tax and tip! This place is definitely a hidden gem, and if you're in the area you should most definitely check it out."}
{"text":"We have frequented this diner quite a bit during our visits to Parma when visiting family. We were happy to find out that Southside was open on the Fourth of July, when most places were closed, they were open. While the waitstaff wasn't too happy about it, we were! While Southside Diner offers lunch options, this diner is really known for it's breakfast options. The day that we dined there I ordered the Parma omelette (with corned beef and cheese). It really hit the spot and can't wait to come back to eat at Southside the next time we are in Parma!"}
{"text":"Decent diner; clean, 50's type decor, good service. Had breakfast-eggs, sausage links, home fries, and rye toast."}
{"text":"Absolutely fantastic place. Super menu,hilarious staff and awesome prices.  Highly recommend."}
{"text":"I love this place! Favorite breakfast spot in Cleveland. Everything they have is delicious, great coffee, good prices, and a very friendly staff. I don't think I've been to a diner in Cleveland that I like more."}
{"text":"Nice little diner. This is one of those little places that timing counts to be able to find a seat.  But the food is worth it: great taste and easy on the wallet.  My son was super excited to get his Mickey pancake with bacon.  And I was super excited to get crispy cooked hash browns since most diners struggle with that.  My bagel sandwich was tasty too."}
{"text":"Still the best service in the area and great food. Had the best turkey bacon I've ever had, seriously, the best. Get it, you'll love it. You should also get the blueberry muffin french toast, the Athenian breakfast, the corned beef & eggs, the corned beef hash omelette, the Clevelander, and the list just goes on and on and on."}
{"text":"Very small & generally busy, this diner is a unique experience in the Northeast Ohio area. The staff is attentive and the restaurant is pristine clean & very well decorated. The food is always great-- and although most people order breakfast, their lunch menu is amazing. Great gyros and hot dogs! They're only open till 3pm but I would recommend trying it out!"}
{"text":"Boy was I stupid to get my breakfast to go the cornedbeef hash is so spicy I can't eat it and the animal must of gotten up and ran b/c it's more potato than beef!"}
{"text":"This was a wonderful experience. The waitress was so great and helpful. She was really able to give us advice on the menu. Wide selection of food for reasonable prices.  I had the breakfast tacos which were very good. Even though I am not a fan of pineapple on food, it was a tasty addition to the tacos. The home fries were very good, but I would tell them to cook the potatoes well done. I shared a full stack of pancakes which I thought were very good and very large. My mom got the Maple Leaf omelette, she really enjoyed it. This is a great location to get a sit down quick meal. Definitely will be back!"}
{"text":"This place had great food and quality service. I ordered the breakfast burrito, which is smothered in their country gravy. Delicious! I also ordered a short stack French toast, which were okay, but nothing spectacular about them. The waitress who served me was friendly and inviting. She apologized 3 times for the wait on my food, as 2 people who ordered after me received their food before me. I actually thought nothing of it but she briefly explained the breakfast burrito takes a bit longer. 

The reason this place gets 3 stars is there was a mechanic guy working on the refrigerator in the kitchen (which was close to the grill where the food was being cooked). I saw all of this because I sat at the bar, where you can see the cook make your food and the rest of the kitchen area. The mechanic had on dirty clothing, with filthy hands and it was just a sight that turned me off."}
{"text":"Unexpected find near airport hotels.  Read reviews and decided to try it. Not disappointed.  Great omelette.  Waitress was funny and personable.  Quick service but food is cooked to order and delicious."}
{"text":"Love, love, love this little diner.  We come here often for breakfast because the food is great, and the price is right.  We also try to patronize the neighborhood places versus the large chains.  Service is always good too!"}
{"text":"Great food finally somebody knows what over medium means. Big portions good prices great flavor"}
{"text":"Food was amazing!! Service was so-so. It was pretty dead when we went and the waitress was more interested with the people sitting at the counter than the rest of the tables. Looked like a few people came in and got to go orders so maybe we'll look into that. We will be back and I would recommend this place."}
{"text":"Pretty clean dining area, quality food in huge portions, solid service.  The value is where it should be, lots of good food for a reasonable price.  It's not the cheapest breakfast in town, but it doesn't taste like that either.  The only thing I didn't really like was the dining area layout.  It was pretty tight and not easy to move around without bumping into a table or someone else's chair.  I'm sure all the winter coats on chairs made it seem worse.  Nice place, if I'm in the hood, I'll be back."}
{"text":"Hands down some of the best breakfast in Cleveland, they are always creating new combinations of great breakfast flavors and always have something unique on their specials menu let alone their entire menu. The service was on point as well with their family friendly vibe and their generous coffee pouring. All around favorite!"}
{"text":"My favorite hole in the wall in North East Ohio! Whether I am getting my first meal after a night of drinking or having family in from out of town this is the spot I think when I think breakfast. The portions are huge, the menu is unique, and the food always has that homemade taste. As I live near by the line is always out the door when you drive by. Even getting take out was not disappointed by the quality of the food."}
{"text":"Great diner with awesome service...friendly waitress can set the tone and she did.  Corned Beef Hash super crispy which is often missed with other places only problem the corn beef was so small and shredded it was almost unidentifiable, taste profile, spice, onion & green pepper were spot on and a complement not an overstatement.  A great place for breakfast, if I'm ever back in town I'll stop in for lunch."}
{"text":"Nice little place. How small it is, is what makes it quaint and comfortable. There are not many places like this in Akron that are CLEAN, so I really enjoyed this place. Nice vibe and good service. Even when super busy there was one waitress and she had it down. Good, hot food. Just your basics but you know your getting what you pay for. Cheap too. Very nice place."}
{"text":"I love the home make corn beef!!! It is the best in town. I have visit there a couple of time just for the corn beef"}
{"text":"eh, the service i received from here completely blew my whole idea on this place. But ill attempt to give it a decent non-biased review... we were there during prime breakfast time, it was packed. we were seated quite quickly despite the crowd, and our waitress must have had her panties in a bunch because she was beyond unfriendly. We ordered a simple omelet, some pancakes, and it all tasted very (ihop)ish. nothing spectacular, our plates were practically thrown at us, our coffee came warm (not even mildly hot), and we were never offered refills. Honestly i was probably better off going to dennys for the same quality of food."}
{"text":"Stopped by for breakfast before heading home on a Sunday. The place can only sit around 20 people, there are some seats at the counter in true diner style.
Unfortunately, the decor is about the only good thing about this restaurant. The food was less than par. My bacon and cheese omelette left a lot to be desired. The bacon was on one side of the omelette and the cheese was on the other. Both the eggs and home fries were very dry. I asked for the hash browns to be well done, but that did not happen. 
My nephew ordered a bagel sandwich with sausage. He enjoyed the hash browns but was not impressed with the sandwich.
Even the OJ didn't taste like a quality OJ. Perhaps if your taste buds never experienced breakfast food other than here you wouldn't have anything to compare this too. I, however, have. Even the channel on the TV was to some odd station.
This is not a place I would recommend.
Ok, so my family is razzin on me because the waitress was good. So, I changed my rating to 2 stars from only 1."}
{"text":"We stopped in on our way out of town (because of the good reviews).  Quaint and charming place with a reasonable wait for our table (10 min).  We both ordered the Western omelet with Italian toast.  Food was excellent, wait staff was sweet.  Will definitely return next time we're in CLE."}
{"text":"Southside is one of the best breakfast places in which I've ever had the pleasure of dining.  Seriously, this stuff is just plain good.

A note: when you first walk in, you might have second thoughts.  It'll look like a typical, run-down, greasy-spoon, but it's really not.  The food is made from high-quality ingredients, it's fresh, and some if it is quite unique.

My personal favorite is the Chicken and waffles (with a maple, sriracha glaze/topping).  A very close second is pretty much anything with corned beef hash in it (and I don't even like corned beef that much).  

You can't go wrong!  Also, the specials are generally quite good (and often inventive).  Give it a chance, and you won't be disappointed.

(I'm told the coffee isn't the best, but I don't really drink coffee, so take that with a grain of salt.)"}
{"text":"Saw the great comments for the Southside Diner on Yelp so we gave it a try. The reviews were right about the service and food. They were both good and so was the coffee. I always follow the rule you get what you pay for. In this case at Southside Diner thats not always true. My wife ordered eggs and sausage biscuits, delicious and plenty of food served hot and delicious. I got the $9.99 corned beef and eggs. To be honest I thought I got punked by Southside Diner.  I looked at the chef and the waitress waiting for them to say we got you here's the rest of your corned beef. No, this was the portion they serve. It was two ounces of thinly sliced waterlogged corned beef.  What a shame. Not even close to a fair value. Huge profits on this dish. Send the chef to Slyman's and have him order corned beef and eggs."}
{"text":"Very friendly staff. The whole place was clean. I ordered the breakfast burrito and it was huge. In my opinion there was a little too much gravy, but it still was very good. I would definitely come back to try some other options, if I lived in the area."}
{"text":"One of THE best breakfast and lunch places in Cleveland! Food is amazing. Service is great and the atmosphere is cozy and friendly. A must TRY! Trust me!"}
{"text":"Such a cute little diner! All the staff are so friendly. Breakfast is delicious and served fresh and quick.  The menu has a large selection and not just your typical \"diner food.\"  If you order coffee they make sure your cup is always full. It's a small place so it is not good for a large group but it's great if you have 4 people or less."}
{"text":"This place makes delicious food and the service is great. Probably my favorite place to get breakfast in Parma. They do great hashes and have some other interesting options like breakfast tacos!"}
{"text":"I went to this place basically on a whim and it seriously paid off! Service was fast and friendly. I told the waitress that I'm a vegetarian (she asked if I like corned beef) and she mentioned a florentine eggs Benedict, which I ended up having. It was DELICIOUS. Those caps are necessary. They added mushrooms and onions (their suggestion- great call) for me and took off the Canadian bacon without issue. The hollandaise sauce was perfection. I can't wait to discover what other great items they have on their menu! 
The diner itself is pretty small, with a counter and around 10-12 tables. At first I thought I might feel awkward not being a regular, but the waitress was very kind and I realized I was worried over nothing. Will absolutely be going back :)"}
{"text":"Awesome little place! Husband and I were looking for a new place to try and found this little gem. We went for lunch. He got a burger and said it was the best basic/straightforward burger (no crazy interesting toppings) he's ever had. I got the Clevelander sandwich and some soup and both were great. We loved the charming and old-fashioned look and the small and intimate feel to the place. We want to go back and try some breakfast next time!"}
{"text":"Stopped in on a Sunday morning for breakfast. Looks like a small 50s style diner. Sat at the \"bar\" area up front. Food was outstanding. Everything is cooked up front so you can see the cooks at work. There was even a woman peeling fresh potatoes in the kitchen. If you want home cooked food at a reasonable price this is the place.  Don't come with a large group if you don't want to wait because place is relatively small."}
{"text":"Best for local 

Menu was diverse enough for any palette. Husband and I always split meals - usually savory and sweet. He got the Nutella and pb French toast. And I got the Greek omelet. 

Perfect portions. Went home stuffed and needing a nap"}
{"text":"Well after ready some reviews on Yelp a friend and I went there. It is a very small place but brightly lite and a fun diner style. It was early Monday afternoon but after the lunch time hour so it wasn't busy. We both ended up having breakfast and were pleased with what we ordered. We do like to find new places for breakfast! The waitress was very nice and helped us with any questions we had. I had the basics, eggs, sausage, hash-browns with/onions and rye toast. All great. My friend who is an older senior then me went all out with the dish with french toast and then also ordered the hash-brown w/onions as an extra. She did have to take some of it home though. We will for sure go back to try some of there more adventurous offerings."}
{"text":"this place is a solid 3.5 stars. 4 for the decor, 3 for the food.

i swear sometimes i think i'm white. i'm actually asian but bc the majority of my colleagues, coworkers, friends, etc are white, sometimes i don't feel very asian.

but then i walk in a place like this, and i instantly feel very self conscious of being a bit out of place.
this place is all american.
people were clearly looking at me.
well, what're ya gonna do?
smile and enjoy a good breakfast of course.

despite that, i will be back when i'm in the area for their special. some sort of potato pancake that sounds pretty good."}
{"text":"What an impressive little place! Definitely don't judge a book by its cover when you visit. I'm a big eggs Benedict fan, as is my boyfriend and the bacon avocado eggs Benedict was so tasty and very filling. 
Service was very friendly and it seemed like we no sooner put in our order and we had our food. I've already recommended many friends and co-workers alike to check it out."}
{"text":"Great tasting corned beef hash and chicken and waffles! I came here because of the ratings on Yelp and was not disappointed!!!"}
{"text":"As a visitor from out of town, We needed a decent breakfast place after landing. We went here based on others reviews and have to say everyone was right! The food was excellent, huge portions, great service. Sunday the place was packed in spite of our early arrival and a line coming through the door was constant. Yes, we'd go again!!"}
{"text":"Came here a few weeks ago for brunch.  Our waitress was very nice and attentive. The coffee did taste a bit odd like other reviewers have said.  I ordered the veggie omelet(3.5/5) with hash browns (3/5).  I also ordered an order of Chicken and Waffles which I thought was pretty good (4/5) and this was the favorite thing I had tried there this day.  I would go back again to try a few more things on the menu.  If you have t been here I would definitely recommend checking it out.  It is a great local diner with the small neighborhood feel."}
{"text":"In the Cleveland area for a wedding so we figured we'd try out one of the better reviewed diners in the area. When we arrived there was a wait but we didn't wait that long since there were two of us. Most of the seats are for two people so you may be seated before others if there are only two of you. Staff is friendly and attentive so that was great. We ordered the Greek omelette and the Alpine omelette along with a side of pancakes. The food overall was decent. The Greek omelette was good but the Alpine was a bit tasteless and too eggy. The home fries were ok, I had to drench mine in hot sauce. The banana walnut pancakes were very good but for $7 and getting only three it was a little overpriced. Lastly, food took between 20-25 mins to arrive from the time we ordered, a bit long for us. Wouldn't come back if there's a wait but otherwise pretty good."}
{"text":"This place was great. I had the country fried steak and egg dish. The steal had a sausage gravy on it which was fantastic. It had a slight spice to it and overall creamy.

Substitute something else for the homefries/hash browns. They are not too great.  Service was really good too, they filled my coffee 6 times in about 45 minutes."}
{"text":"This place is one of the reasons I haven't completely lost faith in humanity. No, really, I'm not delving into hyperbole here, I mean it. I know it's just a diner, but somehow it manages it be more than that. It's a tiny little piece of what's right in this world. It's a safe haven from road rage, from inconsiderate people, from overpopulation, from all that makes you want to pull a Falling Down on the world.

It's in Parma and it's not to be confused with Southside in Tremont. Hell, they couldn't be at more polar opposite ends of the spectrum on nearly every possible metric. The actual restaurant is quite small, seating somewhere around 30 people, and features a small counter that overlooks the flattop grill that, I'm quite sure, is never without activity.

At its very soul, Southside Diner is all-American. By this I mean their menu is not only full of burgers and melts but dishes that speak to the immigrant history of Cleveland and its suburbs - hot corned beef, gyros, potato pancakes. But what brought us into Southside Diner for the first time was breakfast, and, judging from most of the other Yelpers, the same reason for their visits as well.

I love the smell of a diner. That baked in, historic odor that's a combination of coffee, grease, and bacon. It used to be that there was cigarette smoke mixed in there and I can be honest here, I miss it. I can still remember going with my dad to a diner called The Hutch in Elyria, table-top Galaga and that smell. It's embedded into my brain.

The breakfast menu here reads like a who's who of the sunrise dining crowd - corned beef hash, steak & eggs, biscuits and gravy - they're all here. Strangely absent, pancakes. That's right, I couldn't find 'em on the menu anywhere. Oh well, no matter. Plenty of other goodies from which to choose.

The bagel sandwich, a tasty combination of soft, whitebread bagel, American cheese, and a perfectly cooked scrambled egg wrapped around three strips of peppered bacon like a toddler's woobie. Served alongside some of the best griddled home fries I've had. You know the kind, bits of crispy crunch interspersed with soft, slightly oily bits of potato. My other half ordered the three-egg breakfast, same deal. It was all prepared textbook clean. And because the bacon was so good I'll mention it again. The bacon is thick-cut, heavily peppered and so good a pig would eat it.

We shared one of their specials - cinnamon crumb cake French toast - and it would be the reason for that grayed-out star up there. Made from a large coffee cake muffin sliced into 3, dipped in egg, griddled and served dusted with powdered sugar. Tasty but the execution just fell short. The egg had barely penetrated the muffin leaving it just a bit dry. If they had left it to soak longer, if only.

The service was exactly what you'd want. It was friendly, honest, blue collar and exactly what's missing from nearly every other eating establishment in the state. Our coffees were always topped off, our empty plates removed when necessary, and all done without feeling intrusive. It felt like we were being served by family.

Places like Southside Diner are part of the American landscape for a reason. They're a vital organ to the system of our country. Sure, we could probably survive without them, kept alive by the predictable pumping of chain stores and cookie-cutter drive-throughs, but our quality of life would suffer. Diners like Southside need, no, have to stay around. Do your part as an American and support Southside Diner and places like it. Without us, the machine will win and you'll be stepping over their bleached bones on your way to McDonald's."}
{"text":"Busy place on a weekend! Be prepared to wait at least 5-10 minutes for a table. 

The one thing in which I was not the biggest fan of was the service and lack of attentiveness we received from our server. After our food was delivered, she didn't not come back to see if we needed anything else or even how the food tasted. I understand that it was a busy shift and she had multiple tables to take care of, but the service we had was very poor. Aside from the service, our food was cheap and not bad tasting."}
{"text":"It might not look like much from the outside, and it's a small place inside, but the taste on a plate is so fantastic, a review was a must. I've never been disappointed and the specials are very New York, especially by Cleveland standards. It's high end food in Parma!! You can get anything from basics like French Toast to poached eggs on English muffins with fresh avocado and hollandaise sauce. This Diner is a true Gem."}
{"text":"I love a good diner for breakfast and this place nailed it!  Classic diner style inside with license plates on the walls, an open grill and bar stools for quick service.

I ordered their corned beef which they make from scratch. 

Our server was pleasant and very attentive.  Kept my coffee nice and warm."}
{"text":"Stopped into Southside Diner for breakfast this morning and it didn't disappoint. It's a cute little place with the nicest employees. We were happy to see them staying busy on a Wednesday morning! I had the breakfast tacos and let me tell you... you HAVE to get them. They come with home fries and I'll tell you a little trick -- let the juices from your taco drip onto the home fries as you eat them and it'll make them extra tasty."}
{"text":"Read the reviews here and decided to give it a try since we were visiting in town and wanted to go somewhere local for breakfast. The seating here is limited, and the line to get in gets long. Lucky, when we got there, we only had to wait a couple of minutes to be seated. The food was pretty good. I had a simple breakfast of scrambled eggs, bacon, and cornbeef hash (most be a stapled item in the Cleveland area)."}
{"text":"The little Main Street diner seen in a million movies and TV shows. Food is amazing, the folks behind the counter even more so. Whenever I debate moving away from Cleveland again, this place is always in the \"Pros Column\" on why to stay."}
{"text":"Absolutely love this place. Staff is always friendly and food is always spot on. The waffles are huge! If you order one you better plan to be hungry. Also their Gyro omelet is super delicious. Lately I have been getting the Benedict special they have and have never had a bad order.  Definitely check this place out. Its first come first serve and is small but totally worth it!"}
{"text":"I had a hard time choosing but ultimately chose the homemade corned beef hash and eggs. It was awesome. It's a very small place, but they move quickly. Servers are nice and friendly. I definitely will be back to sample other items on the menu."}
{"text":"A nice diner out the way in parma just past the  tri-c campus i always get the hillbilly Benedict witch is always good its a busy diner even early in the morning but definitely get a good breakfast at this place and the service is awesome but the cutomers everytime i walkin have a look they have attitudes the place is great and their food but the customers are the only thing i dont like about the place"}
{"text":"Great food!  Great service from Toni. The place is a cute little find. Bacon is great. So is the corned beef hash."}
{"text":"Delicious & cheap local diner!! We love this little hole in the wall. Highly recommend!!"}
{"text":"The bacon avocado eggs Benedict is to die for ! The staff was friend and helpful, the decor was 1950s."}
{"text":"Just experienced the barbacoa hash with poached eggs. Well worth the sunday drive from lakewood for breakfast!!! Cant wait to return to this classic diner setting that offers bistro quality food."}
{"text":"Small cramped diner but SO GOOD! Amazing service and food. Highly recommend the breakfast! Banana Muffin French Toast special was DELICIOUS!!!"}
{"text":"I grew up here and this is by far the best breakfast spot in the Cleveland area. I always got the Benedict Florentine which sometimes isn't always on the menu but they still make it every time regardless. So delicious!!! Staff is so friendly, so if you haven't gone yet you're missing out!!"}
{"text":"I stopped in this place for breakfast one morning. Portions are huge, hot and well done. Service is also excellent and the prices aren't bad either."}
{"text":"First thing i noticed about this place for a small Diner was that the menu was very clean and updated server was very prompt and polite ordered the Athenian breakfast quality very good proportion size was a little small overall a nice place though"}
{"text":"The absolute best breakfast in town! The corn beef hash is incredible so I always end up ordering breakfast with that as part of it, but there are so many others dishes I want to try! I just love the hash so much. Great coffee, too! They grind the beans before each pot is brewed. The servers are friendly and quick. The only drawback is that is is small place so it can be tough to get in on a weekend morning. You won't be disappointed! I find it hard to go anywhere else for breakfast now! They serve what looks to be amazing lunch dishes, too, but I have yet to try them...again bc the breakfast is so hard to pass up!"}
{"text":"Simply the best brunch spot in the Parma area. Simple yet oh so delicious. It's NOT your typical cheap breakfast place. It's a must try. On the downside the popularity of this place has been rough on the wait times. Perhaps they should start expanding. They'd make a killing. I would go there more if that wasn't an issue"}
{"text":"Hidden gem in Parma. Great food, definitely coming back for the Chicken & Waffles. The homemade corned beef hash is worth the trip as well."}
{"text":"Great place! It's little with little parking, but the food has big taste. I've been here several times, but just for breakfast. Every time I got eggs over easy, bacon well done and rye toast. Very good and very consistent. I really like the old-school diner atmosphere too."}
{"text":"Having discovered this restaurant on Yelp, we were super excited to try out a new Sunday brunch location. With that, I'm super happy to say I'll definitely be coming back. With extremely friendly service, the Southside Diner was very time efficient and served interesting and delectable meals. The daily specials were also very well thought out and proved to be a welcome addition to the table. Can't wait to go back!"}
{"text":"Best breakfast food in the Parma and surrounding area. Have never had a bad meal. French toast is my favorite, but all their stuff is fantastic. Order the breakfast wraps to go quite a bit and they hold up really well.  this place!!"}
{"text":"I love Southside! The breakfasts are fresh and taste like a true home cooked meal. The atmosphere is adorable and it's a quaint, happy little place! The servers are sweet, and it's an awesome little breakfast date place! I definitely suggest it. Their omelettes are filling and so so delicious. Also, hashbrowns = yum."}
{"text":"Delicious, above-par diner food! Kinda inventive menu too- nothing fancy, but not just the 'two eggs and bacon' thing either. That, the friendly service and the pretty great (and magicly always full) classic diner-coffee made our visit extra enjoyable. Recomended!"}
{"text":"I have never been here and came because of the reviews. It is absolutely amazing! My server was probably the nicest server I've ever had. So personable. The food is inexpensive, but it doesn't reflect in the food...It is absolutely amazing. Pancakes, homefries, toast, bacon...absolutely the best. You have a new regular. Thanks for everything :-)"}
{"text":"Great experience! My sister and I searched for \"breakfast\" near Brunswick and we came across this gem. There is a reason they are rated so highly; they do diner food extremely well. I struggled between ordering the corned beef hash and the mexical omelette. However, on the advice of our waitress I went with the barbacoa hash, it did not disappoint. Friendly and knowledgable staff, along with a high of level of cleanliness. We will be back very soon!"}
{"text":"After seeing the multiple 4 & 5 start reviews, I thought I'd give this place a shot. I knew to expect a small dive-diner, but what the hell, sometimes those greasy spoons are the best places. Southside, however, is not one of those. 

It's dirty. Dirty. Not \"divey.\" I mean it's dirty. 

The service was friendly enough. The food was nothing to write home about. 

I ordered the Kitchen Sink. It's scrambled eggs with bacon, sausage, onion, tomatoes, maybe green peppers... on a bed of home fries. It was OK. My friend ordered the standard 2 eggs, 2 bacon, 2 sausage with French Toast. She couldn't get past the stone cold sausage to really rate anything further. I checked out the sausage, just to be sure. No exaggeration; stone cold. Of course from my vantage point sitting at the counter with a view of the \"kitchen,\" I could clearly see why. The flat top is so small that they cook all the bacon and sausage then leave it on the side until needed to fill an order. 

I suppose, as far as the food goes, they're doing what they can given the size of the kitchen, but trust me when I tell you that it's nothing special. I also realize that judging from the line to get in, I'm in the minority as far as how I feel about the place. With that said though, it's a never again for me."}
{"text":"Very wonderful local community place to eat breakfast. We hunted it down on a snowy Friday morning.  The beef hash was superior to any my Aunt had eaten. The eggs , potatoes and bacon were great. 

Service and clientele were friendly to out of towers. (Ocean City,MD and Wormleysburg,PA)

Thanks for the old fashion tick bacon!"}
{"text":"I'm obsessed with breakfast here. When you go, always get one of the specials, they are fantastic! Portions are good as are the prices. Typical dinner coffee, and you never see the bottom of your mug. The service is always good,v the servers are cute and friendly. The place is small so if you go on a weekend expect s sorry effort for a table. Old fashioned decor is cute too. Great little dinner experience.

The only thing I would change are the televisions, I don't really like TV's in places that are meant for good conversations over coffee, but that is just my personal preference :)"}
{"text":"Corned beef and eggs and hash browns all perfectly cooked great food clean and great service."}
{"text":"From the outside you wouldn't expect this place to be fancy, and the packed parking lot and diner lets you know that it doesn't want to be. It's a great place to come and relax with family and friends while enjoying some delicious food. I got the gyro melt with pepper jack cheese and it was delicious. The corned beef hash \"side\" was a meal itself (explains the price). The open kitchen shows how efficiently the owner/chef manages it bringing out quality meals in record times.  If you haven't been, make sure you try it. While it's a drive from any freeway, it's well worth it."}
{"text":"Now that's what I call a breakfast! The egg white Greek omelet I had was great. Had a bite of their corn beef hash and it was also good. If you're in the area and looking for a quick bite to eat, I would recommend this diner"}
{"text":"Yummy breakfast spot! My family enjoys this place often. The food is good, it is just very tiny... So if there are no seats available, you have no choice but to watch people eat their food while you wait. Love their pancakes and the service is usually pretty quick. You can watch them make your breakfast if you sit at the counter, which includes watching them carve the gyro meat! If you stop back for lunch their gyros and Rubens are pretty tasty. 

Only other downside are the hours. Only open until 3, so this is really just a weekend spot for us!"}
{"text":"Came here for Breakfast the other day after seeing the great reviews on Yelp.  Not a lot of seating in this place, so I imagine when it's busy it must be pretty crowded. It was a pretty full house when we arrived, but we snagged the last two seats at the counter.  Our server was friendly, and we were right next to the kitchen.  It feels a little messy/dirty in this place, but you watch the cooks make your food.  Our breakfast was yummy.  The bacon was a bit undercooked, but the sausage was yummy.  Pretty cheap prices as well.  While the food was good, I didn't feel that is was all that special...how hard is it to make good eggs and pancakes??? We left full and happy!"}
{"text":"My husband and I recently moved to North Royalton  and have been trying to find some restaurants to take the place of our old regular go-tos. We love to go out to breakfast Sunday morning so I looked on Yelp for breakfast near me. I was floored by all the great reviews for Southside diner. We went in and got the 3 egg breakfast and a waffle to go. While we were waiting for our food it was nice to see how friendly everyone was. Such a nice family restaurant atmosphere in there. We ate our breakfast in our apartment watching the browns game and at least the food was great!! We will definitely be back, they got a great looking menu!!!"}
{"text":"Our first trip to this diner. The service was great. Didn't have to ask for coffee refills and very friendly. Food was good especially the sausage patties. They have a full plus menu. They have it all. Got out of there for less than $25 for two..."}
{"text":"Best kept secret in Cleveland. It's a little tight, which might lead to some waiting for a table, but just wait until you have the food. Everything I've had there is fantastic, the specials are creative and always changing. Best breakfast spot around."}
{"text":"Went for breakfast, kinda pricey but good quality and big portions. Will be back for lunch"}
{"text":"Very nice breakfast place. Everything is made fresh, I actually saw theme restocking in the morning with fresh groceries. Waiters are all nice, and food is really good. Reasonably priced."}
{"text":"Great brunch spot! Wife and I split the Gyro Benedict and the Barbacoa Hash. Both were very delicious and full of flavor.  I would give a slight edge to the barbacoa Benedict for the delicious melty cheese. 

Coffee was fresh ground def much better than average. 

Service spot on. 

Expect to spend $15/person. 

We will return."}
{"text":"John Paul came to our table to meet us due to being out of towners. Very nice.  Clean place.  The specials are mouthwatering. I choose the chicken pepper hash and my husband had the Irish Benedict.  

Fantastic. We will be back tomorrow before we leave town."}
{"text":"I woke up on Sunday morning craving some good breakfast food, and after a quick search on yelp, it was an easy decision. I went around 11:30 and took a seat by myself at the counter. I took the advice from another review and got one of the specials - I picked the bacon avocado eggs benedict and it was absolutely amazing! My food came out quickly (so it's great if you're dining solo) and my coffee stayed full and hot. I will definitely be back to try another special!"}
{"text":"I have a thing for diners these days.  And this one did not fall short of any expectations.  Small yet cute inside and of course, besides some tables you have that quintessential stools at the counter.

Super friendly. Not a little friendly, SUPER friendly happy cheerful waitress. If your feeling blue, come here, you'll cheer up for sure.

Coffee = good and she keeps it coming on queue

Bagel sandwich - I added a little salt/pepper and it was perfect. It came with breakfast potatoes which were good, I had her add grilled onion & peppers to them then I put just a tad of ketchup mixed w/some hot sauce - yuuuuuuuuuuummmmmmm

My friend got the special which was barbacoa hash.  The waitress kept saying how good it was. She said it was the perfect seasoned beef (not pork, don't think chipotle)... When it arrived at the table, I tried a bite- omg, I wished I had ordered that instead. I mean, nothing wrong with the bagel sandwich, but good Lord she was not lying when she said it was perfectly seasoned beef! And tender too!!  And you get quite a bit, my friend ate half and took half home. 

So, needless to say, I look forward to my next time back."}
{"text":"Food was delicious. 
The place is very small. 
Staff was friendly. 

My only complaint was the coffee. It had a very weird flavor to it. I asked if it was flavored and was told no - I couldn't drink it and I'm a HUGE coffee drinker/lover"}
{"text":"Great service, HUGE portions! Its a diner where you may wait 15 minutes on a Saturday or Sunday morning but you wont be disappointed!"}
{"text":"Our waitress was the sweetest person to wait on us while in town!  Incredible breakfast, as good or better than some of the brunch spots we visited downtown, and half the price!"}
{"text":"Possibly the best breakfast place in Cleveland area hand down. If you have not been here then i don't know what you are doing with your life."}
{"text":"When in Cleveland you have to eat latke and corned beef right? We stumbled upon the south side diner and shared the corned beef ruben with potato latkes and a gyro. Their sign did suggest they have the best corned beef and Gyro. I was delighted by the taste of my sandwich and my better half enjoyed his gyro. Both the sandwich and gyro were piled high with meat. Thanks Cleveland for some great food!!"}
{"text":"Whatever is the hash special of the day- get it.  Braised short rib hash here once- braised short ribs- at a diner!  The rest of the menu is diner fare- good and fresh.  No issues with food or prices!"}
{"text":"Great family diner with great atmosphere. The restaurant is small so you may have to wait a little while to be seated. I've been here a few times and each time the food has been amazing. The staff is always friendly and attentive. Southside Diner features different specials that are not on the menu for those that are adventurous. Each time that I've visited I've tried one the specials and have been very satisfied. My last visit I went with my parents and they loved the experience and food. My mom kept saying her burger was one of the best burgers she's had at a restaurant. I highly recommend Southside Diner."}
{"text":"I was on my way to South Haven on I-80 and needed gas and some breakfast. Unfortunately, the rest areas did not have anything appealing, so I checked out Yelp and came across Southside. A little off the beaten path, but it was exactly what I needed. Good food and good coffee in a clean place with friendly service is this place in a nutshell. We were served by Toni, a very polite young lady with a great smile. In fact, all of the staff were great. Stop in and say hello for us!"}
{"text":"Very traditional with size and type of food. One of the best gyros in Cleveland! Can't say the same about the corn beef.  I mean it was good but it wasn't best I've bad. Prices were great  and would go again."}
{"text":"Great breakfast fares. Took the family there on a Sunday. Even though it's crammed for space, we were, six of us, seated together and the food was very good. Pancakes were fluffy and the hash was crusty and brown the way I prefer mine."}
{"text":"Didn't have to wait in a 40 minute line to get juicy and flaky corned beef sandwich for St. Pat's; they were delicious!  I think they are open a little later for that day.  Their breakfasts are big and very good, love their corned beef hash breakfast.  A few dishes (imho) are a tiny bit pricey for breakfast fare, but worth it in terms of quality and good taste.   All their combos are very good, (but i could not find a simple 2 eggs, bacon and toast combo)?  Only other few criticism (and everyone has different preference) I like hash browns that are shredded their hash browns are more like potato slices but still very good. Coffee could be a little hotter and maybe sweep floor when slow.  We love the fact it is not a chain place. It's nice to walk into a small diner these days and smell a well seasoned grill with real food cooking on it; not some microwave door being slammed. Overall, we like very, very much and been coming for while now.  Easy to drive by and miss this place, they should get a bigger sign."}
{"text":"The fiancé and myself wanted a good brunch so we typed it in and Southside was one of the better rated places to eat so we took a chance... and wow did it pay off. We shared the corned beef hash, farmer's omelet, and the nutella and peanut butter french toast. Everything was fresh and amazing. The staff was super friendly but that didnt take away from the real all star... the food! 

Overall a very enjoyable experience and its just down the road from us. We will be returning. And often at that!"}
{"text":"This restaurant is by far my favorite one. Everything I've ever gotten off the menu was amazing. Waitresses were very polite and helpful and the wait for the food was nothing. Highly recommend this place to anyone looking for a great breakfast or an awesome lunch!!! Love recommending this place to friends :)"}
{"text":"Amazing food... huge portions..... very nice waitress......only reason not a 5 was the restroom... needs cleaned this century sometime."}
{"text":"Food was good, price was ok, but the place needs to be cleaned a little better, the floors looked like they hadn't been cleaned in awhile."}
{"text":"Before heading down to southern Ohio for Labor Day weekend, my dude and I decided to head out to this place he had been to before for good diner food.  We got there just in the knick of time, because right after we were seated, there was a line almost out the door to be seated.

It was a very tight maze getting to our booth in the corner by the window of this diner.

Aside from feeling super cramped, the service was great, and the food was even better. I ordered the chorizo wrap with salsa, cheese and sour cream, while my better half got the chicken and waffles. 

They put this special sugary syrup on the waffles. It's not maple syrup, but almost like a sticky icing. It's to die for, and pairs so well with the savory chicken chunks. We also added a sunny side up egg to the dish, because of course, eggs should be on everything.

We left the diner with a bill of around $20, adding coffee and a tip to the bill. Not a bad fee for good service and good food."}
{"text":"The best diner I've ever been too. It's a staple place to eat in our family. You can taste the love in the food."}
{"text":"This was such a nice place to grab brunch with a friend!  The food was delicious, as good as everyone has advertised.  I got the Mexicali wrap which was smaller than the menu picture made it seem, but still very delicious and completely filling.  The chorizo was so tasty and savory with perfectly melted cheese.  My friend got the cheeseburger hash off of the daily special board and it looked amazing as well. It didn't look like a large amount of food but the portion was the perfect size for a filing meal.  This is definitely a place to check out if you're in search of a good diner."}
{"text":"This place is really cool. I've driven past it hundreds of times and actually never noticed it until I wanted to find it. The inside is like an old-timey diner, with license plates from every state hanging on the walls  and really limited seating. We were fortunate to come by on a Sunday at 1130 and were seated right away. 

I was impressed with the menu! I decided to go with the peanut butter and Nutella pancakes. They were sweet and delicious and just what I was looking for that morning. Yummm. I love a good, quality serving of pancakes on a Sunday and this place nailed it. The only reason I am not giving this place 5 stars was for the service. They acted like we were just another inconvenience coming by on a Sunday. Awkward. However, we will definitely come back for the food and in the hopes everyone was super busy the first time we visited!"}
{"text":"SOUTHSIDE DINER people.If you live in Parma/Independance/7 hills area,you have to go there.That was the best biscuits and gravy I have had since I was little.They make the biscuits there,and I swear they smoke their own bacon.I was there once before and the chicken salad sandwich was crazy good.And I watched the guy at the table next to Me order the gyro..then order a side of gyro meat 3 SEPERATE TIMES.And the kid next to Me's blueberry pancakes smelled and looked so good..I was actually jealous!Everything was fresh.They are only open till 3 though,it's this little hole in the wall place,you would never even notice it.I will be going there wayy more.Not one place I have been to has better breakfast.I eat out all the time,and I am a hungry motherfucker."}
{"text":"Great hole in the wall style diner, this is a fave for Saturday breakfasts.Everything is seriously great here, made fresh, nothing frozen! The bacon is awesome, nice and thick not that weak thin crap. The owner buys alot of his stuff from the Westside Market. Cornbeef hash is wonderful,Southside Stacker, potato pancakes, cornbeef ruebens that are better than Slymans ( yes I said it!) . On a weekend there may be a bit of a wait because they are small and popular, but it is SO worth it!"}
{"text":"Best breakfast in Cleveland! Anything you order is amazing, especially the corned beef hash and the breakfast taco! The service is wonderful and super friendly :)"}
{"text":"Brother and friend suggested this place for breakfast! This is by far the best breakfast joint I've been to in Parma! It's so delicious!!! This place sure gets busy and sometimes you have to wait to get seated but it is totally worth it!!

I would have to say that I am satisfied with the service and food!  Service was fast and very attentive! Every single one of these staff members are super friendly and willing to answer any questions you may have.  The owner is definitely very outgoing and hard working for he has been there every time I visit.  

The Eggs Benedict Florentine is so delicious!! All of the ingredients are frech and the hollandaise sauce is legit!  Majority of the places I've been to in Parma claim their hollandaise sauce is delicious but it just tastes like chicken broth thickened by flour which is definitely disappointing! But this place.. they make everything right after you order! The presentation is beautiful just like the flavor of this dish.

I have also tried their gyro which is definitely delicious and feeling.  The gyro is just like any gyro but they toss the lamb in the sauce so the taste is consistent with every bite.  The only thing that is different from this gyro from other places is that you can taste the freshness of their vegetables and they don't use as much salt as other places.  Definitely excited to try more of their food soon!"}
{"text":"At first glance the place mught look suspicious to someone that might be less adventurous and educated about quality food.

I had read reviews on Yelp & Google before venturing out Saturday morning.  

I had a short wait around 11am as the restaurant has 9 tables and a 6 seat bar.  Once seated I was greeted by very friendly staff.

Toni was my waitress and I highly recommend you ask for her when you arrive.  She is friendly, attentive, kind & thoughtful in her approach and job execution.  

The food was superb as was the coffee.  By far the best breakfast I've had during my 5 week road trip.  I've returned her and have yet to have a bad meal or experience."}
{"text":"Many a breakfast enjoyed here. Southside Diner is a tiny little place with a breakfast bar right up by the cooks, a few booth seats and some tables. Very small but it gives it all the more charm. They serve up a delicious breakfast (we'd always order the crazy 8 and the breakfast burrito) but they make equally tasty lunch fare (try their burgers or big, 100% beef hot dogs, or a tasty wrap or gyro!). This is your classic local diner that makes you want to come in, sit down and say \"I'll have the usual\"."}
{"text":"Nice true diner. Right across from Tri-C, great location. Good selection on the menu. Prices are $5 for kids meals and $7-$12 for adult meals or breakfasts. $2.50 for good hot chocolate."}
{"text":"Nice small diner in Parma.  Their breakfast burrito is my favorite!  There is not a lot of seating, most tables fit 2 people, a couple fit 4.  Staff has always been nice."}
{"text":"We love this diner!  They offer the best gyros around. Thanks Nicki for always taking great care of us!"}
{"text":"The local Southside Diner is a hidden gem in Parma. They have excellent food at extremely reasonable prices. The staff is very friendly and attentive. I ordered the breakfast special at Southside Diner and my favorite part of that meal is the bacon. They don't skimp here - nice cuts of peppered bacon. The coffee is also very good. I look forward to returning and trying something new."}
{"text":"Great breakfast and fresh ground coffee! It's a little small so get here early on the weekends. They have some unique combinations that you do not find at most small diners. Even if you have to wait a while it is definitely worth it."}
{"text":"Was visiting Strongsville for the day and looking for a nice place for breakfast.  Looked at previous reviews and we tried the diner.  We were very pleased with the friendliness and cleanness of the place.  We had a lovely breakfast.  I had the ham and cheese omelet and my friend had the ham steak with eggs.  Was delicious and plentiful.  The hash browns were awesome and the atmosphere pleasant.  Will definitely visit again if I the area."}
{"text":"I loved this place!  I can't believe I've waited this long to try it. It's got a perfect, old school dinner feel, with just about a dozen or so tables and several bar stools at the counter into the kitchen. My gf and I went there for our Galentine's Day celebration. We shared the potato pancakes, with eggs, bacon and sausage. It was just the right amount of food for us and cost 12 bucks! As we sat there we watched some of the other items come out, the waffles, biscuits and gravy and pancakes all looked delicious."}
{"text":"Greatest secret on the Southside. Love the HASH.   Large menu.  Breakfast to late lunch and worth a try.  Wish it were open later.  Yum"}
{"text":"If I had offered a review of this small, local, family owned eatery a couple of years ago it would have had 4, possibly 5 stars. There was always a line of people willing to wait no more than 5 or 10 minutes for a place to enjoy the hearty, plate-filled, reasonably priced diner fare. I visited the first time after receiving a coupon in the mail.
The small counter area and limited seating was always busy yet there was always enough wait staff serving the delicious food in a timely manner and enough cooks preparing the meals so as to have a quick turn around of tables making the wait tolerable.
However, about a year ago something began to happen; wait staff turnover seemed to happen more and more frequently - - their numbers diminished. The number of cooks lessened as well. 
Small, seemily inconsequential things began to happen at first. You'd wait for that coffee refill or your toast wouldn't come  until midway through your breakfast. On the publicized rare nightly opening for St Patrick's Day the majority of the staff left before the dinner service began in earnest leaving two people to cook and serve. Even then you ignored the growing  inconsistency because it was a good value and great food.
Then a few months ago the restaurant doubled it's size by expanding into the adjacent area. As  the seating area grew bigger you would have thought that more wait staff would be working, especially during peak weekend hours but that hasn't been the case.
What now happens is that where once 4 or 5 staff took the orders from a house half the current size, now 2 or 3 wait staff try to keep up with the increased traffic while 1 line cook falls behind on orders for pickup.
During the recent visit, customers were seen leaving after waiting 10 - 15 minutes while tables sat unbussed with dirty dishes.
The new room addition was full of customers with more than half of the tables waiting for that first cup of coffee, a glass of water or their long ago placed orders. The once friendly atmosphere has been replaced by a feeling of hurried uncalm. 
It's one thing to stand on que while waiting your turn to enjoy great food served by smiling, courteous staff. Its another to wait for minutes on end while seated without a beverage or a hello by the limited help.
This used to be a wonderful restaurant that was even selected by the local Mayor as their monthly selection. Unfortunately now this former jewel is suffering major growing pains that may just bring it back down to size."}
{"text":"First time here. Looking for that classic diner experience with great food. Found it! Home style feel as if you went back in time. Cheap prices for quality food. Fresh corned beef and Coffee is great."}
{"text":"Saw the reviews on here and couldn't help but to try it myself. Was in the area looking for a good brunch and south side was the first thing that came up. Food was pretty good but way too pricey. Didn't know my brunch was going to cost me $14 some dollars. Wouldn't spend that much again now knowing the price, but food was tasty."}
{"text":"Came here for brunch, ordered off the special menu. Super friendly waitress, absolutely enjoyed the food."}
{"text":"How did I not know this was here??  I've lived in the area my entire life and have never been to the Southside Diner but trust me, I'll be back!  My daughter and I were out for the day and we decided to stop here. I am so glad we did! The staff is very friendly and their service is great.  We were promptly greeted even though they were busy.  I had the Parma wrap which is egg, home made corned beef and Swiss cheese.  Delicious and perfectly done!  My daughter had the Nutella waffle and after I had a bite I agreed with her that it was delicious!  The waffles are made in house when you order them and there are a variety of toppings you can get to go along with them.  The place is small but that's just fine. There were several people coming in to get take out food so that also speaks to how good it is.  I must mention that they are only open for breakfast and lunch but I can't wait to go back and try lunch!"}
{"text":"Excellent breakfast/lunch/Mediterranean food if you're looking for something quick, filling, and cheap. Chicken and waffles are amazing, and they always have specials on French toast and different egg skillets that are totally worth a try. It's a hidden gem, for sure. I don't recommend parties more than 4-6 because it is very small and seating is pretty limited, but tables--and the servers--move quickly. No frills breakfast/lunch diner."}
{"text":"First visit here and I'm sorry it took so long. It's a cool little place with that diner vibe. While it may be fairly small the menu is HUGE.  Just an amazing number of choices.

Today I had the urge for a wafflel and tried the strawberry and cream version. Last week I had brunch at Dante Next Door where I also ordered a waffle. Little ol' Southside Diner;s kicked DND's waffle right in the griddle. Twice. Seriously, it was awesome and inspired me to go back and try some different items which I will certainly do soon. Oh, and my server was very upbeat and personable and that never gets old. 

So, yeah, this place has a bunch of strong reviews and I certainly see why. Can't wait to back."}
{"text":"This is exactly what we were looking for from our breakfast this morning, standard breakfast fare done well. The service was fast and friendly and the diner, while a little small, was clean and charming. I had the veggie omelette and added feta to it, which was fantastic. The home fries were a little bland (as they often are) but there was plenty of food for the money. My husband had the Crazy 8 and must have loved it because he didn't share any with me!"}
{"text":"It doesn't start out well when it takes 45minutes from order to get your food.  The corned beef omlette was very good but the chicken cordon bleu omlette was a letdown.  Then factor in the woeful coffee and steep price.  I won't be back."}
{"text":"A solid better-than-your-average-diner kind of place!

It's a small place, so be prepared to wait if it's busy. We waited about 10 minutes or so on a late Sunday morning. The waitresses were friendly, the coffee was hot and refilled often, and the food was good."}
{"text":"Excellent breakfast place. Good variety on the menu and decent prices. My omelette was so chock full of toppings that the egg was hard to find at times, but I like that! The peppered bacon was delicious too. Service was stellar. It's a small hole in the wall place, but give it a chance!"}
{"text":"This is a _great_ small diner with a very traditional feel, complete with décor heavy on steel, white Formica, red vinyl, and white tiles, all of which somehow feels natural as opposed to forced or fake.  The diner is kept clean, and it is bright from lights as well as large front windows.  License plates on one wall represent all 50 states.  (I believe they could use a DC \"Taxation Without Representation\" one if anyone is heading this way and has an extra one. :-) )  Two tvs are on the walls.  And as others have said, there're only around 20-30 seats at tables or the lunch counter.  The staff is warm and friendly.  The food is very good and has great prices, all from a large menu with lots of breakfast, lunch, and probably dinner items.  (I was hungry and not focused on the latter, so it didn't register.)  I thought the peppered bacon was particularly excellent.

I hope I have more chances to visit!"}
{"text":"This is the best breakfast in Cleveland! An absolute must go whenever I'm back home in Parma.. I've taken so many friends and family members here that the staff has become family themselves!! The specials are incredible and the menu items are to die for.. the cozy diner atmosphere reminds me of being right at home with mom and dad!  My two favorite dishes are the eggs Benedict Florentine and the breakfast tacos!!!"}
{"text":"Excellent breakfast. Superior service. Pleasant atmosphere. Great place to stop and eat!"}
{"text":"I love this place!  The decor is nostalgic & interesting.  The service was fantastic.  Our server was very attentive & quick with the coffee.  We ate breakfast.  I had the \"Southside Special\". It was a great meal at a great price.  I will definitely return on the next trip.  The only thing I didn't care for was the unisex bathroom.  Shared public restrooms are YUCK!"}
{"text":"Fantastic breakfast place! I've never been there for lunch but Southside is my new go to place for brunch. The staff are all very friendly and the food is delicious. 

They're a small establishment so sometimes you've got to wait a bit for a table but it's well worth the wait."}
{"text":"So, I'm sitting here at this restaurant and my meal has been eaten. The flavor was good, but my wife is still waiting for her food for the 3rd time.
The first time they added hot sauce when she specifically asked them not to, then they re-made it and brought it back out and there is hair on the plate- so, we asked again and they said \"we will remake it again but it's not free!\"
NO ONE ASKED FOR IT TO BE FREE!
Terrible service, filthy place!

STAY AWAY!"}
{"text":"Small, hole in the wall diner. I'm always in the area and never even knew this place existed until seeing it on Yelp. Consistently great food and service. The specialty hashes are my favorite. Their corned beef hash is the best I've ever had. Huge menu with tons of options, definitely something for everyone. It's very small inside with limited seating so it's best to be there very early or afternoon to avoid waiting!"}
{"text":"Wow...had no idea this place existed until I told my husband I was sick of our usual breakfast stomping grounds. Since we were already in Berea, we took an adventurous road trip down Bagley Rd. until it turned into Pleasant Valley and then there it was...in all its diner glory...The Southside Diner!

12:15 pm on a Saturday was such a good time to go. We sat right away, at the counter; however, there were plenty of open tables around. We were greeted with a smile and offered beverages immediately. The menu was extensive with some unique breakfast choices. 

I ordered the eggs benedict, my go to dish if there are no eggs Florentine. They served the BEST hollandaise sauce I have ever had.  I also ordered a side of their sausage gravy to try on my homefries....needless to say, I could not finish my meal.

My husband ordered the breakfast burrito and as soon as it came out, the guy next to him saw it and ordered it as well. My husband could only eat half as it was stuffed with potatoes, eggs, bacon, and sausage and topped with cheddar cheese and sausage gravy. Another heavy yet delicious dish.

As we were leaving, we told our server we would definitely be back to try some other dishes and he let us know that he may be in the back since he is actually a cook! I told him he was excellent and couldn't believe it since the service was wonderful.

I'm so pleased to have found a new breakfast place to go on a weekend.

WHEN ( not if)  you come here, make sure you come hungry. You may not need to eat another meal the rest of the day."}
{"text":"This place is AMAZING!!! Things are priced well, way cheaper than any breakfast chain and the food is from scratch. Omelettes are delicious and their corn beef hash is crazy good! The place is very small, doesn't fit more than 20-25 ppl at tables but they do have counter seats too. By far my fav breakfast place :D"}
{"text":"First time we went to Southside Diner food and service was great I believe back in the winter.
We went back today service was still great but the food was not,very disappointing asked for soft scrambled eggs got over done rubbery eggs,asked for a buttermilk biscuit got one over done and tasteless.
My Wife ordered the pita bread breakfast,the pita was so overdone it had to be cut with the knife,and then cracked apart.
Last time for us."}
{"text":"Ok so I love yelp let's face it being able to look up reviews on restaurants is awesome! So instead of eating in our nice but over priced hotel we ventured about twenty minute drive for 5 miles away from Cleveland Airport. This is the place to eat breakfast or lunch! It's all locals and it's in a residential area. But it's not often that my husband compliments food! I mean he just doesn't usually care what he eats. So sad since his wife is a Chef and Sommelier. But enough about that, this morning we had Athenian Breakfast with the absolute best feta cheese just salty enough without killing it on the tastebuds. So good he ordered a side to have additional feta with his eggs and gyro meat and tomato slices. The taziki sauce is delicious he didn't care for it but I had to taste it. I totally approved! I had chicken and waffles with siracha and it's amazing! Toasty crispy waffles and crispy breaded chicken it was divine! We will be returning it's easy on the pocketbook for what you get. Love this it may be our daily breakfast place while we are in town! Don't miss this hidden gem! 

Update just had the gyro sandwich and asked for extra taziki and it's phenomenal. Regular size was perfect but you can get more meat with jumbo. My gyro wasn't lacking it was packed with meat and delicious I'm guessing if you ordered jumbo meat would be heaping out the top. Simply amazing food! Wish I lived nearby but visiting from NC and have come here three out of five days for breakfast. Not disappointed at all! Sad to leave though we will miss this gem!"}
{"text":"Almost a \"hole-in-the-wall\" place from the outside, but the perfect diner inside. Very quaint, and probably can't pack more than 50 customers inside. But the menu? Delicious! I had the corned beef stacker, and it was a flavour circus (in a good way). A great portion size, but I love food so I went for the strawberry and cream cheese pancakes afterwards and didn't regret it. The service is great as well; never a cold or empty coffee!
I would definitely suggest making a trip here for a Sunday brunch with a significant other, getting stuffed with good food, and napping afterwards."}
{"text":"Looks like a classic, little family-owned diner. Honestly, the chorizo breakfast tacos were fantastic! Great blend of flavor and textures. Peppered bacon had big flavor and was cooked perfectly. Thanks for the great service!"}
{"text":"Southside is the go to Sunday morning breakfast spot for my husband and I! The food is always great and the service is very efficient and friendly. We almost always order off the specials board and rarely crack open the menu, but a few of our favorite specials recently were added to the everyday menu so it's clear the owner is responsive to what the people want. The food is very reasonably priced and, frankly,  they could be charging twice as much and we'd still pay!  It's that great!"}
{"text":"Meh. Just meh. I decided to come here because of the great reviews and I would have to strongly disagree with this place being the best diner in Parma. I would much rather go to Charlie's or The Corned Beef Co. To start, the service was great and the coffee was good. The gyro meat also looked fantastic and they had quite an extensive menu.
The cons: they had a huge pan of pre cooked bacon and sausage just sitting on a cart. It wasn't even being kept warm. I guess it saves time but I thought that was kind of gross. I also thought there home fries were undercooked. I like them super crispy but that's just me. 

All in all, it was ok but I probably won't be back."}
{"text":"Wow! Talk about not judging a book by its cover. We are ready to drive off after seeing the place but the nearest place was about 9 miles away and we were starving, so we decided to take a chance and hope we survive it. 

Well dang!

The place inside is old decor and doesn't do much to put your mind at ease, but once our waitress started talking everything changed. She was amazing! Attentive, nice. She gave us recommendations and they were spot on. I had the chorizo hash which was perfect!

We are definitely coming back here!"}
{"text":"As most have already said, this place is quite small, and there's not really much space for groups over 2 people.  I had the blueberry french toast, and it was good and quite a bit of food for 7 bucks.  It came with 2 eggs, 2 bacon, and 2 sausages.  I liked the value although the food was good not great.  My buddy got the breakfast burrito, and it was pretty huge.  I took a bite of it, and it's worth having.  

Overall, I really liked this diner and would go back if in town again.  It's small and sort of a throwback type place.  But it's good food, and the price is right!"}
{"text":"I'd consider myself a pretty big diner fan. Formally I've been a Whip girl and a diehard Mayfield Eat At Joes fan. Southside has stolen my heart.

From the outside it looks small. From the inside, it's timy.  But even in close quarters you get some space. My boyfriend and I sat at a window bench table built for 2 and had plenty of room to put down coats and my purse and get comfy. During our breakfas, 3 waitress came by with coffee and water and to check on us. All were very friendly. My boyfriend had a cup of coffee which he says tasted a little old but nothing to complain about. 

We both ordered the bagel breakfast sandwich with hash browns. It was delicious. Instead of stacking everything on top the plain bagel, it was a 2 egg omelet with America cheese and cut sausage links folded in. I can't believe I never thought of doing that, it all stayed together so much better. The hash browns were also very good, they were in slices, not strings. Both meals were under $10 each.

There were a lot of people there but we had no problem getting a seat and our food was out in no time. Alk together breakfast only took us 45 minutes, and that's with some time we took to hang out and finish drinks.

Southside, I am yours."}
{"text":"Great, consistent food.  Tastes like homemade. Friendly wait staff and service!"}
{"text":"My parents would give this place a solid 5 stars for the corned beef hash, extremely pleased.  The service and coffee were spot on. Not a huge fan of the eggs (scrambled more done than I prefer), peppered bacon (too much pepper), and hashbrowns (crispiness was good but needed seasoning).  Everyone else had an amazing looking breakfast, would try again if staying in the area."}
{"text":"We came at the Saturday lunch rush. They were busy but still got our food to us quickly. The coffee is good. Their chicken & waffles is amazing with their siracha syrup mix. The grilled chicken sandwich is really good. My daughter said her Micky Mouse pancakes are the best ever!"}
{"text":"Food was yummy. I had the corned beef hash & eggs breakfast with a biscuit for my \"toast\". It's all home made and yummy. The diner is small and not fancy. Service was prompt and courteous. Prices were not expensive.  A nice casual choice for a late Sunday morning."}
{"text":"Went with a friend this past weekend. Fantastic food and quick service. I will be going back for sure. I ordered the bagel sandwich and it hit the spot. Great diner overall!"}
{"text":"The food is delicious, clean and fresh. Great diner and the service is great. Especially Dina! Check this place out, so good!"}
{"text":"This is a great little diner. Prices are low, breakfast simple and delicious. Nothing fancy, but the servers were friendly and food came out fast. Seating is limited for a group over 2 or 4, but all in all this is a solid breakfast adventure!"}
{"text":"This is about a 3.75 I'd say. The menu is a good size and there are some unique and very filling menu items including some gigantic breakfast options. The food deserves a 4.5.  The location is very small which inevitably means there is a wait, and that you're probably going to rub elbows with the next table.  The dining area could use some TLC and refresh. Still, if the experience doesn't matter and all you care about is the food itself you will enjoy a good meal here."}
{"text":"You ever see the episode of Friends, 
Chandler raises one hand and asks Joey if he'd rather have jam or raises the other hand and says the copy girl?  Joey replies \"Put your hands together\"
Seriously, that's how I'm feeling about these breakfast tacos!!
Holy taco! Amazing! Chorizo, eggs, onion tied together with grilled pineapple. Delicious! 
I'm in heaven! I could eat like 10!
French toast was ok nothing fancy. Coffee was good. 
Cup stayed full. Laid back atmosphere, nice staff. Grubby little diner but I love it! Totally be back!!! I almost wish I didn't try the tacos because now I won't want to try anything else! God bless the breakfast tacos!"}
{"text":"So good! We stopped here for breakfast during a road trip and were so happy with everything. Staff was friendly and efficient, the food was amazing, and the coffee was excellent. We had pancakes, the spinach omelet, and the bagel sandwiches. Everything was delicious and we left beyond stuffed. The home fries are wonderful - get them; you won't regret it. And as a final observation, the diner is small, open and airy. You see the kitchen and the cooks preparing the food and will probably note, as I did, how clean everything is. Very pleased with the experience and grateful to fellow yelpers for their reviews that brought us here."}
{"text":"Omlet was great, better breakfast than most diner's I've been to in the Cleveland area, and there prices are some of the best I've seen."}
{"text":"After living in the area for decades, finally tried this place for breakfast.  Doubtful I will return.  Seemed dirty, one waitress, food mediocre at best, expensive for breakfast.  All in all, nothing to write home about for sure."}
{"text":"Yeah - a dinner close to home. Good food and friendly wait staff. We got the standard breakfast fare...in addition tried the sausage gravy and biscuits, which was awesome. The only thing, they put the gravy on the home fries, we did not care for that (personal preference) the waitress brought out a replacement - no problem. Coffee was also very good. We will definitely be back. (Could use a little more of a cleaning- that is why I held back a star)"}
{"text":"Best breakfast I have ever had... period! Amazing food, great service, and the coffee is better than your star sucks."}
{"text":"Corned beef hash and strawberry cream cheese French toast. It was downright magical. Good coffee and great service."}
{"text":"The Southside Diner is a true hidden gastronomic gem with culinary chops far exceeding my expectations! Tucked into a nondescript strip in Parma, this compact eatery packs about 12 small tables and a swath of bar seating atop an open-concept kitchen area, allowing the aroma of rotating gyro meat to waft throughout. The kitchen appears to specialize in a heretofore-non-existent form of Greek-Irish fusion cooking, answering the question no one was asking, \"What if a Greek taverna and an Irish pub had a baby that served breakfast?\"

The dining room is decorated with a retro-kitsch chrome-and-tchotchke scheme. On my most recent visit I ordered the special of the day, a Gyro Hash, and it was hands-down the best breakfast I've had all year! In fact, I'd recommend ordering whatever the daily special is when you go because it's always outstanding! Favorites in the past have included a Barbacoa Hash and Corned Beef Benedict. The service is polite; ambient noise level is moderate; coffee is as expected for a diner. If you're anywhere on the SE side of town, it's 100% worth a stop!"}
{"text":"This place was amazing! From the outside, it doesn't look like anything special but when you walk in, the whole place makes you feel like you went back in time with a classic diner theme- complete with license plates, records, and posters on the wall. The staff was very friendly and made you feel welcome. I first went there with my dad and my sister and I ordered chocolate chip pancakes and they were the best chocolate chip pancakes I've ever had. They were complete with chocolate sauce and whipped cream on top. My dad ordered a gyro and fries. The gyro was as big as his head, if not bigger! He was saying that it was amazing! The flavor was outstanding. My sister ordered the club sandwich. It was by far the biggest sandwich I've ever seen. She said that it was outstanding. We also had coffee- by far the best coffee I've ever had at a restaurant. They grind the beans right there on site every single day to give the coffee that fresh, delicious taste. Would definitely recommend this place!"}
{"text":"Family of 7 came in with a breakfast/lunch hankerin' and this place did not disappoint! I ordered up the chicken gyro with fries on the side. The others ordered breakfast style plates, omelets, scrambles... Everything came out nice and hot! The gyro had a fluffy pita bread wrapped around fresh lettuce and tomato and good hunks of chicken. The tzatziki sauce was on the side, and it was perfect that way. I was able to add the sauce when I wanted it without the sauce engulfing the entire sandwich. 

This is a traditional diner atmosphere. TV's in the corners, open kitchen, license plates all over the walls and a big wrap around bar. I will definitely come back to this place next time I'm in town."}
{"text":"Not sure why this place has such high ratings. It was stereotypical diner food, and the place wasn't exceptionally clean or anything. Staff were fine, but not above and beyond."}
{"text":"Southside is a true diner! It doesn't matter what you order off their menu, it's going to be good. The specials are always changing and I recommend you take whatever French toast is in vogue at the time. Coffee refills are constant and you'll leave your breakfast/brunch ready to start the day. Last word, if you're on a diet, this is not the place for you."}
{"text":"Looked on Yelp for a good diner to have breakfast at and found Southside. I was a little worried when I got there as there was only one other couple in the restaurant at 8:30, but my fears were assuaged when ten minutes after I arrived, the place filled up.

I looked over the menu, and everything looked very good. I settled on the corned beef hash omelet. This thing was huge! The eggs were done right and the hash was not only overfilling the omelet, it was delicious. This place was everything Yelpers said it was. I would definitely eat here again when in the Cleveland area."}
{"text":"This place is great! Great food and prices! Large portions, so I suggest splitting plates. Friendly waitress too!"}
{"text":"We loved this place, and will definitely be back soon. From the outside, it doesn't look like much, and honestly- wouldn't' have stopped in if it weren't for the glowing reviews on Yelp. Small inside the restaurant, but very clean and comfortable. We stopped in for a quick Saturday morning brunch, and ended up getting one Potato Pancake Breakfast, and one of the Three Egg Breakfasts. Everything was very good, especially the potato pancakes (not too greasy, and a good amount of flavor). Coffee was also quite good for diner coffee. The service was excellent, and we had no trouble getting our order in and food out in quickly. The prices were also extremely reasonable for the quantity, making this a new top choice for breakfast/lunch for me."}
{"text":"Favorite breakfast/lunch place. Super friendly people. Meals are always presented nicely. Food is delicious and so was my waitress Toni."}
