{"text":"Stopped in here for the souvlaki lunch special for $8.95 today.  Your choice of pork or chicken along with fries or rice and a drink of your choice.  Food was well prepared.  The restaurant is well suited to take out, there are a limited number of tables available, and the bathroom was not well equipped. Good value for the money, the food is fresh and tasty.  Ambience lacking for dining.  Would return and recommend for take out. So I'd say the food is four stars the dining experience 3 stars."}
{"text":"Currenty the best pita in laval for my family (gyro and chicken). Calamari is excellent as well."}
{"text":"Love the decor in this restaurant . nice Grec traditional restaurant with delicious chicken pitas. Very well marinated and well cooked. Souvlaki chicken pita is delicious. Service is awesome there too!"}
{"text":"I was driving out for lunch when a new sign caught my eye. 'Souvlaki Vieux Grec' just opened it's doors and is trying to make a name for itself in an area well known for similar Greek restaurants. Oddly enough, the cover of their menu looked familiar and after some inquiry it's the same owner of 'Le Village Grec'.  My coworker and I opted in sitting in and ordered away. I went with a Gyro pita with fries and soda and my co-worker took a souvlaki stick platter. It's not fine dining with plastic plates and utensils in a rather small seat-in area but let's be honest, they seem to they truly focus on take-out/delivery and I saw them in action! This is great for me, particularly during the cold winter months.  So how was the food? The gyro pita was very tasty and the plate of fries was my FAVORITE, thick and long, hard on the outside and chewy on the inside. My co-worker let me taste a piece of the souvlaki pita and it was the real deal folks. All in all, this grub brings serious competition and I hope it establishes its own clientele in the area so that it lasts.  The price-tag is good and the service was solid.  I think this is a start to a long and happy relationship."}
{"text":"Someone told me that this restaurant was great so I decided to try it. Boy was that person correct! I had the loose meat chicken and it was one of the best I've ever had. I did not take the fries because they were the thick  cut  potatoes that I don't really care for  but my salad was extra big. The coffee was spectacular and so was the galaktoboureko. What I also liked about this restaurant was you could bring your own wine and beer. I like a glass of wine with my dinner, but I don't like to spend 8 or $10 for it so it's nice to bring my own. Another thing I want to mention is the service because this restaurant really impressed me with their customer service. We had two different people serving our table and they were both really friendly and courteous. I would recommend this restaurant to anyone. However, you have to make reservations. The restaurant has very few tables and if you go there without a reservation you may not get in."}
{"text":"Ordered pork souvlaki and the mixed loose meat lamb/pork. Very friendly service friendly delivery guy food was fresh but very bland and not flavorful. I wouldn't order again."}
{"text":"Finding this place on the net and with knowing its the same people as Village Grec. All I had was the Gyro and it was amazing. But I must warn they know for their delivery and their sit down is nothing special but still worth the try."}
