{"text":"Good food here! The typical southern cuisine was in full effect! Had the smoked chicken and baked beans with Mac n cheese ;-) overall good experience here. My only gripe is there's not that much seating here, and the staff sat by and allowed airport employees to take up paying customers seats. They sat and watched the football game. Not acceptable!"}
{"text":"Terrible. We had an hour to eat, it was 7am, there were only 3 other tables. The lines elsewhere were 80 deep. Drinks took 15 minutes, but according to the waitress it was the bartenders job to pour your diet coke and she was busy with bartender-y things. 
I ordered the ham and cheese omelette plate, my daughter, the pancake stack and my husband the burrito. We ordered at 7:02, says our ticket. At 7:39 we were literally standing to leave, our flight to San Diego was 7:55am.... The food finally comes.
The pancake stack is one pancake and an apology and the promise if a to go box for the rest. We were really hungry. The omelette was compelled flat and rubbery and not even cooked thru. The home fries were icy cold. They were oblivious to the fact that people had flights..... And every one of the other tables had problems as well. Really terrible even for a quick airport joint. And it the place is NASCAR themed. Fast? Speed?"}
{"text":"We stopped in here to kill time during a layover here in Charlotte. Really plays up to the theme of a NASCAR race with racing uniforms and pieces of actual cars. They have a full bar and a wonderful view of planes coming and going. You come in and seat yourself. 

The food was nothing spectacular. The bacon was extremely salty and greasy. The grits weren't edible. The only thing I ate that was ok was the eggs and fries. 2 things of which are extremely difficult to mess up. The pancakes were ok tasted like store bought mix nothing great. 

All in all if ever in CLT I would definitely not return. For a $30 breakfast after tax and tip I expect a little bit more. I should have went to Cinnabon or Starbucks and saved $20. Might just be a nice place to have a beer and catch a great view of the planes"}
{"text":"I had pancake and sausage and my wife had an omelet.  The pancake and omelet were delicious and the portions were more than adequate. The service was slow, but we loved the food."}
{"text":"Food was delicious, fast and service was awesome.  Our waitress was so very sweet, clean place and we really enjoyed it. We were stuck on a 5 hour delay, staff let us hang out. Cool place!"}
{"text":"Did the trick as far as airport food goes... I grabbed a small pizza and a drink, gobbled it all down, then caught my flight. No complaints. 

BOTTOM LINE: One of the few choices out here in E-terminal. Good for a quick slice of pizza."}
{"text":"Not bad for airport food. Once I ordered service was prompt and attentive. However, getting to order took a little longer than it really should at an airport restaurant really should. 

I had the buffalo chicken sandwich. Tasty, but no way you can actually eat as a sandwich. More of a fork and knife meal. Nice cold beer though."}
{"text":"For an airport restaurant and getting there at the end of breakfast and start of lunch - I was satisfied. After a quick discussion with my waitress - I decided to order quickly and have breakfast - scrambled eggs, sausage patties, potato wedges and toast - had a diet Coke (a bit of lunch I guess) and everything was served nice and hot with flavor (eggs were a bit bland, but that's eggs for you). 

The service was quick, the waitress certainly friendly enough and the place was decent in the cleanliness area. I know not everyone cares about this, but it truly can be an indication of how the business is run!

I'm not sure about the new thing - bottles of Fiji water you can take for $4.00 dollars sitting on every table - almost looks like they are free - sorta kinda! I had to ask my waitress how much they were.

Overall - for this stop - it gets 4 stars, because everything I had was good, price was very reasonable and the service was very good."}
{"text":"Typical airport restaurant: interesting from the outside, stale and overpriced inside. Not sure which was more bored, the waitress or the salad."}
{"text":"Ordered the over the wall breakfast this morning waiting on my delayed flight.  It sounded great!  Two eggs your way, bacon or sausage, potatoes or fruit and multigrain toast.  My eggs were undercooked and a tad bland even with salt and pepper.  The sausage patties were ok.  Fruit was a nice blend, but each piece was either too ripe or not ripe enough.  My server was nice enough, but he just dropped everything and ran.  I had to call him over multiple times for milk and coffee refills and butter for my toast.  I swear I'm not that demanding of a patron.  Just ask if I need anything once you drop the food and maybe a follow up check in???  All in all, I would try another breakfast spot in the terminal next time."}
