{"text":"The food was terrible. Rice was not cooked and the beef tasted like it was either canned or dried then rehydrated.  Nasty! Threw whole dish away after 2 bites. No flavor!"}
{"text":"They were in Santa Fe last weekend and talk about a rip off. No menu, no prices and one item~chile. Well it tasted New Mexican, like my own and was the tiniest little bowl. I thought she knew I was ordering two and to get one bowl for 15, never again!"}
{"text":"The Red Lentil Curry is so so good! Last year this was my absolute favorite during Taste of the Trucks, and I have sought it out several times since. Doing that right now, actually."}
{"text":"The pulled pork sandwich was GREAT with tons of meaty goodness .... they are a bit pricey but most food trucks are in my experience."}
{"text":"So happy that I stopped by this truck tonight at the Food Truck Caravan in Scottsdale.   It is hard to find vegetarian at some food trucks.   This truck does it right for sure with the spicy red lentil dish.   It was wonderful, great flavor, good spice and great people for sure."}
{"text":"Pretty good! I stopped by this food truck when it was in Tempe and of course I got the Chicken Tikka Masala which was featured on the show. My favorite part was the oversized chip (make bigger ones!!). I also really liked the sauce and the rice in the dish. My main beef with the dish was the chicken - a little dry, but then again I've never really had a chicken tikka masala where the chicken was absolutely juicy and perfect. So yes, pretty good. I would definitely try another dish of this truck's next time."}
{"text":"I was in downtown Phoenix and stumbled upon a food truck Roundup and decided to go to spice it up. I was pleasantly surprised, the jerk chicken lettuce wrap was very tasty they gave me three lettuce wraps and a little side of coleslaw as well as some barbecue spicy chips. I asked for low-carb so it would've been niceto have carrot sticks or celery sticks instead of chips but I did eat a few of the chips and they were tasty. I would recommend this food truck to a friend. The three lettuce wraps were nine dollars. I'm not sure if the chicken was organic or free range or any other specification. I think nine dollars is reasonable at lunchtime in downtown Phoenix. I wouldn't have a been opposed to a drink in addition to the meal and have it included in the price."}
{"text":"I thought it would be lots of fun to try the food from the Spice It Up Food Truck. They specialize in Flavorful International Food. We enjoyed watching them on the Food Network's The Great Food Truck Race and were hoping that they would win because everyone said their food was delicious and they won many of the challenges on the TV Show. I also felt good about ordering food here and had no fear about them being a \"roach coach\" because they displayed a current grade \"A\" Maricopa Health Code Inspection.  We ordered three things to share.  Chicken Tikka Masala - The white meat chicken in the dish was moist but the sauce was oddly mild and mostly tasted like tomato. The crisp was tasty but greasy and the dish was about 75% rice.  Lentils- Very nice presentation but again very mild with little flavoring. Not bad.... but after a spoonful or two... there was no reason to go on. Again about 75% rice.  Thai Red Curry - Lots of fresh crisp vegetables BUT NO SAUCE AT ALL. DRY CHICKEN only mildly scented with curry flavors. NO HEAT AT ALL. About 50% rice. EPIC FAIL  If you prefer your food without heat and on the bland side you will find the food delicious.  They sure need to live up to their name and SPICE IT UP!"}
{"text":"Curry bowl was expensive ($15), especially considering it was mostly rice. Couldn't really taste the curry and there was no heat to it. Plus the girls were being really rude to the customers and belittled me for ordering a corn dog from a rival truck. Classless and disappointing."}
{"text":"Sad and disappointed. Was super excited to try a new truck while at Phoestivus tonight. Saw this place had chicken tikka masala and I looked no further. They make sure you know they were on Food Network though they didn't fare very well. Anyway, back to the food! I was really looking forward to having some tikka! Well, I don't know if they were having an off night, but it was highly disappointing. No spice. No flavor. Well, there was flavor, but it was more like a tomato paste than a rich and typically flavorful sauce. This was much more tangy and sour than what I am used to. I have had this dish at several different restaurants and I've never tasted anything even remotely like this. The \"basmati\" rice was seriously undercooked and came out of my bowl in clumps. I even crunched a few pieces.   I was tempted to take my dish back to them but they had a few people in line so I honestly just ended up throwing 95% of my dish away. Even my 2 friends tasted it and had the same reaction I did.  I didn't leave hungry though, I went to the truck down the way and enjoyed one of my favorite hot dogs!"}
{"text":"Yum!! I ordered the Thai red-panang chicken curry and it was delicious. Could have used a little extra sauce though because by the time I reached the bottom of my to-go box the rice was a bit dry and sauceless. But the flavor was fantastic and full of vegetables (like zucchini and squash) and chicken breast pieces. My friend ordered the chicken tikka masala and said hers was fabulous as well."}
{"text":"The Spice It Up food truck it Dee-licious!!  They came to my building this week for our Wednesday food truck jamboree, and I must say that this is my favorite truck that has come so far.  I ordered their special Thai red-panang style curry with chicken and it was out of this world good!  There were lots of grilled vegetables and plenty of chicken above perfectly cooked basmati rice.  There was also the option to add Thai chili's to it, so being a spice fiend I definitely took advantage of that (and I am so glad I did ;) ) The sauce of the curry was creamy, spicy and oh so good.....I practically licked the carton clean it was so tasty!  A few of my friends also ordered from the truck (they got the Jamaican jerk chicken tacos, and red lentils) and they too raved about their meals!  The Spice It Up food truck gets a gold star in my book, and I truly hope they come back to our building's Wednesday food truck jamboree again!!"}
{"text":"I ordered the thai curry. Vegetables were good and good variety of spices were used. Nevertheless, the overall dish was very dry! I would highly recommend a heavier/thicker curry sauce for the dish or at least the chicken! If paired with a decent sauce, this dish could be good."}
{"text":"Yay, there was a new food truck today in Tempe for me to try! I went down with a couple co-workers who both ordered the chicken tikka masala. They each enjoyed their food. One of them ordered it extra hot and was pleased with how spicy it was. I went with the Cambodian ginger beef and that was pretty tasty too. I was a little disappointed by how little meat there was, though. Half the container was full of basmati rice and then in the mixture on top at least half the chunks were potato instead of beef. However, I absolutely loved the flavor of the sauce so that partially made up for it. Their home brewed iced tea was quite good as well but for $2 I expected a bigger glass.  I would definitely eat here again because of the flavor but I just don't think it is a very good value."}
{"text":"By far, the BEST most flavor packed food I have ever had!  Chris is a genius in her complex flavor combinations.  Her food doesn't just fill your belly, it takes your taste buds on a journey!  The beef is my FAVORITE dish!!"}
{"text":"When I was a kid, maybe 6 or 7, my mother took me to a neighbor's home to pick out a kitten as my new pet. One of the kitties was born terribly deformed. Her back was abnormally arched, and bulged out. She couldn't walk, and my mom told me that poor kitty probably wouldn't survive for very long. I knew instantly this was the kitty I had to take home. If it was the last thing I did, it was going to be making sure she had best possible life I could provide for her until that sad, inevitable day arrived.   I named her Jennifer. She and I were inseparable! I would run home from school everyday, ecstatic, and eager to see my beloved pet.  As she got a little older, she started to walk a little bit. I would lay down on the floor to watch tv, and she would climb up onto my chest, and sleep there. Everything I did involved little Jennifer. She was my best friend.   As she grew, the strain on her back became more and more stressed. Suddenly, she couldn't walk anymore. No more climbing up to cuddle with me. Finally after a couple of weeks, I got home from school, and ran to her little bed... but no Jennifer. My parents called me into the kitchen to explain that Jennifer had died while I was at school. They told me she was in a lot of pain, but that the pain was over, and that she was now in kitty heaven.  I was devastated. I couldn't sleep. I couldn't eat. I couldn't watch tv because it reminded me of little Jennifer. My sunshine kitty. All I could do was cry. I cried every night for a week straight. Eventually, I came to terms with her death, but needless to say, it was a very sad time in my life. I did learn a good life lesson though.  The Tikka Masala I ordered from Spice It Up was almost as sad. Save your money. Save your time. If you must eat from this food truck, I would recommend you adopt a deformed, dying kitty cat first.. because when it passes on to kitty heaven, you might then be able to forget about spending $11 dollars on complete rubbish."}
{"text":"You would think a truck called 'spice it up' would have a little more spice. A friend and I split their Tikka Masala and it was fairly mediocre. The sauce was not at all spicy and had a grainy texture. It wasn't terrible, but it wasn't a 10$ bowl of food. Although it was alright, I probably wouldn't order from this truck again."}
{"text":"I was a customer of the Spice It Up food truck at an event this weekend.  I really hate to rain the parade they have, but the Chicken Tikka Masala was not great.  I happen to be of South Asian background, and can cook better chicken tikka masala (essentially one of the many South Asian curries).  What I had was not great.  I do not know how they got so far in any Food Truck competition."}
