{"text":"I eat a lot of Asian cuisine and it's probably the one food I go out for in abundance. 

It's a bit of a hole in the wall, been around for a long time from what people have told me and is well known.  Prices are good, food is rather average.

Some dishes stand out, the green curry prawns is quite exceptional, the inverse of that is the pad thai, a mushy disappointment each time I've tried it there.  

Service is good and the food comes out fast. Good selection of beers as well.  I'd rate Spicy Hut as cheap and cheerful. Go for cheap reasonably good food, don't expect anything remarkable and  you'll be ok.

6/30"}
{"text":"I would say its about 4.5 stars, but there is no half star so I will give them the benefit of the doubt.  The ginger beef is as good as any if not the best I have had in the city.  Nice big cuts of beef and its tasty!  Started with the Thai dumplings and they were ridiculously good -- highlight of the meal. I have never had them anywhere else so I can't compare, but the ones I had here were delish.  Beef chow mein was very tasty as well. It's a dive inside, but the prices are good and the food is even better.  Highly recommend."}
{"text":"Ginger Fried Chicken: sauce on the side, would have thought it would have been cooked in the sauce. Sauce had too much of a vinegar taste to it. Chicken was too hard.

Spicy Hut's Vegetarian: the steamed vegetables were good. Could have done without the bean sprouts. However, the tempura vegetables were soggy. 

Panang Duck Curry: Pretty good. Some duck pieces were fatty and had gristle. Ask for mild if you can't handle heat.

Pineapple Fried Rice: Pretty good."}
{"text":"Love the food here.  Their pad thai is awesome!!  Prices are reasonable, and take out orders are made quickly."}
{"text":"The Spicy Hut is a classic eatery in this area. Known around the city for quick and solid Peking and Thai food. We had the 'hut' for our New Year's meal and it was delicious. They were very busy that night, but totally able to accommodate. Great service and great food.
Well worth repeated visits !"}
{"text":"The place is kind of small and dingy. Can be very busy some nights. The food though is very delicious and always served quickly. I recommend the Pad Thai and Ginger Beef and the Chicken swimming with Rama. Don't judge this book by its cover or you will be missing out."}
{"text":"I wanted a wing night, my friends wanted chinese food. I thought 'eh, may as well not be a selfish prick'. We approached Calgary's famous china block via 4th East when we saw this interesting-looking place, and I made the decision to go in. A pro of being the driver in your party is having monopoly over places to go.

Great value. Beers are a bit much (5.50 for an import) but the entrees are, well, on par (if not a bit more) with other places. Spicy peanut duck curry (13.25) was just as awesome as the mussel curry (15.50). Mussels and curry are a weird mix in general but it was deece in this case. Our dishes were rated 2/3 on the spiciness scale but I didn't taste much spice, as flavorful as it was. Calgary restaurants have a pattern of sourcing half assed ingredients, but this duck was great, as were the mussles. 

Portions were well above average. There were 3 of us, extremely hungry, and we consumed 3 servings of rice and 2 of the curries. We were stuffed.

It was a slow night. We were the only party there. Service was from some 40 year old azn dude who had his friends (or employees?) over for dinner.  Fortunately, he was positioned  his dinner table such that he was facing us, so when we needed more rice or food, he would notice. I like places like this. We got our fresh (AND PIPING HOT) entrees under 10 minutes after ordering.

Open until 0000hrs Fri Sat, every other day I believe it is 2200-2300hrs -ish. Sadly, 0000hrs is a high bar in this city for being open 'late'. 

I will come back."}
{"text":"The food here is so tasy.  I dont eat out much but when i do. I expect greeat food at a great price.  This place never disappoints me when i go.  So now me and my family try and go at least once a week.  Sometimes we will go twice!"}
{"text":"Great place for dining in or take out, fast, good, service, tasty, not fine dining, but always good and very reasonable priced. Fave dish, Pad Thai!!"}
{"text":"There are times when everyone sometimes craves something less than healthy.  Spicy hit certainly isn't fine dining, but it sure does satisfy when I have that hankering for westernized Chinese delivery.  The food always shows up quickly, and if you are in a rush they seem to make an effort to get it to you right away.

Spicy Hut  can have a bit more spice and flavor than other Chinese delivery joints (although the spice level varies quite a bit depending on the dish... In general, my feeling is that it's slightly spicier than your average bland 'westernized' Chinese food.  However, if you go in thinking Thai, you should probably ask for extra spice or lean toward the dishes that have a higher spice rating).  

My two favorite dishes are variations on ginger beef.  The first is the ginger fried chicken.  Think ginger beef, but made with chicken instead.  Yum!  For another variation on ginger beef, try the crispy fried beef.  It's made with strips of marinated, spiced flank steak and has a lighter breading than is on ginger beef.

The prices are reasonable, and the portion sizes are large.  Plan on having leftovers for several days.

Next time you are thinking delivery, consider trying spicy hut!"}
{"text":"This place has been a favorite of ours for years! Love the Wor Won Ton, Crispy Chicken, Ginger Beef, and any of the fried rice dishes. Consistent excellent quality and taste. Love it :-)"}
{"text":"Spicy hut is our go to place for great and quality chinese food. They should move to a new building with air conditioning and parking but the food is the best. For the fellow from the US who thought it wasn't good. I have eaten in many places in the US and I have tried eating Chinese food there. I can tell you the only place with slightly decent chinese food in the US is San Francisco. Spicy Hut is by far the top one in our books in the city."}
{"text":"Dear Spicy Hut, 

I owe you a big giant apology.  I don't know why, but I always forget about the existence of Thai food.  I think I sometimes confuse it for Vietnamese, but after eating at your restaurant this week, I've come to the conclusion that I have been missing out by not having enough Thai food in my life, specifically your thai food.

Your restaurant is the definition of a \"hole in the wall\" and  its quaintness couldn't be more perfect.  Your location is central but just a little bit off the beaten path, that means that the people who have found it, deserve to enjoy your delicious pad thai.

The spiciness of all your entrees is absolutely delightful.  Not singe your mouth hot, but it definitely makes your lips tingle long after you've downed the last bite of Musamun Beef Curry.

I will definitely be back....probably this week.  Top 5 take out meals I've ever had in Calgary!

Yum, Yum, Yum."}
{"text":"I'm definitely with Cleatus V. and Katie C. when I say that I LOVE the Spicy Hut.

I for one have a spicy food obsession, so it's truly no wonder why the Spicy Hut feels like home to my taste buds.

It's been around FOREVER, and the food has so much flavour you can't go wrong. 

What I especially love is that they have an entire vegetarian section on their menu! I especially love their Masaman Mangsawirat, their Phad Prien Mangsawirat and their Special Singapore style curry rice noodles.

The prices are extremely reasonable, the portions are large, and the flavours are unparalleled. And if you're a vegetarian, they will custom-make anything on their menu for you to ensure that it's veggie-friendly!

What this restaurant may lack in decor and ambiance, it more than makes up for with its food and flavour."}
{"text":"Total comfort food.

Came in here because it was -543224 degrees outside and I was starving, and if I didnt feed myself right then I would have probably passed out in the snow.

I initially wanted green curry, and so I ordered the green curry prawn as it was the only green curry on their menu. Yes I am AWARE that its NOT a Thai place, but that was the only thing slightly Thai-ish on Edmonton Trail at that time, arright?!?!?? ANYWAY I also ordered the spicy peanut duck curry because every damn word in the name of that dish just sounded so damn good. Spicy+peanut+duck+curry=awesomeness. 

Anyway, the food came pretty much within 10 mins of me ordering and I DUG IN. The green curry was nothing remotely phenomenal. No coconut milk in there. Jeez. I wanted comfort food, did I not mention this to the cook?

The 'Spicy+peanut+duck+curry=awesomeness' was DELICIOUS. Their portions were huge, so I took some home and brought it for lunch today. And even after it was reheated in a microwave, it still enveloped my heart with a warm tasty hug.

So kids, dont forget. If you head to Spicy Hut, all you need to say to them are 'Spicy Peanut Duck Curry'.


Disclaimer: I dont know if there are other equally delicious items on their menu, so do try other items. They may not be as awesome, thats all.
 

P.S. I give this place a 3.5 star"}
{"text":"My go-to for Asian take-out :) I'm addicted to the duck curry and coconut rice."}
{"text":"Love Spicy Hut. Always try to \"forget\" my lunch so I can head there. Soup and salt and pepper squid is my fav!"}
{"text":"average ambiance, loved the food. 

had the Thai Noodle Soup and Pad Thai Noodles and it was great. would love to visit this place again and highly recommend to friends."}
{"text":"I loved the service.  I ordered delivery and they said 45 minutes.  When I responded that was a long wait, they said they would try to be faster and delivered in 15 or 20 minutes.  I had the ginger beef as recommended by another reviewer - with the sauce on the side.  It was delicious and the beef chunks were reasonable quality, no gristle or fat and were really crispy.  The spicy sweet and sour vegetables were pretty good with lots of sauce and the coconut rice was not too flavorful, which didn't overpower the other items.  I liked being able to mix thai with chinese dishes.  The wonton soup was a bit bland but the wontons and veggies weren't overcooked.  Nice job Spicy Hut!"}
{"text":"\"Yay! I'm a fan.\" might be an understatement. I am such a fan of Spicy Hut and their saucerific ways. They're the legit version of Chinese/Thai takeaway. Value for the money, and more importantly FLAVOUR for the money. The food is so good, all the way from their Calgary takeaway classics like Ginger Beef, to this insanely tasty Thai peanut Tiger Prawns I had last time around. 

For take-away, Spicy Hut is an easy 5-Stars with me. Don't wreck your epic dirty late night take-away experience for the sake of dining in. I'm glad they allow kids, but being stuck inbetween multiple families with children working on their 80's hair metal scream singing and drumming making use of their plates as as drum kits and silverware drum sticks kind of killed it a bit. It's all understandable and out of their control of course. But, with an almost entirely empty restaurant, did they really need to seat us within chair bumping distance of screaming toddlers?

Part way through the evening, one of the ladies working there decided right then would be the perfect time to vaccuum the floor. I'm not sure why it couldn't have waited until closing, but maybe I should have thought of picking up my feet for the vaccuum as some sort of fun between courses game. 

I love the food here. Although next time I'm going to bring it back to my house..."}
{"text":"Trying to find a place to eat at late Sunday night. surprisingly still open. Food in good portion!"}
{"text":"I originally was headed for some Vietnamese Food, but the place I wanted to go to was closed. Spicy Hut was in the area and I had not been there in some time, so it was my second choice. The Spicy Hut calls itself Peking & Thai Cuisine Restaurant, I call it just some great tasting food. Their dish called Swimming Rama, which is made with chicken on a bed of fresh spinach with a spicy peanut and coconut sauce is so simple yet it so full of flavor. Their Ginger Squid was cooked to perfection and comes as spicy as what you ask for. Their stuffed chicken wings were greatly appreciated by my wife and son. Honestly, we all had such an enjoyable meal that I wonder why I had not been back sooner. I have to say that the service was also excellent on what turned out to be a busy Sunday evening."}
{"text":"Everybody has their comfort food - donuts, hohos, ice cream... Mine is greasy westernized \"chinese\" food. And Spicy Hut definitely delivers!! 

Okay, okay, bad jokes aside, Spicy Hut is definitely one of my favourite delivery options in Calgary. They are fast, delicious, and the food arrives piping hot to your door. It is best enjoyed in pajamas - I guarantee it.

Spicy Hut is actually slightly bipolar food-wise: you have some fairly authentic and very spicy Thai food to go along with the greasy cantonese-inspired sweet and flavourful Chinese food. This is actually more awesome as it increases my ordering options and allows sampling of such delicious items as their coconut rice, curries and spring rolls. The \"chinese\" food is much sweeter and greasier - their ginger beef is a delicious spin on the Calgary classic that delivers well because of they seperate the sauce from the beef. I love their fried thick noodle with meat - it offers a very shanghai style noodle with a delicious and garlicky sauce. Yum. Their shrimp toast is literally fried toast with shrimps - a greasy, shrimpy heart attack in a dish that I love when I'm feeling down.

Not everything is as good, unfortunately. Their salt and pepper squid is usually undercooked and overly bready. There are better places to get some. 

I've only been to the restaurant itself a few times. It is a little hole-in-the-wall on Edmonton Trail across the river. I couldn't eyeball how many people it could seat, but it is probably a fair amount. The atmosphere is like most of the divey chinese restaurants in Calgary with plastic tableclothes and the like. Much better ambiance can be had in some of the classier joints downtown. The service was fine, but I'd prefer to enjoy my comfort food in the schlubby enjoyment of my own home."}
{"text":"We did take out, insanely good, but not great!  They need to work on their ginger beef.  For Calgary they do a great job for greasy Chinese, everything shined.    I've had better, may or may not go back, depends on how hung over I am."}
{"text":"This appears to be a dissenting opinion here, but I was truly unimpressed with this place.  I'll concur with the others that the dishes were plentiful, well priced, and even flavorful, but the problem was the quality of the principal ingredients.  The chicken (all leg meat) and beef were very fatty, the seafood was withered and dry, and the vegetables were stale and wilted.  

The operational strategy of this restaurant (and of many such establishments) appears to be to buy inexpensive, second-rate ingredients, and mask their inherent unpalatability with a generous amount of oil and very (almost overly) flavorful sauces.  I much prefer quality ingredients, lightly and simply prepared, so Spicy Hut didn't do it for me."}
{"text":"We ordered the pad thai and the quick vegetable stir fry dish. 

Service was quick - food ready within minutes. The portion size was huge! We had enough for 2 meals for 2 people! 

We were pleased with how tasty our order was. Pad thai has a slight kick to it with spice.  The quick stir fry vegetable dish was made of crunchy vegetables and was my favorite of the two. Instantly a fan of a place that can make vegetables taste that good! 

For the price we paid, quality of food, fast, great, and friendly service  - it was a win on all levels!  We highly recommend it and will definitely return."}
{"text":"Lots of food, great price and great food.  This is NOT fine dining.  This will fill your belly and give you a pleasant warm glow for an appropriate amount of time after eating.  It's not overly hot, but if they say it is spicy (indicated clearly on the menu) you'll definitely taste it.

This is my version of comfort food."}
{"text":"Deeeeeeeelicious!!!! I can't believe I haven't reviewed Spicy Hut because it is hands down my favourite Chinese take out restaurant in Calgary. 

The ginger beef/chicken comes with the ginger sauce separate from the meat, so it's never soggy. Just crispy yummyness, that I can't get enough of. The cashew chicken with bean sauce is also magical. 

Delivery can sometimes take over an hour, but I'm pretty sure I recall them also saying they deliver any where in the city- but I could have made that up. Overall- amazing- consistently. Doooo it."}
{"text":"I'll take that to go please. Actually, it's cold outside, I think I'll take that as delivery please!

The roomie and I were both feeling the urge to eat out, but we were already comfortably settled in for the evening. Do we cook? Nay. We order in! But from where? Roomie reminded me that there might be a website or app or something that could help us find something good in our neighbourhood, but my phone and computer were in the basement... and as I mentioned, I was comfortably settled in for the evening. Thank goodness she had the motivation to head up the stairs and fetch her computer. Soon after, she was looking up menu options for Spicy Hut.

We don't often eat the same foods (for the record, she's pickier than I). Thankfully, Spicy Hut had a combination of Thai and Chinese food to satisfy us both. I was really craving ginger beef. And if there's coconut rice to be had, I'll be devouring that over regular any day. Not roomie. She's a regular rice kinda gal. I figured I should probably throw some veggies in there too, the four treasure vegetable sounded like a decent enough option.

My share came to about $25 and I had enough for 3 meals worth of food... that is, I would've had enough for 3 meals worth of food had I not been craving ginger beef and eaten the entire container. The ginger beef here isn't super saucy. It came breaded and fried as any good ginger beef should, but then then ginger sauce was in a separate container. And it wasn't the sticky thicker sauce you might be used to, it was super liquidy. Made for good dipping of each ginger beef piece into the sauce though.

Four treasure veggies were like a stir fry of just veggies like broccoli, baby corns, etc. and the coconut rice was pretty standard.

Delivery time, I think we waited about 40 minutes for our food. 

Would I do delivery again? Yeah I would!"}
{"text":"3.5*

Hahah. This place makes me laugh.
To me it's not Thai... it's Chinese with Thai dishes ... and feels like it belongs in a small town?!! :)  so maybe a western flare?! lol.  Yea, it's also a hole-in-the-wall but nothing wrong with that.
Place doesn't seem the most 'clean' and to me feels very Chinese restaurant in the 80s or 90s haha.... especially with the glass table tops over the plasticated table clothes ;)

Large portions.
Good flavours
and... you can get it SPICY!!!"}
{"text":"A hole-in-the-wall with amazing service and food, to summarize! Their proportions are fulfilling and is a great place to eat with a group of people (10+). I would recommend to order dishes, multiply it by 2 for the whole table and share amongst yourselves as it offers great proportions and great deal. Since the name of the restaurant is Spicy Hut, they are more than willing to accommodate for those who do not have the tongue for spicy foods. Service is fast and they willing to offer you discounts!"}
{"text":"I really like yelp's translation of 3-starts \"A-OK\" because that sums this place up nicely. 

I love takeout, Westernized Chinese food as much as anyone else. Therefore, I'm not judging this place on its authenticity but rather how it stands up to other take-out places I have been to in the city, and to be honest, it's just average. 

They have your traditional Chinese-style menu with a few Thai-inspired dishes (ie pad thai). The restaurant itself is a bit of a hole in the wall (though with tons of space) and fairly unremarkable. There is a parking lot next door and plenty of street parking around the corner. 

I actually have delayed my review for a while because I wanted to make sure I have tried this place enough times to give it a fair shake. The number of positive reviews made me think that I was missing something, and I can now safely say that I'm ont. I have tried to ginger chicken & beef, the tofu, the fried rice, the pad thai, and a couple of appetizers. All of them were decent but nothing to write home about. I got pineapple fried rice with shrimp which had more imitation crab meat that pineapple or shrimp. The ginger beef/chicken was over fried and under sauced. The appetizers were good but oily. 

Also, you're going to walk out of here paying about $15-$20 per person for dinner which I think is a little too much considering the quality of the food. There are numerous other take-out places on 16th Ave that are much better and not very far away. Therefore, if you live near by and really want some Chinese this is a decent option, but I wouldn't drive for it."}
{"text":"Don't overlook this place because it looks like a hole in the wall. Give it a try! 

First of all, a nice bonus about Spicy Hut is that they serve both Peking Chinese and Thai food. Starting off with the Chinese food, it is very good. One of my favourites is the salt and pepper squid. It has good crunch and the batter is not too thick and oily. Probably the 2nd best in the city. The pineapple seafood fried rice is also amazing. 

The Thai food is decent here too. The curries are rich and full of flavour. My favourites are the musamun beef curry, swimming Rama (chicken and spinach in a peanut coconut curry), and the panang duck curry. They always pack a punch. 

One of my favourite selling features of this place is if you get take out. Depending on how much you spend, you can get free spring rolls, chicken fried rice, sweet and sour chicken balls, or a combination of them."}
{"text":"Amazing food!! Spice is one point, and portion size is huge!! Great value for your $$ and food is always superb! I absolutely love their pad thai!!! 
Free parking beside the restaurant which is very convenient. 
The restaurant itself is nothing to write home about, but the food is so good it doesn't matter. We have also never waited to get a seat as a lot of people do pick up/ takeout. 
Great place for bigger parties- they can put a number of tables together and it works like a charm. 
One of YYC's best kept secrets!!!"}
{"text":"I always drive past Spicy Hut but never go in because from the outside it looks kinda rough - tonight we decided to go in.
SO GOOD! 
we arrived around 7 and there was lots of room (it filled up as we were sitting there) Service was quick & friendly - food was amazing. we ordered coconut rice, a spicy vegetarian curry, and pad Thai with shrimp. we ate until we were full, and had lots to pack up & take home.
we will definitely be back.
(we ordered Thai steamed dumplings too, but the server forgot and we never got them - which was actually a good thing because we had more than enough food!)"}
