{"text":"I ate at Spoonz for the first time today and had such a wonderful experience! First of all, the woman running the register, Emily, was extremely helpful and personable. I ordered the Atlantica Wrap and it was amazing! The dressing was so good, I would take home a gallon and eat it with a spoon. (No pun intended.) I could also tell that the people in line in front of me were regular customers and I can definitely see why! With customer service like that and food so scrumptious, I would be there every day if I worked closer!"}
{"text":"If you like bugs  in your  salad then go ahead & eat here. Manager didn't even care or seemed surprised when it was given returned. Just straight  nasty. Go eat somewhere else. Don't let it fool you."}
{"text":"Cute place! Fresh cookies cakes and other baked goods! Good place for a quick yet delicious lunch! They cater too!"}
{"text":"This was okay.  I ordered a salad and it was fresh and tasty, so not much to complain about I guess, but it was nothing exceptional and a bit pricey.  Their menu was not very extensive."}
{"text":"I love this place--go there regularly for lunch. It's pretty small, so be prepared to take it to go if there are no tables available. You'll always see the same staff, and they are friendly and accommodating. Their homemade potato \"chips\" are delicious, and you can always count on the rest of the menu for a solid, tasty meal. If you dare to look at their baked goods counter, it'll be impossible to say no. But you'll be rewarded with a made-from-scratch treat that, in my experience, never tastes like the over-sweetened, too-rich desserts you find at many establishments."}
{"text":"The food is OK, but the service is bad! I consistently went to this place for several months because it is in my office building, but the staff never acknowledges that you look familiar or that you order the same thing everytime. If you expect to be greeted with a happy face and a \"Good morning\" go somewhere else. They all look like they hate their job (including the owner) and that really puts a dampers on a persons day. I have heard other people say the same thing. The reason they are rarely busy is because they aren't friendly. Also you always walk out of there smelling like a deep fryer. So by all mean go to one of the other locally owned coffee shops nearby. I wouldn't be sad to see this place go."}
{"text":"Love those guys, always makes you feel welcome. Small place in the downtown area, which is perfect. Their food is good, like really better than you think of this small place. Yummy sandwiches."}
{"text":"Want Fresh, Fast, and Friendly?  Hmm, this is not the place!  I have tried several menu items, like others, wanting to find something good here since I work so close but nothing has hit the mark.  The coffee is just okay, but for the same price as Starbucks, no, would rather wait in a Starbucks line.  The salads are big but didn't taste fresh and the desserts, well, I went in today to order one and told the owner I could not decide.  After literally 20 seconds she turned and walked away.  There was no one else in the place....AWKWARD!  Ok, so I just walked out.  Even the baristas at Starbucks will give a recommendation or talk to you no matter how crowded but just thought that was so rude so I was outta there!"}
{"text":"This is my go to spot for my breakfast bagels and scones. The service is awesome, they are so friendly and give great customer service. Their scones are the best I've had, so moist and delicious. There lunch is also delicious. I haven't had anything there that i didn't like. Go in and check them out!"}
{"text":"I was in downtown Phoenix for a meeting, and decided to try this place for lunch.  I ordered the Harvest Salad without chicken.  The ordering process was fairly simple.  I was with three other people and luckily we were the first to order.  After we ordered 20 people came in and ordered.  Our food took quite a long time considering they are a simple salad/sandwich/soup place."}
{"text":"I've been disappointed in the past but they've figured it out!! :) Over the past few months I have been visiting Spoonz for convenience (they are in my building and I usually take food to go). I'm still ordering the Scottsdale sandwich and the sweet potato fries and both have been consistently delicious! Now, it's convenient and crave-worthy! Today they were super busy but friendly and efficient and my sandwich and fries still hot and delicious so I was moved to update my review. Well done and thank you!!"}
{"text":"Been grabbing lunch at Spoonz for a while now.  Very convenient being across the street from my office and the Cobb salad is always tasty.  But I'm wondering about the change in staff.  About a month or so ago, suddenly there was only 1 person still working there that I had seen on past visits.  Everyone else was different.  It's like they swept everyone out except that one woman, and replaced them all with new people.  I'll be honest, nothing against the new folks, but I miss the old crew.  Picked up my usual cobb salad today and no hard boiled egg.  And it seems to be smaller than usual, of I should say, not as full.  Lots of onion on it though, which is fine with me as I like onion, but I'm sure other would think it was too much.  I'm sure I'll be back, but just not quite the same."}
{"text":"I got to new employee training super early today. I asked for a coffee recommendation. I was told this place has the Best Coffee close by. I would say absolutely. The staff was friendly. Even met a couple regulars. I did try to gift him my coffee for the punch card but sadly they couldn't. I will certainly get coffee there again if I am at that facility again."}
{"text":"Late lunch needed a quick bite and we popped into the first place we came to, SpoonZ Cafe. Outstanding panini, Scottsdale, and fantastic home made chips - not a soft one in the whole bag. Staff was pleasant and food was prepared quickly and with no fuss."}
{"text":"Huge shout out to the morning crew here who always remembers my name and treats me like family. This is my go-to spot for my morning iced coffee. I love their cranberry muffins and bagel breakfast sandwiches too. It's right outside of my office building which doesn't hurt."}
{"text":"Food taste good but the girls there are rude and the cream for the coffee is always nasty and warm! I don't recommend spending your money here."}
{"text":"I was surprised to see the old Silver Spoon crew (previously inside the Hotel San Carlos) pop up in a new location.  The building signage is easy to miss but I was happy to see they provide a small space for outdoor dining.  The space is small so I think they'd struggle with a crowd given that the line in waiting is already wrapping through the tables in the dining area.  It is very clean with new deco and cute menus overhead.  The front-line assembly sandwich makers wear black chef's coats making them appear very professional.  You order then they call your name when the order is ready.  Service was speedy. $6.50-$7 for a lunch time sandwich is a little steep given the average quality of the products.  Meat, cheese and bread were fresh but mediocre quality at best.  I had turkey with provolone on rye.  The tomato & lettuce were weak so I scraped them off.  The major downfall was they smeared my sandwich w mayo when I ordered mustard.  I'm sure this happened bc the gal taking my order was too busy trying to help her co-worker pronounce another customer's name.  I wonder if there's a better method than \"yelling names\". On the bright side, the menu offers some smart recipes including portobello mushrooms filled with sausage, spinach and more. Some of my old favorites from Silver Spoon were carried over.  They have bottled drink options including sparkling water & a case full of cookies and cupcakes so it may be worth another visit."}
{"text":"Excellent service! Great food with reasonable prices. The tropical twister smoothie is DELICIOUS!"}
{"text":"I had not been to this place in a while and on my return to this business today reminded me why. The food is really good, but the customer service is the worst. If I'm choosing to spend my money at your place of business, you should a least try to act like you appreciate my business. Each time I've gone into this place, the person taking my order seems to not really want to be there. Very unfriendly. Once you place your order, it takes forever to get your order. I understand they get busy, but come on. Then when you pick up your order, the person giving you the order also seems unhappy to be there. Don't take your unhappiness out on your customers. A smile goes a long way. It's because of some of us who still choose to patronize your place of business that you are still there. I don't think I'll be back."}
{"text":"Good fresh ingredients. Reasonably prompt service. I enjoyed the sweet potato fries but a friend thought they were too salty. I had the Cabana panini and particularly enjoyed the tomato relish. The pastries look delicious but they'll have to wait for another visit.  Would definitely return."}
{"text":"My first time here. Only gave it 4 stars for that reason. I liked what I had, clean and nice in the heart of downtown Phoenix. Not pretentious, just good food at reasonable prices. Can't wait to try a panini next time."}
{"text":"The food is okay. I've had the breakfast sandwich on a bagel, for $4. I've also tried the Athena Salad with chicken for $12 with a drink. The bottom line is the food is just okay and does not correlate to the higher prices they are charging. I would have rather spent my money elsewhere."}
{"text":"Simply the best sweet potato fries I ever had! Great tuna melt (panini).  Would def go again."}
{"text":"My go to spot! Love the bagels (NY style, amazing) breakfast sandwiches, soup and paninis! Their bakery and coffee is also yummy! Quality seems to be good, and prices aren't too bad. The ladies and 1 gentlemen that currently work there are nice every time I come in! I highly recommend this place!"}
{"text":"Their dark roast coffee and a biscotti are the perfect combo.  I don't know if their biscotti is especially good or if I have just never appreciated it before.  Either way it is not to miss."}
{"text":"Really great place to grab a bite. Nice warm and cozy. Good place to get into intimate with someone."}
{"text":"Randomly came across SpoonZ Cafe was i wandered through downtown Phoenix during my lunch break.  Had a craving for a salad when I noticed this place.    The selection was pretty diverse so it definitely sparked my interest.  The prices ranged from around 6 -12 bucks for a wide variety of salads.  I ordered the sicilian w/ chicken which was around 9 bucks.    When the salad was ready I gasped.  It was huge, maybe the biggest salad I had ever seen.  After a few bites, I was hooked.  Great flavor, lots of chicken and veggies along with a tasty vinaigrette dressing.   I couldn't even get through half before feeling like I was going to explode.    Check this place out, good salads and you get a ton!"}
{"text":"I stopped here on my way to Sedona. The staff was friendly, the coffee was great. I had the breakfast burrito, you can't go wrong. Price was great, portions were perfect.  I will definitely stop by on my way back through."}
{"text":"This place was ok. I was initially excited because they had a large variety of sandwich and salad options, including customized options, so I knew that as a picky eater it would be a good place. I opted for the Caesar salad wrap with avocado instead of chicken. The woman at the register was super friendly and helpful in helping me with the edits. The wrap itself was surprisingly large, but a total mess. The tortilla had been ripped apart in a couple places and wasn't wrapped very tight. While I loved the dressing and the romaine was pretty crunchy, the tomatoes and avocado I had added were soft and soggy. The pickle that came with the sandwich was missing its characteristic crunch. Overall, if I was downtown again, I would probably try somewhere else nearby. But I would definitely go here over the subway around the corner."}
{"text":"They are excellent. The service is great and the staff is very nice and friendly. Their breakfast options are one of the best in town. I will definitely be returning in the future."}
{"text":"I was very excited to try Spoonz but unfortunately I did not enjoy the food I ate. I ordered the half sandwich and cup of soup, and was disappointed with both. I ordered a Blt sandwich and the lettuce, and bacon were really soggy. I wasn't sure what type of soup I had, but the main ingredients were beans and ham. The soup was decent but the beans seemed a little uncooked. I'll give them the benefit of the doubt and try them again, but my first experience here left me dissatisfied.  Edit: I will admit I love the customer service at this cafe, after my first review, someone from Spoonz reached out to me and thanked me for my feedback and apologized  which meant a lot to me. I am glad I went and tried their food again, this time I had their ham and cheese bagel sandwich which was great. The staff is also super helpful and  gave great recommendations on what to select off the menu. I recommend giving this cafe a try!"}
{"text":"Huge shoutout to the wonderful staff members! This café can get crazy busy at times but they work so hard to get everyone's orders quickly into the customer's hands!  This is my go to on the go breakfast stop! I love their breakfast bagel sandwiches and their iced coffee. It's in the same building where I work so its very convenient for breakfast and lunch!  They have wonderful bakery pastries to choose from and many different lunch options!"}
{"text":"I can not begin to express how much I LOVE Spoonz Cafe. I am greeted every time I enter the shop and have only received great customer service. Where the gold is, is the soups. It changes daily and they're amazing. I have tried about 10 different soups and not one has been a miss. The coffee is average but where it lacks, the pastries and treats make it up. The online ordering is convenient and your food is waiting when you arrive to pick it up."}
{"text":"I just went to this place today to get a breakfast & lunch that I was hardy enough to hold me off until dinner. I got a breakfast burrito, yogurt parfait & fresh squeezed OJ and was impressed at the quality and freshness for the price. I am definitely full with food for later too.   They were very nice and speedy. I will definitely be going back to this little gem."}
{"text":"Got a coffee and breakfast burrito. They prepared it right in front of me, can't get any fresher than that. Food was very good. Got a medium roast coffee as I prefer a good Columbian coffee and this was very good not bitter like the French roast that everyone serves for their dark."}
{"text":"I stopped here with my daughters while waiting for an appointment downtown. I hate giving low reviews to anyone, but the food here was really really bad. Zero flavor and soggy.  I ordered a veggie sandwich, but it had pieces of tuna or some kind of meat in it. The bread was soggy, too. The sweet potato fries that I ordered were ice cold and bendy.   The fruit cup that my toddler ate was slimy and past due tasting.   My teenage daughter had a salad that she couldn't finish because it was soggy and bland and trust me, this kid has a stomach of steel and can eat anything!  The place was packed, which surprised me, but our experience could have been better. I basically spent 30$+ and threw out all of our food and went to grab snacks elsewhere before our appointment."}
{"text":"I came to Spoonz with some classmates and without expectations. However, I was very disappointed. The atmosphere, service and prices were mediocre. I can live with mediocre, but I cannot live with disgusting over-priced food... which is exactly what Spoonz is.  If you want to spend your good money on terrible food then I highly recommend Spoonz, however I do not plan on returning."}
{"text":"I love SPOONZ.  I go there several times per week and always get the same personally crafted tuna salad.  The prices are reasonable.  The sweets in the display are beautifully made right there on site by a pastry chef who trained in Europe.  The food is fresh, fast and tasty.  The service is no nonsense which I like.  Give SPOONZ a chance if you're ever downtown."}
{"text":"4/5 dangerous sweets.   oh my. sugar. bars. yum. i'm glad i can only get this when i'm in town for business, otherwise i'd have to get pants in new sizes."}
{"text":"Over-priced, mediocre sandwiches and boring coffee. They wouldn't make breakfast after 10 even though they cook it fresh. Is it against some kind of regulation to grab an egg out of the fridge?  If you love this place you haven't really been around. There are much better choices within walking distance."}
{"text":"My fave stop for coffee and a pastry. I work down the street and my coworkers and I regularly make a 9am coffee run to this place. Always friendly staff, delicious and soft cookies,muffins, pastries galore. They have much better prices than Starbucks and their coffee is supreme. I couldn't recommend this place enough, I bring all our new employees here and they keep going back!"}
{"text":"Love me some SpoonZ!  My co workers constantly make fun of me because I am here on the daily.  You can't go wrong! Huge fan of the Scottsdale panini and their iced coffee gets me through the day! The staff is also very friendly."}
{"text":"Excellent food and great customer service! My favorite is their bacon breakfast sandwich on sourdough - tasty and filling.  We have used them in the past for lunch catering and have never been disappointed.  Would recommend!"}
{"text":"Spoonz. I love everything I have ever gotten here. Staff is usually friendly. Food and drinks are great.   This morning was rough though. My drink was filled two inches from the top. When you are overly excited about getting a delicious hot beverage and then it is missing that much....Heartbreaking."}
{"text":"Came in quick for a pastry. Ordered a cinnamon roll and the owner said \"no\". She did not laugh or anything just stood there and said no. Extremely rude customer service. But they do have good brownies."}
{"text":"They have amazing cookies!!  I also am a huge fan of their bagel sandwiches.  I would recommend this cafe!"}
{"text":"I'm sure I will be losing my Duchess status of Spoonz soon.  I have been going less and less over the last couple months, and they are housed on the lobby level of my building.  The service has been just ok since Vita left.  The owner (female) is really unpleasant and doesn't seem to be happy about being there.  The Scottsdale panini is decent, although the quality of the chicken seems a little lowered recently.  The owner (male) once told my coworker and I  that they cook the meat offsite and simply heat it back up at Spoonz.  Something about not having a proper oven/grill?   An ex employee of Spoonz was an incredible pastry chef and made amazing desserts.  Not sure how the treats are now, as I'm skeptical there's a bunch of \"boxed\" desserts.  For coffee, I'd rather walk a few hundred yards more for Starbucks.  Wow, this review really is quite negative.  Spoonz is good when you're in a pinch downtown.  I doubt people are going too far out of their way to come here."}
{"text":"Been here twice so far and had great food and friendly & fast service. They definitely try hard to make you feel like a regular and call you by name. I also really like the dipping sauce they serve with their fries. I do wish there was a tad more meat on the sandwiches though."}
{"text":"Been here three times now, enough to get a feel for the place's food.  I've had the Tuscani Panini, Scottsdale Panini, sweet potato fries, and raspberry Italian soda. First visit with the Tuscani, I did not enjoy the bread...had an aftertaste.  Everything inside was fresh, and the flavors came together nicely - Honey baked ham, Genoa salami, provolone, tomato, basil pesto.  Also had the Italian soda that time, friggin delicious. Went back the second time just for another Italian soda. Today was the third visit and a Scottdale Panini - Grilled chicken, bacon, swiss, avocado, dijonnaise served on focaccia.  Perfect.  Everything about it was on point.  Fresh, well put together, nicely pressed, and all the flavors were a team. I see some people really like the customer service.  I have not experienced anything out of the ordinary. The place is small, and seating is awkward.  Unless you squeeze into a corner, you're sitting right where everyone is standing around in line. Prices are decent.  Downtown. A co-worker gets the cobb salad often and it is quite huge...not something I'd finish in one sitting.  Paninis are decent size, although i usually finish both halves. Take a look at their online menu and find something you like, or make your own salad, panini, sandwich or wrap. Recommended."}
{"text":"Great customer service, diverse menu, and locally roasted coffee. What more could you ask for?"}
{"text":"This place is overpriced.  Almost $14 for a cobb salad.  Several times the chicken they added smelled like fish.  I won't be back.  What a rip-off."}
{"text":"Over 10 years I've patronized Spoonz or its predecessor Silver Spoon Cafe.  Gary and Denise do a nice job of delivering great food at a reasonable price.    The iced coffee is the best around.  A much better alternative for morning coffee and a bagel, or scone or pastry than Starbucks.  The staff is very knowledgeable in making coffee drinks.  The coffee is the highest quality.   Much care is taken in hiring and training the very friendly and responsive staff.  You can't go wrong here.  Gary and Denise have put their all into this business and it shows.  Oh and their cupcakes and seasonal treats are da bomb.  Best way to cheer myself up when I'm having a bad day or for gifting to coworkers and friends. It's apparent that the bakery case is filled with homemade treats."}
{"text":"Love this place! Not only is the food fantastic, the staff is super friendly and professional. My favorite things are the breakfast quiche, Scottsdale Panini, homemade chips, and sweet potato fries. As soon as I walk in they remember my name and what I usually get - even though I don't go there that often and they're always busy."}
{"text":"Grilled salmon (Atlantica) wrap - good taste high protein without being heavy. Well done."}
{"text":"Tried this place for the first time yesterday. I have passed by it everyday for 3 months, but I'm not into cafe foods, I decided I'd give it a try anyway. I will be coming here very often from now on. The service was amazing, the Scottsdale panini was so delicious, the bread was so soft and delicious, and best of all, the latte was sooooo good. I've been trying to find a good coffee place, cuz I don't like Starbucks, and I haven't found any Dutch bros or Dunkin' Donuts in the area, but their lattes rank right up there with them. Sooo good, I'm happy I tried this place out, can't wait to go again."}
{"text":"Average cofee. Local vendor for cofee, no doubt; but they don't know how to make a good cup of joe. Sandwich was average. About the only thing that was good was the pastery I ordered. I was not impresseed and would return eventually for another pastery if I hadn't herd who I awesume is the owner speaking to her employees. She was beyond rude and hurtful to them. I will not return to this place All because of that aweful lady owner."}
{"text":"I always love Spoonz, at either location! They have great food and good service any time we stop by for lunch. I've also used them to cater large events and they are great!"}
{"text":"Quick and Delicious.   First-timer.  Tried the Caprese Panini and loved it.   Easy location for those working downtown.  Good food, great prices."}
{"text":"I had a pretty bad experience.  My sandwich was soggy and had no flavor.  Half of it stuck to the paper it was wrapped in.    I had to throw it away."}
{"text":"I would give this place at least 3.5 stars but they are a sold 3, not convinced they are ready for me to round up to a 4 just yet.   As I leave my office for my typically late (130-2p) lunch, I decided I was craving a sandwich, after seeing the latest @sammich_es post on twitter. Knowing I would be hard pressed to get a true \"sammich\"around here I began my journey.   I had promised to give the Gyro at Coney Island another shot (they offer a $7.55 meal deal, hard to beat).  But I had also seen that this place [Spoonz] had opened up relatively recently and I am always one to try something new and spread my \"wealth\" around.   They have a few tables outside, which is nice because for the most part this section of the street is shaded during the heat of the day.  I walked inside and positioned myself to the right side of the counter to see what they offered.   Their menu is simple but with a good variety, coffee drinks, teas, sandwiches, soupsand salads.  You can order one of their sandwich or salad creations or design your own from a list of options.  They also had a thick quiche in the fridge case and some yummy looking pastries.   Finally deciding on the Country ham panini with ginger mango chutney, tomato and swiss on multi grain bread, $6.95 plus tax, no chips...are they extra? I grabbed a seat in the colorful, relatively small diner and waited.    It didn't take long. I picked up my sandwich.  It was toasted, and generously filled with ham and the mango chutney was just right and complemented the ham quite well. I don't recall tomato and the cheese was one thin slice relative to the amount of ham.  But hey I guess I don't really need much more cheese than that anyway.    The service was no frills, no hello's upon entry, no \"Dolores your order's ready.\", even though they took my name, but they did say Thank you as I grabbed a menu and left, that counts."}
{"text":"I've been here twice and each time the food was really good!  They had some really good iced and blended coffees and its quite cozy. I definitely recommend coming here if you want a breakfast or brunch sandwich"}
{"text":"Kind of hard to find. Definitely not much seating. But the food is amazing! That's what matters most, right? The service when I was there was really good too. This is a great place to eat!"}
{"text":"One of my favorite places. I've been working across the street from here for about a year now and only in the recent months have I been coming, I wish I would have known about it when I started living downtown because their salads are fantastic.   I'm an ASU student and would go to Bowl of Greens on campus for a quick mediocre salad... and it just got boring. Here, I build my own salad with their lemon-oregano vinaigrette dressing and it is AMAZING. Such a good flavor and their pastries never disappoint.   I've had the bagel egg, bacon and cheese sandwich: delicious.  My usual coffee order is a latte, and they get it right every time.  Sweet potato fries: YUM. (get the chipotle sauce, so good!) I make my own salad with cucumber, croutons, roasted corn, carrots, chicken and grated parmesan... SO YUMMY.    the prices are great, the staff is friendly and their service is quick! I love this place!"}
