{"text":"I absolutely love this place! There used to be a location closer to my office and it closed down. Not sure why because it was always packed and the food was AMAZING! I still crave their delicious, fresh and unique sandwiches and try to make it out to this location when I can. It's a shame they aren't open on weekends because I think they would fair very well!"}
{"text":"I can vouch that the ingredients are fresh, but the flavours are definitely lacking. I ordered the oven roasted turkey and roasted red peppers pressed sandwich. Both the turkey and roasted red peppers were flavourless and the artichoke spread in the sandwich tasted like plain Mayo. Also, the rosemary foccacia bread had no traces of rosemary. They should just shorten the menu item to \"Turkey and Red Peppers: Focaccia bread, red peppers, mozzarella cheese and mayo.\" Only good thing was that there was a good amount of turkey, so I at least got my serving of protein for the day.   The menu has a unique mix of ingredients that you would't be able to get at a regular sandwich shop. However, given all the hype and interesting flavour combos on the menu, the food absolutely does not deliver."}
{"text":"Terrible first impression I was given a sandwich with red/purple coloured steak. I am very disappointed I was very much so looking forward to this sandwich. Guess no lunch for me today as I took it to go! :("}
{"text":"The restaurant is clean and has an ok amount of seating but if you come during a busier time it could be hard to find a seat. The portions of the food is amazing and really fills you up you could get either a sandwich, wrap or salad and it always comes with a side of your choice which are salad, chips or a soup. The prices are really good too for the amount of food you receive ranging from $9-10. I would recommend this place if you are looking for a cheap, healthy option. I got a grilled sandwich with a salad and it was pretty good, The sandwich was something I did not love or hate and I would probably have it again but I think the next time I come here I would want to try something else."}
{"text":"I have tried multiple of their sandwiches and have to say they give you a sense of healthy eatery. Their menu is huge and contain many types of sandwiches and salads with healthy ingredients.   I have tried their multiple sandwich and let me tell you they were all splendid. I have had:  Chicken & Basil Pesto - focaccia bread, roasted red peppers, goat cheese, basil pesto. Chicken & Roasted Artichoke Spread - multigrain bread, grilled zucchini, swiss cheese, roasted artichoke spread. Chicken & Roasted Hummus Spread - focaccia bread, avocado, havarti cheese, roasted hummus spread. Chicken & sundried Tomato pesto - multigrain bread, grilled portobello mushrooms, provolone cheese, sundried tomato pesto  These sandwiches with come with a salad or Chip and both are great. Their daily soups are reasonably priced and come in 2 sizes. They are very tasty.  All in all is a great choice to have a meal."}
{"text":"Came here yesterday for lunch and the place was bumping!! Lots of employees from the nearby offices come here for lunch, so the small area was quite packed.   As I got the panini last time and since I wasn't very hungry yesterday, I decided to go for the salad. I chose the spinach and light poppyseed dressing - though I asked to substitute with balsamic vinaigrette instead. The salad was MASSIVE - it came with baby spinach, avocado, sunflower seeds, goat cheese, mandarin oranges, and strawberries. Each leaf of baby spinach came coated in the creamy goat cheese. The cheese was very well spread around, though there were still massive chunks stuck at the bottom of the container. I was slightly disappointed as there wasn't much avocado, and there were only 5-6 pieces of strawberries and mandarin oranges. There was, however, a bunch of sunflower seeds.  Portion sizes here are huge! My colleagues ordered a wrap and panini with a side of salad - the wrap was very hefty and the diameter size was quite significant. The panini, from my memory, is also a decent size. As for my salad, I didn't end up finishing it... it was that large!  Unfortunately, no photos this time as my takeout container had all the spinach piled on top - couldn't see any of the toppings! :("}
{"text":"Discovered this place by accident last year with my girlfriend. We were heading out for Teriyaki and decided to try something different. Now we bring all our friends here and everybody loves it!  Don't let the name confuse you, as there actually are no sprouts on the menu. What you will find, are healthy salads, wraps, flat breads and sandwiches. You can choose from the standard menu (and we have not tried a dish we didn't love) or you can create your own custom meal, from a list of ingredients. They also allow substitutions, so we'll spice things up or swap out an item for a fresh change and brand new taste. We've been trying to stick to the G.I. Diet for the last few months, and almost all the dishes on the menu meet the requirements, so we're totally thrilled.  I highly recommend the Cusabi Chicken Salad, or the Chicken Artichoke Sandwich. Beware, the portions are more than generous. We'll often share a salad and a sandwich, and still have leftovers! Oh, before I forget, the Butternut Squash Soup is to die for!"}
{"text":"Oh my goodness! This is perfect! The sizing, the amount of chicken is HUGE!!!  The salad I got not only is massive but comes with a multigrain roll~ healthy~This is so yummy.  The salad is something that 2 people can share for sure.  The amount of chicken that was in my salad was WAY more than any restaurant or fast food place I have been to. The dressing is also just the way I like it; less than the usual drenched amount most places do.  They even have these yummy soups! I got Thai curry soup and it comes with rice inside of it.  Next time I'll be getting the Chipotle wrap or salad, since that tasted real good when I tried my boyfriends wrap"}
{"text":"Discovered this place today, its a short drive my office.  They offer a variety of salads and wraps.  I had a steak option with ranch, that the cashier recommended.  The salad was really large, good value for $8.50+tax.  Recommended."}
{"text":"Solid place for healthy food..  brutal hours though  I like the soups especially, all of them have been good that I've tried.  I don't love the \"grilled chicken\" or whatever they put as chicken protein on their salads or sandwiches however!  It's got a really weird \"gamey\" or \"day old\" taste and it's always ice cold.  Kind of weird.  I'm not sure if it's processed chicken strips or it's bizarrely cooked once a week and then kept in the fridge from that point on..  either way, it doesn't make any sense IMO and it definitely costs them a point or two because it's such a easy fix  LOSE THAT COLD CHICKEN!"}
{"text":"I work close to this location and it is sooo hard not to go here for lunch every day! My regular is the chicken Chipotle salad and it is fantastic! The serving size is quite huge for a salad and it is beyond worth the price! The atmosphere is clean and fresh! Take out or dine in I am never disappointed! Friends and I have also had a few of their sandwich options and they are just as good!"}
{"text":"I wish we had these in Chicago!  The Chipotle Chicken salad is so very delicious! They prepare everything to order as soon as you pay, the ingredients are fresh, and everything is tasty!  The staff are considerate and friendly and the food comes out quickly. I'm already looking forward to my next visit!"}
{"text":"Always fresh, always tasty!   Quality ingreditents make for great tasting salads, wraps and sandwiches. When you ask for turkey, you're getting actual turkey breast--not the limp deli stuff. I haven't tried something I didn't like.   I'm a regular!"}
{"text":"I would give this a weak 4*. It was a bitterly cold day & I wanted a late lunch. So I walked in. Service was instant & the cashier was pleasant enough. I ordered a Chicken Wrap & it came with a tomato leek soup (which was delicious). My issue was that the wrap had avocado in it. It's not that I dislike Avocado it's just that I'm not fond of it in a sandwich which I'm not expecting. I'd do this again but I'd be more clear on the avocado thing!"}
{"text":"This restaurant is open from 10 a.m to 4.00 p.m.  Lunch time is really busy. All the near by offices crowd is seen enjoying their lunch break. There is a sitting area too.  They have sandwiches, wraps, soups , salads and chips. They have a good variety of breads too. The sandwiches are grilled very well and that enhances the taste. We mostly order chicken artichoke sandwich with Thai chicken soup. The combo is around $10 to $12.   They are closed on weekends."}
{"text":"Went here for lunch with the work crew. Definitely one of the the best Thai curry soups I've had. The tuna + avocado sandwich was pretty good as well. Good place for a quick lunch stop"}
{"text":"Sprouts did an excellent job with a recent business lunch I conducted for 30 attendees.  All of the sandwiches I ordered were delivered on time, hot, and in an assortment that pleased the guests.  I will consider them for all future catering needs in the area."}
{"text":"This place is amazing. With large food portions, you fill up on really freshly made gourmet salads, wraps, or sandwiches. There's a lot of flavour to these and they never skimp out on the good stuff. I always get nice chunks of rotisserie chicken or tuna in my salads. The vegetables are never limp and they're always in abundence. It can be a bit slow for the line up on Fridays because they're so busy. The kitchen staff is relatively fast but with only one person manning the till, it's a bottle neck. I highly recommend the vegetarian salads. The grilled tofu one is so good... the sesame spicy dressing makes it.  I always leave filling full and like I got the best deal in the area for a lunch.  $10 gets you a great gourmet salad that's filled with great tasting fresh items."}
{"text":"Came here for a quick lunch and loved it!  All their pressed sandwiches are $9.75, and come with a side of salad or soup. To me it seemed like getting the steak with provolone cheese would be the real bang for your buck. The steak was well done so the meat was more on the tougher side but I didn't mind it too much as it was really flavorful. Went amazing with the portobello mushrooms and the cheese. Really enjoyed my sandwich. I had the tomato red pepper soup which was tasty as well."}
{"text":"The chicken chipotle wrap AND salad are incredible. Get the chips on the side with the wrap and eat them simultaneously.. great added crunch to an already crunchy wrap."}
{"text":"Sprouts has become one of our favorite restaurants in the area. We usually order to go since the dining area is very tiny. Their panini sandwiches are amazing. The quality of ingredients is top notch for the price. I usually order their steak and blue cheese panini, which comes with a spinach salad, for a little less than $10. I have tried their salmon (fillet) salad a few times and found it to be a little too overcooked. There is usually a lineup at the counter, so you know that local business people love the place."}
{"text":"Sprouts was a surprising find. I was on the hunt for a good sandwich on the go and this was definitely a place that satisfied. Sprouts offers healthy sandwiches, soups, and salads. My personal favourite is the Chicken and Hummus sandwich. Sandwiches come with kettle cooked chips or a side salad. Sandwiches are a sizeable portion and definitely worth the price point. Although a great healthy option for lunch, their food isn't bland or boring. They've got great flavour combinations and vegetarian options are also available."}
{"text":"My friend recommended Sprouts for our work lunch outing. I'm glad she did because the sandwiches there are amazing! We got the chicken and roasted hummus spread, and the chicken and sundried tomato pesto. It was about $20 for the two sandwiches with a side salad.   They are definitely busy during the lunch hours so it might be difficult getting a table. Luckily we were able to grab a table after some people left. We waited about 5-8 minutes before our orders were called. The sandwiches were amazing! We shared our sandwiches to try them both out. I loved how the bread was so hot and toasted just right. The chicken in both sandwiches were tender and not dry at all. I preferred my friend's roasted hummus sandwich over mine.   I will definitely return for some lunch during work again!"}
