{"text":"More fakeness in our bar scene, but this place has some hope. 

There are a few gastro bars in Calgary, but no one in Calgary knows what the term \"gastro bar\" means. So Paul Vickers in his, um, genius, decides to create a gastro bar concept, complete with website that describes to the visitor what a gastro pub is. It's sad that our city and its inhabitants are five years behind Canadian cities that are five years behind US cities even when it comes to slang. I also look at the menu online and see nothing cheaper than $14.50, except the $4.50 fries. Wow.

So I go in, and the place looks like an earls. The entrance has a hostess table which splits into two sections. One section is a restaurant and the other is a bar, complete with obligatory high chairs and flat screen tvs. The music is diverse and not very loud which is awesome to witness for once in this city.

We sit down and eventually get helped 10 minutes later by some earls' looking waitress. You know, high skirt, low shirt, dressed in black. She has a bit more character than a bubbly earls server so it's tolerable. To our soon-to-be-inebriated delight, we find out that happy hours include $4 domestic draft, bottles, and well drinks between 1400-1900 M-F and \"all night saturday\". I look at the bar to see what is on tap and I'm very happy to see that the bar doesn't have ANY molson on tap but good domestic and international brews, including big rock, and two types of wild rose. They also have lots of domestic bottles, including some fire hydrant one I've never heard of.

The service was slow. Consistently, we waited 7 minutes between ordering a simple well drink or domestic bottle and receiving it. The menu was just as expensive and unconvincing in person as it was online. We didn't have any food.

A true gastro bar doesn't call itself one. Doing so is just pretentious. Nor does it put such emphasis on interior aesthetic or charge $26.50 for a steak sandwich. And gastro pubs are pubs, not pub/restaurant concept. Vickers stretched himself too thin.

I'd be willing to try the food out when I return in the afternoon during happy hour to get sloshed for a reasonable price. What saves it is the liberal happy hour and the lack of a molson product agreement."}
{"text":"On the very very good side, Spur is no longer 'Wild Ginger' which, if you missed it (and I wouldn't be at all surprised if you did), was a big horrible 'cosmomegalounge' that just didn't at all work. It was too big, overpriced, empty all the time with so so food and sketchy service. 

Spur occupies half of this original space (the other half occupied by 'Italian Kitchen' next door) and tries pretty hard to be a real upscale pub with good food (a self proclaimed Gastropub as it were). 

It certainly has a number of requisite elements: 

- has a real (albeit out of a box) 'pub feel'; 
- it's often lively and full with a decent clientele; 
- You can get there completely by +15 (GOLD when it's -30C outside); and 
- the food I've had has been generally honest, simple and well done. 

Sadly, I still can't get there with 4 Stars. In part it's been the service (or lack thereof) - it shouldn't take 20 minutes to see staff, get a menu and order a pint at lunch. In part maybe it's because it's 'Earls boring' - if it were a house it would come with 'hardwood floors, stainless steel appliances and granite counter-tops' - nice, but not exactly interesting. Maybe I still feel the stabbing pain of feeling completely hosed over from back when Spur was Wild Ginger and appetizers were $20++. 

Ultimately I can't altogether put my finger on it but it's just not on my 'go to' list. I suppose I'll be back there sometime when it's just too cold to go outside to go somewhere else for lunch."}
{"text":"A group of us went out to some promo night that Spur was having this past Saturday night. I gotta say - I had one of the most fun nights I have had since moving back to Calgary. 

Music is what 'makes it or breaks it' for me and it was practically impossible to get me to leave the dance floor. With one hit blaring after the next, I was shakin' my booty like nobody's business. 

Spur is an R n' B/ Hip Hop club but what I LOVED is that they played the old-skool stuff. They weren't playing Ke$ha, Masari and Pitbull, but rather Lauryn Hill, Notorious B.I.G and Maxwell.

The crowd was mixed (which I appreciate). It wasn't all 'cliquey' and it didn't feel like any ethnicity was the majority in the place.

My only criticism is that drinks were pricey. Two double vodka crans cost us $30! Insane.

Overall though, Spur was a great night out. It was just what the doctor ordered ;)"}
{"text":"Excellent beer selection, with this outing featuring a few offerings from Phillips and Wild Rose.

However, I had the italian sandwich and it was probably the worst sandwich I have had in my entire life. I am not a picky eater by any means and I'll eat anything. But for a very expensive sandwich it was dry, with the pancetta tasting like it had gone bad. Avoid."}
{"text":"Not a bad place to head for lunch downtown. The food has improved over time. It's a little on the loud side, so can be tough if you're taking clients or trying to have a conversation over your meal."}
