{"text":"I hate to give two stars, because I really wanted to love this place. The cafe itself is gorgeous, it's right around the corner from me, and they have lots of gluten free, vegetarian options (I'm Celiac, so this is essential). Sadly, the two times I went, it didn't live up to my expectations.  My partner and I came here a few months ago and left disappointed. I was excited that I finally found a gluten free eggs benedict. I get the idea of making it gluten free by using a sweet potato instead of an english muffin, but it wasn't filling and lacked flavour (the sweet potato patty was unseasoned and dry). It came with a salad (a few pieces of iceberg lettuce with tomato) and \"fresh fruit\" that comprised of honeydew melon. My partner got the pancakes, which were okay, but we both left hungry and disappointed for the price we paid.  I decided to give them another try today when my usual brunch spot (The Beet) was full. I wanted to order one of the dishes but the server recommended I choose something else because they were out of avocado. I went for the Stadt omelette, which was decent, but lacked flavour on its own so I asked for some of the spicy hollandaise on the side (extra $2 charge). It came with fried hash browns (which were a bit dry), a salad with romaine, beets, and tomato (better than last time, but didn't taste fresh), and again \"fresh fruit\" which was a slice of melon, watermelon, and papaya.   For a restaurant that advertises to use local ingredients, I would expect fresh, local foods. In-season fruits and veggies that are flavourful. With \"The Beet\" down the street which has a larger menu with a similar branding, I feel like Stadt cafe needs to step their game up.   I'm sorry for the harsh review, but after two fairly pricy \"meh\" experiences, I felt I needed to share."}
{"text":"So blown away by the beauty... the space is full of natural light (incredible sunlight in the back area made with open joist ceiling plus open-concept kitchen), comfy upholstered plush booths to cozy up in, exposed brick, large damask textured wall tiles (from Spain!), chalkboard menus, steel and wood shelves with plants everywhere, gorgeous handmade wooden tables (by the owner), and tin-tiled ceiling painted white. The fireplace adds the warmth and the diaper-changing station in washroom (including complimentary diaper supply) adds to the family-friendly vibe. With all of this beauty surrounding you, the best part of this place is the food. We each tried something different and loved it all (favourite was the picante omelet!). An European gourmet approach with just enough greens and the most deliciously prepared fingerlings potatoes I've ever had (and I have an Irish mother who is obsessed with potatoes).  Relaxed and menu-aware staff immediately help shape a positive introduction. Being a bit of a coffee snob, I will look forward to the baristas gaining more experience (fair, they've currently been open only two weeks...).  All in all, this place is our new local go-to brunch in The Junction!"}
{"text":"Great food and drinks. We had the jerk chicken and the tacos (1 fish, one corn and one beef) and a pitcher of sangria. The food was delicious especially the jerk chicken. Service was good. We will be back!"}
{"text":"Stadt has only been open a couple of weeks so I'm sure it will get better. The interior and ambiance are well done. The staff are really nice but still getting their feet under them. The price is good for that area but the menu is all over the place. There was a long wait between appetizers and the mains but it is a new place. The tacos are OK but no where near Grand Electric. The ceviche was brutal. It came deconstructed which means it's completely not a good thing. The tajine was OK. The berries and coconut cream are good but the dessert menu is short."}
{"text":"This WAS a great restaurant!  Tonight I tried ordering through diner dash - diner dash was told they ere too busy for take out orders!  Very disappointed with that attkitude.  I am German and do not think that I will revisit. Very diasappointed with the servive.  Can't post a pic, cause I  can't get food delivered."}
{"text":"So far I've been to the Stadt Cafe three times and each time was a great experience. Their brunch menu is delicious, as is their lunch and dinner menu. The food is fresh and full of flavour and rich in ingredients. The Cobb salad with added grilled chicken is probably the best I've had. My friend raved about her Asian Slaw Salad. The service is attentive and the ambiance is exactly to my liking. Great jazz music at a volume where you can hear your dinner partner's conversation. I was also pleased to see they have a kid's menu so I will be back with my family as well. The only drawbacks would be that they take several days to respond to online reservations and they were also out of a few ingredients on their dinner menu during my last visit. These are growing pains of a new restaurant and I hope the Stadt Cafe will be a keeper in the Junction."}
{"text":"I have never been happier to change my mind! After my scathing but honest review Stadt contacted me to say they had a new chef and to come on by and they would comp me to the amount I spent last time. I didn't do quite that but did bring my mum for Fathers' Day. The food was great! It's a lovely space to begin with, and it was a bit busier for the special day. Coffee was strong. Mimosas were also strong (and large) and were $8. Mum had the frittata, jalapeno and goat cheese, and it was big enough to share. It was really good! Salad was crisp and dressed just enough and the fruit salad contained grapes and pineapple this time. I ate steak and eggs. Potatoes were salty but otherwise unremarkable (this can be a good thing at brunch). But the scrambled eggs were heavenly! Creamy soft, but not raw, and not leathery. That is not as easy to achieve as one would think. Same salad, and I love arugula so I was happy there. We left pleasantly full and pleasantly buzzed. The house hot sauce kicks ass. I wanted to ask if they sold it-so good. Staff were attentive without being obnoxious. All in all, they are living up to the potential of their menu and their space and I would gladly go there with friends, or on a date (nudge to my special friend).  Highly recommend."}
{"text":"Cute place with amazing food and great service! Will definitely be back!  Their bacon is amazing and sourced from a shop a block down!"}
{"text":"Knowing this is a new resteraunt keep in mind this place is a work in progress. I would give it a 3.5 if I could. Interestingly I was expecting the service to be not great but this was the best part as all the staff were very attentive and polite. We sat by the fireplace which was nice but more of a holding or drinks only spot. The fish tacos were not great-a little dry- and too expensive for what we got. On the other hand, I have the ramen soup which was sooo excellent. My friend had the bowl with lemongrass and ginger (if I recall correctly) and I had a taste; it was equally excellent but so very different tasting! Still hungry we ordered the cheese platter which was also very good.  I think this place is going through the normal growing pains and will soon become a great regular place in the junction."}
{"text":"This is such a great addition to the junction!  Open since February of this year, this locally sourced restaurant makes some dishes which are crave-worthy!  A multi-page drink menu starts the experience with a few drinks showcasing 'butterscotch ripple', a new favourite liquor! They have a daily special bruschetta. On this particular day it was a sweet potato base with feta. Why did it take so long for someone to blend this combination? It tastes great!  For a main, I had their 'slaw which was a huge portion! And the ginger-coconut vinaigrette was neither strong nor acidic, I would order it again in a heartbeat.   I think the highlight of the meal was the gluten-free brownie which was rich, chocolate goodness! However, my friend ordered the apple strudel which looked amazing as well!  I love how this place supports local, independent sources/farms/companies. To boot, they have plenty of gluten-free, vegetarian/vegan options. Prices are reasonable and servers are friendly.   I would definitely return in the future!"}
{"text":"I enjoyed the stadt cafe, the atmosphere is very nice and trendy. However, the eggs I had were good, but not stellar. I found it a little too salty for my taste, especially the potatoes. If they cut down on the sodium content, I would up the rating to 4 stars."}
{"text":"I totally dig Stadt Cafe and I regret only discovering it now despite it being open in my 'hood for awhile now.  We met up here for a ladies' drinks night.  Since it was Friday, the drink special was Flight Night featuring your choice of 4 beers in a flight for $8.  It was a fantastic idea since Stadt had an amazing draft menu with more than a few brews I was eager to try.  We ordered a few snacks from the menu including the fried artichokes ($11), giant pretzel ($6), Casablanca salad ($9), and wings ($15).  We also wanted the Bavarian platter featuring a selection of meats/cheeses but they were sold out for the night.    Service was very friendly and they were kind enough to let my wine snob friends sample a few of the white wines before deciding.  Stadt offers a weekend brunch which I'll be back to try for sure.  They make my list of top recommendations for the neighbourhood!"}
{"text":"Nice brunch place.  Food a tad bland...Eggs Benedict...but great ambiance and friendly staff."}
{"text":"3.5 stars to 4  Like all other reviews of Stadt, I was really taken back when I walked into the space... it's really great.  I expect this type of vibe and atmosphere on Ossington. Though Junction has it's unique vibe, this was more modern and hip than the warm and charming I'm used to seeing.  With its curated local craft beer and smaller but well thought of menu, this looked to be a good spot.  As mentioned, the space really surprised me.  It had a great balance between a nice upscale craft beer bar scene but with it's tufted velvet banquettes, exposed distressed brick walls, and nice accents... it really strongly reminded of the better spots on Ossington.  The old Edison light bulbs are a bit dated but still have that modern hipster vibe to bring the 'it' factor up.  I like the fact they had more than 3 local and craft beers on tap on display... they even had a cider too!  Those details are always eye catching to me.    The menu is great for anyone... including vegetarians and those with celeriac disease.  There are more than enough options to choose from that are not just your typical risotto or pasta with sauce.  The dishes are vivid in multiple colours to keep a vegetarian taste buds happy.  For the brunch menu, it did have everything from a few sweet offerings (french toast and pancakes) to savoury (omelettes, quiche, farmer's breakfast...).  Love the fact they can make it GF if you're preferring it.  Service here is friendly and helpful when it comes to their menu.  We got the drinks very fast and the bartender/barista knows what she's doing with it comes to the espresso based drink... yeah, call me surprised.  As for the kitchen service, I'm not sure what happened but we waited nearly 40 minutes after our drinks to get our food... it was quite a wait.  I saw that the table beside us got their food more quickly after we got ours so maybe there was a hiccup.  Either way, it was noteably slow.  Quiche of the day... crisp potatoes, swiss cheese, and mushrooms - So I think this might be the culprit to why our dishes took a long time to come out.  If it is, I wish the staff gave us a heads up.  The dish was very large... so you can share this if you're not a big appetite.  The quiche was fairly well made with nothing burnt or soggy... nice and fluffy.  I would say that the spots that didnt have the cheese on it, it ... didn't taste like much so the help of the hot sauce was mandatory.  Oh well.  There was a basic side salad and a few fruit pieces to make it a nice visual appeal and different tastes to the dish.  I wish the quiche had more flavour or spice.  3.5/5  Apple Strudel French Toast - A new contender for the top 5 French Toast of Toronto.  Our top 5 havent budged in a long time and we were happily surprised on how good this was.  I liked how they had the roasted oats to add that nuttier note and crispy texture to the tender softened apples and custardy french toast.  The addition of whip cream was over the top ... it would have been great without it but keep the indulgence.  Well done! 4.5/5  Bacon side - FYI, you only get 3 small bacon pieces for $5... just ... yeah. And they tasted fine but nothing different from a typical packaged bacon sadly.  3/5  Flat White - This was the surprise of the day... most restaurant and coffees are just ok for espresso based drinks but this one I honestly liked.  It was good!  Bold and rich in flavour and not diluted by the milk.  I didnt care for any latte art because this perked up my taste buds really nicely.  I liked it... so much that I preferred it to the flat white I had at Crema Coffee just down the street. 4/5  This place has a great chance to hit it for a 4 star so I'm hoping my return visit will do it.  For now, definitely come for the French Toast!"}
{"text":"Food was good and the venue is beautiful however the service is poor. The slaw and the sliders were my favorite."}
