{"text":"14 years in the same location...  I have lived in Ahwatukee longer than that  and I shamefully say that this was my first time at the restaurant.  What was I thinking.  Great food, defintely family owned.   Will be back!"}
{"text":"What can you say about a restaurant that you have been eating at for 12 years now. Yes, we are a family that has been going to the Star of India practically since they first opened up. My two kids, (babies when we first started going there) are addicted to the place. The owner Preet truly cares about the quality of the food and customer service. The portions are very generous, their paneer quality is absolutely unmatched in its freshness and flavor. They are willing to customize the food to your preferences.  I have eaten at many Indian restaurants both here in the valley and at other places and can truly say that Star of India is one of the best that I have ever eaten at.
Thanks Preet!!!"}
{"text":"Food was bland. Chicken Tikka Masala was flavorless. Not spicy. Samosas were cold on the inside. Naan was good."}
{"text":"This small, dark restaurant is in the Ahwatukee area, in a shopping center with a Trader Joe's, Safeway, and other stores.  It is in the corner, on the same side of the shopping center as the Trader Joe's.

We go here periodically because they have decent food, and I like the staff - very friendly.  It's nice to get some saag paneer (great texture, fluffy & creamy - try it) for take-out.  They use canola oil, which saddens me, as I like ghee (I like my saturated fats & olive oil more than certain vegetable oils).  You can get decently spicy food here (that's \"extremely HOT\" to some of you) or skip the heat entirely.  They use good spices and make good sauces.  They don't make the most awesome Indian food I have ever had, but it is good, hearty, and comforting.

It's a good place for children, if there is something on the menu yours like (and who doesn't like ras malai or rice pudding?).  It can be good for groups, but I would call ahead or make reservations (not sure if they take them).

I appreciate how they gave me decaf tea & warm water (not just \"no ice\" water, but room temperature water) when I asked.

Recommended: any of their tandoori dishes; a vegetable curry that may not be on the menu but comes as a side in one of the special dinners; saag paneer; mango lassi; their relishes.  I'm good with anything on the menu.  Try the lunch buffet."}
{"text":"This is the best Indian food restaurant I have ever been to.  I highly recommend the lunch buffett - they usually have Chicken Tikka Masala, Tandoori Chicken and some type of lamb dish that I cannot think of right now.  The Naan bread that they bring you is also amazing.  I have lived in Phoenix for over 13 years and this place is better than anywhere else.  This the place to go if you like Indian food."}
{"text":"My wife and I love Indian food. We've tried every Indian restaurant in the Ahwatukee area, and this is our favorite. When you come, remember that this place is family owned and operated; it's not a chain with five bussers and six servers running around. For that reason, service is not as quick as Chile's or Outback. 

The food is authentic, fresh, and the restaurant aims to please. The owner always comes by and greets us, and if there's anything wrong they fix it immediately. The prices are fair, not cheap or expensive. 

For best results, order a la carte expecting to share each item. A curry or two, some samosas, and a meat or veggie entree will be more than enough for a couple, and you'll come away with about a $40 bill. There's also a Groupon out there right now, $12 for $24 I believe.  

Good for: Foodees, couples looking for something different, casual meals, and a weekday night out.

Bad for: Snobs."}
{"text":"They prepared food for a work event and everyone loved everything! We had nan, rice, chicken curry, chicken marsala, saag paneer, aloo gobhi and everything was so flavorful. 
They were very nice as well and helpful. I plan to go back regularly and just relax and feel spoiled with amazing food and amazing owners. Thanks again!
Becky"}
{"text":"Just had them deliver. Very good chicken tikka, very flavorful and I love the garlic naan."}
{"text":"Five stars for the awesome food and kind / friendly service. They really cared about us having a good experience.

The place isn't too fancy, and it's a tad expensive (they kind of nickel and dime you a bit on things like naan and rice) but the food was so good that I'm still giving them 5 stars.

Nice people running the place."}
{"text":"We have been coming here for many years and it is absolutely wonderful. We have our favorites but everything we have had is great. We have also often ordered take out. I simply can't say enough good things about the food and the people that work there.
Please enjoy."}
{"text":"Nice little lunch buffet, even my young kids enjoyed it.  Price was very typical of this type of buffet.  Good variety and fresh naan, I loved the inclusion of chai.  Rice pudding was delicious, everyone had some.  I haven't tried many Indian restaurants in the valley but this was as good as my favorites in other cities."}
{"text":"I don't understand how people can like this place.  Maybe I'm spoiled from growing up with fresh Indian food daily but this is the worst Indian food I've eaten in the valley.  NOTHING was fresh.  Everything tastes like it came thawed out of the freezer.  The samosas were so old and stale the green peas were a strange brownish green color and the minced lamb was dry as sand.  The lamb dish we ordered was so over cooked it felt like beef jerky chewing it.  And to top it off the chutneys looked and tasted like they came out of a jar from the grocery store.  If you truly like this food do yourself a favor and try ANYTHING else and you'll realize how subpar it is."}
{"text":"I have been coming here for over 10 yeas and love this place. Prete is the owner and does a great job running this place. We have never had a bad meal here, and when it comes to Indian restaurants there are plenty of terrible places in Phoenix to visit. This however is not one of them. I have eaten Indian food all over the world; Germany, London, New York.... and this ranks at as one of my favorite."}
{"text":"Overall, definitely one of the top Indian places I've been to in the valley. The ground lamb with spices was great, and the chicken tikka masala was spot on. The garlic naan didn't have quite enough garlic for my taste, but the naan itself was cooked almost perfectly. Not too expensive at about $11 for the buffet. I also enjoyed the atmosphere and some of the Indian artwork they had. Definitely a place I'd go back to."}
{"text":"Been here three times now over the last few months and the food and service never failed. The tandoori chicken is amazing! Have had it three times now and it didn't disappoint! Another favorite is their malai kofta! So delish! Definitely recommended!!"}
{"text":"I love this place and it's by far the best Indian food in the valley that we have found.  The owner is always there to greet you with a smile and you'll be amazed by how many of the patrons he knows personally.  

The dishes are wonderful with plenty of food to be taken home.  I would highly recommend this hidden gem of a restaurant."}
{"text":"Love the buffet, the folks that work there are great, we usually hit this at least once a weekend and our table is always ready and he knows what sort of naan we want. Small but worth it."}
{"text":"I went for the lunch buffet, just to explore a new place and what an experience!! Appetizers like samosa and Bhaje were suberb. Main course consisting of Paneer, Veg curry, Dal Maharani and Saag. All them were good expect for Saag which laked seasoning. Last but not the least, dessert section was amazing, especially Ras Malai. 

All in all very good restaurant with nice food, ambiance, price and service. I looking forward to visit again soooon."}
{"text":"If Star of India (SoI) is named after the historic ship that set sail from Great Britain to India then it is best to declare at the beginning that there is nothing worth remembering about this place and there is little that keeps you afloat in the morass of ordinary fare. 

Like many other Indian restaurants in the valley, the smell of Indian cooking hangs in the air and permeates every piece of furnishing. The place does not disappoint when it comes to service, it is warm, quick and attentive. The complimentary papadums (Indian flatbread) with homemade chutneys (condiments) is usually the high point of a meal at SoI. 

Experiences with the order could be as follows: 
Gobi Parantha (Indian bread stuffed with cauliflower)- The real thing is meant to be fluffy and served with butter but the SoI parantha resembles a topping-less thin crust pizza. 
Lamb korma- The gravy is thick, nutty with a lot of authentic flavours but the meat tastes pre-cooked. 
Chicken biriyani- it is difficult to describe the God-food that is biryani but SoI manages to serve a new variation which is nothing more than chicken pieces thrown into a mishmash of rice and vegetables. 
Disheartenment with the over-priced, sub-standard food could lead to a decision of not ordering dessert. 

Finally, as observed in other reviews and the menu, if you visit this place then stick with the tandoori stuff and Chef's specialities. However in that case the excitement of an extensive menu will be lost."}
{"text":"The buffet was pretty good, nice selection, though the flavors were a bit understated. I can understand, for a buffet needs to have wide appeal. I just think if people are going to an Indian restaurant they should have a good general idea what they are in for. As such, I would have preferred the food have a bit more of a kick. 

Service was decent, casual but friendly. Clean, well set table and and nice ambiance. Maybe a good place to take someone experiencing Indian or the first time, but if you are looking for spice like I was, you might be disappointed."}
{"text":"Flavors to die for..

I live in Ahwatukee and have been coming to this place for the past 12 months and its one of the best tasting Indian food in this part of the valley. Their Malai Kofta, Aloo Naan, and Chicken Tikka Masala are amazing. I have had Malai Kofta at many restaurants (including India Oven, which has great food too) but this place has the softest Koftas. Similary, the Aloo naan has just the rihgt amount of flavor. The spicy version of Tandoori Chicken is really good too - it has just the right amount of marinate. If you like Indian food or try it out for the first time, then this is definitely the place to check out."}
{"text":"Star of India does Indian with white tablecloths and silver serving dishes.  Regardless of whether or not it says spicy on the menu, it isn't unless you consider onions spicy.  Good food, but nothing great."}
{"text":"This has to be the best Indian food I've found in Az!!! The Tandoori chicken was incredible as was the bit of lamb korma and chicken tikka masala that others in my party ordered and I tried. The staff was also competent and very understanding, (seeing as how a member of my party was almost an hour late). I really enjoyed my meal at Star of India and I plan to return, repeatedly!!!!"}
{"text":"5 star service, 4.5 star food, overall a super enjoyable experience.  We'll definitely be going back!

My boyfriend and I went to Star of India for dinner.  I got the chicken tikka masala, while he got the channa masala.  My chicken tikka masala was absolutely perfect, all buttery, with tender chicken and a spiciness that was tasty and not overwhelming.  His channa masala was really good -- he asked for medium spiciness and it was considerably spicier than my mild. 

We ordered a parantha and a naan to go with our entrees. When the very nice owner asked us how our meal was, my boyfriend offhandedly said the parantha was a little different from what he was used to, that it's not as fluffy and tender as parantha from other cultures.  The owner immediately set out to find us a bread we would like, giving us a free order of roti, and free order of rice to pack with my to-go box for my chicken tikka masala.  

The owner was gracious and eager to please, and really fun to chat with.  That made all the difference, and with the great food, we'll definitely be going back!  

p.s. get the gulab jamun -- it's delicious!"}
{"text":"Very disappointed about the Star of India restaurant, on Chandler Blvd!  A view years ago, the food was rather good, well spiced, like true Indian food.  - I had the fortune to have a friend (from Bangladesh) once, who cooked original Indian food for us.  Furthermore, I went for years to good, additionally upper scale, Indian restaurants in Europe and America.  Therefore I know, to distinguish between good and not good Indian meals.  -

Yet, the last two or three times, when we went for lunch buffet (in 2014/end 2013) to the Star of India restaurant, we were each time disappointed!  Therefore, we decided now, we will definitely not return anymore.  (But looking for a better restaurant in the Phoenix metro area.)  Paying $10 + tax for a unsatisfactory meal - while you want to go out to eat something special - is not worth it, as well as very,  very disappointing!!!

Here how just recently, on a Saturday, the food for lunch was:   Although the restaurant was fuller than I'd ever seen it, the food was terrible to bland!  Additionally, I see many containers of eight main dishes on the buffet line almost every time not even touched, but full to the rim.  (While I saw in other restaurants with good Indian food, that they had to replenish each dish over and over again during lunch.  Because each lunch time the restaurant is so full that they need to work to keep up with the demand!)  Even the Chicken Masala at Star of India was almost tasteless, as well as runny.  The spinach dish was terrible!  It tasted like chemicals, appearing like a paste - and with almost no Indian cheese in it!  The rice desert was not worth mentioning, bland!  Therefore, of all eight(!!) main dishes, I only had one single one - the Vegetable Masala  with Indian cheese - that was good, tasty.  (... Many dishes tasted like they were watered down or something like this, so that the spices do not come through any longer!  ... The main dishes ran apart when being put on plate.)

The service is nice, polite.  But the restaurant itself, including restrooms, are very dirty.  Also, the walls at the tables still spilled full with food spills."}
{"text":"Fantastic service. Amazing. I've been to India four times and this food is  spectacular."}
{"text":"This is the second best Indian buffet I have ever been to (behind Mayouri of Bellevue WA). While the actually buffet only has about 10-14 dishes, each one is really great! Service was good too)"}
{"text":"I'm quite torn in writing this review.  The food was so delicious.  The server asks for how spicy you want your entree on a scale of 0 to 10 - 10 being spiciest.  

I ordered the lamb curry and went with a 5.  My entree was so delicious and the spice was a little higher than medium, but it was so well balanced.

My wife went with a variation on tandoori chicken (sorry, I can't remember the name of the dish).  It came with a yogurt cream sauce, nuts and raisins.  It was also a delicious dish.

We also ordered a bread basket (an assortment of naan) and samosas for the kids.  The naan was a hit, the samosas, not so much. My wife and I thought the samosas were great, but it was not a kid pleaser.

So the food was delicious, why the 3 stars and not a 5?  It all came down to service.  We came in on a Sunday afternoon and we were the only customers in the restaurant for a while.  The food came out very quickly.  When we tried to tab out, the wheels came off of what started as a smooth ride.

I'd hate to be in here when it was busy.  We asked for our check and for a to go box.  Well, that took a while.  When the check arrived, it was completely wrong.  The check needed to be re-run and then we had to wait to process the credit card.  Well, you know the rest...

We were so very pleased until it was time to leave.  If the service were a bit more polished, this would certainly get a 5 star review from me.  We might give it another try but it's tough when dining with a family where time is a pretty valuable commodity."}
{"text":"Been here many times. Good food and service. Never disappointed. I like the ambience in the room. Light music, dim lights and quiet. Just wish the place is bigger. Not much room to move at the table."}
{"text":"This place is absolutely amazing.  The service is incredible, and you can tell that they really care about their customers and the food they provide.  It seems to be family-run, and they are extremely attentive and helpful when a dumb American such as myself is trying to order things he doesn't know about or understand.

The food is awesome.  I like spicy food, and I order a '7' out of '10', which gives me some real heat and keeps me reaching for my Kingfisher beer.  Everything is amazing - perfectly spiced, cooked, and portioned.

The atmosphere is wonderful too.  I don't know what a traditional Indian place is supposed to look like, but it's authentic enough for me.  The last time I was here, there was a large indian family sitting near us, and they kept talking about how wonderful the food was, so apparently it's the real deal too.

I confidently give this place 5 stars.  There is nothing I would change."}
{"text":"i was going to star of india and i ordered shai panner,chicken karuma and garlic naan. so goooood i love it so much
my favorite resturant n phoenix"}
{"text":"I had Indian food in many restaurants but this surely stands out as one of the very best. Staffs are very friendly,it's a small place and they don't make quantity in a lunch buffet but they make quality. Weldon!!! Keep it up and good work guys."}
{"text":"Our favorite Indian place - nice, simple atmosphere, great Tikamasala, decent prices."}
{"text":"The buffet here for me would get three stars.  I would, however give it six if I could for the regular entrees.  

My partner and I have come here three times and have been blown away each time by the regular entrees.  The Shahi Paneer is to die for.  They do something wonderful with the smokey tomato sauce that just keeps me coming back for more.  

The service is super friendly and attentive and the prices are a bit lower than they are at other indian restaurants in the Pittsburgh area that I have recently visited.  

Don't go for the buffet, order directly from their menu."}
{"text":"Star of India was first recommended  to me five years ago but I was a bit hesistant because I had never tried Indian cuisine before and feeling a little adventurous one night we decided to give it a try we were amazed and instantly fell in love with this restaurant from the delicious food to the very kind owners who make sure that each experience there is as good as our first if not better. We have been to other Indian restaurants in the valley and in California but this place by far has won our hearts and taste buds.  We have taken many people here to try Indian food for their first time and each time they too fall in love with this restaurant. We love things extra hot and we are never disappointed with the spicy saag or tikka masala, my daughter loves things on the mild side and they always accommodate to her tastes as well. Don't forget to try the naan or the deserts too...Enjoy."}
{"text":"Amazing food. Lunch buffet is very good and dinner menu. Wonderful service as well. Highly recommended."}
{"text":"Tried the lunch buffet and enjoyed it extremely. It could've used a little more spicy heat. But overall, it was an awesome gastronomic experience. Remember to try the milk tea and freshen your breath with their homemade concoction of Tic Tacs and fennel seeds!"}
{"text":"I tried the Malai Kofta, garlic naan and vegetable biryani. All of these were excellent. The prices are amongst the most economical in Phoenix
Metropolitan. $8.95 for most curries, only $2.50 for the garlic naan."}
{"text":"We love this place. Food is always great, as is the service. I've never had anything I don't love. I feel like they go above and beyond to make sure the customer is happy. Last time I was in, there was a little girl sitting at the counter playing with her toys and as I was waiting for my food she struck up a conversation with me. She was just so polite and positive and despite me being a stranger introduced me to her toys and explained who each character was. it was super cute...I love that this restaurant has a family vibe."}
{"text":"Love this place! One of the best Indian restaurants in Phoenix! Aloo Gobi, saag, chicken korma, and their mint chutney are my favorites. Lunch buffet is very good. I usually do take out. Dine-in service is also pleasant."}
{"text":"I almost feel guilty writing a review for Star of India, since I frequent this restaurant at least once a week.  Obviously, I'm a fan.  The owners, who seem to spend their entire lives at the restaurant, are some of the most welcoming and thankful hosts I've ever run across.  This is one of those small family owned restaurants that I feel proud to support.   

Don't get the impression that I would rave about a place if they didn't have the food to back up their hospitality.  I'm fairly certain I tried just about everything on the menu.  My favorites are the Chicken Tikka Masala and the Saag Paneer.  My wife and girls really enjoy the Paneer Tikka , Samosas, Malai Kofta, and the Shahi Paneer.  My oldest daughter has developed something of a reputation at Star of India as the \"Gulab Jamun\" girl.  Each time she comes home from college, we pay them a visit. The owner can't resist bringing her ridiculous numbers of these desserts just to see the look on her face.

If you've never tried Indian food before, this is a great place to start.  Ask for Preet and he'll be happy to help you pick something that meets your tastes."}
{"text":"So I just got back from taking a solo trip over to Star of India.

I was craving some comfort food, something simple, but yummy, something that would cheer me up on a cloudy day. Something that would make me feel less loser-ish because my lunch buddy had taken the day off and I had to eat solo....cha-ching... Star of India fit perfectly! 

I chose to do the buffet because it had everything that I liked. I don't claim to be an expert of Indian cuisine, but I love the sauces and gravies and the rich flavors that are used. 

The naan was HOT and fluffy and I scooped up everything with it!

Like I said, this place is nothing fancy, but it was clean and my waitress was friendly. Plus, it made me feel a little less loser-ish."}
{"text":"First review ever here. We were seated but not given water or menu. After 10-15 minutes we asked for a menu.  Then we asked if we could order.  Then we waited for one solid hour.  Imagine sitting in a half empty place and your food doesn't come out for an hour.  You ask the owner/manager when you can expect your food. He turns to your spouse and says he is sorry he is married to someone like you. Both of you blow up.  He states that he no longer want to serve you.  You leave after sitting in a booth for one hour."}
{"text":"Lunch Buffet

There was three of us for a fast lunch.. The food was excellent and the service was very attentive and helpful with ingredient explanations ( one of us is gluten-free). 
They had about 12 items to choose from (meat and vegetarian) along with a basic salad, and 3 desserts. 

We plan on going back again the next time we're in the area."}
{"text":"I ordered to-go from Star of India.  Garlic Naan and Aloo Gobi, with rice.  

Service: It was a to go order, but everything was ready when I arrived, and they packed it up neatly with no leakage at all.  

Food:  DELICIOUS.  I ordered medium spice on the Aloo Gobi and it was perfect.  Well seasoned, excellent flavors, and just hot enough.  The rice is good and the Garlic Naan was excellent.  

I'm really glad we have Star of India in the neighborhood.  Go there!"}
{"text":"If your looking for a fine dining experience, then this place is for you! I've been coming here off and on for the past decade and one of the best things about Star of India is by far their Mango Lasse beverage. I highly recommend for its delicious taste and freshness! The service is also really good, plus the food is the best part of this place! Try the Chicken Tikken Massala if you ever get the chance, its all for a great value and experience! If you haven't been to a Star of India before, this place is a perfect one to hit up if your ever craving the Indian cuisine!"}
{"text":"I've lived in Ahwatukee since 1999 and have eaten at Star of India quite a few times.   I've always found the food good, but not great.  

Recently, I went with a friend to the lunch buffet and was very pleasantly surprised at how much I enjoyed it.  Not sure if anything has changed there or not, but there seemed to be more variety of food to choose from, and more flavor.

I tried to ask the waiter if there were new owners or a new cook at the restaurant, but he only spoke Hindi.  No matter... the food was great and I'm looking forward to heading back soon."}
{"text":"Preet and crew always take care of you! Best dishes are paneer tikka and naan. Dessert get the ras malai"}
{"text":"I live way up in North Phoenix. There must be over two dozen Indian restaurants between me and Ahwatukee.  I think I've tried them all. And I would still happily drive the 36 miles to get to Star of India in Ahwatukee, just to eat the chicken vindaloo.  I take all my visiting guests there for the amazing food. But the chicken vindaloo is by far the best I've ever had. The menu... it's all good! And I've never had bad service there."}
{"text":"Best Indian food I've ever had.  Period.

I can't believe the ho-hum reviews here!  I've since moved to LA, and I still cannot find good Indian food around here.  Star of India is the bar by which I judge Indian food.

It seems the reviews are based on the lunch buffet.  I've never eaten this, but have always gone for dinner.  Beautiful pillows of poori bread, light and warm.  I have dreams about how good the curry lamb is.  Perfectly spiced, in a rich, creamy sauce with a wonderful texture.  This can be spiced as hot as you'd like.  Super tender lamb.  Served with basmati rice, roasted ever so slightly in olive oil.  Fragrant mango lassis.  Candied fennel seeds.  My mouth is watering writing this!

Nothing is ever fried in a vat of communal oil, greasy, nor a mushy mass of non-descript starch dotted with frozen vegetables (as other restaurants have served).  Totally worth it!"}
{"text":"I'm Indian and this is some of the best Indian food in all of Arizona BY FAR! Best north Indian cuisine in AZ for sure. 
I love the malai kofta and the lamb dishes are to die for (kadai lamb, rogan josh) and chicken tikka masala. Kadai paneer is very tasty also! The spices they use are amazing and I have never had a bad meal here. The food can be spicy, which I like, but you can tell them to make it mild if you prefer that. The ingredients are fresh and food tastes like it was made that day unlike some of the other Indian restaurants in the valley.
Don't forget to order a mango lassi too...SO YUM!
I usually order a la carte and get a naan or keema naan (naan bread stuffed with lamb). If you go with someone order a couple of dishes and breads to get a variety (true Indian style eating). 
I really love this place for north Indian food! I go to Chutney's in Tempe for South Indian cuisine."}
{"text":"Such good food and exceptional service.   We love Stars of India  and eat here once a week"}
{"text":"Love that this is a family run place.  Stopped in for dinner. The menu selection was good.  This was a go to place for us in the past.  Over the last couple years the taste of the food has changed a bit.   I had the keema matter and it came out with a sweetness, like they added a cup of sugar to it.  I've spent a lot of time in India, southern parts and I've never had keema come out sweet.  The chicken tikka masala was ok, wasn't great but good.  I loved that they use actual basmati rice and the naan is awesome.  

The other downside is their speed of service.  They are super friendly but if you're in a hurry, don't plan on getting out of here quick unless you're there for the buffet!"}
{"text":"Well to start  I now have a new favorite east Indian buffet. Went here for lunch today with Rand H. and this place was small comfy and with lots of nice decor. As far as the food goes everything I ate was great. The service was real good as well. Not much more to ask for ,  woo hoo!!! as good as it gets. they should change the name to 5 star of India. yumm yumm yumm!!!!!"}
{"text":"Well, my beautiful bride and I were headed to the Indian Paradise in Chandler... closed for good (we sought yelp for this one). So we remembered the Star of India in which we visited a couple years prior. We remembered the food was good (not great), but we were not impressed at the time because this restaurant was not ready to open at their scheduled time; and not only were they not open, it seemed that they were just arriving.
 In todays competitive market, I dont know how a restaurant could not be ready at 5pm, we had to wait another 15 minutes to get in and another 15 to place our order. They really should be ready at 4pm... I believe restaurants who suit their own schedule instead of what people seek, will be out of business soon. I don't eat dinner that early, but there are many folks that prefer that time slot. 
     
   Tonight we got there late... 9pm; I know we can't expext the best service or quality of food 1-hour prior to closing, but why not. 
Well, tonight we had three issues:

1) We were seated quickly by the water girl, but waited a good ten minutes to figure out who was our waiter/waitress before we could even ask a question about the menu or even place a drink order.
2) The owners daughter was running around and at times yelling or crying. Not really a big, big issue because we have young children, and when we first sat down this cute little girl landed on my wifes lap; we have a daughter around her age, but there are times when you leave the kids at the grandparents home and rarely get some time for one another, and you don't want to hear yelling or crying, especially from the owners child. It tells me they either are not watching her or they are not paying attention to their business. Maybe that is why I found a strand of what seemed to be part of a brush of some sort in my food. The female owner/waitress tried to play it off as a part of an herb. Not quite...I know what it was and my wife verified it
3) Their curry, rice, and naun bread is tastey, but their veggie kofta balls in the curry were hard and the lamb (lamb curry) seemed a few days old.

I see some good reviews here, but we will not be back; they did try to accomodate the bristle brush strand with a $10 coupon and free dessert; but the lack of smiles, poor service, semi fresh food, and denial of the bristle strand, will have us put this \"Star\" out."}
{"text":"This was my first time trying this restaurant. I ordered takeout I had the Shrimp Curry, rice and garlic naan. It was very delicious. I had the curry done with medium spice level. Just the right kick! Who ever the male was the brought out my food, was very nice. I will definitely be back!"}
{"text":"FOUND A SPIDER IN MY FOOD. The owner had provided us with 50 samosas for a party, and when we opened the box, a spider jumped out from beneath one of the samosas. Although the owner at least refunded us the money right away, she was rude and accused us of fabricating the story because she thought maybe we didn't like the style of samosa she had provided. What a bogus explanation, given that we had a party that we needed the samosas for that day. Instead of any apology, she said \"this has never happened in 18 years\" as if that would matter to us. She sifted through the samosas herself after we told her this, and was obnoxious to us the whole time. Since we had just closed the foil back over the samosas without removing the spider, she finally found it and just picked up the samosa and spider as if it wasn't a big deal. Her reaction was ridiculously calm and she didn't seem surprised in the least. After this her tone changed a bit, but the damage was done. My advice: DO NOT COME HERE. THE OWNER IS RUDE AND CLEARLY THEY ARE UNSANITARY."}
{"text":"I was unaware of this little gem of a restaurant next to Trader Joe's in Ahwatukee, and the only reason I ventured there with my wife was that there was a Groupon deal for it. Thanks Groupon! 

Here are a couple of things I thought were worth mentioning about my experience:

Food:
I had the Chicken Tikka Masala with \"medium\" spice levels, and it did not disappoint. The curry was fragrant, rich and spicy! Just the way it should be. I'd be hard pressed to recommend a better Indian curry to my friends. The garlic naan was also well done and was a decent portion, be it for a slightly exorbitant price (more on that below).

Spice Level:
Spice levels are more spicy than the the typical Indian buffet, so beware if you have a delicate constitution. My wife was tempted to get \"hot\", but lucky enough she settled for \"medium\". It was just right  for her, and she likes spicy food.

Price:
The meal was a little on the pricey side due to the fact that we had to pay $2 - $5 for rice/bread on top of the entree, as it is not included with it. 

Onion Fumes:
While waiting for the food to come out, I started tearing, and started wondering if I was just having a \"moment\". ;) But as it turned out, it was onion fumes wafting into the dining room from the kitchen that were making my eyes water. Yes, the fumes were that strong! Then again, we sitting right by the kitchen door and it was a little stuffy as it was cold outside (winter) and they likely had the heater on. I did cease to notice it once the food came though, because I then started crying tears of joy whilst stuffing my face. Nom nom nom!

Conclusion: 
I would likely return, and bring a couple of friends or family members back with me!"}
{"text":"Star of India has some of the best food around. I've never had anything here that I didn't like, the chicken Korma is a particular favorite. Owner-manager(?) Preet is incredibly kind and welcoming, my husband and I are regulars here now and he always comes over to our table to say hello and talk with us. We also usually get a dessert on the house too ;)"}
{"text":"I have have been here several times and always had a wonderful experience. Yesterday I stopped in for there lunch buffet and was served by one of the sweetest servers I have ever known. He was new, to this establishment, but i kniw he has much experience. I feel awful I can not remember his name. I believe it was Mahi, but I am probably wrong. Regardless you will know him by his bright smile and endearing personality. He also has a constant need to recommend  you try more of this or more of that, before I knew it I had consumed 6 of the brown dessert balls. I am not Indian but but I can tell you that the flavors here are FULL of wonder. I have tried them all and enjoyed everything. Paneer, is wonderful. Tandoori chicken juicy. The nan bread is delicious and huge! I can not give enough praise."}
{"text":"Not the best Indian food in town, but definitely quite edible and even yummy on occasion.

Go for the ~$7 lunch buffet noted by the other reviewers.

Its actually a good place for a lunch meeting b/c its nice and quiet, with an ever so slight air of fanciness coming from the white table cloths, AND you can eat immediately (ie. no waiting for the food! Its a BUFFET!)

If you are in a hurry grab the lunch buffet in a takeout box for even less. Just don't try to go *too* crazy stuffing your food in the stryofoam box if you decide to go the takeout route..."}
{"text":"This place it's so amazing not just because of the flavorful food but also because of the wonderful people the manage it. I am always craving this food. Buffet from 11am to 2:30 really worth the price. Today the owner thought me how to nNe garlic bread and it was an unforgettable experience"}
{"text":"From the food to the people Star of India is the best Indian restaurant in Phoenix.  Everything here is made from scratch from the owner's grandmother's recipes. Everything I have had has been delicious. This restaurant sets the bar. The family owners and their staff are also super friendly and welcoming. Do yourself a favor and make this your stop next time you're craving Indian cuisine. You won't be disappointed."}
{"text":"This place is excellent!  I come here every time i'm in town for business.  Love it!!"}
{"text":"If you love Indian fare, this is your spot. I'm gluten free and they can make nearly everything to fit my diet. LOVE having this place in our hood!"}
{"text":"My new favorite indian buffet. I used to go to Kohinoor Cuisine in Tempe but they closed down permanently recently. The owner of that restaurant told me about this place, he said his brother owns this spot. This buffet is just as good. Saag paneer, naan, ect everything tastes perfect with the right amount of spicyness. I just wish we lived closer cause then we might come here everyday. The buffet ends at 2:30pm and restaurant is closed every monday. This is the best indian restaurant in Arizona."}
{"text":"I am never disappointed coming to this place. Preet and his team are sure to make your Indian food experience a good one.  I was never one to try different foods but after my first time here I became a regular. I had dinner here Sunday and it was delicious as always. I just joined Yelp recently so this is my first review of Star of India and I'm pretty sure they will almost always be 5 stars.  I have never had a bad experience here."}
{"text":"I've been eating here for about 8 years, it's the best Indian food around in my opinion. When I first started going there, I thought they were a little rude, but that isn't the situation at all, not anymore at least. They have a delicious lunch buffet that's both vegetarian and non, and I love it all. Don't be afraid of the green stuff, it's delicious, it's spinach with goats cheese. They use to bring out fresh curry chicken but now they just bring out fresh naan, which is freshly made. The table cloths are a little long, be careful when you get up cause you can take the whole table with you."}
{"text":"I've been coming to this restaurant since I was 6 years old, and every time I come the thrill of eating authentic Indian Cuisine is always there. Whenever I come back to AZ from college this place is my first stop. The top notch Naan (I'd say the best in AZ) and Tandoori breads never fails to give off a homey feeling and complement any dish. If you're gonna stop by here, please be sure to try their famous Chicken Tikka Masala, or Shahi Paneer. The creaminess of the sauce in both of these dishes, and the precise spice blend they use, gives it a uniqueness and signature that no other restaurant I've been to can replicate. 
Going beyond food, the decor and cleanliness of the restaurant betrays the professionalism and care that the gregarious owners put into their work. This 18 year establishment has set the bar high for any future Indian cuisine restaurants in the valley (being practically the first in the valley as it is), and no other North Indian restaurant in Phoenix has come close to rivaling this gem of a culinary establishment."}
{"text":"Great family runned place. We go here with large groups and share everything. Since going here we've just told the owner to bring out whatever he wants and he's never disappointed."}
{"text":"Yum! Love the buffet lunch with freshly made naan. The rice pudding is delightful and a good way to end the meal. Tea and water are perfect to enjoy with the tandoori chicken, rice and others. Give it a try. *located in the Trader Joe's parking lot."}
{"text":"Visited last night with the wife.  She is a big Indian food fan and she has been introducing me to the cuisine.  I have to say this place was great.   The only thing I would say is that we ordered each dish medium heat and it tasted as though there were no spice at all.  Food was great and the price was very reasonable.  Snagged up a coupon on restaurant.com and  we ate for a very low price."}
{"text":"Above average. The Korma and Vindaloo were tasty. We ordered spicy, and boy, it was. Whew. Definately one of the better Indian places in the East Valley. Oh, the staff was friendly but slow."}
{"text":"I like this place a lot and they offer take out if you just want to pick up food and go home to eat. I always get the chicken makhani and my husband gets lamb curry... and garlic naan (so good you should get it!) Every time the food doesn't disappoint. The decor leaves much to be desired but I could care less about how the place looks as long as its clean and yummy. The people that work there are always very nice and welcoming. We'll continue to go there in the future."}
{"text":"This may sound snobbish, but I shall not abide pathetic service.  My wife and I have been going to this restaurant for about 2 years.  The service was always, and I mean always, sketchy, but at least the food was okay.  The last time we patronized it, we ordered take out and they said it would be 25 minutes.  Knowing their habits we got there after 35 minutes and waited another 20 before our food was delivered to us, despite my asking three times of three different people to check on my order.  When we got it home, it was the worst Indian food I have ever had.  Dry, overcooked, tasteless and of small quantity.  I have sat in the restaurant on numerous occasions waiting for the waiter to appear and take our drinks order to the point that I have had to get up and go find him/her.  Disgusting.  Give it a miss."}
{"text":"Very good food and the staff is friendly. The atmosphere is very India, and that's cool cause you definitely get the authentic experience being there. I loved eating with my hands (which is not a requirement, I just did it personally, I think that's what they do in India any way) and that was fun. The drinks are pretty reasonably priced. But for a buffet I would say it tasted pretty fresh and good, not tasting like the usual tasteless stale buffet. Definitely recommend this place!"}
{"text":"Just finished the buffet lunch at Star of India. Food was decent and servers were pleasant, but nothing special and there weren't very many options in the buffet. For $9.60 it seemed a bit overpriced -  I would recommend Tamarind instead."}
{"text":"Service: A+ came on a Friday night couldn't believe how busy such a small place could be but now I know why. Was brought a drink while we waited for a table staff was happy to see us and very friendly. 

Atmosphere: A+ small restaurant but very cozy and authentic the walls are filled with Indian art and the music was authentic and cheerful. 

Food: wow! Let me say it again! WOW! We were first brought out a complimentary taco shell looking appetizer with a few sauces it was delicious. I then ordered chicken tikka masala (hot), regular rice, and garlic naan. I think I've found my favorite food of all time. Everything was so hot and delicious I will definitely coming back very soon probably twice a week. I've eaten at a few Indian restaurants most recently the \"curry corner\" and this place is hands down 100% better in every way shape and form. 

Price: extremely reasonable for the quality of food. I heard they even have an all you can eat buffet from 11-2 I will definitely be checking it out soon! 

Overall for me it's the best Indian food in phx and most likely all of Arizona if you are over on 40th and chandler blvd GO CHECK IT OUT you will not be disappointed."}
{"text":"This was a wonderful experience! We have never had Indian food prior to this...
We walked in and the wait staff was very welcoming. We were unsure of the items on the menu and the waiter took extra time to explain the items and make suggestions! 
Food was AMAZING!!!! 
Afterwards; our waiter brought us a desert on the house! Very good food...great service and a quiet and quaint atmosphere! 
Must go!!"}
{"text":"Me and my family love star of India, they're food is so good my child loves the chicken tikki masala. The only down side is that they do not deliver  but still worth it!!!!!!!!"}
{"text":"Very good food. The staff was helpful and explained the food to me since it was my first Indian food restaurant. I will be back for sure."}
{"text":"We love this place! Best naan bread ever and the chicken Makhni is excellent! We normally order our dinner to go but it is also a nice place to eat in, nothing spectacular but cozy and romantiquish... If you are around you should give it a try!"}
{"text":"I LOVE Star of India. I have been there three times, and every time, the service and the food were spot-on. You absolutely cannot beat their buffet. They have a huge spread with tons of vegetarian options-- there's something for everyone. On days when they don't have the buffet, they also have a sampler platter on their menu that is good. The buffet and the sampler are great introductions for people who have never had Indian food before. Their vegetable samosas with yogurt sauce are my personal favorite. This is a great restaurant for both vegetarians and omnivores alike."}
{"text":"Great Indian Restaurant!

Family and I went here after having terrible service at another place next door. The owner was warm and welcoming when we walked through the door. I ordered Chicken Vindaloo while my wife and son got Masala. All dishes were prepped promptly and tasted amazing.

When my wife ordered Galub Jamun and it came out cold my wife was just going to take them home and heat them up (which would have been perfectly fine). When the owner saw that they weren't eaten, he stopped the conversation and grabbed new desserts from the kitchen and warned them up himself.

Great service!! Definitely should give this place a taste!"}
{"text":"After going back a few times, I can say I love the chicken dishes but have always found the lamb to be fatty and tough. That and service varies... one waitress was pretty rude, wouldn't answer our questions and even asked \"are you sure you want to order that?\" Um... yes? Maybe? I don't know? Do I?!?!?!?"}
{"text":"Consistently good Indian food. Anything with the garlic naan is better. T host is always attentive, though when he is not around, the staff are definitely not up to the same caliber. Their food always tastes fresh, hot off the stove."}
{"text":"The flavors here are truly great, if you like garlic and spices this is your place.

So if you have a 2pm business meeting you may want to find something else, but if you want to make your tast buds hit the international disco floor give the lunch buffet a try. There were the usuals, pakoa, aloo tiki, raita, and then mostly common food but well executed.

For me the winners were the saag, a green spinach based concoction packed with garlic and exotic flavors which may even be healthy. The korma was my other favorite with clunks of veggies paneer and a creamy curry sauce.

The meal also inclues garlic naan (nice touch), chai tea and desert.  For desert may I recommend the rasmali. a sweet creamy milk sauce with balls of cheese that have the texture and taste of cake."}
{"text":"Stopped in for buffet lunch and not overly impressed. For starters, when I went into restaurant an older woman just stood next to the bar staring at me and another gal sat facing away from me eating. I asked to be seated and the gal eating never turned just pointed with her fork and said sit anywhere. I sat and an older gentleman came to wait on me. 
Not very inviting or polite.
The food was average and not much to choose from.
There are so many excellent Indian buffets, I doubt I will go back to this one."}
{"text":"The food was very flavorful and delicious, but the only dessert they offered at their lunch buffet was rice pudding and this cold donut-hole type dessert that we did not like. I was shocked when I saw my bill. I thought it was $8 for the lunch buffet but we ended up being charged over $60 for my husband and I, and our 4 kids 12 & under... I feel like we got ripped off and it was a waste of money. There was not a very large selection of food. The two men who seemed to own the place were very kind and friendly. The restroom was nice and clean."}
{"text":"Mediocre Indian at best. The restaurant is very crowded, they are often out of several items, and a bit on the pricey side. You can get much better Indian elsewhere in Pittsburgh and spend less."}
{"text":"First time we went I was very impressed...owner is such a nice man. Food was really good.  Our seconds experience we ordered for takeout and not as good. Latest time we had a groupon. We were there for at least 2 hours. It was very warm, none of the tables were clean, service was terrible, there was a little girl running back and forth screaming and worst of all was the food. They have gotten very skimpy. I think our food was sitting for a while before it was served because all of it was cold. Too bad because it was so good the first time."}
{"text":"I've never had Indian food before. It's definitely different but tasty. Nice smiles work there."}
{"text":"It's been a few years since we've been here.  Now I remember why.

Came for lunch.  Initially we were going to use restaurant.com but then realized the offer really wasn't worth it.  $15 does not go very far here.  All the dishes are expensive.  Even the buffet is expensive.  We opted for the buffet.

I tried a bit of everything.  I honestly can't remember the names of all of it now.  The spinach mash tasted like spinach.  I didn't detect anything interesting there.  The chick peas (garbanzos) had a really nice sauce that was a bit spicy.  Pretty good.  The tandori chicken was nothing special.  The tikka (chicken) was very mild.  I could tell it was tikka, but it wasn't strong or bold at all.  And they had some sort of ground lamb dish that was interesting.  The saffron rice was very nice.

I agree with other reviews that it is nice this is a family-owned enterprise.  I like to support \"mom and pop\" eateries.  But they can't take that support for granted.  For the prices charged the food should have been much more exciting.  There are other choices for Indian cuisine, and many deliver on the bold flavors.  And they do it often for less money.

And no mango lasse was offered in the buffet (unlike a couple other restaurants I know).

So sort of a mixed bag.  Some dishes were more interesting than others, but none were really bold or exciting.  Probably the chick peas and the saffron rice were their best offerings, and those arguably are just side dishes.  If I had the choice I'd go with 2.5 stars, but I don't.  And with so many better options for Indian cuisine for both flavor and value, I just can't go to 3 stars."}
{"text":"Simple and Excellent food! They open @11:30 am on week days! Limited selection but excellent quality just like home cooked food! Great value for your money when you have the lunch buffet!"}
{"text":"This place has some the absolute best chicken tikka masal in the valley... The courteous staff makes it even that much better. This dish can range from mild to blow your taste buds hot but they always seem to get it just right unlike other places. I would recommend this place to any and everyone!!!!"}
{"text":"Great lunch buffet here today. Good selection and tasted freshly made. Good naan, too. I'd go back again."}
{"text":"3.5 stars.

Excellent chicken tikka masala, which is my staple at all Indo/Pak restaurants.

Everything else is pretty average. The buffet in particular was unimpressive and I avoided it. The decor and atmosphere are a tiny notch above standard Indian-restaurant fare, with compliments to the ownership for cleanliness and neatness in general. You could certainly bring your visiting parents or in-laws here, for example. Maybe not a date or an important client though since it's not fancy-schmancy enough.

Once upon a time I lived in a house with a white picket fence in the suburb of Ahwatukee, where this is located. I very often (too often) would stop by Star to pick up dinner on my way home a mile or two away. Nothing extraordinary, but if you find yourself craving Indian food and are in the area, stopping here is a safe bet."}
{"text":"I got the chicken tikka masala and naan. One of the most delicious tikka masalas ever!! I would give that dish 5 stars, and the naan too. I haven't tried other dishes yet, so I don't know if I can give 5 stars overall. Also I got takeout which was convenient, but I wasn't too impressed with the restaurant ambiance."}
{"text":"The best Indian food that I have had since I left Seattle and on par with the best that I have ever had. Loved the Tandoori Chicken and Garlic Naan. The rice was outstanding, very aromatic. The rest of the meal was equally excellent. Although I don't know what it was. My wife orders and I just enjoy. Some vegetable plate, some spinach maybe some potato looking things. I don't know the names but I do know great food ! Happy we found it and will be back."}
{"text":"Not by any means an Indian food expert, nor have I been to more than 3 Indian places.  I was craving some Naan (that awesome flatbread) and talked to my good friend (who's Sikh) and he recommended this place as it was local to me and he had had a good experience there - and if he says it's good I listen.  She even asked me on a 1-5 scale how hot I wanted the food... 3 totally but could have done 4 probably :)

It's in a dark corner of the plaza and the price was higher than I was expecting but the food totally made up for it.

The safest thing I could get is Chicken Tikka Masala, which tears me up anyways but I love indian food (don't think indian food is meant for skinny white guys.. just sayin).  

Bottom line... girl on phone was very helpful and very nice, the guy at the front desk was very welcoming and nice and they even offered me drinks for waiting like 3 minutes for my food to be done (was doing take-out).  Felt very welcome there and everybody was friendly.

Got home, everything wrapped and sealed up nicely as for no spillage in the car and the naan was wrapped in reynolds wrap. 

Food was great... bread warm and fluffly, chicken cuts were very tender and moist and the rice was perfect fluffliness.

I'm totally going back... but I need to give my body a break... I'm payin for eating Indian food...  but it was so worth it!"}
{"text":"We checked this out for the first time last weekend, and I am really disappointed that it took me this long to ever come here!  (I must admit - I'm a former South Oakland resident, and will thus be Dirty Souf 4 Lyfe, so crossing that magical border of Bellefield Avenue into North Oakland is kind of a stretch for me!)

On a Saturday night, it was pratically empty, so we had very attentive waiter service.  They were great with refills and prompt delivery of our food (and also patience with the fact that we food blogger types have to take pictures of everything before we eat it).

They do have a wine list, and while it's small, it's also relatively cheap.  The bottles were all less than $30 each, and we got a nice shiraz to go with our dinner.

We started with the samosas, which were quite good, but standard, and then, in a flash of greatness, the words 'vegetable chat' caught my eye on the menu.

Vegetable chat is this thing that I love, that I've never known the name of.  It's a cold almost-salsa-like dish made up of chickpeas, potatoes, onions, and Indian seasonings, then topped with crunchy crackers (the same consistency and flavor of the samosa shell), yogurt, and tamarind sauce.  It's like a less-mayonnaise-d version of potato salad.  Oh, how I love it!  Star of India's was absolutely perfect, and I'm so glad I took a chance on ordering it.

However, not wanting to step totally out of my comfort zone, I ordered my typical mattar paneer.  It was good, and not a huge portion, so I didn't feel compelled to just keep eating and eating the deliciousness in front of me.

My husband got the tandoor mixed grill, which had chicken, shrimp, and lamb.  He was crazy about it.  Like most Indian restaurants, you can pick the level of spice for each entree.  The garlic naan was ridiculously puffy and buttery, which we loved.

We will definitely return to Star of India.  It's much more low-key than India Garden, but the food is just as good.  If you want a nice, laid-back place to have a bottle of wine and some tasty Indian food, check this restaurant out.  The only thing you'll have to worry about is parking, as it's metered street parking only, and this stretch of Craig Street can be busy, especially on the weekends."}
{"text":"I'm general it's nice place.
Seems like the owners family running the place .we set for some time before got acknowledge. 
Chicken dish was excellent.and we some appetizer that was good too."}
{"text":"Pros: cheap lunch buffet, convenient location for CMU students, good for me

Cons: not great for those looking for super-spicey dishes

Star of India reminds me of that one summer in Pittsburgh -- the one when we worked all the time and only had a weekly break...to come down to Craig Street for the lunch buffet.

I can't take too much spice (I mean, do you really want to see me with tears running down my face that much?  Yeah I didn't think so), so this was a good place for me.  The lunch buffet is relatively cheap (~$8).

Service is always attentive.  We never felt ignored.

But to showcase Pittsburgh?  Not really.  Go to Oakland instead."}
{"text":"This is by far my favorite Indian restaurant in the Phoenix area and the best!

The food is very delicious and the owner, Preet, is very hospitable.

Too bad I no longer live in Ahwatukee.  All I could think of when I was at a restaurant down the street from my place earlier, is how mouth-watering Star of India's chicken tikka masala is.... Yumm!

A must visit!"}
{"text":"We came with a groupon, and ordered a bunch of things. It was... ok. It wasn't the worst Indian food I've had, but it definitely wasn't the best. Which could also be a summary for almost all restaurants in Ahwahtukee. 

The service was alright.... but the food was just not great. I honestly can't even remember one thing that we liked. Ok, the biryani was probably the best thing, but not good enough that I could recommend this place."}
{"text":"The food is amazing! I love the lunch buffet which has a good variety of options along with all the go-to dishes.  Chai tea and desert are included in the buffet, which is nice!  The staff is always friendly and accommodating.  I feel like they just want us to be happy and enjoy ourselves!  Thanks Star of India, Holla for Masala!"}
{"text":"First visit and not impressed. The reviews seemed to suggest a different story, albeit, I only tried the buffet. The basmati rice was almost tasteless, the chicken tikka masala had very little flavor and the chicken was a tad overcooked. I tried the samosas, but again tasteless. The grilled chicken was dry too. Don't think I will be going here again."}
{"text":"Star of India is only good if you go to CMU and if you don't feel like going to India Garden or a better Indian restaurant further away from campus. They do have some good naan but the service is slow and not very good. The food is also not very good. The lamb vindaloo is the only thing that I'll eat there. The chicken tikka masaala has way too much butter and cream in it. 

When it comes to the spiciness of food, a 6 is extremely spicy. And I do like my curry spicy. Overall, don't go here unless you can't go to India Garden."}
{"text":"food is better than average. the owner is a great guy."}
{"text":"Very traditional north indian food spiced at gringo level.  I like that they have toned down on the creamy sauces and have lentil soup (dal) and chick peas on the buffet.  It is not well known that you can do takeout from the buffet for $6 (they give you a styrofoam container and you can stuff it as much as possible). This is a good deal and can't be beat for quick, especially when you have had it with campus food."}
{"text":"I've only had their buffet during lunch time.  Its selling points are: convenience and efficiency.

Located on S. Craig St., it is about halfway between Pitt and CMU and across from the museums -- good for a quick bite between meetings or classes.

And the keyword here is *quick*. Since the lunch buffet is basically a self service, you can come in, get a table, and immediately begin to stuff your face. As soon as you're sated, the waitstaff is happy to bring you the check and get you out the door so that your table is free for other customers.

The buffet food is pretty plebeian: bins of kormas, saags, basmati rice, and naan heated by kerosene.  Not a wide selection, but you can have as many servings as you care to eat.  The rice pudding is usually the highlight of my meal (not because it's especially good, but just because I have a sweet tooth).

If the option permitted, I'd have given it 2.5 stars."}
{"text":"the lunch buffet is a great deal. The fresh garlic naan is delicious as is everything else."}
{"text":"If the Union Grill across the street is too busy then DON'T just cross the street and eat at this place!
I ordered a coconut shrimp dish and the shrimp was way overcooked.  I managed to cut it with my knife but it was difficult, it really needed a steak knife.  The dish was bland and totally boring.  Did I eat it, yes, because we otherwise would have been late for the concert had I sent it back.  My GF's dish saag lamb tasted a little better to me, but she wouldn't finish it.  We were with two other people but I didn't taste their dishes and can not comment on them.
Service was very slow, at 6:15 pm on a Saturday night (no major events in town).
I was generous, it's really only worth 1.5 stars.
We will NOT be going back."}
{"text":"Have to honestly say that this was the worst experience I have ever had at a restaurant since I moved to Phoenix. Staff literally avoided us, waited over a half hour for a table. Food was so spicy that we couldn't even eat it, and when I complained all we got was a half ass apology, a 60$ bill (for 2) and some crappy desert. Never going back to this place again, beyond dissatisfied with the high amount of incorrect reviews on Yelp. First visit, and last visit. I made this Yelp account just to write this negative review. Terrible, avoid at all costs."}
{"text":"I returned to Star of India last night for the third and final time. I had a Groupon and hoped that maybe they would have gotten their act together since the last time I was there about a year ago. Nope. The service is still lousy. It took 40 minutes to get served two very standard dishes - tandoori chicken and the baingan bharta. So nothing fancy, no fish that had to be specially cooked, no changes to the recipe. A couple who came in after us was served 15 minutes before us. The tandoori chicken did not taste like tandoori and was just covered in onions (probably 2 onions) and the baingan bharta was bland. I had half a dish left and didn't want to take it home. I won't be back."}
{"text":"Unbelievable food! We went during the afternoon buffet to get a taste of everything, and seriously, everything we tasted was better than the next. The hospitality is beyond amazing! Wonderful people. We're regular customers and need our fix at least once a week!"}
{"text":"Wife chose this place and we went late Tuesday (9pm) for dinner after I got out of school.  Owner was attentive and very helpful and helpd us order.  he explained dishes and brought usu a few different breads.  Dishes were VERY colorful, tasty, piping hot.  I asked for spicy and WOW..., on that scale, I should have asked for mild.... Yummy food and Great time.
the owner's family children were playing (read: screaming and running around jumping on boothes and staring at us over the wall) the whole dinner, which was mildy annoying in a quaint way..:{
we'll be back. maybe once school starts?"}
{"text":"I would eat here again! The prices are very affordable and the food was delicous! We ordered the combo appetizer with was bursting with different flavors and spices. The tandoori chicken was good, but the portion was skimpy and there was more bone than meat. Our lamb saag was awesome! Perfectly cooked lamb that was fork tender and the sauce was yummy. I was so happy they didn't skimp on the meat. Our portion had a lot of tender lamb in it. Best mango lassi I've had in a while. We completed out meal with the gulab jamun. Delicious! I'm not used to it being served cold, but the flavors were spot on. Great service and a fun atmosphere due to the musc played."}
{"text":"Sorry to say we walked in looked at the buffet and walked out. This place looked very dirty and the buffet looked sad. We were there at lunch time."}
{"text":"Super friendly service! The friends we were dining with go here a lot so we were definitely treated very well by the staff. Shrimp tikka masala was delicious! Garlic naan was also great! The veggie samosas were yummy. The cracker and spread that was brought to our table when we arrived was super tasty, but I don't know what it's called.
At some point during the meal I swallowed something very sharp. To the point that I went to the bathroom bc I was worried I would have to try and get it out of me. Ha. Needless to say, I did not need to do that. It has now been two whole days an I'm still alive despite sealing a sharp morsel. I'm guessing it was an accidental piece of shrimp tail and not the jagged check chicken bone I thought it was. Ya ya, never mind I was eating a shrimp dish. 

I did also try the mutter paneer (sp) and another chicken dish that were both also delicious.  

Despite the swallowed sharp piece, I will be back!"}
{"text":"My favorite indian restaurant in the Phoenix area.  Staff are very friendly, give good recommendations.  Everything comes out fresh and hot.  They'll make your food as spicy as you can handle.  The meat samosas, chicken curry, chicken tikka masala, shrimp korma, aloo gobhi, naan, and garlic naan were all delicious.  It does take a little time for food to come out but that's because everything is prepared upon order.  Have to say, didn't want to write this review in hopes the place wouldn't get busier but I have to give them their dues."}
{"text":"Easily the best Indian food in the Valley, Preet who is the owner is one of the best people my wife and I have ever met. We used to eat there every week until we moved to the North side of Scottsdale. We make it back whenever we can for the great family service and the incredible food. You can pick at random from the menu and not be disappointed in any dish. Preet can tell you what to order. If you have not eaten here you are missing out on a great experience. Family owned they make every customer part of the family. Must go restaurant."}
{"text":"Found this restaurant on Yelp tonight and it did not dissapoint. The food was delicious and the service top notch. The atmosphere was lovely.  Definitely will be going again in the very near future to sample more of their menu. Thank you for a great meal."}
{"text":"Wow. Just... wow. Wow! 

I came here for a wedding rehearsal dinner and the experience was incredible. I was in a large party and we ordered damn near one of everything on the menu and every single thing I tasted I wanted more of. 
Tandoori chicken - served on a sizzling platter with seared vegetables and fall-off-the-bone tender. Had a delicious, yet mild, flavor, perfect for those venturing into Indian food for the first time. Vegetable korma is my absolute favorite. It's like a thick sauce you can eat over rice or by itself with chunks of potato in it. Very flavorful. Chicken Vindaloo is a little spicier but doesn't kill your tastebuds with heat. The spice definetly enhances the flavors in the dish. Sop it all up with rice, or garlic naan and special naan. Sooo good!"}
{"text":"Every time we come here, we wonder why we have let it go so long since our last visit! At this family owned and operated restaurant, everyone is so friendly and the food is always phenomenal!!! Tonight we ordered the Lamb Saag, Curried Goat and Garlic Naan. It was all amazing. I have never had a bad experience here."}
{"text":"This is the best Indian buffet in the valley. I love the paneer masala here, but all the food is top quality. A lot of buffets sacrifice flavor and quality for their lunch buffets but not here! We've come here several times and we love how consistent it is.
The service is also great. The only reason why it gets 4 stars is because the restaurant isn't super clean"}
{"text":"This place is nothing great.They serve very little and they charge a lot.But the food is obviously edible.I think it's a good place to entertain non-Indians.And oh..the food gets really spicy if you ask them for 6 on the scale of 10.
  Next time you freeze in Pittsburgh,you know where to go to melt down ;)

-Smriti"}
{"text":"You'll see a lot of different \"Star of India\" restaurants but they're all different. However, this one is the best! It seems like this is a family-owned business and are very friendly. We always order the same things: chicken tikka masala, tandoori chicken, or chicken biryani. Plus their garlic naan is AMAZING and a must have especially when you're eating the chicken tikka masala with a side of rice (if we don't order the chicken biryani).

The tandoor chicken comes on a big bed of grilled lettuce, onions and a few big pieces of tomatoes which is a necessary component that adds to the perfectly seasoned/grilled chicken.

Their chicken biryani gives other biryani's a run for its money. With raisins, cashews, chicken and other herbs/spices, it's a great dish even to eat alone!"}
{"text":"We went to the Star of India for a date Night and were extremely impressed. The food was great and they had a very nice selection! But the most important part was the service. They were extremely nice, very caring and overall wonderful people. I would recommend them to ANYONE."}
{"text":"I just found this place as a last minute dinner option last week. We had the best chicken curry I've ever had at an indian place. The prices aren't bad. The servings were huge and the food was delicious. I will definitely go again."}
{"text":"I have been by this spot many times and I needed a place to eat lunch so I stopped in... I entered the restaurant and was seated right away. But then I sat there for a good 10 minutes and watched the workers walk around  then I got to see the owners little kid decide she was going to sit with the consumers in the booth a head of me... Then the kid started crying and it just does not need to happen I was kind of shocked please leave your kids at home if they are not working at the restaurant.  I ended up getting up and asking the staff if I could just get the lunch buffet. I got a bit of everything to try I enjoyed the rice and the chicken dishes... The fish dishes on the other hand not so good the fish puffs were cold and not good and the one fish dish super fishy tasteing. The bread was really good that came with the meal... So all in all I would say I will not be going back anytime soon nothing to write home about."}
{"text":"This little place is tucked deep into the corner of an Ahwatukee shopping center and is easy to miss.  That's too bad though, because this is the best Indian food I've ever had.  As a matter of fact, I thought I didn't like Indian food until I started eating here several years ago.  The buffet is the best way to go, in my opinion, as you can try a bit of everything, even desserts. The Simosas and Naan are my favorite, but everything is delicious.  After eating here so many times, I can attest to the fact that the food is extremely consistent.  The management/front staff are extremely friendly and accommodating and the atmosphere is casual and relaxing.  This is a great place to get someone over their fear of trying something new."}
{"text":"Good food..good service. It's hard to find authentic indian food here in the valley and though it isn't really  authentic. .it's fairly good.
The owners hustle to provide service and are courteous."}
{"text":"If you want to have a very tasty lunch at an affordable price Star of India is the place to go. You can't beat their buffet which is filled with a selection of delights. All the food is fresh and kept at a temperature which is just right. The service is just as good. Your water glass is never empty. We'll definitely be back."}
{"text":"Food is good service is always subpar. Problem with daily run restaurant is when you try to do everything yourself. Always understaffed and waits are ridiculous if here at busy time. Often takes an hour if you order carry-out which you can't tell me it takes an hour if you're sitting at table."}
{"text":"Good joint. Brought my friend who have not had good Indian food there. He was willing to try again and i took him there. Guess what - He liked it. Whatever he ordered looked like baby's poop - slimy and greenish, but it tasted really good. My own chicken was quite tasty as well. Everyone gets complimentary bread and some chicken (?!?). Buffet WAS unimpressive. 
However, all in all this is a real nice place for some tasty food.

\"I like\"

Eugene"}
{"text":"Totally middle of the road mediocre Indian food.  Service is quick, we had to eat quick and did, and the buffet served our needs.  I've had better and worse Indian food.  It's not spicy at all, for those with timid palates."}
{"text":"It's been almost two years since I last visited Star of India, and my absence is due to other reasons and not bec. of the food.  Some good eats I've tried here are the chicken tikka masala, basmati rice, and chicken naan, the latter of which was overflowing with chunks of tender, marinated chicken.  Add a side salad and you've a delicious meal."}
{"text":"We have been enjoying Star of India for 15 plus years.  My son requested his b-day dinner from here tonight.  The owners are always gracious. I called before the 5p opening time to place a take out order and the owner quickly returned my call. They also gave us a complimentary dessert. The chicken tikka and saag are favorites but everything we have had is very good. Consistently delicious! We appreciate that they accurately prepare heat levels as we order mild to very spicy.  We look forward to many more  dinners at Star of India."}
{"text":"We love this place, the food is fantastic. Great spices and good quality food for the price :)"}
{"text":"Lunch buffet until 2.30pm."}
{"text":"Great Place! We love the food! You won't be disappointed."}
{"text":"My first experience with India food was not very pleasant. I went to a buffet and the food was just horrible. After that, I tried a couple of other places and just couldn't become to like Indian food. Well, I must say that Star of India really changed my perception of what Indian food should taste like. OMG....they make the best Chicken Tikki Marsala, I always get it spicy by the way. Very good garlic naan and love their vegetables ( potato and cauliflower ). Staff is super friendly and very welcoming whenever I step in the restaurant. I usually get take out and they give me something free to try. Absolutely love this place!"}
{"text":"This place is the spot for lunch! I mean come on. Its Indian food buffet style! What's not to like about that. They serve you garlic naan or plain naan also buffet (all you can eat). The have all the standard fare as well as basmati rice. I always eat about a metric ton of food and when I get the bill... That's right $10. Starbucks costs more than that!! Definitely try this place out."}
{"text":"Went here for the lunch buffet, which was about $12 a person.  The papadum were nice and light. The pakora were cold and soggy. Of the two chicken dishes in the buffet, I tried the chicken tikka masala which was ok. Instead of having the chicken Korma, I had the vegetable korma which was tasty. My favorite of the vegetable dishes was the chickpea dishes which had a bit of spice to it but was not overwhelming or overly spicy - I would have liked to try a spicy dish. I was disappointed in the sag paneer - usually one of my favorites but hadn't tasted one like this - not sure why I didn't like it as much as  I usually do. It tasted like spinach and a little mint of something like that but couldn't figure out the rest of it.  The other vegetable dish was ok.

A couple of minutes after we sat down freshly cooked Tandori chicken and Nan were brought to the table. Both were tasty. I tried both of the desserts - the galub (i can't remember how to spell the rest of it) and the rice dessert - both were very sweet and tasty. One of us had the mango lassi which was sweet and good.  

Overall the buffet was ok - don't know how long the food was sitting out so I can't comment on that.

I think I would come back for dinner to order from the menu instead of having the buffet again.  I gave three stars more because in comparison to other Chandler restaurants its a bit better than what I've been having here lately - as far as compared to other Indian restaurants I've been to out of state - this was a little disappointing. I'll try something from the menu sometime to see how it compares to the buffet."}
{"text":"Food was mediocre and service was abysmal.  I'm shocked this place has a high rating on Yelp.  There are dozens of better Indian options in this area."}
{"text":"It was slightly before their time to open on a very hot day and they let me in and offered me water.  Very kind folks and super friendly. I had the most excellent \"to go\" order experience.  My chicken dish was perfectly tender and delicious and they asked me how spicy I wanted it. The Basmati rice was elegantly seasoned.  The naan was super fresh.  This is a cute neighborhood place Eastern decorated so when you step in you might feel like you've traveled thousands of miles away.  I bet this is a fabulous place for eat in experience as well which I plan to do soon.  Recommended."}
{"text":"How can anyone give this place more than 3-stars?
The food is overly buttered.  My naan is always burnt.  I ordered dahl and it was burnt. I have been here to eat and ordered take-out three times and each time I am disappointed with the taste of the food."}
{"text":"Great place and amazing good! I ordered take out from here twice as I work very close by and they gave me a great deal and even delivered food to my work! Tried the chicken tikka masala, rice, and garlic naan and it was to die for! Unlike any other Indian good I've had. Truly authentic and I asked for extra extra spicy and boy was my mouth on fire! It was delish!"}
{"text":"First time here for me and one of several times for my wife. We ordered the chicken tikka masala and another dish with chicken and spinach along with a little dessert at the end. Our senses were poised for a good time as we approached the restaurant. The quality of the food did not let us down. It was perfectly spiced and seasoned and gave the impression of a carefully and skillfully prepared meal. My wife was not very fond of the rice pudding, representing an area of compromise between us as I differ. Upon noticing that my spoon was now invading her cup of rice pudding, the owner provided my wife with two other alternatives to sweeten her pallette. My wife and I spent a nice weekday dinner escape and found quality food, service and care for us as customers all for what \"the average Joe\" can expect to spend at a high volume and taste deficient place like Applebee's. That's why I'll be back to the Star of India and I may yet again have two servings of rice pudding if my wife allows me."}
{"text":"The mild chicken tika masala was pretty good but not excellent, its sauce more buttery and less creamy and tomatoey than I'd prefer.  

Portions are plentiful.  You'll have leftovers."}
{"text":"I absolutely love this place! I've been here twice already and the food it's amazing :) I ordered the the 
(lamb shaki korma) it was delicious and spicy! If you want the best Indian food and great service come to this restaurant!"}
{"text":"My family visited this restaurant for the first time because my son was celebrating his 21st birthday and he wanted to eat Indian cuisine.  The service and food was outstanding!! I highly recommend this restaurant."}
{"text":"Been here a couple times for dinner.  Food is usually pretty good - though the Lentils are really salty as are the potatoes in the Aloo Gobhi.  The main complaint is service time.  The last time we tried to have dine-in, we almost had to leave it took so long for the food to come out.

Unfortunately they are no better for carryout.  Called in an order, was told 25 min for pickup.  Arrived at 25 min past, and food was not yet ready - did not have my order ready to go until a full hour from the time I had called.  This kind of wait is unacceptable."}
{"text":"I went for lunch and it was very good.  The reason why it isn't 5 stars is because the selection was limited.  Definitely a place to go for lunch.  :)"}
{"text":"I've eaten at many different Indian restaurants, so I can safely say this place deserves the five stars.  I've eaten here many times and the service is great, the food is excellent, the atmosphere is charming, and the price is reasonable.

It is decided.  You will eat here!"}
{"text":"Went for the buffet. Had been there before, didn't like it as much before, but wasn't as bad as I thought it was the 2nd time around. Would have liked a bit more choices for 9 and change I paid for the lunch buffet though.

Will update again if I go for actual entrees. If you go to CMU and are craving Indian food with more choices than the stuff at Resnick and don't mind paying a bit more out of pocket, then do go here. If you are looking for a good Indian buffet with a decent number of choices then you might be better off looking for somewhere a bit further."}
{"text":"Food is good. 0 stars for their ability to handle to-go orders. The first time we were told to pick up in 20 minutes. Show up 20 minutes later, give my name and the two guys grab an order slip near the phone while yelling at each other in their language and repeating my name, obviously they had not started the order.

Second time around they say 20 minutes, my husband shows up in 30 minutes and still has to wait an additional 10 minutes.

3rd time around, I'm told 25 minutes, by now this is not my first rodeo with them, I show up 45 minutes later. They ask my name, start yelling at someone in the kitchen, then tell me it'll be just a little longer and do I want water while I wait. I told him no thanks, I'd like my food, and if it takes 50 minutes to cook it then please just SAY THAT on the phone because this has happened 3 times now. 

Be prepared: when you order to-go, ignore whatever time they tell you. Just go there and wait cause they will only start making it when you arrive. So frustrating, I'm done with them for awhile. Will drive farther to find Indian take-out that's ready when they say it will be."}
{"text":"By far, the best Indian food we've had in the valley, and we are total snobs.

Really enjoyed the variety at the buffet, and the nan was really homemade.  Keep up the good work!"}
{"text":"I feel really bad about not bestowing five whole stars upon this place in my previous review. In hindsight, the only explanation I have is that I was \"holding back\" because it was my first visit to ANY Indian restaurant in the valley since moving here and I didn't want to just go carelessly throwing five stars around before experiencing other Indian restaurants. 

To help you understand what I mean ... It's as if you were an ice skating judge at the Winter Olympics. And the first skater out, say, from the Congo, absolutely blows you away. Like, you can't believe it! But the whole time she's skating  you're thinking 'The Congo? Do they even have skates? Have they ever even seen ice?' And she finishes her routine and it's flawless. But you haven't seen any of the other skaters yet. So you can't go ahead and give her a perfect score, especially without seeing the Russian chick first. But you're not allowed to wait and see the Russian chick before having to submit your score for the gal from the Congo.  They need your score right now! So you ding her for some arbitrary reason, like her skate laces weren't the same length as each other. Or something.

And then you get a chance to watch the other skaters, Russian chick included, and they were all just \"meh.\" And you wish you could go back and change your score for Ms. Congo, but you can't; the IOC won't allow that. And you have recurring nightmares about the medal ceremony, where she stands on the podium with her bronze medal, just below the South Korean girl (who trains in the US) and yes ... the Russian chick. But she displays great sportsmanship. She smiles as the Russian flag waves and \"Gosudarstvenny Gimn Rossiyskoy Federatsii\" (that obnoxious national anthem) plays over the loudspeaker. She is probably happy with her bronze medal. She might even be a hero in her home country. But you know it's just not right. She was done an injustice, and YOU were responsible for it!!

Luckily this is Yelp, and not the Winter Olympics. Now that I have eaten at several other Indian restaurants in the valley, I have become a regular at Star of India and would like my previous three star review stricken from the record and replaced with five strong stars. In fact, I'm gathering signatures on a petition that Star of India be renamed Five Stars of India. 

They deserve their gold medal."}
{"text":"Star Of Indian in Ahwatukee is a gem! The food is excellent & very fresh. I have never eaten anything there that would make me think otherwise. We usually eat our favorite dishes every time we dine there but whenever we try something new it is always a wonderful surprise. The service is excellent, the owners are very nice people and are always willing to go the extra mile to make your visit a great eating experience. I've eaten at other Indian restaurants in the area but none compare and it being so close to where we live (The Foothills) it's a perfect place for us. You must try it once for yourself !!!"}
{"text":"I really like star of India. I usually get their chicken tikka masala. I also enjoy their vegetable korma. What stands out for me is their special naan.  Naan bread stuffed with maraschino cherries, coconut, and nuts. I've yet to find it at any other Indian restaurant. 

I agree with another reviewer that the place needs a decorating update. It kind of looks a little shabby. Doesn't bother me much, I just really like the food. When I was going there on a regular basis the owners seemed to know who I was and, they were very friendly. 
I have been going to Star of India for the past three years on my birthday.  Always a good birthday treat."}
{"text":"We lived in Ahwatukee for probably a good 4 1/2 years before we ever tried Star of India and I have no idea what was stopping us. (To think of all that wasted time we could have had together...) We met some friends for dinner here because she worked with a bunch of Indian guys and they said it was the place place they found in Phoenix. I've probably only been to maybe five different Indian restaurants in Phoenix, but so far, I'd have to agree. 

Some particular delicacies you'll find are in the Chef's Selection area of the menu. My husband can't get enough of the Lamb Frazee (I think that's what it is). I can't go for a visit without the Aloo Gobi (in the vegetarian section). 

The lamb frazee on the chef's specials my husband LOVES! It think it's the first one on the list. I can't go without ordering aloo gobi (potatoes and cauliflower) and a side of raita. My favorite time is actually lunch when the have a nice buffet with at least three different main courses and probably three different vegetable courses (almost always aloo gobi is there too). At lunch they bring around naan to everyone but if you request garlic naan, they will oblige. You also will get a plate of tandoori chicken - so good! The toddler loves coming here with us. He eats off both our plates and waits (most often impatiently) for desert. Our favorite (and they're always on the buffet) are those little cold, wet donut balls. God, I love those things. (Though my personal description does them no justice.) 

I ate here throughout my entire pregnancy so maybe that's why the toddler has a taste for spicy ethnic food. (That could also explain his love for ahi...) Either way he's always happy to come, as am I. 

It's priced well and everyone is so friendly and sweet. They're always bringing out extra treats for Beckham (the toddler) like rice pudding and if you haven't been in for a while, they still remember you and greet you like an old friend. Maybe I can talk the husband into going here for dinner tonight? Nothing says Easter Sunday like a little curry, am I right? Jesus didn't sound like a picky guy. And with party tricks like water into wine, surely he would have been up for some curry..."}
{"text":"I have been going to Star of India for years  Food has always been consistently good and their service as well.  For sure their lunch buffet is the way to go for a quick and inexpensive meal.  It costs about $25 for two, tips included.  Their buffet has a decent  selection of vegetarian dishes (cauliflower (Aloo Gobhi), spinach (Saag paneer), garbanzo beans (Ghana Masala), rice, potato (Aloo Maatter, lentils (Daal  Maharni...). Buffet also has lamb, beef and chicken dishes for the carnivores. So there you have it, there is something for everyone. Freshly baked bread (Naan) of your choice is served by your waiter. Of course, buffet also includes fresh greens, tomatoes, onions and more to compose a salad. Lastly, there is a dessert area with pasty balls deep fried in simple syrup (Gulab Jamun) and Rice pudding (Kheer) and complimentary Chai tea.  We enjoy Star of India and hope you do too!"}
{"text":"Near perfection! You can't go wrong with anything you order here! All the dishes are customizable to your level of spice preference. The service is fast and friendly. I love that it is a family run business!"}
{"text":"I visited Star of India with a friend for dinner and we both agreed that it was alright. The service was attentive, which we liked. We had the chicken masala and the lamb vindaloo with garlic naan and rice. The chicken masala (ordered mild) was good, with very tender chicken, but with a little lacking in flavor in the sauce. The lamb was alright... a little tough, as if it was not cooked long enough, and the sauce (ordered medium) was not spicy and, though more flavorful than the masala, it wasn't the most amazing I have had. Overall, it wasn't bad, but it wasn't great. I was also a little disappointed that we were charged for the rice.... really? The dishes (which are not inexpensive) don't come with a tray of rice? Indian food is all about the sauce, the meat isn't meant to be the main part of the meal... so what are you supposed to eat the sauce with? A spoon? It wasn't a huge charge, but I disagree with the concept of it. Anyway, I don't think I will be rushing back, although maybe it is better at lunch time."}
{"text":"This is an incredibly good food stop!  Check out their hours before you go, however, as they are closed during various hours of the day.  The lunch buffet is our favorite--great selections, varied spices and tastes, and all you can eat, of course!  The staff is friendly and knowledgeable, and most of the menu is gluten free, which is important to us.  It's quiet, clean, cozy, not expensive, and decorated classic Indian.  Trader Joes is next door, as is a bead store for the ladies in you group (needs a motorcycle shop or gun store nearby for the men).  If you like Indian, you'll like Star of India!"}
{"text":"My husband I LOVE this place. Sure, it's not a five star restaurant, but they aren't claiming or trying to be. Their food is very, very good, though. My husband is Indian and has probably tried every Indian joint in the valley and we always end up back here. Their Chicken Muknee and any of the saag dishes are our favorite. The naan is also hot, a little yeasty and chewy- melt in your mouth yummm... 

By the way, if you don't like buttery food, why are you eating Indian cuisine at all?"}
{"text":"Very delicious! And really great prices! I had the Tandoori Shrimp Masala (Medium) and it was absolutely amazing. Hubby ordered the Lamb Vindaloo and he really enjoyed it. His only complaint was that he went to order it \"Hot\" and after an \"Are you sure?\" from the server he changed it to \"Med-Hot\" and he wished it was hotter. My medium was flavorful and I was very pleased with it though. Everyone has a different take on heat level, so he will try it Hot next time and I am sure it will be great. We split an order of Garlic Naan which was absolutely delicious! Overall, a quiet little place, with good service and great prices. We have finally found a restaurant in Awhatukee where we were not disappointed! We will definitely be back."}
{"text":"Went back this weekend and guess there's a new owner. Service was horrible and wanted to order some wine, but waiter never came back. Bathroom had holes in the wall and the menus had disgusting film all over them. To top everything off (frequent patrons will get this) Halle Berry picture is down!! Food was good overall, but am not paying an extra $6 for rice that should be included in the dish. From now on, will go to local store, purchase frozen Indian food, microwave and be happy."}
{"text":"Star of India has an upscale Indian restaurant theme.  The prices are definitely upscale, but is unfortunate that I can find better food at simple Indian establishments.  The food is well spiced and flavored, but the main problem I had was that some dishes tasted exactly the same.  The Korma and Mattar Paneer should be two distinct tasting dishes, even though the color of the sauce is the same.  The Korma has a little bit of a sweeter taste normally.  The naan was not too special and slightly burned.  I would say the service was similar to an upscale restaurant.  I would take a date here, but only if she has never tried better Indian food before."}
{"text":"Star of India has a delicious lunch buffet. The restaurant smells wonderful when you walk in. Naan is included with lunch, either plain or garlic. I like to add the yogurt sauce and the sweet red sauce over the yummy chicken Marsala and spinach."}
{"text":"Star of India is my bf's favorite place to go for a good inexpensive lunch buffet near CMU.

They usually have a selection of about 4 stews/curries, tandoori chicken, pakoras, plain naan, palau rice, salad, and sweet rice. They also have some pretty decent mango juice. 

The place is pretty spacious, and even if the restaurant is full, I feel like I can breathe. The service is friendly, my water glass is always full, and they're not above asking whether you're done with your plate if they're not sure, before they take it away. (I somehow find it upsetting, in other restaurants, when I have to take a restroom break, to find my half-full plate gone when I get back)."}
