{"text":"Oh Starfish, how do I miss thee.  I no longer live in Toronto but will always be a fan and love to spread the word.  The selection of oysters are the best I've seen anywhere and I love the freshly grated horseradish and the in-house made hot sauce.  My love of oysters started here and has left me on the quest of finding anything as close to this in Durham, North Carolina.  I also had the opportunity to try Sea Urchin for the first time here, the process is delicate and the result melt in your mouth.  Patrick takes great care in the presentation with beautiful results.  Want to know about oysters?  Patrick is the oyster master in my book and you can find out for yourself by picking up a copy of his book, \"Consider the Oyster, A Shucker's Field Guide\"  When back in Toronto, you are sure to find me at the bar (which by the way is made of oyster shells) eating a variety of succulent molluscs while sipping a beer."}
{"text":"Lovely people. Lousy service. But not necessarily the fault of the wait staff. Sat at bar, having decided to pop in for a nice solo lunch. Greeted warmly by floor waiter, seated at the bar (my choice), and given menu. Utterly ignored by the young guy behind the bar who had his back to me and was busy shucking oysters, assembling trays of dozens of same and preparing the appropriate garnishes. And pouring drinks for the three people immediately in front of him.  I don't think he knew I was there. Getting his attention required the assistance of the other customers closer to his shucking station. I was not approached for a drink order, a food order, or any follow up. I had to ask for all service including a plea for bread and finally the bill.  Several decades ago I worked in the restaurant business. I know how tricky it is to balance the ratio of staff to customer so that you can keep costs down while providing good service no matter the volume of business. But a la minute presentation of oysters and the accompanying story about each takes time. I wanted to ask the poor guy if he dreads oyster orders because they are so time consuming to prepare and present. They are the big ticket item - and the heart of Starfish - so they deservedly require the attention but seemingly to the expense of attention to everything else.   The fish cakes were tasty as were the Irish muscles. The fries were cool and limp and the accompanying mayonnaise was looking congealed and unappetizing by the time it was delivered. But what can you expect when your waiter is so busy carefully shucking and arranging large platters of oysters? Something had to give and my lunch was clearly the sacrificial mollusk.   Lovely people. Good food. Lousy service."}
{"text":"Fabulous meal! Great service. Nice quiet ambience on Sunday."}
{"text":"One of the best oyster restaurants in North America!    The reason:  an obsession for the highest quality in oysters, shucking, source knowledge and presentation.  No, not the fanciest restaurant in Toronto.  But the combination of oysters, an interesting wine & dinner menu and the friendly banter of Patrick and his expert shuckers earns Starfish five stars.  Sit at the oyster bar, order a glass of something with bubbles and enjoy!"}
{"text":"Meh. I've experience better is exactly the right description for Starfish.  Sadly we went during Summerlicious.  What might have started off as a brilliant idea certainly hasn't lived up to it, despite being in it's 10th year.  The evening started off alright, we were seated promptly.  It took a while to get our drinks but nothing appalling.  Our server was Niamh (pronounced 'Neve') and service deteriorated as the dinner went on.  By the time I was ready to order a second drink, it was difficult to get her attention.  Dessert took surprising long given that it was Summerlicious and presumably, most of the desserts are easily on hand.  Given that the sticky toffee pudding is a popular item, I'm not quite sure what they anticipated in terms of the number of orders.  Niamh apologized for the long wait for dessert around 8:35. Again, while waiting for dessert I tried to order a coffee but with not much success.  I ended up ordering it from another server who was passing by our table.  By 8:50 our desserts arrived and at 8:55, just as we had started our desserts, Niamh gave us our bill and informed us that the table was booked for another seating at 9:00 pm.  I get it: Summerlicious is busy.  But having said that, if there are delays on the part of the restaurant, I hardly think it appropriate to rush your customers.  Food.  We all ended up ordering the mussels from the menu.  An unacceptable number of my mussels were unopened (i.e. dead before they were cooked) and a couple of them were just off tasting.  Issue with quality control.  I get that mussels are going to be stronger tasting now that say in the summer months, but that doesn't mean you send out subpar food.  All in all, it looks like Starfish tried to cut some corners (number of staff? quality of food?) to capitalize on the volume of diners coming in for Summerlicious.  I will say that I have previously gone to Starfish and had had a pleasant experience.  The mistake of going again during Summerlicious has far outweighed that prior visit and I would not go again.  There are plenty of other quality seafood joints in this city."}
{"text":"Went for winterlicious for a late night dinner. Oysters were very delicious. Main was nothing extraordinary but well made. Toffee was amazing - melted in your mouth. Service was fantastic!   One of the best deals for winterlicious 2013 by far- $35"}
{"text":"It seems sacrilegious to admit to not having shellfish here, but I'm wary of seafood in land-locked Toronto, especially on one of the hottest days of the year.  My friend and I shared the sourdough toast with mushrooms and bleu cheese--a lovely, complex starter that our waitress recommended when we asked what was good for sharing.  I'm sure the rest of the menu is just as delicious."}
{"text":"5 stars for the oysters, -2 for the limited menu, +1 for the thoughtful service and its a nice spot for all purposes"}
{"text":"Starfish is yummy, cool almost casual-ish ambiance, memorable caesars.  Friendly service."}
{"text":"**EDIT: After reviewing some more restaurants and putting everything into perspective, I think starfish deserves a 4.5 to a 5***  My girlfriend surprised me by taking me here one night and she deserves a giant starfish in points because I have not been so pleasantly surprised in quite a while!  The decor was unique, covered by starfish collectibles. It was a good blend of casual to intimate. Our waiter was super amazing; you all know those restaurants where the service dampens all the fun... he definitely enriched our meal with his charm.  We ordered a mix of North American oysters to start. They were fresh and giant! It was almost scary how big they were, but I guess that shows the quality items the restaurant goes for. I also had their Bloody Caesar which had a fresh clam for a topping. Now know this: I usually try a Caesar at restaurants where I feel that they might do a good job (and the fresh clam caught my attention here) but it was not to my liking here. There was way too much horseradish in it and my clam was sandy.  For my main, I ordered the scallops. ABSOLUTELY DELICIOUS - but I'll get to that in a bit. Decent plate presentation, about 6 or 7 large scallops distributed on a really big rectangular plate. I don't know, wasn't so crazy about it. It made the portion seem smaller as there was so much space on the plate, but by the end I was pretty done with scallops. It was actually quite a large portion. Anyway, the scallops themselves were to die for. SO PLUMP AND JUICY!!! The texture and flavour of the scallops is exactly what I imagine heaven to taste like in food form! It was served with crispy asparagus which were a little bitter - totally complemented, and even enhanced, the scallops. I would absolutely recommend this dish to anyone.  My girlfriend had a curry white fish which she enjoyed. I wasn't in the mood for curry (and who is when they have a plate of juicy, plump scallops in front of them???) so I can't really comment on hers. The presentation was really average on this dish though, but the portion was large.   In summary... atmosphere 4/5 service 5/5 drink 3/5 food 4/5 (with the scallops being like 6/5) price 4/5"}
{"text":"For the past few months, on my way to night class at George Brown College, I pass by this cute yet elegant looking restaurant, yet never had the chance to experience a meal there. I finally decided to get a group together to enjoy some fine seafood and check out Starfish.  We were a group of 8 girls who wanted a relaxing Friday evening with good food, and that's exactly what we got!  We weren't too happy with our server initially, (one would expect a waiter to be extra keen serving a table of 8 lovely ladies) but he warmed up to us eventually! Now to the more important details...we sampled various freshly shucked oysters from both Canada and abroad (UK and Ireland), I was quite impressed with the ones I chose (St. Simon). Not bad for $2.75 ! I loved the toppings of horseradish..yummy! I'm not really an oyster connoisseur, but appreciated them.  The other appetizers looked pretty good and were priced between  For mains, I had a plate of mussels with fries...also very nice. Some of the others ordered fish and had mediocre views on their dishes. I took a small nibble of one's sea bream and it was cooked very well! The best part about the food was its quality. The menu varies periodically due to what seafood is in season. I felt good about this because Starfish guarantees freshness and only the best ingredients from the ocean!  We concluded our meal with dessert...totally oh la la! The creme brulee was so so, it was fairly gourmet, very elegant looking and had a nice punch of ginger flavour, however what really stole the show was the sticky toffee pudding- an absolute must have!!  If I go here again, I would change my order to a platter of dozen oysters, an appetizer and the sticky toffee pudding.  Overall, good evening out..I'm glad I got to experiment Starfish and finally discovered what it's all about. The night would have been flawless had I found a pearl in my oyster shell! A gal can always dream can't she?"}
{"text":"Went last year not during Winterlicious, but a normal period in the fall. Our group was craving oysters but wanted to go to a place that is a walkable distance from our homes, hence we went here instead of Rodneys or Oyster boy (places I love for oysters).  First of all we ordered the seafood tower based on the waitress' description of what the tower entails. She vastly overstated the number of oysters and the TYPE of oysters we would get in the tower. We got the tower instead of ordering the oysters a la carte based on her description, and was SORELY disappointed when we received the tower:  First of all, we got zero European oysters, which she said would be in the tower.  Secondly there were significantly less oysters than the number she stated to us.  Thirdly it came with cooked shrimp which were over-cooked and pretty small, overall we would not have ordered the tower if we knew what we were getting.  There were also a few razor clams in the tower and cooked mussels, nothing to write home about. The oysters by the way were just ok, not as fresh or as well shucked  (there were shells in a few, and a few were stuck to the shells still) as Rodneys or Oyster boy, and they have a smaller selection than those two places too.  FYI, the waitress only notified us of the error in her description once the tower arrived, not before, and our group was too polite to send the tower back even though I said we should (because we ordered it based on incorrect information).  We had also ordered Fish and chips, which consisted of overcooked greasy and bland fish, and average fries, so overall this dish was a FAIL. Even the hungry person, who is not that picky of a eater in our group could not finish this dish  For the price, food and service we received that night, I award my first 1 star review to this place."}
{"text":"So I had been to Starfish before and had really enjoyed the experience. I decided to book a special event there with eight of my friends. What a gong show. First off they ran out of some many things before 9:30 pm including a ton of different beers and food choices. The server was clearly not into providing great service and many within our party had to wait for over 20 minutes to get a drink. I mean I could see the bar from our table it would have been easier to go and order at it. We finally placed some orders and some of the items we ordered never made it to our table until we had to remind the server a few times we were still missing food. While they did have lots of oysters which is good I was very disappointed with the other aspects of our time there and I am in no hurry to go back. I will be looking for other options when it comes to oysters and seafood particularly a restaurant that actually cares about services."}
{"text":"Came here last week for winterlicious. My friend was craving for oysters and fortunately starfish had some open spots for lunch. I was late for 30 minutes so they serve her some oysters first.  Service was decent. They didn't try to get rid of us quick. When I came, I ordered more oysters. It was decent, but I've had better. It tasted a bit fishy, so I'm not sure about the freshness of the oysters. My usual favorite is the kumamoto oyster, but the ones they have here is not fresh at all. It lost all of its buttery taste.  I wasn't impressed by the winterlicious menu. The taste is so-so. Visually is alright, but it definitely didn't give a good impression of the restaurant compared to the photos on yelp. I don't think I will come back unless I'm craving for oysters and rodney is close."}
{"text":"I came here for Summerlicious 2013. I heard they have great Caesars, so I wanted to try one. This was my first time having a Caesar, so I wasn't too sure what to expect. I was watching the bartender make the drink and it looked like a lot of effort when into making it, lots of ingredients. The drink was nice, but not for me. It had too much going on for me to enjoy it.   We ordered the oysters to start, which were absolutely delicious! I love the fresh grated horseradish that comes on the side. I could see the girl preparing the oysters for us behind the bar, I like this aspect of the restaurant.   My entree was the mussels, which were also delicious. I really enjoyed my meal and the fries that came on the side with my entree. However, my fiance's entree was just OK. He ordered the salmon and I noticed that his piece of fish was on the small side compared to the bigger size fillets that other customers were receiving at other tables. This was poor on the chef's part.   Desert was just OK, nothing special.   The reason why I am giving Starfish a low rating is because of the small salmon filet (since clearly other customer were receiving bigger pieces of fish). Also, service was rather slow and unprofessional. We made reservations for lunch at 1:30pm. The place was only about half full when we arrived, yet service was slow. It started to get busier between 2:00-2:30pm, people who arrived were waiting for quite a while by the door before the host attended to them. It created a lot of congestion by the front entrance (since it's a small area). There should have been more staff on duty.   Also, I noticed that the host didn't actually bring people to their table, he would just point and say \"You see that big table back there? -- that is your seat\". I have never seen this done in a restaurant before. He would do this with big groups too. It was rather odd. Starfish is a small restaurant, so it doesn't take much effort to walk your customers to the table they will be dining at."}
{"text":"Another lovely night at Starfish, great food, great service, warm atmosphere, love the bar and I'm not a drinker. There is something 'fun' about Starfish and I'm glad to have found it."}
{"text":"It was a Tuesday night, and the restaurant was not very busy. After reading positive yelp reviews of this place, I called to make a reservation, but was told they did not take reservations. But, when we arrived at the restaurant, the host asked us if we had a reservation and was confused why we were advised we couldn't make a reservation.. I wasn't particularly annoyed since we still got a seat in a nice area in the front beside the bar.  For all you oyster lovers, this place has a great variety of oysters! We ordered a North American Platter and the European platter. I had around 24 oysters.. (so full afterwards!) and the only one I liked that wasn't too salty was the Kumamotos, which are small, sweet, almost nutty oysters characterized by their deep, almost bowl-shaped shell.   Our entrees: 1.) Fish and Chips: 3/5 - the fish could have been crispier, but it was really fresh, but the fries were a bit soggy.  2.) Steamed Mussels: 2/5 - the mussels were small and dry, I've definitely had better. They were accompanied with the same soggy fries.   I also had their infamous Starfish Caesar! I agree with the rest of the yelpers that this Caesar is one of the best I had in a while. There's an actual oyster on a skewer inside my drink, with just the right amount of horseradish. I find that most restaurants go overboard with the pepper and horseradish, making it way to spicy for me to handle.   For dessert, we had the toffee pudding, and it was wonderful! It looked like a very ordinary piece of cake drizzled in toffee sauce, but I wish I wasn't so full already after I took a bite of the warm, rich texture that melted in my mouth.. I highly recommend ordering this!   Our bill at the end came out to be around $145 - a bit pricey for two people, but the food is decent enough.   The only reason I rate them 3/5 stars is because of the service. The staff here were not very friendly. Our waiter did not crack a smile once, and the lady behind the bar shucking oysters was also very unfriendly. I didn't have high expectations for the service, but when I say \"Thank you\" to someone, it's nice to hear \"Your Welcome\" back or even a smile."}
{"text":"Sorry Starfish,  one star + one star =  two stars for you.  I'll start off with what I actually did like...The oysters of course.  Starfish offers a decent seasonal selection of oysters, East Coast, West Coast, and away (that evening oysters from Ireland, Scotland, NZ) ranging $3 - $4 dollars each,.  We had a large group, which makes it confusing for sharing since all the oysters were served from a giant platter in the center of the table and we all ordered different ones.  Shucked and perfect, they were slurpy and delicious.  I love oysters from PEI and NB and I was happy with my order.  I recommend getting the platter of 12 oysters for $30 to share. We didn't... but we wish we did.  As for my main, I ordered mussels and fries. ...And I was disappointed.  Mussels were minuscule and flavorless. That's all I really have to say about them.   Now, what really made my experience suck here was the service. It was horrific. There were moments when I actually wanted to jump up and slap the server across the face.  What an asshole.  He rude and abrupt.  He had this sour bitchy look on his face the entire night.  It was like serving us was a chore.  He made people at our table uncomfortable.  Some people wanted to ask questions about the menu but didn't, because they didn't want to make him speak.  If you do go to Starfish, the oysters and sticky-toffee pudding are wonderful choices.  However, my experience was so crappy, I'm not even going to give the place another try.    And I hope I run into that jerkface server again... maybe after I've had a few more glasses of wine... then I won't be so polite."}
{"text":"Others seem to be mentioning speed of service here. Sit at the bar if you can. I've never had a problem with the service. Knowledgeable, friendly, and attentive."}
{"text":"Just off of the financial district is this little gem of a restaurant that has some of the best oysters in town. Starfish is now probably one of my favorite restaurants to relax in after work.  Everything about it is perfect.  The ambiance is great, the music, the attentive service, it's all excellent.   A couple of my friends are pretty regular here. They often come for the happy hour specials which is a $15 East Coast oyster special and that gives you an alcoholic drink for $5 extra.   I tagged along for this trip and instantly liked the whole atmosphere of the restaurant. As it was around 4pm the dinner rush hadn't started yet so it was fairly empty.  We got great service, drink orders were taken quickly and delivered promptly. We ordered 4 orders of the East Coast special and it came in one ginormous platter.   We had a lot of fun going through all the oysters (Green Gables) and trying them with different combinations of sauces and some just straight up.   We didn't order any other food as this was just a casual snack that we had but we stayed until 6 at which point a waitress or hostess came over to politely tell us that the table we were seated at was reserved for an incoming party.  We were about to leave anyways but it was disappointing to essentially be told we were going to be kicked out. Even at 6 the restaurant had yet to fill up.  In any case that didn't really spoil the experience.  I will definitely be back to enjoy another dozen of their delicious oysters and very relaxing, calming ambiance."}
{"text":"Found this gem while browsing the Summerlicious menu.  Not sure about their regular menu, but during Summerlicious you can get an amazing three course meal for a great price.  If you appreciate seafood as much as I do, especially oysters, you should definitely try Starfish.  Even with the smaller Summerlicious menu it was hard to choose.  We each tried a different dish and they were all very tasty and well-prepared.  The service was also very good, even when the restaurant was packed.  We had lots of questions about the items on the menu and our waiter was very patient with us and definitely knew what he was talking about.  The decor isn't anything fancy, but is definitely cozy.  The floor isn't quite level in some areas (even before the wine sets in), so watch your step!  The seats at the bar were very popular that evening, but our group was better-suited for a table.  We were seated in the back room, which was nice and private at first, but quickly filled up and got a little noisy.    If you're driving, watch out for the timing of street parking.  Our dinner reservation was relatively early (around 6pm) and we had to wait for rush hour to end before being allowed to park there on a weeknight.  Can't wait for Summerlicious!"}
{"text":"After attending a wonderful performance of Les Miserables, my date  and I braved the elements and trekked our way to Starfish. We both had been craving oysters for weeks and knew we needed our fix. Now, I had been to this restaurant before twice and was never disappointed, so I wanted to share the experience with my fellow bivalve-lover.  We started with their oyster special: $25 for a dozen of North American oysters. Glacier Point from Alaska (the best of the bunch,delicate yet complex taste, very refreshing), Moon Point from Connecticut, etc, well you got the point, right? Overall very good selection. Maybe it is the time of the year, but the oyster selection was not as big as on my previous visits. My companion is big on horseradish so she loved that an abundance of it came with the platter.  Then we each ordered a main. I, the rainbow trout that came with broccolini in a sherry-based sauce and it was delicious. She had the pickerel that came with spaghetti squash( oh so good) and the seasoning was middle eastern with a nice hint of cinnamon.  I ordered a dessert: the chocolate cake with spiced cranberry compote. I experienced a major flavour explosion in my mouth.  With 2 glasses of Sauvignon Blanc from NZ and a coffee, the bill came up to $129.  Honestly, I love this place. It is not that every meal is memorable but consistently good. The service is efficient (mussels shucked and brought to table at light speed) and pleasant  with nice little touches( waiter gave us Santa pins shaped like a starfish) and every food item is fresh and well-prepared. The restaurant is cozy, well-decorated and the music in the background groovy and funky.  Definitely a great place to get your oyster and fish fix!"}
{"text":"I am not an oyster fan. I know this is shocking for some people, and our friendly shucker even invited me to leave when he learned my dirty secret, but I loved the Starfish anyway. The raw clams and scallops stood out as the best thing all night especially since I had them with a great martini. My friends had a dozen oysters and were raving about them, and the fresh horseradish was also a hit. We shared the octopus dish with sausage and lentils, which was a surprisingly fantastic combination and the best cooked dish we had. S had the fried softshell crabs, D had the whitefish with ramps, and I had the sturgeon with beets, cabbage salad, and potatoes. The sturgeon was the best of the three, hands down, although fried softshell crabs are pretty much good no matter what. The rhubarb sauce on the side made them stand out. I would go back again and again for drinks and raw seafood and be perfectly happy."}
{"text":"Toronto, Ontario- Quaint place, slightly understaffed but very sweet and accmodative staff- sea bream was great, cooked just right- the calamari is not your typical fried- it's grilled and you get the true flavor and feel of squid- I'd go back for sure"}
{"text":"Was here during the Summerlicious period and decided to order the fixe prix menu as it looked too good.  Oysters and mussels were very fresh and tasty but that was about it.  I had the Salmon Risotto and it was nothing special and small.  The chowder was like watery with close to nothing in it.  The Mussels was good size around 20 but what is up with the fries and how soggy they were.  The dessert was my favor as I got the sticky toffee pudding.  Okay so the food is pretty good but that is not what killed the rating.  The service you asked, what service? I was there around 2:30-3pm and there was only a handful of tables.  Took them 20 mins to sit us when I can clearly see all the empty tables.  Once we got our table took another 10 mins to get asked if we want anything to drink.  And we were trying to flag our server down to take our order and he keeps telling us he will be back in a min.  It might just be our server as I can hear the table beside us having the same problem.  \"Where is this guy?\" from a young couple beside us.  It was a mess especially coming from a restaurant of this magnitude I expected more.  If it was busy I could understand but when there was 5 tables only and you get such shady service I am done here.  Rating:  Service: 1/5 Food Quality: 3/5 Comfort 3/5 Decor  4/5 Value: 2/5 Parking: 2/5"}
{"text":"Yum, best oyster bar in my memory bank.  Bartenders shuck and serve oysters between serving drinks, pulling off the hipster- my-only-speed-is-laid-back thing- really well.  Everything was fresh. We sat  at the bar  for a round of drinks and as out oyster sampler was created--lovingly including fresh grated horseradish. We savored every one.   Then moved to a table by the window for dinner one of our group got the special which was well prepared others shared salads and more appetizers.  Will be back next time we are in TO."}
{"text":"Delicious bistro style fish and chips!  The fries are skinny and cooked with herbs -- yum.  Overall a great choice for a restaurant if you're looking for something a bit nicer."}
{"text":"-Service was horrible (never checked on by waiter, snobby staff, couldn't even get a refill of water, served by 3 different people/no dedicated server) -Food : Oysters were great. Fish and chips were most bland ever (over-salted fries, fish tasted like nothing.. batter was worst I've had ever)  Verdict: Save your money Go somewhere else."}
{"text":"We had a lovely table for a large group of 9. We all sat comfortably, while being able to all speak to each other. The noise level was on the higher side, so we felt comfortable in being loud. Though I wouldn't say this restaurant is suitable for an intimate dinner. That being said, we were seated in the first room of the restaurant, and I can't comment on how the inner room's environment is.  We ordered 2 dozens of the mixed oyster platter, which had 3 types of oysters. I'm not an avid oyster eater, so I can't recall the names of those types. As my second time eating oysters in my life, I really enjoyed them.  Additionally we each ordered individual dishes. I'll do a run down of the other dishes we ordered as a group:  - Mussels. A few of us ordered the mussels dish because it was the most inexpensive main dish at $19. A good portion, tasted good. The broth was on the salty side, but had good flavour.  - Grilled calamari salad. I'm not a fan. The calamari was very rubbery and barely grilled. The salad didn't taste good at all.  - Crab chowder soup. We were all surprised when the soup came in a red colour. We were expecting it to look white. It was decent, again on the salty side, but that just might be my preference. For the portion and taste, it wasn't worth the $10.   - Fries. These came as a side for 4 dishes that were ordered, but they brought them to us in 2 big plates for us all to share, without us even requesting it. The odd thing about the fries (and rather gross I'd have to add) is that the dipping \"sauce\" they served with them was nothing but ... butter.   - Baked oyster in bechamel sauce. This is what I personally ordered, and it came off of the Small Dish menu. 5 oysters for $14. They were absolutely heaven. I would definitely want to eat more of these baked oysters.   - Sticky toffee pudding. A whopping order of 5 of these were served to our table as we were recommended to try out the best toffee pudding in town. It was more of a cake than a pudding. Warm, moist, soaking in sweet sauces, it was definitely well-recommended. I almost never order dessert when I eat out because usually they are too sweet for my liking. I approve of this one."}
{"text":"I've been here a few times but the last time, Friday, was just meh. Oysters are always good, but the mains need working on. The appetizer, fishcake, was mediocre, and service was extremely slow even though it was not busy for a Friday prime time dinner night. The waiters/waitresses are also subpar for the service you are expecting. For the price I paid, I would go somewhere else even though I live half a block away."}
{"text":"Just ok for the dining and service was not up to my standards.  Could not get over how dirty the restaurant was. The floors looked as if they were last refinished three decades ago; the curtains looked as if something was living in them; the windows looked as if they were cleaned with the floor mop and the menu looked as if it was printed two decades ago. Advice, go elsewhere for atmosphere and service like they wanted you there."}
{"text":"I ordered the east coast plate for 12/$15. Oysters were from New Brunswick and PEI. They weren't as clean tasting as I would've liked, too brassy and briny for me. But my boyfriend liked them :) So to each their own.  Everything else on the menu is ridiculously overpriced. The fish and chips were $18. It had 2 small fillets of panko bread crumbs battered fish. (Perch fish I believe.) With a bit of shoestring fries and a side of coleslaw. For almost $20, I expected a much bigger portion of fish and chips.  The Caesars we ordered were alright, I'm not sure what they put around the top of the glass, but it definitely wasn't celery salt. The drink also had way too much horseradish!   Service was slow, only 1 waitress was working when we first arrived at 5 pm, then more came on later in the night.  Overall, decent experience but nothing amazing."}
{"text":"Phenomenal flavors with a cozy vibe...pair that with terrific wines and pro staff, and this one is a winner."}
{"text":"Yes yes yes!  Starfish reminds me a bit of Luka's Taproom in Oakland, California.  It serves sophisticated and very good food in what looks at first to be a generic dive bar.  For Luka's, the theme is German; here, it's Irish.  We didn't try the oysters, but we did check out the soup (Grace's chowder), a salad, some smoked trout and a bit of grilled local pickerel.  Everything was great.  The tastes complemented each other, and (more importantly) we had a great time.  The tables around us had bottles of wine, mostly white wine.  I had half-pints of two local beers and liked both of them.  There are some wines by the glass, both red and white."}
{"text":"Skipped the Summerlicious menu:  Great Tsarskaya, and Malpeque oysters.  Delicious Haddock cakes.  Subpar lobster.  A 3lb lobster arrived, cut in half with all the brownish green guts spilling out, and the fleshy bits were NOT sweet.  This subpar lobster was $28/lb.  A total turn off.  The Sticky Toffee pudding that they are known for was perfect, but they did not pair it with a coconut ice-cream they had, because they were \"saving\" it for another desert pairing.  Had to shoo away a lot of fruit flies in the back room where we were seated as well."}
{"text":"Starfish Oyster Bed & Grill is the sister restaurant to Ceili Cottage.  Behind the helms is the Captain of shucks - Patrick McMurray (check out his accolades on your way to the washrooms they're quite impressive).    Before hitting a Pink Martini concert, and it being a hot day out - we wanted something light.  My first thought - OYSTERS!   Located at Adelaide & Jarvis, this restaurant is especially busy between 3pm - 6pm for Zinc + Drink where you can get a dozen oysters for $15 (1 varietal) + $5 drinks.  If you want a mixed plate that'll cost you $25.   Worthy of mention is that the menu is changed DAILY (hot off the press at 5PM).   And while I'm not a huge fan of the redheaded heroine from the hometown of Green Gables, the oysters from this East Coast locale are a winner and my go-to East Coast Canadian shuck.  Move aside Malpeques!  This is served up with FRESH horseradish (none of that bottled nastiness), cocktail sauce (more like a jam), and a Champagne + shallot mignonette.  I'm a purist, so I liked it best with horseradish and squeeze of lemon.  Their Caesar is one of the best I've had in Toronto and at $5 a pop, make that a double ;)  Bread is baked daily in house with the herbs du jour.  Today's was a cheese + chili potato bread and it was a nice change from the boring ol' baguette.    We also opted to start with the Duck Rillette served with house pickled veggies, whole grain mustard and spiced pear jelly.  The rillette was really well-done, not too dry or tuna-like and it went fabulously with the pear jelly.  The crostini were warm and housemade.  Mmmm....  For our main we opted for the European Sea Bream served with spaetzle and broccolini.  The thin fillets were cooked just right with a nice crisp skin.    I wish I had space left for dessert, but I didn't (though I think I will definitely return to try their Lychee Crème Brûlée with sake.  I also saw very nice looking whole boiled lobsters that I want to return for.  With their Zinc + Drink promo something tells me I'll be back here quite often throughout the summer."}
{"text":"THE place to go for oysters and seafood in Toronto! However, it is not cheap but then again you pay for what you get. Oysters-fabulous selection of west coast, east coast varieties along with some off the european delights occasionally. And I love their fries, thin, crispy and fried with thyme leaves. Fish here is also done well. Service can be a bit chaotic sometimes as this place is booked very often or gets filled quickly and there can be a wait at times with one or two oyster shuckers doing the work. But if you're looking for fresh, top notch oysters-this is the place to go."}
{"text":"One of my very favorite restaurants in the world!!    The best selection of oysters you'll find anywhere; fresh, tasty and prepared in more ways than I can note!  Plus an excellent variety of other seafood."}
{"text":"I was there yesterday. After eating here, i got very sick. I would not recommend this place to anyone.   Even if I hadn't gotten sick, I still wouldn't have recommended it. Slow service, very little menu selection, and the prices were pretty high for what you get.   Stay clear of this place unless you want to pay $100 to be disappointed and sick!!"}
{"text":"Just go for oysters. The mussels are okay, but the flavor feels muted (needs more garlic, pepper...something, anything). They aren't nearly adventurous enough with their oyster shooters, a drink concept that calls out for experimentation. Our waiter was incompetent. Mysteriously, however, he was replaced mid-meal, so I suspect maybe he wasn't a real waiter and was just filling in. Anyway, not a bad place if you want oysters, which are the food of the gods."}
{"text":"The Food: We came here for Summerlicious 2013. I was very excited because I'd heard that the oysters were delicious and they were! We all ordered the oysters for our appetizer, the salmon for the main course. For the dessert, there were three choices and since there were three of us, we ordered one of each. Free bread was included before our appetizer and it was really fresh. The crust was crispy while the inside was soft. We asked for another serving of that and they had no problem giving it., After a bit of a wait, the oysters came. We sat at the bar so we watched the shucker shucking the oysters. He did a really good job of it by smelling it to make sure it was fresh before shucking it and if after he had shucked it, if it didn't seem up to par, then he tossed it away. After shucking, he would grate the horseradish and display the slice of lemon on an empty shell. It was so delicious, but such hard work so we understood why the wait time was what it was. The oysters were so good that we ordered another plate of it. The salmon was also very tasty. The sauce was well made and the salmon skin was a bit crispy. However, it was a bit on the small side, but I guess it's because it was from the Summerlicious menu. The desserts were just ok. Nothing to rave about.  The Place: A cozy little restaurant. We called the day before we wanted to go and weren't able to secure a table, but were given the choice of sitting at the bar. That was fine with us. The bar was has a glass top and inside were displayed a whole bunch of oyster shells.   The Service: When we went, the restaurant wasn't full, but the wait time for the dishes was a bit long, especially for the salmon, but I feel that the food was worth the wait. Our waiter at the bar wasn't the greatest, but it's understandable because he was also the lone shucker and he was shucking non-stop the whole time we were there. Perhaps, they should have another waiter take over waiting duties for those at the bar so the sucker is able to focus on just shucking. I could tell that he was a bit stressed out.  The Verdict: I'm planning to go back again for those oysters! Each one I had was delicious and fresh. I'm going to try the caesar as well since so many people are raving about it."}
{"text":"The rating is based on our Summerlicious experience of 2012. When we dined here in 2011, it was absolutely perfect. However, this year, a few things went wrong. The first portion is just our little rant on the hostess and service this year.  The hostess was on the phone when we got to the restaurant. That is fine normally, but this hostess did not even acknowledge our presence. She did not gesture for us to wait, or look at us; she kept her eyes on the booking book in front of her. This went on for a good few minutes, meanwhile, the 6 of us just stood there looking at each other confused and a little annoyed. After she got off the phone, we told her about our reservations, she led us to our tables with a very disinterested face.  When we arrived to our tables, I noticed a lot of free space and we can totally move the 2 tables together to form a bigger table to fit all 6 of us. You know, so we can all sit together. But when asking our hostess about this, she said \"no.\" with a very firm voice and walked away. But she walked away a bit too quickly seeing that I also wanted to ask if it's okay to move a chair, and squeeze everyone into one table instead. I found her at the front but she was on the phone, again, she did not acknowledge me standing in front of her. I stood there for a few minutes and realized either the customer on the line is really taking their time, or she is just pretending to be on the phone so I can't talk to her. So I left to go back to our tables, and decided to ask the waiter that was there whether it was okay to move a chair. He thought about it, and said sure.   When we started moving the chair, the hostess quickly rushed our tables and openly argued with the waiter \"they can't move to one table, because if there is a free table, we have to use the table.\" and also mentioned \"if they take a chair, there is only 3 chairs left, we can't use a table with only 3 chairs\"   We just found it very ridiculous because we shouldn't need to hear all of this...especially since in the end, they just added another chair from the back to the table. It wasn't a problem, and was never a problem...we even gave them a free table. We have never experienced such poor accommodations and inflexibility for something so petty. She was a very difficult person deal with. And it's funny how us, the customers, have to deal with her instead of the other way around. After our meal, I tried to find the manager to provide a verbal criticism, but the manager was unfortunately not in so I just told another waitress.  Oh, and our waiter was also very expressionless and slow. Our dirty plates piled up and he took no initiative to take them away...especially since it was 6 people in a 4 people table....we really needed the space to eat our food and put our cups.   ------------------------------------------------------------------------  The food this year was disappointing. We mainly went for the oysters but were given 2 very tiny ones in the appetizer. They also did not have the decency to separate the \"tower\" which is part of the appetizer. We had 3 orders of the \"tower\" appetizer but received it in a single martini glass. We are fine with sharing saliva, but it became an inconvenient when we all tried to fit our forks in.  The entree portions varied a lot, even among our group. 2 of us got the salmon dish, 1 piece of salmon was pretty thick and large while the other was a tiny piece of thing. 3 got the mussels, and the portions were once again, varying. One plate was much higher than the other, while the other 2 were smaller. They also found a good amount of empty shells.   The desserts were alright. There really isn't much to say about them...they were far from amazing, but wasn't too terrible either.   Let's just say we will be finding another oyster bar to dine in next time. Maybe we entered with too high of expectations considering our wonderful experience last year. We left disappointed with a hint of bitterness :C"}
{"text":"If I was mostly interested in oysters and a glass of wine or a pint, I'd probably pick Oyster Boy or Rodney's, but if I was going out with a friend who doesn't like oysters (perish the thought!), Starfish would probably be a better choice because of the wider selection of non-oyster dishes."}
{"text":"A HUGE disappointment!  The service, a large party of great geek tippers. The food was certainly not not very good at all with the exception of the desert.  The service was not very hospitable. Do not waste you time."}
{"text":"A Starfish, at least the ones we're familiar with have one, two, three, four, Five.  Five arms and I'm taking Two of them away and then some.  This style of place reminds me of a Boston Seafood establishment(Neptune Oyster) near Faneuil Hall region that I regret I never actually got to attend.  The Oyster selection while quite attractive in variety and pricing not too highly margin'd in this Downtown area, it came as the last offering from multiple dishes while we were expecting it as a Starter/Appetizer.  Each and every Raw Oyster had some shell pieces underneath the bivalve that I had to carefully extract.  Definitely not meant for Oyster Eating Competition by any stretch.  I was hoping at the cost and Clientele they serve here that there would be more of a welcoming casual friendly services but it's hit-and-miss from individual to individual as we had more of a nonchalant waitress this round.  The atmosphere is a nice mix of warmth, seaside, casual while still have that fine-dining.  The unusual aspect was the Jazz/Soul music playing from the speakers.  Did I just open a Space-Bridge to Nawlins?  White stripe Bass($28.00) White Fish($28.00) PEI Mussels w/Frites($19.00) Ribeye Steak w/Demi Glace($35.00)  The protein Meat part of the Meal is quite nicely accomplished, stars of the show.  Both Fishes with crisp skin and well cooked within, much appreciated good job.  The Steak looked tantilizing and smelled aromatic amazing, I wished I ordered that.  The PEI Mussels were standard usual fare, nothing I would run back for.  The Carbs/Veg along were so-so but the fact is I came for Seafood and those sides are secondary in nature.  I still wished they stood out more rather than being put-aside eat-if-you're-hungry elements.  Considering the monies paid for this Meal, I personally consider this worth coming back for... Eventually."}
{"text":"Another one of my neighborhood great restaurants. Just sit by the oyster bar, have a chat with they oyster shucking master, and you will not be disappointed. I tried some of the yummiest oysters there. I especially enjoy the variety of European oysters they offer. The other day, I tried the tsaskaya from France, and I think I died and went to heaven for a few seconds. Oh don't skip dessert! they have the best sticky toffee pudding in town!!"}
{"text":"Yay for Summerlicious and getting me to this neck of the words to try out Starfish! The food here was just spectacular and I ended getting another order of oysters to go along with my prix fix as the selection and quality was top notch.   This is definitely a place I'll be coming back regularly to get my fix of oysters and tasty wine to pair! Also, it's pretty cool to say you get your oysters from one of the world's premier shuckers! ;)"}
{"text":"Finally decided to try this place, which is literally steps away from my apartment, and was definitely glad to have done so.  For starters, we had the sardines and the smoked salmon -- which I felt good about ordering because of the high omega-3 and vitamin D content. :)  We then proceeded to order an assortment of 12 oysters, that paired well with the sauces they provided but even better with the tobasco sauce that we requested.  The white wine we ordered (an Alsatian Gewurztraminer) went really well with everything we ordered.  The meal itself was pretty good but what really put it over the top was the much-ballyhooed sticky toffee pudding (which is worth the price of admission alone).  Was definitely in a state of bliss after consuming it.  Also, since it's TIFF, it wasn't a surprise to run into a celeb (Kris Holden-Reid from Underground) at the restaurant.  Great feel to the place and friendly service."}
{"text":"Oysters were delicious but the clam and lobster chowder was really bland and boring and was a huge waste of money. The smoked salmon was also good but it needed lemon which I had to ask for. The clam Caesar could have been better too, the best part of it was the raw clam on top. I feel most dishes were overpriced for what you got.   The ambiance in this restaurant is bizzare. Above my table was a disco ball... At a seafood place...  The surroundings for the price you pay doesn't match. The walls need work, the seat I sat at had its fabric ripped and torn and there were tons of burnt out candles around... Why not replace them and light them?   Service was also slow and our server didn't seem that friendly.   This place could have been good but the atmosphere isn't up to par, especially with the price I paid here. I will be trying other oyster bars."}
{"text":"Good, but not earth-shattering.   Staff was friendly, courteous, knowledgeable. Cuisine itself, was a bit better than \"OK\", but certainly not earth-shattering. Prices, reasonable. 4 Drinks, 6 Oysters, two appetizers, and two mains = $130. Reasonable. Portions weren't really all that generous.    I don't know that I'd go back vs. trying somewhere else when the urge to have Seafood strikes again."}
{"text":"I don't think i've ever waited so long for a meal in my life... the food was ok.."}
{"text":"I was sooo looking forward to trying Rodney's Oyster House, but the latest reviews suggest it's gone right downhill lately.  I'd been to Starfish a couple of times before, so tonight, craving molluscs I went back for the first time in a year.  I'd gladly give five stars based on the seafood alone.  But the price seems rather high to me.  (I know, seafood is expensive).  Tonight I had 3 yummy little Halibut cakes, a main dish of grilled salmon on a bed of creamy, delicious Israeli cous-cous, and eight raw oysters.  Without a drink, my bill came to $90 including tip.  Isn't that sort of steep?  Maybe I'm out of touch.  It was awfully good though, and the service was excellent.  I'm definitely a fan and will keep going back.  But I have to save up a bit beforehand."}
{"text":"I cant really fault you STARFISH nice welcome, great service, cool location, perfect meal wish more of TO were like you, sweetie."}
{"text":"STARFISH HAS THE BEST CAESAR EVERR!!!!!   There is really nothing much I can say about Starfish on the subject of oysters because they are obviously seasoned professionals who do what they do very well.  They have a nice selection of North American as well as European oysters and are perfectionists when it comes to those molluscs.  So I'll just guss over all much I love their Caesar, because it deserves an entire review of it's own.  Even though cocktail itself is huge, I once had three in one meal.  I suspect that they put horseradish in it because the flavour is so refreshing and maybe because I spy little white slivers in the drink.  A lot of times, I don't order cocktails because I feel that they are just a melange of fruit juices from concentrate with a bit of alcohol in it.  So usually, methinks at least, the alcohol is the real purpose and the other stuff just makes up a vessel so it'll go down easy.  The Caesar here is different; it is made so well that I'll have it regardless if I'm in the mood to drink or not.  I did not like Caesars before I had it at Starfish because they are so inconsistent from restaurant to restaurant.  I've actually had some that tasted like they came from a can.  The Starfish Caesar is a totally different creature, it has so much umame!! Yet, it doesn't make me want to steal sips of water.  SOOO GOOOD!!!   Anyirrelevantlyhow, the fries are also delectable.  They are not the thick cut kind, but rather the kind you'd see on a steak frite plate.  I usually try to avoid deep fried potatoes, but I really can't stop finishing the fries here.    This was probably the least helpful review ever, so apologize if you just finished reading this and is thinking \"BUT WHAT ABOUT THE FOOD?!\""}
{"text":"The worst service i've ever experienced at any restaurant anywhere in my entire time on this earth.  Rude, condescending, ignorant service doesn't wash even if the cuisine is the best in the world so it certainly doesn't wash here.  Want a great oyster bar experience? Go to Neptune Oyster in Boston, go to Pearl Dive or Hank's in DC, heck go to Rodney's a few blocks away but don't go to this joke expecting anything other than pretentiousness with neither the culinary chops or class to back it up. ** I See Starfish has now closed and has taken (stolen?) the name of the great DC oyster bar Pearl Dive and added and \"r\" at the end.  Hope Mr. McMurray has visited Pearl Dive DC and got a sense of what professional service is all about. If so, maybe I'll give this re-branded Starfish a try."}
{"text":"Went here for the summerlicious menu. Initially impressed by the ambiance, but the service was WAY too slow.  15 minutes before the waiter even came to ask about drinks. 45 minutes before the appetizer hit the table.   All the more agonizing given that the menu brags about how the shucker is world-record fast.  The oysters were fresh and the trout  was decent, but the mussels were rubbery, and had a couple closed ones floating around.  Service was terrible for the price, and frankly, completely unapologetic."}
{"text":"I had a perfect evening of shucking oysters at Starfish! I've passed this place a few times and never once knew what kind of seafood magic they had cooking inside. Everything we had was excellent and the service was fantastic.  We started a dozen local and away oysters ranging from Scotland to PEI and they were all amazing. I ordered the white wine mussels and substituted the fries for a salad.   Dessert was AMAZING! I got the sticky toffee pudding. I would recommend this place to anyone looking to have a nice time at a high end yet laid back restaurant."}
{"text":"Some might argue Starfish is not one of the best seafood restaurants in Toronto overall. However when it comes to oysters and shellfish I have no doubt it's THE best.   Owner and world champion oyster shucker Patrick McMurray always has a fresh selection of several varieties at hand so you won't be disappointed. That said, they also have a very good and creative menu outside of oysters. Case in point, their fish and chips, cleverly flipped and delicious; Thin crispy fish sticks and potato croquettes shaped like fish  fillets   Both the oyster bar or the table section of the restaurant are pleasant in terms of atmosphere, but if I were you I'd sit at the bar."}
{"text":"before 6pm is their happy hour, you can get a bowl of creamy mussels for only $5 I even wanted to finish the ssoup left in the bowl, yummy yummy. Of course the oysters here are the signature dishes, a dozen fresh oysters for $15 coming  with gentle vinegar, garlic sauce,  horseradish and a slice of lemon wedge. Some beer or caszer cocktail are $5"}
{"text":"I've been back a few times. Think I may have been a bit overly enthusiastic. Still a great place for oysters."}
{"text":"This cosy oyster bar boasts a varied selection of high quality oysters, an inviting atmosphere, and a CHAMPION SHUCKER. Does your local have a world champion shucker working the Malpeques? I didn't think so. Our server was courteous and attentive and the food was great. My date's dish (fish) was superb. I got a dozen oysters for a decent price -- they were fresh and delicious.  Obligatory Title Pun: This FISH joint is a STAR.  Menu Readability: Well laid out and incredibly informative. Includes information on oyster types!  Need to mention: There is a plaque from Guinness on the wall. This shucker means business.  What this place teaches me about myself: Starfish isn't just a clever move in bed."}
{"text":"I just feel at home in this place.  We come here for birthdays and always seem to end up in the hand-holding section!  Points for lack of pretense and folksy decor which belie the more sophisticated menu.  I started with a smoked duck salad which had several slices of smokey heaven and little drunk raisins tossed among the frisee and peppery greens, coated with a vaguely maple syrup tinged dressing.  Mmm, super starter.  Partner had a prosciutto arugula salad with a version of prosciutto that was paper-thin and crispy.  Then we started in seriously on the oysters, a dozen each.  The North American plate is $30/doz, and the larger world's choices come in at $35.  Cold, fresh, briny, eating oysters is like eating the sea.  We liked the white caps best and asked for a dozen more of those.  (C'mon birthdays are only once a year.)  When they didn't have any more, they gave us 18 Malpeques, 6 on the house. Very generous. A cup of good decaf, and we called it a (delicious) meal.  The only bad note what was going on at the tables on either side of us.  The table on the right returned their wine, saying it was \"off.\"  The one on the left returned their mussels (said they were \"fishy\" and odd-tasting) and their potatoes (some were raw).  The waitstaff seemed to take all this with aplomb and offers of replacement.  Maybe these people ought to write their own reviews, but they seemed like nice folks not out to cause grief.  Their experience however prevents me from giving the place 5 stars.  I'd prefer us all to be happy hand-holders."}
{"text":"i came here for my birthday and tried about 50 oysters of various varieties. ALL AMAZING. service was spot on. i love oysters, and this is the place to go"}
{"text":"Dear Starfish,  Your website, Facebook page and even this Yelp page all say that you are open on Fridays until 11pm. If I were to arrive at your establishment at 10:30pm for a late dinner after a long movie, I'd expect to be seated and served, not turned away because its \"kinda 10:30, getting close to 11\".  If you don't in fact serve food during the hours you list as being open for business, you might want to clarify that for your patrons.  You are sending a mixed message and that's bad for business.  This has happened to me twice there in the past two months on different days of the week.  That's bad for business too.  You lost close to, if not over $400 in revenue over the course of the two times I was turned away.   Suffice it to say that I will not be returning to see if there is repeat performance of your establishment turning down my money.  Another reviewer here has it right on the money.  Great food, lovely people, lousy service.  Twice."}
{"text":"We went during Summerlicious, so it was fairly busy, but the staff was handling it really well. Example: we ordered 3 tricky martinis and had them within 2 minutes.  We weren't planning on getting the Summerlicious menu, but it looked great so we went for it.  The oysters were super fresh, the mussels were good and the people I was with really seemed to enjoy their desserts.   Beware, you can easily rack up a high bill here. Even with the prix fixe menus (+ 3 martinis and one bottle of house sparkling) we were at $240 before tip. Eak!   Will I be back? Hell yes! Oysters for everyone!... and next time I'm going to splurge and get one of those huge lobsters I saw the rich guy next to us eating.   Basically, I can't afford to be a regular but it was a great night.   PS: Beware the Summerlicious diners.. they are the worst."}
{"text":"Oysters !!! Who doesn't like oysters, i came to this place, with a really good friend of mine, and i have to tell you these oysters  where so fresh probably the best oysters in the city , but there was one small problem don't come here if your super hungry you will have to order at least 6 dozen of oysters to be full, and that might be a bit pricey for only one person so think before you do it !! I guess its worth a try !!"}
