{"text":"Staff was nice, but $9.00 for a shot of Jameson's. That's some bullshit. The bar tender told me that it was the best bar on st Clair w. I disagree. About 5 minutes after she made that proclamation, the owner came in and made her cry."}
{"text":"After reading the positive reviews my partner and I decided to try Stazione Central. The ambience and service were the best part- unfortunately the food was not. The food was served cold and under seasoned. For the price, I don't think we will be going back."}
{"text":"Great personable service on a busy Thursday night.  The starters and mains we both great.  Have had the pasta many times and decided to switch and try the burger...was equally impressed."}
{"text":"Stazione has a quirky and interesting menu, and is one of our favorites in the neighborhood.    The best part of Stazione is the selection of pastas and starters.  Most pastas can be ordered in small and large sizes, so you can order pasta as a starter or a main.  We've tried most of the pastas: sausage/rapini/tomato, salt cod/mussels/white wine sauce, lamb cheek ragu, and a classic bolognese. All have been extremely well executed.    The starters are also pretty interesting; this evening I had a brandade starter consisting of salt cod, potatoes, and tapenade.  I loved it.  They also do a good grilled calamari (a standard dish on St Clair W); a calabrese sausage and rapini dish, and have a number of different salads.  The prices for the starters and small pastas are $8-$12 each, so you can make a meal out of a starter and a pasta, and a glass of wine for about $30. I think Stazione has some of the most interesting food on the St Clair W strip."}
{"text":"I absolutley adore this place! The food is delicious and the place is a comfy, fun and casual place, perfect for having dinner or just going for some great tasting drinks!  The staff are all very friendly and welcoming as you are greeted as soon as you walk in the door. This is one of my favourite spots on St.Clair and highly recomend it to anyone looking for great food and affordable prices.  THE MUST HAVES: The Switch Salad, The Burger, The Short Rib, Mussells, Wet Noddle pasta and you must, must try the Arancini (rice ball which is to DIE FOR) which comes in a delicious tomato sauce.   The station theme is also really different and fun. Take a look at the menu and buisness cards (which look like transfers)! Super cool and could see that a lot of time and effort was put into creating this theme! Love it."}
{"text":"Stopped by here for Father's Day Lunch and had an absolutely fabulous meal. Food was delicious with a great combination of tastes.  Everything was very fresh. It's always most fabulous when you can find a great place to eat when out exploring."}
{"text":"I went here for dinner last night with 3 girlfriends after reading the mainly positive reviews and having walked past it many times and seeing it always busy. We had a TERRIBLE experience. It was a busier than normal night, we think because of Canada Day this week, but this is no excuse. We were sat at a table in the dark, back corner and we asked to move outside once a table opened up. Our request was promptly forgotten.   We were given one drink menu between the four of us and were told we had to wait for food menus as they did not have enough (not even all the inside tables were full...). We had to flag down our waitress after 10+ minutes to order drinks. The glass of Pinot Noir was terrible and had to be sent back. The second glass which supposedly came from a newly opened bottle tasted the same. We asked one waitress (to be fair, it was her training shift) about the beer special on the menu (which reads \"Ask your waiter\"). She did not know so she grabbed the experienced waitress who also did not know what this special was...  We were finally given food menus (only 2 for the table...) and had to again flag down our waitress to place our order. We ordered 3 half pasta dishes, bruschetta and mussels. While waiting for our food we moved ourselves to an outdoor table which was still dirty and we cleaned off ourselves. The bruschetta came in good time along with some bread for the table. When the mains hadn't arrived after 35 minutes, we asked the waitress when we could expect it. She was rude and defensive and said \"you saw me put your order in, we're just really busy tonight\". Upon waiting another 20 minutes for our food, I went inside to inform any staff that was listening that we had been waiting so long we weren't even sure we wanted our food anymore (it was 10pm on a Monday night at this point). Two of our mains came out 5 minutes later, the two others not for another 10 minutes. The food was average overall, it didn't have much flavor and was absolutely NOT worth the wait.   They took 25% off our entire bill but despite this I will not be returning to Stazione Centrale ever again."}
{"text":"Intimate nice place with great wine selections and well executed dishes. The decor is very nice and the staff are as well."}
{"text":"A great place for a fancy-casual dinner.  The Hubster and I were walking the neighbourhood, trying to find a place to celebrate our anniversary. This place looked nice enough and there wasn't a lineup. The menu was well priced with some good options (Hubster wanted burgers, I wanted a steak. Could this be an allegory about our opinions on anniversaries?) The service was very friendly and professional. The place felt casual, but we didn't feel out of place in our dressy clothes.   Hubster had the bruschetta, which looked basically like a caprese salad on toast. It was a big round of mozzarella on top of a big slice of tomato, on top of bread, I can only assume, as the tomato was so gigantic. There were two of these. He loved this. He said that if he worked close to this restaurant, he'd come in here buy the bruschetta for lunch and be happy for the rest of the day. I had the sardines which tasted amazing. Just a little charred and flavourful. Also, they were basically main-dish size. At $9, it was an incredible deal.  Hubster had the burger, which was also gigantic and delicious. I had the rib steak was was a bit overcooked (I asked for rare, it was medium) but still managed to be super delicious and tender, which is what I'm looking for when I order rare steak. It was also gigantic.   We didn't have room for dessert, and instead opted to roll ourselves home (thankfully, it was downhill.)   This is a great new spot. Fancy enough for a nice evening out, but friendly enough for a casual date. Plus, the food is incredible and the prices are fantastic. Dinner for 2 including appetizers, mains we couldn't finish, two beers and two glasses of wine came out to $90 pre-tip. It was exactly what we were looking for for a nice night out. It was a small menu, which makes me think it's due to change once in a while. We'll be back!"}
{"text":"Had a nice dinner here. Lovely service, yummy dinner. We ordered a number of shared platters. The eggplant and meatballs were particularly good. The ambience was enjoyable."}
{"text":"Had a truly laughable dinner at Stazione. This was one of those nights when when we should have just walked out!!  We were going to a party around the corner and just wanted to grab a quick dinner before heading there... unfortunately for us, we wandered into Stazione instead. The place was busy, but we got seats at the bar, and a promise of the next available table. Drinks were fine, the Panty Ripper cocktail was particularly good - although with it's cucumber and ginger notes, no idea why it's called a Panty Ripper?? We settled in with drinks and took in the ambiance.  A word on the decor: Near the door, there is an oddly positioned host stand, on which sits an 80's Dynasty style crystal telephone (presumably non-functional), a bonsai tree hung with holiday ornaments, and a miniature glass slipper. On the wall nearby, a 7 foot fake fireplace, which is strangely adorned with a set of deer antlers and holiday greenery. There are also big mirrors, an assortment of trendy railroad glass, antique patina'd musical instruments, industrial bric-a-brac, and weird, unrelated artwork. Completing the \"look\" - a set of skis propped up in the corner. In other words, it's exactly like every restaurant interior decorator in town came in and threw up all over the place. It's ok as long as you only focus on one thing at a time, but taken in sum the juxtaposition is really quite comical.  We waited about 3 years for a table, along with several other parties who had also been waiting forever - it seems that we all had been promised the same table. No one in this restaurant seems to be in charge of anything, with any communication between the staff members, and no management around to keep things running smoothly. They also seemed ridiculously understaffed for a Saturday night. It would have been funny, but we were now late, hungry, and cranky.   Ordered a caprese style salad at the bar, it was eons before it finally emerged from the kitchen. The buffalo mozzarella was warm and gooey good, and the tomatoes were fresh and tasty. Turns out, this would be the best part of the meal. Later, the server/hostess \"apologized\" for us being served a salad \"that we didn't order\". Again - no communication, she had no idea we had ordered/paid for it at the bar, and no idea how long we had been waiting for it to be served.  Entrees ordered were chicken, salmon, and the sea bream special. As we had been waiting for so long, we hoped that our entrees would be expedited. After waiting another 20-25 minutes, we asked when we might expect our dinner. At this point, the hostess/server mentioned that they were actually out of chicken. Apparently, no one in the kitchen had even looked at our order for at least 20 minutes after we placed it. What kind of restaurant doesn't mention something has been 86'd for 20 minutes after you have ordered it?!! And what kind of restaurant runs out of chicken on a Saturday night? It's nothing complicated, it's chicken! I had to laugh. Inept server/hostess offered some glasses of wine to compensate for the missing chicken and the wait, but this wine was never actually produced. Keep in mind, we'd already been here for almost 2 hours!!  Gnocchi was ordered in place of the chicken. A few minutes later, strangely, the newly ordered gnocchi and the salmon were served, but we would be waiting on the sea bream at least another 10 minutes. When the sea bream did appear, it was without the rice that was supposed to accompany it. When the rice came out, another 10 minutes later, it was crunchy and undercooked.  On the whole, the food was just blah, under-seasoned and tasteless. The portion of salmon was large, but less than half of it was eaten, it just wasn't good. The sea bream was served whole, and was so bony I gave up after a few minutes of spitting out bones and trying not to impale myself. Gnocchi was meh. There was nothing about any of the food that justified the rather high prices.  Throughout this debacle, the server/hostess kept trying to tell us that it was never like this, they were just really busy tonight. I told her point blank we don't really care how it usually is, what matters is the experience that we are having tonight, which is just terrible. She comped the sea bream.  On our way out, we saw our server/hostess copping a squat out back with a cigarette. Again, it would have been funny if we weren't still hungry. This place is ridiculous, overpriced, understaffed, and just generally bad. Don't waste your time or energy here, just eat somewhere else."}
{"text":"Ask for the price of the specials before you order, they are way above the most expensive item in the menu. I was expecting to pay somewhere around $70-80 for two people and ended up paying a little over $110. Food was just OK, didn't worth that much."}
{"text":"Down a star. Lately the wine has been a bit off. Also I noticed that a dish I used to eat, the big G (a gnocchi dish) has beef stock in it.  I still like the location and the vibe but wish they had more vegetarian friendly dishes and more consistent wine."}
{"text":"I have been to Stazione about 5 times and I always leave happy. The servers are very friendly and know how to do their job properly, the food is always fresh, and the ambiance of the restaurant is great for a casual date night. This last time I ordered the \"sexy thighs\" which were well prepared and delicious.   The menu regularly changes here and there's only about 10 dishes to choose from. This means you might not always get to order exactly what you want, but I feel there are benefits to having a restaurant opt for a smaller menu that changes according to the season and what the chefs would like to offer. They do seem to bring back fan favourites though if enough people say they want to see something on the menu.   Come here if you are a pasta lover!"}
{"text":"I like this little Italian spot. It serve simple traditional Italian fare. I ordered the 'Big G' (gnocchi with mushroom) and it was excellent. The desserts were Italian old school classics like Tartufo and cannoli and all were very good. The ambiance is very nice, the prices are reasonable and the service is good."}
{"text":"Good stuff here.  Agree with Elaine.  Had the ribsteak as well.  Was large.  Also prices are quite good given the quality.  Will go back. Note - you have to go down some pretty steep and shallow stairs to get to the bathroom."}
{"text":"My girlfriend and I have been meaning to try this place since it opened, but it looks like we won't be trying it any time soon.   I've called every day for the past week to try and make a reservation. No-one ever answers and no-one has responded to my message. Looks like it will be valentine's day at the Rushton this year."}
