{"text":"Came for lunch at around 3pm but wait about 20 mins for my noodle. At that time only 2 tables!! Food just OK !! Waitress good and friendly but the man I think he is the owner not friendy !!"}
{"text":"Came here for lunch and ordered the rib and pumpkin with steam rice. The food was okay.. A little on the salty side. The service, especially coming from the middle aged woman and man in the kitchen, was terrible. We were wrongly given a side soup that I thought came with the meal and started eating it. Then the middle aged woman asked me rudely in Chinese if I ordered it. She then told the older man in the kitchen and he was telling and pointing to a younger waitress to just take the soup from me and dump it. This \"argument\" over a small bowl of soup left a bad taste in my mouth. In the end I got to keep the soup. The younger waitresses were nice; beware of the cranky old couple from the kitchen."}
{"text":"Lunch menu was good but dinner was pricey. Servers were pushy and give you the type of look to make you feel uncomfortable. Steam food was ok but other items had too much MSG and heavy sauces for baked meals."}
{"text":"Executive Summary: Setting: lunch 3pm Price: 4/5 5.99 lunch special no drink Decor: 4/5 Special: has wifi, channel 36 tv, slightly hard to access stairs, they have glass bottle coke! Worth! Baked: 3.5/5 Steamed: 3/5 Service: 2/5 slow at noticing needs but nice..... But slow. To be fair 20 min in it was employee lunch time  The steamed food is generally good especially the pork and the fish. As most steamed meat is softer and more tender the same could be said. However the portion for the rice to dish is not that good as there are too much rice. The rice itself was a bit too dried prob from pre steam. The steamed dish comes much slower but it's fine. They have wifi  The baked tomatoe mushroom shrimp with fried rice was a good blend of hk Canadian style. The cheese gave a good aroma but not too strong like most hk restaurants. The portion was fine and the shrimp/ mushroom was crisp and fresh.  Overall it gives a satisfied feel as its not too oily even with a fried rice base."}
{"text":"Entered the restaurant for dinner on a weekday, but did not get greeted or seated at a table for ten minutes despite the restaurant not being busy at all (only three other tables) and the two servers did not look busy at all. We got seated and wanted to order, waited another ten minutes for a server after trying to get their attention but was thoroughly ignored. We got up and left"}
{"text":"Food was mediocre. We ordered half a chicken (they didn't have any sesame version left). Their recommended veggie dish was F2, mushrooms and wintermelon in a garlic sauce. We also had a pumpkin sparerib baked rice.  Nothing stood out as memorable. Their credit card machine was also down. The bad review was a result of the high level of MSG i suspect in the meal(no proof tho). Wouldn't recommend and wouldn't return."}
{"text":"Came here on Monday night for a little dinner with my grandma to celebrate her birthday. We made reservations for 6 and thankfully we did because it was very busy when we got there!  We ended up ordering the set dinner menu with lobster as the main dish and 5 other side dishes. Service was very good, food was decent and came out quick. It came up to around 100 for the whole meal which I'm actually not sure if it's a good price or not since I don't usually pay for the big chinese family meals so I have nothing to compare it to.  I really appreciated the waitress we had because she was very happy and excited to celebrate my grandma's birthday with us. She even sang the chinese birthday song for my grandma!  Looking forward to coming back and trying the other dishes."}
{"text":"This is my first review of Steam Kitchen even though I've eaten here a few times now. The food didn't seem as tasty as it once was. Before, the steamed lobster on a bed of vermicelli came on a bamboo steamer but last Sunday it came on a plate and it wasn't as good as I remembered it to be. The honey beef steak is still good but everything else just didn't seem to meet the mark. The sweet and sour pork was more fat than meat. Thankfully, the complimentary dessert (glutinous rice flour dumplings in ginger broth) was still good :)   I doubt I'll be coming back after this dinner. It wasn't as busy as it used to be too, the restaurant wasn't full for dinner. Could other diners be feeling the same about the food as I do??"}
{"text":"Food was OK. Paid with cash and waited forever for the change(just need a dollar back). Had to ask and the boss asked how much did I pay to imply that I shouldn't expect anything back. I think they should not assume people would let them keep all the change especially with their attitude."}
{"text":"I have been to this restaurant a couple of times.  This restaurant has total renovation after it takes over the location from a previous restaurant.  It looks like it is in a basement but as it is in the corner of the building, this is the only store under another premises in the whole street mall.  This restaurant is different from others at which you can pick your beef, pork, chicken or seafood and then pick the toppings you like to tailor made your own dish.  The place is tidy and so far well maintained.  By the name of the restaurant, you know that its cooking specialty is steaming.  The daily soup is one of the best amongst all the Chinese restaurants.  Its flavor changes frequently.  If you want to try more different flavors, you can order other soups.  1.Steam egg with either dried scallops or preserved egg/salty egg is very smooth like custard.  It is good for seniors and kids. 2.Steam pork or chicken or beef with different toppings like dried vege, mushroom or black bean is tasty and not oily. 3.Fried beef cubes with broccoli is one of the main dishes you have to try.  I can see most of the tables has this order.  The beef is tender and juicy. 4.The ribs with orange juice is another of my favorite.  Each rib is about 6 inches long, deep fried and marinated with orange juice.  The taste is refreshing and is good to stimulate your appetite. 5.Steam fish with black beans is good, though it is small with a fixed price.  If you are a seafood lover, then you have to order your own fish which is seasonal price. 6.Steam fresh scallop on bean curd.  This is the cylindrical bean curd which is extremely smooth and tender in its nature. Carefully pick it up or it will break into pieces.  Tips:  No credit card Price is very affordable for a full dinner meal roughly $10 to $14 pp Daily regular soup is free and very good"}
{"text":"The food here is tasty, lightly salted and not over flavoured.  I like the steamed pumpkin and ribs rice dish for lunch but it takes a (relatively) long time to make.  Expect higher price ($30+ per person) for dinner as they serve seafood in their featured menu.  Non-seafood dinner menu will cost about $15-20 per person, after tax and tip.  The low rating on this restaurant appears to be coming from service.  To be honest, I'm not sure what people are expecting when they are paying under $10 for a sit down lunch.  Expect to walk in, order, eat, leave.  Like most authentic chinese restaurants, waiters will only come if you call them."}
{"text":"Came here yesterday in a party of 6.   Asked for a recommendation from the wait staff. Was prompted to order from the standard combo meals (printed on a white bonded 8 /12 x 11 inch paper).   The standard dinner combo meals had options A- E to choose from Garlic Vermicelli Lobster (steamed), vancouver crabs, fish and something else I forgot. You can choose one of the options A-E above + two to six of the dishes in  the a la carte menu for a prix fixed.  Ordered the standard Combo Meal for 4 for $68 bucks. Got the sesame chicken, fermented tofu friend tong choy, pumpkin pot, and upgraded a steamed tilipia (+$4). Also via recommendation upgraded the standard soup to a 6 person portion herbal tung tong (steamed soup) for $25 bucks. We got the sea coconut chicken soup. I mean, the place is called STEAM KITCHEN so might as well.  I checked out the place while I was waiting for the food. This place had been a home to many failed establishments. They did a nice reno job. Service was very nice. Wait staff is very friendly. Clean as well. Washroom are generously big, but for a big washroom there is only 1 stall and 1 urinal. Plus!!!! The washroom is very very clean. At least they don't store food there like some out restaurants. So the kitchen must be equally as clean so that is a Plus Plus Plus. Hmm.. Anyhow, back to the food.  Soup came first. It was a big turen. First taste: Salty. Very salty. The ingredients are premium though, silky chicken, mature chicken, lots of herbs, soup was clear, but salty. Steamed soup should be enjoyed without MSG and a little salt to taste. This one is clearly overdone.  Then the lobster came. I am not a big lobster fan but my friends seem to enjoy the vermicelli a lot. The lobsters were 1-1/2 pounds each. North American variety so the meat is not that firm. I would not have steamed my lobsters, because it comes out to be very very alkaline taste and I did not like the smell. It could be me. The other place I went to deep fried their lobsters and that removes the smell. Anyway, I ate 1 piece and that was kinda it. We left a few pieces of lobster behind, the vermicelli were all eaten.  Then the chicken came out. This is a deep fried dish. Nicely done. Not too overcooked and the texture is nice. I ate a lot of this. This place was empty at the end of the meal.  Then the pumpkin pot came. It was a very small pot... filled to the brim, but it was underwhelming. I looked at it and there wasn't much steam coming out from the top. I ate it, it was not piping hot... just lukewarm. It taste... salty. My friends took this in a doggy bag home.  Next the vegetables came. Very generous portion. The fermented tofu was generous too. Nicely done. I ate a lot of this one. We left a few pieces at the end of the meal.  Then the fish came. This is one big fish... about 2- 3 pounds.Make the $4 very worth it. It was steamed and the sauce was with fermented beans. Don't really like the fermented beans but I like the sauce. This is the once that actually failed the grade. The fish was uncooked at the deepest part. The scales were not completed removed and there are portions where the fish scales were so thick, I could not continue chewing and had to remove it from my mouth. We sent the fish back, and it came back microwaved. Sigh... we did not continue eating this fish. We left half a fish on the table.  We got a glass of iced tea, and iced coffee. Hong Kong Style, not bad. I would had preferred if they gave me syrup instead of pre-mixing it because it tends to be too sweet when the staff does it.   I particularly liked that they gave puh erh tea for dinner, because the caffeine in that is much less than the green variety which tends to keep me up at night.  The fruit platter was watermelons. My kid liked that a lot. I had a slice, quite good.   All in all, for a place that is called Steam Kitchen, I found their steamed items very tough to accept. The steamed soup was too salty, steam lobsters where too akalinic, and the steamed fish was uncooked. All the other items where quite okay, except they are all very salty. very very very salty. Be prepared to drink lots of water, or order more rice to bring it down. If the place was called something else, I would have added one more star.  The bill was over a $118 bucks, for 6. My advice is to stay away from the herbal soup. The standard soup looked pretty good (it was pork ribs and watercress) and I think we would have enjoyed that more."}
{"text":"I haven't been in this plaza for years and nice to see that the Saigon Star restaurant of my childhood still exists. Anyone remember the Dicken's restaurant that used to grace the same corner as Steam Kitchen? Good 'ol times.  This restaurant is located on the lower level and quite small. Big tables and chairs for a small space.   Dinner was going really well actually - the food isn't bad for the price point: My dad ordered the usual fanfare of egg with shrimp, steamed tofu, steamed fish, fried rice and noodles, steamed soup (the name of the restaurant clearly fits with the theme of the dishes!) and veggies and chicken. At the end of the night, we also got free dessert - the seasame seed glutinous ball in ginger syrup - MY FAVE!  But paying the bill was really suspicious. The card machine wouldn't accept my dad's otherwise perfectly working credit card. We were rudely told it was our card. But then after trying two other cards, we were told that the internet was down and they couldn't accept any cc's. Because we didn't have around $250 in cash, we were told to go to the HSBC and withdraw cash and the waiter promptly left, before telling us it wasn't their fault.  Well, where is the HSBC? Someone would have to walk in the dark and rain to withdraw cash and pay a service fee? My mom, who never has had to withdraw cash from a bank before, was so confused at being able to do that with a credit card.  That is the worst recommendation I have ever heard...and oh yeah, they only have one credit card machine too. And nope, the full house of customers had no idea they would also have to pay in cash, unless this is another cheap tactic of getting guests to pay in cash. Just save customers grief and put a sign that says cash only please.  My dad who wanted to take everyone out eventually had to have everyone chip in to cover the amount of dinner. Needless to say, we left a %5 tip for having a waiter rudely accuse us of a malfunctioning credit card, and bring us our dishes. More than generous if you ask me.  Food is what you would expect of an average Chinese restaurant and because of that, I was going to give it a two star. But the whole paying the bill experience, and off putting attitude of the staff, means one star. With so many other Chinese restaurants in this plaza, this place is not worth it."}
{"text":"Thought to give it a shot as the place looks promising from outside.  The Malaysian fried noodle came very quickly.  The veggie took over 30mins to come.  Then the Baked Portugal Style sliced chicken on fried rice took good 40mins to come.  I guess there is a reason not to order \"baked\" stuff from a steam kitchen.  Not only it took forever to come, but the taste is way off...  More like chicken in cream sauce.  Waitstaff are friendly, but looked lost."}
{"text":"I was craving for some steamed pork with salted fish over rice last night, and Steam Kitchen was one of the first places that popped up in my head.  I've been here twice, once for lunch and once for dinner (with the set menu).  Can't say this place \"WOWed\" me, but it was definitely okay.  Typically when we go to a restaurant, we would ask to take a look at their menu and decide based on the food selection and price whether or not we want to dine at that place.  Although we've been here before, it's been a long time (probably over 6 months), so we wanted to make sure the dish I wanted was still available.  The staff and manager were friendly, and the manager was a little too friendly which was at the borderline of pushy.   Anyhow, we decided to eat there, and ordered 2 meals from the Special Dinner Menu which was available Monday - Thursday or something like that.  $8.99 for soup, meal and dessert, a pretty good deal if you ask me.  When we placed our order, the waitress told us the steamed dishes will take approximately 20 minutes and whether we were okay with that.  She then brought a big bowl of soup that was so big, we each had 2 bowls and there was still some left!  Shortly after, our meals came (only took about.. 10-15minutes I think..) and we were both very satisfied.  The steamed pork with salted fish was as expected, but I definitely wouldn't mind if there were more salted fish or if it was blended into the steamed pork.  My companion thought the steamed pork had a weird taste to it, but he couldn't really grasp what was wrong with it.  His dish, the riblets and pumpkin was very good... a stronger flavor so it didn't even need soy sauce.  We were both very full after finishing our meal, and then there came dessert!  The wonderful black sesame dumpling served in ginger-sweet water.   That ginger-sweet water is the gingeriest sweet water I've ever had with this dessert... which is fine with me.  For those who don't like ginger and all will probably hate it.    All in all, I was content with my meal especially with the price and the fact that the food was steamed and has no MSG.  Will definitely come again!"}
{"text":"Last year I came here with friends and had good impression of the food and its menu selection. Came here again today for Sunday lunch after 1:30.   It took a long time just to get the staff's attention to order. The two of us ordered one baked and one steamed dishes with veggie on the side. Water boiled veggie came about 15 mins after which was not bad. But another 15 min passed and no main dishes came. Then a waitress came to ask us if the baked dish came(is it not abvious that we have no food on the table except vegetable?)  Finally when the baked dish came I was so starved that I was daydreaming to run into the nearby pastry store to grab whatever bread I could find to devour.  At this point I asked the staff if she can check with the kitchen on our other dish.  The best part of the story is this. Another lady staff overheard my enquiry, and scolded me: This is a Chinese restaurant. You cannot expect dishes to come at the same time. Steamed food takes longer to cook, that's why this baked dish came FAST.   My companion and I were so stunned we didn't know what to say...this dish came FAST? After 30 minutes? And what does it mean that this is a 'Chinese restaurant'? I just used that opportunity to ask them to check our other dish because I felt like they've forgotten this table and the order. I did not expect all dishes to come at the same time, but that they should make their appearances within a reasonable time.  After another 15 mins or so the other dish showed up. The food overall wasn't bad, but it didn't matter much anymore after the 'Chinese restaurant' lecture from them."}
{"text":"My family occasionally goes to Ocean's Seafood next door due their good value and decent taste. One time, as we left Ocean's we saw a line up at Steam Kitchen so we made an effort to try this place next time. I mean if a place has so many customers, it must be good right? WRONG!  These people must be eating from a different menu or something because the things we ordered were not that good. On top of that, the prices are high. A few dollars here and there doesn't sound like much but remember you have to pay tax and tip. Also recall that there are a million alternatives in the area if you want Chinese food. The only reason it doesn't get 1 star is because the food doesn't taste like they use a lot of MSG. Even the service I found a little slow though the staff are less zombie-like than most Chinese places. It took a while for them to give us the menu. I'm overlooking service as usual.   A glance at the menu reveals that this place charges a pretty hefty premium. A family seafood combo consists of 1 seafood choice (lobster, fish, crab, eel) + 2 other dishes on the list. 3 dishes costs over $55?!?!? That seafood dish probably costs maybe $20-30 regularly in other places. From the combo list where you choose 2, there are not many fancy items. This list contains things that I'd expect to be worth $6-9 in a regular restaurant. We skipped this entirely and just ordered individually as we really didn't see any discount at all from the combo. Pricing failure.   We had... 1) Steam Whole Fish. I forgot the fish name but the same thing can be obtained from Ocean's next door for few dollars less. Same quality. Steamed Fish is a standard dish. The key is using a fresh fish and not overcooking or undercooking it. The soy sauce and onions are standard. No screw up here but I'm not happy paying more for this when Ocean's next door only charges $10.99 for this. You know what? Ocean's staff would even de-bone the fish for you at the table. We had to de-bone it ourselves.  2) Steamed chicken with black fungus: This is the most inferior steamed chicken I've ever had. Thick skin means OLD chicken. Old chicken is low quality chicken. It's bony and can be hard to chew for older people with weak teeth. The black fungus comes in big chunks. You're supposed to cut it up a bit so the flavor spreads around. This is such a basic thing. Sauce is adequate. My mom makes steamed chicken all the time and hers taste a million times better. For a restaurant that prides itself on steamed food, this is a MASSIVE FAILURE.   3) Malaysian sauce hot pot eggplant: This was my favourite for the night. Though I find the portion a little small for the price. The flavor is very good. A little spicy. Again, I can obtain the same dish for cheaper elsewhere.   4) Leaf wrapped shrimp rice: Another decent dish. It's steamed right. The shrimp tasted fresh with just enough garlic. The price is almost on point but still a little high.   Of course, we weren't agonizing over the food. We had a good time as a family. The food is edible. We just weren't happy with the prices. My parents have a very strong sense of getting the most bang for their buck and it's ingrained into my brain from childhood.   I think if you come here, it's probably because you want the more modern decor. Hey, they have a nice business card and the staff look a bit younger but wtf does that have to do with the food? My parents have been eating Chinese all their life. They can't be wrong. This is not the worst food they had but it's certainly severely overpriced for the quality. It's mind boggling how many people come here when they have Oceans next door and a bunch of other places in the same plaza. Fancy decor doesn't make up for mediocre food."}
{"text":"Really nice decor. The food is pretty good. No MSG!"}
{"text":"A decent and authentic chinese restaurant: -Mostly mandarin speaking servers (they do understand English as well) -refills tea/hot water very quickly -busy place but fast service -good food and will definitely return for nice authentic chinese food"}
{"text":"Came here for dinner,made reservations,didn't get seated until 20 minutes later. They were super busy (Saturday night). service was too slow, they may want to consider getting a new \"steamer\". We ordered the.individual soup in clay pots, all the good stuff in one pot. I must say I was impressed with the soup more than the dishes. We ordered steamed fish (it's really hard to mess it up..),saw blood on the inside,meat was still sticking to the bone,we didn't bother touching it after. Pork ribs with turnip in a sizzling pot was saucy and would go nice with rice,stir fried veggies with pumpkin was probably the best our of everything. The shrimp & egg white steamed rice was bland,but I didn't mind because the main selling point of this place is no MSG. Would recommentld this place for mid-sized (4-5 people) dinners,bigger tables are facing the kitchen and the washroom, not quite appetizing. I would come back again to try their crispy chicken!"}
{"text":"Tried this place out as the menu had some pretty good deals considering its area. We ordered a few dishes, nothing spectacular at all, I would've not come on here to leave a review but the fact that the waitress didn't return our change was quite rude so that was something that stood out."}
{"text":"I am surprised by all the less than stellar reviews.  Maybe I ordered the right dishes, as I really enjoyed the food.    I liked the cooking here.  The Sesame Chicken was the best dish of the evening.  The flavours were layered and bold.  I figured that the chicken was marinated with five spices and pepper salt for overnight or longer.  The chicken was deep fried without batter, then was coated with sesame seeds all around.  The sesame flavour was so bold.  The flavours of 5 spices sipped all the way to the bones.  The other two entrées that we ordered were simple dishes. They both tasted flavourful.  The ingredients were fresh and of good quality.  I could see myself returning for them.  Steam Kitchen is not your Hong Kong tea cafe, nor is it a congee/noodle restaurant.  Steam Kitchen is a step up in terms of cooking skills and quality of ingredients.  Is it a high end restaurant?  No.  It is a self-respecting mid-level restaurant.  And it is priced accordingly.  Personal opinion is that the price premium is justified."}
{"text":"We come here just for the lobster vermicelli dish. Always packed so I would recommend making reservations but be prepared for tight sitting. They really squeeze as many seating as possible. All the food we have is pretty good and prices are very reasonable prices."}
{"text":"And down to 3 stars it goes after having lunch here.  Options are lacking in this restaurant for lunch compared to dinner. I've tried the pork chop baked spaghetti and the baked ham and chicken spaghetti with cream sauce. Both are really nothing special and are something you can get better in many other restaurants.  Their iced tea is terrible here. That is all.  I'll stick to having dinner here, at least they have better options and the food is better then."}
{"text":"One of my favourite go to places when you are craving some steamed riblets. Service may be a bit slow due to the cooking method of choice is steam, but the staff are really friendly."}
{"text":"Decided to try some place new for dinner last night.  Steam Kitchen is true to it's name.  There are many types of steam dishes to try.  Steam Kitchen won't impress you, but it won't let you down either.  Pros: Many types of steam dishes to try Free soup and dessert  Cons: Prices a little steep for some dishes Basically middle of the road taste  When you open the menu at Steam Kitchen, you immediately notice there's a lot of steamed dishes.  If you're one of those healthy types, steaming seems to be a great way to cook as it uses no oil.  We ordered the steam chicken with mushrooms.  Other dishes included the beef tenderloin with black bean and honey sauce and Vegetables in soy milk.  Our meal came with free soup and dessert which is a nice touch.  The dishes came out at a pretty good speed.  The steamed chicken was OK.  It was nicely done but it didn't seem to be any different from what I could of done at home.  The beef tenderloin disappointed me.  Firstly, it came in cubes.  I've never seen beef tenderloin done this way.  It's usually it large slices from any other Chinese place I've been too.  There wasn't much black bean or honey taste to it.  It was tender however, so it wasn't a total loss.  The veggies in soy were exactly what is was, veggies is a bowl of soy milk.  It was something different but it lacked a taste of any distinction. Meh was the best way to put it.  I liked the place.  I guess I was just expecting more.  The prices seem to be a bit high for certain items too.  Steamed \"beef cookie\"  ( I have no idea what the English name is, I just translated the name directly from Chinese) was priced at $10.99.  It's basically ground beef that's steamed.  I can't get myself to pay 11 dollars for that.  All in all, Steam Kitchen will not leave you unsatisfied, it just won't leave you amazed either.  It's great if you love steamed dishes, and it's something nice to try if you haven't.  I might head back, just not anytime too soon."}
{"text":"There were several things I liked about Steam Kitchen and several things that were not impressive. Firstly, the most important thing was the food. It was authentic and tasty Cantonese food. I had the ginger chicken, which comes with two sauces, and the orange chicken. They were both tasty and rich. This is not your standard semi-Chinese restaurant. What they specialize in is food that is steamed without allowing any steam or juices to escape. This allows for the full taste and nutrition to be sealed in. The service was fine. Yes, it is a Chinese restaurant so high-end service is out of the question, but they were generally polite and prompt when called. Food also arrived in reasonable time. The price is high, but the food is higher end. There is an attempt at ambiance and decoration, which is helpful. Where they lose points is their tables. They are really close to one another and people will move so close to you or overhear your conversation or hit you going in and out. The washroom was also not very clean and, of course (sigh), had ran out of paper towels.  If Mandarin is one end of the 'Chinese' food spectrum, Steam kitchen is the poplar opposite!"}
{"text":"Poor customer service! Lobster was disgusting. Avoid this messy and unkempt place. Go to Captain's Boil or Red lobster instead."}
{"text":"The people there are extremely rude. Terrible customer service. They take forever even on a non busy day. The manager and waiters refuse to acknowledge you when you call them, and the food is overpriced. Would not recommend."}
{"text":"I actually really like the short ribs with pumpkin steamed rice hahaha i had no idea it is such a good mix!   Price is okay and service is okay too!"}
{"text":"I must say that the service was to par, however the food was a bit of a disappointment.   The place was packed with people and people waiting to be seated during a Tuesday afternoon.  We ordered their steamed rice with eggplant and minced pork, and peppered steak with spaghetti (Tuesday lunch special and it came with a hot drink). The steamed rice was nothing special and it took forever to come, it's definitely something you can make at home and perhaps better. The peppered steak sauce was something you can get at any hk cafe style place, and the steak was overcooked and tough.  I won't be coming back for I've had better food in other locations nearby, and their milk tea was over creamed and lacked the aroma of teas."}
{"text":"Seating can be crowded during prime hours, but the place is comfortable enough.  Tried it on multiple occasions for both lunch and dinner.  To me, I prefer their lunch over dinner.  Steam stuffs are good, the stuff fry noodles are pretty good, but the soup noodles is lacking. If you came here having health on your mind, you should ask them to cut back on the salt (& soy sauce).  I think they use salt to compensate for the msg. 4 stars for lunch, but only 3 stars for dinner."}
{"text":"Definitely don't come to have dinner at Steam Kitchen Alone.   This is one of those rare time I wish I am with some one. What to order? The menu for dinner is totally different from lunch and I wish I know before hand.  One can find the usual meat, seafood, chicken steamed or stir fried Cantonese style.  Vermicelli Stir Fried in Spicy XO sauce with Pork ($9.50) is one of the few fried noodles/rice dishes that are good if one dine alone. Taste wise is ok with just a hint of spiciness.  I probably have to come back for lunch as Steam Kitchen offers a HK style cafe set lunch at quite affordable prices... Maybe that is more my thing??  Grand Opening Special 10% off. Cash Only!"}
{"text":"Sometime we too many food events going on during the week, we try to stay uptown and lay low on the weekends. We headed to one of our favorite Chinese restaurant that Saturday only to realize that it's closed down.... so we went to Steam Kitchen which we saw last time we were in the area.  As the name suggest, they have mostly steam dishes and we were especially attracted to those mini pot of steam soup. After taking a sip, it was so good that we decided to order another one.  It's steam/cook in the small pot where all the flavors are sealed in which make it so delicious and intense in flavor.  Mushroom & Conch Soup  $4.99 + $1.00 for a Lotus Leaf Sticky Rice Wrap  ~ The wrap was just not that great and super mini, so not worth the extra $1. ~ But the soup flavor was intense, love the conch and the super intense mushroom flavors.  Watercress Soup $4.99 ~ This is my all time favorite Chinese soup at home, so we just had to try and it was just as good although I find it a tad too sweet...  ~ I think it's from the big Chinese dry date for such a small pot.  Crispy Rice in Soup w/ Shrimp $6.95 ~ I know this is not steam but love it especially the Chinese pickled veggies in it although the rice wasn't crispy at all.   Steam Pork Short Ribs & Pumpkin w/ Black Bean Sauce on rice $5.99 ~ lunch special include a drink, I ordered the Hong-Kong Style Milk Tea  ~ This definitely doesn't look like the picture in the menu, the ribs are so space in the dish.  ~ Wish they used a smaller deeper dish so that the meat will cover the surface (the norm for this type of rice dish). ~ And there was barely any thin slices of the pumpkin, with it was thicker chucks instead which will give better texture.  Verdict: ~ Saw a lot more of the other dishes that's only available for dinner that's interesting ~ The soups do sell out, so better come early. ~ We'll definitely be back if only for the soup since it was so good."}
