{"text":"One of the best burgers in town!

The Prime Burger with fries or mash potatoes with a soft drink for only 8.50$!  So good and tasty for so cheap."}
{"text":"I got into Montreal yesterday and I've already been there twice. Breakfast and lunch is slammin'! Better than any American diner."}
{"text":"L'endroit ou aller pour manger le meilleur burger de Montréal! Le prime burger est a tomber par terre, le burger + frite + boisson a moins de 10$. Sans parler du lieu qui est authentique.
A tester les yeux fermés."}
{"text":"This is a very understated place. The food is fantastic and the family that runs the restaurant is wonderful.

The PRIME burger is the best burger in Montreal! You must try it."}
{"text":"Great Burger ... One of the best burgers in Montreal with reasonable price .
Way better than the ripoff burger places in downtown ."}
{"text":"I decided to try this place on a quick pit stop while running errands before heading to work, and did so based on what some others here said. The burgers are good, however when the cook slapped mine on the flattop before moving it to the grill I wasn't really impressed. Lost a point with that one, dude, really.

Fries as a side were good, but they do something particular to their gravy which leaves an aftertaste .. a little overpowering and kills other flavors.

Overall good eats, good prices, but a cut below Miteras' burger and fries."}
{"text":"Is this the best burger I've ever had? As I don't remember every single burger I've ever eaten I'll have to say that it's most likely in my top 3. The Prime Burger is amazing! The decor is probably the same since 1984 but that's what makes this place genuine. If you're in Montreal and looking for a burger place this is where you should eat. Cash only so bring your piggy bank :)"}
{"text":"I've been visiting in the area for weeks now and haven't found very good burgers , so I thought I'd try here from the good reviews. Many people complained about the interior , but luckily I had to get it to go and my girlfriend came along with me. She was worried about my food because the workers didn't wash their hands much and thought that this couldn't be the place since there were only older people there.

Ten minutes later my burger was done for 5.50 and I ran home to try it, but unfortunately from the first bite, everything was over powered by the char. I wish I could taste the meat or the bread or the bacon or the cheese, but I couldn't. Over hyped from what I seem, if you go, don't be surprised to have your hopes be smashed about the prime burger!! :("}
{"text":"It's hard to give any place 5 stars. Doesn't mean this place isn't just good...it's amazing! Will i go back? Oh yes. How can you go wrong with their burgers? You can't. And those people trekking across the McD...are you people retarded?! You have no idea how to eat. If you want decor,then by all means don't go then, but i like going to these retro places. Best food hands down."}
{"text":"J'avais une envie folle d'un hamburger fait d'une vraie galette de buf façonnée par des mains humaines, un peu comme ceux qu'on peut trouver dans les cantines gaspésiennes... Et je ne voulais pas payer 17$ pour un burger gastronomique aux champignons sautés et au fromage bleu, ce n'était pas ce que je cherchais hier soir...

Je souhaitais trouver un cheeseburger style maison avec des tomates fraîches, de la laitue bien croquante, du \"vrai\" bacon pas trop cuit, du fromage fondant et une grosse galette de pur buf cuisson médium idéalement (ce qui ne se trouve vraiment pas facilement au Québec!). 


Euh bien, je ne croyais pas qu'en essayant ce resto du Plateau, je trouverais très exactement le burger qui me faisait tant envie!!!! Accompagné en plus d'une serveuse trop gentille et d'un décor des années passées qui donne une ambiance de bouffe maison et de famille régionale qui réchauffe l'exilée en moi!

Notre serveuse nous a conseillé de prendre ce que, selon elle, 80% de la clientèle commande: le trio Primeburger! Cela comprend un hamburger débile, de bonnes frites chaudes et une boisson gazeuse. Nous avons suivi son conseil et sommes répartis de ce resto repus et heureux!"}
{"text":"This place rocks, the burgers are just great, end of story. If you're getting takeout get a Primeburger in a combo and a hotdog with the meat sauce. He loads up the box with meat sauce that you can drown your fries in. Dirt cheap as well."}
{"text":"The prime burger was DELICIOUS! My boyfriend and I stopped last week during our visit in Montreal. What got our interest was a sign they had posted for a trio deal: a burger, fries, and liquor. To our disappointment, though, the liquor on the sign didn't mean beer, it meant soda, so that was misleading. Also, when we asked our waitress if we could replace the soda with a beer she said it would be $2.50 more for each. When we paid at the register, it was actually $5 more for each of us. Even though the sign wasn't accurate and our waitress made a mistake, the food was delicious. I definitely recommend the prime burger."}
{"text":"Apparently the perfect place to dine-in solo as evident by all the older folks that surrounded our booth. 

There is nothing unique about the food here, aside from the cost to portion ratio. I had the primeburger, which did fall apart in my hands almost instantly. So messy, but also so good. 

No complaints about the service. We found out that they didn't take credit card when we ordered but our server told us to not worry and that we could pay after we ate (!).

My boyfriend had the club sandwich, which he enjoyed but he said it was missing a couple of essential ingredients like the fried egg and cheese.

I probably won't be back--too many other restaurants to try and I'd rather spend a bit more money on more interesting and less messy meals."}
{"text":"It's clear that most people come here for the Primeburger and well.. they are right. This is a diner, so don't expect tablecloths, but who comes here for the fancy surroundings... we are here for the burger.

And this is what a burger is supposed to be. Juicy, but not too juicy, actual real tomato and lettuce, not shredding lettuce, real hand leafed lettuce. Nothing funny, no special sauce, no fake this or artificial ingredients. Just a well cooked piece of hamburger, a soft bun with sesame seeds, lettuce, tomato, cheese and several pieces of bacon. 

If you are like me, ask for your fries well done. Favourite variation is taking out the mayo and putting mustard instead."}
{"text":"Oh gosh. Now I get all the positive reviews. This is such a great place!  

The price is right, the decor is authentic retro, the waitresses have the right amount of attitude, the food is delicious.  There really isn't much more to say.  You feel like a classic burger?  You find yourself near Mont-Royal and Papineau?  Go here!

I've walked by many a morning to smell the delicious scents of breakfast wafting out, and each time I wish that I wasn't on my way somewhere else, because I can only imagine their breakfasts are full of win."}
{"text":"Walking along the the Plateau, near Papineau and Mont-Royal snuck in a bit at a Reitman's store do a little Christmas gift shopping, my cousin and I got hungry and needed a place to use the little girl's room. Lol. We stayed snd ordered, wasn't our first choice , the place was pretty clean but poorly ventilated, the floors were kind of greased up , really old table benches,  the waitress greeted us was nice though pretty impatient wanted to rush our order, i guess because it was 2 hrs to closing. In any case we ordered 2 primeburger trios and wow. One of the best burgers i ever had, and good fries. I'll be back soon for another."}
{"text":"\"Tous les jours\" translates as \"everyday\" in english. As in, oh sweet Mary I can ingest these yummy delicious-burgers everyday and never get tired of it!

A good friend introduced me to this non-assuming restaurant on Mont-Royal East street, corner of Papineau, where time stood still since the 70s! This old school fast food joint is a real classic; from its floor tiles, to the plywood booths all way to the kitchen counter! Whether you're a local, a student, a hobo, work nearby or are simply visiting, you'll be welcomed by one of the friendly waitresses with a big smile, primed and ready to take your order.

The menu is varied and includes everything you would expect from your typical greasy spoon: hot dogs, spaghetti, pork chops and more but what really makes this place shine is its buuuuuurgers made of fresh beef, a lot of beef, cooked on a hot charcoal grill!

The Prime Burger: a thick & juicy patty made from fresh beef, salt, and a lot of love, sits on a fresh slice of tomato topped with melted cheese, creamy mayo, fresh lettuce leaf and a giant slab of crispy bacon, all neatly tucked between a soft sesame bun.

The Jumbo Burger: No bacon or cheese but twice as big as the Prime Burger and twice as juicy! It's simply massive! (...and that's what she said). Oh and yes, you can opt for the alternative onion, mustard and relish toppings.

Eat it with one hand, eat it with two hands, eat it like a pizza, it doesn't matter, I bet you won't be able to eat it slowly - who can resist? Come say Hi to Spiro, the humble and happy guy behind the grill - he'll prepare you the best burger you've probably ever had!

Note: Although I only ordered burgers here, of which this review is solely based on, the prime burger also comes in a trio with a soft drink and fries for $8."}
{"text":"December 2016 UPDATE: I was right about this place not being clean. They were fined $3500 by the health inspector for lack of cleanliness. Search for \"Montreal restaurant tous les jours inspection\". 
==================
The burger itself is quite tasty, maybe a 7/10. 

However I have to say AVOID this place.  The atmosphere here is what I would call \"prison/slash/gas station decor\",  and made me want to get out of there as fast as possible. I noticed that: 
- the restaurant is dirty in lots of places
- the ceiling over the grill had just been half-ass repaired 
- the place is a really gloomy and depressing space to be in 
- the restaurant smells  bad, like that \"old restaurant\" smell. Grease, maybe?
 - underneath the counter areas and cabinets and grill, and all over the walls and ceiling,  it was obviously dirty and in need of cleaning
- the 1980's vinyl banquette seats have duct tape on them

As a result of the above it does not really matter what the food tastes like, as you will be wonderting if you wil get sick with every bite. Yuck. 

Oh, and it is cash only."}
{"text":"I spent around 10 dollars at this place, which is the equivalent of what I usually spend at McDonald's! The patty was superbly made.  Juicy with a touch of crispiness.  Bacon was well made. Fresh ingredients. Typical bun.

My friend and I devoured it with pleasure.  My friend asked the chef \"what's the secret to making a good burger?\"  He said \"don't add anything, just a little salt.\"  Maybe I'm wrong but we could sense the humbleness and passion in him.  I'm sure it's his perfected method of cooking it.
The look of the place isn't so good. But who cares, the food and price was excellent!
Go eat at this place. You'll be happy you did."}
{"text":"**CASH ONLY**
This place is amazing!

I came here with some friends after reading some reviews on how much people enjoyed their burgers and I knew I needed to taste one for myself! We all ordered the Prime Burger with fries. It was delicious! Everyone enjoyed their food. Just when I thought it couldn't get any better, I received my bill and had to do a double take! This place is cheap! Don't let the old, beat up decor fool you! The food is way better than what it looks! Since my first visit, I have been back three or four times whenever I am in the area. 

Some recommendations to try:
The Prime Burger 
The \"Treat Burger\"
House Special Hot Dogs
Personal Pepperoni Pizza"}
{"text":"I said this on other posts and I'll say it here....what you'll find here aren't murder-burgers....they're \"killing-me-softly\" Royale Deluxes. 

A lovingly and unapologetically greasy old school diner w/the decor, prices and friendly service to match, my pics will show you why I'm giving this spot 5 stars...and when you're done trying to eat your phones or tablets, head to this spot immediately....and a little of their poutine won't hurt either! 

You won't find a better burger spot in this hemisphere at this price point, so don't even try it."}
{"text":"Par nostalgie, je suis allée découvrir un restaurant avec un décor figé dans le temps.

Pour des fèves au lard et bon burger, c'est LA place où aller"}
{"text":"I loved the atmosphere of this place even though there's almost nothing vegetarian on the menu other than a pretty good pizza. It's got an old school style and feel that I love. Try the Spruce soda, which tastes just like pine cones."}
{"text":"A classic diner located conveniently next to our Airbnb.  

While others in our group headed to McDonald's or AW for their burger fix, we looked at trusty Yelp and decided to order a burger here. 

The Primeburger was just $4.89 Canadian and we added two orders of deep fried french fries.  It was freshly made and ready in about 10 minutes and we didn't regret the wait at all.  

The burger was a beauty.  Lettuce, tomato, cheese and mayo on the toasted bun, but most importantly, a gorgeous slab of beef patty and delicious pieces of bacon.  It was a great burger.  Really enough to feed two but I demolished it easily.  

The ironic thing is that those who ordered from the nearby McDonald's almost took as long to get their order and I can guarantee it wasn't freshly made or anywhere near as good as this even though they have a triple decker Big Mac that you can't order in the States.  

We paid cash, but I don't know if they accept credit cards or not."}
{"text":"Happy to have finally tried this place! Have passed it several times and kind of laughed it off as too much of a hole-in-the-wall (for someone who does like hole-in-the-walls lol). After seeing the positive reviews, I made the hubster get two prime burgers to go while I waited in the car not wanting to eat inside (the hole-in-the-wall aspect again). He came out very quickly with two burgers and indicated that they also seemed to have a very good steak deal (more to discover later). The burger itself is huge, and your hand gets covered in juices very quickly lol. The bacon (huge slab!), onions and cheese were yum, albeit greasy, and the only small letdown of the whole meal was that the meat was well-done/didn't taste 100% fresh, more like frozen, but I'll take them for their word that it's fresh meat. I'm probably just used to a less cooked patty. However, unlike some other places that cook their meat until it's well-done, this patty was still tasty, so I am willing to overlook it! Solid joint and happy to have such a cheap alternative when in the area!"}
{"text":"Hands down this was my family (husband and 2 teenagers) and my favorite place to eat dinner in Le Plateau Mont Royal area.  Visiting Montreal from Atlanta, Georgia (USA) for 3 weeks and we tried a few places based on reviews on YELP... but this place we happen to just find ourselves out walking one night, and we are so glad we did.  From the outside it's not an eye catcher... next to a Cafe Depot, across from a McDonalds... walking in you feel like you stepped back into a 70s diner with the menus on the paper placemats... but the smiles on the cook and people who work here greeted us immediately and we knew we were in for a treat!  We've been 3 times now for dinner on our visit and it's become a real neighborhood heart spot... feels like 'Cheers' where everybody knows your name. Beautiful Anna and the crew here have even memorized our names and greeted us as we've walked in the door when we've come back.  What a great and friendly group of people... spending some time chatting with them has helped us with our French and telling us places in Montreal to visit.  If you are looking for trendy and organic, this isn't the place.  But if you are looking for a variety of good food, good quantity (we have a take home container of left overs every time) and good prices (I think everything on the menu is well under $15) with a friendly atmosphere... this is IT!  We've had the pizza, burger, steak, lasagna, spaghetti, chicken kabobs (souvlaki), pork platter... all was really good.  And everything seems to come with a side of salad which is fresh with excellent dressing.  Thanks Anna and crew for making our visits so special!  When we come back to Montreal we will surely visit again."}
{"text":"Looking for a quick bite to eat before the night started and a friend suggested Tous Les Jours's special. I said why not?

Prime burger special... amazing. Humongous burger served with some fries and a drink. Great tasting burger patty, big strips of bacon, lettuce, onion, tomato, ketchup, and mayo... the juice of the burger was oozing off the bun and onto the plate.

If you like burgers, you def gotta try this."}
{"text":"Burger énorme. Évitez vous la honte d'aller au McDo en face et essayez le primeburger. Viande cuite sur charbon simplement décadent. Pas pour les estomacs fragiles"}
{"text":"Ok place for fast food in a dinner style sitting hall. I got the trio: burger, fries and a soda. The steerburger was very good. It was not overcooked and was slightly pink in the middle (most of the industrial patties at this price range are served well done, but this was a quality patty). The beef was coarsely minced, with just the right amount of fat, so it wasn't dry, but it wasn't fatty either. The bacon was crispy, and the veggies were fresh. The soft bun got a bit soggy, and did not hold it all together very well, but started crumbling, and some of the onions and mayo dripped out. The fries were also not very good for Montreal.  They were not cut from potato on the spot and double fried - they were the industrial frozen stuff. I have come to expect better here, even at this price rage. The onion rings that my friend got were actually well made, the batter was the right thickness and did not overpower the onion inside. The server was fine, not too friendly, but efficient. One thing that really bothered me was the strong odor of detergent in the air - from the stuff they were using to mop the floors as we sat down. 

~second visit review~
Came in for lunch around noon on a Friday. The place was almost full. This time I went for the Treatburger, and a treat it was! this dish is hamburger in a bun with a side of fries, and the treat is: meat pasta sauce all over both. I think this was the first time I used a fork and a knife to eat a hamburger in a bun :) but I got over that pretty quickly since this dish is divine. They don't call it the house special for nothing. 
Following this - I upgraded them to four stars!"}
{"text":"Oh man, I can't even... The primeburger was almost too good. And an insane price for quality meat. Plus, they do not skimp on the fixings. Huge slices of tomato and several pieces of bacon. For just over five bucks!
:
Taking off a star because the fries were so so and my friend's salmon was a bit burnt. But the souvlaki was apparently good and the service was quite nice.

Will definitely be returning if I ever find myself once again in such dire need of calories."}
{"text":"Simplicité, goût et constance. Simple, vraiment goûteux et 100% constant. 2 ou 3 fois par année, je me délecte de leur primeburger, cuit sur charbon de bois, toujours le même bon goût et portion généreuse! Service impeccable par des vraies serveuses d'antan. Aucun fla fla. Que du vrai! N'oubliez pas de spécifier que vous souhaiter votre hamburger \"medium bien\", sinon il pourrait être un peu trop saignant à votre goût!"}
{"text":"La façade extérieure ne fait pas très bonne mine; habitant depuis plus d'un an à quelques pas du Steerburger, ce n'est tout récemment que j'ai eu le courage d'y entrer pour essayer leur burger qui fait tant jaser. Dès qu'on franchit la porte, on fait un retour dans le temps. Je ne m'étonnerais pas d'apprendre que l'endroit n'a pas été rénové depuis le début des années 90, brun beige et banquettes partout, dans le genre resto du défunt Zellers, avec quelques clients ayant l'air d'avoir vieillis avec l'endroit. 

L'allure des assiettes qui sortaient de la cuisine restait dans le même thème; Spaghetti bolognaise, steak patates pilées, et autres plats dignes de la cuisine de votre grand-mère. Mais alors, elles sortent d'où mes 4 étoiles? 

Le fameux Prime Burger.

Pour moins de 5$, vous pouvez commander un burger monstrueusement décadent aux ingrédients frais. On le prend all dressed: Une énorme galette de buf juteuse qui n'a jamais été congelée, 3 tranches de bacons croustillantes, fromage, laitue craquante, tomates, oignons et mayonnaise sur pain moelleux au sésame. Avec un side de frites, correctes mais sans digne de mention supplémentaire, on prend pour apporter parce que l'intérieur du resto me fait encore un peu peur. On prend le monstre à deux mains, ça coule sur les doigts mais tu t'en fou. Dès la première bouchée, tu sais que le McDonald d'en face vient de perdre son titre de \"burger joint pas cher proche de chez moi quand j'ai un craving de gras\".

Je n'ai pas gouté le reste de la carte, alors je ne prends pas la faute si vous goûtez à autre chose que le burger et que c'est pas mangeable (jugement hâtif, elles sont peut-être ben bonne leur patates pilées). Mais peut-être qu'un bon matin l'Avenue ou Chez Régine vont me sembler trop loin pour aller déjeuner et que je vais me rabattre sur un de leur greasy brunch pas cher cher. Et avec un copain qui aime bien les oeufs bacons patates, ça risque bien d'arriver éventuellement."}
{"text":"There is a GOD. He works the grill at Steerburger!

I ate the GREATEST burger I've ever had in my entire life. These are strong words. But it was orgasmic... like... goofy face and all!

Prime Burger, try it, love it."}
{"text":"We have been on a burger hunt in Montreal since moving here last August, we have been to burger street stands to expensive fancy burger restaurants, and this place is hands downs by far, the best burger joint in town. It's  great value for money, but the only thing that let's it down is its a bit old and dated. So if you are after atmosphere and ambience, then look elsewhere. If you are after a great tasting burger at a bargain price then this is the place. Cash only payment!"}
{"text":"By far one of the best local burger joints. The burgers are juicy, the Poutine is plentiful and amazing and the service is ever so sweet. We got the Jumbo burgers and the PrimeBurger. I'd strongly recommend the jumbo burger because of its massive size just for a dollar more. I'm gutted I couldn't add a picture because it was so appetizing and we were so hungry we dug right in. The consistency of the meat is great and the burgers are worth every penny (In hindsight, I should've started with that)"}
{"text":"When I win the lottery and become an absurdly eccentric millionaire, I'll be coming here for my dining pleasure, just to keep it REAL. This is the best incognito hangout a classy dame could ever hope for. 
For my dressed down Friday, I inhaled the Primeburger with a healthy helping of boxed wine (tip: get the Primeburger Trio and pay an extra $4 for your alcoholic bevvie instead of soda). The juice left on my plate from that burger was obscene. My date needed a beard bath after that one.
My date and I were surrounded by other hip couples dressing down their hot Friday night as well, along with the typical teenage gaggle sipping sodas at the back, and solo men of the elderly and middle aged ranges, cruising the daily paper while relishing every last fat fry on their plates. 
Our cook du soir was straight outta Trailer Park Boys, with all the unassuming and jovial spirit you want to see in a plaid shirt. Our server was a loveable, no-nonsense lady in a sharp-sided reverse bob, who kindly filled our wine glasses to the spilling point. 
Tired of the gritty city packed to the rafters with pretenders on a weekend night? This is the spot to soothe your weary, culture-hungry soul. 

Important: CASH ONLY. Hit that bank machine around the corner before coming in!"}
{"text":"Seeing as it was Burger Week last week according to one of my favorite shows (\"Bob's Burgers,\" who would've thought?), I thought it would be most appropriate to try a new burger joint. Since Steerburger had the highest rating on the list, I decided to give it a go and see if it measures up to the flavors of good ol' 'Murica. The appearance itself wasn't that special, as it looked like your average cheap diner of suburbia, but as I said before, I pay for the food, not the aesthetics. After browsing the menu, I decided to try the Primeburger trio and see what all of the hype was about.

When the food arrived, the burger looked surprisingly decent and the fries a crispy golden brown. If I could give a warning to future customers about anything, it's that the burgers can get EXTREMELY messy (I ended up using a fork and knife halfway through), but it was still really juicy and pink on the inside and bacon made it all the better. Despite putting mayo on both parts of the bun, however (which should normally prevent it from getting soggy since it's hydrophobic), the bun still ended up being soggy on one side in the end. Also, I didn't find the fries as anything particularly special but just average. For what it's worth, though, it was one of the better burgers I've had in the city, Five Guys not included since it's an American chain.

I ended up paying less than $10 including tax for everything, which was really nice. Food tends to get expensive here no matter if you eat out or grocery shop, so it's cool to have a place where you truly feel like you're not getting ripped off one way or another."}
{"text":"Debated it internally for a minute and nearly gave it 2 stars because the food was so meh. But it's a cheap diner. So I adjusted my rating. 2 and a half stars is more like it.  Service was good. The waitstaff is friendly and polite. But the food is meh. The PrimeBurger Trio is priced OK  but the taste of the burger was OK at best. The meat itself didn't taste as good for me so it could be maybe a product of the meat being just OK that day? Burger was a little too greasy with the enormous mayo they put on. So make sure to ask for a little less mayo than they put on.  Fries were OK. I had a part of the breakfast  entrees. That was a little better."}
{"text":"It has to be good when you survive accross from McDonalds. My choice fell on this place throug Yelp. I selected the \"Treatburger\" the house speciality. It's a qualiy beef burger with fries. Over that comes a meat sauce, which makes your burger disappear. After a cold rainy day a couldn't have made a better choice."}
{"text":"Alors là je dis ENORME !!!

Le primeburger est tout simplement pour moi le meilleur burger niveau qualité/quantité/prix que j'ai mangé à Montréal !! En solo pour 5,5$ à emporter on ne peut pas faire mieux.
C'est un hamburger simple, dans le bon sens du terme, avec une galette de boeuf, du fromage, du bacon extraordinaire, salade, tomate, oignon et mayonnaise. La viande est goûteuse et juteuse comme il faut et n'a jamais été congelé.
Les frites ne sont pas super mais on y va pour le burger. Il existe aussi des clubs sandwich qui sont sympas mais vraiment leur spécialité est de loin le primeburger.

Je n'ai jamais vraiment testé les brunch mais les assiettes donnent envies.

A l'intérieur on est vraiment dans un burger des années 90 nord-américain, le service est bien et on se place vraiment dans la culture nord américaine.
Attention par contre car on ne peut payer qu'en liquide ;-)

Je recommande vivement !"}
{"text":"Ici, pas d'effet de mode ni de burger gourmet hors de prix, juste un très bon casse-croûte authentique, simple et délicieux"}
{"text":"One of the best burgers I've ever had! Every bite I wondered, \"how did they make meat this good?\", \"how did they make bacon so good?\" How did they make mayo taste this good?\" Even the buns tasted good. This restaurant and the cook, and the owners, and the servers are great!"}
{"text":"For the price this is the best burger in Montreal! For about $11 bucks you get a trio, that's the price at McDonald's across the street! But here you get friendly service, and a really freshly made burger! The interior is dull and kind of sad looking but the food, service and atmosphere makes up for the dusty plastic plants tacked to the wall. When I'm craving a fresh, genuine American burger this is the place I flock to!"}
{"text":"Le PrineBurger est vraiment trop bon :p"}
{"text":"I went there for a quick brunch with my boyfriend. It was ok. Nothing spectacular at all. However my boyfriend keeps ranting and raving about the burger (which I have yet to try). So if you want something that gives you gossebumps for how great it is and if you want something that makes you fall off your chair,I would suggest going there for the burger, not the breakfast."}
{"text":"It has been a while since I have visited Steerburger.... but man do I remember it sucking. I don't know if it is because I am American and we love a good burger or if because I am American and they just wanted to screw with me, but the burger was just bad. Seemed as if they looked for a bun that had been sitting out all day and while they took there time trying to find this gem let my burger just cook to a dry tiny crisp. Lame....Steer clear of this place."}
{"text":"Voici un restaurant qui fait partie des survivants de l'ancien plateau Mont-Royal, le prolo, le pas cher, celui d'avant les hipsters et le guide alimentaire canadien...  Tout y reflète encore cette époque: menus imprimés sur les napperons, banquettes, comptoirs bas aux tabourets vissés où s'entassaient les ouvrier à l'heure du lunch.  Même les cuisiniers portent des chapeaux de papier! 
Et c'est bon: frites croustillantes à souhait, burgers ayant gardé le goût du grill, poutine généreuses en sauce et en fromage...  Et c'est pas cher, vraiment pas cher...  5.50$ pour une poutine trop grosse (il n'y a qu'un seul format). Je n'avais pas vu ça depuis 20 ans!
Une seule chose semble avoir changé dans cet endroit, et pas pour le mieux, c'est l'éclairage.  Quelqu'un a eu l'idée sinistre de remplacer toutes les ampoules de toutes les lampes suspendues par ces cochonneries de néons bleutés spiralés.  Le soir, ça crée une ambiance à peine plus chaleureuse qu'à la morgue..."}
{"text":"Ooh la la that was a good hamburger!  A few people had mentioned to me that Steerburger (not to be confused with Mr. Steer's) made a mean hamburger and that I should try it when I got the chance.  Well while in the Plateau looking for a good spot to grab a cheap, greasy lunch my friend and I came here to finally give it a go.

Walking into Steerburger is a bit like stepping back in time.  The restaurant looks like it hasn't been updated since the 70s but I like that retro feel.  The menu is exactly what you would expect from a greasy spoon in that they have burgers, hot dogs, etc.  There is also a breakfast menu but I didn't get around to trying that.  It is definitely on the \"To Try\" list for future visits and believe me there will be those.

Of course I was here to try the burger so I ordered the Prime Burger trio and switched up the fries for a poutine which cost about an extra $4.  The Prime Burger is a bacon cheeseburger and man was it ever delicious.  It was dripping it was so juicy and the patty was fairly large.  There were two thick slabs of bacon in it and they were mighty good.  In fact writing this review has made my mouth water and has me craving another Prime burger now.  The poutine was okay, not the best I have ever had but nothing terrible either.  The fries were lacking a little crispness to them.

Now one mistake I made was to order the poutine in addition to the burger.  The poutine is a huge serving and the burger is also pretty generous in size so it proved to be too much food even for someone like me who typically has a huge appetite.  I think next time I would just get regular fries if I was planning on a burger.

Steerburger is cash only so be sure to make a pit stop at a ATM before coming here.  That being said you won't need very much since prices are quite reasonable.  My meal plus a soft drink came to about $14 tax included which isn't bad at all considering this is the Plateau and you do get A TON of food."}
{"text":"Un voyage dans les années 70!

Je suis émue.
Meilleures tites patates à déjeuner.
ufs cuits à la perfection. Pas de télés dérangeantes en mangeant. Amazing traditional 70' Quebec breakfast ! Perfect and authentic. Food is fresh and amazing.service is super friendly."}
{"text":"Looking for a diner and came across this place. The decor is straight out of the 70's, but don't let that put you off. Our server was really friendly and had us started with coffee straight away. We all ordered a variation of eggs with bacon/sausage or ham. And a few of us may have had a pancake too! The meals are big, 2 eggs, 4 pieces bacon, 2 pieces of toast, beans, some fruit and the best potatoes! Plus a pancake with maple syrup! And the price is fantastic for what you get as well. My husband got arced bacon when he orders sausage, she was very apologetic and arrived with sausages within a few minutes. If you are hungry, looking for tasty food and don't mind some 70's decor this is your place! P.s I don't think I'm going to be able to eat for the rest of the day."}
{"text":"Mmmm, Steerburger.

The Prime burger is a seriously good burger. For less than $5. The trio with fries and drink is like $8.50. Satisfies my craving for beef, bacon, and cheese, and doesn't come close to breaking the bank, so I'm a happy girl.

Get the trio, die happy and go to cholesterol heaven. Just ignore the dumpy (\"classic\") 1970s decor."}
{"text":"I googled \"best burger in Montreal\" and came upon a couple reviews for this place. It was a sunny afternoon, so I thought why not go for long walk to work up an appetite for this place (I walked from St. Catherine/St. Laurent). It's totally an old school joint, doesn't look like the inside has been updated since whenever the place opened (70's?). I also didn't expect the server to be friendly since I didn't speak any French, but she was incredibly nice. She asked where I was from, how I found this place, and talked to me for a bit since I was alone. 

Next she told me their special that day (Sunday) was the Primeburger, fries, and pop for $8! I did however order a beer instead (I deserved one after that walk, afterall). As you can see in the pictures, this burger ain't no regular sized burger. It's absolutely massive, the patty is thick, there's like 4-5 slices of bacon plus all the other fixin's (tomato, lettuce, onions, mayo). First thoughts: very big, greasy, and salty. I thought the saltiness was perhaps from the bacon, but I think it was from the meat. But nonetheless, this was a very tasty burger. I needed to cut this baby in half to eat it without destroying the bun. There was a lot of cheesy goodness as well. I didn't want the server to be disappointed in me, so I ate the entire thing. I barely touched my fries though. 

I saw a few people ordering take-out for the Primeburger, so I think that's one of their best sellers. 

Not sure if this would make it into my \"best of\" category, but it was sure tasty enough that I would go back if I were in the area. 

(I then walked/waddled back to St. Catherine/St. Laurent afterwards to get rid of the guilt I had for eating the entire burger)"}
{"text":"When i used to live on the Plateau, this place was where i would go at least once a week. I actually lived right around the corner. Everything on the menu is good. The Prime burger is the best burger I've ever had. And under 5$ a pop, it is so worth it. I still recommend this place to anyone craving for a good classic juicy burger. Even my husband, who was sceptical was convinced ever since he took that first bite! Their breakfast is also very cheap. Service is super friendly and fast. Even after a couple years hiatus (i moved far away...) they still remembered me! Family run place with family welcoming experience :)"}
{"text":"I'll keep this short. I was in the area and saw this place had good reviews on Yelp, I think 5 stars is a bit crazy to give this place. Their burger is great at least, the one I had was well cooked and had good flavour. I am really not a fan of their fries but I'm really picky with my fries. The decor needs an update, some of the chairs have huge holes in them. So over all with the good Service and a great burger at a good price, I'll give this place 4 stars."}
{"text":"Ok so here is what this is, a greasy spoon with an old decor that serves up some of the best burgers in town.  I don't remember how we came upon it, but I can tell you I have been going there for well over 5 years and I go there for the burgers.

The one I recommend the most is the prime-burger, which on today's visit was being offered as a trio, burger,fries and a can of soda, for the very impressive price of 8$.

These are very good 5-10 napkin burgers,... huge patti (cooked to order and yes you will get it medium)  unless you ask otherwise, but for me that is perfect, with onions,tomatoes, lettuce, mayo, cheese, and bacon.  

It is an old school burger that will be falling apart into in a hot squishy mess of flavors before you get done, so it is not for the first date experience (not to mention that the decor is not conducive to romance). but for the Burger aficionados.

The place kinda looks like it was frozen in time (maybe 70' a bit of the 80's), your fellow diners may be varied, or it may seem like you just stumbled into a bingo hall, don't let that sway you. I have yet to sample a lot of the menu, but I am convinced you could find other secret gems, and at that price you would never be wrong.

The service is fast, friendly and something about this place is endearing, at least to me, so next time your craving a burger, or have a hangover try these out, you will be happy you did and in no time you too will be hankering a steer burger, which is what we thought the name was, until I decided to review and found the real name

FYI it is convieniently located near a dollarama, an SAQ, a Pharmacie and Valmont, so you can easily go there whilst running errands.
Just a thought....."}
