{"text":"Great food and service, quality for the price and a very nice setting, quiet as well as its in the hotel. Lots of selections"}
{"text":"This is the former Graze Cafe & Grill. Sunday brunch is $25 with a discount for people 50+. Service was great, our server was Kim and she is a bundle of cheerful efficient energy. Since it's a buffet servers are not always around for immediate attention but they do check on you from time to time. The buffet offerings are extensive starting with pancakes, bacon & sausage, scrambled eggs and hashbrowns. Omelettes can be ordered and made to your liking at one of the tables. There are bennies available from another table where the roast beef & ham is carved up and served. Around the bend is the selection of salads and then hot vegetables and other side dishes. They even had salmon and chicken. My friends loved the chicken. It tasted good, I found some pieces a little dry but overall had to agree that the spices used were very distinct and made for a delicious dish. The salmon was dry but what else can you expect from fish served buffet style. There was also 2 kinds of soup, turkey vegetable and a salmon chowder (i wonder if that's where the salmon from the previous day ended up). I found the smell a bit to fishy so opted to give it a miss. Roast beef was a good medium and tender. Desserts covered a large round table and then another side table. There were also belgian waffles and bread pudding. Definitely something for everyone Buffet food will seldom get more than 3 stars from me, food only does so well being kept on chafing dishes no matter how well they are prepared. Today was a slow day (we had a reservation for 12:30 p.m.) and the restaurant was not crowded at all so the turnover of food was slower and probably had sat in the serving dishes for longer than usual. Still if you're looking for a Sunday buffet this one has good variety and overall food was good.The food is served in the lobby area and corridor of the convention area of the hotel so it's a huge buffet selection."}
{"text":"We were stuck at the hotel waiting for a car so we decided try this cafe.  We ordered chicken fingers and French onion soup.  There was only one menu which took 10 mins for the waiter even realize we were waiting on - then 5 more minutes before we could get it.  Def the worst French Onion Soup - it was lightly burnt on top as you can tell by the picture.  The croutons were thrown inside making them soggy.  It seemed like something out of a can.  My stomach was not settled after I ate this so I ordered chicken nuggets - this was a little better.  We had asked for sweet potato fries and did not receive them.  The service was very slow because there is only person who services the bar and food.  When there were 3 tables full of plates of people who had left - he came to our table trying to clear it when we weren't done.  I would recommend a drink here if you have time to waste."}
