{"text":"Wow! We started with an appetizer. The wings were AMAZING!  Next came the ribs and pulled pork combo...so tender and YUMMY. I like the Carolina Sweet sauce but Brandon likes the Tennessee Whiskey the best. We both totally fell in love with the sweet potato casserole...dessert in disguise. Of course we finished with the bread pudding. The beer and service were great! Can't wait to go back!"}
{"text":"Horrible service, horrible margaritas, horrible food.. Bummed bc I do love Bbq and margaritas !!!"}
{"text":"Been there a few times and have tried almost everything but the pulled pork.  Everything is excellent.  One of my favorite rib restaurants even though is a chain."}
{"text":"Have had much better BBQ.  It was just myself so I couldn't order too much.  I had the ribs and beef brisket combo with beans and slaw.  Both sides were good but the beef and ribs were dry.  The ribs were not very meaty at all,"}
{"text":"The pulled pork Bbq was the best i have had in a long time. Great friendly bartender Ben took great care of me."}
{"text":"Decided to go to Sticky Fingers for lunch and I can honestly say it was quite delicious. I've been several times for dinner and normally get the smoked wings. This particular trip, I got the finger dinner and my husband got the BBQ pulled pork sandwhich. I would definitely recommend both of these meals to try."}
{"text":"On a Saturday, as a family we had lunch at Sticky Fingers.  There were 4 adults and 2 children and one teen.  The service was superior.  The Beer was the coldest we had ever had.  The food was delicious.  We had a variety of selections from the menu and everyone was pleased.  We would highly recommend this restaurant and we would definitely return."}
{"text":"Awesome experience...our waiter was James and he did a wonderful job.   This was the first time my wife and I ate here.  We ordered the combo platters.  Excellent choice and it was more than enough."}
{"text":"1.  The 15 minute wait to be seated was unnecessary.  There were 10 empty tables when we were seated, but yet there was a line waiting to be seated. 2.  The 5 minute wait for our server to show up was way too long. 3.  The service was forgettable. 4.  The food was too expensive for the level of service we received. 5.  Note to manager.  Hire some more servers.  Hire servers who know their income depends on their level of service they provide. 6.  The food was ok, but over priced for what you get.  There are other BBQ restaurants charging half the price, and better service."}
{"text":"Service was slow.  Food was unimpressive.  Cheese on nachos and stuffed potato nearly tasteless.  Not a place I would return to."}
{"text":"This is one of my favorite places to eat when I come to Charlotte. The food is excellent, the service is quick and friendly and I wish there was one in Fayetteville!  Delicious sauces - ribs, chicken, BBQ - all good!"}
{"text":"Disgusting.  Ribs were overcooked and cold.  The ribs were definitely in a warming oven for hours...dry and no taste.  The baked beans were hard, just like they had been dumped from a can and heated up.  I called the manager to the table and all he could say was, \"Can I get you something else.\"  No apology.  Plus kids are serving, which caused a problem for one of my guests who ordered wings but the wings never came out.  I asked her about the wings and she asked me, \"Do you want me to go get them?\"  My guests looked at each other before we said yes.  Just avoid this place.  No flavor, an institutional prep and delivery, and sub -par quality.  If you're at Concord Mills Mall and you want BBQ, just go to Sonny's."}
{"text":"Food was great! I had the wings and ordered a side of fries. Wings were lovely and crispy while still juicy and tender on the inside. Fries were perfect crunchy and hot and the seasoning is awesome. My fiancé had the ribs in tennesse whisky bbq sauce and they were delicious also! The beans from what he said were brilliant (we are australian and he doesn't usually like them but this time loved them!) the bbq sauces were all so good can't go wrong what ever one u choose I tried them all on different wings! And who can go wrong with 2 dollar domestic pints! Was a great night with yummy food"}
{"text":"A temporarily displaced Hurricane Irma evacuee, I researched a few BBQ spots to checkout while in town.  During my 1st visit to this location, I arrived at 9:30pm (restaurant closes @ 10pm) & ordered a full rack of ribs, sweet potato casserole, & bbq baked beans.  Interestingly, there was no other customer in the restaurant at the time.  Everything was top notch, including the available bbq sauces.  A few days later, I returned & brought my mom since it was so good during that 1st visit.  I arrived at 9:25pm and both doors were locked.  There were several staff members walking around inside who appeared to notice me outside.  However, no one made any effort to unlock the door and speak with me.  I decided to call the restaurant while outside.  The person picking up the phone probably knew it was me as he immediately mentioned the restaurant usually closes at 10pm, but closed earlier because it was \"not busy\".  Since it was getting later (closer to 10pm), I was getting worried about finding a suitable replacement bbq restaurant in time.  Consequently, I asked him if any comparable bbq restaurants existed in the near area, and the gist of his response was no.  I ended up going to a sub-par bbq restaurant & was obviously not happy with the way things turned out.  I blame this Sticky Fingers location for ruining what should have been a well-planned evening whereby I'd take my mom out to enjoy a very good bbq meal, something that is hard to come by where I'm from.  No idea how a corporate- or franchisee-owned location could be allowed to make up their own hours on a whim.  This also might explain why no more customers bother to show up.  Why go to a restaurant that does not honor its own posted operating hours?"}
{"text":"I travel alot and usually enjoy Sticky Fingers. I stopped to take my wife out for lunch and boy were we disappointed. It took a while to get our food. When we did my wife dug into the cup of collards and they were a funky taste like burnt with a hint of kale. Everything seemed overcooked and dry. Even the cole slaw wasnt that good sweet taste. Beans and mac&cheeae were pretty good. Very disappointed.... because of all the choices we had we picked Sticky Fingers....but probably not next time."}
{"text":"O.k BBQ ...we had sausage and BBQ sandwich as well as a burger they were all pretty good my favorite part of the meal was the bbq nacho for a appetizer ..."}
{"text":"Sweet buns on fire...  Their service is excellent, and I mean absolutely marvelous(: The waiter was a very chill person, and he let us have our space, yet came whenever it seemed that we needed something. It was so perfect. I loved it. Their chicken wings are so magnificent, especially with their barbecue ranch sauce. All the sauces were bomb bomb. Just everything that I tasted here was so wonderful- beyond Heaven. I felt like I was way up there. I probably looked that way too. Just the chicken wings alone lifted me into a space where magical euphoria flew towards me like a meteor and hit me so hard that it knocked me out. I went on a wild gorilla rampage.  The sad part about all this is: my mom interrupted my meal because of a so called \"emergency\".  I had to depart with the glorious wings to go next door to Razzoo's, which is amazing...ly horrifying compared to Sticky Fingers."}
{"text":"I was looking for a quite, uncrowded place for dinner.  All of the other restaurants around this Sticky Fingers location were packed.  I later found out why Sticky Fingers was not all that busy.  The service was very slow, waitress blamed kitchen and poor communication of orders.  I got the catfish, because it was supposed to be very fresh and not very fishy tasting. The fish was not bad, but definelty not best catfish I've had.  There was definitely a fishy taste, when I asked for Tatar sauce- I was told they are out and truck wouldn't  be there until next Tuesday.  Manager checked and apologized for being out of stock.   I decided to take a dessert home, picked the bread pudding.   It took forever to come out.   Waitress said she had to make the dessert herself because the kitchen kept messing it up. What I found in the box when I went home was less than satisfying.   There was a small end piece of bread pudding, you could see where the kitchen serving scoop had dug hunks of other pieces off of my piece.  At least I hope it was a kitchen serving utensil.   Also the pudding was ice cold, guess I as supposed to heat it at home in the microwave which just made it rubbery.  My waitress was very pleasant and I left more than 20% tip.  Total bill was almost $50, with a mixed drink.  Minus the booze, I could have gotten better food at KFC!  Sorry but this was a fail."}
{"text":"The food was sub par to average at best. The service was terrible. The waiter mumbled the whole time and didn't seem interested in serving us. I actually had to get up and ask for a refill and ranch for my appetizer. Just overall was not a good experience. The only positive I can find is the Mr.Pibb was good. I can't say I would recommend this place to anyone."}
{"text":"Great service, great food.  As an avid amateur BBQ-er, I recognize how hard it is to get a nice deep smoke ring on ribs, and I come here when I want to taste the fruit of a restaurant-grade smoker set up!  I love coming here, and if you're at The Mills, go here."}
{"text":"Pretty good food. I got a small pulled pork sandwich, and dressed it with the different choices of BBQ sauce they have on the table (which is awesome, thanks for having them all on the table!)  The service was really good. Our waiter was very nice and friendly.   Oh, and their margaritas are super strong. I believe I got a watermelon one. I was pleasantly surprised! ;)"}
{"text":"Well, when we arrived the hostess commented that they weren't busy which surprised me since it was Father's Day. There were only a few tables with customers. After we sat there for 15-20 minutes with no service, my husband waved down an employee and asked if someone was going to take our order. After several more minutes, a waitress appeared and took our drink order. She seemed surprised that we were ready to order our entree. It took a while for our meal to arrive. The pulled pork was tasty and I liked the variety of sauce available. My husband even gave the food a 4 and that is unusual for him. However, the service was a definite 3, maybe even lower. And I'm not so sure about the cleanliness. The ladies restroom was definitely a 1 at the time we were there.  If I had seen the restroom when I first entered the restaurant, I probably would not have stayed for dinner. I don't think I've ever seen a ladies restroom in such a nasty condition.  I was willing to blame a lot of that on it being a busy holiday, but like I said, the hostess commented when we entered that they weren't busy at all.  Next time, I will stand in the parking lot and enjoy the smell."}
{"text":"Our child, who has been to Sticky Fingers, wanted to take me to there for Father's Day.  My wife and I had never been there, so we thought we would give it a try.  It turned out to be a horrible mistake.  Where shall I begin?  Our waitress started out nice enough, but the overall experience deteriorated quickly.  We had to ask for our salads to come out before our meal.  Otherwise, they would have been there at the same time as our main course.  That is a terrible practice as the main course just ends up getting cold.  When our meals arrived, our child's meal was the only one they got right.  I got a plate of pulled chicken and nothing else.  My wife's had her fish sandwich and nothing else.  When asked, our waitress told us, in something of a condescending tone, \"when somebody orders the side salad, the other sides aren't served.\"  Huh?  Where has that EVER been a practice at ANY restaurant?  Wait, it gets better.  My sides came out.  A side of bland rice and uncooked green beans.  My wife got her fries weren't which bad.  However, her catfish sandwich was 'stringy' which is usually a sign of old / not good catfish.  My pulled chicken was also extremely bland and tasteless.  So, our entire meal was pretty much ruined at this point.  On a side note that I don't fault the restaurant.  There is a good sized segment of our population who don't know how to be parents.  There was a SCREAMING kid not far from us.  We asked the manager if he would please tell them that there are other patrons in the place who don't want to listen to their screeching brat.  I don't know if he was afraid of being called racist or just doesn't have the fortitude to be the manager, but you need to consider the other people in your place even if those inconsiderate morons had not thought as to the other civilized people around them.  I work in customer service myself.  I always try to be 'quick to compliment and long to complain'.  When I have to complain, it is that bad.  And believe me, this was BAD.  The one thing I will note is that they did void then entire bill.  So, thank you for that, but I will NOT be back and will provide free advertising on the various social media, my family and co-workers.  Thank you for a Father's Day that I will do my level best to forget.  06/20/2017: Sent multiple emails to Sticky Fingers and received no response on Yelp.  I think that speaks volumes as to their level of concern for their customers who have had a horrid experience at their 'restaurant'. I, once again, HIGHLY urge anybody reading this to avoid this 'restaurant'.  I have been told that Jim -n- Nick's BBQ, which is close by, actually serves good food and has good service.  So, if you in the mood for BBQ and find yourself in the area - know that you have a much better alternative nearby.  I have not been there myself, but ANY PLACE has to be better than Sticky Fingers.  Even the Burger King not too far away has far better food and services......  07/07/2017: After a few emails back and forth with a number of contacts with them, I received no further action or attempts to correct the issue.  The only thing I got was the phone invitation in the reply to this review.  I would prefer something in writing.  So, I will conclude this review by highly suggesting you go elsewhere."}
{"text":"The staff was friendly. The food was awesome. The alcohol was cold and boozy. Overall another great experience here."}
{"text":"I live very close to the Concord Mills location and have given it a few chances.....now I am moving on. I am a BBQ snob, being raised in the south will do that to a person. That being said, there are contenders and pretenders...Sticky fingers is a pretender. I have tried the pulled pork twice and the ribs once, each time I left wanting \"real BBQ\". Yes the sauce are pretty good, and you need them to mask the blandness of the meat. Their sides are ok, but I have had much better elsewhere. Bottom line....if you want honest to God \"real\" BBQ, this is not the place. Try Jim and Nick's down the street."}
{"text":"Terrible experience tonight.  Poor aervice, could not cut through ribs with a steak knife and one of out sides never came out.  Such a disappointing experience"}
{"text":"I enjoyed my first trip to Sticky Fingers in Charlotte.  Our waiter was very friendly and although he was extremely busy he made time to be sure we were well served.  Starting out with fried pickles, we were liking the place.  The wait for our food took a long while but the company was nice and it was a busy night so I quickly forgive the wait.  We got the ribs and BBQ pork and I wasn't disappointed.  I loved the sauces they have on the table, you are not constantly begging for them to bring out sauce so that's a huge plus for them!  The only thing keeping this from being a higher review is that I ordered an ice water and it tasted like some dish water mixed with melted plastic, with a hint of bleach.  I always drink water but had to immediately buy a drink.  The waiter pointed out that everyone complains about the water so I hate to say it but I wonder if that's a ploy to sell more drinks?!?!  In many years of ordering water this was the worst I ever tasted.  I had a nice date with me so didn't say a word but switched to a lemonade which was fine.  I hate to bog down my review with such a rant about water but for many of us that's a big deal.  If you go you should get a soda AND a water just to see how bad water can taste.  I would return to Sticky Fingers as the food and ambiance was nice...I will sacrifice my water drinking for a soda next time...you win potentially greedy Sticky Fingers, you win."}
{"text":"I went here last week for the first time and was pleasantly surprised. I had heard good things about it, and it lived up to its reputation. I ordered the kids ribs (because you're never too old to order off the kids menu there). Automatic plus in my book since I eat small meals, was visiting from out of town, and had no way to take leftovers home.  The dish came out with 4 ribs and a nice little helping of French fries, to which I sampled with every BBQ sauce offered on the table. My favorites after repeated dipping- Carolina Classic and Tennesee Whiskey. The waiter got my bill wrong, but immediately fixed it and provided us with great service. I would definitely go back, but I want leftovers to take home next time!"}
{"text":"I came here for lunch. There wasn't much going on so the server was very attentive. The food was pretty good and or hotel had given us a coupon for a free appetizer. That's always a bonus!"}
{"text":"Great to see that the old Sticky Fingers is back! Nobody does Smoked Wings like they do."}
{"text":"Horrible. I waited nearly 2 hours. Food was cold. Missing stuff and they didn't even bother to send utensils! Not to mention the driver was beyond rude as is he was annoyed. Never again."}
{"text":"Sadly, I wish I could speak on the BBQ here, but I have never tried it.  Both times I have eaten here, I have gotten the chicken tenders platter.    The chicken tenders are ginormous! Add that with two sides of your choice (mine was mac 'n cheese & french fries), & you have yourself quite a meal. In fact, I couldn't eat two of my tenders because it was entirely too much food.  The waitress we had was extremely nice & checked on us just the right amount.  The other wait staff at nearby tables were just as attentive.   The food temperature was perfect. The mac 'n cheese was oh so creamy & cheesy, I might could have made a meal just out of it.  The fries were hot & crisp.  Their prices are reasonable, especially since the portions are big. The area we were in was clean & tables cleared off quickly as customers left.  Maybe next trip I'll try the BBQ. :)"}
{"text":"We were back in the Concord area and decided to give Sticky Fingers another try. To the establishment's credit, several of the problems (dried-out BBQ and slow service) we experienced during our initial visit did not recur. That and moderated expectations made for a much more enjoyable meal.  Sticky Fingers was out of brisket when we visited, so my companion and I opted for a sausage/BBQ combo plate and an order of BBQ tacos, respectively. First, the good: all of the meats were moist, and the sausage had both a wonderful smoky aroma and a savory black pepper kick. The seasoned fries were also above-average. Now the bad: neither the pulled pork nor the pulled chicken had any discernable seasoning. Generous application of the house sauces (there are several, ranging from smoky to hot to sweet) and taco fixings remedied this, but one would expect smokehouse meats to be imbued with more flavor.  Service was both friendly and prompt during this visit. While the $8 lunch specials weren't being offered, the $9 to $10.50 blue plate specials came in generous enough portions to justify the pricing. The brick-and-pipe decor remains a good fit for the cuisine, and there was plenty of seating.  Upon re-evaluation, Sticky Fingers gets enough right (value, selection, sauces) to make it a decent lunch option, but the underseasoned BBQ continues to hold it back."}
{"text":"OK, here's the thing, I'm not a BBQ snob or anything, I just LOOOOOOOVE really good 'Que, and I despise it with a passion when its not up to par. SO, I guess a better adjective would be \"passionate\". Yea, that's it, I have a strong passion for barbecue.  Like that girl that you love with every fiber of your being when things were going good, but loath with a passion when things are on the slide.  You only loath and despise her because you CARE.    With all that being said, I despise Sticky Fingers Smokehouse and everything it stands for.  There's no debate in my mind - they served the absolutely WORSE RIBS I'VE EVER HAD.  Now I will say, I went there late, on a slow weekday evening looking to try something different.  But that doesn't mean the food should be garbage just because its not peak dining hours.  If you can't serve good, quality food during the hours you are open - then CLOSE!!   The sides were just OK.  Well, to be honest, they may have been better than \"OK\" but all that was overshadowed by the fact that I literally had to pull with all my strength to separate the meat from the bones.  The meat was as tough as bricks.  I mean, they're ribs people, the meat should \"FALL-off-the-bone\" not stay stuck to the bone because the ribs have been sitting out and around all day long!    I feel like my heart has been broken by yet another underwhelming BBQ experience by a place that claims they have \"Fall-off-the-Bone\" ribs.  STOP IT ALREADY!  The only thing that \"falls\" are my hopes and dreams of having a tasty well prepared meal - falls down the drain that is."}
{"text":"I went for a late lunch. The server was a bit slow, but the food was delicious. The dry rubbed ribs were excellent. I will definitely be back. Next time, I'm going to try to save room for dessert. Can\"t wait!!"}
{"text":"This want my first time at this location, there was a bit of a wait-and that's to be expected on a Saturday night in Concord. Music was kind of loud if you're planning on having a conversation.   We had to ask for silverware and napkins once our salads came because none were provided beforehand. I myself am a fan of croutons so the fact my friend and I's salads had 4 croutons total was a bit of a disappointment.   Next I ordered a Fried Onion \"loaf\" per the menu, I was expecting onion \"rings\" but what came was a mound of battered shoestring onions that was very doughy and uncooked in places; I ended up sending that back because it left much to be desired. I also ordered the potato skins with BBQ Chicken, the skins were fried to a crisp and what was left of the potato inside (very minimal amount) was inedible- but the chicken had a nice flavor.  The manager was able to remove the charges for those items from the bill, but still disappointing that the only item I was able to enjoy was the salad."}
{"text":"We were in the area and needed a place for lunch. It was not busy and we saw they had a buffet. The Sunday lunch buffet was a great deal for $10 a person. They had a few meats and sides plus a dessert. The food was OK. The barbecue was a little bland but they had several sauces to add to it. My favorite was the Southern sweet. My favorite sides were the coleslaw and baked beans. The baked beans had a lot of meat in them which I liked.  The dessert was peach cobbler which was warm but could have used ice cream or cream on it."}
{"text":"Not big for chains, but they have great smoked wings with a few bbq sauce options. Their dry rub is good but they have been bad about burning those at times."}
{"text":"Not my favorite BBQ place. it has the chain restaurant feel to it. I really like the loaded fries appetizer, we've got it the last few times. The other food is hit or miss. I've had really good rids there, fall off the bone, meaty, how they should be for a place claiming to be a BBQ joint, and then some times they are dry and small, and leave a lot to be desired.  The sauces are solid, I think I have tried them all. A little something for every one.   Wait staff has always been nice and friendly. Some times it goes awhile with out them checking on the table, but that seems to be a trend down South, or at least around the Concord area.  Drinks are good too, and comparable to drink prices of the other places around.   Overall, give it a shot, its not the ma' and pa' rib shack that you want to go back to time and time again, but if you are hungry, they can take care of you."}
{"text":"Just moved to town and had our first time here. James our sever was awesome with great recommendations, service, and over all friendliness!! The Bourbon Molasses is literally bone licking good!! Highly recommended!!!!"}
{"text":"the sauces are top notch but the ribs have no meat on them. How skimpy can they be that they get the cheapest, least meaty ribs out there. What a bummer! This was based on a visit the spring of 2013."}
{"text":"Sticky Fingers is Ok for a quick bite while out & about. I'd not go out of my way to eat here though. I'd sum it up as dooable in a pinch but I've had far better BBQ.  The atmosphere is average and the service was good so that's the reason for 3 stars.   Close proximity to the Concord Mills Mall is the other benefit to this location."}
{"text":"Went to Sticky fingers and had wings. they were 10x better than the Quaker Lube down the street. Ate at the bar. The bartender was very attentive and the bar/eating area was exceptionally clean. If I am back in town and looking for some great wings, great service and a clean restaurant- then I will be here."}
{"text":"Really sad food. I got the Memphis Bacon Burger. I tasted nothing but charred meat. The bun was more flavorful. My husband got the rib sampler, 4 different flavors of ribs. The flavors we're only on top and not really on the meat, and the meat was also very charred. The only good thing was the French fries.  Oh we also paid$ 5.50 for 2 soads, no refills,I'm sure that's a lot?..."}
{"text":"First. Great service from Roy! Very friendly and accommodative. Even allowed a little customization of my order  They had new sauces on top of their regular 5-6 sauce offerings. They weren't great but their originals still are, especially the Green and Blue labels.   Ribs were also good for the value and the fact I'm at a chain restaurant. Can't complain with that."}
{"text":"That's some good eating! I was there on business and stopped in because of the name, which is cool! The food was outrageous and I enjoyed my lunch. Baked potato was off the charts and the dipping sauces are awesome!"}
{"text":"Me, my wife and three kids came to sticky fingers in Concord our favorite server who has a warm welcoming smile a great personality is Armie my children like him so much they took turns tipping him he honestly made them feel good anytime your at sticky fingers let Armie serve you HD has great service"}
{"text":"We love this Sticky Fingers! It's always clean, waitstaff and GM are always friendly. The food is wonderful and comes to the table at the temperature it's supposed to be! The cornbread is like eating your dessert first!! It melts in your mouth! We would recommend this restaurant to anyone! And it's kid friendly!! Enjoy"}
{"text":"It's not that great, I rather go to a non chain rib place. They have fall off the bone tender meats. This was overlooked and dried out. Just muddled ribs."}
{"text":"As an Alabama born and raised girl, I must admit I am skeptical when it comes to BBQ in other states. For my Alabama friends, you know what I'm talking about. When I first walked into Sticky Fingers, I wasn't impressed with the commercialism and I was worried that the BBQ would be precooked and dry but I must admit it wasn't bad. Also not a bad price. We got two pulled pork plates and two 24 ounce craft beers for $32 including tax. Their huge selection of sides was a plus and the fact that they have five different sauces was also awesome!!! And regarding their service it was spot on with a wait for a table being only 15 to 20 minutes. That is amazing for 7:30 on a Friday night. Also don't miss the fried corn!!"}
{"text":"I feel like this place is underrated. We stopped in on a Wednesday night because I had been to one in Charleston years ago.  The place was pretty much empty. Our service was great and the BarBQ was delicious. I love all of the sauce choices. We also had the cheese fries and they were yummy. If you a craving BarBQ stop on on."}
{"text":"i had there ribs lots of time and they are just banging. my father turned me on to this place and i have been keeping the tradition going ever since."}
{"text":"The food was just ok. Not good and not bad either. I ordered the pulled-pork sandwich and it was bland and kind of flavorless. They do supply you with various sauces to choose from. It helps to add flavor but I would rather have properly seasoned food to begin with."}
{"text":"You can see my updated review below, dated 11/4/2014. Sticky Fingers representative \"Cassie J\" invited me to contact Sticky Fingers' Director of Operations Jason Couture (703-941-1961;jcouture@stickyfingers.com). At Cassie's kind suggestion, I did indeed vmail and email Jason Couture... It's now been FIVE MONTHS, and still NO ONE HAS CONTACTED ME. No one returned my vmail, and no one replied to my email. Believe me, the people at Sticky Fingers really don't care about their customers, although technically I suppose I am a former customer. Sonny's BBQ and others are within a quarter-mile on the same road, and I've never been sickened at any of them; by contrast, Sticky Fingers sickened both me and my spouse, and responded (ahem) very badly to our concerns."}
{"text":"We found Sticky Fingers completely by accident. Turns out that it was one of the best accidents we've had! Exceptional smoked wings and cornbread biscuits. Service was friendly and quick. We give it two thumbs up!!"}
{"text":"One of my favorite places for ribs. First one I went to was in Greenville and we had our rehearsal dinner at the one in Charleston. ;-)  Cost to worth it ratio: 3  Eve award: Best baby back ribs  Highlights: - Ribs: Meaty but tender; large but no major gnawing needed - Sauces: A variety of your choice for your ribs. Pick from carolina sweet, tennessee whiskey, memphis style wet, memphis style dry, carolina mustard, or habañero hot . -- Carolina sweet: my fave sauce. Basic tomato based one but with more sweetness to it like I like it --Tennesee whiskey: my second fave--has a bit of a whiskey kick - Sides: it defaults as cole slaw and beans but you can pick any 2. Other options are cinnamon baked apples, southern style rice, green beans, baked potato, macaroni & cheese, seasoned fries, or potato salad. -- Mac and cheese: I was craving this and it hit the spot. Cheesy but not too gooey and soft but not mushy noodles. -- Specials: they had broccoli casserole and sweet potato crunch. Love them both. Broccoli was almost blended with the cheese like a filling and very cheesy. Mashed sweet potatoes with brown sugar and nuts went well with the ribs but doubled as a dessert. :-) - Napkins: no measly white paper things here--they give you a green towel. ;-) - Lunch specials: they have a small portion of ribs as well as a few ribs and a bbq sandwich with sides - Location: driving distance from the hub's parents so a dining option I know I'll enjoy  Lowlights (my flip side to highlights): - MSG: I noticed most of the sauces included this and I prefer sauces that don't include this. - Pecan pie: I love pecan pie but never get to it here cause I fill up on ribs  I'll be back to Sticky Fingers next time I get a chance."}
{"text":"We got to Sticky Fingers at 4:15 pm on a Sunday and was first concerned that there weren't many cars in the parking lot. We noticed next door at the Cajun restaurant there were tons of cars, we should have gone next door right then!! The service was terrible and there is NO way our chicken wings and ribs were smoked at all!! They were baked. Their sauces are great but I can go to the grocery store and buy them and smoke ribs and wings at home! First and LAST time I will go there!!"}
{"text":"7 of us went here after church. Buffet was good for those who got it. A few of us decided to order food because the bar didn't have Mac and cheese as stated online, it had some weird yellow rice instead. I got the Blp it has 2 ribs, a sandwich, and 2 sides. The ribs were very bland it definently needs some sauce. The sandwich I got was not good. The pork was strong. I also pulled a chunk of fat out of it. My niece got wings and she wouldn't even eat them because they still had feathers on them. My sister picked what little meat she could off and ate them while my niece ate her sides. I do have to say though the French fries and Mac and cheese were awesome! The sauces are great and slaw is yummy. Overall it was ok. Nothing too great but it wasn't a total disappointment."}
{"text":"Stopped in here for some dinner during race weeks and it was pretty good. If you've never been there they'll give you 2 free ribs as a sample - and its worth it bc they are GOOD.   I ended up getting the half rack and pulled pork platter with broccoli cheese rice and potato salad (which i sent back bc it was super mustardy) and cinnamon apples. The ribs are amazing. I got them dry. The pork was good, but not AS good as the ribs.   The sides were good (except the above mentioned potato salad but that was personal preference).   They have 4 sauces to choose from so there should be something for everyone I'd think."}
{"text":"I checked in here for lunch one day and was impressed by the variety of lunch specials they had. They have lunch specials and blue plate specials in addition to the regular menu items. Today I got grilled chicken with collard green and sweet potato casserole, and it wasn't bad. The chicken wasn't tough either. There are about 4-5 BBQ sauces you can choose from and they are all present on the table when you are seated. There is also silver ware wrapped in a hand towel (I'm assuming for the ribs)."}
{"text":"GREAT BBQ place. I've lived in NC for two years and I kept trying to find a good place to eat BBQ, and this is the one. Not only is there BBQ, but there are other items like the wings and salads. Everything is delicious, there are many different BBQ sauces to try as well. Staff service is GREAT, and the beer choices are good too. There's nothing to complain about. Interior is clean, celebrities have been there, what more can you say?"}
{"text":"Don't go unless you have a couple hours to spare. Service was awful!! Took over 30 minutes after we were seated to get our drinks and another waitress had to bring them and then another waitress took our order. Were not served our food for over an hour! If I could give them no stars I would!"}
{"text":"YUMMY. I wanted to make sure I had bbq at least once while in NC. I was tired from a week of traveling and talking, but I found this place on Yelp. It was close to my hotel so I could take it to-go and enjoy it in the privacy of my room.   I walked in and ordered to-go with the friendly lady at the front. The food took awhile (about 20-25 minutes) but it was well worth the wait. I got a regular sized Pulled Pork sandwich with french fries and original bbq sauce. I guess there's a large sized sandwich, but the regular was giant enough for me. The pricing was excellent (about $8 total) and the food was delicious! I'm sure I could've had more \"authentic\" bbq elsewhere in NC, but this place really fit the bill for what I was looking for. Yum!"}
{"text":"I got the smoke house salad. It was good. It came out in proper time. Service was friendly. Nothing dramatic but it was good. Would go back but also try other places."}
{"text":"Stopped by on a whim while going home to Georgia.  I love BBQ and theirs is very good.  Service by Michael was excellent.  Clean place, nice atmosphere, friendly staff."}
{"text":"Ribs where great and the sides where alright and the service was also good. I have had better brisket but it wasn't to bad and the prices where fine for the amount of food you got."}
{"text":"We went their yesterday and not impressed at all.  First of all place is dirty,.  Let me put this way shelving has sticky dust,  floors are stick and a rugs they put silver wear looked like the same rags they washed silver wear.  Now food overcooked everything was overcooked.  Burger had burnt flavor buns aren't appetizing at all.  It felt like they fried food and then put it in dehumidifier.  Definitely not coming back. FYI Brooklyn makes batter BQ"}
{"text":"Lunch on a Friday. Shredded chicken sandwich with slaw was amazing. Service was excellent. Great place to eat BBQ. I will be coming here again. Our waitress named Hailey was very good and nice and timely. Happy tummy happy customer."}
{"text":"We stepped into this place 20 mins before they closed hoping it wouldn't upset the staff and was pleasantly surprised with gracious attentive service and good food!   Started with pulled chicken nachos - lots of meat, beans, jalapeños, tomato  cheese and sticky fingers sauce!!!!! Enough for 3-4 easily!!!!   My meal was the smoked wings I chose them naked so I could taste the full flavor of the smoked chicken  and boy I was happy!   They were so good no sauce needed!   And the waitress gave me extra in my order!     I usually don't dine at chains but this was a nice experience for sure and I'm sure I'll visit again!"}
{"text":"Came in around 3 pm, no crowd at all, so unsure why the service was so slow. Food comes out, no silverware so were given plasticware. Cornbread muffins looks like they didn't rise, just these little spongy pucks laden in butter stuck to the platter. I'd avoid this place if I were you."}
{"text":"Wife and I went back to SFS about a week ago to give this place another try.  We were seated immediately after we stepped through the doors.  I ordered a combination plate (chicken and ribs) and my wife had beef brisket.  Food was much better than the last visit.  Overall, we enjoyed the food and visit."}
{"text":"Very goood ribs. I preferred the rub without the sauce. Deep fried corn is awesome."}
{"text":"It is what it is.  Food is bland and no flavor.  Vegetables come straight from a can. Kids meal/kids bbq sandwich is a hotdog bun with a little bit (I mean little bit) of pulled pork in between   I do consider myself a bbq aficionado and have come to this conclusion. Better bbq cost slightly more but is exponentially better. Sorry sticky fingers, keep selling those sauces to the masses"}
{"text":"I went to Concord, North Carolina on business trip recently.  I wanted to try something recommended by the locals and wound up at Sticky Fingers.   Along with y colleagues, we all tried the sliced beef brisket lunch special. It came with 2 sides.  I chose fried corn and gravy & mash. All of it was delicious. Don't forget to ask for a piece of corn bread to complete the meal.  It's worth noting that they have an array of different BBQ sauces for the meat. I really liked the Habanero sauce. It wasn't that spicy, but very flavorful.  I also enjoyed the sweet sauce.  We topped off our meal by sharing a couple of desserts: peach cobbler and pecan pie. I loved both. I'm not a huge fan of pecan pie, but now I am. It was so good.  Everything was washed down with a big gulp's worth of sweet tea.  This place is very casual, a great value for the money, and the food & service will not let you down."}
{"text":"I eat here twice a month the food is always good.  I usually sit at the bar and the bartender always takes great care of me I think his name is ben very good.  Reliable and considtant"}
{"text":"We are from California so we wanted to try some BBQ.  The service was great and the food was also great.  Good portions and great taste.  When we return to Charlotte we will return to enjoy a dinner or lunch again.  I do recommend if you come to Charlotte you come and eat here."}
{"text":"As my wife and I were leaving the mall on a busy Saturday evening with a 2 year old and a 2 week old, we stopped in to Sticky Fingers.  This was our 1st time trying the restaurant and we were very pleased.  Nothing fancy but clean, unbelievable service, good food and served in a timely manner even when busy and hot.  The customer service was great from the hostess to the manager, and Roy our serer was awesome too.  Like I said not a fancy place but good food, clean, very reasonably priced, great service, and very kid friendly!"}
{"text":"Thanks for the great work of Kasi  Lassiter she was our waitress at sticky fingers in concord Nc . I gave my wife a retirement dinner of 40 people we had a great time because of Kasi Lassiter she made it a great day it was 6/23/18 the menu was Ribs Barbecue chickens dinner pull pork. Collard greens macaroni and cheese the food was so so good I thank all her guess"}
{"text":"I'm disappointed to say our 2nd experience did not surpass the first. Manager was super nice, however The waiter was (ruff around the edges). Not going  To share all the details as it doesn't matter at this point. However, one thing is certain we will not be going back when in town.  Dang it ..."}
{"text":"Sticky Fingers reminds me of Smokey Bones in Fayetteville, NC, which I'm a big fan of. This restaurant, while good, falls short of my experience at that restaurant, so I give it a great rating. I like the variety of barbecue sauces.  Even on a busy Friday night, we didn't end up waiting long. Also, the restaurant is kid friendly, so most families will enjoy it."}
{"text":"We were looking for a BBQ place to eat at and my wife picked this place. I was pleasantly surprised when I found out that they are the same company that makes the line of Sticky Fingers BBQ sauces.   I had no issues about the food or service. They have all five of their signature sauces available for use on their table and for sale as well.   They have a lot of nicely priced lunch specials, but the food was pretty high quality and I'd come here any time of the day.   It's also a short distance away from the Charlotte Motor Speedway if you're into that."}
{"text":"The bad. Poor service very slow worst brisket I have ever been served and just so so ribs. A rib joint should do better   The good nice people good smoked wings And lots of choices  on sauces  My friend went the next night they were out of ribs and brisket. On a Monday at a bbq joint"}
{"text":"It turns out that we spent another Saturday afternoon eating at Sticky Fingers, and without even looking to see what I had written last time, I came up with almost the same exact review.  My opinion was almost identical as well!  This time around, I did decide to try out their sweet tea, and let me say that if you actually get the tea, it's awfully sweet.  Some of the sweetest I've ever had at a restaurant.  Almost like syrup.  Tasty!  Unfortunately the first glass I had was unsweetened.  The second tasted like a mix of sweet and unsweetened.  I'm not sure if the third glass was actual sweet tea, or if I just had a glass at the bottom of the batch, but it was awesome.  I'll also have to say that while the service was friendly, they aren't very good at clearing plates.  As glasses and plates stacked up on the table, they didn't do a thing to clear them.  Very annoying.  Unfortunately I didn't take my earlier advice, and I ordered a pork sandwich, which meant that I was a bit disappointed with the meal, as the Sticky Fingers barbecue just isn't that great.  I also had a side of their broccoli and cheese casserole, which was pretty well just mush.  We also tried some of the hickory-smoked wings, which were really good.  Wish that we had more of them, in fact.  Luckily I also scored some ribs from some of the others at the table (have to love eating with family), which made everything else okay.  Once again, I tried each of the various sauces and once again I decided that I'm a fan of the habanero sauce.  It starts off tasting like the Memphis Sweet, but gives you a little tingle at the end.  Very nice.  Now I just wish I had more of the ribs to eat.  Someone remind me next time I go to Sticky Fingers?"}
{"text":"1st time dining here but as always, checked YELP reviews to gain an idea on how the food and service was to be expected. We arrived shortly after the restaurant open, so there was no issue with being prompltly seated and, I must say, excellent service. We have an excellent meal and the manager gave us complimentary sauces to take home since it was our first visit. Will definitely be back again!"}
{"text":"Good ribs, okay service. Near the mall so it is constantly bombarded with traffic on weekends. Good family restaurant."}
{"text":"Pretty poor. First cue was the fact that there were no more than 4 people in the restaurant. Party of 25 and we were assigned a waitress who was on her second day. She was a hard worker and tried really hard otherwise it would have been a one star rating. Sticky Fingers sauce is pretty good but if the vessels are cardboard equivalent the sauce won't save it. My ribs were bland and dry, the pulled pork tasted reheated and dry. The sides seemed like they were a couple days old. Can't see how this place can stay open much longer with bad food and no customers."}
{"text":"First time here, I was pretty impressed. I think this place is underrated! We were at Concord Mills Mall and drove around to find any where without a wait on a Friday night. Sticky Fingers parking lot was bare, when every other place had a 30 minute wait. I am not a huge fan of big chain restaurants especially something as delicate as good que! I dont get it though.... our waitress was unbelievably nice, appetizers came out quick we had fried pickles and spinach dip. The fried pickles were a tad over done and came with a yummy bbq ranch sauce, the spinach dip was amazing, one of the best Ive ever had. She filled our drinks regularly, food came out great... enough food to take some home! I really loved trying all of their signature sauces, mac n chz was good, good portions, oh and the loaded potato had lots of real bacon in it! Def underrrated, I like this better than Jim and Nicks BBq down the street."}
{"text":"Pretty disappointed. Horrible service, we were ignored nearly the whole time we were there, never even got a refill. When the food came out, they brought out everything except for my 4 year old's meal. He looked sad and left out until I assured him we would wait to eat our food until he got his. The ribs we got were extremely dry, and difficult to chew up. The pigs must have had an eating disorder, cause those ribs were skinny. I felt pretty sad watching my 2.5 year old getting full off of cornbread. He's not a picky eater, he'd eat a whole raw onion if you let him,  but he couldn't even eat his ribs. He did eat his Mac & Cheese, however my husband said it tasted like it came out of a box. The cornbread was good as well as the beans. The tea was perfection, I'm from Georgia and I like my tea Georgia sweet. They hit that spot on. However, as expensive as it was, I expected FAR more than good tea and beans :/ I will not be returning. I should've gone to Jim N Nicks where the food is good and the manager treats you like old friends :("}
{"text":"The ribs and sauces are a smoky, sticky and delicious!  5 different flavors. The corn muffins have a little sweet flavor, they are fantastic.  Our server was top notch!!!!  He made our vist extremely comfortable."}
{"text":"We've been coming here for the last four years while in town. Until this past weekend service was great. Waited two hours for nacho appetizer that came same as other food. They should of known there was a race in town and scheduled more service staff. However, the ones working did the best they could. Managment needs to improve as they are to blame for this experience."}
{"text":"Always love Sticky Fingers. I was pleasantly surprised to find this location in Concord NC I've been to the Chattanooga location several times, so I had high expectations.   This one did not disappoint. Fall of the bone ribs, with 5 great sauces for dipping or drowning you meat in. YuMmmy"}
{"text":"I've had better experiences at places, but my \"not great\" one here had little to do with Sticky's. They do need to spread you out a little more if they are not that busy so you don't get seated by some horrible idiots with their horrible idiot kids. But I digress.      Good food, but I wasn't floored, they didn't have the dessert I really wanted but I won't hold that against them, it happens.  I don't know where some of the other commenters have been but they don't have that great of a beer selection. Dessert ended up being good but it makes me wonder what the one I wanted would have been like.  Good enough for a return visit, but it won't be on the top of my list for places to go.  It was a haul to get here and there are plenty of other places in the area that have much better rep's."}
{"text":"Fantastic service all around!!!   Loved the fried corn on the cob, rubbed wings, smoked wings, jalapeño sausage & cheese and the Watermelon Crawl drink!  Pulled pork & brisket could've been juicier.  Recently had a great experience at Mission BBQ in Maryland and it ruined me for other less worthy samples ;-)"}
{"text":"Expecting so much more after multiple recommendations. Got the full slab for two and it was all overcooked. The green beans and cole slaw were nothing special. My brother's side of mash potatoes were still partly frozen. We would have complained but our waitress completely disappeared and didn't refill our drinks until after we were finished eating.  Frankly the best part of meal was the kids meal green beans. So disappointed"}
{"text":"I got a grilled chicken salad and it was very well balance with the veggies and meat. Their Banana pudding is amzeballs"}
{"text":"My family and I are fairly new to North Carolina and so far out of all the places we have tried out here Sticky Fingers has the best customer service! Not to mention the best bbq. I dont usually write reviews but they were so kind i had to. New favorite restaurant for sure!"}
{"text":"I went back to this location and once again, had some great ribs. The last time I was here must have been an off day as everything was good.l  Service was good and the ribs were to die for."}
{"text":"Everyone was so nice ! Our server was Spencer & the service was great. I will be returning here , when I come back to NC ."}
{"text":"Two stars for the food. I ordered $100 worth of food and sides. My first time using grub hub. The food was tasty but they forgot all the side dishes. I called restaurant and they said they would send it back out as my family is def not on a low carb diet. They never came. Grub hub did call me and credited my account for sides. But we were still expecting them."}
{"text":"We tend to stop in here after visiting the mall next door. It's never really busy so you don't usually have to wait to be seated.   They offer a Sunday Lunch buffet, we've never tried. We stick to the menu items. The prices are decent for what you get.   Overall the food is decent. Your typical BBQ establishment. They have the basics of BBQ (pulled pork, ribs, wings, brisket, etc.) I always get the pulled chicken salad and hubby usually orders the pulled pork platter. The servings are generous. No complaints on the food overall. Typically comes out in a timely manner as well.   Our issue is with the service. The wait staff has no sense of urgency. No matter how busy it may be, they don't stop by the table to check on refills, they don't ask how the food is, there's not much engagement with wait staff to the table.   Our most recent visit we asked the waitress is we could get an extra side of Texas toast. She looked dumbfounded. She was like \"we have corn bread muffins\". We tried to explain that the pork platter comes with Texas Toast and she had no idea. Poor training on managements part. The wait staff needs to know the menu."}
{"text":"We got there right at 11, thank goodness! It got pretty busy pretty fast. My husband had a pulled pork sandwich that was AMAZING. I got the burnt ends. If I lived nearby we'd be frequent fliers. The Mac and cheese was PERFECT!!! Not to gooey, not too runny! The sweet potato fries were very very sweet. I'd like them without the brown sugar. I didn't try the cornbread but my husband loved it. I'll be back before we head home just to get some coleslaw."}
{"text":"Just a good old fashioned BBQ joint. Service was quick and had a nice selection of beer and drinks. Ribs a bit dry and wings less crispy than I prefer but great sauces and reasonable prices."}
{"text":"Our server (Eric, I hope was his name) was very attentive to my allergens as well as my vegan preferences. He was on point with what was items were ok for me to eat. Not to mention he was very outgoing in accommodating me & my friend with our inquires. Now when a BBQ/Smokehouse can offer great customer service above & beyond especially to a Vegan...it's worth going back."}
{"text":"It was an ok meal. Nothing special but not bad. I ordered the chicken and half rack of ribs. Chicken was wonderful but the ribs were dry. My husband ordered the sampler of 4 types of ribs. Some of his were dry as well. Service was slow even though they were pretty empty at 2pm.  My main problem was that we had ants crawling on the table ......we told our server and he was like yep they come in when it's raining or after a rain.  No offer to move us or anything. So we told the person I guess was the manager that came around. He pretty much said that they had cleaned that area and the bug person was coming the next day. And then said maybe we shouldn't sit anyone else at that table till then.  Well yes that's a good idea.  Don't think a return trip is in our future"}
{"text":"At Sticky Fingers in Concord as we speak ordered a simple Club salad got served wilted lettuce no egg on it and it took him three tries to get the dressing and I was still waiting and walked out. Very laxed attitude!!! I will not be back."}
{"text":"Well I'm full. I ordered the pulled pork plate with baked beans and fried corn on the cob. The pulled pork was tender and tasty. I was not impressed with the Memphis BBQ sauce so I  sopped it up with a piece of Texas toast that came with it. Then I smothered it in the sweet southern heat sauce. That habanero hits the spot. The fried corn on the cob is a must."}
{"text":"Like others have stated in previous reviews, this is a chain restaurant. I visited on a weeknight and it was fairly slow. We had good service and the food was decent. I do enjoy the location in Wilmington a little more. It definitely did the job by filling me up and not breaking the bank. My party ordered ribs and they were pretty standard."}
