{"text":"7/2012 ordered pizza for the first time this weekend. Large is huge! Delicious sauce, cheese and crust. Everything you would want/expect from a local pizza shop. It was a little expensive compared to franchise shops, but you get more than what you pay for.  Scott B"}
{"text":"Simply the best pizza around!!

P.S. A large pizza is actually a large pizza
(I guess I have to write more) good pizza good pizza good pizza good pizza"}
{"text":"Not bad pizza when you get it hot. Couple times its been real bad. Raw once and another time used make shift sausage. Cheese must be cheap since its never gooey unless very hot. But its ok pizza.."}
{"text":"Our favorite local pizza. Large portioned pizza. Excellent flavor to their dough and sauce. Also love their hoagies and calzones. Only complaint is that it is pricey!"}
{"text":"Just stopped by for a large Italian hoagie and fries    Fast service, good food, but busy on weekends.   Be sure to order ahead for takeout.  Sometimes the phone is busy hard to get through.  Large pizza special on Tuesdays is killer."}
{"text":"My boyfriend and I tried this place when we first moved here a couple months back, it was EXCELLENT. So good. We just got it again for the second time- he specially requested it for his birthday. It's about 5 minutes from us, when we got home we realized the fries were forgotten from a decently large order, we just ran back up and they cooked them up right then and there. Such nice people working there! 10/10"}
{"text":"I've always found this pizza to be kind of bland, just not enough flavor for me. I do enjoy their steak hoagies and the fries are good as well"}
{"text":"Best pizza in Plum in my opinion, and they deliver ALL of Plum. Good quality ingredients, and they don't skimp on anything."}
{"text":"Used to be one of my go to pizza places now it's just not as good. Not sure what happened but just seems to be overpriced average food. Pizza the last 2 times we ordered was ok hence the 3 stars (still the biggest and one of the only true large pizzas in town). They changed their hogie buns from Mancini to some cheap deli rolls. Maybe I'm making that up but the hogie I just had was nowhere near what they were a year ago. I think I heard the changed ownership maybe the brother with the taste buds sold out."}
