{"text":"Classy well appointed interior, good food, and professional service.  There is a patio, dining area, and small bar.  They have a varied menu, with a slight focus on pasta and stone-fired pizza.  Its a welcome relief from the never ending parade of chain restaurants that dominate this part of the region, and provides one of the few good alternatives to other cookie cutter restaurants.       Overall an excellent dinner choice. I've been there multiple times and has always been a consistently good experience.  My favorite dishes are the steak and the mushroom risotto."}
{"text":"Service is terrible!!!! Tried it twice thinking it was just bad day for the staff but the second time was even worse. I have heard from others the same when telling them about my experience. They forget orders and take a long time. Food is ok but not worth what they charge."}
{"text":"Went here for a date night and it was quite good.  We were surprised at how many kids there were, given the price but it didn't really bother us.  Had a flatbread as an appetizer that was amazing.  My husband really liked his lamb and the flavours of my seafood pasta were great but the shrimp, scallops etc were overcooked.  We unfortunately didn't have room for dessert.  We'd definitely go back, but the prices make it a more of an occasional place."}
{"text":"It was bad!  I ordered the salmon and quinoa dish, the salmon was so salty it blistered my tongue, the quinoa was cold, the \"warm apple crumble and ice cream\" came, the apple crumble was stone cold and the ice cream was melted.  The server brought the bill, didn't ask why the apple crumble was left behind, didn't as over the course of the dinner how anything was.  The food..not so good, the service... even worse."}
{"text":"Place is in a little strip plaza in the middle of nowhere. Nice atmosphere and decor. Staff was very friendly.  We ordered the burger and the 10 oz steak. Asked for Medium rare for the steak which came out to be well done.  Had to return it to the kitchen as it was like cardboard.   2nd time it was more close to medium rare and the steak was nice and soft.  The burger was good and the fires were nice as well.  Overall, nice place for a special occasion"}
{"text":"This place is getting worse and worse. They used to have decent pizza, now it's really dry, tasteless, and skimpy on toppings. The service was slow and impersonal. It felt like the lady that was serving us really hated her job... and customers. The wine was really overpriced for the quality. This is likely going to be our last visit to Stonefire."}
{"text":"I've come here two times and the food is okay. I ordered the salmon both times and I appreciated how they were able to accommodate my gluten intolerance. Unfortunately I could only order the salmon or the chicken. All of the other choices either had gluten or dairy or both.  The salmon was a little bland since I wasn't able to eat the sauce. I asked for lemon, which they forgot to bring so I ate it without adding the lemon for flavour.   On a positive note, the vegetables were done really well. They had lots of flavour. Allover I would give the restaurant a 3 across the board.  It would have been nice if the waiters came by a little more frequently to see if we needed anything."}
{"text":"We had a company dinner at Stonefire.    Our service was great.    We had over 25 people at our dinner and everyone looked very please with their food.    I had calamari for my appetizer, steak for my main and cheesecake for my dessert.  No complaints and everything tasted wonderful.    Parking in the plaza where the restaurant is located is really tough.   We had to wait longer then usually to find a decent parking space.  That shouldn't take away from the atmosphere, the restaurant is very beautiful in the inside.    All in all if you are looking for a great local and upscale restaurant Stonefire is your place to be"}
{"text":"Food was good depending on what you ordered. The overall flavour of everything was great but not cooked properly. My pasta dish was basically raw and my so call carrot and apple soup was basically just creme soup. Based on your waiter the experience may be different since my never even refilled our water. The rainbow trout was really good but a small proportion. No chance it would feed a grown man."}
{"text":"Eaten here many times. Experiences have been mixed. On balance it is over priced for the flavor on offer. That being said we do like the mushroom risotto but coming in at over $20 it is not what I would consider a bargain.  If this place was downtown it would have died years ago but in Thornhill Woods where you have the Esso as an alternative, all of a sudden Stonefire is looking pretty tasty."}
{"text":"This was my first time here. It was amazing! Everything that we ordered was great. The Service was awesome too. The price point was reasonable.  I would most definitely go back. We also had a private room for our reservation which was bonus. It made our evening with 11 of us much more intimate and enjoyable. The private room has a glass door, so you don't feel excluded completely from the restaurant and I liked that."}
{"text":"This place is just average.  Its not bad, its not amazing.  Right down the middle average or just below. We came here as a group.  Most meals were not bad. Nothing special.  One order was completely wrong.  The person had to wait 15 minutes for the re-do of the meal.  It came back under cooked and soggy.  Now although they apologized, that is never enough.  One person was left eating alone after everyone pretty much finished their meals.  That meal should have been comped at the very least.  Maybe offer a free dessert? None of which was offered.  The only way we are coming back to this place is if we get invited by another party.  Wont be booking here ever again."}
{"text":"Nice decor, good service, food okay.   Mushroom soup was good, Risotto tasteless and cheese cake very good. Steak was tasty but very tough. Burger acceptable."}
{"text":"A solid three.  We've been going to Stonefire really since it opened as it is close to home. It's changed hands several times.  Service is consistently excellent and they are good with my kid's allergies. Good variety of kid's meals and they carry Cheesecake Factory desserts. They also have awesome boulart bread that they serve warm.  Tonight we had Kid's grilled cheese - real cheese, very stretchy Caprese salad - less cheese than I was expecting. It was delicious with the arugula Shrimp spaghetti - this was just okay. I've had it before and it was better."}
{"text":"My sister in law picked this restaurant for her birthday dinner, so we reserved a table for 10.  Good was mediocre but overpriced; service was extremely slow.   Nothing on the menu looked enticing. I thought lasagna would be a safe order at an Italian restaurant, and boy, was I so wrong! The lasagna was overly salty with a few crumbs of ground beef. Also ordered lamb meatballs as our appetizer, cost us $13 for 3 little meatballs. Hubby had a pizza which he said wasn't bad. We ate fairly quickly but this meal lasted 2.5 hours. There was easily a 30 minute downtime between courses. Server was pleasant however did not check on us as frequently as we'd liked. There was a big party the same night and they were not staffed adequately. Will never come back again."}
{"text":"Haven't been here in a while from my bad experience.   Was told this place got better.  So the service was great.  Our waitress was excellent and attentive.  Made good recommendations and was very good.   Out meals took a while to make and one of the kids meals were forgotten.   Out main seafood dishes were very small for the price that they were charging.  I ordered the fish special which was less than a filet and it was almost $45 for a very small piece.   The pasta dishes were very large and on one could finish a portion.  So one extreme to another. Mains are small on the fish and protein stuff.  Pastas are nice and full.    I would come back for pasta and salad dishes nice portions and reasonable.  Decent wine options to choose from."}
{"text":"I went there with my boyfriend for a late night dinner (they are ONLY open for dinner.. no lunch or anything) the restaurant had 3-4 other parties but it was a bit late the decor is very nice - very sleek, sophisticated; good for a date or a party we got a booth, which we really liked I had a glass of red sangria and it was really tasty; i could def taste the alcohol (which isn't the case for a lot of places i've had sangria) and they put lots of fruit and a spoon in there... they used frozen berries which I enjoyed cause they were a bit frozen in the middle and were nice and refreshing we both had salads because it was late night i had the goat cheese entree salad ... in my opinion, they could have put in more of the mixed greens and served it in a bowl (which is what his salad came in). mine definitely looked smaller .. all in all a tasty salad, the warm goat cheese was really nice.. but i do find the mix of strawberries, dried cranberries and tomatoes strange (i do not see the need for the tomatoes) .. i just gave them to my boyfriend .. this salad would have been better with nuts like pecans he had the chicken avocado salad ... which was ok; a lot of lettuce though and he said the dressing didn't have too much flavour (i also realise not that his salad never came with goat cheese even though it was supposed to)  our waitress was also very nice; not pushy or anything, which i liked they also bring some bread with oil and vinegar for dipping .. definitely high quality oil and vinegar .. i liked it  overall, it was a nice place prices comparable to a Milestones or Moxies I would say but I like the more intimate environment offered here as opposed to a chain restaurant"}
{"text":"I went here for a date with my girlfriend about 2 years ago.  I had the worst dining experience to my memory.  First of all, the restaurant was completely empty when we arrived, but the hostess said that most of the tables were reserved and that we would likely have better luck elsewhere.  We were going to leave, but then she said that they had a table in the corner if that was okay.  We agreed.  I ordered a pizza and my girlfriend ordered pasta.  The pizza was decent when I first ate it, but shortly after leaving, I had the worst stomach ache in memory.  I spent the remainder of the night in the toilet in a tremendous amount of pain.  It was the worst bout of food poisoning I had ever experienced...and keep in mind I have eaten food at the side of the road throughout asia.  I have never experienced such pain.  I probably ate rat poison that night and almost died.  Do not come here."}
{"text":"I went here for Savour Vaughan last year.  We secured reservations and arrived on a Saturday night. The place was packed with people so we had a nominal wait for our table.  After maneuvering ourselves through the crowds (the waitress explained that they added additional tables as the request for reservations for this particular night were massive), we arrived at our table. We were situated very close to another table so private conversations were not possible.  The décor is lovely...certainly not what was expected since the restaurant is in essentially a strip mall. Great ambiance, warm colours and a full view of the kitchen.  Food was very good, although it did take an unusually long time for our meal to come out. The manager came over and personally apologized and comped our bottle of wine. Certainly not necessary as the place was hoppin', but it certainly appreciated. Our waitress also apologized on numerous occasions...the crowds for Savour Vaughan obviously was a bit overwhelming   Food was above average for the area. Desserts were excellent. Noise level a bit high.  Our group of 4 all enjoyed our meals and 2 of us have since been back."}
{"text":"It's near my house and I kept driving by telling myself I need to stop in. I finally and cane a few times since.  Location: On Bathurst at Highway 7.   Parking: It's in a plaza and there's enough parking. No stress.  Decor: It's nice. Dim lights, there's tables and booths, can be romantic.  Theresa main dining are that has a small room with a large table that you can ask for. There's also a bar to the side at the entrance with a televisions bit more casual but still nice  Food: I like the food. I love the fried calamari , the shrimp diablos and mushroom risotto.  Desserts are good.  Most dishes were good but last time we are there I got the wild mushroom pizza and it was not as good as it normally is. I may skip this for a while   Staff: So nice!  I brought my book club here and had asked to sit in the bar so we would disrupt other patrons but they were nice and sat us in the private room! Woo  So I'll be back. I do like it!"}
