{"text":"Didn't have enough time to eat in, so I had to get take out fish and chips. Ordered the haddock and chips. Price was reasonable.  The fish: very crispy and tasted fresh. The batter was in the salty side but very flavourful.  The chips: thick cut and good.  The tartar sauce was the only thing I didn't like. Not sure if it was because I ordered take-out, the tartar sauce was prepackaged (like ketchup packs), and was not so good. Hopefully if I eat-in next time, they'll offer fresh house-made tartar sauce!"}
{"text":"Food was cold and way overpriced...my boyfriend ordered mushy peas for his side and we watch as they opened a can and threw them in the microwave for a minute...they were cold and they looked and tasted like baby food not true mushy peas...will never go back."}
{"text":"I have been going here for years, one of the treasures in Stouffville.   It's a family owned and operated business, very friendly, and consistent. Coming from Scotland, I know my fish and chips, and you can't go wrong here.  A define fan!  Jim"}
{"text":"Good fish and chips place.  Batter is not too thick and coleslaw is just right.  Could be a 5 star review if their other fried seafood was fresh."}
{"text":"Note: I ordered takeout, your experience while eating in will differ from my opinions.  Fish was nice, batter tasted really good but was a bit greasy. Chips were thick and tasty. Tartar sauce was one of those generic ones, which tasted really off.  Coleslaw was good."}
{"text":"Great fish and chips place! Came for lunch, and had the Haddock and chips set ($8.85).   Food: excellent fish, perfectly crisp. Fries were good and plentiful. Can sub for sweet fries ($1.50). Cod, Halibut & Tilapia are all options. Calamari and other seafood snacks are on the menu as well.   Atmosphere: Old man and the sea theme. Cute picnic style tables, with seaside decoration.   Service: Very good! Server was quick, and friendly.   Note: come here instead of Captain George (right down the street). Service, Food, Price are all better."}
{"text":"This fish and chips joint really hit the spot. The restaurant had its own welcoming charm with hanging plastic fish and lobster traps but the focus here is the fried fish. Offering not just haddock, cod and halibut you can find tilapia, scallop and clam on their menu too.  The fish batter had the perfect amount of seasoning. No extra salt or pepper or dare I say not even much tartar sauce was needed. The fish was perfectly cooked and a sizable portion too.  Unfortunately it was the food around the fish that were average. The chips and salad were filling but nothing stood out. The pie I believe was store bought. Tasty filling but the crust was soggy at the bottom and flavourless just like store bought pies.   I'd definitely come here again for the fish but I'll say no to the sides next time.   Ps you can order half chips if you feel a whole potato and more is too much."}
{"text":"Really good fish and chip restaurant. It looks like a family run, clean and nice place for small group. I ordered the combo 1 with the shrimp and scallop but not very impressed because they gave me just a few pieces for both shrimps and scallops and they are tiny, which doesn't worth the price. However the halibut is nicely fried and not oily or dry. I also ordered a tilapia for an extra piece and I like it even more than halibut because it's more moist. Overall,  I will come back again but will probably just going to get the regular fish and chip instead of the combo. By the way,  the fries taste flesh and they said they cut them in house everyday."}
{"text":"I'm always on the lookout for a good fish and chips place, and I saw this place when I was checking out my new neighbourhood. Best fish and chips I've had since visiting London, England years ago. Moist fish with crispy batter and very generous amounts of Malt vinegar equals awesome fish and chips! That alongside the friendly owner made it a great experience! It helps that it's so close to where I moved to now!"}
{"text":"Bad bad bad! The sign in the store window should read \"sorry we are open\" cold food bad food and really bad service...anyone can open a can of peas mash them and call that mushy peas!"}
{"text":"Best fish and chips I've ever had.  I typically get the halibut but all of their fish is so good!  The batter is really crispy and flakey while the fish is moist.  I also love that you can typically see them battering the fish right there.  I can't get over how good this fish is.  The fries are above average, thick cut, and pair nicely with the fish, as expected.  To top an amazing dinner off, their lemon meringue pie is also fantastic.  The service is always great when I go.  Everyone is friendly and the whole restaurant has a very warm and welcoming atmosphere.  Admittedly, I'm not nearly as impressed with some of the other items on their menu that I've tried.  Their breaded shrimp was average at best (almost tasted like frozen store bought) and their clam chowder was bland and microwaved...  I am basing this review on the one any only reason to come here; their fish and chips.  If you stick to this, you can't find better."}
{"text":"Friendly quiet little place smack in the middle of the main strip of Stouffville. Courteous service with a smile and tasty fish and chips without a doubt! I'll be back for more! Bring on the malt vinegar!"}
{"text":"Drive by this place many times but never had the chance to go in to eat. Today was the day! And just in time for thier Stouffvillicious Deal for $14.85 it comes with a Garden Salad, Haddock & Chips, A Slice of Pie & Coffee or Tea. The restaurant itself is a very small establishment. The table setup are cute with green, yelllow, white table cloths.   My hubby tried their Halibut and their in store made Coleslaw. Halibut was a bit stiff but he liked it that way. And the slaw was ok.  The salad portion was quite big which was great. I ended up sharing it with my hubby.   I preferred my Haddock fish better because it was softer and more moist. The batter was spot on, nice crisp and very thin! The fries were very thick but a bit not crispy enough for me :P  They had a few selections for pies. I forgot the rest but I ordered the Lemon Meringue Pie. The Lemon Pie Filling was a bit thick. I don't think they made it there. I'm pretty sure it was bought from the grocery store. :P  Overall, the fish was awesome! Would come back to try their other items on the menu! :)"}
{"text":"Appearance can be so deceiving.  The storefront of Stouffville Fish and Chips is so small that I used to think that it was a take-out place.  Upon entrance, I realized that it has a spacious dining area.  Customers can dine in leisurely.  I ordered a haddock F&C. The batter was quite crispy. The fish fillet was fresh enough. The fries were really good.  The services was friendly.  Pretty good place for a quick lunch bite. Oh yes, you can order take out, too."}
{"text":"A nice fish and chips restaurant that serves beer, and has the perfect matching \"sea life\" decor and diner atmosphere (wooden kitchen chairs, not the cold cheap steel stuff).  First place in Markham/Stouffville I've seen that serves mushy peas as a side, and has a general \"slice of pie\" as a dessert option.  My only complaint is the tables and condiments, and washrooms could be cleaner (e.g. sticky vinegar jars, tabletops)."}
{"text":"The best place for fish n chips!The fish is always fresh and not greasy and you can tell they take care of changing the oil.I have not had fish n chips like this since I was a kid!A definite must try!"}
{"text":"Little family owned restaurant. The staff here are very friendly. Fish and chips are fresh and delicious; coleslaw nicely compliments the fish& chips  , highly recommend this place."}
