{"text":"This a a pretty good place in a busy food court.  Fast service. Nice service. I had the Bento Box with Beef. Good over all taste."}
{"text":"Terrible service. 
Associates do not acknowledge people standing in line. They also do not pay attention to order details. 
Beware if you have any allergies."}
{"text":"I get fast foods and I get where you have to cutback on some things. But at $12.99 for my bento this was terrible even by food court standards. 

On the menu it says option of rice or \"organic\" greens. Greens pictured looked like beautiful leafy genuine organics. What I got? Ice berg blobs. Pls see pic. 

Truly disappointed as I sit here shoveling this down my throat. Sushi in my salmon bento were tiny tiny. 

The salmon was quite good which was the only reason I gave this place 3 stars. 

Was planning on grabbing a few sushi rolls to go but glad I ate in first. Won't be coming back."}
{"text":"My gf suggested we try this as she had heard that the concept is really good. Tried the 11:sumo crunch. I was skeptical before my first bite...but as soon as it happened...time stopped...and i was teleported to an AYCE joint stuffing my face with sushi rolls. The combination of ingredients and the giant shrimp tempura's in the centre made this the best sushi THING i have ever had. Even better than sushi pizza! The way they cut it in half and you can separate the box in 2 was really neat. Everything was amazing! Go try it!"}
{"text":"Very reliable food court Sushi! I always come here for dinner.

The prices are a little high but the quality is always reliable, and the food is pretty good.

There's not much selection to the menu, so it makes it easier for the cooks. All the dishes tastes fresh and come within minutes of being ordered. 

The staff are nice, even when the orders are packed. 

Overall great experiences with Su&Shi !"}
{"text":"I passed and saw a sign stating 30% off all sushi, I went to pay and I was charged full price. the cashier gave a sour and unimpressed look when I paid because I was asking about the discount. After I paid I went to look at the sign again and asked one of the workers, they said that someone turned the sign and it was a mistake. I just did not enjoy the lady taking my payment at the cash. Sushi was ok. $8.99 for 12 peices of small avo/Salmon roll."}
{"text":"Ordered a Veggie Bento Box with Salad instead of white rice. Comes with Avocado Sushi, 4 pieces of veggie tempura, a stir fry with veggies and tofu and the salad. 
The stir fry a bit sweet (note to self: request them
To make it a bit spicy), the rolls fairly good, the tempuras fresh and crispy but too greasy for our taste. The salad hardly any lettuce and a grape tomato, the dressing again sweet for our taste

The rice perfectly seasoned and could have used a bit more garlic and a bit more kick. A bit tofu would have added to the rice."}
{"text":"So I actually ate from here because I was desperately hungry and wanted to try something new.I had pretty low expectation since it is the food court version of Spring Rolls.  I was somewhat pleasantly surprised.

I had the House Ramen, which came with a decent assortment of meat, a piece of shrimp tempura and a small portion of noodles in your choice or normal or spicy broth.  The tempura was nice and crunchy and the meat was fairly fresh. The broth had MSG, but wasn't super salty.  The only downside is that the ramen tasted a bit like instant noodles and wasn't made in-house.  

Overall though, I do like the house ramen here better than Kenzo and is similarly priced with more meat and less salty, just that the noodles are a bit sub-par."}
{"text":"I ordered their poke bowl and for 15.99 plus taxes it left a lot to be desired. I ordered the tuna bowl which I thought would be filled with rice, veggies and more than a baby scoop of tuna. However, I was completely wrong and the bowl I was given in reality the plastic bowl looked big but you get measely amount of tuna,  short changed on the veggies, the sauce was just not enough acid or ginger taste, and rice was more like plain rice instead of Japanese rice. The picture advertised is not what it is given so, imagine that picture being three times less the size then being hungry for a burger from union burger afterwards. However, its food court food, and its square one so, they are basically just as bad or cheap as Jimmy the Greek. I am Asian and it hurt me to pay that much for barely anything."}
{"text":"My sister and I both tried the House Ramen today. It was horribly bland. The meat had the taste of a completely blanched slab of cardboard. The noodles had the consistency of rubber. The broth was, by all accounts, water. We tried to remedy the issue with some sriracha sauce, but to no avail. I was extremely disappointed, because I remember having some acceptable sushi from them in the past. For $10.99, we received a helping of water with some textures on the side."}
{"text":"Really good bang for your buck here. Most of their food is reasonably priced, and their sides are cheaper than other places. The only thing is the avocado rolls I bought were $5.99, and I usually get them for $3-$4. 

My boyfriend and I got the chicken teriyaki, gyoza, vegetable tempura, chicken karaage, and avocado rolls. Everything was extremely delicious except for the chicken teriyaki, it was decent, but I've had better. 

It's great for lunch or dinner while shopping in the mall, or they also offer delivery through UberEATS."}
{"text":"Not cheap and not that good. Wouldn't recommend the expensive sushi or rolls. Didn't expect too much anyways."}
{"text":"Been here too many times with mediocre food. You'd think I learned my lesson...

I got the chicken katsu cutlet.  I expected a breaded boneless cutlet either sliced after it was cooked or a whole intact piece.

What I got, was a greasy piece of chicken that looks like it was fried already breaded and sliced as it was cooking.  This made for an extra greasy chicken...

Not only that, the chicken had bone. It was a mix of dark and white meat.

Hadn't had a katsu cutlet like that before...

Don't waste your money on this knock off"}
{"text":"I've been wanting to try sushi burrito's for a long time now, but haven't been able to since I don't actually eat REAL sushi. I enjoy sweet potato  rolls, cucumber rolls, and any type of meat roll, but a lot of the sushi burrito places I have seen only offer legit sushi burritos. While hitting up the Square One food court on Sunday I walked passed Su&Shi and immediately knew I needed to give the curry katsu chicken burrito a try because it looked and sounded like heaven. The line here was pretty short and the food only took about 5 minutes to come out but watching them make it in front of me only made me hungrier cause it looked OH SO good. The burrito itself is served in this cool little box that fold in half so you can protect both sides of the burrito desperately. Upon opening the box it was pretty cool to see so much chicken and  rice and veggies packed into the tight little wrap...and the taste? Love at first bite. This thing was absolutely delicious and I was hardly able to enjoy it because I devoured it so fast. This place gave me a fantastic meal and a cool experience. I highly recommend trying this place out if you are trying to grab a quick bite at the Square One mall."}
{"text":"I like it when it's on sale. The nigiri sushi and salmon rolls is ok. The rice sometimes it's a bit dry if you buy it almost at their closing time. Their service is ok. Overall is an ok place when you want to eat sushi at the mall."}
{"text":"Best location and they are always nice to me and the food is fresh and clean and good chooses of sushi and you need to try this place !! High recommend"}
{"text":"Went to the su&shi burrito which is near the kfc side. They had a big promo 1$ drink ask the cashier. So we asked the cashier what the promotion was about. He said with any purchases of the food above 10$ we can get a 1$ drink.
We decided to take the passion fruit drink and a steak bento. He typed in the order already then said oh by the way the drink is only for mango or matcha drinks.

I told him as per the advertising he put infront it's considered as false advertising. If the offer is only for mango and matcha then only those 2 should appear. 
He was a non asian cashier, really nice guy. He asked the asian grill guy at the back if it's only tose 2 drinks as am saying it's false advertising. 

The grill guy looked at me annoyed then shook his head saying no no only those two. And it's small size only.

I still went ahead to take the order and we took a mango smoothie with the steak bento.
The steak & the rice were disgusting. The steak was smelly and the rice was just soaked in a black sauce. 
No taste at all. 
Sushi was good to eat. And the fried tempura."}
{"text":"Got their spicy salmon sushi burrito and it was above average! The only weird inclusion was onions.. as I've never had those in a sushi burrito or bowl. The spicy mayo and crispy tempura bits were perfect toppings and the portion size was huge! For $13 (a bit pricey), it's good, and definitely worth a try!"}
{"text":"Best sushi burritos!!! Ive tried so many places but yet this one is the best so far! Very fresh and their not cheap with the quantity they put in your burrito!"}
{"text":"When I'm craving for fast sushi, I come here.  The sushi is always fresh and can be made-to- order. They have a great variety when your on the go. Located in the food central of Square One. 

The prices are standard for the price of mall food. Paying between $8 to 13 for an ok amount of sushi for one person. 

The only thing that is bothersome is that now they are giving you packaged ginger, instead of the usual fresh ginger. And, is charging  $0.50 more if you want fresh ginger. I had to buy the fresh ginger. It's never the same when it's packaged. Plus, you never know the shelf life. Successful strategy Su & Shi, but not great for my pockets."}
{"text":"The food here isn't incredible, but I find their house Ramen to be the best Ramen dish in Mississauga. It's just unfortunate it doesn't compare to Toronto's Ramen shops, and their other options leave much to be desired."}
{"text":"When a sit-in restaurant expand to food court, they really need to be mindful in offering the same menu. I ordered the unagi with fried egg with rice, my wife had the Pork Cutlet Ramen.
Mine came out a whole minute before my wife's. No problem, this is the food court.
When I sat down and eat...if I was having dinner by myself, they would have gotten only two stars and that would be pushing it. They put something like two bowls of almost dried rice (a few bites was actually crunchy). If they had actually fried the rice with the egg like they normally do, the problem would have been solved, but they didn't.
So, how did they get up to a solid 3*? It was my wife's order. The soup was rich without being overpowering, the Ramen has just the right texture, and the Pork Cutlet was crispy but not dry. 
No matter what, they need to do better."}
{"text":"I am always up for sushi but have not really enjoyed sushi burritos from other places. They only had one vegetarian option for either a bowl or burrito called the Buddah. I was not feeling the combo of flavours and sauce they had listed but thought I would just go with it since it was late and I was exhausted:

\"Sweet potato, shitake mushroom, crispy asparagus, avocado, kale, roasted pepper, tempura bits, ginger, julienne carrots, red radish, sesame dressing.\" 

It sounded like I was headed for a strange mess that would have overpowering sesame oil flavour... But it was actually insanely good!!! I will be returning again.

*Update: Sorry but I had to downgrade this review to two stars... I returned here twice since I enjoyed my first visit so much, however during these visits they've left out ingredients for the Buddah burrito. The first time they left out the tempura bits. This time they left out the ginger and asparsgus. If I'm going to pay $12 with tax at the mall for this I feel like they should make the order correctly."}
{"text":"Possibly the best sushi Ive had in the area. This restaurant is always busy however the service is always quick without sacrificing quality. 
The sushi rice is always fresh,moist and flavourful. The fish is never ever foul! Always fresh and bursting with flavour! I love the wide variety of sashimi and sushi as well. Bright colours always make the eating experience so much better.

Love it."}
{"text":"Kinda average but fish was fresh. Good for food court food but nothing to take home. I had the salmon poke bento box, it was $13.55 everything included. You get a free miso soup with the box. A salad also accompanies the meal and the dressing on it was rather sour. The best part of the dish was the poke and rice but again, average at best. It would be nice if the sushi was made with a little bit more care as it would open up if you picked it. They also used Panko instead of tempura for the shrimp and veggie tempura. This gives it a crunch and not a crisp. If you don't want to eat anything deep fried or unhealthy, this place isn't a bad alternative."}
{"text":"Fresh ingredients, great portion size, and they recently have a $1 drink promotion for mango slush! 

This is one of my favourite poke places and has decent bowls/burritos. If you're in the food court and you're curious about the poke food trend, this is definitely a safe bet. I usually order the salmon love poke bowl with brown rice.

I have tried the salmon samba sushi burrito and it was super fresh and delicious! It's like eating a huge sushi roll but with more toppings than usual. You can customize if you want, but I feel that I get more food if I go with a pre-built bowl. My sister was also pleasantly surprised by the sushi burrito and has been converted into a fan.

I think the only critique I would give is the fact that they put roasted onions and peppers into it as well? I guess this just strikes me as odd since the texture doesn't match the overall textures or flavours within the poke bowl."}
{"text":"I was at Square One craving Poke Bowl. 
I noticed Su&Shi at Food Court and didn't expect much as it's \"food court food\". 
I was wrong. 
I got Salmon Love Poke Bowl. 
Their portion was huge, the all ingredients were super fresh, friendly staff and didn't even charge me for extra topping of avocado. 
My fiance who's a fan of fried food even said he would get it next time :)
What a pleasant surprise. I would definitely be back here."}
{"text":"Pretty damn good. Went here for the first time and had a sushi burrito. Use to having regular sushi so was excited to try it in a different way. Was definitely a filling. Nice mix of ingredients & clean and interesting way of packaging everything. I think that's what stood out to me the most."}
{"text":"I have had sushi burritos before and enjoyed them, Saw that Su&Shi opened a burrito/pokebowl outlet  in the Square One Food Court and I had to try it.   I got the Sumo Crunch sushi burrito and I was impressed. It has both shrimp tempura and crab meat in it making it a two in one burrito. The ingredients blend well together and each bite is one to be savored

I have also  had the sushi burrito at the Sushitto Food Truck & Mihito  and the one made by Su&Shi is just as good. . I feel the other two have more  quantity within their burritos. I am returning to try the remaining burritos and pokebowls  and so should you  :)"}
{"text":"Reliable ramen in Mississauga. Much better in Kenzo imo. That is all I need to say LOL."}
{"text":"Originally we thought the sushi burritos were sold at the original Su&Shi location. They actually have a separate location just for burritos and poke bowls across the food court.

I opted for half a sushi burrito ($7.99) and he got the salmon poke bowl with salad ($11). We also decided to share an avocado shake ($3.99) since it was their daily special. I realized after they charged me for tapioca when I never asked for it.

We really enjoyed our orders! Half a sushi burrito was a filling size for me. He didn't feel full after his poke bowl because salad isn't as filling as rice or a protein. I would recommend for you to try them out when you're at the mall. I actually prefer this sushi burrito place compared to Corners."}
