{"text":"Always fresh. Always delicious. Can't go wrong with any of the subs or smoothies/bubble teas. Try the lychee as an alternative to the pearls. Staff is always so friendly and fun."}
{"text":"My favorite spot to grab a sub in the SE, Sub is fresh & crispy, filling is flaverfull & toppings always fresh. Service staff is very friendly & helpful. Nice selection of bubble teas. Also the soups & noodle dishes are out of this world. Thank you Subs 'n' Bubbles"}
{"text":"This truck is pretty good! They are exceptionally fast for a food truck, which gets them a lot of points in my book! I got the pork bulgogi sub from them today, and it was pretty awesome. They definitely don't skimp on the toppings. I found their prices to be a little bit expensive for banh mi, and their subs a bit smaller than some of the ones I've had for cheaper, but at $8.50/sub they're not exactly expensive. Overall, they get some good points!"}
{"text":"Subs n Bubbles is delicious! I got the Korean Pork Bulgogi with cheese and it was perfect! The service was friendly and prices fair. I can't wait until they're in the area again."}
{"text":"Last year I tried Sub'n'bubbles veggie sub with cheese... It was very good, not the best but good. I was shocked when they tried to charge me extra for the cheese considering the veggie sub was the same price as the subs with meat $10. Now if you ever look at a veggie item anywhere else you will know that they usually charge a least a dollar less in which case I could agree to add an extra charge for cheese. This year when I went to try them again not only were they still charging the same price for the veggie sub as the meat sub they were not even offering cheese. Now if this sub had tofu or some sort of protein in any way then by all means  charge me the same as the meat subs; but to put no extra's into the veggie sub and just say well it has a lot of veggies is a cope out. Other people are getting the same veggies on their subs and something extra for the same price. I think it is rude and inconsiderate to expect people who, for whatever reason have chosen not to eat meat, to pay the same price as people who do. Every other place charges less when you are receiving less what makes this food truck so special  that it can charge people more for less. So until they change their prices or offer vegetarians an extra option like tofu or cheese or something that would be comparable to the meatetarian option I would recommend not eating at this food truck!"}
{"text":"A well executed Vietnamese sub, reasonably fast service, and the unusual option of a pork bulgogi filling earn this place 4 stars. Approaching the best banh mi in town, at Thi Thi. Interesting bubble tea flavours (tapioca or aloe jelly) available. Debit is an extra $0.50, so bring cash. Cheese is extra too, and was sold out when I arrived :-("}
{"text":"Fresh and tasty! 
I go out of my way to get my Chicken Satay Sub fix here at least once a week...and the subs seem to get better every time which is crazy because they are already perfect to begin with.
I have been a fan since the food truck days and I'm so glad they have a permanent location only a 10 minute drive from my house.
I love the green apple/lychee bubble tea combo, but sometimes when I'm feeling a bit more adventurous I will get the creamy tea. 
I think I'll go again today..."}
{"text":"This place was great! The sate chicken vermicelli was excellent and was served in a biodegradable container.  Excellent presentation and seasoning."}
{"text":"I am always happy to see a new food truck hit the streets in Calgary! I was lucky enough to have the opportunity to check out Subs 'N' Bubbles on their second day out. What a treat it was!

They specialize in Vietnamese subs & bubble tea - but there are a few other menu options. Salad rolls, anyone?!

After perusing the menu, I opted for the Korean Pork Bulgogi sub (loaded with all the fresh options like cilantro, cucumbers, onions, JALAPENOS!), salad rolls & a coconut mango bubble tea (with pearls, of course.) It was all made to order - not a soggy sub that had been sitting around. They toasted it perfectly & ended up with this perfect balance of warm, cool, crunchy, tender sub goodness. It was so incredibly fresh & was a flavour party happening in my mouth. I could not have been happier. The salad rolls were a nice balance of all the ingredients - not too much of anything,plus a generous portion of sauce to dip it in. And the bubble tea.... oh, the bubble tea!

I highly recommend making a point to find Subs 'N' Bubbles out on the streets. It's a happy pick-me-up for this time of year. The truck itself is beautiful. Angela & Paul, who run it, are so friendly too.

Five stars all 'round!"}
{"text":"I've been following Angela and Paul from the food truck, to Farmers market, to now at 7-­7204 Fairmount Dr. SE. My fave is the pork bulgogi sub and their shrimp salad rolls. With the rolls, they use some nice veggies/herbs that other places don't. Just need to request peanuts if you want peanuts with the sauce. Very accommodating and fresh food. Thanks guys keep it up!  http://www.subsnbubbles.com"}
{"text":"Paul hooked me with the best sub ever from his food truck then I could find him.   The one day I found their Fairmount location and the clouds parted and I brought my husband.   It takes very little for us to drive across the city for a pork bulgogi sub - simply satisfying 


No word needed.  Well priced and yummmm"}
{"text":"Subs-N-Bubbles has the best Bahn Mi I've ever had. Their Pork Bulgogi is like heaven on French Bread. It's one of the only foods I actually get physical cravings for. It's great having them in the Kingsland Farmers' Market because a great sub is always super close. Their Pho and Bubble Tea is also fantastic!"}
{"text":"I really enjoyed my first visit to Subs n' Bubbles.  Very yummy Vietnamese sub, with fresh toppings and bread.  Pretty fast service considering they were quite busy outside of the Bow Tower.  And their mango bubble tea/smoothie (I get them without the tapioca) was delish as well.  Definitely a food truck I would track down in the future!"}
{"text":"Bubble tea and vietnamese subs on the go.

As a huge fan of bubble tea, I couldn't resist grabbing one to save myself from the heat of XFest. Man was the coconut mango bubble tea (with pearls of course) delicious! It was so tasty that the next day I knew I needed to get another one, but this time I opted for the taro bubble tea. Even more delicious! I was very pleasantly surprised by the awesome quality of bubble tea they were able to produce from their truck and will be back whenever I see them on the street.

I need to find where they'll be next so I can get some more bubble tea!"}
{"text":"While at the Comic and Entertainment Expo this year, we ran into the Subs 'N Bubbles truck. First things first, I have to confess I have a deep love of Vietnamese subs. This is important to remember, because I really think you can do no wrong with a Vietnamese style sub. 

Consequently, subs 'n bubbles didn't disappoint. The food was excellent. I ordered the veggie sub with everything except the hot peppers and really enjoyed it. My partner ordered a beef sate sub and vows that we will be back."}
{"text":"Only managed to find the food truck once but what an experience it was! I had the butter chicken vietnamese sub and passionfruit iced tea for my lunch. I wasn't expecting much because a sub is a sub is a sub but wow! Butter Chicken IN a vietnamese sub? Genius!

I can't wait to see this truck around my neighbourhood this summer!"}
{"text":"I was very excited to FINALLY see a vietnamese sub truck hit the streets (why did no one else think of it yet? They are wildly successful all over the states!)
This truck doesn't seem to want to come downtown, so I ventured to the Kingsland Farmers Market to try them.
My #1 comment - their prices are way too high. With no overhead to pay, no rent, only need to buy ingredients, why can't you offer a decent-sized sub at comparable prices to EVERY other bahn mi place? 
When we recieved our 5 inch subs, which were $5.50 and then you had to pay and additional $1 per sub for cheese, we were sadly disappointed at the quantity of food. And HELLO! Bahn Mi COMES with cheese! It's a standard ingredient! Don't charge more for it! 
Although their sub was tasty, it wasn't special, and it wasn't worth the price. We had to go buy my husband more food afterward (and he's not a huge eater)."}
{"text":"Favourite place in the city to get Vietnamese subs. The rolls and tacos are also awesome"}
{"text":"UPDATED REVIEW:
Subs n Bubbles now has a booth at the Kingsland Farmers Market!  A fantastic edition to the market.
I still enjoy their Coconut Smoothies and delicious subs!  The bread is perfectly toasty and all the choices of fillings are amazing!
HOORAY for joining the market!"}
{"text":"Tried them out at their new location at Fairmount and Franklin, and they produced a very good bahn mi at a pretty-good-by-Calgary-standards price.

(I'm accustomed to paying less than half that - $4.00 - for similar quality in Toronto's Chinatown.)

But Subs 'n' Bubbles is much better than most of the competition in Calgary. No sickly-sweet Thai chili sauce ruining the flavours, nice Bulgogi pork available, and a decent touch-of-fire from just the right amount of thinly-sliced jalapenos."}
