{"text":"Amazing food. Place is called Subs N Such but their rice bowls are the bees knees. The owner remembers your name every time you visit and if you're not sure what you want tell him what flavors you'd like and he'll make a recommendation which is always spot on.   If you like spicy get the jerk chicken bowl. If you go to the subway a few units down instead of Subs N Such for a sub you deserve to be slapped for depriving your tastebuds of an amazing meal."}
{"text":"We had a wonderful time eating there today.  Such a variety of food items....not just subs.  Loved the rice bowl we got!  And the sweet chili wings were quite good.  I got the Reuben sub...... the pastrami was excellent and you could tell it was superior quality meat.  All their deli meats looked so much better than say Subway.   The owner was so kind to let us try the fries and the onion rings and I thought the fries were about the best I have ever had.  Such friendly folks and it is apparent that they want to please.   I would definitely recommend this establishment to friends and neighbors."}
{"text":"Went to try something different in the area and was very happy I did. Originally I wanted a salad but something called me to gyro when I got to the place. The owner was super cool. Gyro was on point as was the fries. Next time I am trying the rice bowl"}
{"text":"I was in the process of a 6 hour drive when I got hungry and came across this place. I figured why not and walked inside. There were no customers and the owner asked if I had been there before. When I said no he asked if I had been told about them once again no. He asked if I liked vegetables, chicken, and rice when I said yes he asked if I liked heat. I told him not to much he immediately started making me a sample bowl and said you'll love this try it. I warned him that I needed to be able to eat and drive and he was positive I could with this. The spice was to much for me sense I'm a wimp so he made me a teriyaki chicken bowl. He chopped the chicken up into smaller pieces so they could fit on a spoon. It wad so good and had leftovers and didn't spill any food! Everything was so fresh and I didn't feel bad about myself after."}
{"text":"Subs N Such is tucked away in a strip mall, but it's a bit of a hidden treasure.  I first noticed it when I visited the Subway literally just yards away, and I was curious about a place that was attempting to compete with such a major chain.  I'm glad I did!  Subs N Such has a surprisingly large menu that includes subs, salads, rice bowls, hot dogs, pasta, and more.  And best of all -- everything seems to get rave reviews from the customers.  I am still working on trying to branch out to give everything a chance, but I have tried several subs.  They feature freshly sliced meat, a variety of toppings and sauces to choose from, all on fresh-tasting bread that toasts perfectly if you'd like it toasted.  MUCH more impressive than the place a few businesses down, and in roughtly the same ballpark pricewise.  The restaurant also offers a variety of sides such as potato salad, pasta salad, fruit, chips, soups, etc.  There are individual servings of desserts (like cake, cookies, and really good baklava) as well.  The place is a former Quiznos, so it's a walkup counter area and you seat yourself.  The owner is usually present, and he obviously works hard.  The place is well-taken care of and clean, and he seems intent on keeping the guests happy.  I have been there several times since stumbling across it earlier this year, and I have no doubt that I'll be back again.  Highly recommended!"}
{"text":"Fantastic food, friendly service, nice portions.  A real hidden gem amongst the chains."}
{"text":"Mr. Patrick was really nice! I actually called to place an order due to it being so close to closing time! I told him what I thought I wanted. He asked what I had before and I told him it was my first time. He told me to hurry over so I could try it before ordering. He asked me did I like spicy food, and then he let me try the Sweet Thai Chicken rice bowel... It was really good! So I placed my order.Great customer service... I will most def. go back again!"}
{"text":"Good local owned business.  They have a flat top grill so you can get grilled onions on your sub and a toaster oven for A baked sandwich.  No microwave stuff like Subway.  My favorite is the Greek sub.  Prices are comerable to other sub shops."}
{"text":"Food is incredible and the owner is very nice, always wanting you to sample something new when you go in"}
{"text":"Staff are so friendly, & get my order perfect every single visit!  They give you so much meat too!  Hefty portions, & they put Subway and Jersey Mikes to shame."}
{"text":"I will start out this review by saying I have been a loyal customer for nearly 5 years, ZERO complaints about the food and I love Raja, he is the coolest guy ever, but... The wait to get the food will end up being this place's undoing.  In a business park oriented area where speed is a must, the wait for simple items like rice bowls is ridiculous.  He has a large flat top cooker but only cooks in a small area on the left front corner, one order at a time.  He needs to learn how to cook several orders at once or hire someone that can.  25 minutes for a rice bowl is a little much.  Order a sub and the wait is usually 35 to 45 minutes.  Great little restaurant for sure but they need to learn to multitask."}
{"text":"Just ate here for the first time. I will definitely be coming back to try the rest of the menu. There's a huge variety, between gyros, grilled or toasted subs, wings, salads, rice bowls, and a ton of different spices: jerk, BBQ, buffalo, curry, Mexican, Thai sweet chili. On and on. I got the Bull Rider grilled sub: marinated chicken with grilled onions and mushrooms and a chipotle BBQ sauce. Absolutely fantastic.  The owner is also really cool. I made a Yelp account to come give him a good review. New loyal customer here."}
{"text":"I am so glad I found this gem in a discrete shopping center. It's a hole in the wall restaurant (I've always found hole in the walls to be the best), but the food here is AMAZING. I don't give out 5 stars generously, but Subs N Such gets 5 from me.  I've only had the rice bowls here, but they're so amazing I keep coming back to try more flavors. They weren't kidding when they said their rice bowls are highly addictive stuff and it is filling. Their rice bowls are pretty simple (BUT SO DELICIOUS), it's got rice, a variety of diced veggies, chicken, and your choice of sauce. I've had teriyaki, bourbon, sweet thai chili, and buffalo so far and they were all great.  The owner is also very nice, he's always chatting up and getting to know his customers. He gave me recommendations of what to try, and he even took the time to prepare a free sample for me try.  Hands down my favorite lunch spot in this area. Come try it, you won't regret it!"}
{"text":"Had lunch today for the first time.  I tried the gyro.  Great sandwich and mist excellent French fries.  The only reason im going four star instead of five is because I thought it was a little overpriced for the amount of food that I received.  I will definitely go back and try some other items."}
{"text":"I was greeted by the owner when I arrived and asked if had been there before, He gave me an overview of the items on the menu, and  some good recommendations, He also greeted and talked with my young son who was with me. While waiting for our order he gave us a large sample of another popular item on the menu while we waited.  I liked the family friendly values he had and the great customer service, I plan to go back soon."}
{"text":"Not only is the food delicious and the veggies fresh, the  owner's customer service is outstanding. You could eat someplace else but why would you? I drive 20 miles for a curried jerk rice bowl and a sweet Thai rice bowl and I've never been disappointed. Flavorful and unique."}
{"text":"This place is perfect for lunch. Service is insanely friendly. Food is delicious. They give you a lot, so you can take the leftovers to eat later.  Had never eaten there before, but owner guided me to the perfect meal. This will definitely be one of my lunch spots."}
{"text":"Seriously some of the best food I have had in Charlotte.  My husband are foodies and amateur chef's in our own mind!  We don't go out to each much since we had our son.  This place is so unsuspecting.  The owner \"Raaja\" gave our son a free \"delicious\" chicken teriyaki since we ordered the spicey curry jerk chicken rice bowl (I get it everytime- no joke spicey).  The greek sub is also to die for!  Staff really takes care and the owner is just a great person.  Business is tough because of their location.  We want to keep this open so please tell your friends.  @MosaicCLT & @bounceU right across the street."}
{"text":"No way.... terrible.  I never return to a place where mgmt yells at staff in front of customers. Salad is a joke."}
{"text":"This place is awsome the rice bowls are to die for and they give you more than enough want leave hungry"}
{"text":"Food was amazing! The staff and owner went above & beyond to make sure this lunch was memorable! They even sent over a sample of one of their signature rice bowls- which was delicious by the way- since my boyfriend and I ordered sandwiches- the Reuben & the Jerk. Great atmosphere, great people, great food. Can't beat that for a Saturday lunch!"}
{"text":"I wavered.  I really think it deserves a 3.5. but probably the manager gives it another 1/2 star with his personality.  He asked if we were new, walked us through the menu, made suggestions and offered to let me taste the sauce prior to ordering.  My husband ordered the Philly cheese steak.  Many times they are dry and you have to add mayo, this one was juicy, flavorful and required no extra mayo.  I ordered the sweet chili thai shrimp bowl.  Honestly, I was disappointed when I saw it because of the lack of veggies; however, one bite and I was hooked.  The flavors all worked and complimented each other.  I also had a piece of chicken in mine and it was flavorful as well.  They are pretty slow, but it doesn't seem to deter the locals from the nearby offices - they filled the place up."}
{"text":"Good stuff here.  They still have the Quizno's toaster which is the only thing I liked about that place, but seem to improved everything else.  I had a chicken philly but asked for it with their jerk chicken instead of the regular, and it was quite good.  The fries were frozen bag fries but crispy and flavorful.  The bread they used was pretty good too.  I will be back to try to find something even better than the philly I had."}
{"text":"Read about this place on Yelp & the reviews are pretty good, so thought we would try. I got the bourbon chicken rice bowl and thought it was favored good & the portion was nice size. Friendly staff & I would drop by again if in that area."}
{"text":"I stopped in for lunch and it was delicious. I was torn or what to order and the young lady behind the counter suggested a rice bowl. She was very friendly and made a great suggestion. The rice bowl is more then enough for me to eat today and tomorrow. The owner was working the grill and very friendly. Great food and quality service. 2 thumbs up!"}
{"text":"This place is legit , really good food try there rice bowls !!! Good food , good customer service ..."}
{"text":"Well Raj is here today so that's  an ironclad  guarantee  that  my curry jerk rice bowl with  steak  and  shrimp  will be made correctly. I'm  wondering  how  spicy  it will be since I   told him to go wild. And it was like eating a blowtorch! My fault  but at least I  know  just  how  hot it  can get."}
{"text":"Had the chicken Philly for lunch today. It was great!!  I got to sample a jerk rice bowl which was spicy and very flavorful. Will definitely be back to try other menu items when I get the chance.  Very friendly staff, they want to make sure everyone has a positive experience and leaves happy."}
{"text":"I've been eating at this sub shop for over 2 years now. I love this little gem behind Staples."}
{"text":"I was so excited to try this place but I have to say I was disappointed. Sandwiches were not very good.   I had an Italian and it was very strange. They heated it, which did not help. Honestly you could get much better at Jimmy Johns or Firehouse."}
{"text":"OMG!!!! Why did i wait so long to come in here. This place is amazing. The owner met us at the door asked if we have been here before. He then guided us thru the menu asking what we like and helped us choose. I got the pineapple bowl and The hubby got the churry/jerk bowl. The bowls are amazing. We will be back!!!!!"}
{"text":"If you like unassuming places with amazing food, this place is for you. It's got a subway feel, but with way better food. In fact, they should change their name to Bowls-n-Such because their rice bowls are amazing."}
{"text":"Had lunch here today. With the status on Yelp expected there to be a line out the door however me and my coworker were the only two in the restaurant. Found out the place has been here over 12 years.  Honestly wasn't blown away and wouldn't say it's better than Chipotle or Moes. I will say you got a TON of food for your price. The owner definitely had a strong personality and was lecturing a new employee behind the counter even as more customers came in. A tad awkward and was using a lot of profanity with customers which was a little odd. Didn't offend me but still...not the most professional staff that I've seen.  All in all I would choose something else if I was back in the area again."}
{"text":"Let it be known that I've never written a review for yelp before and that's probably because no restaurant has compelled me to do so; that was until I started working near Subs n Such...Owner/Chef is very cool laid back but also very upbeat and optimistic about his restaurant--I think this is what sets a restaurant up for failure or success and I think he has the right recipe. Though I've only messed with the rice bowls (Jerk chicken being the best) I've tasted different items that coworkers got and loved it all. So don't sleep on the place, if anything give this owner more money so he can open others around Charlotte!!!"}
{"text":"Often times we find a place that can give you everything you want in a meal.  Well, subs n such is this place!  They offer a nice menu that can give you everything you desire from a menu.  But I must say, my favorite item on the menu is their curried jerk bowl.  This bowl has kick along with flavoring you would love!  The staff is great!  The owner is here often and his personality will keep you coming back!  Try Subs N Such and I promise you that they will not disappoint."}
{"text":"Holy moly! I almost didn't even go in, but the reviews on yelp convinced me. So glad! I tried the burbon bowl and a co-worker got the sweet and sour bowl. Both of us loved it. Plenty of food and I sucked it down like I hadn't eaten in days. This is a must try gem."}
{"text":"The rice bowls weren't bad.  Using freshly cooked chicken (not pre-processed and heated on a griddle top) would definitely increase the taste, value and likelihood of returning.  Staff were courteous and thoughtful."}
{"text":"This place is great!!!!! Have been going there at least once a week for past few months. I love their rice bowl. The best thing about them is that they try to do something different from the regular places. Even their sandwiches, gyros, wings are very good. I also love their fries. This place is a must try! Also i like the service, they try and personalize the food for you. keep rocking!"}
{"text":"Charlotte, I've found another gem. You have to get to this place if you like flavorful, creative food.  I found it by accident -another business nearby was closed, and the place caught my eye. First, because there is another sandwich chain shop in the same shopping center, which I thought was odd. But then I read what was on the windows. Mmmmm. Sounds interesting. All those different flavors in one place?  Now I was getting hungry. And wifi too? Okay!  The Owner/chef greeted me at the door. He's very nice and personable.  I have some dietary restrictions, so he asked what I liked, and he offered up some suggestions and even gave me a sample of the Jerk chicken, and told me what his favorites were.  He turned a rice bowl into a the most beautiful, amazing, flavorful and still healthy salad in just a few minutes!  It was a small, and still huge for me. (There is no photo, because I was hungry when I hit the hotel, and ate before snapping a pic, sorry.)    I'm on a business trip, but if I lived in the area, I would definitely be a regular here!  LOVE IT!  Hurry up and give it a try!     (.....and also Krazy Fish!)"}
{"text":"I found this place by sheer luck.  I was hungry and bored, so I decided to drive around and saw the sign lit up.  I ordered a cheesesteak with no onions and an order of mozzarella sticks.  First, the sandwich...  The bread is nice and soft, and the flavor of the sandwich was great.  I felt full after just half! The only thing I wasnt thrilled about was the mozzarella sticks.  Typical frozen and re-cooked that you get everywhere else.  I cant complain though because they were still yummy! The gentleman working tonight was doing his best to hustle.  I came in right at closing and he had 2 other sandwiches being made.  I have no problem waiting for a hard worker that gives good service, and that is exactly what I got.   I will definitely be back!!  Definitely recommend this restaurant!"}
{"text":"I have been having lunch here at least once a week for years and I felt it was time I write a review.  Obviously I like it.  The food is always tasty and prepared just the way you ask for it.  They'll do just about any change to a menu item you want.  A wide variety to chose from so something for anybody.  I like the subs and that's mostly what I have.  But the hot dogs, Gyro's, burgers, and desserts are great too.  Have not had any of the many other items offered so no comment on those.  But what really makes it stand out is the people.  The owner is almost always there and is super friendly and helpful.  All of his staff follows is lead and are just as friendly and helpful.    Just a nice place to have a satisfying lunch."}
{"text":"I needed to grab some lunch before I hit the road back to Raleigh and my nifty Yelp app steered me to Subs N Such.  It was pretty good!    I had the curry jerk chicken bowl. He made curry rice then added jerk chicken to it.  He asked me how spicy I like it and I said medium.  It had nice flavor and the right amount heat to it.  He put cucumbers, onions, tomatoes, and Cajun ranch on top as well. It was delightful.    The owner was upbeat and friendly.  There are about 6 tables inside for your dining pleasure.  They offer subs, gyros and other rice bowls as well. Definitely check them out if you're in the area."}
