{"text":"Went before the movies for dinner with my girlfriend, we both had curry.   A very small dish for 11$. Though flavorful not enough curry at all - which is unacceptable. Extra charge of 2.50$ for rice with the curry is nonsense. 30$ for a small dinner for two.  Not comparable to thai in Toronto, would not go back."}
{"text":"Great food and great service. Food: The seven herb fish and the cashew nut chicken were awesome. The egg fried rice was good as well.  Dessert: The sticky rice and mango was ok  Drinks: The Thai cold coffee and Thai iced tea were both really good."}
{"text":"It's good food, but a little pricey. I ordered green curry chicken, which didn't come with rice, so I had to get that on the side. My meal was $15.21 for take out. P.s they gave me no napkins, or chop-sticks/utensils. That's kinda stupid- I mean, it's take out.   When I was leaving, I asked if I could get a takeout menu. The woman handed me a business card, and smiled. I said \"no, A TAKEOUT MENU. you guys deliver, right?'  She said yes, they deliver- but they don't have take out menus. Again- not very smart."}
{"text":"Purchased two different curries, some spring rolls, and a variety of rices.  The spring rolls tasted like frozen box type. The curries weren't terrible but weren't commendable.  I prolly wont eat there again.  I can find tastier and cheaper."}
{"text":"Amazing thai food! Fresh, flavorful, and spicy. I always get the pad thai, it is absolutely perfect. The location is kind of out of the way from areas that I frequent typically, but it is worth the drive for Mississauga and Oakville residents since there are so many bland thai places. This place is never really that busy, and service is quite quick. I definitely recommend it for any person that likes Thai food ."}
{"text":"Really really enjoyed the food here! My mother and I shared the Red Curry and House Pad Thai and loved both. Service wasn't the best, but as someone who doesn't enjoy being checked on constantly, I didn't mind. A quiet place with great food, looking forward to going back!"}
{"text":"I'm a regular at Suko Thai.  The food is actually excellent and I think it's the best pad thai in the city.  So why only two stars? The service is AWFUL  I just came back from dinner and I ordered the following: Spring Rolls Green Curry Chicken Suko Pad Thai  The server didn't bring us the spring rolls so I can't comment on that.  The other two dishes were delicious as always. But we waited about 50 minutes before we got them.    Their main priority is the Uber orders. The customers who dine in are second priority. If you go to dine in, expect awful service with delicious food. My recommendation is to order out - not dine in.  The dine in experience is miserable."}
{"text":"I went there for lunch. I had a chicken fried rice. Although it looks ok, the portion is  small. After I finish the meal, I feel like I only had a snack. Also the price is expensive for the quality of the food. The place is also tiny and a bit crowded at lunch.  But I have to say the decoration of the restaurant looks decent."}
{"text":"Came here with my family and we ordered the Pad Thai in both regular and glass noodles variety. They had Gluten free options for my mom and everyone said it was one of the best pad thai's they have had in a while.  Service was pretty good but we were there early so there was nobody else there. Will come again if in the area."}
{"text":"Great food. Love the Lemon grass soup, Very clean and fast serves."}
{"text":"I'd like to give this 3.5. Atmosphere is nice. Service was great. Mind you it was Monday night so it was quiet and we pretty much had a the whole place to ourselves.  We ordered vegetable spring rolls, two pad thai, and ginger chicken with vegetables with rice.   Overall it tasted great. Very flavourful. My fave though was the coconut rice. Soooo good! Could order a bunch of bowls of just that.   The serving for pad thai was decent, but the chicken ginger was tiny. So if you're starving, I'd suggest to stick with pad thai cause that was filling! And like someone said here. It was pretty expensive for the amount they give you compared to Toronto."}
{"text":"I love Thai food for the sharp flavours.  Suko Thai offers several authentic Thai dishes on their menu.  I find their dishes much spicier in comparison to other Thai restaurants, so be sure to have rice on hand!  Suko Thai doesn't do much advertising and is located in a hard to get place, so it's usually eerily empty when we're there on weeknights.  Sometimes they may seem closed, but are definitely open for business.  On weekends they seem to be a little busier.  You can hear and see parts of the kitchen and it's obvious that your meal is prepared freshly when ordered.  We usually order a variety of dishes and share everything.  The cold rolls, the tom yum soup and the pad thai are all done really well here.  My favourite dish is the red curry chicken, cooked with coconut milk and lots of vegetables.  If you like your coffee strong and sweet, try the Thai version.  It will definitely keep you awake!"}
{"text":"DH and I have been been a customer for over 5 years. Takeout, delivery and eat in.  The food is very good, fresh and made with quality ingredients. Suko Thai has always been a bit more expensive, however the quality was worth it.   The reason for only three stars is it seems portions have gone down as of late.  Three weeks ago we ordered over $100 in delivery and there was barely enough for six adults to have a small plate of food each half filled with rice.   Then two days ago we picked up the large shrimp tom yum soup for $18.95.  DH went in to get the soup and came out with a bag. Get home and it ends up being two containers. One is a clear small size soup container, filled. If I had of purchased this size, cost would have been $6.95.   Second is a small black/clear rectangular plastic container, half filled with the rest of the soup. If I had of poured the contents from the black/clear container into an empty clear small soup one, it would not have filled the container. Therefore I paid  $18.95 for about $12 worth of soup and had I of purchased two small for $13.90 it would have been more soup for less money than what I paid and received.   I will say the soup had about 10 shrimp in it so I was satisfied with that, however I expected more broth. That is not enough soup for 3-4 as it states in the menu. Don't think I'll be back anytime soon."}
{"text":"Can't go wrong with their pad Thai. My go-to pad Thai fix! I tried the thai iced tea and thought it was a bit too sweet..it's made from a premise powder mix I think. Still searching for a freshly made thai iced tea place that is vegan friendly !"}
{"text":"We often order take out for lunch and my co workers and I love it! Super delish green curry and the fried fish is really good too!"}
{"text":"Very slow service and staff is not concerned with getting dishes hot to the table. Appetizer was cold. There was 40 minute gap between the soup and the pad Thai as the kitchen forgot to send it."}
{"text":"Decent Thai option in Oakville.  I would rate them above Funky Thai and Spoon & Fork.  The spring rolls are excellent and remind me of Young Thailand's spring rolls crispy and well proportioned filling.  Our mains of Tom yum soup and seafood soup were both enjoyable.  I added udon noodles to the soup as it was sparse but the flavor was spot on.  We also enjoyed the chicken cashew fried rice.  We ordered through Skip the dishes and delivery took approx 50 minutes which was acceptable."}
{"text":"I used to love this place when it was still in its old location on Winston Churchill and Dundas.  I didn't know they reopened the place, so I actually got excited when I drove by and saw the restaurant.  Anyhow, it was a Friday afternoon at 1pm.  The place was quiet.  May be the prime time for lunch had ended?  I ordered a tom-yum noodles soup with shrimps.  It came with a small spring roll as appetizer. The flavour in the soup was lacking.  Fragrance and heat was also very mild. I couldn't feel any \"kick\" to it.  However the Thai styled iced tea was delicious and refreshing.  Price wasn't cheap for lunch either.  With the noodles soup and a drink, it came to almost $17 with tax.  I was a bit disappointed in this experience.  May be I expected too much from them..."}
{"text":"Very prompt and cheerful service, clever assistance with the menu, and when I said \"4 x spicy\" they DELIVERED dear god haha.  The decor is nice but not over-the-top, and the menu features a lot of authentic Thai dishes.  We tried some appetizers and of course my awesome pad thai and washed it down with actual Singha (which I was advised to refer to simply as a \"Sing\").  It was a very pleasant afternoon and I'm itching to try more items on the menu."}
{"text":"Compared to the location in downtown, this place doesnt live up to its reputation. The yellow curry was a little watered down and the flavor as a result was a bit bland. Customer service was pretty good and the place was clean to dine. I would ask the original owners to come down and relook at the operations in the kitchen and see what can be done to bring the quality to par in comparison to their location. I was passing through oakville so i decided to check out but will not go out of my way to pay a visit any time soon."}
{"text":"My friend and I got seated right away on a Saturday evening. It took awhile for someone to come to our table to ask what we would like to drink. In fact, when someone finally did come she asked if we knew what we wanted to eat. So we ordered our food AND drinks at the same time.  I did a rough timing and it took just over 20 minutes for our food to arrive. Ehhh, a little too long. My friend got the cashew nut chicken and I got the pad Thai. I know some Thai places don't automatically include rice with certain dishes but to not include it with a cashew nut chicken dish?? Seems like a rip. I know a lot of other places that include rice, a larger portion of the main dish AND is cheaper. My pad Thai was pretty good though. Didn't have that orangey colour that pad Thai usually does but still tasted the way it was supposed to.  Service here is not great. No one came to check on us at all. The only time I was able to flag someone down was when the table next to us got up to call someone over. At this time I asked for the bill, takeout boxes and a water for my friend. I figured I might as well get everything over with before we have to wait for an extended time again. I won't return. Service wasn't there and the prices are meh. I have lots of other choices for Thai at better prices."}
{"text":"This place had the best pad Thai.  drove by yesterday, it looks like a new restaurant took over :("}
{"text":"My experience at Suko Thai was less than stellar.  I was looking forward to dining here, as a friend had informed me that it had been voted the \"best Thai restaurant in Mississauga\" two years running.  I went in with an open mind, but had a gut feeling that I was about to be disappointed. When we first entered the restaurant, we were unsure as to whether or not we were supposed to seat ourselves.  The host really took his time coming over to us - we didn't even realize that he was the host at first.  He was not very pleasant, and seated us at an awkward table in front of an emergency exit - even though there were plenty of tables elsewhere.  We had planned to ask our waitress if we could move, but he must have sensed that (because we were still wearing our jackets) and he relocated us to a more comfortable table. I ordered the green curry with chicken, and my friend had the crispy fish with chili sauce.  We also ordered the shredded Thai taro appetizer.  We were asked if we'd like rice with our dishes - isn't it standard that they come with rice?  Not sure how else we would eat them.  The appetizer was nothing special, and came with a chili sauce for dipping that was clearly out of a bottle (my friend has the same one in his fridge).  My green curry was extremely disappointing.  It had no flavour; I was actually scouring the tables for a salt shaker.  I had more than half of it left in the end, and chose not to even bother taking it home - knowing that I wouldn't eat it.  My friend's fish was well cooked, but was served with that same bottled chili sauce.  He wasn't a fan of his dish either. When we received the bill, I wasn't surprised to find that the rice had been tacked on as an additional charge.  What WAS surprising was that they were $3 and $3.50 for the brown rice that I had ordered, and the coconut rice that my friend ordered (respectively).  The portions were quite small - not even enough to eat my curry with, had I finished it - and let's be honest, rice is cheap. The waitress was pleasant enough and the restaurant appeared clean, and that's about the only good thing I can say for this place.  I'd hope that some of the other dishes are more savoury, considering the commendations this establishment has received; this is the only reason I gave 2 stars as opposed to 1. My advice: don't bother with this place.  As another reviewer mentioned, you can find better tasting Thai food for less elsewhere."}
{"text":"Very good Thai place... The owners and servers are from Thailand & really know what they're doing. The fried foods are sometimes a lot greasier than you would like but I think they do their best to try & strain the oil before serving. I would highly recommend the Shrimp Rangoon & Basil Duck. Their Pad Thai is hands down the best I have ever had & it still tastes good the next day if you happen to take leftovers home.."}
{"text":"This place was super disappointing.  We ordered the red curry (the guys recommendation) and cashew chicken.  The red curry chicken - I always go to never before experienced places to try it, cuz it's a safe bet.  And it makes it easy to compare.  Wow this dish was possibly the worst Thai dish I've ever tried, the sauce had a similar consistency to Tom yum soup.  It was bland, chicken and all the vegetables tasted like it had just been run through water and thrown in the red curry soup.  The cashew chicken was covered in sauce that totally covered the taste of the chicken.  The taste was way too strong, and overtook the entire dish.  The service was great.  But who goes to restaurants for their service....  Horrible place, definitely don't recommend going."}
