{"text":"One of the best Russian/Mediterranean/Middle Eastern I've been to in Toronto.  We tried several dishes - appetizers and entrées.  Great presentation, quality with varied and flavourful experience.  Highly recommended :)"}
{"text":"Amazing place with homemade food. Had dinner here while in Toronto and cans back the next day since we didn't get to try everything."}
{"text":"Second time here and the food never disappoints! Know that you don't go here for the romantic atmosphere or the amazing service (which was fine, just didn't blow us away.) You go for the food which makes the drive all the way from downtown Toronto worth it. The dumplings and stews are to die for, yes this is the one place you HAVE to order the cold eggplant dish, and it wouldn't be a meal without the boat shaped bread with egg and cheese. Take me back!"}
{"text":"Worst service - owner and the 'hostess' are despicable. We saw them drop a part of our food and try to put it back on our plate. I can only imagine what goes on in the kitchen."}
{"text":"This place is not Russian food, it is Georgian. And may I add, very traditional. We had the Khinkali's which are essentially massive meat dumplings, along with lamb kebob. The food quality was amazing! Service amazing! and we brought our own wine for a small corking fee with a large group. I must also add, if you are willing to try new things, this is the place to go! Also, try the 'Ajarski Hacha-Puri' as dessert. You're in for a treat when you go to Suliko."}
{"text":"It's alright. I went out with family here and didn't really know what to order since a lot of the food items was just beyond what I usually get in restaurants. If you're a sucker for Russian/Georgian cuisine, you'll love this place; my parents sure loved it but that's probably since they're Russian themselves ;) . I will definitely come back though to try other foods out, though, so hopefully I can update this review in the future."}
{"text":"Whatever the waitress recommended was good. 

Beet soup, the bread with egg/cheese, and the chicken shish kebab... Soooo gooood. Yum! 

I'll definitely come back to try other stuff."}
{"text":"The place has a very casual feel to it so don't feel bad if you show up in jeans and a T shirt. This is not one of the fancy Russian restaurants/banquet halls in North York. 
The food is really good! Great selection of grilled meats and salads to choose from. Loved the kebobs. The service was very attentive and friendly. Bring your appetite!"}
{"text":"One of the best Georgian restaurants I've ever been to! We went with a group of friends and the waitress was very friendly and patient when taking our orders. Portion was great for the price, most of us couldn't finish our plates. I ordered the mixed grilled platter with chicken, pork and lamb. Absolutely amazing, the meat was so flavourful and make me wanted to go back for more!"}
{"text":"Hidden gem. The food is tasty and fresh. 
Prices are very reasonable. 
Definitely will come again."}
{"text":"I am going to be writing this review with a Georgian accent (if it exists), or better yet a Russian accent. So fellow Yelpers, please read this in your head or out aloud (I don't judge), with a Russian accent. 

I am kidding... Jeez, who am I? An actor? 

Okay okay, so let us get down to this review. Before continuing further, I leave a grading structure, based on ambiance, customer service, food quality, price, and an overall rating. Perhaps suggestions would be great, in terms of what else I should include. 

Right, onto the review. I promise! Look below *insert down arrow* 

I knew that there was a Russian restaurant somewhere close to work, but I couldn't for some reason tell myself to venture out. That changed, as this was one of the restaurants that few acquaintances and myself were planning to visit on a weeknight. After knowing the place, I had asked my fellow coworkers, if they've been here, and they said the food is to die for. Granted, I did take it with a grain of salt. 

Upon entering the place, you can only pull up into the parking lot from Allness Street. You cannot enter from Steeles going Westbound. There is plenty of parking, so one should not complain. Setting foot into the restaurant, there are two big brown doors with decorations. At first I thought this wasn't the main entrance, but it was. I was taken to my table by the hostess/waitress, and took my seat. A 2 to 3 minute glance of the interior to inspect the ambiance, cleanliness, etc., I was impressed. However, I did notice that there were only two waiting staff/servers. I thought this could be a problem, which it somewhat was. 

Waiting for the others to arrive, we looked at the menu and I found that there is a decent amount of vegetarian dishes, and 2 chicken entrees (the chicken stew, and the chicken breast skewer) and the prices were reasonable I think. They did have a lamb shank special with one side for $9.99, and believe me the portion was just right. Was it worth the price, well you'd have to try it out yourself, as I didn't order that. I ordered the borscht, the kampot (their house made fruit juice) and the hachapuri lobiani (a baked pastry dish with red kidney bean stuffing). 

The prices for the above are $2.95 reg/ $4.55 lrg ( I ordered the regular size, and it came with sour cream) for the borscht, $8.95 for the hachapuri lobiani (great portion by the way), and $2.00 for the kompot. I think the prices were fairly reasonable for what I got, in terms of price and food quality. 

Onto food quality, the borscht was tasty. I've never had it, but it may be my preference. However adding the sour cream added, I found no difference to the taste. PS, I love the earthy taste of beetroot. Would I order this in the future - yes. The hachapuri lobiani, to me it sounded like a combination of an East Indian and Italian dish. The word puri, is actually an East Indian dish that is a small balloon fried version of a roti. Either way, I enjoyed it. It was baked, and the red kidney bean stuffing was perfect. However, it lacked spice to it. It was pretty bland for my liking, so I had to use some of the sauces that they provided during the appetizers. Oh yes, I completely forgot - they brought us complimentary bread, along with three home made sauces or dips. One was semi spicy, and the other two were just plain and simple. 

The kompot was tasty, and it reminded me of sorrel. For those of you who don't know, sorrel is a drink made from the sorrel flower. Its a Caribbean drink, primarily from Jamaica. Yes I grew up in Jamaica, but this is not an autobiography of me. Right? 

At the end of the meal, I would say, there is some room for improvement, and I am sure I'll see that the next time around. Hopefully. Do note that, it was a busy night - house full, and they were still able to deliver.

Few things I noticed:

1) Since there were only two wait staff, the service was kind of slow. Although, I do give props to our server, as she ensured that we were doing okay. 

2) Its a popular place, so its best to call in ahead and make a reservation. 

3) Since this is a Russian/Georgian restaurant, I didn't know that skewers/chicken shish kebabs considered to be an authentic Russian cuisine. Its mostly Middle Eastern/Mediterranean, unless I could be wrong? 

4) If large groups, they add a 15% tip automatically to the bill, pre HST. 

Here is my scoring for the below:

a) Ambiance - decor, lighting, mood setting - 9/10
b) Cleanliness *including no hair/bugs in the food* - 10/10
c) Service - 7.2/10
d) Price - 7/10 - Other dishes were up there, and some noticed that the price wasn't worth the food. I'll let them leave a review for that). 
e) Quality of Food - 7.3/10

Overall, I'll definitely come back, and I'll recommend this place to others. I'll probably try something else out. They do have a lunch special for $9.95 that includes salad, one meat, rice I think, and maybe a drink? I'll have to try that out another time.

Until next time fellow Yelpers."}
{"text":"Came here with my friends and had a great time. The restaurant is beautifully decorated, very spacious and clean. This place is nice for dates but also good for families. The food is unique and delicious.  I recommend trying out the Georgian dumplings and pastries. The cheese and bread pastries were very fresh and warm. Will definitely come back again."}
{"text":"I've never been to a Georgian restaurant before, but I gotta say that it was a great first impression of their cuisine.

Khinkali w/ Beef, Hachapuri Adjarsky, & Lamb Kebab (4.5/5): For anyone who has ever had xiaolongbao or AKA soup dumpling, the khinkali is VERY similar. It's about the size of a fist, served up fresh, and the soup just pours out the second you bite into it. It's definitely flavored differently from how the Chinese do it however my flavor palette isn't very large, so you'll just have to come here and try them. I guarantee you'll like them if you enjoy xlb :) Now the Hachapuri Adjarsky is a beautiful creation. It's a boat shaped pastry piled and stuffed with different kinds of cheese (at least 2 types) and is topped with a sunny side up egg. The outside is crisp, while the cheesy top and inside stretches as you tear away a piece. Kinda of like pizza? But twice if not 3 time the cheese. It's was great to dip in the egg yolk and VERY filling. This is a large dish that I recommend you share with others. Lastly the lamb kebab. I came in the summer so they popped these right on the barbecue which they have on their outside patio. It's exactly like a Turkish kebab! Well seasoned, has a little bit of kick to it and best of all, juicy. It's a great portion size as well, you won't be disappointed.

Cost (4/5): $6 for 3 fist sized georgian dumplings, $8 for just a lamb shish kebab, and $9 for the hachapuri. It's decently priced for what you get. I have no complaints.

Service (3.5/5): I admit, they were alittle slow bringing out the mains. We waited around 20-30 minutes, so it's definitely not fast food. The table service was mehh seeing as we had to ask twice for a new pitcher of water. However, they brought out the appetizers quickly which tides you over to the mains along with good table conversation.

Ambiance (3.5/5): Our group sat on the patio, and it was a beautiful day. However with the barbecue and wind blowing in our direction is a bit much having all the smoke in your face. So  just a warning in case you want to sit on the patio next time. I've never been inside, but will definitely return :)"}
{"text":"This restaurant is amazing and is now my new favourite Russian/Mediterranean food spot. It's new, very clean, nicely decorated, the food is super fresh and very reasonably priced. The service is friendly, quick and very attentive. I was there on a Sunday night with my dad and sister. We ordered: \"Suliko\" Salad (house salad), Borsch (Veg beet/cabbage soup), Ajapsandali (Veg stew), Khinkali with potato (Georgian dumplings), Khinkali with lamb, Hachapuri Adjarsky and Hachapuri Imeretinsky (Georgian puff pastry filled with cheese) and Chanahi (Georgian style lamb stew). Everything that we got, and I do mean everything was fresh and delicious. I live downtown and I wish this restaurant wasn't so far away. Oh and did I mention they have a sweet patio and no obnoxiously loud music? Can't wait to go back."}
{"text":"We were a party of 5, one of which is a picky eater. Very friendly service. The 2 Salads were good. We had one cheese/egg pie and one spinach cheese pie for appetizers. The spinach cheese one was good but the cheese egg pie was excellent.   We also tried the lamb dumplings and the beef/pork dumplings. They reminded me of soup filled dim sum. These were ok.  We then had the mixed grill and chicken breast shish kabobs. EXCELLENT.  Done perfectly and well seasoned. We then finished off with crepes for desert.    We will be returning and recommending this restaurant to friends.  Prices were very reasonable and we weren't rushed to finish our dinner.  Really liked the place."}
{"text":"Worst service - owner and the 'hostess' are despicable. We saw them drop a part of our food and try to put it back on our plate. I can only imagine what goes on in the kitchen."}
{"text":"We come to Suliko at least once a week! The lunch special price is unbeatable! the portions are very generous and the food feels very home made. Great bang for your buck!"}
{"text":"Great place. We tried lamb shish kabob and hachapouri which were awesome. Service is good and friendly. Also this place has tons of Georgian foods."}
{"text":"Fantastic Georgian restaurant close to Steels & Keele. We came in after we had had a nice day at the nearby attraction: Black Creek Pioneer Village. It's quite cozy inside and there is a patio which is great in the summer.
Their food is very authentic Georgian food and has this home made touch to it. Definitely worth the price.
Basically anything we ordered was delicious so I will not even try to go into details here. Just go and try, highly recommended."}
{"text":"This restaurant is such a hidden gem. Super authentic food, and the entire restaurant ambiance is really authentic too. I recommend sitting on the outdoor patio tables if the weather is in your favour. 

The Hachapuri Adjarsky is a must-have. It's a boat-shaped break with melted cheese and a half-cooked egg cracked on top of it. Super flavours, cheesy, and delicious. 

The lamb stew, Chanahi, was also very good. Great for people who love lamb because the flavour is definitely really strong."}
{"text":"It's my first time experience in a Georgian restaurant and I'm not familiar with Georgian cuisine in general. 

That being said, it was a nice overall experience! If you go into a place and it's pretty full, it's a good indicator of what you might expect. Lucky for us we got the last available table when we walked in. 

Food: We got bread and a few dipping sauces with some kind of pickled cabbage on the house as a starter. I always enjoy when we get those small things. Leaves a good impression (5)
We ordered \"Kavkaz\" salad, eggplants, and mushrooms and cheese as appetizers. Cheese and mushrooms wins, but the salad was close second (4.5)
Mains: 2 dishes of lamb and chicken kabob plus 6 Georgian dumplings were enough to feed 4 people. Lamb kabob felt a bit dry and over cooked. I've had better for sure. Chicken on the other hand was really tasty! Dumplings were pretty big, but felt they could have been boiled just a bit longer. (4)
We didn't get to deserts cause we were already pretty full

Ambience: Decent decoration, not too loud. Nothing too fancy though. 

Service: Our waiter was polite enough. However, there was a bit of a language barrier. He was trying to explain things from the menu, but not sure he understood everything we asked since we were all new to this kind of food. Food was delivered fast enough, but sometimes we had to wait a bit until the waiter showed up(3.5)

Overal : considering we paid $105 for 4 people plus drinks, I'd say it's a great value for your money. I'd definitely go back if I get the chance."}
{"text":"My favourite place for Russian/Georgian in the GTA. Mixed grill is the highlight!"}
{"text":"Let me start off by saying I've never had Georgian or Russian food before, so I have no benchmark.

We made a reservation here for a small team lunch on a Friday afternoon (~10 people in total). I was obviously ubër excited to try a different cuisine and was so glad I did. Our waiter was very accommodating and even provided suggestions on what to try and their top items. As with any large groups trying a new cuisine, we ordered too much but we didn't mind packing the delicious leftovers! :)

For the table we ordered, 2 Eggplant rolls (Cold app), Mushrooms \"Suliko\" (Hot app), 2 Draniki (Potato pancakes), Khinkali with lamb (Georgian Dumplings), 2 Hachapuri \"Suliko\" (flaky puff  pastry dish) and mixed kebab grill (lamb, pork, chicken, beef). 

Although all of the dishes were good, the Eggplant rolls and Hachapuri were my favs!

Coupled with the food, the interior decor also gave off the authentic vibe.  Thanks for introducing me to Georgian food Suliko, I'll be dreaming of Hachapuris for days!! :)"}
{"text":"my stars are all for the lamb crock pot, i loved it, Delicious!
my friends tried the lamb kebab, i tried it, was ok for me, 
make a reservation, restaurant is often booked up!"}
{"text":"Good restaurant great people 
We meet owner nice lady 
Good fresh food 
Fantastic!!!!!!!!!
U guys all should try Kabobs !!"}
{"text":"Overall, this was a pretty good experience for me, a little outside my comfort zone but hey that's what Yelpin' it up is all about right? Exploring new places and trying new things.

We came on weekday evening thinking that it may be less busy however, between two other large groups and our group of 20, it turned into an apparently unexpectedly busy night for the restaurant and their two lone servers seemed to be overwhelmed. My critique here was that we did provide adequate notice of our reservation and judging by the set up of the other parties so did they - the restaurant should have planned accordingly for more staff. To the staffs credit they did their very best to accommodate but service was spotty and slow.

Not all was bad though, we ordered a variety of items to share as starters. The crepe rolls and the massive dumplings were both something worth trying. That said beware of the dumplings as they are filling! Oy. I had 1 of each kind and a crepe roll or two and by the time my main came I was proper stuffed.

For my main I ordered the kebab with a side of french fries and it was just OK in my opinion. When I see large cuts of succulent meat on a kebab I get really excited because typically the bigger the  hunk of meat the juicier and more tender it is - right? Well in this case the portion sizes were there butttt the meat was terribly dry and overcooked - it made me sad. The seasoning was definitely great but for a guy who enjoys the juicy-ness of medium rare, this was not cooked to my liking.

I feel like the gaps that might make up the difference between 3 and 4 stars (maybe 5 stars) might be easily rectified upon another visit on a less crazy busy night. I look forward to giving Suliko another chance (and so I can get more dumpling action in my mouth). Until then...

Eatcrest Out!"}
{"text":"Found a heart warming gem. I am so happy to see georgian/russian type restaurants opening up, with generally very little representation from that side of the world in Toronto otherwise.

5/5 The place is very clean, easy to find, and decorated in a very true expression of what Georgian culture is all about. the servers and very friendly, attentive, and happy to help.

5/5 In terms of food, I had the following (no I am not a pig, but wanted to taste everything): Hachapuri \"Suliko\",Chicken Shish Kebab,\"Suliko\" Salad,\"Olivie\" Salad,Khinkali with beef,Khinkali with pork and beef,Chicken Shish Kebab. I also had a glass of semi sweet Georgian wine.

The selection of what I order was limited by my \"diet\" so I did'nt try the pork kebab and other hachapuri, but if I did, I am confident that I would not be disappointed.

The food was authentic, came quite fast, very fresh, and delicious. The wine I would recommend to everyone, very good.

5/5 on price. I can't believe that all of the above was $45, fed myself and my gf, with lots of leftovers brought as takeout as well.

5/5 on consistency, as a few of my trips yielded very similar findings, as did my friends'. 

So what can I say, I am sold on this place."}
{"text":"Fantastic food!
First time trying Russian food and I'm loving it!
Very friendly and beautiful waitress"}
{"text":"Really great restaurant. Fast and friendly service. Good for a group of people as well as family outing or a romantic dinner for two.
Food is really good and comes in a large portions but don't worry, they will pack the leftovers for you to enjoy later. Make sure to try Khinkali(Dumplings), Cheburek, Crepes Suliko or one of the types of Hachapuri. Dessert comes on beautifully displayed plate. Good selection of wine. Will definitely visit again."}
{"text":"Always great atmosphere and food is just great! Service could be improved but this is a new place so owners are probably learning still how to manage restaurant."}
{"text":"Came here for lunch on a work day. The inside is nice, kind of like a family style restaurant for sure. Tried the mixed grill shish kebab with pork, chicken, lamb and lula. I thought everything was a bit dry besides the chicken. I've definitely had better. They have the grill outside and smelled really good. Nice patio area to sit. Tried these traditional Georgian dumplings, which looked like giant Chinese soup dumplings which were interesting. Found the skin too thick and too little meat. Also tried the Hachapuri pastries which are Georgian puff pastry filled with cheese. It was delicious and very good but really filling, I couldn't have too much of it. 

Overall the food is good but the service was chaotic at first and the waitresses were confused and confused us. Seems like they were not very organized."}
{"text":"Suliko has been on my list for a while, finally got chance to visit yesterday! 
We went as a group of four after 3, the restaurant is not very busy. It was our first time having Russian food so we ordered based on other Yelpers recom. 
Suliko is basically a puff pastry filled with a load of melting cheese. When dipped into the tomato sauce, the combination of the flavour is amazing. I really like the texture of crispy and puffy pastry layer and the soft melting cheese inside. 
The crepe spring roll was good too, its a pancake dough roll with meat fillings. The complementary plum sauce gives the dish a sweet/ savour flavours. But the roll itself is a bit too much on the salty side to me.
The dumplings are average to me (maybe I'm so used to the Chinese dumplings that have flavoured fillings) it is a bit blend, but maybe that's why they offer four types of dipping sauce haha. 
Love their lamb pilaf, it reminds me of a xinjiang style lamb fried rice. Delicious, full of flavours and reasonably priced. It is a bit oily but I guess that is how it supposed to be. Will order again def! 
The beet salad is good too, especially we had a bunch of hearty heavy cheesy foods, not too sweet and very refreshing between bites of cheese and mouthful of meat.
Also ordered other dishes, some I didn't get to take pics before it was devoured lol the boat shape cheese pastry with an egg on top taste the same as suliko haha (cuz it's cheese too!) but the texture of the bun is different, Jenny prefer this one :) you can also dip the egg yolk!
Service is not bad, will recommend this restaurant for someone haven't had Russian food before. small downsides: the calories in this meal make me guilty haha and it is easy to eat too much cuz the food is so good :)"}
{"text":"Came to Suliko last night with a large group for a birthday party, and was thoroughly impressed.

When we arrived, we ordered some appetizers for the table and some drinks.  If you haven't yet tried Hachipuri, a famous Georgian cheese-filled bread with a cracked egg in the middle, then you basically haven't lived.  WOW! Totally delicious.  I will however advise that you don't eat the whole thing, as it could be quite filling.  Salads were equally delicious.

I ordered the Chicken kebab, with a side order of veggies and fries.  I like the fact that their cook took advantage of the nice weather and barbecued the meat right outside on the patio... Gave off the impression of being truly at home in my own backyard.

The meat was succulent, very juicy and plump.  Absolutely no complaints.  The veggies were hot, right off the grill.  The fries, however, were still kind of raw, and not crispy.  If I go back to Suliko, I will definitely ask my waiter to have my fries cooked longer (or just simply not order them at all).

Overall, very impressed by this restaurant.. like some other reviewers have stated, it truly IS a hidden gem- right off the beaten path.  They have a decent patio for hot summer days, and the decor is very warm and inviting.  Kudos!"}
{"text":"Simple, good food, but I won't be going out of my way to come back. I sampled many dishes and was impressed with a few but felt the others were flat and needed some zip. The meats included in the mixed grill were tender, juicy and flavourful. The Hachapuri Adiarsky Pastry was DELICIOUS.  I would avoid the crepes suliko (chewy and doughy) and the onion soup (too acidic, which tastes odd for beef based soup with cheese). 

Favourites: 
- Hachapuri Adjarsky Pastry 
- Eggplant Roll
- Mushrooms Suliko
- Chicken Kebab"}
{"text":"This is a great place to have a meal with friends.

This is a place where the food is good the service is great but it is not a fancy place.  The food is fresh and expertly prepared.  It is served immediately from the kitchen and tastes like \"your mom made it\", for those familiar with Russian and Georgian cuisine.  We didn't have any wine (or checked if they serve) but it will be a great addition if they had.

The salads are wonderful and so are the traditional Georgian dishes.  Next time I'm in Toronto I will visit again."}
{"text":"This is a Georgian restaurant (the country not the state!). They have an interesting decor, resembling a garden/vineyard by the Black Sea. The pre-meal bread came with four dipping sauce. I got the lamb chop pilaf and suliko (same as their name). The lamb chop pilaf was seasoned very well and the meat fell off the bones easily. The suliko reminded me of a deep fried spring roll and it came with plum sauce. The service waa medicore but the food made up for it!"}
{"text":"I came here with a bunch of Yelp people for a CMYE. And it was FABULOUS. The dumplings (beef and lamb varieties) are delicious. The crepes Sulinko are NOT TO BE MISSED. So savoury. So crispy. It's everywhere you want to be.

I ordered their special of the day as my main: lamb shank for $9.95!!!! I had a delicious, fall-off-the-bone lamb shank on a tasty broth with a side of fantastic grilled veggies. One of the other Yelpers ordered the liver, which was also fantastic.

Service was super friendly and they did an amazing job with our large table with split bills and a many MANY orders of food. 

I can't wait to return with my friends!"}
{"text":"Salty salty salty. My tongue was numb when i finished the dinner. Ordered the cheese bread, dumplings, mixed grilled meat and fried meat pie. All the meat tasted the same just blah n salty. The dumpling was a bit raw. Never again."}
{"text":"Came here in a large group. Nice decor and spacious. Tried a lot of different dishes and all were tasty. This is definitely a place to come and share food. The portions are large and you will really want to try a bit of everything rather than eat an entire cheese bread to yourself!

Breads, pickled vegetables and sauces - yum! Bread was served warm and the sauces were great.
Cobb salad - it was ok, a bit too saucy for me.
Potato pancakes - I really enjoyed these with the sour cream.
Hachapuri suliko - this was a puff pastry with cheese. Awesome option for cheese lovers! I don't eat much cheese though so one slice of this was plenty for me. Imagine a large circle if cheese coated with a very thin layer of puff pastry.
Hachapuri adjarsky - this was the boat shape bread with cheese and egg. This is really good too if you are a cheese lover. Tasted similar to the suliko cheese but with bread instead.
Lamb ribs pilaf - delicious! Lamb was so tender and rice was flavourful.
Beef dumpling - this was ok. I prefer chinese dumplings.
Crepe with lamb - looked like a giant jamaican patty. Tried a bite of it and it didn't stand out for me too much.
Rack of lamb - super tender and juicy
Walnut cake with mango ice cream and fresh fruits - presentation of this was lovely and were in such generous portions. It was yummy.

All in all had a very nice dinner here."}
{"text":"Yelped this place while in the area today on a Saturday afternoon. We wanted to try a new type of cuisine for lunch and decided on Suliko.

The smell of barbeque meat greeted us from the parking lot.   We noticed as we entered the restaurant, the decor was really cosy. 

Ordered the beef & pork dumplings (3pcs)  and the meat platter. To me, the food tasted like plain meat tossed on the grill with no marinade or seasoning. I had to rely on the 3 types of hot sauce which were provided to add flavour. 

$65 later...
I'll have to admit, I was a bit disappointed. The food smelled better than it tasted. Maybe they forgot to add salt???"}
{"text":"Great food. I keep coming back. Amazing patio. SLOOOW service during the day. One poor waitress doing the best she can."}
{"text":"It's nice to find a good restaurant open on Sunday night. The food was great, the service was lagging a few minutes behind when it got busy . great place for a causal date. This place is nicely styled too. I will be back"}
{"text":"I had lunch here. Ordered a eggplant roll and beef stew. They all taste very delicious. Since it is the first time I try the food here, I got good recommendation from waiter as I asked for light food. Complimentary bread and preserved veg are good as well. I would like to come again with friends, try the dumplings and others!"}
{"text":"Visited Toronto recently and had to stop at Suliko - my husband is from the Rep. of Georgia and was missing food from home.  When you order they bring bread (meh) and three sauces - red adjika (spicy), red satsibello, and green tkremali.  Classic sauces all done right.  The classic food is khinkali and khachipuri - dumplings and cheese bread.  Both were delicious.  Dumplings had the right amount of meat & juice.  Don't forget the wine when you go - Georgia has been making it longer than the Italians.  The restaurant has a good selection.
Come here for a traditional Georgian meal, delicious food and the friendliest wait staff I've ever encountered."}
{"text":"Well, we went to Suliko with 10 people and we ordered sharing food which cost only 100$ and we were full, the chicken and the ajaragan khachaburi is a must go and try you won't regret :)"}
{"text":"It's seriously fun. The food is great and the staff is friendly. We really enjoyed it."}
{"text":"Don't expect too much of this restaurant... the food is ok, I had pork shish kabob and it was dry. their dumplings are perfect...I will go there again only for this.
I had a Georgian dry wine also which is awesome."}
{"text":"Came here as my first visit to a Georgian restaurant in the GTA and had a very pleasurable time. We arrived to a welcoming ambience and a clean setting. 

The borscht soup was flavourful and refreshing, but I enjoyed the harcho soup even more -- the walnut and herb flavours were a delight! 

The Georgian dumplings looked like the Shanghainese dumplings that I'm used to -- instead of chopsticks, I used a knife and fork. I'm not sure if I ate it correctly...anyway, the beef/pork and lamb dumplings were yummy. 

The chicken Shish kebab was soo flavourful and not dry at all. The chanahi (lamb stew) was served with a lot of meat, though it was presented in a fairly small bowl. For $15.95, it seemed to be priced high for a seemingly small portion, but the meat provided is worthy enough. 

As if we weren't full enough, we ordered the walnut cake and Napoleon cake. Both weren't overly sweet, so the accompanying ice cream was a perfect complement.  I really liked the Napoleon for its delicate pastry flakes and its creamy center. 

Would definitely go back again!"}
{"text":"Finally had a chance to dine at this very busy establishment located just off of Steeles.  

First try at Georgian cuisine and I pleased today it was indeed worth the wait.  

Dinner for 2 : we both ordered the same lamb kabob with a side of rice and a pita bread.  All very fresh and subtle spices made it very tasty and savoury.  

The appetizer ordered was a cheese pastry that looked to have a mix of 2 types of cheeses2that blended very well together.  

It is best to place a reservation in order to guarantee a spot.  

I definitely plan to visit again. But the only thing I believe that needs improvement was the washroom; it did not suit the environment at the front and felt a little untidy.  That is why I don't give the full 5 stars."}
{"text":"Top notch Georgian. Borscht shashlik crepes dumplings specially delish. 

Lamb pilaf generous portion and yummy."}
{"text":"I got into this restaurant not knowing a thing and only based on the Yelp reviews that I said what the heck.
First I thought that this is a Greek restaurant as the name suliko is Greek but apparently the restaurant is Georgian and I guess they bought the restaurant as is so they didn't change the name.
I was there for lunch so I looked at the board with today's specials and for 10 dollars you can have soup salad and main which is a great deal in my opinion .
I went for the other item which was a lamb shank, the shank was great, falling off the bone and very tasty.
Service wasn't great but it's sort of the kind of service you expect from a Georgian restaurant .
All in all, I will go there again especially in the summer when patio is open."}
{"text":"Pretty solid place in the neighbourhood! I honestly would've never taken a second glance at this place, considering I pass it all the time and didn't even know it's a restaurant. 

The restaurant itself is a little small, but cozy. Definitely something that's very 'family-oriented'! Our group of beautiful yelpers took up half the restaurant, but it didn't seem over-crowded at all. The menu is pretty big, with a variety of hot appies, cold appies, desserts, entrees and omg, there was SO much.. was I dreaming? Of course, yelpers being yelpers, we all pretty much ended up over-ordering and dying with a fully tummy of carbs and meat at the end. 

The portions of the food though.. damn, they were on another level. My stomach literally felt like it had expanded in the course of one meal. The soup was delicious and tasty. For only $2.95, it pretty much filled me and create the sad realization in my mind that it was only the first dish of many to come... I got the chicken soup (don't remember the name) and it had chunks of SUPER tender chicken in it with rice.. so good! I'll go back JUST for the soup. Another thing.. those dumplings are no dumplings.. THEY'RE DAMN MONSTERS, if you ask me. The size of my fist for each soup dumpling? Am I dreaming here? *insert lame 'in soviet-russia, the dumplings eat you' joke* 

A lot of the other dishes were also good. The meat is tender and clearly well cooked. Some dishes probably had an extra helping of salt too.. CARBS AND MEAT. CARBS AND MEAT. CARBS AND MEAT. That's pretty much the only thing you need to know about this restaurant. There's probably those reading this out there that are now bursting to tell everyone that they're vegan, or oh-so-gluten 'sensitive' *rolls eyes*.. yeah, this place ain't for you.

However, if you're looking for a massive cheat day and you're in the area, go nuts! I'd say definitely give this place a try.. especially YorkU students that are hungry from being york'ed. Great place to get away for awhile! ;)"}
{"text":"If you want to try authentic Georgian food, this is the place to go. The staff is very polite and friendly. The food is great. We've been there numeral times and will return. Make sure you make a reservation though. The place is small and really busy in the evening. Good for casual night out for small groups."}
{"text":"I ordered the much recommended hachapuri and 2 orders of khinkali (dumplings). I gotta say the flavours of Georgian cuisine is quite unique. These dishes seemed to be made to order because it took quite some time to receive. It may have been more than half an hour.
My favorite would be the hachapuri. It makes me think of having pizza but the cheese is distinctly salty and they roll up the boat edges with cheese so the crust is a delight to eat. I wish there were 2 eggs. It definitely balanced the saltiness of the cheese (feta?). It seemed like there were 2 layers of cheese: the crusty top and a layer of soft chese below.
The khinkali reminds me of Chinese dumplings but the flavours are truly very different from what I'm used to. It was creamy and dark. Each serving contained 3 dumplings  which doesn't seem like a lot but it really is like its own meal. It definitely needed something to cut the heaviness.
While waiting for the food, we got complimentary appetizers: bread, pickled cabbage and an array of sauces (tomato, Georgian, spicy). The sauces and the pickled cabbage all have tastes I am not familiar with. I ate it all because the food was taking so long to come. The pickled cabbage I did not like so much.
All in all, the service was good, the food was filling and I was satisfied."}
{"text":"I wanted to love this place from the amazing reviews on Yelp (which led us here). And all of the food we ate was tasty, thats for sure, but the service and our final experience left much to be desired.

We weren't too sure what to order as we have never been to a Georgian restaurant before. The server was friendly enough but there was a bit of a language barrier, which is not a huge deal. To start off, we ordered the suliko salad, borscht soup, suliko hachapuri, and pork stuffed cheburek, thinking we would order mains in a little while after we got our apps. We also ordered a Georgian organic wine and a beer as well.

Fresh tiny bread rolls accompanied by a trio of tasty hot sauces, butter, and some pickled cauliflower came to the table quickly - all delicious! The borscht soup came next which was very hearty, warming and tasty. I liked that they served the sour cream on the side instead of already in the hot bowl. The pork cheburek was yummy, sort of like a giant empanada type pastry but with a thinner crust with ground meat inside - yum! The suliko hachapuri was stuffed to the brim with a mild melty cheese in a thin puff pastry like shell, totally delish!

Since we enjoyed our starters, we wanted to order a main but then the place got very busy very quickly. Full of people who seemed to be regulars, all conversing in what I can only assume was Georgian. Side note, I always think this is a positive when peeps from the particular region dine in a culturally specific restaurant as I deem them to be experts on their cuisine. Our waitress all but forgot about us and only came back to quickly check on us once, when we asked about our salad, which finally came as an afterthought at what turned out to be the end of our meal.

We were pretty full by that point anyway and just asked for the check as it didn't seem we would be able to order anything else due to the fact that the place was packed and there were only two servers. The BF loved their hot sauce and asked for a bit of extra to go with our leftovers.

When the bill arrived, we discovered were were charged an extra $4 for two tiny containers of hot sauce. Majah bummah. I would have just paid and never returned but for my bae, it was the principal of the matter and asked for them to remove the fee from the bill so we would leave the sauce. We waited an awkward 15 minutes for the server to come over to remove the charge. The BF also realized they charged slightly more than advertised on the menu for his beer as well. The end experience really ruined the evening and made me a pretty sad. 

So all in all, the food is delicious, hence two stars. The service is a bit forgetful and beware of cray extra charges that are just not cool. I would not return here."}
{"text":"Feast to your heart's content at Suliko at prices that delight your wallet. Quality and authentic Eastern European cuisine affirmed by the mostly Eastern European clientele here. 

The hearty borscht soup warms you right up on a cold wintry day and the lamb shank is absolutely superb. The succulent meat falls right off the bone and is in a rich bone broth that you won't want to waste. If you're lucky to find it as the special for the day, the dish is only $9.95. Finally, try the Mix Grill Shish Kebab for your best value! Grilled to perfection and might generous portions.

If you're ever in the area, drop by. If you're visiting with a large group, be sure to make reservations beforehand!"}
{"text":"Last weekend, we figured we would try something \"outside of the box\". Therefore, we ended up going to this Russian/Georgian/???-Cuisine restaurant just on the edge of Vaughan and Toronto.

We tried a wide array of dishes, mostly due to the fact that we had no idea what we were doing. We had the borscht, an assortment of different kebobs, the lamb shank, the (enormous) lamb and beef/pork dumplings, the hachaburi (pretty much a gigantic cheese pizza with a sunny-side-up egg in the middle of it), and the ground beef crepe. Without droning on and on about all the minute details of each dish, I'll just go ahead and say that it was all pretty damn good.

For me, the clear highlight of my meal was the kebobs. The dish came with an assortment of chicken, lamb, and beef kebobs, all of which were hot, tender, and juicy. If I had to pick my favourite out of the three, I would have to go with the lamb.

I also have to mention the ground beef crepe, which was perfectly crispy on the outside, and warm and soft on the inside. It's absolutely not to be missed.

Final thing I want to mention was the warmth of the wait staff at Suliko. Being a party of entirely Asian diners, our waiter correctly guessed that we had little experience with this kind of cuisine and made excellent recommendations for us. He was very patient when we were indecisive of what to order and did a fantastic job of making us feel at home.

Also, did I mention that we all ate to our heart's content for just over 20 dollars per person? This place is awesome."}
{"text":"Tankfully for the big SULIKO Sign off of Steeles this place was an easy-find.
Known for its traditional Georgian (with some Russian hints in between) Suliko is nestled in a cozy environment with both indoor and outdoor seating.
Great family restaurant and the servers are attentive to detail.
Daily specials, and don't miss out on their BBQ.

For starters we had their Khinkali - pork and beef dumplings 

Hachapuri Adjarsky - a traditional Georgian boat-shaped bread with melted cheese topped off with a half-cooked egg...mmm if you love cheese, you'll like this place.

Chanahi - we both shared their traditional Georgian lamb stew.  Though this may seem small, this dish is a lot.  Delicious broth with hearty flavors, this was certainly comfort food."}
{"text":"Unbelievable food. Amazing! Everything was just perfect. The vegetable soup was super. Hachapuri Adjarsky and Hachapuri Mengrelsky were delicious. Trout was cooked to perfection. The khinkali with cottage cheese were superb. Portions were huge. Everything was very fresh. Amazing customer service. Very friendly and polite.  Relaxed atmosphere. Highly recommend this place."}
{"text":"Tasty and fresh food. Service is excellent. I would recommend to go if you never tried Georgian food before. 
It's wonderful to sit on the patio and have the chef grill the food right before your eyes. 
The portions are quite large, so I would recommend sharing one cheburek/hachapuri between two people. Same goes with salads. 
The mussels were ok. It's not something I would order again. 
The sauces are to die for!! Just like my granma's."}
{"text":"I had this place bookmarked for months and the anticipation was just overbearing! Somehow I always forget or choose not to stop by even while I am in the area. Sadly, maybe it should of stayed this way, perhaps it was for the best.

On this fine evening members of the Yelp community and I invaded this place. Like a gang of food thugs we dove right in mercilessly. The atmosphere was tense and the crowd was subdued? I dunno.

I am going to give this place 3 stars because the food is really hit and miss. The portions are ridiculous to say the least! There's just way too much food for your money, even the very thought of the sheer size of those dishes make me cringe still.

While everything was certainly flavourful, I do find some dishes (like the stews and their baked pie/bread thing--both were quite enjoyable) to be a little on the salty side. Coming from an Asian that's quite a statement! They are also heavy with their dill and parsley as it was probably the only thing green in the dishes! LOL Jokes aside, it was a meat and carb fest to say the least. The delicious dumplings were so big they dwarf mother Russia but the one caveat was the semi raw dough on the top where the dumplings are pinched. The rice pilaf was way too dry and overcooked. Soups were pretty decent but nothing to rave about; though I did enjoy the borscht. Perhaps the one and only outstanding item was the Crepes \"Suliko\"; with that delicious ground beef in that pillowy, eggy wrapper.

There is one common theme here that you need to know. This place is not for the weak for faint at heart, not for the ones on diet or are health conscious. It's no vegetarian's haven and young kids should be forbidden. This is meat, dough and lots of it!"}
{"text":"Suliko is one of my favourite restaurants in Toronto for both take-out and dine-in. Their pilaf is amazing, their atmosphere is very cozy and romantic. We like coming there on our dates, and we like coming there as a family too."}
{"text":"I came here with three other friends on a Wednesday evening and we automatically got a table once we came in. Overall, the restaurant is very clean and it's a wide open space as well, which I think would be good for large groups. 

My friends and I ordered the following:
- Two orders of dumplings - one pork/beef and one lamb. Out of the two, I liked the lamb a bit more. The lamb dumplings had a bit of a smokier taste compared to the pork/beef dumplings, but for the most past they tasted fairly similar. 
- chanahi, which is the lamb stew. It is so flavorful and it goes great with the lamb rice pilaf! I highly recommend getting these two dishes together
- lamb Pilaf, which comes in a large plate that can be split amongst four people. Incredibly delicious! Probably my favorite dish
- ajapsandali, which is the vegetarian stew. This tastes a lot like comfort food - something you'd eat if you're feeling down. I really love the eggplant pieces in this dish, they soak up the flavor of this stew!
-hachapuri suliko, which is the puff pastry with cheese filling. This is very large and can easily be shared. The cheese tastes SO good and it's flakey and delicious with the vegetarian stew. 

Our server was attentive and hilarious! The bill came out to be around $19 per person, excluding tips. For my first experience with Georgian food, I thought it was great! I would love to come back and try more of their dishes"}
{"text":"[Location] 3/5
It is not closed to any TTC, driving is a must.

[Environment] 5/5
The moment when we enter the restuant, it gives us a very high-class, 5-star feeling of decoration!

[Quality] 5/5
Dumpling is a must! We have never tasted such huge dumpling with cottage cheese (there are totally 6 different fillings. definitely will try them all in the future)

[Service] 4/5
Waiter is nice to bring us boxes for unfinished food. It doesn't take long for the food to come.

[Overall]
2 person can dine with $40 and a lot of food for the next meal. Food tastes awesome. Highly recommended!"}
{"text":"Have been there a few times. One of my favourites now. So the service is good and the atmosphere is cosy. Food is delicious especially their pastery. The hachapury with an egg was great. They also have wine for fairly good price.  We have good food, nice service and not expencive prices."}
{"text":"Yelp made this place seemed like the GTA's best kept Russian secret. So we were eager to check it out. It is tucked away in an industrial plaza so was a bit tricky to find & we were literally the only people of color in the place.. so we had high hopes as we walked in. The servers were polite, we got a nice table on their patio but food didn't come cheap: I had the chanahi, a Georgian style lamb stew which had an overpowering lamb taste, so don't order it if you're not in love with that gamey flavor. My 10 yo had the salmon which she enjoyed but I thought it was a bit dry. My 8 yo had the honey mustard rack of lamb which was perfectly cooked and delicious. Their saving grace was the fact that we got a big bunch of complimentary sauces which were all really delicious, picked beets and cabbage which we all enjoyed, as well as bread, fresh and warm from the oven. We probably won't be back here but the visit did encourage us to continue our quest to expand our palates, our minds (& our waist lines) to seek out and enjoy more Eastern European food."}
{"text":"Food quality 3 stars.  Value +1 star

This is not the first time I award a star based solely on value and portion.  I ate here with a big group.  Other than the stews, the portion of all the entrées were practically 2 to 3 meals in one.  To give you a reference, the portion here is comparable to or bigger than Zet's in Mississauga.  My suggestion is to gauge carefully how much you order.  You might consider dining family style and sharing everything.

In terms of food quality, I liked what I ate.  I had a Borsch soup ($2.95) and a Hachapuri Adjarsky ($10.55).  Being the first time eating Russian food, I cannot speak to authenticity.  However, I love beets.  I even make pickled beets myself.  Naturally, I enjoyed the Borsch soup that was loaded with beets.  Call it what you might, the hachapuri is a bread with cheese.  As far as baked bread with cheese goes, mine was superbly made.  The dough was soft and warm and filling.  The cheese covered the whole bread.  There was cheese inside the outer rim.  Because there was so much cheese, and the type of the cheese used, the hachqpuri could be too salty for some.  I love salty food, so it was a non-issue.  I noted that the egg in the middle was fully cooked instead of half cooked, as described in the menu.  I suppose this is what happens when one cracks an egg onto a hachapuri right after it is out of an oven.

I enjoyed some crepe rolls with beef and dumplings as appetizers as well.  I liked both of them.  The crepe was really delicious.  Very soft and sweet.  The sweetness contrasted well with the flavourful ground beef.  The dumplings were so large that 3 pieces could be considered a dinner for someone of a small appetite.  The dumplings were very juicy.  Be careful of hot juice flying out when you bite into one.

The services was excellent.  The waitress was friendly, effective and organized.  They split bills in group of four diners."}
{"text":"Oh yeah, if you are guys up for Georgian food make sure you visit this place soon, sometimes its fully packed and I recommend you to do reservation. Food in general is great and freshly made. Also try homemade juice called kompot, its really nice. Good luck"}
{"text":"I will have some photos of the delicious food to post later, but did not want to withhold a review as this is a wonderful little restaurant and deserving of a lot of business.

As other reviewers mention, it is a family style operation.  The owner is very nice and accommodating as are all of the servers.  Everything we ordered was wonderful, though I'd particularly recommend the dumplings, hachapuri, and the wonderful bean salad appetizer.  Georgian food combines Russian and Turkish influence, as one might expect, but also has a lot of unique flavours and items all its own.  Like Greek food or tapas, one can make a meal out of the appetizer items.

Nice warm bread with adjiko and satsebeli was an added plus."}
{"text":"We were searching for a family restaurant in the neighbourhood, when we were returning from York University to North York, where we stay during our trip to Toronto.

Thanks to the community of readers of Yelp, we found this restaurant, termed as Russian restaurant, in fact the cuisine is really that of Georgia.

  Being a foreigner, I can't really tell the difference between the style of their Borsche from the Ukraine style.
Anyway, my husband and I had a very satisfying dinner, with a big serving of Borsche and a yummy appetizer - mushrooms with cheese.

We were already full and could not finish the entree - lamb ribs and rice pilaf, which was delicious and big in portion.  We ended up packing it and took it home.  After reheating it at home, it still tasted great!

We have got value for the money!  The restaurant is spacious and seems friendly for the whole family.  I would highly recommend it, if you are searching for a good Ukraine style restaurant in the area."}
{"text":"I took my father there on Saturday and we both loved the food. He had Russian Borsht and Chicken Shish Kebab and I had Harcho soup and Chahohbili. We absolutely loved the quality of food and the service. Will come back there next week!"}
{"text":"My order was to go - Hachapuri Suliko and lamb shish kebab with grilled vegetables side. Hachapuri was great, fresh and crispy. Shish kebab on the other hand was a huge disappointment, it was REALLY dry. I had to drench it in sauce in hope to save my dinner. While looking for sauce in my fridge I realized that it was a big over-look on their part not to include one. Georgian kitchen has a great tasting sauce for meat. I am a big fan of lamb meat and I can honestly say my lamb shish kebab or steak is always juicy, and I do not posses professional kitchen equipment like a restaurant. 

The restaurant looked pretty good, specious and clean. They also have a good size patio."}
{"text":"Stopped by this place on advice of a friend while visiting Toronto. We didn't even get to the main courses, and had kharcho soup, hachapuri (Georgian cheese pie) and a variety of khinkali dumplings (similar to dim sum but much bigger). Khinkali especially, as well as other food, were to die for. Will definitely be back when next time in Toronto. The wait stuff was great as well."}
{"text":"Food is awesome! As I'm pretty aware how real Georgian quinine should taste like, Suliko is good place to go! Always fresh, service is good! Try their Georgian wine!!"}
{"text":"Top Georgian restaurant in town as far as I'm concerned - owner & chef are the same, a dynamo of a woman! The menu is nicely varied, some unique dishes, from very healthy to very grandma. Meats, including lamb, pork, beef & chicken are top quality, done delicious on traditional flame, very flavourful! Often busy but still calmingly pleasant. Perfect place for a small to medium party, a brunch or a reunion."}
{"text":"What a delight! The decor is beautiful, starting right when you walk up to the place and see the beautiful doors. We ordered their homemade juice (kompot), potato pancakes, the cheese and egg bread boat, and the beef dumplings. Everything was so delicious, but you HAVE to try the cheese and egg bread boat. Mix it up to cook the partially cooked egg in the melted cheese, and dig into that soft bread... Like the best pizza/cheese omelette/quiche/fondue ever. You also receive complimentary bread with 4 dipping sauces and pickled cabbage, which is a nice surprise. The server was so sweet, as well. Highly recommend!"}
{"text":"I came here based on the great reviews on Yelp. I have never had Georgian food before. I was mostly interested in trying the hachapuri (georgian pizza shaped like a boat with an egg on top). It is the coolest thing I have ever seen on yelp. 

So we got here on an afternoon to have some lunch. The restaurant just opened but there was already a party inside! The servers are really nice and really cute :o. Lol. Anyway, we wanted to get a hachapuri and some khinkali (georgian dumplings). There were no pictures on the menu, but even the photos on yelp were hard to distinguish the sizing and portion of food. Let me say upon arrival of our food I was shocked by how generous the portions were! The Khinkali dumplings each of them were like the size of a small person's fist. And the hachapuri was the size of a small pizza. Very filling indeed, even when sharing with a friend. We both loved the food. The khinkali pork and beef had some interesting spices...tasted very beefy and rich. I needed to cleanse the palate with some of their tangy dipping sauces from time to time. Their sauces are really tasty btw. They come as a complimentary appetizer with some hot buns on the side.

The food was so memorable! I would love to come back to try some other Georgian dishes. I think though, the place could use some natural lighting, it is very dim inside."}
{"text":"A wonderful ethnic restaurant with an emphasis on traditional Georgian cuisine. We had a small tasting menu which consisted of a beef and herb soup, lamb dumplings, liver and onions, and a signature Georgian baked cheese bread called khachipuri. The best Eastern European meal I've ever had outside someone's home. Everything was fresh, flavourful and truly felt homemade. Definitely an undercover treasure."}
{"text":"This place is awesome! I love Georgian food and this is definitely the place to try it. I have yet to sit down and have a meal there, but whenever I take food out, I am always satisfied. 

We always order hachipuri, which is basically a cheese-filled doughy piece of heaven. We get the suliko kind usually, but they have different kinds. It's a bit oily, but delicious. We also got hinkalis today, which are special Georgian dumplings made of various types of meat depending on your taste. They add their amazing spices! Some of my family members don't like cilantro, so they actually make some without it as per our request. However, I highly recommend getting them in their original form. 

This place also makes really good chebureks and salads. They have someone in the patio making meat skewers out on the grill just like they do in Georgia. So basically when you drive up, you already get an amazing aroma! 

This is an awesome place! I really want to finally sit down and have a meal there sometime soon! They apparently also serve authentic Georgian wines."}
{"text":"Love the ambiance ! Nice European atmosphere.  Good food...Kavkaz salad was delicious (pretty much a Greek Salad with spicy beef jerky).  I wouldn't say it was spicy so don't be afraid!

The Lamb Stew (Georgian style) was very tasty but I would suggest for them to render the fat first off the lamb before they put it in the crock pot.  There was a bit of fat on each piece and some a bit too much fat.  Overall though it was a good dish.

The Chicken shish kabobs were tasty...They are thighs and I prefer white meat.  But, still, tasted good.  The roasted potatoes with it were really nicely seasoned.  

DESSERT TIME:  We ordered coffee/tea and the \"HOME MADE\" apple strudel with ice cream which we were given vanilla as one of the options.  Well, the waiter came back to tell us they are out of vanilla ice cream so we ordered mango.  NOW, correct me if I am wrong but shouldn't a HOME MADE apple strudel be served warm when you serve it with ice cream?!?!? I THINK YES!!! FOR SURE!  Well, in this place, they serve the strudel cold.  WHAT?!?! YES...
When I asked the waiter why its not heated, he said they made it last night in a big tray.  That was my answer.  That was that. lol"}
{"text":"A hidden gem in the neighbourhood. I've driven by the discreet exterior so many times without noticing the restaurant. We went for dinner and had the Hachapuri Adjarsky. To me it was the divine version of a pizza!! The crust was baked to perfection and the cheese, which we found out was a Georgian feta cheese was a stand out. We also shared the lamb pilaf and the crepes which I would also recommend. Will definitely be back to try their desserts!!"}
{"text":"After reading so many reviews about SULIKO I decided to have a try. It didn't disappoint me. All the foods we ordered were amazing! It is my first time to try Georgian foods, so I can not tell you whether it is authentic, but I can tell you I do really love it."}
{"text":"I drive along Steeles Avenue regularly, commuting from work back home. Some folks would think that I am crazy, as I work in Mississauga and live in Markham. However, do you know how bad highway 401 is during rush hour on a good day? It's horrible! I used to take the 407 to and from work. These days, I enjoy the benefits of backroading. I get to figure out what businesses are on my route.

For a while, I have noticed the huge Suliko sign as I drive past it daily. I first thought that it was some sort of wine cellar place (the sign has grapes). I also thought that it was a Japanese restaurant. I was wrong on both counts.

For months, my Yelp friend, Colanie, and I have been meaning to get together. We both seemed like friendly people who weren't creepy, so why not?! She recently moved to this neighbourhood and suggested Suliko. I looked at each photo on Yelp and I got incredibly hungry looking at amazing Georgian food. My salivating at home was not a pretty sight!

We met a couple of Mondays ago for dinner. Parking was pretty good at 6:30 pm. I parked and walked in. Colanie was wonderful to have made a reservation. We had a booth. I sat. About five minutes later, she had arrived.

The menu had so much that we wanted. We ordered the following:
- Bread rolls, with plum, spicy, sweet, and buttery options, and pickled cabbage
- Small bowl of borscht (me)
- Chahohbili, which is chicken stew, with tomatoes, garlic, and a bunch of herbs
- Hachpuri adjaraky (boat-shaped bread, with cheese and a half-cooked egg)
- Honey cake with cherry ice cream and fresh fruit
- Khinkali (dumplings) with beef and pork

The starter bread rolls were warm, fresh, and soft. We had wonderful sauces and butter to spread on them. They were all so good and so different. We both weren't into pickled cabbage, but it was okay.

I ordered a small bowl of borscht. It is huge for a small size. It was so good. The beets and carrots were julienne-cut. It was incredibly flavourful and comforting. Colanie passed, as beets weren't her jam. Next to corn and green beans, I love beets. Beets are particularly yummy in soups.

I got to try some of Colanie's chicken stew. It tasted homemade, and was both fragrant and delicious. The chicken was tender. You barely needed to chew.

We had a wonderful server who explained everything to us. We had to get the hachpuri adjaraky, which is one of the restaurant's signature dishes. It is essentially boat-shaped bread, with cheese and a half-cooked egg on top. Our server explained that we needed to break the yolk and stir everything up. My friend did the honours and we tore this dish up. It was delightful. It wasn't heavy. The cheese provided the salt. The egg with the bread made everything taste heavenly. I highly recommend ordering it.

All portions here are generous. I am so glad that we split everything. Otherwise, we would have had difficulty waddling out of the restaurant.

For dessert, we relied once again on our server to provide suggestions. She recommended the honey cake. We got cherry ice cream . It also came with fresh fruit. Wow, you must get this dessert! Tell your stomach that it must make room to fit this cake in. It was tasty and soft. The layers looked amazing. The fresh fruit complemented the cake well. The cherry ice cream was not homemade, but you got chunks of cherries in it. Delicious!

Colanie got a hot chocolate before she had to leave. It smelled good. She liked it.

I got the khinkali (dumplings) to go. I ordered the ones with beef and pork. They smelled so good as I drove home with them in my car. I couldn't resist and I ate one of them when I got home. It was still warm. It was scrumptious and huge. It does have black pepper. If you don't enjoy it, you may want to pass on the khinkali. I ate the other two khinkali for lunch the following day.

If you love dumplings like I do, get the khinkali and indulge.

The restaurant serves amazing food. We had a wonderful time chatting and eating. Delightful foodie company always makes yummy food even more enjoyable.

I am definitely coming back. Portions are huge, so bring your empty stomach here.

(183)"}
{"text":"Was really hard for me to decide on 3 or 4 stars, the Review is very simple.

Service and the place are solid. 
Nice patio in the summer.

Food:
Everything that is baked is VERY GOOD!
Their soups and Plov (rice with meat) are solid.
Meat and Fish dishes are REALLY bad, sometimes they come out cold, sometimes overcooked or under cooked. 

I RECOMMEND THIS PLACE BUT ORDER ONLY BAKED GOODS (HACHAPURI, MANTY and so on)."}
{"text":"Delicious food, good price, slow service , the place is very busy on the weekend- not enough servers...we will be back!"}
{"text":"This is one of the best if not THE BEST Georgian restaurant in the GTA. I always appreciate an opportunity to drop by and have some of their delicious food. Whether you're a carnivore or a vegetarian, you'll find something that will appeal to you. Their menu contains typical Georgian dishes that you otherwise would not find anywhere else. Georgian food has its own unique flavour and flare to it. You've got to try it to understand what I mean. More specifically, you've got to try their Suliko Hachapuri. It's f**** amazing!"}
{"text":"Ate here during my visit to Toronto. This place was recommended to me by a local friend and I was blown away!!! Good food, great prices, and very friendly service! Can't wait to come back to Toronto and dine here again!!"}
{"text":"Suliko Restaurant serves authentic Georgian food. For some one that never have this cuisine, it definitely worth a try. 

Carbs+Meat+Huge Portion

Khinakli, Georgian Dumplings definitely instagram worthy for its size. Suck out the meat juice during your first bite. Khinakli is supposed to be eaten with bare hands and the top, where the pleats meet, is tough, and is not supposed to be eaten. I found that it was super filling but lacking much seasoning. 

Crepes \"Suliko\" was well seasoned and a little roll of deep fried happiness

Special of the Day: Lamb Shank ($9.90) was tender but in a soupy tomato broth. Not much flavour and seasoning is missing in action.

I tried a few other items which were all OK aside from the Kebab which I found it overcook and dry.

Khachapuri Ajarski ($10.55) was comforting when eaten fresh from the oven with load of cheese on bread but best for sharing.

Georgian Food is simple and rustic and Suliko delivers. So if you want to experience Georgian Food, you won't be disappointed."}
{"text":"Awesome !!! This place is really great, warm and welcoming.  Staff is super helpful. Food is super tasty.  You could have a very nice dinner/lunch with your family or a celebration.   I love this place."}
{"text":"was recommended here.  Tried several of their dishes including lamb shoulder, giant dumpling, lamb pilaf, a version of sausage roll.  

The dumplings were interesting.  It was wrapped in very thick wrapper, i am use to the chinese style dumplings so it is a big change.  comparing it to the asian style dumplings i would say the taste is more bland.  The wrapper is just too thick for my liking.    lamb shoulder was tender and broth that it was served in was hearty.  

the sausage roll thing was probably the best dish i tried there.  Nothing too special it is what you expect.    overall 3/5.  Service was decent.  They let us loiter after the meal for a long period of time without disturbance."}
{"text":"This is a very busy restaurant. The first two times we went in a summer evening, they had no tables available. We were able to get a table last two times on monday evening and saturday afternoon at 2-3pm. I was suprised to see the restaurant was  full at 3pm on a saturday afternoon, but that's a good sign!!

I really enjoyed their Cornish hen and dumplings. The cornish hen was deep fried but very tender and  you can't find  in other restaurants and  it was a decent portion. The dumplings were quite big and they tasted very similar to chinese soup dumplings except without the soup.

My husband had the Hachapuri Adjarsky (freshly made pizza with an egg in the middle) he enjoyed it as it was unique but it was too big unless you share. 

I also tried their lamb shank (saturday special),  veggie stew, lamb stew.  They were good and all tasted decent, but since you could get those dishes somewhere else, I am not crazy about them. 

Compare to the other 2 Georgian restaurants in the area, this is definitely a winner.  (the other 2 are very empty) I think this is probably the best restaurant in that neighborhood too.  I wish they can expand by using the space from its neighbor and have more tables."}
{"text":"Ok fuck it, might as well let y'all know this is the best European restaurant in the area. Everything is made traditionally and with loving Russian hands. Go here for any occasion, go here with anyone. Go here."}
{"text":"1st time here and it was really flavourful and fresh and very reasonable price and huge portions will come back again only thing is service a bit slow cuz it's very chilled European environment you can't be in a rush so take your time and enjoy it not big deal TBH"}
