{"text":"I've read many great reviews so decided to try these samosa's. I'm east Indian and these samosa's are far from the real deal! Don't recommend it whatsoever and they overpriced! Samosa's from Indian sweet shops are usually are  2 for $1 and they authentic. I'm really embarassed that this place claims to say these are samosa's when there not! The main ingredients (spices) are missing. Not the taste of a real samosa!"}
{"text":"This place was great........12 years ago ! Now, I stay far away from this crap hole. Oily, no taste, hole-in-the-ground barn with a new staff. Last time I ate something from there, I ordered out from another restaurant right after trying to consume the Sultan's schmuzz. Last place I'd ever try again if all other eateries suddenly vanished. Too bad we can't give this place No Stars."}
{"text":"My favourite samosas in Scarborough. It's just a small privately owned shop, no place to sit down and eat just fast takeout service.   Samosas have a nice crispy exterior, still chewy on the inside and filling right to the edges. Maybe it's a different style of samosa than traditional scarborough restaurants offer but it is definitely a welcome change. For these type of samosas I would normally have to go west, so it's nice to have this down the street.   This is a great spot for a quick bite or on a busy day, you definitely get you're money's worth here without the wait."}
{"text":"We dropped in to pick up a mixed selection for a wee family gathering. Clean, friendly great price and quite the line up. When we left we couldn't resist and try a free flavours. Terrific, amazing and easy the best in the city (yes, I've tired them all over )   We will be back for sure. Bravo!"}
{"text":"I love sultan of samosas because their samosas are always fresh and have great flavour. Their is usually a line but at the same time it is so worth it. I get a lot and I am part of a family of four and it takes us only like 3 days to finish them off. I would always recommend the veggie samosas but the meat are also delicious. Get the dipping sauce because it Is amazing. I would really recommend sultan of samosas always and you should check it out."}
{"text":"The best samosas ever!  They also make pakoras....quite spicey and heavy.  I like my pakoras  light and crispy so not too crazy about their pakoras but it's their samosas that they are known for.  I've been eating their samosas forever....when they were located on Bermundsey Ave (industrial/business area....Peak Freans(Kraft now), Tropical Treets, etc), and No Frills (Vic Pk/Eglinton) was selling their samosas.  Then they moved to their current location on O'Connor.  Great for potlucks/parties as others have mentioned.  I picked up two dozen for my daughter's Christmas Concert.  One thing I'd like to mention is that on the City of Toronto's 'Dine Safe' website, they did get in trouble for not keeping/holding  the samosas at the proper temperature(not kept hot enough) to aviod the 'danger zone'....temp. zone where bacteria can flourish.   I think they've been ok since then.....I still go as I find the samosas completely addictive!"}
{"text":"I adore South Asian food, and I've eaten many samosas.  These are, by far, the best.  My favourite is the chicken, but I have honestly never had a variety that wasn't yummy.  I tend to grab a few dozen to take to parties and they always go over very well indeed."}
{"text":"I've never tasted samosas this good. Seriously.  The sign outside boasts that they have sold like a trillion samosas. I wouldn't be surprised.  Instead of using really thick doughy shells, they've opted to use phyllo-like pastry which has got to be what keeps people coming back for more. (Actually, I just read on their website, that it IS what makes their samosas special...they have patented samosa pastry!) You can imagine that it would make the samosas less heavier and a lot lighter and it does!  It's so close by that sometimes I'll just pop in for a mixed bag of 6.  There are 10 flavours including: tandoori chicken, beef, seasoned chicken, lentils, curried vegetables, steak and potato, mutton, and spinach and feta. My favourite is definitely the tandoori chicken. And they've got 3 really tasty dipping sauces (fresh coriander with vinegar and yogurt, tangy tamarind & date, and spicy mango). Most of the time, they'll just give you a random sauce, but if you have a certain request, they always give it to you.  Just some more examples of how SOS has infiltrated my life... I recently introduced a friend to the SOS and it has been a pre-snack trip ever since. Another friend of mine had these served at her wedding. And my sister recently requested a batch from NYC. I brought them with me carry on.   The SOS is under \"caterers\" and I've seen trayfuls of their stuff leaving the store which I'm sure are where most of their trillions of numbers sold come from...but don't be deceived into thinking you can't pop in and pick some up. Whether it's 6 or 12 or plus plus (of 1 flavour or a mixed bunch), you're not going to regret it!   It's kind of in a random location, but if you have a car or just happen to be in the area, please be sure to make some room for these delicious mouth-watering nuggets. Or definitely think about picking them up if you're planning an event that requires apps. The ladies with their hair nets look mostly unimpressed but they're really sweethearts who throw in the extra one most of the time. I heart SOS and I'm sure you will too!"}
{"text":"Finally had a chance to try this place!  Not too fond of the Filo shell..  I tried 6 different Samosas for 4.99  Tandori Chicken - overfried, not too tasty Mixed Veg - Good Curried Veg - Good Curried Beef - Good Spinach Pakora - Hard as a rock  The fillings are quite tasty, but the samosas are small.. they are 2 bite morsels.  The sauces are pretty good too.. but I probably won't be back."}
{"text":"Oh ya, that's what I'm talking about!  Are these authentic? I'm not sure, I don't care, I just go by the taste.  Steak and Potato Tandoori Chicken Lentil Veggie Beef  Dang, now I'm craving them as I write this.... I'm going to get some...."}
{"text":"this place needs a second location in downtown toronto!  best samosas I've ever had."}
{"text":"very pricy for 1 samosa. I ordered a few samosas and they were very pricy just for a few. The oil was leaking out of the bag and the samosas were fairly small. But i did visit some places down at Lansdowne and their samosas were huge and for the same price. All in all i did like the taste but if you were starving out of hunger and needed something greasy to eat this is the great place for you. But if not your choice i would just go to the Tim Hortons infront of it :/."}
{"text":"Let me preface by saying that I'd have some pics posted if I hadn't massacred two bags worth of samosas as quickly as I had.  So yes, you guessed it, They were absolutely stunning. Each one more flavorful than the last... the veggies were visible unlike other places where the inside looks like mostly potato.  My lord they were crisp on the outside and succulent and juicy inside.   The ones that appear my dreams are:  Chicken and paprika Any of the beef ones Steak (this one is a real luxury) Veggies (all of em)  Go live here now. You won't be sad."}
{"text":"I have to admit I don't eat samosas often, but this is definitely the only place I buy from when I do crave for it!  I always get the traditional beef with mango dipping sauce.  Yes the samosas here is more on the pricey side, but hey you get what you pay for.  This is a small joint, no seating.  Just grab and go.  You can also purchase them frozen too.  The ladies who work here are extremely nice!  They give me a free samosa every so often so I can try something different, besides my traditional beef."}
{"text":"OMFG. PLEASE. I. WANT. SOME. OF. THESE. RIGHT. NAO!  I cannot stress how good their samosas are. Traditional beef? Daal? Girl. I want them all. They're pretty pricey though, unlike Samosa King, but comparing Sultan to Samosa King is like trying to compare a Tyra Banks to your girl Shaquanda, the ashy girl that lives in the hood with her cheap ass synthetic weave.  It is worth the money, 5 for 6, it's really good especially with the tamarind dip? YES PLEASE. I can't wait to grab some more! I love you Sultan of Samosas. I can't wait to go back."}
{"text":"I have love for Sultan of Samosas, possibly because I once lived around there....  Would go on a lazy weekend afternoon, and grab a big box of samosas with all that chutney!!!  Being of Brown man decent, I will say these are possibly the best samosas in Toronto!!!    Only thing bad??  Oily, oily, oily!!!!!   Be prepared for a nice nap after your treat.  You were warned!  Enjoy..."}
{"text":"The samosas are really good but I'm not sure that they're as good as the hype. I can't name another place that sells anything as good but I know I've had better in the past. The variety is one thing that really stands out though. It would be nice if there were more locations since it's a bit out of the way."}
{"text":"All I can say about is the BEST samosas hands down in town!!! It's a quick place to go and get meat samosa. I get the traditional beef with the mango chutney and yogurt chutney sooooo good!! CAN NEVER GO WRONG!"}
{"text":"I don't recommend this place. Let me tell the whole story .This afternoon I have ordered food from this place and it was for take out and my order includes chicken biryani and one samosa (I gave a try on this samosa as I had a plan for a snack party at work and I had plans to order 5dozen samosas on Monday from this place ). The lady who was dealing with me told about their promotion and she sold me a pop and another samosa . She gave 3rd samosa as complimentary. I came home and was so excited to eat biryani and  I opened the pack and found two big unpeeled potatoes sitting in biryani and brown greasy oil food parcel which was leaking from the samosa pack (looks like oil was not fresh )  So For health reasons I don't recommend this place to anyone . Thank god ! I tried this place before ordering food for my office party .   (Check my photos)"}
{"text":"Very yummy but not a place you can go and eat an entire meal. Very good for take out and the samosas are made fresh and right there so expect a hit of a wait but its for a good reason."}
{"text":"Place is over rated beyond imagination. The samosas are small and super expensive for the price. For the price of 12 samosas, I could have bought 60 or at least 36 elsewhere with a lot more flavor.  Bought 30 samosas....all vegetarian. While packing 1 fell off and they had the cheek to add a meat samosa in a pack that was right at the bottom. No more samosas from this place for sure."}
{"text":"Perhaps not our day but the samosas felt stale, as if they were heated for the 2nd time."}
{"text":"The Sultan of Samosas is the Emperor of the whole samosa enchilada, the entire universe of the Indian empañada. He is the undisputed King of crisp crunchy curried veg, the shogun of chopped chicken tandoori, the grand poobah of potato-and-spice pastry-wrapped pleasure, the Shah of spinach and cheese, the lord of lightly spiced lentils. The Sultan dispatches doughy potatoey pretenders to the steppes of Scarberia. There are 10 kinds of samosa here and every one of them is perfect. You can enjoy thin almost-brittle-with-crispiness samosas stuffed with sinful ground beef or lamb or my favourite steak and potato. Dunk them in the mango chutney or the perfectly executed date-and-tamarind sweet and sour sauce - or even my favourite coriander and green chilli and yogurt. Could a strip mall get any closer to heaven? Yes - if they open a Beer Store next door. But perhaps I should temper my praise of this tiny take-out with some criticism... hmm. The samosas are a bit small - but I actually like that. Anything else? Ok, they do emerge from the deep fryer like a dozen drunk fat guys rising out of a hot tub - steaming, dripping, spitting. Lay them gently on a piece of kitchen towel for a few seconds, gaze upon them lovingly as they cool and they will reward you with oral joys like you have rarely experienced (no, not the fat guys silly, the samosas). In closing, the Sultan rules, long live the Sultan."}
{"text":"The plethora of good reviews for this place is mind boggling. This was a quick pick up and get out venture as this place came recommended by someone.  My friend who buys samosas regularly commented boy these are pricier than normal for a smaller sized offering. They have two categories of samosas. Traditional and gourmet OK I suppose as why not try out a new take on this tried and tested offering. There were three offerings for sauces as well.  We stuck with the traditional chicken version. They do sell frozen version for less so if you like the taste profile here give them a try.  The fresh one's were very greasy. The filling was nothing to write home about either. I would say food court level. The sauce for dipping was bland as well.  If one factors in the price/value proposition I would say you are better off buying at your regular source."}
{"text":"We dropped by here on a Sunday walk. Thought we'd each try one. Whoa...WORST samosa I have EVER had. WORST. We had each ordered the potato and cheese. Small, greasy, overcooked, and NO spices!...none. Seriously, who makes a samosa with no spices?!  This was basically potato and, I think, a Kraft cheese slice, rolled together in a wonton wrap, deep fried to a crunchy, oily, inedible, mess. Actually made me angry that they charged me for that. Will NOT be back. Ever."}
{"text":"Amazing, authentic samosas! You can buy them in huge quantities for reasonable prices. You cannot eat them there, the place is only a counter and fridge - no dine in available. If you happen to be in the area and need something quick on the go to eat, look no further - the steak and potato and tandoori chicken are among my favorites, whereas my sister swears on the spinach and cheese. They are perfectly crispy and the available dipping sauces for them compliment them perfectly. The pakoras are AMAZING - fried enough to keep its consistency but not dripping in oil. A must-have for me for over ten years."}
{"text":"I was excited when I saw the sign come up.  Now that they are finally here I ordered the mixed bunch specials for $10.25.  They came with 2 sauces and I chose the spicy tamarind and mango sauces.  The sauces are great.  The samosas were bite size and fresh but came out very greasy.  The classic flavours are very good and well-cooked.  The gourmet ones were dismal, undercooked and devoid of unifying flavour.  Service was prompt but without warmth and thy were not very helpful outside of taking the order.  For a place that just opened up I would think they would be peppier to garner business.    I will try the fritters on the menu as they look quite good but I will not make a special trip there."}
{"text":"Perfectly fried, not greasy. Best samosas in town, IMHO."}
{"text":"I had a craving for samosas and Yelped what was available in the area.  So glad I found this joint.  The samosas were so hot and fresh!  We got a few in every flavour and my ultimate favourite is the paprika chicken samosa.  It's so good and thoroughly enjoyed that the wrap is more like a spring roll texture vs being on the doughy side.  The restaurant is quite small with no seating area and only for take-out.  The size of the samosas are perfect for parties or snack sizes."}
{"text":"After reading the reviews here, I went there over the Good Friday weekend to buy two dozens of samosas for a friend's lunch party. The store was crowded  with people lining up to order or to wait for their order to be ready. After about 15 minutes wait, the lady (a middle age person) announced that my order was ready, her holding two small paper bags, each filled with 12 samosas and two styrofoam containers of sauce. I asked her for a plastic bag to safely hold the two paper bags with the samosas. Apparently she wasn't pleased with my request since she grabbed a plastic bag, handed it to me, walked away, leaving me to gingerly bag the samosas hoping I don't drop them.   I asked my friends what they thought of the samosas. They thought the samosas were  oily (perhaps still dripping with oil since they were recently fried) , typical taste of curry with potatoes, vegetable and meat, all in all -  nothing special. Apparently one can buy frozen samosas from any large Asian supermarkets which taste  just as nice, cost so much less, and which one can bake in the oven for a more healthy treat."}
{"text":"Food good, had to wait 10 minutes for tea. Girl forgot, but served it promptly after reminded. It's basically a fast food joint, only cleaner than most. Welcome addition to the area."}
{"text":"For the price and quality, it was really good!  There are plenty of dipping sauces to choose from and variety of samosas.   I'm leaning towards 3.5 because the service was nothing great.   Would go again to try the other samosa flavors.   Standouts were the vegetable,  tandoori and beef samosas."}
{"text":"If I had written this review 2 years ago when I first tried this place, I would have given it a 5. Since then, I've been dreaming of their spinach and cheese samosas. Sadly, this time, they tasted nothing like I remembered. They were fresh out of the fryer since there were none left and I had to request them, so I can't even blame them on being left out all day. The cost comes out to approx. $1 a samosa but they have a variety of flavours to choose from, which I like. I'll prob give this place another chance one day again, only because I loved it so much the first time."}
{"text":"If you're someone who's tired of the bland, greasy potato and pea samosas, then this is the place for you. Steak & potato samosas and the tandoori chicken samosas are amazing! Worth the crown for best samosas in Toronto. 99 cents each yes is a bit more than places that market 2/$1.00 & 3/$1.00 but in the end the old saying goes, \"you get what you pay for.\""}
{"text":"So, this place serves their spin on samosas, those crispy little fritters full of flavourful spicy fillings.   I arrived in Toronto at 1h30PM, and I was very hungry. I ordered 2 half dozen of them, 1 set of spinach and cheese samosas, and one set of steak and potatoes, with a side of spicy mango chutney and a coriander yoghurt sauce.  The sauces were solid, the spicy mango wasn't so spicy, although it has a sweet and tangy taste to it. The Yoghurt sauce was spicy, albeit a bit too runny.  The spinach and cheese fell flat of our expectation, lacking the spices that are usually associated with South Asian street food, and lacked flavour overall. The fact that the Yoghurt sauce couldn' stick to it play heavily against it.  However, the steak one was spicy, filling and tasty. Full of flavour, it matched perfectly with the minimal sauce that could hold on to it. It was very good.  stars: 3.5"}
{"text":"Was looking for a good Samosa place in the area and this seemed like it was close enough and garnered great reviews, so headed on over! The samosa's seemed a bit on the small side, but i chose a dozen assorted ones and they were all made fresh. The day i was there, the lady serving the samosas seemed like she was at the peak of sickness with either a serious cold or the avian flu, and should have been wearing a mask and gloves or better yet stayed home... Anyways, i took the samosas home and they all tasted pretty darn great (get the Yogurt dipping sauce) and we finished them quite quickly.... oh and i didn't end up getting sick... bonus!"}
{"text":"Just get 2 dozen. Don't think about it, just do it. Introduced my BF to these and he was hesitant but he really enjoyed them. They're not your typical samosa, these are flaky and crunchy. Not doughy or stuffed with potatoes like the ones I've had before. I first had their samosas at their Vic Park location like 10 years ago. They offer really delicious savoury fillings with different  combos such as: potato & cheese, spinach & cheese, beef/lamb and also sweet filling options too. Although I cannot say anything about the sweet combos because I have only had cravings for the savoury ones. Do not come here expecting to get full (nor are they healthy-DEEP FRIED. Hello....what part do people not understand? they're going to be oily because they're DEEP FRIED, DUH! Just let them cool/sit for a bit before eating them) from just samosas, these are pretty much only a snack."}
{"text":"Hot pockets from India.  These rather large pockets of delight have been a weekly work lunch trip lately, a few dozen beef, chicken or lamb or the chopped chicken tandoori.    I highly recommend hitting them up at 11am before the lunch rush when they are freshly fried.  Ask for a coupon, they have some behind the counter for next time; buy a dozen get a few bonus. I recommend the spicy light green yogurt sauce and no others."}
{"text":"Sooo good!! Happened to walk past while in the neighborhood & grabbed some lunch. Nice big, clean & bright shop. I wanted to try the flavors so purchased 4 @ only $99c each! Meat, chicken tandoori, steak & potato & chicken. Very tasty & fresh. The chicken ones were my fav. I'll definitely be back & will get more next time for the freezer ;)"}
{"text":"I live in the neighbourhood and generally am bad for trying new food/restaurants. A friend and I decided to give this a try and I've since been back repeatedly. Yes, the samosas are fried, but they are not dry. Beef is my favourite, then potato and cheese. I find the spice just tasty enough for me without being overly hot. Also have bought for my friends who inhaled them. For quick and delicious, this place is great."}
{"text":"This is our absolute favourite samosa place in the GTA. Nothing comes close. No doughy, heavy, tasteless door stops that so many Indian restaurants serve. The range of fillings is excellent, the staff are friendly and very helpful, the product is always fresh and my mouth is left with a wonderful tingling sensation each time - they have the level of spicing just right. We need a store west of Toronto."}
{"text":"Golden deep fried crispy packages of savoury fillings: these are definitely not your run of the mill cheapy samosas.   You have your choice of traditional beef, Tadoori Chicken Kabuli, curried vegetables and daal. For nontraditional choices: steak and potato, spinach and feta, potato and cheese and Mutton West Indies style.   For dipping sauces you have coriander and yogurt (most popular and my personal favorite), tamarind and date (underwhelming), and spicy mango (tastes artificially flavored).  They make great appetizers; don't eat them as a meal unless you want to lapse into a food coma afterwards. You know what they say: variety is the spice of life!"}
{"text":"I have eaten here many times. I love the approx $6.00 lunch that I choose. Which gives you 6 samosas and 2 dipping sauces. My favourites are the Tandoori chicken, spinach and cheese and Traditional beef. But have also had chicken paprika, steak and cheese and potato and cheese. All delicious.  Vegetarian options and meat options available. Service is quick, only downfall in my opinion is that the samosas are kept under heat lamps once cooked. So sometimes you get ones right out of the fryer and they are nice and hot but the others are not as hot. Still delicious just not as hot."}
{"text":"If you want some variety to your samosas than just the typical potato/peas then come here.  This is a small store located in a strip plaza.  When you start walking towards it from the parking lot you can smell it (this is good, not bad).  Keep in mind a few things - this is not a 5 for $1 samosa place nor are they the same size.  More like the small snack size ones.  However there are several different flavours here - steak/potato; chicken tandoori; chicken paprika and about 6 or so other flavours.  For 12 samosas it was $11 and you get 2 dips.  Not cheap so I wouldn't go here if you wanted a huge order for a party as it wouldn't be cost efficient but a great option for a smaller get together or just for you to eat.  There is no seating - just takeout in here and it isn't the nicest looking inside...but it gets the job done.  The staff are really friendly and nice.  You can get them frozen to cook yourself if you wish"}
{"text":"Can't say enough about the sultan. Crispy samosas that are packed with love. Not heavily fried. Numerous filling options.  Best samosas in the city. Excellent service. Always busy. A must go."}
{"text":"Great service!  Delicious, unusual samosas.  These are small flat triangles with crunchy pastry, unlike the more pyramid-shaped ones with a flour-based pastry.  They are deep fried, so expect some grease.  They offer discounts with larger purchases, and you can mix them up.  They also sell frozen ones you can cook at home.  Here are the stuffings to choose from (from the website):  10 vegetable splash seasoned with methi leaves Traditional beef with fresh onions and coriander leaves Steak and potato with garlic, dill and black pepper seasoning Paprika marinated chicken with fresh onions and coriander leaves Tandoori chicken Kabuli Curried four-way vegetables with assorted baghara spices Fresh cut spinach with feta and mozzarella in oregano and basil dressing Can-Eurasian inspired potato & cheddar cheese with paprika seasoning Traditional Daal with flavourful turmeric and fresh coriander Mutton with traditional West-Indies flair   Three homemade dips (Try them all! Really!!) Coriander yogurt Tamarind (sweet) Spicy Mango  Our favs:   tandoori chicken with spicy mango dip Spinach and feta with coriander dip 10-vegetable with tamarind dip"}
{"text":"Great if you want non-veg samosas at a reasonable price. Even if you like vegetarian samosas only, they have some awesome options that other places simply don't. Try the traditional beef, steak & potatoes or spinach & cheese ones. They are the best for me."}
{"text":"With a bold name like that..you know they've gotta deliver! Add sultan to anything and you've instantly upgraded to first class! I can't deny it, I was lured here by the name. LOL  This is a tiny takeout joint serving some expensive samosas! For those who are used to 5-7 somosas for a dollar; you been spoiled! It's not too late to turn back! But if you truly want some freshly mader  and delicious samosas then head on it.  This is not the typical cheapy, doughy, oily stuff you get at your local supermarket or variety stores. The wrapping is thin! Kinda like Chinese spring rolls. I find that with this wrapper, it's crispier and significantly less oily than the traditional stuff. I also learn from an Indian friend that these are from a different part of the country but they are absolutely the real deal!  They have a bazillion different flavours but of course I went with the lowly veggie and chicken ones; they were delicious! Some of the best if not the best I have every had. Piping hot, super crispy, fresh, aromatic and the ratio of fillings to wrapper felt almost perfect. I actually prefer the veggie more because it had significantly more flavour to it for some reason; not that the chicken wasn't flavourful either.  This place is busy and they do run out! If you are making a destination stop, you might want to call ahead or drive real fast!  I do have to agree with most that while these are incredibly delicious, at a buck a pop they are crazy expensive compared to what you can get out there. But then again... I think it's well worth the price; sorta. :S"}
{"text":"I love Samosas and if you can offer me the different types at one place, that is an awesome experience. I took about 48 of them for a party at my place and I mixed and matched them. The guests liked them and so did I. The Chicken Samosa and the Spinach one are my favourites. They also offer different kinds of Chutnies. Given they are the sultan of samosas, I would expect them to keep \"innovating\" and present a \"new type\" of Samosa now and then that I wouldn't see anywhere else (example Mint, Mushroom, Cocktail).  After all, if you are named Sultan, you got to live up to the expectations!"}
{"text":"Picked up 10pcs mixed samosas earlier today for just over $10.  I do not get the raving reviews these samosas get on yelp.  I've had many, many samosas and can't say I enjoyed these at all.  There is too much crust vs filling, and they are very oily.  I peeled a layer off the phyllo-like crust, it was drenched with oil in between. The fillings were on the dry side, and I found there was little distinctiveness between the different flavours, perhaps due to the overwhelmingly greasy aftertaste.  I will not be returning - high price, low quality.  Edit - adjusted to 1 star, it was just awful."}
{"text":"Best Samossa's on EARTH, fast friendly service with an excellent mixed selection. Let me say that there nuttin wring with the mutton, by far their best Samossa."}
{"text":"I was very excited initially when this place came up in the neighborhood.  The store itself is very bright and clean. Often staffed by young women from the community.   On the positive side, service is always good. The staff are friendly and will often give you an extra samosa to taste. The coffee and tea is also surprisingly excellent, although they don't always have it available. I would much prefer the coffee from here compared to Tim Hortons across the street. The ladies here also know how to give it the perfect amount of sweetness.   On the downside, I truly am not a fan of their samosas. They are overpriced, oily, and not tasty. Full disclosure; I have only had their vegetarian samosas. It would be better if they had a baked option. I also feel that they should reduce the prices because members of this community will be unable to afford paying $5 for 6 samosas. Another suggestion would be to expand their menu to include other middle eastern dishes that are not fried.   Overall an average experience. Might be good if you have a desperate samosa craving, I suggest washing it down with some of their coffee or tea."}
{"text":"Growing up, my mom's best friend was East African and she would make the best samosas in the world - not those huge greasy ones stuffed with big chunks potatoes but rather small, crispy, spicy beef triangles.  Sultans of Samosa prepares them just the same way!  Although I've been going there for years, I've only tried the traditional beef and vegetable ones but, let me tell you, they are the best ever!  So much flavour and the coriander dipping sauce is like nothing I've ever had.  Yes, they are a little on the pricy side but worth it as you don't really eat samosas every day and most people can't prepare them themselves.  I've actually ordered them for an office function as well as for my own private party and they went over very, very well.  I personally don't know anyone who doesn't love them - really worth giving them a try!"}
{"text":"I have been coming to this place since I was a young one and I would always remember how good their samosas were (and still are). To my delight, this place hasn't changed one bit in terms of the taste and quality of their samosas. Having only ever had the beef flavour, my experience is skewed but I think (and hope) it stands true for all their flavour offerings. Unlike other samosas, these have always been crispy, not oily, and very flavourful. It is hard to find other places that offer such a product; especially in Mississauga where I live now. While service isn't always the best, their food can hopefully outshine that for you. If you are in the area, I would definitely give this place a check!"}
{"text":"Delicious samosas! I tried the daal, 10 vegetable and chicken. The daal was definitely my favourite. The tamarind and mango dipping sauces were great but I didn't care for the yogurt one. I like the size of the samosas so I can try different flavours. The service was also great, very friendly. I will definitely be back to try some more flavours."}
{"text":"I was brought here by a friend and she said the were the best samosas in town! I agree, they're very tasty and the dough tastes perfect! The girls helping us were also very friendly and efficient. The price was reasonable but yeah.. wish the samosas were a little bigger! :)"}
{"text":"I heard of this place from my uncle that this place makes really good samosas. I  was surprised by the line small place but really big line up. We ordered beef, mutton and steak and potato. The sauces are really good the y complement the samosa really well a tamarind and green sauce. You can tell it's super fresh as they make it right in front of you. It is a bit pricey but I guess that cokes with really good quality food."}
{"text":"Funny enough i always went out to the west end to grab samosas or way back around Gerard/Coxwell.  Who would have known that the best samosas were so close to me. Brought them as an appetizer to a barbeque in the east end and everybody went nuts over them.  Checked out a couple more flavors while i waited and they have some pretty tasty choices on their 10 flavors list  Having Samosas so good so close though can be a bad thing like they say \"Once on the lips Twice on the lips\" or in my case Belly! LOL  It's always great to find those hidden Jems and this one is worth checking out"}
{"text":"So this place definitely has a variety of different fillings for samosas but I found it to be quite pricey at $1.10 a piece! You will want to order them before hand since it's a busy store with people coming in and buying. The samosas weren't your typical Indian samosas because the beef and potato filling tasted different. The beef had lots of onions that weren't very minced and potato filling was alright. They were snack sizes and fried nicely but I personally didn't like the taste of the meat and thought it would taste much better due to price!"}
{"text":"I passed by this store on the way to do some grocery shopping. I was very excited to try the samosas only to disappointment. The samosas are not that cheap. They are bite size for a $1 each. They are incredibly greasy, and they don't have much flavour. For a place that only sells samosas, I am very disappointed. I find it very difficult to understand why the City of Toronto has very poor Indian restaurants."}
{"text":"I have never had better tasting samosas in town. These are like little pockets of pure comfort food with all their greasy goodness. I especially love their beef and lamb ones. The sauces are very good too. I wish I lived closer so I could go there more often. A little pricier than what I'm use to but totally worth it."}
{"text":"There are a lot of different types of samosas here. These aren't your typical Indian samosas, which we didn't realize when we went here.   There are many varieties of meat as well as many varieties of veggie samosas.   They all come in one size, in a crispy samosa wrapper, deep fried, super oily. They are also very small in size for the price. $1 per samosa! (minus one star for value).   The wait is extremely long. Parking lot is always a disaster with so many cars just waiting and blocking parked cars, either for a spot or just waiting for someone to grab samosas.   I wouldn't come back here again. Samosas are too oily, small, and expensive, and don't have traditional flavours. I would recommend trying once but I'd honestly rather take the long drive to A1 in Mississauga or Samosa Factory as those are much cheaper, taste better, and are worth every penny.   The sauces I'd recommend are the green cilantro chuntney and the tamarind chutney (there's real tamarind in this!). Both have great flavour, although really watered down. The mango one just doesn't go well with samosas."}
{"text":"Grabbed a few dozen more Samosas here today.  I've reviewed before and gave 5 stars but just had to re-emphasize...authentic and delicious.  I've had samosas everywhere I see them and these are by far the BEST in the City if not the province!  Real Indian aunties behind the counter.  So authentic I feel like dancing around a tree (Bollywood reference).  New fav: 10 veg"}
{"text":"WOw....Had these yesterday for the first time and had to go back today for more.  SO good!!  I have severe digestive problems that usually get in the way of experimentation, especially anything spicey, and the beef samosa kind of left me cramping up, but, the steak and potato and potato and cheese are awesome.  I have yet to try the veggie ones and the chicken, but so far, I'm hooked!  $5.45 for 6, cheaper then my usual Tim Hortons lunch!"}
{"text":"the BEST OF THE BESTTT!! these samosas are amazing! none of that thick nasty bubbly crusty samosa shell that are sold all around indian stores! the pastry is thin and crunchy! absolutely amaaazing! the tandoori chicken and cheese with spinach are the best ones!"}
{"text":"YUM!!  Got 24 samosas today for a potluck. This is my first time ordering from them. I ordered ahead and when I got there they were piping hot. $20 for the 24 samosas and 4 dipping sauces.   I wouldn't they say they were the best I have had but they are good. Also they are not tiny, nor huge. They are the perfect size.   I am so glad this location is downtown so I don't have to drive outside the city to get samosas. I got the veggie (traditional) ones but can't wait to try the other ones.   There is NOTHING like a fresh, hot samosa. NOTHING!"}
{"text":"First time trying this place, pass by it all the time in my neighbourhood and never went in.  Happened to be searching for some snacks for the kids and my son loves samosas.  We went in and was pleasantly surprised with how small the operation was, the front area where customers order anyways.  We were 3rd in line and got in and out within 6 mins. Ordered the traditional beef, tandoori chicken and vegetable.  All 3 were delicious and not at all greasy or heavy.  The kids ate it all, not a crumb left in the bag and they raved about it as well.  We loved the corriander dipping sauce.  Will definitely be coming back for more."}
{"text":"Firstly, I must say that I'm quite surprised at the positive reviews for this place! Come on guys, you can't be serious.   I happened to be in area recently, and remembered reading all the great reviews about this place from the YELP community. So needless to say i was quite eager to try this place.   My first impression of this place was I thought it was closed. Its very unassuming, however i realize this is a takeout place so I reserved judgement. I was greeted by some kids behind the counter. I looked at the price list and I was floored. 6 samosas for $5.45!! Come on now. Surely the samosas must be big....NOT!..one samosa can be consumed in two bites! So right off the bat, I'm thinking \" these better taste good\". To make matters worse, they didn't have many items they indicated on their menu.   I got Tandoori Chicken Samosa, Veggie, Beef. Anyways the first bite...yuck... Again, sadly I was very disappointed, they are oily and not flavourful at all.   To add to this, apparently they keep the ready-made samosas in a fridge and deep fry them when required! Not very fresh at all.   If you know anything about samosa and how they should taste, do not go here. There is a place in Scarborough called Embassy Samosa King where you get 5 samosas for 1$, and they taste very fresh..   This place is a waste..."}
{"text":"I arrived her at 6:30 pm, noticing there weren't many samosa left on the tray, hence my speculation of it being end of day and they no longer had fresh samosas.  I asked for 3 samosas and a ginger ale and I ended up getting 4 instead. The woman at the register was very nice and offered a free dipping sauce.   The samosas were very good. Im happy with the customer service as well     Not a bad place to eat"}
{"text":"So Delish. My fave are the beef with coriander sauce. I grab 3 for lunch. Very affordable."}
{"text":"Sultans has the best samosas I've ever had Best tip is to not get too crazy try the chicken, beef or potato $.99 cents a samosa they also sell them frozen so you can cook them at home  their incredible I highly highly recommend thief food!!! no seating area Its just a takeout place really and the dips are incredible as well  My work orders them in huge batches sometimes and it's such a treat! you must try it if you're in the Scarbrough Vic Park area"}
{"text":"The Sultan of Samosas - OMG!  Lets talk about the dips and sauces first. They are phenomenal. All of them are flavourful, some of them are spicy. I wish I knew the names of them, but, the green yogurt and coriander dip is to die for.  The samosas themselves are from another planet. Its like a gourmet coffee place that doesn't let their brew sit for more than N minutes, except, they're samosas. They're always fresh and hot.  What makes their samosas different? Well, they're crispy, not doughy. The outer shell is light. The fillings are varied with faire for both the vegetarian and the carnivore.  Why I go? Ok, so I'm invited to a pot-luck dinner and I don't have the time, skill or energy to make something. I just zoom up to Victoria Park and Eglington ang grab 50 Samosas and a large container of dip for $32 ... and I'm the star of the party. Shhhhh, don't tell anyone my secret :-)  Interac & Credit card accepted."}
{"text":"We get samosas here all the time and it never disappoints. The variety is absolutely great with something for everyone. I was never a samosas lover until I tried this place. So if your having an social event and you want to wow your guest with different flavours and great food order your samosas here."}
{"text":"Anytime I'm in the neighbourhood I try to stop by and grab a few samosas. They are awesome...especially when they are fresh and hot from the deep fryer.  One time when I was waiting a lady gave me a sample of the pakoras and they are fantastic too.  Love this place.  Usually end up eating them in the car so they would get five stars if they had a few tables.  However doing this would probably mean changing locations and change might mean they switch something else up so maybe it's best they don't rock the boat...really the ambience isn't much but the samosas are worth it!  I'm glad they are on the expensive side because if they were dirt cheap I would eat more of them ;)"}
{"text":"So happy that Sultan of Samosas has opened a new location that's much closer to me! The only recently opened and are still working out some kinks but the samosas are as good as ever and served up fresh and hot to order. The staff are new and the pacing isn't there yet. They'll get the hang of it. I'll be back. Again. And again. And again."}
{"text":"The traditional beef samosas are the same I ate as a kid at the Naaz restaurant in Arusha, Tanzania. Brings back memories. Crispy, thin skin with a filling of spiced beef. They are great hot and are also good cold the next day. Some have mentioned that they are expensive but there is a cost for quality."}
