{"text":"A great place to hang out with friends! Delicious and fresh sushi! Highly recommended"}
{"text":"When I'm hungry I'll eat just about anything ... But I shouldn't really. When I arrived here, I should've turn around. The restaurant is not clean. Air vents in the ceiling were filthy with black dirty dust, plastic flowers - magnets for those pesky dust balls ... You get the pic? Sushi was not fresh! The miso soup tasted watered down. In fact this was one of the worst tasting meal experience when it comes to sushi.   The waitress was nice though so that is the one star I'm giving."}
{"text":"Super good sushi! The best in this neighborhood! Fish is fresh, service is friendly. Price is fair. Highly recommend!"}
{"text":"Sumo Boys is another hidden gem in Lake County. One of the first sushi restaurants in the area, it sits in a relatively non descript strip mall. The seating area is small, with a nice sushi bar, so best to call ahead and make a reservation.   The sushi is excellent, along with one of the largest menus of different Japanese cuisine to choose from, if you're looking for something more."}
{"text":"My most recent check in here was the first time I had been to Sumo Boy in years.  I had been a few times with friends and family when it first opened and always thought the food was pretty good and it seems not much has changed - and I mean that in a good way.  If you're looking for a quaint little place to get some good food, then I would recommend Sumo Boy.    Their sushi isn't my favorite, but it's not a bad option either.  It's good, but not great, but no bad either - so if you're looking for something close to end your sushi craving then this place will do that.  The other food is good too - I had a bento box lunch this past time and was very happy with my selection.  It was quite a bit of food and you will have plenty to take home for another meal or a late night snack.  All in all, Sumo Boy is great food for a great price."}
{"text":"This is one of my go-to places in the area for sushi. Noodle stir fry is excellent. Ohio Dream, Pom Pom Girl, Shaggy Dog Roll...pretty much anything you get is fresh and tasty. Sumo Boy is also very fairly priced."}
{"text":"The staff was good, but the sushi wasn't.  Fuji's would be a better choice if you're willing to drive  bit further.  I had 3 different rolls and none of them were what I consider a decent size.  Def not coming back, but I atleast gave  them a chance.  Gabe"}
{"text":"Open signs aren't even on, and the place looks dead. Very annoyed with this. Probably will mot come back again."}
{"text":"Skimpy and not fresh who wants warm sushi rice yuck .. huge no no warm roll that's very very fishy not good"}
{"text":"Inconsistent went for half price.. not so half price after all. :/ Also a hair on my sushi.... need I say more?"}
{"text":"New owner! Wonderful and fresh sushi. Great service and prices. Have been going here for years and it's just getting better! Give it another try if you were not satisfied before new ownership!"}
{"text":"I was surprised to find decent sushi in Mentor.  I just recently moved from Los Angeles to Zurich and was in town visiting family.  In LA, fabulous cheap sushi abounds; in Zurich, notsomuch.  So I was jonsing for some raw fish.    My first visit I had a lunch special of 3 rolls (from an abbreviated list) and mushroom soup.  Very fresh, and the lunch special price was really great deal.  The second time, I came for dinner and brought my parents.  Again, a delightful meal.  We came for 1/2 price Monday.  The 1/2 price selection list is somewhat short, but a few discounted selections + a few regular priced rolls and it was still a relatively inexpensive sushi outing.  Again, all the fish was fresh.  The specialty rolls were fun and unique.   Is it Matsuhisa or Sugarfish? No. Of course not. But it's a great local sushi joint."}
{"text":"Been there only twice.  Adequate sushi, pricey compared to Young's or Otani."}
{"text":"I have had good and bad meals here. The sushi is typically fair and responsibly fresh The soup is always delicious, the salad can be watery. My biggest complaint is the quality of their meat. I love getting the bento boxes. A little rice, salad, a roll, and chicken teriyaki. The chicken is fatty, gelatinous, sinewy, and gross. I've had the beef before too and it was so tough I couldn't chew it. Stick with the sushi! There used to be a woman who service who I think was the manager or owner. She was an asian lady with a shitty attitude, was mean, and condescending. She no longer works in the seating area. I'd likely go back since it is so close but they need to buy better higher quality chicken and beef. The decor is nice and it is pretty clean too."}
{"text":"I went there with my friends, the price is really fair with very fresh sashimi. This is the biggest reason for why I give the five star. And I wanna recommend the dragon ball, that is amazing!"}
{"text":"I would not normally eat sushi in the mid-west....but my business associated suggested we dine here one evening... Although the service was good the sushi was not! Nothing was fresh, the Uni tasted like it had been frozen for a few weeks.. They were missing some of my favorites (ie. Tai/Red Snapper, Hotate/Japanese Scallops, etc.).  It is probably decent by Painesville/Mentor standards but I will not be eating here again."}
{"text":"This sushi restaurant is close to the Starbucks location I was at earlier, so I figured I'd try it. Since I love sushi.  I love sushi, but I adore great sushi. Even \"ehh, it's okay\" sushi. This place had neither. I can totally tell I'll be on the toilet all night because of this place, but what I think got me was their sashimi. It's not sitting well with me at all.  The rolls didn't taste too great either. Nothing was particularly fresh, which is strange this early in the day. I could understand at 8pm, one hour before closing. But at 2:38pm ?? Come on, now.  The staff was great, which is why I gave it 2 stars, instead of one. But even with great staff, I cannot in good faith recommend this to you. I can tell you I won't be back, personally.  I'm usually always up to giving a place a second chance. Heck, even a third chance if other reviews contradict mine. But bad sushi ? Bad raw fish ?? I can't risk that a second time."}
{"text":"Terrible! Server comes in late and pretty much uninterested in taking your order. When asked for a menu throws it. Extremely rude woman. walked out of the restaurant then she comes begging to stay."}
{"text":"I'm not from Ohio so I get to actually eat real fresh sushi. This stuff was over priced and not fresh. If you don't know any better then sure, this will suffice. But alas I've eaten the real McCoy and this was disappointing. Bad salmon in the Christmas Roll ."}
{"text":"Great food, bad service.  I am rather particular about my experience, and what I experienced at SB wiped the taste of delicious sushi right out of my mouth.  We were sat at a table on the wall, and then ignored while the waitress assisted other guests who came in after us.  I thoroughly enjoyed our food, once we were assisted, and my girlfriend loved their spicy mayonnaise sauce.    But that delicious mayo is what killed it.  They charge you an extra $3 for it.  I have NEVER been to a sushi joint that charged extra for the sauce.  She actually wrote out a check for us without that charge on it, and presented it to me.  When she noticed the sauce on our table, she literally snatched the check out of my hands, and went off to go adjust it.  No matter how good the food was, I won't be heading back there after that."}
{"text":"The staff was nice enough. The service was quick and the meal presentation was nice. However the sushi was absolutely terrible. The fish was not fresh. In fact the fish was gamey. Even the rice was kind of slimy. I felt gross after eating there. If you're looking for Lake County sushi, make the short drive to Willoughby and check out Young's Sushi or Lure Bistro."}
{"text":"They have good sushi.  They also have box meals that have a combo of items that are delicious.  I reaaly enjoy this place."}
{"text":"By far the best sushi restaurant i have ever been to! The sushi is always very fresh and delicious, never had a bad meal here. I recommend this place to anyone that enjoys sushi, i come here once a week sometimes and the staff knows who i am when i walk in, very nice people! Also everything is fairly priced, you get a lot of food for cheap, an inexpensive great meal!"}
{"text":"I have stopped by this restaurant several times now during my business trips to Mentor, Ohio.  I found the customer service to be outstanding and attentive.  Portions sizes were good.  Prices were reasonable.  The food tasted excellent and was very fresh.  I enjoyed the seafood udon soup and salmon sushi.  Worth checking out when you on the east side of Mentor or west of Painsville."}
{"text":"Sumo Boy is a really silly name. I know. But it's not really bad. It's decent quality for Mentor, Ohio. Decent for the price you pay as well.  I've eaten at Sumo Boy a handful of times and have never been disappointed.   Their menus are weird and maybe a bit sketchy. Some of the servers are probably too talkative and tell you a bit too much about their personal lives. That's better than Johnny Emoface not speaking to you at all though. Right?   This is not a fine dining establishment by any means.  What it is: quality sushi at quality prices. Nothing frilly, different, or exciting.   They are kid friendly and don't mind one bit that your child spits out their shrimp or chicken teriyaki on the floor. They won't even allow you to try and clean it up. They insist on doing it themselves. Cool."}
{"text":"This is the first time I have been here, and we ordered straight from the menu with no fancy instructions for the staff.  The B-53 was so bland.  the \"spicy\" lobster was a piece of imitation lobster/crab meat, and there was no spicy sauce or anything on top or inside the roll.  It was also the thinnest roll I have ever seen, especially since it was a \"jumbo\".  It was so sorrowfully boring looking too.  The avocado was space and just a smear of brownish green mush.    The Ohio dream was fine.  Nothing special and about twice the thickness of the other \"jumbo\" roll the B-53.  The Box #3 was good the chicken teryaki and sumai left nothing to complain about.  It was really good.  The noodle stir fry was good as well, as was the miso soup.  One big issue I have was the PRICE of it all in comparison to the quality of presentation and flavor, and the small size of the jumbo roll.  Nobody got sick or anything, so I might try it again, but honestly I love spicy food, and when something is listed as spicy on the menu, it should have a kick to it.  Straight up bland is unacceptable."}
{"text":"If you want decent prices for decent sushi on the East side of Cleveland, Sumo Boy may be the place for you.  The service is fast and the sushi specials are usually pretty tasty. I would recommend the Key West Roll if it's available.  Inside the restaurant is small, but it's rarely busy so it would be a good place to take a date. If you're looking for really good sushi, you'd be better off heading to Lure in Willoughby. But for a casual sushi dinner to stomp out a mid-week craving, Sumo Boy will do the job just fine."}
{"text":"Honestly this is the best sushi on this side of town, very fresh and well priced. It is under new ownership (his name is Ray and he is the resident Sushi Chef) and he and his team have brought a lot of love and customer service back to the restaurant. I've been a regular patron since it originally opened and I couldn't be more excited. Since he took over he has already brought in red snapper, squid, is finalizing his source for white tuna, has amazing quality yellowtail. He just cares. I highly recommend it."}
{"text":"I ordered an order for pick up. It was waiting for me when I arrived. I ordered the Super fashion, B-53, and Philadelphia rolls. Philly roll was gross! Super salty dried smoked salmon. The Super fashion roll was pretty good and the B-53 was extremely bland. I also ordered gyoza and crab rangoon. The gyoza was half the size of any dumpling I've ever had. The taste was a little weird. I could taste peanut and luckily I'm not allergic. The plum sauce with it  was decent. Crab was the best thing from there. Maybe I will try the teriyaki but no more sushi for me"}
{"text":"Like this place for the sushi and the price. Some of the large rolls are around $9! Awesome deal for decent sushi."}
{"text":"Do yourself a favor and try the specials, tonight's spicey mixed was some of the best sushi I ever had!  And the spicey salmon was really good as well. The butteryaki scallops were made to perfection, may go back tomorrow???"}
{"text":"I'm a big fan of Sumo Boy.  This is not a high end restaurant, but for a strip mall in Mentor, its great.  The food is consistently good, the service is always friendly, and the prices are very reasonable.  And though it can be a little busy on Friday or Saturday night, we've never had to wait more than a few minutes for a table.  One of my favorite things to get are their version of a bento box, which they call a Sumo Box.  Their sushi is consistently good and high quality.  They do good teriyaki and tempura.  I have to say that while their miso soup is good, the noodle soup bowls are mediocre and a little bland."}
{"text":"Enjoyed their sushi. Price was fair too. I ordered take out, but service was friendly and order was ready when promised. Good choice for sushi near Painesville without driving far or spending a lot."}
{"text":"One of the better sushi places I've been to- the sushi is good and the staff is super friendly. The sushi chef is accommodating and funny!"}
{"text":"Great prices and great atmosphere. I'm a big fan of Sumo Boy because of the price of the quality and quantity. Their combinations of sushi are great and very filling. He got one and his eyes were bigger than his appetite. I enjoyed the combination because of all of the different options and flavors you were able to experience. If the big combos don't intrigue you, I suggest starting off with a nicely priced miso soup. I had the spicy tuna and california roll as old faithful. I recommend them both. And if you are alone or just the two of you, sit at the bar and watch the sushi chef roll....its pretty cool."}
{"text":"I concur...the Key West Roll is an excellent choice!  I also like their Spider Roll.  This restaurant is a great option for offering Sushi fanatics good, solid fish in an area where there is no other Sushi available...unless you consider your local grocercy store as a sushi source!  No...it may not compete with Blue Ribbon in New York City where the owners can go down to the docks and pick out their own fresh fish.   However, this is the eastern suburbs of Cleveland and expectation levels have to fall in line.   It is a casual place with good solid service and the Teriyaki offers non-sushi eaters some food choices to accomodate everyone's palate."}
{"text":"A five star rating might be a bit overly generous for a relatively average sushi joint in Mentor Ohio of all places...but I've never had a bad time at the restaurant or with take out.  Extremely reasonable prices and uniquely created & fantastically good rolls are found here.  This isn't an overly dressed up and expensively decorated trendy sushi spot in Manhattan or Los Angeles...this is pretty damn good sushi for pretty ridiculous prices in Mentor OH! Can't wait to get my hands on a few Scorpion and Kobe Rolls next time I'm in \"Menner\"."}
{"text":"Service is awful. Waited over an hour for 6 rolls. 4 tables sat after us were served before us. Waitress avoided us like the plague while we watched our food die at the counter.  Finally, when we said something, she just looked at us stunned when we said we were leaving. We've been here before, service has never been great but tonight ruined it for us."}
{"text":"Really good food great meal options the bitno boxes are a good value. Lots of choices I always get the Apple pie sushi it's so good deepfried creamcheese and apples. Also teriaki is really good they are quick to prepare the good and very friendly. Never had a bad meal here this is my wife and my little gem to stop at if there is time. Also very resonably priced forba upscale place in the middle of a shopping plaza."}
