{"text":"We discovered this on a recent visit. Wow! Great sandwiches and soups. I had The Beast, a huge roast beef with cheese and carmalized onions. My wife had a bowl of the white bean and kale soup. Both were fabulous! Not sure of the comments regarding limited menu. There must have been nearly 20 sandwich and daily special choices as well as three different soups."}
{"text":"Excellent addition to the charming downtown Mount Horeb area and so pleased to have a lunch option that is really right up my alley when it comes to menu options and food sourcing. 
This is a counter-service ordering system where they bring your food out to you and clean up after you, so don't forget to tip the friendly staff! There are daily specials and a standing menu, and having been here a couple of times I have tried a few things and have yet to be disappointed.  The decor is simple and friendly, and it always feels bright and airy in there with the big windows facing out to the street. 
This time around our party ordered jambalaya, which had a \"nice heat\" and a healthy portion of mixed greens as a side, and tomato soup which was creamy and rich. I had the beef burrito which had perfect heat for my taste (which is probably mild to medium) and was grilled so the tortilla had a nice crunch to it. That came with chips and salsa as a side. Portions are perfect.  They have a great craft beer selection and a wine selection as well. I really appreciated the support local ideals, with $1 of every jambalaya purchase that day going to the Mount Horeb school district music program."}
{"text":"So delicious! This is my favorite place to stop for lunch! Fresh ingredients+yummy food+wonderful staff= winning combination! Definitely would recommend!"}
{"text":"Stopped in for lunch, as advised by a friend. My sandwich was excellent. The service was friendly. My only complaint is navigating the cafe. I didn't realize at first that they were a little menus printed next to the cashier. No mean menus anywhere other than for ice cream. I also didn't realize that there is a very robust beer and wine menu everything I chose was excellent, but next time I'll know to look through the options first."}
{"text":"I'm from the area, so we were excited about a new local cafe to try. I've been here a couple times now and it has yet to disappoint. The first time I had their grilled cheese on sourdough with a really tasty aoili. I paired it with their black bean sweet potato chili. It was awesome! Second time I had one of their deli case sandwiches that was turkey, mixed greens, walnuts and a cranberry mayo on a some sort of multigrain bread. You had a choice of getting it served grilled or cold. Super awesome. The cranberry mayo paired with everything perfectly. Very reasonably priced and always a friendly staff. Very nice cozy open atmosphere. I also like how everyday they have new menu items. Definitely beginning to become one of my favorites!"}
{"text":"If you are looking for comfort food, Stop In!  I love the fresh tasting ingredients.  The drink selection is fun for adults & children.  Craft beer from WI, Cadence cold brew coffee, soda, wine, & juice.  They have great soups too.  Everything is ready in minutes.  You can take it with you or do what I do...grab a window seat & a wine while I briefly wait for my tasty entree.  My favorite is The Bomb! or the Vegas with greens on the side.  The greens taste great.  The chips are wonderful but the greens make me proud of my choice.  Especially since I can round out lunch with Babcock ice cream from UW-Madison.  I'm glad to see on the menu that the food is local &/or organic."}
{"text":"Did you ever love a place so much that you held off on writing a Yelp review because you were afraid you wouldn't do it justice? Yeah, that's me with Sunn Cafe.

This establishment is so near and dear to my heart. Not only is the food made-that-morning amazing, it's also a really friendly spot. The owners and staff are so, so lovely. They know my name, my preferences... this place is a real treat all around.

They carry a rotating menu of seasonal specials to augment a solid lunch menu, with offerings for everyone (vegan, veggie, GF, meat lovers, etc)! In the warm season, I like to sit outside and soak up the sunshine while I munch on local greens and whatever seasonal wonder is up for grabs that day.

PS-they'll be starting happy hour soon. Complete with yummy specials. Thursdays and Fridays, extended hours (they usually close at 4pm). Check them OUT! They're not just my fav spot in Mt Horeb--they're my fav lunch spot in Wisconsin!"}
{"text":"I really wanted to like this place. The menu is very limited and very expensive. Ordered a to go curry chicken salad from their counter.. $6.50 for a very small container. See picture. Did not come with bread, side.. Nothing. Again Mount Horeb needs more good restaurants and this place has a few things to fix!"}
{"text":"We finally tried this place after walking past it many times. The food, as well as the atmosphere, were amazing. They use fresh, quality ingredients and you can certainly tell! The potato salad is to die for! Our only regret is that we didn't try it sooner! We will be sure to return frequently!"}
{"text":"My son & I went to the Sunn Cafe yesterday for the first time.  Beautiful restaurant!  and, very well organized as well as comfortable and very cozy.  He ordered the BOMB sandwich with chips and I had a Cilantro Lime Quinoa salad on a bed of mixed greens.  Both were delicious!!  Nice portion size on both, too.  So happy to see this new restaurant in Mt Horeb.  Healthy as well as delicious!!!  Can't wait to come back! :)"}
{"text":"So amazing to have fresh food and friendly service in Mount Horeb. Can't beat the blueberry summer salad or the quinoa salad. 
Have also been impressed with the art and live music on some weekends- talk about being able to find character and culture in a small town! Great work, Sunn Café."}
