{"text":"I guess I'm not granola-y enough for this place, because not only was it tasteless, it cost almost $7 for the smallest piddly container of food, and it was lukewarm. Blech. Those noodles tasted like they spent the morning in the wash cycle."}
{"text":"I was going to give this delightful cafe four stars because the seating is not very private or adequate and because I detest the staff at Noah's. But then I realized that the point of the cafe isn't how many it can sit, etc., and that the deliciousness of the food and the kind staff inside the little cafe overpowers the pretentious and horrible attitudes of the Noah's staff. It's not this wee cafe's fault that Noah's sucks.  How has this place kept itself hidden away from me, beneath my radar, for this long?! I lived so close to this little cafe for about a year! I stumbled across it by accident a few weeks ago when I was in Noah's looking for something I hadn't been able to find anywhere else that I was desperate for (I only go to Noah's when I'm desperate - it's overpriced and the attitudes are pompous). I tentatively crept up to the dishes of food at the counter that you help yourself to buffet-style (take-away or eat-in), and my eyes were met with so many yummy sights!   Glorious vegetable and tofu goodness! And practically everything here is either gluten-free or vegan! I was not expecting my taste buds to be so satisfied and tantalized either by the seemingly mild-tasting foods, but WOW. So delicious and nicely prepared. Interesting combinations and ideas. And the gluten-free patties are to die for!  This is the exact kind of food I would be excited to get for a 'let's get a bunch of different dishes, chow down, stay in and watch movies' night. It's like the perfect combination between bland salads and gross, fattening junk food, which I always crave for movie nights. This food is healthy AND tasty. Too bad it's not open Sundays. It would be perfect for my weekly Sunday night hangover dinner search."}
{"text":"If you've never heard of Sunny Cafe it's because it's nestled deep in Noah's at Bloor and Spadina.  Noah's, a natural food and product store has been hiding this awesome little vegan buffet spot from Toronto with nary a sign to alert people of its presence.    The Sunny Cafe sells its delicious vegan meals by the weight.  It's $2.00 for every 100gr, which can add up when your eyes are bigger than your stomach.    It has both hot and cold options that differ from day to day.  Whatever your preference is, you will find something at the Sunny Cafe.  They also have a juice bar that is very reasonably priced.  And if you're in the mood for vegan cookies, muffins or cake, well, they have all that too.  You can takeaway or find a spot - but don't expect standard tables and service.  You will be eating at bar-style tables along the walls.   And a heads up - 10% off if you are a fitness member of the Miles Nadal Jewish Community Centre.    Great for vegans, vegetarians and meat-eaters looking for very healthy and tasty food."}
