{"text":"Way overpriced for small portions. I also got a breakfast bagel that tastes like plastic. I thought I would try it out and I wish I didn't."}
{"text":"This little coffee shop is delightful. I have been there several times for business meetings. The owner is pleasant and doesn't rush people out. Also as a huge plus the coffee s good too."}
{"text":"Haven't been in a little while, but it is on my way to work. Drive through is a nice touch, menu outSide could use some love. I remember getting a regular coffee (standard pricing) but it was so hot we could not drink it for over 20minutes.. something wrong there. Boyfriend had an iced raspberry mocha, didn't like it due to granulated/powdery chocolate taste.. powder should be reserved for hot, syrup for cold. 
Like that they have a board with stuff going on and other local businesses and events.. not \"too\" decorated,  but serves the purpose. I'm not sure if the drive through is the more popular choice. 
Not overwhelmed by friendliness, but that is ok. If I want to be overwhelmed, I will do Dutch. Would have liked to know their coffee was sourced locally but it isn't. Wasn't a fan of my baked good (To be fair, I did not share with them because
I had already left) but I will still consider them when I need a quick drink. My boyfriend said he would
try their sandwich again."}
{"text":"I love starting my day with Sunsational Coffee! Everyone that works there is amazing and the coffee tastes incredible. They have daily promotions, my favorites are Double Stamp Monday and Add a Free Espresso Shot Wednesday. The menu gives you a large variety of options for food and drinks. I especially love all of the syrup flavor choices and how I can get a gingerbread or pumpkin coffee year round! I use the drive thru, which is quick and convenient on my way into work. Ever since they told me that they deliver, I've been keeping them busy with large orders for my staff at work as well. Sunsational Coffee is my favorite coffee shop in Surprise and I will continue to go there for years to come."}
{"text":"Great Little local shop. Always friendly and quick with my drinks. Coffee is smooth and flavorful."}
{"text":"Amazing coffee shop. Amazing prices. Amazing staff. Amazing coffee. I am a card carrying Starbucks gold card holder and as much as I love my Starbucks. Nothing can compare to the awesomeness that is Sunsational!!! I love supporting a local business and love that they know our favorite drinks. This place proves that true customer service is alive and well!"}
{"text":"Workers are very friendly and they are very efficient with your orders! The cards they give you that give you a free drink after 10 stamps is a very good idea and it helps customers to keep coming back."}
{"text":"Favorite coffee in Surprise AZ. Way better tasting than starbucks coffee in my opinion. Better pricing as well! Food is always great. We usually get the English muffin sandwiches."}
{"text":"We came for breakfast & espresso drinks when we were in town.  The have quite a few breakfast sandwiches, but they do also have one breakfast without bread/gluten - baked eggs.  That's what we got & it was quite good.  The kids got smoothies, which they liked.  Espresso drinks were pretty good.  They offer alternative milks like almond & coconut."}
{"text":"Great place! Everyone that works here is friendly and most remember my order. The coffee is great, and the price is right. I love supporting a local business over Starbucks. They have a great selection as well. I love their punch card system. I am now a long time customer and definitely recommend this coffee shop!"}
{"text":"Yummmmmm. Everything is wonderful. My favorite are the wraps especially the Cesar and the raspberry  mocha iced latte with coconut milk. .to die for"}
{"text":"I cannot say enough about this place and their amazing ownership and workers. I never write reviews, in fact I signed up on Yelp just to write this. Below is a small story.

Story - Today their delivery person (who I believe also owns the place) came by today and delivered our breakfast and coffee. All came and was delicious as usual. The gentleman was courteous, polite and as always friendly! We did notice however that we were missing 1 chocolate muffin we thought.

Turns out we called them and we may have miscommunicated the order and we were never charged. We said OK no problem! Their service is always impeccable so I was OK with it - they even offered to have the driver come by just to deliver a muffin! I said that is not necessary but a kind gesture. Remember, we weren't even charged!

Well within 10 minutes, to my girlfriends and I surprise. Our doorbell rings and he's there at our door. Muffin in hand and even through in a giant cookie! Top service and food here folks. I hope they continue to flourish and do well. Support these fine people! Service like that is a dying culture and it was a refreshing change of pace. You've earned a long time customers from us!"}
{"text":"Great coffee and fresh blueberry muffin.... Great service... Prices are great... Definitely will be back..."}
{"text":"This place is fantastic. Blueberry muffins are so good. Great service and my kids love it too!"}
{"text":"Staff is always pleasant and coffee is always yummy.  
I love to support local and this is right by the house."}
{"text":"Love love love!!!! Great coffee, great service!!!!! I drive out of my way just to drink their coffee! Worth it every time!!!"}
{"text":"Sunsational coffee was okay... I came here hopeful as my friend talked it up.  I got tea during my visit as it was hot out (typical AZ) and I wanted something refreshing.  My tea wasn't bad, but my friend got a raspberry black tea and it was gross.  I also was excited as they had \"build your own breakfast sandwich\" for $2.60 but it was a little tiny nothing.  2 slivers of turkey, a tiny egg white, and next to no cheese.  I was very disappointed with my visit. :("}
{"text":"Stopped before the spring training game and had white coffee (tasty) and a quick bite. Food was great and staff was amazing!!!"}
{"text":"Very friendly staff. Was a new customer and after just 3 visits they knew my order right away. :)"}
{"text":"Love this place. Amazing service. Super friendly. Always delicious! Our favorite breakfast joint!"}
{"text":"FIRST AND LAST! My wife works in school across the street so we decide to get something in her 30 min lunch. 
Place had two customers using wifi, and one customer in drive thru. 
We were never greeted, just go a  \"can i help you\"; not even a smile from either of  the ladies working.
Ok past that, we order cesar wrap and meatiest sandwich...15 min later...we received our lunch on styrofoam plate not wrapped, cold, looked sad! 
The sandwich looked like a 10 year old would make after school.! Over all $22 for bottle of water, lemonade, wrap, and sandwich (which a stretch of the word)! NOT Worth the wait or the visit! Go across the street and get a happy meal! Its warm, fast, not $22 and they at least greet you at the counter! NONsational is what I say!"}
{"text":"Nice business. They deliver coffee to businesses - not until after 9am, but by that time my coffee from home is finished and I'm ready for more. They have all the flavors you can think of to add to your coffee if you like, and they're very tasty."}
{"text":"Arizona is hot! So we were looking for some ice coffee and breakfast food since we woke up late! They have an awesome weekend deal where if you buy a large drink or sandwich you'll get a free dessert! Lloyd is really friendly and welcoming! 

The atmosphere is bright and clean! Great place to do some reading or have one on one! 

The croissant is really flakey!!! Good food, good service, good coffee, and a surprise deal! What else can you ask for!!"}
{"text":"Stopped in while waiting for our vehicle to be serviced down the road.  Nobody was in, so we were lucky to have the place to ourselves.  The woman was so nice!  I mean above & beyond service- I asked for a sugar free  almond Roca latte & she looked up recipes to make it for me.... but I changed my mind and she wasn't even bothered by that. Rather, she wrote down the syrups for me!  
Anyhow- the drinks were great too.
Got an iced honey green tea, Pina colada smoothie, and passion fruit cheesecake vanilla Italian soda.  They were all great tasting (yea, I tried all) and it was a little under $10."}
{"text":"Very friendly environment with pretty good coffee and baked goods.

Coffee is more a loose term here as most coffee items can only be had latte or Americano style so the coffee can be more watery. It's a different take on the coffee shop in that way so don't let that sway your decisions to cop out and go to Starbucks 

The green coffee is the same way and is more of a mix between a coconut or nutty milk drink and does not taste like coffee. It's refreshing and doesn't have those weird aftertastes like the magical milk that comes from nuts."}
{"text":"I was a first-time customer at Sunsational Coffee today, and I will definitely be back. It is an adorable & cozy little place, filled friendly staff that had memorized the order of each regular customer that walked in. 

After much debating, I ended up ordering a simple blended caramel with whipped cream and an egg & cheese croissant. They were both DELICIOUS and very reasonably priced. The drink tasted like real caramel, not the artificial stuff other places use. The breakfast sandwich was spilling with egg and cheese and the croissant was likely the best I've ever had. 

If you're looking for an affordable, quick, friendly, and delicious coffee place, Sunsational is it!"}
{"text":"I love coming here when I am in town for there amazing coffee such a strong good tasting brew thank you sunsational coffee!!!"}
{"text":"We can't help coming back every couple of days. The coffee is deliciously prepared and way cheaper than any chain coffee shop. We often order the muffins as their baked fresh in house daily. For lunch the wraps are large enough to split and very reasonably priced. Family owned and we love that!!"}
{"text":"The place could use a little love - looks worn out and tired. I stopped in to meet with a client. The girl who took my order was unfriendly and gave me a strange look when I asked for a dark blend of coffee. Not impressed."}
{"text":"This place is a fantastic little LOCAL coffee shop! The coffee is good and the food is great! A nice relaxing atmosphere with very friendly staff. We have been here more than a few times, and will be coming back more. Make sure to skip your starbucks and support this great local business!"}
{"text":"Excellent coffee! One of us had a yummy americano and I had a fabulous soy latte. The oatmeal is cinnamony which I liked! The atmosphere is casual...like sitting on your sun porch at home. The owners are very friendly, hard working, and eager to make you happy. There was great traffic and they were also taking phone in orders! Will definitely go back!"}
{"text":"It was a very friendly place to visit. Had all of my questions answered and noticed people who came I. While I was sitting there had the same great customer service. I got an iced Americano. The espresso tasted similar to Starbucks, which is not my favorite but it's a nice little place to grab coffee if you like supporting local business. Only thing that would make it better is if they used locally roasted beans."}
{"text":"The people here are so friendly and patient as I take forever to look over the menu. Very cute and quiet and the coffee is great!"}
{"text":"I recently moved from Tucson and had a local coffee shop I loved. Didn't think I would find somewhere in Surprise that could measure up, but I was wrong!
I love around the corner from Sunsational Coffee and decided to give it a try. I ordered a chai tea. Great spice and really tasty. They also have a pretty large menu with breakfast and lunch items. We will be going back for a meal soon. 
The staff was wonderfully friendly and helped me with the menu (as it was my first time). Great experience all around."}
{"text":"Great little mom and pop coffee house. Outdoor patio seating and a nice area to sit inside. Staff was very nice and helpful.

Had a hot white chocolate mocha and it was spot on. Very flavorful and had a great coffee flavor. Not super sweet like a Star$&@$s. Sorry but I hate that place. Looked like they have a great selection of food. 

My favorite type of place, not a chain. If you're in the area stop in for a cup."}
{"text":"Haven't eaten yet.......but am I really watching my sausage being microwaved?!?!
*updated...... so I ate it. & will never be back again. Microwaved sausage sandwich. Everything was tough. I should've asked for my $ back when I saw him put my food in to nuke. Ugh."}
{"text":"Wonderful neighborhood coffee spot with a large menu and great customer service.  Love the wall of art for sale and giving attention to rescued mastiff dogs."}
{"text":"Have I mentioned that I love family owned businesses? The best part is that they love their customers enough to remember what you. And not just you...your family too. Coffee is excellent. They have a specialty drink every week. Their breakfast sandwiches are terrific. Pastries are delicious. We are here several times per month. Thanks Sunsational for being such a big part of our family time."}
{"text":"Nice find, very clean and full coffee menu, breakfast menu too. I had my usual two shot espresso over ice and it was exactly what I was expecting. Family run shop, free wifi and smiles all around. Will come back if I'm in the area."}
{"text":"This is seriously the best coffee in Surprise.  The service is always great and so very friendly. Plus they have a drive-thru always with a smile. Great place to hang out and enjoy an amazing cup of Joe."}
{"text":"Delicious and fun local coffee place. I ordered a sausage, egg and cheese bagel on a jalapeño bagel. Perfect. The owners were very personal and great to talk with too!"}
{"text":"Coffee was good however it took forever to order and the employees weren't very friendly."}
{"text":"Not impressed. Biscuits and gravy portion was small. Employees seemed indifferent. Waited several minutes at register to even get acknowledgement from them."}
{"text":"Wow, such a good chai latte. Yumm... I'll come back here when I'm back in Arizona for sure!!! This one red/violet haired Chick was holding down the fort all by herself. You go girl."}
{"text":"My children have scouts nearby, and instead of driving all the way home and back, I tend to go get a coffee and do homework.  The atmosphere here is soothing, I can get a baked eggs (technically microwaved, but whatevs, semantics, there's cheese and bacon involved, a lot can be forgiven), a raspberry mocha with almond milk, and do my homework in peace and quiet.  Pandora is streamed generally, but it is a good environment, and they have gluten free cookies and bars to nom on for my fellow gluten-free people."}
{"text":"Delicious coffee with tons of options on flavor. Friendliest staff I've encountered in a long time. Love their drive through."}
{"text":"I think I found my new favorite local coffee shop. I am a Dutch Brothers girl for sure but this place is local and great. Each employee i have met knows their stuff. They don't try to upsell you on something you won't like just to make a buck. The owner is passionate about GOOD coffee. A trait I appreciate. Prices are on par with the big box retailers but service is faster and friendlier than most. I recommend the Iced Mocha Bianca. Great refreshing pick me up for AZ summer mornings."}
{"text":"I love having a locally owned coffee shop so close to my place.  I like this place so much I am a regular and I've told countless friends to come here as well.  I don't support them just because they are local.  I support the because the coffee is top notch (and that's from a mostly non coffee drinking person), the staff is friendly and most of them will remember your order once you've been a couple of times.  

I've held meetings here and my friends with kids don't feel as if they aren't welcome.  They have toys for them to play with and a menu that the little ones enjoy as much as adults.  The blended mocha is my favorite but I also enjoy their Italian sodas!  Other notables on the menu would be the chicken wraps, coffee cake (yummy!!!! messy crumbly goodness), I haven't had it yet but my friend is addicted to the lemon bars which is a seasonal item.  They have breakfast bagels and cookies too (I am a creature of habit so I usually just get a wrap and blended mocha.  Did I mention they also have gluten free items?  Yes!  Cookies and they will make wraps into salads for you.

There are seats outside and a drive thru (which I never use bc I prefer sitting in for a while) The shop and bathroom are always clean.  There are always crafts, flyers, business cards here for people to pick up and support local businesses around town.  

Things I would change about this location:  
soup!  I want soup! 
fresh fruit
and
I want big fat soft cushiony chairs!!!!

All in all this is the place for me. :)"}
{"text":"Best coffee shop in Surprise! Staff is very friendly and give excellent recommendations. Their muffins are delicious. They also have a drive through if you're in a hurry!!"}
{"text":"I came across Sunsational Coffee at the referral of a co-worker. Being that I'm from Orange County, I was blessed with variety of coffee offered there, but since moving to the Northwest Valley my choices have been Starbucks and Paradise Cafe, or Coffee Bean & Tea Leaf if I want to make the 22 mile drive.

What I love about Sunsational Coffee is their unique blends offered at very reasonable prices. I'm a huge Iced Mocha fan myself and have finally found my coffee shop. Coupled with the small business feel and friendly employees, they offer various daily specials that will make every visit a unique one.

Sensational Coffee is located at the old Bad Ass Coffee location. In addition, I believe it's the only coffee shop that offers drive-thru service in Surprise which makes for an easy in and out for a quick cup if you're on the go!"}
{"text":"I'm not a big coffee shop drinker but when I do want one, I'll get one from here. The prices are on par with other similar places. They have a drive thru and a sit in area. You can get you coffee hot, cold or blended all for the same price. The interior is not the \"hippest\" place but I'm getting a coffee not trying to talk about the newest underground trip hop group from Scandinavia. The baristas are nice and polite and the service is quick."}
{"text":"Friendly staff, great coffee and good sandwiches. 

GUYS, check out the MEGA, MEGA.  5 meats, 5 cheeses, and 2 eggs on a bagle, croissant or bread.  I would have taken a picture but i ate it before that thought cane into my head.  

Nice relaxing place to have breakfast at a great price."}
{"text":"Went through the drive thru for my first visit. I believe the gentleman who helped me was the owner. He was very sweet and informative about the menu. I got the Mega with pepper jack cheese and a large iced white coffee with vanilla and cinnamon. The white coffee was pretty delicious, almost like an horchata with a little kick to it. Definitely recommend giving it a try, there are many flavors to pick from. Since I got a large coffee and breakfast sandwich, I was told I could have a free cookie or muffin. I got a Dutch apple muffin which was delicately sweetened on the outside, soft and fluffy in the inside. I was stuffed from the Mega and was not disappointed. My girlfriend is vegetarian, she got an egg and cheese croissant. She enjoyed her sandwich too! Give it a shot, everything is fresh and they're super friendly :) I'll be back if I'm ever on this side of town again."}
{"text":"This one was a miss for me, Yelpers.  My husband even asked if I Yelped this place then commented that they must have had a bunch of friends and family score them because it was just so far off!  The two stars were for the coffee, which was really good.  I checked ahead to make sure I could get a gluten free breakfast.  My options when we got there?  Just some prepackaged cookies.  Ok, that was a miss.  I plan ahead for these things so I had a Kind bar and a banana in the car.  So the hubby ordered steal cut oatmeal.  It turned out to be instant!!! And not even soaked in and mixed.  Just a watery unappealing mess!  The second star was for the guy that took our order.  Sweet kid and hard working.  Too bad that the barista snapped at him in front of us.  Awkward!  This was just disappointing.  I wish these guys well as I really like to support the little independent places.  My advice is focus on improving the food.  Only serve what you can do really well.  And treat your employees better!  Your people are your best asset!

Thank you to the owner for responding. I added another star for the effort.  I hope you can work out the details as this will be a nice alternative to the cookie cutter places if you do.  Good luck!"}
{"text":"I really like the coffee here but they are often too slow for me. If I'm not in a hurry I may come here. I would come more if the service was faster like at Dutch Bros. The people here are usually nice, but I think they need more people and maybe a drive through speaker so you can order before you get to the window. It would speed things up."}
{"text":"Love coming in here for meetings and the staff is always a pleasure to shat with while I wait."}
{"text":"We came here on a Saturday morning around 8! They weren't too busy when we got there but they did get busier around 830. We ordered an americano with sugar free English toffee and a caramel macchiato. We also ordered two breakfast sandwiches. The coffee was great! It was not too sweet and had a nice flavor to the espresso. I loved that they had so many sugar free flavors! Probably more than half of their flavors came in sugar free. The sandwiches we ordered were good except the eggs had a weird soapy flavor. The sausage and croissant was tasty though. We told the owner who was so nice and accommodating about it! He said it wasn't a problem to replace them with the baked eggs and that he valued our feedback so he could improve his products. I thought that was really great of him to actually care about what we were saying and not get upset about it. He brought us out the baked eggs and they were sooo good! They were fresh eggs baked with lots of cheese and bacon on top. I am doing a keto diet so this was perfect for me. We will come back here for the amazing customer service and delicious baked eggs!"}
{"text":"Very nice people serving good coffee and tea. Breakfast food seems to be prepared offsite and heated up there. It was okay to good. Biscuit really needs a redo. I would suggest an investment in dishes instead of styrofoam. A new menu is due June 22nd.

However this is really about coffee and tea. Hubby ordered the white coffee and the owner (?) suggested adding milk to tame the earthiness of the flavor. Almond milk was used. Hubby enjoyed the flavor as it did not have the usual acidic after taste.

I enjoyed a Chi Tea and must say that it was the best I have ever drank. Both drinks were served at the proper temperature instead of the usual too hot to drink or hold the cup. For these reasons they earned four stars instead of 3.

We will go back for the coffee and tea and to check out the new menu."}
{"text":"Great little coffee shop on Reems. Ton of sugar free flavors to choose from. I had a triple iced Mocha and the coffee was  bold and rich. Very delicious. They have a drive through but inside is very quiet and reserved with wifi if you want to sit and relax.  Very friendly staff. Excellent alternative if you are not up to waiting in Dutch Bros' long lines"}
{"text":"This place used to be called \"Bad Ass Coffee\" I don't know about you... But it's still pretty bad ass to me! Haha 

They even have a drive thru! Freaking Awesomeness!! I think it should be a law for all coffee spot to be required to have drive thru service. Haha (wishful thinking) on e serious note Sensational is one of my top three got to go to coffee spots out there. The service is undeniably excellent! They really do have a way to always make their customers feel good and smile. They have great coffee and food here, no question about it. There are so many options when it comes to making your cup of Joe here. Really makes it kind of cool and fun at the same time. I usually just get the green tea latte with extra espresso shots. Yum! The place in the inside is really comfortable and cozy, with a cool atmosphere. 

 If you haven't already had the opportunity to experience Sensational Coffee you need to get your butt down there and pay them a visit!"}
{"text":"Had an amazing pumped pie latté. Stocked to find out they offer pumpkin spice ALL YEAR LONG.. Defiantly will be my new go to code place.. Great quiet place to meet friends! Loved that they have coloring books and crayons for kid.. Great place to bring any and everyone"}
{"text":"This place epitomizes the best in small business. Very friendly, extraordinary customer service, homemade breakfast items and terrific coffee"}
{"text":"The service here is great! The workers are very knowledgeable. I enjoy getting the white coffee/Whole Milk/Sugar free vanilla flavor/ Iced. It takes like a milkshake. I highly recommend!"}
{"text":"The raspberry mocha is AMAZING!!!  I asked for a Frap this time and it was so refreshing.  I also ordered a jalepeno bagel with cream cheese.  Everything was delicious!  I especially love that it is not a chain!  It is owned and operated by a local family!"}
{"text":"This is such an awesome place that's locally owned.I like to drink coffee and I love the smooth taste of their's. The staff is always so friendly and helpful. They have a nice variety of foods and drinks on their menu. It's very quiet and very clean as well.  There also is a punch card that entitles you to a free drink after a 10 drink purchase."}
{"text":"Very friendly and helpful staff. Coffee was great. Got a large iced cold shots and whole milk with hazelnut flavor. Very good. Also got a sausage egg and cheese sandwich on an English muffin. Nothing too special but also good. 15 bucks for 2 sandwiches and 2 large coffees. Great deal."}
{"text":"I am visiting from seattle and I've had my fare Share of coffee from various cafés and I know my what's good ; ) (Starbucks is not impressive). This coffee is delicious!! The also have several milk alternatives, almond, coconut etc. and the prices are very reasonable. The gentleman working the drive thru was very friendly too. I highly recommend this place!"}
{"text":"I have been back a few times recently and have to update what I think. I have ordered other things (italian soda and chia tea), I was realllly impressed! The customer service was through the roof amazing. I will just make sure to specify I like my coffee strong next time."}
{"text":"Cute mom & pop coffee shop. Very friendly staff! They have \"white coffee\" & they let me sample it because I had never had it before! It was earthy, similar to green tea in my opinion, & yummy! Give it a try in a latte! There are also really cute local crafts sold here. I was particular drawn to the dream catchers :)"}
{"text":"The latte I had was good.  My friend's fruit smoothie was a little too sweet.
The atmosphere is good, has a welcoming feel.
The chairs and tables are comfortable.

Pretty typical coffee/smoothie place.  Not so memorable and not so forgettable either."}
{"text":"Great coffee, generous and delicious sandwiches at  reasonable prices.  I love coming in, sitting down to drink my coffee, read the paper and just relax for a while."}
{"text":"This coffee shop has the perfect atmosphere! It's welcoming and and extremely clean. The mom and pop feel to it is just right. I would rather give my money to them than going to spend outrageous amounts of my money to chain coffee places. Their sandwiches are small but suffice the appetite. My favorite thing about this place is the variety of flavors for coffee, especially the white coffee."}
{"text":"Great coffee and baked goods and a nice family run business.  The place is clean, friendly and we dig the pouch cards as we get all of our coffee here to support small local business."}
{"text":"Favorite coffee place in this area! Good coffee, happy faces. Drive thru or eat in. They have light breakfast or lunch. But it's really all about the coffee for me."}
{"text":"I am a bagel fanatic and haven't been able to find a bagel shop that I love here in Surprise until I tried one from sunsational coffee. I ordered a simple plain bagel with cream cheese and it was amazing. I also ordered an iced white chocolate mocha that was very good too. The staff was super nice. I will be visiting here more often!"}
{"text":"It's become tradition to stop by Sunsational Coffee before taking our little pooch to the dog park every weekend. The drive thru is great. Everyone's really nice and gets our order out within just a few minutes. Their coffees are really strong, just the way I like it! And our pup,  AJ already knows to stick his head out of the window for his dog biscuit.

Kudos for the military discount and loyalty stamps that earn me a free drink after every 10. 

Best little cafe in Surprise!"}
{"text":"My favorite coffee place. I'm not a huge coffee fan in general bc of the bitter taste but the beans they use here have the coffee flavor, is still strong, but it bitter. I'm only visiting from D.C. and I rarely review but this deserves it. Owner is very helpful too and doesn't just try to sell u the popular drink, he asks you about yourself to see what you might like."}
{"text":"Great coffee, bagel and bialy sandwiches are amazing. Drive thru is a huge plus, as anyone with a baby would know. So happy we found this place!"}
{"text":"Great mom and pop coffee shop in Surprise! Ordered am iced coffee and a breakfast sandwich. The coffee was very good and the breakfast sandwich was even better! Good thing I don't live closer or I'd be there every morning!"}
{"text":"Coffee choices galore! I love that they accommodate to those who don't drink milk or soy with many other choices. The options here are limitless. My daughter loves their smoothies.
The food is great too. My favorite is the everything bagel toasted with cream cheese and turkey. Yumm! Very friendly people here.
The only downfall and the reason for one star short of 5 is it is ALWAYS hot in there every time I've go inside. I don't enjoy sweating as I'm waiting for my drink/food especially if I have to head to work after so I never go inside. I stick to the drive through which is quick, but it would be nice to hang out and enjoy the lounge/dinning area once in a while. I would defiantly visit this establishment more often if it was more comfortable temperature wise."}
{"text":"Service was slow and blah. I don't enjoy the excitement from Dutch bros but a little more friendliness when you walk in and order would be nice. I went in thinking it would be personable and friendly being that it's not a chain but even the coffee was just mediocre. I wouldn't go again"}
{"text":"I used to come all of the time, but then had a bad coffee and took a break. I went back the other morning and ordered an iced white chocolate mocha. NO White chocolate taste at all it was terrible, I asked the man to put in more white chocolate and he looked like I had asked him to give me all of the money in his register. I just threw it away and went to starbucks."}
{"text":"Great coffee and great croissant sandwiches!  Lloyd was very helpful and even offered us free muffins/cookies while we were waiting for our food to be made.  Punch cards to get a free coffee drink.  Definitely go with the sausage/cheddar croissant sandwich and you won't be disappointed!"}
{"text":"Visited for the first time on a Saturday, and I'm a fan! Went through the drive thru and ordered a breakfast biscuit and green tea. Breakfast biscuit was freshly made and very yummy and seems healthy, and green tea was good as well. Nothing to complain about- didn't have to wait long either. Friendly people, will definitely go back!"}
{"text":"Great coffee, a drive thru and tasty breakfast sandwiches - tons of sugar free options - super friendly and attentive staff. Plus affordable and they have a free loyalty card. I was wary of a beach themed coffee joint, but I'm a believer! Go Sunsational!"}
{"text":"Decent little spot with good coffee, good selection. Breakfast sammys were good but nothing amazing. Service was slow. I was left a but disappointed but love supporting local businesses, so I'll try again another day."}
{"text":"Though I don't mind Starbucks, I will never go back. Sunsational Coffee not only does it right, they get to know you in the process. I have started ordering decaf drinks lately due to my anxiety levels and Lloyd (the owner) every time reminds me, knowing I am prone to forget my new commitment.

Anyway, as a coffee-lover from Seattle, the city of caffeine, Sunsational really makes me miss home, and is the perfect solution for my fix. Lloyd is from Washington state himself, and takes great care over your beverage, so if you aren't satisfied, he'll be sure to get it just right for you! (And remember your drink the next time too most likely.)"}
{"text":"Delicious spot! Great coffee! The blueberry muffins that the owner and his daughter personally created literally got me through my last pregnancy! So delish!!! My kids love the cinnamon rolls as do I, they're huge and mom gets to finish all of them! Go here ASAP, they don't disappoint."}
{"text":"The coffee is excellent and the people are extremely friendly. They will make it how you like it from a Mexican latte to a mocha cafe Americano. The west valley needed some place like this. Been there twice and will continue to enjoy there brew."}
{"text":"my friend and I were looking for a quick grab and go coffee on her way to our first round of golf while visiting Phoenix.  The gentleman making the coffee was very pleasant but the 2 iced lattes he took 10 minutes to make were not worth the wait.  Guess we get pretty spoiled up in the Seattle area with our good roasts."}
{"text":"The coffee here is amazing, but so are their breakfast sandwiches, wraps and pastries! The owner has awesome deals on the weekends which include freebies. The  customer service is phenomenal! Thank you Sunsational for doing what you do and doing it great! You are one of my favorite spots!"}
{"text":"I love this place! I no longer work nearby so can't take advantage of their delivery service anymore. I love the Moroccan mint tea and their muffins are truly the best! Their coffee drinks are too sweet for my liking though."}
{"text":"I've never been inside, only through the drive thru but their coffee is great and they have so many flavors to choose from. I like the toasted marshmallow iced coffee. The owner and workers are very nice and will take your order even after they're closed if they're still there. Go visit! There's a drive through, you don't even need to wear pants!"}
{"text":"Sunsational Coffee is awesome! It's exciting to finally get a coffee shop in Surprise that offers quality coffee...unlike Starbucks! I really enjoy their convenient drive-thru, especially just before heading into work. The other day I took my Lab with me and she got a dog treat from the drive-thru! The staff is super friendly. I would recommend trying their Carmel Latte and their Strawberry Italian Cream Soda (I'm hooked on this one!). Great coffee joint to get some work done or to socialize over coffee. I really hope they stay open!"}
{"text":"Good coffee and friendly owner, always good to support local businesses, especially when most things around here are chains. He also made an effort to accommodate vegans and gluten free. I'll be back!"}
{"text":"Love this place, great place to hang out and have a cup of coffee. The employees are great, the owner is there often and he is so nice and wonderful.  He shares his knowledge because I always have questions, like \"What's green coffee?\" which i would never feel comfortable asking in another cafe...  He always recommends the best drinks too! YUM!  the bakery items are awesome!  Drive through is great when I'm in my pajamas and the punch card program has provided me many free coffees! overall i would say that they are \"Sunsational!\""}
{"text":"My favorite cup of coffee is right here!  The white coffee and some flavor is excellent.  This shop also has tasty breakfast options that me and my family enjoy.  

During the summer time iced is the way to go.  They have a frequent customer card program too to get stamps that add up to a free beverage.

Parking is available and they have a drive thru."}
{"text":"Do not trust the average reviews. We went there because it had 4 1/2 stars. I was very disappointed. The coffee was ok a little on the sweet side. We also ordered a breakfast croissant. It was a very plain. I could make the same thing at home. We were also offered complimentary pastries. One was a hold loaf and the other I believe was orange cranberry. Neither were good. I would not go back there."}
{"text":"Recently, I've been trying to find a friendly and relaxed coffee spot where you can go in, get coffee in an actual mug, sit down, and read or chat.  Maybe it's the burgeoning hippie in me or something, but I'm sick of paper cups for coffee, and sometimes I just don't want to make it myself. This search has taken me to local shops, which has been pretty cool. Unfortunately, this place was below the bar for my group.  Nevermind the paper cups - it wasn't a huge deal.  Nope, this review is entirely for the service.

The service was dismissive and rude.  It seemed like an inconvenience for her that she had customers to tend to. We were the only people inside and one car came up to the drive thru a few minutes later, so this was hardly like Starbucks on a Monday morning... Although the plan had been to sit in and enjoy our coffee there, after being smacked with that unfriendly vibe, we took it all to go."}
{"text":"I used the drive thru early one morning on my way to work. I ordered a breve latte. It came as expected and was very good. A little pricey but I'm cheap. I hope this place stays in business. It's nice to have a neighborhood coffee shop that's not a chain. The drive thru option is great too."}
{"text":"Probably the best coffee shop in Surprise. Quiet and laid back. Friendly service. I like the fact that they also give frequent customer stamp cards, and you can also purchase their mugs which I love! One of my faves are the cinnamon rolls and bagels. Check them out!"}
{"text":"Great Place that is hidden in a busy strip mall area. Cute quiet cafe inside with a few chairs and a table outside.

Celiac review: They carry monin syrups and the very nice barista had no problem making my drink directly in the cup skipping any cross-contamination issues. Nima tested safe for a large iced vanilla latte."}
{"text":"Pleasantly surprised! My expectations were low as there are not a lot of decent food spots in this area but the cute chalk sandwich board outside the drive thru lured me over saved me from the greasy pit of love handles and cellulite next door known as Church's Chicken. 

Lady at drive thru was helpful in her suggestions.  Food and drink were fast and extremely larger in size than I thought they'd be. 

I ordered the chicken Cesar salad wrap (it was that or the sandwich) and even though I'm not really a wrap kinda girl unless receiving a gift in shiny paper it was actually good fresh and very filling. Glad to have found a good healthy option with a drive thru window. I would definitely return."}
{"text":"A great locally owned small business with amazing Coffee & Espresso products, etc!
Compared to the most popular coffee shop in the nation ($+@^....) this is Top Notch!! Not bitter like the other brands. :)
Sweet treats and Breakfast too. Also, adorable art & boutique items to view and buy as well. A must try!!"}
{"text":"First time here and I will be back! Had the pumpkin spice latte and the pumpkin cream cheese muffin. The latte isn't like the one at Starbucks (which isn't a bad thing) but if you like the sweetness that Starbucks has, you'll have to add a lot of extra sugar because theirs is pretty strong. Now the muffin, OMG I could eat 10 a day if my hips would let me! Absolutely delicious! The nail shop I got to is ready got next door so I will be trying different drinks each time!"}
{"text":"Found this little gem one day and I'm so glad I did! The owner is so nice and she always recognizes me and my boyfriend when we come in and knows exactly what we want. Great prices and the coffee is really good. They have specials everyday Double stamp Monday's on your customer loyalty card helps you get a free coffee ultra fast. :) I can't even say how many times I've been in there already and I've only known about it for about a month. We recommend the large chocolate mocha frozen coffee with one shot less of sweetener. (We like it a little stiffer) great place. Great hangout and they even have a drive thru for those hot arizona days when you don't want to exposure yourself to the sun for more than 2 seconds."}
{"text":"First time here today. I got the iced Raspberry Mocha (1 shot). It's pretty good with just the slightest hint of raspberry flavor. The service is phenomenal and the workers are extremely friendly. I will be back."}
{"text":"My favorite coffee shop in the West Valley! Chill atmosphere and wide variety of drinks. The pink hair lady is soo sweet and funny she makes my day! If you don't like your drink you can get it remade and the staff likes coming up with new things with you. I'm in love! Don't forget to take advantage of the free wifi."}
{"text":"Lovely little cafe! Looks like something you would stumble across in Hawaii or California, they have a beachy vibe. The coffee was out fast and really tasty! The breakfast was also great - especially for the price! We got the biscuits and gravy and the English muffin egg sandwich. Both were excellent! Highly recommend giving this local business a try!"}
{"text":"The iced mocha is the best I've ever had, nice and sweet with no bitterness.  This is a great little coffee shop with friendly employees."}
{"text":"Love this small business coffee shop! They have so many flavors which is great when getting away from the typical Starbucks drinks."}
{"text":"Depressed over the popular chain coffee shop that was out of product and unable to make me a caramel latte, I was sleepily driving home when Sunsational Coffee caught my eye and I pulled a quick U-ey and hit up the drive thru. Delicious rich flavor latte, friendly customer service, and double punch card Monday. Sunsational Coffee for the win! This tired mama thanks you!"}
{"text":"Chai = decent. Parfait = YUCK! 

I ordered a large vanilla soy chai tea and it was ready before my parfait. As I sipped my treat I recognized how nice it is to have an independent coffee shop in the far west valley finally! When I got my parfait I wondered how long they'd be open. The strawberries were \"topping\" strawberries smothered in that funky jelly. And I suspected the blueberries were previously frozen because they were nearly dehydrated and flavorless. 

Bottom line: they have a drive thru and I have two kids so I'm sure I will be back for coffee in a crunch."}
{"text":"I've been coming here for years and I can say I haven't found a better cup of coffee throughout the Valley."}
{"text":"My husband and I love this local coffee shop. I come here to work on work projects and for breakfast regularly with my husband. It's great!"}
{"text":"I tend to stick with the basics, and the Americana is perfect! Hot, as coffee is meant to be enjoyed, with a simple flavor shot or two.  

Sometimes I feel as though proper customer service gets overlooked if the product is great. Not here! They're always accommodating, polite, and conversational. 

The baked goods are yummy, but would love to see some gluten-free options in the future.

Remember: support local businesses!"}
{"text":"My girl really likes this place. Her favorite coffee here is the cherry iced coffee latte. She gets it sugar free with nonfat milk. Service here is great as they're friendly and fast."}
{"text":"Yummy, I loved Sunsational's iced coffee. The owner made the reasonably priced treat for me and included just the right amount of half n' half and sugar. Sunsational actually makes the coffee fresh for their iced coffee so it's just the right strength and ultra fresh. In addition to great coffee beverages, Sunsational has a wide selection of baked goodies, free wi-fi, and a laid back desert vibe. Head on over to Sunsational Coffee and you just might get a pleasant Surprise!"}
{"text":"This was out first time here and I came because of the good yelp reviews. Wow, this place is Awesome and the baristas are super helpful!!! They let me sample their white coffee and made me a special drink based on what I told them I was in the mood for! Great place and we will be back!"}
{"text":"I needed a quiet place to work on a lengthy project and am from out of town and wanted to find a local coffee shop. Yelp took me to Sunsational! I enjoyed an Americano and later the Southwest Chicken Wrap made by the owner. They were both fresh and tasty.  My day there was spent in this sun drenched coffee shop with the quiet hum of neighborhood customers coming in and out. I love a local experience! Oh, and I up and left my computer power cord and Kayla the other owner mailed it to me!  They had laid it aside with a note \"the woman from Tucson\". Thank you Kayla!  I'll be back."}
{"text":"Fun atmosphere, pretty quick service here at a small mom and pop coffee shop. I had an English muffin sandwich, with a mocha coffee which turned out to be pretty good. Certainly better than any Starbucks. 

The big question is this, do they compare to other small shops? Absolutely. It is a little tucked away but worth the trip. Enjoy yourself, read a book, browse the local artisan wares for sale and start the day right."}
{"text":"Tried this cute locally owned coffee shop today! I would totally recommend it! Lots of drink options and food items as well.. Staff is very accommodating and efficient! I will be back!"}
{"text":"The coffee is great and so is the service. The breakfast sliders are sensational. This is a great place to go to if you're in Surprise or Sun City."}
{"text":"Found this great local place while droppings kids at school across the street. They have a great selection if flavors and make some great lattes and holiday drinks. They also have tasty baked foods to offer as well. Found their coffee to be superior to Starbucks. Awesome drive thru service. Friendly family owned place. They offer punch cards and I keep coming back; scored a free drink!"}
{"text":"They have good espresso and a very friendly staff. Great local spot. They also have a drive through which is pretty cool. It's not too have a good place that is not part of a national chain."}
{"text":"We only had coffee here. Husband went one day and I went a different day. All I can say is the coffee is fair. We will not be going back. And we really wanted to like it since we love coffee and always look for local places.  Meh."}
{"text":"Over priced for the greasy food. The beverages we're tiny for a medium and weren't anything special."}
{"text":"I have tried this place 4 times, but am giving up on it. Service is very slow, their breakfast sandwiches taste like they came from a gas station, and they are too expensive for their quality of food. Staff is also awkwardly quiet and weird about things....like not wanting to allow you to put your own creamer in your coffee."}
{"text":"My husband and I have been here and had breakfast sandwiches and have also had their lunch sandwiches. Both were awesome with great service with a smile. Nice clean cozy place. The coffee is also very good with a lot of options. Just recently we stopped in at their drive thru and got coffee at 5am. How Convenient! Love this new local place!"}
{"text":"Great coffee shop in Surprise! Cool atmosphere, great customer service, and good coffee. Support a local a business and check it out!"}
{"text":"Best Surprise of my trip to Az.  Ha! I get the word play but seriously.  This review is long overdue as I was in town for Spring Training.  We stayed with relatives who don't own a coffee pot near by so Sunsational was our savior.  My wife and I hale from the PNW and while we are not coffee snobs we appreciate a good cup of Joe and that is exactly what you get at Sunsational.  Savior of my every morning for a week. We split of once and went to Dunken but I regretted it. Trust me... if you want good coffee and a decent breakfast sammie head to Sunsational you won't be disappointed."}
{"text":"Love this place.  we meet for coffee every Wed. morning.  Baked goods are fresh and nummy, coffee is fab!  Especially extra shot Wed.  Staff are some of the nicest people in Surprise!!"}
{"text":"Awesome local coffee shop with delicious menu items such as breakfast sandwiches and freshly baked chocolate chip cookies.   Free wifi available so you can mix pleasure with business on these days you telework.   Friendly dog-loving owners makes the service more homely.  We will definitely be making this our regular place!!"}
{"text":"I have tried over and over again to give this place a chance because they do have pretty good coffee, but every time I go there I get the worst attitude. I don't understand why, because I myself have been making coffee for years and know how people want to be treated on the other side of the window. I always tip, I always smile, but even the owner is rude to me. My sister who is a regular there even says to me, \"They're only like that when you come here. I don't know why they don't like you.\" The thing is, even if I were the biggest jerk in the world, I shouldn't know they don't like me. That's customer service 101."}
{"text":"Real nice place with a local cozy feel. Fair prices and good simple food. Service was very polite and quick. Ordered biscuits and gravy and a egg English muffin sandwich with coffee with almond milk."}
