{"text":"I revisited Supermodel after the bar last weekend. These were my findings:

The pizza is delicious after a drink or five. 

The place didn't fix the back wall or the general greasy feeling but a repaint to a sky blue did go a small way towards freshening the place up. 

I tried the poutine on the recommendation of several yelp reviews and I have to say it was one of the worst poutines I have ever had. The gravy was salty enough but looked like it came from a can. The fries were limp and soggy with oil and there were about 10 curds on the whole thing. I will never order it again."}
{"text":"I really liked the pizza there but the best thing going for Supermodels is the poutine! Delicious!"}
{"text":"there must be some trick, some something that people can do to make reheated slices better than they are.  i had just been spoiled (if i can even call having a good slice of pizza being spoiled) from pizza libretto at the kindness of a friend who bought for our group of people (we were at another bar and they let us bring it in).

but i was still hungry.  so we stopped in here and i had a pepperoni slice cut in two.  it was hot.  it was relatively thin.

i ordered well done fries with gravy.  the fries were golden brown and crunchy.  the gravy was fine.

the guy who served it was fine.

still cant get me passed the 2 mark."}
{"text":"A surprisingly good NY style pie.. at 1am, after \"lounging\" @ Tilt, which is to say.. probably NOT a very good overall pizza when sober. Interior has tomato sauce cans all over the joint. Pies here, displayed in in glass cases, are available by the slice, ready to go. They're reheated back in the oven slice by slice, also just like pizza joints in NYC.

Think a cross between a floppy NY slice and a chewier Neapolitan pie.

Their mantra is what kills me tho: \"Crust as thin as Supermodels.\""}
{"text":"I haven't eaten here much in the last couple years, though I pass it on a *double daily* basis. I don't really even consider it all that much anymore, when looking for some quick and cheap food. I think that probably says something. 

The pizza's alright. The location, as I said, is ideal. I remember my roommates raving about some really cheap special they had with poutine and a drink and  I recently noticed, from the sign I saw *through* the window, that they still have that. They must be doing something right, cuz they've been here longer than I have.

I think it might be the sign, with its ridiculous name and even *more* ridiculous picture of a BABY sitting in the pizza box!? What do any of these things have to do with each other??! Therein lies the reason I hope they never leave my neighbourhood. I love it now as much as I did the day I moved in."}
{"text":"Pizza places are all about real estate to me. Location, location, location.

This place has a good location because it's closer to me than most (although it is on the same stretch as 3 other pizza places), but they do actually have the thin crust going for them. Sometimes I don't want to eat a pound of dough at 2 am. This is where I go during those times in my life. Otherwise, I'll go to Gino's."}
