{"text":"Really good service actually. Keep in mind they only had a few customers when we came. Food is good too. I'm not sure if it's authentic hakka food but it's very delicious. Their curry is very very spicy so just be careful. We also had the sesame chicken and that was really good. Their meals come with a choice of soup,  spring roll or a drink. Their menu is either $6 or $7. Each portion is big! You have to share the meal. Came here 4 times already and each time was great. Definitely will come back and bring my friends to try."}
{"text":"I've only gone to Super Hakka a couple of times and I truly love it! The food is great, the customer service was good and interior is really cool. I believe they also deliver for a small fee. I stumbled across this restaurant because the restaurant beside it was packed! My only warning is that when they ask you if you want spicy or mild choose mild. The spicy was really spicy and my family and I can usually handle spice. 

Recommendation:
Munchurian Chicken
Chilli Chicken"}
{"text":"They have nice booths. Tasty food and great service. They get busy at times but that is just an indication of how good their service is."}
{"text":"Stopped by this place for dinner before heading to the movies on a Sunday night. This place serves indo-chinese(indian chinese)food. We got in and was seated at one of the booth, this gave us some privacy which was nice. There's a button on the wall where you can press when ready to order, have questions on menu or what not. We ordered vege pakora, tofu with mix vege cooked with black bean and  manchurian chicken with gravy. The food portion was big. We had lots of leftovers. The vege pakora was tasty, it had some heat to it. It's just slices of onion dipped in batter and then deep fried. Tofu with mix vege in black bean was good also. Manchurian chicken was ok, nothing special to write about. Staffs were fast and efficient at the beginning(weren't many customers) got slow later on as more people came in to eat. We had a good dining experience here, the price(reasonable)we paid for the amount of food we got makes the experience better."}
{"text":"Portion size is huge. But that does not bring down the quality. Recommend the yeung chow fried rice, chicken Pakora and manchurian chicken. Halal too. Would definitely recommend"}
{"text":"This restaurant may look like nothing special from the outside, but it has a very welcoming ambiance on the inside! We ordered the manchurian tofu with vegetables and the vegetarian hakka noodles. The noodles were absolutely delicious, and the tofu was good too. What to die for is the dessert - the deep fried banana with ice cream and honey. So good! The washrooms were very clean and nicely kept. And the family who owns the place are super nice :) Definitely worth going whether you're just in the area or making a trip especially for this restaurant."}
{"text":"Very cheap and huge portions!

But it wasn't what I expected as the food wasn't too tasty and it was just extremely greasy Chinese food in my opinion. Service was meh, had to wait quite a bit for someone to take my order but I wasn't expecting much.

Would make great drunk food if I was around the area again."}
{"text":"Called in and lady said they were busy it was an hour wait just to order.... I did not want that at all so I ended the call and was called back shortly after with her telling me that they could process my order right away and it would arrive in 45-60 mins (Typical for Chinese food delivery unfortunately). After waiting over and Hour I called back and they assured me it would be no longer than twenty minutes. Nearly another 40mins later I finally cancelled my order. I understand you are busy but this is such a terrible representation of your business and it's customer service capabilities. If you are too busy to fulfill the demands of your clientele, simply admit it up front and certainly don't try to backpedal to make a few extra dollars. I will never try and order from here again....delivery orders BEWARE! If I could've given no stars...I would've..."}
{"text":"I call for delivery but the dont do that . Can you please correct that . Not accurate information ."}
{"text":"Horrible service and horrible experience altogether on our yesterday's visit. The waiter was extremely rude not just to us but pretty much all the customers around. There was a party going on inside the party room and restaurant was pretty packed. Yet they only had 2 staff working. Waited about 35 mins for food to arrive. And another 15 to pay at the end as there was nobody at the cash register. We asked multiple times if we can pay because we wanted to get outta there buy nobody bothered. I don't even want to give this place one star but the food was okay nothing extra ordinary and price is very affordable . It wasn't bad either hence, the 1 star. I wouldn't revisit or recommend this place to anybody. Just not worth it"}
{"text":"One of my favourite Hakka restaurants. The boy and the young couple are really sweet. The old man at the counter is usually cranky. 

Only 4 stars because they only give you 4 fortune cookies for food enough for 6+ and you have to pay for the extras. They never used to do that before. 

Their food is good. Try their coconut ice cream!!"}
{"text":"This is standout place if you are looking for indo-chinese.  Ordered chilli chicken with extra spicy sauce and vegetable balls in hot garlic sauce. Service is super fast and they always attend you with smiles. 

Availability:you get seats every time even  without reservations. 

Price: pretty affordable , under $10pp."}
{"text":"This place has a good amount of food for the lunch combos. The menu has a wide varity of food.

It's pretty good food and I'd come again for lunch."}
{"text":"Excellent service! 
Competitive prices
Great food
I would definitely recommend this restaurant"}
{"text":"Interesting Chinese/Indian/West Indies mix.Large portions, food was decent and definitely worth it for the price. I would go again if I visited Toronto in the future. 

I would recommend take out over eating at the restaurant (might be worth it if you wanted to feed a large party good food for a reasonable price). Call ahead because they are a little slow."}
{"text":"Tasty food for good price and great customer service. Their chicken fried rice, spicy chicken and ginger shrimp are delicious and you can choose how much spicy you want your food."}
{"text":"We had a family dinner last week. The waiting staff was good. But the chili chicken was not great at all, compared to other restaurants. When we requested Tea, it took about 10 -15 minutes before they showed up, and we had to call and remind them. I wouldn't recommend the restaurant. Parking is very little, and crowded. Side of the restaurant.
But I would say the portions are big enough for 3. Very oily, it seeps.
My view of the restaurant is clean though. But I would't go again."}
{"text":"The food was too tasty, the portions were too generous and the service was too prompt. 

This restaurant  deserves a 10 out 10 rating."}
{"text":"I came with mediocre expectations of Super Hakka.  This restaurant managed to destroy even the most mediocre of expectations. 

In restaurant:
Semi attentive staff, too busy with themselves than the customer, and yes, they do have their favorites who they will get to immediately, since we were new to this restaurant, it seems like we did not make the favorite customer list.  I have not seen service this spotty since Jack Astors first restaurants in Toronto. 

The food:  Let's start with the menu, all the repasts that you expect are here, there's a plethora of choices.   The food is satisfactory at best, watch your plate, you may end up with chilli chicken instead of chilli beef, manchurian fried rice is not what you normally expect and the dumbed down versions of chicken pakora sold here are, to quote a teenager \"meh!\"  Portions are large, typical hakka family style.  The biggest gripe is the staff working there, they have no sense of customer service or the concept that diners waiting long enough will eventually lose their appetite.  Compounding this further is the fact that the staff at this restaurant consider restaurant with 12 customers to be \"really busy\".  Don't get me wrong, the food has some brilliant moments, however, this is far overshadowed by the abysmal service. 

Additional services:  This restaurant touts that they deliver, this is NOT the case.  I have logged no less than 6 attempts at trying to get delivery, out of 6 attempts, delivery was made ONCE.  Of the one time that they did deliver, I received, once again, chilli chicken instead of chilli beef, they also leave fast hence you will not have a chance to verify albeit, the driver was quite friendly.   Of the other 5 times I called and asked for delivery, I was told they will not deliver because they were \"too busy\".  Hence that is 5 times that orders no less than $60 plus tips were passed up, sound business decision?  I think not.  Think about it, if the service outside the restaurant is this bad, why would you even want to go in?

So it's one star at best and I will extol that Yelp does not allow zero star ratings contributing to my quite generous rating.   If you are looking for a restaurant that exemplifies the fact that service can be thus bad that it will overshadow the food, look no further, Super Hakka is exactly that place."}
{"text":"Amazing! I would go back here again, the food was amazing and large portion sizes. I really liked the privacy booths with curtain, i feel like the decor is great but can be better and the restaurant has alot of potential to be just that much more better!"}
{"text":"I had high hopes for the restaurant given the great ratings it had on Yelp, but I was sorely disappointed.

I ordered the crispy beef & chicken pad thai.  I really, really love pad thai, and I'm not overly fussy about it, but the pad thai was really awful.  I had maybe 5 or 6 bites of it before I gave up on it.  It had a strange orange-y flavour and the noodles were very, very overcooked to the point where they were mushy.

The crispy beef was *not* crispy in any way; it was more chewy (and not in a fresh, normal way - more soggy-ish) than anything else.  That being said, the flavour of it, despite the texture, was quite yummy.  Also, when they tell you it's spicy, they're not kidding.  Not TERRIBLY spicy, but definitely has a good kick to it.

The one thing I do agree with the other reviewers about is the portion size.  It is GIGANTIC.  Lots and lots of food for your money.  I'd just say DEFINITELY stay away from the pad thai."}
{"text":"Just okay. Still trying to find a place that serves spicy crunchy delicious chicken pakoras. Unfortunately this was not it."}
{"text":"Awesome Hakka food and great quantities too! 

We tried the Chicken Manchurian and Chilly Chicken, most places these two dishes end up tasting very similar but not here. There was a distinct difference is taste and boy did I love the chilly chicken! It's spicy not fake spicy! We also tried the veg Hakka noodles which was good but I preferred the egg fried rice we had ordered. 

We placed an order for 4 dishes and the quantity will blow your mind away. We ended up having to take it all home and it lasted for 3 whole meals. 

Definitely worth a try and more. 

Ps: The service is speedy so don't expect a lot of conversation. The owners did however show up at the end to ask if we enjoyed the meal."}
{"text":"The food is decent, I had the yung chow fried rice, which was passable- lots of ingredients and a huge serving, but lacked flavour. My partner had the Bombay fish which was flavourful but a bit too oily. Price was great, after tax and tip it came to $24 combined. The service was very slow and disorganized. While going to the bathroom they removed our water. When we returned we had to ask for it again. Then they only brought the jug and no glasses. My rice came quickly but i had to inquire about my partner's fish, which in the end came 30 minutes later."}
{"text":"Open late andfood is good,my fave are honey garlic chicken and hot sour soup chicken, very tasty and not greasy, large servings... As in large!!! Bring a group when you visit this place! Yeong chow fried rice can feed an army! Highly recommended"}
{"text":"Great fresh food, with great prices!  Not too oily, no too spicy (can be if requested) and such a great lunch deal!  Enough parking, big enough place to not feel cramped up like most hakka places.  And the taste is outstanding!  Fresh ingredients, with freshly cooked food and great service.  Area isn't the prettiest, but the food is FANTASTIC!HIGHLY RECOMMENDED and will be a loyal client.
I've been to many other hakka places and this one tops them all.
BTW - Pakora's are red."}
{"text":"This place is the best embodiment of the fusion culture it represents and services the needs of this South Asian clientele perfectly. 

The dishes could easily be on the menu anywhere in Pakistan and India. And are prepared with that community in mind. With  Manchurian on sizzler and Bombay chicken with fried rice, this place has all the Hakka essentials.

There are booths for privacy and the decor is 'understated family restaurant'.

The price are extremely affordable as you would expect with a family restaurant in Scarborough. 

This place is great value, it serves it's purpose well and is worth the drive. A near perfect restaurant."}
{"text":"Had the following dishes:
1. Chicken Pakora - very delicious big pieces of chicken pakora. They were juicy and tender. It also came with a dipping sauce which I really liked.

2. Manchurian Fish (Gravy) - I wasn't a big fan of the batter they used on the fish. It's similar to the batter used for fish and chips (but a cheap one) and it becomes soggy with the sauce. However, the fish was ok and the sauce was really good.

3. Bombay Chicken - really liked the bombay chicken. The chicken were bit size pieces like 1-1.5x the size of a popcorn chicken and nicely breaded. It went really well with the gravy from the manchurian fish.

What I really liked here was that even with two deep fried chicken dishes, I didn't feel the oiliness and the unhealthiness that I usually get from other hakka places.

The interior was really funny as it's completely japanese restaurant inside."}
{"text":"Are you looking for Hakka food? Cheap good food can be found here. Super Hakka combines great food at a low price, and provides a unique Japanese seating exoerience.  I ordered their chili chicken,  shrimp pakora, chili fries, Bombay chicken, chili veggie mixed with tofu and veggie pakora. This place is comparable with Fredericks with their chili chicken and pakoras. Their service is fast,  food is fast, food tastes great. I love this place.  Their menu is vast and also has Guyanese food."}
{"text":"I've been going to Super Hakka since they open and there food has always been delicious and consistent. Huge portions. One plate can easily be shared between 2-3 people.
I haven't tried there Thai food but Hakka Chinese is on point. My recommendation is the Bombay Shrimp. Spicy and delicious! Make sure you order that when you go there :)"}
{"text":"I never knew thee was a restaurant that was Chinese, Jamaican and Indian fusion food!! This place was definitely best of all worlds. I went here last night w my bf and some friends and we for our own closed off booth with the a curtain which I love! It made it seem very intimate dining experience. What was also great is the button system where if you need anything like water, food, etc. you just need to push the button in the wall for service which is a neat feature. The price is amazing considering the size of all the food we  got and having major amount of leftovers. This place is definitely worth a trip to scarb!! Fave was the ginger beef on the menue!!"}
{"text":"The food was fantastic.   The prices were low given the amount of portions.   I recommend the Chilli Fish - dry.    Also excellent was the Manchuria Chicken."}
{"text":"My parents and I got takeout from Super Hakka recently and I am in love with this place!!

So they have really awesome lunch specials ($5.95-$6.75) where you get to choose a main course and either a vegetarian spring roll, chicken hot and sour soup, chicken corn soup, a can of pop, or a cup of tea.

So we got a Chili Chicken (dry), a Chili Beef (with gravy) and a Chicken Cantonese Chow Mein (they were $5.95 each).  We chose 2 chicken hot and sour soups and a chicken corn soup.  We also got an order of Chicken Pakora (12 pieces for $8.75).

The portions are huge!  I am a voracious eater and I couldn't finish a portion (!) 

The Chili Chicken was delicious.  The chicken was lightly breaded and deep fried.  The chili flavour was intense and wasn't just on the outside, the flavour penetrated the meat.  I could eat this for every meal for a week!  

The Chili Beef was not battered, and it was covered in rich gravy.  The beef was tender and the gravy was not too salty.  It was excellent but I prefer my Hakka Chili dishes dry instead of with gravy.

The Chicken Cantonese Chow Mein was very good.  Lots of chicken breast meat, and veggies (broccoli, carrots and mushrooms).  The sauce was not too salty.  The noodles were nicely done.

The Chicken Pakoras were big (like the size of a golf ball) and full of tandoori chicken meat.  They were a little greasy, but that is the nature of this dish.   

The chicken hot and sour soup was so good.  It was really spicy and full of stuff: cubes of chicken, cubes of tofu, bamboo, carrots, and black cloud fungus.  The broth was the right thickness, not too runny, but not too gelatinous.  I did find a strand of very long straight black hair partially sticking out of the soup though.  Yes, this is gross, but it was definitely a head hair and not hair from other parts of the body (I shudder at the thought of the latter).  And the food here is so good, I just put the soup into a microwavable bowl and microwaved the heck out of it (after I removed the hair).  Apart from the ick factor with regards to the hair, this hot and sour soup was probably one of the best hot and sour soups I've ever had.  The kitchen staff really need to wear hair nets!  

Anyway, the food was really good and the prices are awesome.  I'm hoping the hair situation was a one off.  Minus one star for the hair thing, if it wasn't for that this would be 5 stars for sure!"}
{"text":"Great food at very good prices. Service ok, but food was served fairly quick. Not fancy, but still a nice little joint to check out if you're in the area. Has booths for privacy.

Manchow soup - ginger based, medium thickness & very spicy! (Tastes different to that famous flavour you get in Mumbai) Generous size - medium bowl with shrimp & chicken @ $6.50 would easily feed 4. 

Bombay chicken (a.k.a chilli chicken) - delish! Usually a winner for me as the fennel plays off the chilli and cilantro, giving it great depth of flavour. I ordered it less spicy as it's usually hot! This is a dry dish (think pakoras) if you order it solo rather than in a dinner combo so ask if you want it 'wet' (saucy)! I didn't know this beforehand so my rice was pointless - might help if they have the option on the menu or ask when you order. Still enjoyed it and wasn't oily as I've found elsewhere."}
{"text":"We are downtown people and went all the way to Scarborough (!) to get some Hakka food. 
The food was okay. I was pleasantly surprised that they had Caribbean food on the menu as well, that is not something I have seen offered before, and the chow mein with a Caribbean chicken leg plonked on top was delicious. The corn chicken soup was also amazing. 
The other food was alright, definitely not the best Hakka I have had. We ordered the veggie pakoras which were surprisingly disappointing. The chili chicken and dry beef and shrimp were all okay, but not great. Definitely watch out for them if you don't like spice - they have a serious kick. 
The price was great, though. Really well priced. 
The waiters were very kind, as well, and we got a room to ourselves without reservations, which was a plus."}
{"text":"The food is extremely affordable, not too hard on the wallet. Giant portions, quite generous servings. Food is savoury, and there's a large range of options to choose from.

Major con-greasy food, you could see and taste the oil and grease that's used to cook your food. 

Not something you would wanna eat regularly, but if your looking for something cheap and quick on the go and craving Chinese this would be the place! Your typical Chinese take-out."}
{"text":"Super Hakka Restaurant is far the best Chinese restaurant I have ever been too! I can't believe how affordable their food menu is. The food portion is huge than expected and it's completely fresh. The lady in the counter is super nice and helpful with the menu options they have. Overall experience was wonderful. I would definitely come back to super hakka."}
{"text":"First impressions of this restaurant were that it is a very calm and relaxing atmosphere 
Soft music in the background 
Clean, simple yet welcoming and comfortable decor
Booths closed off a bit with small curtains which blocks out a bit of noise and gives diners a bit more privacy  

Items I've tried:
~I ordered my pad thai to go and the service was quite fast. The quality of the food is excellent; good flavor, and generous amounts of the vegetables that go with the pad thai. The spring roll that came with my dish was nice and crispy and not too greasy
Other visits to the restaurant:
~Chilli beef which we ordered spicy. Seasoned beautifully, generous sauce on top of the beef slices and just enough onions
~Mixed vegetables with a spicy sauce and it came with a good portion of white rice. Again, seasoned well and came with a good variety of vegetables
~Fried rice with shrimp. Delicious, well seasoned
~When we ordered the lunch specials, you get a choice of spring roll, and a drink of your choice. I chose the tea which is a nice light green tea and they give you a whole teapot full. 

The portion sizes are quite large; great for sharing and you save some money that way. Their prices are decent, I believe a bit cheaper than a lot of the hakka restaurants I've been to. 

Service was quite efficient. When you are sitting down, there is a button you press which rings a bell and the waiters always came right away. Everything there just seemed very organized. 

Overall, I would definitely recommend this restaurant. It has authentic dishes and also some non-traditional dishes so it caters to different tastes. Best things I could say overall about the dishes are that they are well seasoned and well balanced with ingredients. Definitely one of the better Hakka restaurants that I've been to."}
{"text":"This place was a surprise .. I was craving indo chinese food and found this place after a quick yelp search. Portion size - huge , fried rice can easily feed 3 adults , quality is great nothing fancy, flavor- awesome it was bang on in terms of indo chinese flavor, price - super affordable. Huge selection !! Will definitely visit again!"}
{"text":"My favourite hakka place in Scarb. I'm not crazy about the area and the plaza that it's located in. I've never dined in here but always get take out. Everything I've tried is very good, esp the Crispy ginger beef and crispy ginger chicken. Their seafood dishes are good as well! Prices are reasonable, portions are good, staff are friendly and fast."}
{"text":"I have to say, I was a little hesitant to try a new place I knew nothing about. I definitely will not be as hesitant in the future, the food was delicious! We wanted to try something new so we settled on this gem. 

It wasn't too busy for a Monday night and the teen ? Guy that seated us and took our orders was very quick and pleasant :) We were seated in a booth with a shiny copper curtain for added privacy. 

We ordered Bombay chicken dinner combo, shrimp fried wontons and a sizzling plate. So yummy :D

The service was really good, food came out promptly and the portions were so generous! I think it's a family owned restaurant and the food really gets the spices and rice just right. 

Definitely will come back !"}
{"text":"I'll keep this short and sweet. Great food, great prices, large portions....it's as simple as that. I recently discovered this place after frequenting another Hakka restaurant in the area, but this will defintiely be my goto spot for hakka/chinese food hands down."}
{"text":"I was utterly disappointed with my order- got the shrimp with lobster sauce and cannot believe they consider that food. First off, the shrimps were those cheap ones with shit still in the backs- the broth looked and tasted like puke and the customer service was horrible- NEVER AGAIN- sticking to Spicy Dragon if I want Hakka!"}
{"text":"The food they serve is pretty good. Especially the Fish Pakora with the sauce. One of my favourites. But, the customer service isn't all that. We asked for a drink and the waiter completely forgot about it. We asked for the dessert menu to order some dessert and the waiter didn't even come back to check if we were ready to order or not . Both times we had to go look for someone to ask for something. This shouldn't be the case."}
{"text":"Great Food. Decent service. I always come here because the portion sizes are rather large. I highly recommend this Hakka establishment over others due to the fact that they offer larger portions for the same price as opposed to other Hakka places. The Bombay chicken would have to be my personal favorite but there are lots of other good dishes such as Crispy Ginger Beef, Hakka Noodles, Chicken Pakora. I also love their deep fried banana served with ice cream."}
{"text":"The owner (lady) is so rude, I work next door to this restaurant and I will never go back, a paying customer should not be spoken to the way this ghetto woman speaks.  

Food - Not sure how you can mess up fried rice but they did it.

Note to owner, i asked for hot sauce and green chilies with my order and she gave none, when i picked up my food she said not with lunch, now as a patron let me say even if your taking food out of this ghetto restaurant and you want it to your liking order it as sit in add your chillies and red sauce and then ask them to pack it!

Never ever again, go anywhere else, i mean anywhere please"}
{"text":"Service was friendly, food was tasty, portions were huge. My girlfriend and I were seated in a korean-esque enclosed booth with a button to call for service. We ordered a chilli chicken, which comes in dry or with gravy (we tried the dry version and it was delicious). We also ordered the beef ho fun, which was good, we liked the chilli chicken more. Lastly, we had the green beans, because hakka green beans are awesome. These did not disappoint. 

Definitely worth your while to check them out!"}
{"text":"Favs. Beef ho fun w/ black bean sauce, chicken pakora and Bombay chicken.   Portions are quite ridiculously large...tough to avoid a mess (Not a complaint).  Not intended for healthy eating, but if you are jonesing for a lot of flavour, this is the place. Sucks they no longer deliver."}
{"text":"We ordered cauliflower Manchurian. The cauliflower florets were rotten. Didn't want to argue. Made our stomach upset the very night."}
{"text":"went there last week, what an awesome experience!! first of all great customer service they provided us at our table , the dishes we ordered, came within 15 minutes not even late.  everything we order was very tasteful and excellent such chicken manchurian, hakka noodles, chicken fried rice, lollipop chicken, and chicken corn soup dishes were excellent. Everyone shoul and muct try this place. Thumbsup."}
{"text":"I have only eaten Hakka Chinese twice in my entirely life. The first experience made me scared to try it again and the second well was pretty good but again reluctant to give it another go.

Well that has all changed. I ordered from Super Hakka last night as I had guests that were in the mood for it.  Found Super Hakka on Yelp and decided to take the plunge glad we did.

Order was Manchurian Chicken, Chili Beef, Szechuan Fried Rice, Chicken Fried Rice etc.

Food arrived on time. The first thing that we all noticed were the extremely generous portions. Extremely HUGE. The fried rice container was so stuffed rice was spilling out.

Overall really great experience."}
{"text":"Superb service, fresh ingredients... But oh the MSG. Holy Buddha the MSG.

China Cottage, Lin Garden, or Good Luck Chinese are all nearby and manage to make better food without it."}
{"text":"Food is always good, fast, and portion sizes are huge! Curry chicken spring rolls are very good! Always get extra spicy anything I get"}
{"text":"Honestly the food is delicious and the portions are huge. A plate of fried rice and a meat dish will be enough to feed 4 people easily. That being said, the service is horrific and leads a lot to be desired. 

The waiter me and my friends had was very rude to us when we requested to have our plain rice to go. He told us not to eat it in the restaurant and he said it in an angry way. I do not understand why this is even an issue to begin with. If we wanted to eat some of that in the restaurant, he should not make a big deal about it and let us be. 

Honestly when I think about it, I will just do takeout from this place from now on. The restaurant interior is nothing amazing and its too loud and crowded with so many families and big groups."}
{"text":"We have had super Hakka reliever in the past. However, we called in and they told us that they do not deliver and did not offer any reason. I am unsure if they chose not to do so anymore or they chose to not do it tonight. I am very disappointed in their level of service and will not be ordering from them again. 

Also, they still say that super Hakka delivers on Yelp."}
{"text":"Late night, best after a long day slaving away in my own kitchen at work. Reasonably priced, very much so. Great food, honestly, can't say enough. I was a fan of China cottage, but it seems like the quality there is hit or miss. Super Hakka is very consistent. People are super nice there, take-out orders are always correct, never a mis-step. I really enjoy this place, it's close to home and although, not a super easy to get to stop, worth the destination IMHO. If you around the Lawrence and Pharmacy area, please, do yourself a favour, check this place out. I do not think you will be disappointed. Favourites include: Hot and sour soup, proper. Chili chicken, dry or wet a must, and tonight i had the curry chicken spring rolls. Rolls, a little bit like crack, so goood! Packaged sauce a must, plum I think, but the perfect mix of sweet, spicy, savoury crunch, holly s**t, so good. Give these fine folks a go, they are the real deal!"}
{"text":"The food is good and joining the long list of great hakka restaurants in Scarborough. 

If you are interested in hakka food and looking for a first time experience, this is the place.  If you know hakka food and have never been to this restaurant, I would recommend as I have already dined at Super Hakka several times and the experience is the charm of a family run business.

The comforts of chili chicken and any pakoras is done right at this restaurant."}
{"text":"This place has a cottage feel to it with glittery curtains available at some booths. The service isnt the best tbh. Communication isn't clear but they make up for it with the exceptional food portions and quality of food which is amazing 
I had their manchurian chicken w gravy and manchurian fried rice w chicken. Came to $20 for me and my friend but I went home with enough food to feed two more! 
Really do get bang for your buck here"}
{"text":"You better be able to take a bit of spice if you decide to come to Super Hakka Restaurant. I loved the portions. It was huge and we had to pack a lot of it home. Price was very reasonable as well.

We tried....
Chicken Pakora - This was prob. my favourite. It was perfect and crunchy on the outside. Tender on inside
Spicy Eggplant - So much sauce! Order some plain rice with this. 
Singapore Fried Rice - I love my rice. Got a little spice to it. 
Ginger Chicken - Tasty and also had lots of sauce. 

Service could have been better. The owner was nice but the other waiters seemed moody.

High chairs available but it was a bit dirty. Luckily we had a cover. Parking can get busy."}
{"text":"5 things I like and don't like

1. Chili Chicken: The staple hakka dish, and the chili chicken at this establishment is better than a lot of the other hakka restaurants. Delicious sauce, great chicken, and awesome flavour.

2. Service: You're very likely to get your order in 10 minutes or less, even if you ordered a huge amount of food. 

3. Interior: The arrangement inside is such that there are tables all along the middle of the restaurant, but the tables on the neighbouring sides are all in booths. This is not supposed to be a intimate restaurant (for example, you wouldn't really bring a date here) so I'm not sure why it's closed off.

4. Price: Can't go wrong with the price on any of the dishes. If you wanna save some cash, you can grab one of the lunch specials ($7-$9) which will still give you a whole ton of food for a low price.

5. Convenience: Super Hakka is open basically every day of the year, so if you ever wanna grab, say, a nice chili chicken or hakka noodles meal on a holiday, you'll definitely be able to do so. I've had food from here for the past few Christmases which was great considering a lot of other places were closed."}
{"text":"A really bad service and the waitresses have a lot of attitude while talking to costumers. They keep asking for bill before you finish eating like they think you stealing or something."}
{"text":"I'll start off by saying that I wasn't very impressed with this restaurant. My boyfriend had been telling me for so long that we should try Hakka and this one happened to be close to his house, so we decided to go. From the outside, the place looks just as dingy as it does from the inside. However, I have had some great food in places that haven't been renovated in centuries...so I didn't judge and was still pretty excited. 

We were seated and told we would be receive some help in deciding what to get, since it was our first time dining there. Well...we waited for about 10 minutes and no one came to see us. I started getting frustrated and finally my bf flagged down the only waiter on the floor. It felt like he wanted us to order really quickly and wasn't of much help unfortunately. So we ordered one vegetable corn soup, hot and sour chicken soup, thai red curry chicken (I had been craving it all evening) and the manchurian chicken. 

The soups were both very big portions and we're pretty tasty. The thai red curry chicken wasn't too bad, but felt too gooey in my opinion. Nevertheless, I liked that there was an assortment of vegetables in it (broccoli, eggplants, etc). The Manchurian chicken was very fried and pretty oily, which is okay considering the type of food on the menu...but I couldn't eat too much of it. It tasted okay, but it was just too oily for my liking. 

Overall, the service was really slow and at times we felt we were invisible. The food wasn't anything special to rave about, but it's a good late evening place if you're craving fatty spicy foods. I am definitely going to have to try another Hakka place before I cross it off of my list of cuisines."}
{"text":"Good cheap lunch. 5.50 or 6.50 depending on the item and comes with either a drink or soup. Food was decent, portions were huge, and service was fast."}
{"text":"Out of all the Hakka places I've been too, I think I have to give these guys the trophy. They hit all my categories and I come out leaving super happy every time.

Price Range(Not including tax and tip) : $8-$12 per dish. Which is on par with most Hakka places but I would say it has better bang for your buck because of their large portion sizes. 

Food Quality (Taste/Serving Size) - 5/5
I've had a variety of dishes here and whether its chicken, paneer, noodles or rice, everything is full of flavour, and cooked well. I never find their dishes too saucy or too dry. The portion sizes are the best of any hakka place I've been to, I've always had to bring food home because of how much you get.  In their meat dishes, their protein to veggie ratio is always amazing, way better than any other hakka place. For the most part their dishes aren't super oily so you don't feel terrible after you finish eating. 

Atmosphere - 4/5
This place use to be a sushi place and they kept the design so it has a dated Japanese look but I like it because it looks classic yet comforting. The restaurant has a lot of seating so it works well for large groups, though booths will only fit small groups. I wouldn't recommend it for a first date haha but it is a great place to go with your long time partner. There is a big parking lot but there are a lot of restaurants in this plaza so depending on the time the parking lot can get crowded. 

Service - 3.5/5
For the most part their service is good but there are times where it was mediocre. Most of the staff is very nice, will come check on you regularly and the food gets to you really fast every-time. One weird thing was one of the owners/managers said I couldn't pay credit card for the special and it was only cash or debit which was weird to me. Other than that I would say the service has never deterred me from going and I've felt valued for the most part. 

Would I go again?
Absolutely, no questions asked. This is my go-to Hakka Spot. 

Lash's Recommendations 
Chilli Chicken - If you're looking for something classic and spicy to satisfy your taste buds this is the dish for you. You can choose your preference between wet and dry, I like both. 

Sesame Chicken - I'd recommend this if you want something slightly sweet and very crispy. 

Mango Chicken - My favourite dish when I'm looking for something that is sweet, spicy and crispy. 

Chilli Paneer - If you're veggie, I'd recommend this dish as it has great flavour, spice and is guaranteed to have you full. This also has the wet/dry option, I prefer the wet option."}
{"text":"Went to this place couple days ago with my brother Charles Ingalls ask for gravy food came it was sooo much gravy he needed a spoon to eat his special lunch."}
{"text":"I like their menu they have everything there. 
Best food for cheap price!
I always order before I go there and take everything ready. They never make mistakes good customer service."}
{"text":"I love hakka food, and this was a pretty good example of it at a great price. No one is kidding about the serving sizes - we went in absolutely starved and shared a lunch special chili chicken (which comes with a spring roll for all of $5.50!) and were hardly able to roll ourselves out. That big of a plate of food. What I love about hakka is you get a really nice complex spicey sauce, this was a bit one dimensional, I've defiantly had better but also a lot worse so it was still good in my book. The décor is quite nice for this genre of food, albeit hilariously Japanese but I'm not complaining! We were going to take it to go until we walked in and decided to stay. Quick, tasty, cheap, what more could you want?"}
{"text":"I've been to many hakka restaurants throughout my days, around the GTA and beyond. This is probably the most authentic by far.

Been coming here for some years now, not too long after they first opened. I'm usually here for their lunch specials starting at 5.99, 6.99 for more \"premium\" dishes. It runs from 11-3pm. I understand usually hakka restaurants are famous for their chilli chicken, Manchurian chicken, or pakoras, but I found trying out other things on the menu sometimes pays off. Chicken with mix veggies is my new usual there. Full of healthy veggies and taste delicioso!

I have only dine in here few times, but their decor is interesting. It is not too bright, and your table would be in a box-like atmosphere. I think it's pretty cool, but if you are claustrophobic, perhaps you ought to consider take out and eat at home. Or the parking lot. Your call.

As for the service. Great people! Honestly. Nice little family run place with some nice people all around. Their behaviour actually kind of reminds me of our family.

Keep in mind to bring cash if you have any. Like many Hakka places, you'll be charged a surcharge for card usage."}
{"text":"I went here on the reviews I read.  I've been to 3 or 4 Hakka Chinese around here, and this was hands down the best.  Everything was delicious, from the seafood hot and sour soup (never saw it in seafood), the fish pakoras, the crispy ginger chicken and the Bombay chicken.  Nice flavors, and they can tone down the spiciness.  Obviously a former Japanese restaurant, we sat in a little curtained off booth, of which there were several.  Great service.  Be warned, this is in a really dumpy (dumpier than usual for this area) strip mall, but once inside it doesn't matter."}
{"text":"I ate here the other day. The chilli chicken was good and the order came in quick. I don't think I even waited 10 minutes, I don't know if that's a good thing or not. The food tasted good, some sketchy pieces of chicken in my order (chewy with no meat). Definitely not the best Hakka food I've ever had but not the worst. The place looks a bit worn down, the wall paper in the booth I was sitting in was coming off the wall. Aside from all that, it wasn't an awful experience and I would come back again to try other dishes. If you are in the area craving Hakka food, do stop by."}
{"text":"This was my favourite restaurant for Hakka Chinese until today. The lady/owner/order taker talks way too fast, doesn't understand english properly and took a wrong order. We brought the food home without checking and trusting them to give us the right food. When we called them after getting home, another order taker asked me to bring the food down and they will replace it for us. Minutes after the lady calling me back and starting arguing that I ordered wrong food and rather understanding she started laughing at me over the phone and said she will not take it back. WORST CUSTOMER SERVICE!!!"}
{"text":"I eat here often. It's my go to Hakka spot, especially past 10 when close by China Cottage is closed. The food is good, no complaints but to be fair I'm not a Hakka snob. It just tastes good and there's lots of variety. The decor is kinda dated but it kinda adds to the charm of a budget Hakka place and it's intimate. Tip is charged on the bill so be aware of that and if it's busy, the owners will rush you out. That's why I knocked a star off. Other than that, it's all good."}
{"text":"Before I dive in here, I need to say that I've never set foot in this restaurant. My husband was on a suburban man-date, and I asked him to bring me home some take out. I did eat their delicious noodles and soup, so I'm going to go ahead and share my Hakka tale! 

I texted my man and asked him to bring home some food for me, too, and I was delighted when I found out he was heading for Hakka. I love Hakka food. I'm ignorant to the exact details, but it's my understanding it's curry-infused Chinese from a specific region with really delicate flavours. He brought me home a huge portion of Hakka noodles and a hot and sour soup, both were delicious and massive. I was worried he'd over spent \"how much was this?\" 

$5.50.

Yes, that beautiful number gets its own paragraph. Between 11am and 3pm you get one huge item plus a soup for $5.50. Now that's one hell of a lunch special, especially since it was so large it stretched through lunch, dinner and a midnight snack."}
