{"text":"I originally wanted to go to Toji Sushi next door. This place only had one other review and no pictures, and tbh Toji had better decor and I wasn't gonna risk it. 

However, I stood in Toji Sushi's door for a very long time and their staff was busy doing something indiscernible near the bar. Essentially, I was being ignored so I walked two shops over and went to Sushi Osaka. 

I absolutely do not regret the choice. 

The shop is super small and run by a very nice old lady. The furniture and decor may not be top notch, but it does the job. 

The food is reasonably priced and their lunch menu having lots of variety. 

I got the sushi lunch - 8 pieces of sushi and 6 California rolls. Comes with soup, salad, drink for $12.95. 

Also it tasted delicious. 

5 stars because the food was tasty and they really didn't do anything wrong at all. They just have the disadvantage of being beside a  bigger, more known and funded Toji Sushi. 

I'm sure either choice is good, but don't disregard Sushi Osaka just because it only has a couple reviews. 

Great experience, would definitely come back :)"}
{"text":"Great food. Big portions, fast service. Owners let us stay some time after closure. Will come back 4 sure"}
{"text":"This place is THE CUTEST. Our server was so polite and adorable. She served us in a timely manner and our food was delicious and fresh. I had the Sashimi Dinner which was 16 pieces of assorted sashimi with rice, miso soup, and salad, along with the seaweed soup. The seaweed soup was warm and flavourful. It was a cold night so it was really nice to have a bowl of hot soup. The miso soup was great, and served in a little cup so you could eat it without a spoon. I liked that they had that authenticity.
The sashimi tasted great, I liked the assortment although if you're looking for a \"sampler\" type dish, this is not it. It had mostly salmon along with white tuna, red snapper, and octopus. All of the fish were very good. The rice was warm and tasty.
This place would have gotten 5 stars if my stomach hadn't started acting up later that evening. Regardless, I'd give it another try since everything was so delicious and I can't be 100% sure my stomach pains were from what I ate here."}
{"text":"This place has become our Goto place for dinner these days. Amazing Dolsit Bibin Bap. Must try! Goes very well with Chinese tea"}
{"text":"I like this mom and pop sushi eatery in The Kip area. Pleasant music, good service, food is good. I come to this area twice a month and always have lunch here. Not real fancy but I like it. (I also didnt have  great experience with customer service at the other sushi restaurant next door and won't be going there again.)"}
{"text":"Sushi Osaka is a nice little family run restaurant on Dundas in Etobicoke. The place itself is rather small, but has a nice interior. Menu is heavily Japanese with some Korean dishes as well in the back of the menu. 

I had the chirashi, with a side of spicy crab maki. Others in my party opted for pork bone soup, bulgolgi, and bibimbap. The chirashi was nice done and I did not expect to get that much rice (which I actually like, because it made me full). Even though there was a good bed of rice for the dish, there was also plenty of fresh sashimi as well. The salmon pieces were nice and chunky, while the white fish and crab meats were pretty good too. Sprinkle a little light soy sauce all around and you've got yourself a damn good meal. The spicy crab roll was good, but not the highest of quality. Definitely filling enough with the chirashi. 

Food is good, while the prices are a tad higher than some would like. However, service was very friendly and the place is rather nice. It's worth a look if you can't decide between Korean or Japanese because it is a nice mixture."}
{"text":"Solid casual sushi restaurant!

Didn't try the sashimi, so can't validate quality of fish, but rolls and tempera were decent.

Service was quick and polite. Will come back again, especially for lunch special which was surprisingly filling."}
{"text":"Reasonably priced and very tasty. Spicy bulgolgi and dolsot bibimbap are my favorites. Sushi is very good as well."}
{"text":"Their customer service is great ! Their food, however, is sub par. 
My friends and I ordered a bento box, dumpling soup, and pork bone soup. The bento box contained sushi that had way too much vinegar in its rice. The soups were incredibly salty - pouring hot water into the soup didn't dilute it one bit. 

Overall would not recommend."}
{"text":"This sushi place is the best, it's tasty, delicious and many words to describe it. We go here all the time and the service is amazing the food is mind blowing and I recommend his place fairly priced and it's worth it."}
