{"text":"My go-to sushi restaurant. The food is awesome, there is a great selection, the wait staff and kitchen are friendly, the prices are fair and there is always a table for you without a wait. My little guy even loves it, he orders the katzu chicken.   Get the grilled calamari app, it's the bomb."}
{"text":"Delicious! The surf and turf roll was awesome, but the tsunami roll was better. Best sushi roll I've ever had!   But the real reason for this review is the bartender. He was awesome. He said he's there for saturday nights and poker during the week. He made awesome drinks, kept us entertained, recommended awesome food choices and we enjoyed his company through the meal. Everything was super fresh and quick. Will be going back on a Saturday night for sure!"}
{"text":"The best sushi place of lake Norman. Food is fresh and price is reasonable. Great bar area great service!"}
{"text":"Best sushi and currently under \"repair\", so please hurry back and know that there is NO OTHER sushi like yours in town...you are super great people, running a super tasty wonderful restaurant!"}
{"text":"With so many sushi options in the area it's easy to find a place when you are in a hurry or want to keep it simple, but if you want to chill and enjoy really fresh sushi...you will appreciate Sushi at the Lake.    I love how transparent everything is at Sushi at the Lake.  Every single staff member looked me in the eye and was courteous.  When is the last time you experienced that...anywhere?  You walk right by the Sushi bar...everyone confident in their skills and cleanliness.  Amazing!"}
{"text":"Meh... Why go here when there is so many better places to go? Service and food is generally slow... Guests are loud and the room echos... Prices are above average... I'm just not feeling it"}
{"text":"Sushi at the Lake has one of the most fun atmospheres in Cornelius and Lake Norman. They have excellent hot saki and you really should try the \"Firecracker\" Roll if you are ambitious.  It might be a little hard to find so look for it near the Starbucks shopping center off Catawba Road.   if you are not a sushi fan, try the Hibachi Chicken (my favorite hot food here). They serve it with shrimp sauce, salad, and soup, and carrots. Delish!"}
{"text":"Really good sushi... Our reviews are of shushi only. We travel all over trying sushi bars. This is definitly in the top 3 of 10 places we tried in the Davidson, Cornelius, Huntersville area and prob in the top 5 out of the 21 places we've been so far in the triad area. There's a couple right here in your backyard that are just as good and even better. Nice staff and decent atmosphere. Fresh fish and yummy rolls... Great place."}
{"text":"Sushi at the Lake is the best sushi I've ever had - and I've had plenty of sushi!   The Volcano Roll is perfect if you're a spice addict - sure to make your mouth tingle!    The grilled veggies and salads are delicious, and you really can't go wrong with anything on the menu!  Definitely worth a visit if you're in the Charlotte area.  Sincerely,   Earl and Janet"}
{"text":"AWESOME sushi!!  The service is great, & food is great! My only complaint is that they aren't open for lunch on Saturday and Sunday.  The owner is super nice and comes to greet us every time we are there.  The Mt Fuji roll is to die for!  It's a little pricey but well worth it, don't hesitate to give it a try, you won't be disappointed!!"}
{"text":"This is the best sushi restaurant in the area! Try the tuna & lobster roll, surf & turf and the tornado roll!  You won't go wrong!"}
{"text":"My boyfriend and I went there yesterday to use a 50% off deal I got from Livingsocial. just as I had hoped, the service and the food was excellent. I had their TJ Burrito Sushi, it was the best sushi I have ever had around Charlotte area! I'll definitely be back! They have some great lunch specials like the Bento box my boyfriend got. It was a good start if you don't know what you might like, or if you would just like to try different things at once"}
{"text":"I do like the sushi here but the service is horrendous! The first time we ate there it was a Friday night and incredibly busy, so I did cut them some slack. However, we went on a weekday, when there were very few customers. We waited about 45 minutes for our meals. I haven't been back since then."}
{"text":"It had been a while since I've been back to sushi, but it was still as good as ever. Quite busy on a wed night but we were sat fairly quick. Since there were six of us, we ordered a lot of sushi, a few apps, and three hibachi dinners. We didn't have to wait too long and the food we ordered was great. Our server Robbie was nice and tentative. Over all this place still rocks after all these years. Many props goes out to Moon and his staff."}
{"text":"Fun place to hang out with friends, casual place....great for families with kids. Love seeing the Chef and staff working nearby so I don't feel that they're back there spitting in my food.  Remember....I'm also OCD, so I want to see what's going on and I want to make sure the person who's cooking my food are  pretty neat and clean."}
{"text":"I had the hibachi and sushi combo and was not impressed. The sushi was not wrapped well, sushi rice was dry and lacked any subtle flavor, and the spicy mayo in my roll was running. My jumbo shrimp hibachi was more like 6 medium shrimps with \"fried\" rice. You could clearly see white clumps of rice that didn't get mixed. I can't review the sweet carrots because mine was missing. I was informed that they ran out and that it's not a side, it's a garnish of a few pieces. This is the first place I've been where the sweet carrots are a \"garnish\" in a hibachi meal."}
{"text":"This was our first time here and we will be going back often.  Host and wait staff were extremely nice and offered plenty of suggestions.  I eat sushi two to three times a week and everything I had was amazing."}
{"text":"I went here with some co-workers for dinner.  The complimentary edamame comes lightly dusted with sea salt.  The seaweed salad was very good.  They give you large portions of rather potent wasabi.  No complaints about the sashimi or maki.  A co-worker had the tuna tataki which had a nice spicy sauce.  They serve the nice normal beige colored pickled ginger."}
{"text":"Love this place.  Service great and very helpful with selections.  Went there on a Saturday evening and had a great time.  Will be back for sure"}
{"text":"The 1980's called and they want their restaurant back. Yikes. This restaurant needs a facelift. The tables are scratched, the lighting is bad, the artwork is, um, interesting, and well, the fish tank only had 2 fish left (must have been a busy night).   My husband and I decided to check out this place for some good ole sushi. But, we've clearly been spoiled by the amazing sushi at Ginbu on Providence Road. This place was mediocre at best and the prices were high for single, basic rolls.   We ordered the \"bundle\" platter of their 4 top specialty rolls to get this place's best first impression and to get the most bang for our buck. Despite the lobster, the rolls were just okay (not much flavor), but over the music of Boy George and bad blue neon lighting, well... It just isn't worth a return visit. I guess we'll just have to keep fishing for a good sushi place in the Lake Norman area."}
{"text":"UPDATE 4/26/12: Since this place is so close to my house, I figured I'd give it another try (after walking out because we were entirely ignored after being seated for over 7 minutes in an empty restaurant an additional time since the original review). This time I went at 8:00 on a Wednesday night. It was busy, but not jammed...no reason for super super slow service across the board.  I think the sushi got more expensive, and less creative. I remember the menu being much larger the last time I was here. And the portion sizes are really small. Most specialty rolls are $14 now....and lacking creativity (an over abundant amount of rolls contain softshell crab and cream cheese, weirdo combo, I'd be shocked if those are actually big sellers) with extra slow service, there are many other places also close by that care if customers are in the building or not.   This was my last time at Sushi at the Lake. For creative yet pricey rolls I recommend Osaka or Peninsula Bistro, and for well priced, delicious sushi, check out Joels, their specialty rolls menu is great.  ORIGIANAL REVIEW: I've been here twice. The first time was AWESOME (during lunch). Great sushi. Fast service, good cocktails.   I came back a few weeks later on a Tuesday night. They were moderately busy, but no where near as busy as a lunch crowd. We were sat at the table pretty quickly (table was still soaked, gross, don't tell me there wasn't a dry table available...or a dry rag...).  We waited for the waitress. And waited. And waited. She wandered by a couple times, had time to chat with the hostess, etc, but never made it to our table. We decided to get up and sit at the bar, since only two people were at the bar, it looked like the bartender would have time to at least make us a drink, let alone take an order.  After sitting down, she said 'Hi, I'll be right with you', then was doing other stuff on the computer for literally another five minutes. We flagged her down and asked if she could quick make a cocktail, but she said the waitress had just turned in four more orders at once that needed to be entered.   My question is, why is the bartender doing all the waitress's work, when she's sitting at the sushi bar laughing with the hostess (seems like they have the \"B\" team working on off nights)? There's many other computer stations at the restaurant. My second question is, why the heck can't the bartender make our drinks and go back to entering the stack of the waitress's work? She's supposed to be the bartender...not the secretary.  So we sat at Sushi at the Lake for 18 minutes with only being partially acknowledged by the bartender, who was overwhelmed with other people's work.   I'll be back since the food is wonderful, but it will be during lunch or a weekend night when the good waitstaff is working, not some college girls that don't care if they have a job tomorrow or not."}
{"text":"It's a bit difficult trying to rate Sushi at the Lake. I've been there many times before, but hadn't eaten in a while until yesterday. I'd say it was about 7 months since I had eaten there. A lot of things have changed. The food is still good, although expensive. The change I noticed was that they're putting less of the ingredients in there. For instance, I ordered the Rock n' Roll, it's a sushi dish with soft shell crab on top. There was so much less soft shell crab on there then times before. The sashimi delux seems to have gone up in price so I didn't order it. Instead I ordered just about 7 pieces of sashimi to share between the three of us. The sashimi was very fresh, much better than any other Japanese restaurant in Charlotte. Also got the lunch hibachi chicken and steak. Chicken was slightly dry but the steak was pretty decent at mid rare.   However, the service was not all that great. This may be due to the fact that we came in close to the end of lunch time. So maybe the waitress was hoping to hurry up and get on her break or something. She didn't bring us our ponzu sauce for our Tuna Tataki. When we requested it, she simply said, \"Oh you want the sauce?\" I mean... in the menu, it clearly states that it comes with the sauce, of course we want it. Then she would seemingly avoid our attempts to flag her down for something. We just got a weird vibe from her. So I'll go ahead and rate the food 4 stars.  Srvice 3 stars, and rate the price point 3 stars because it's so expensive. Overall a 3 star restaurant."}
{"text":"By far the best sushi in town!!!  Beats everything around here!  Price, vibe, quality, its just great!       Dont judge on looks, the taste of the sushi amaze you!!  Salmon sashimi, squid salad and tornado roll are the best!!!    Have fun"}
{"text":"We just found our favorite local sushi place!!! Service is awesome and sushi is definitely the best out of about a dozen places we have tried!"}
{"text":"Great sushi options and flavor. I love it spicy and they certainly know how to accommodate me. Staff is friendly and attentive. Lightning is a bit weird and bar like(gloomy). Could place overall and will be back again!"}
{"text":"The sushi was decent but not worth the wait.  We waited 45 minutes to receive our entrées. Not to mention that we awkwardly stood at the desk for several minutes to be greeted / seated and another good while to be visited by our waitress.  We should have just left at that point,  but instead we wasted $ 60 and an hour and a half of our lives."}
{"text":"The food was very good, especially the dragon egg appetizer, I would give the food 4-5 stars.  The service was also good.  The down side, which was a major down was the atmosphere.  The food is too expensive for a dark restaurant which is extremely loud and seems more like a bar than a restaurant.  I unfortunately will not be going back because of the atmosphere."}
{"text":"Yesterday,  July 17 was my first time trying this restaurant,  after passing by it for years. I wish I would have continued to pass it by. This was the absolute worst lunch experience that I've ever had. My coworker and I arrived at around 12:45 pm. There were only a few patrons in the dining room, so we assumed that service would be speedy. We were wrong. After the waitress brought our drinks , it was a full 15 minutes before she decided that she should come by and see what we wanted to order. By this time it's after 1 pm. We decided to place an order to go after looking at their ridiculously overpriced lunch menu, assuming that the food would take awhile to come (despite the lack of a lunch rush crowd). That turned out to be the best decision.   30 minutes later, our order arrives to our table. In one bag. There are clearly 2 people sitting at the table, with 2 separate and distinct orders. We ask for an additional bag and are begrudgingly given one. I ordered their hibachi teriyaki chicken with fried rice and glazed carrots. This set me back $9. Not the best value, but okay. I made the mistake of not opening my Container until I got back to work. Lo and behold. No carrots. My worker ordered the same thing and she, too, was missing carrots. She called the manager, Tammy, and was blown off. \"Oh, they probably forgot to put them in there. \" No apology. Nothing.   The food tasted like something they serve at nursing homes. I'm glad that I didn't order the sushi like I had originally planned. I'm sure I would be worshiping the porcelain throne right now.   All in all. This was my first and last visit to this restaurant. The ambience and service definitely do not merit the high prices for lunch or dinner."}
{"text":"Went here while on vacation in April of 2014 with a Groupon and totally loved it!  Kids ordered Hibachi chicken dinners and we ordered a variety of sushi and rolls.  Everything was well prepared and our waiter was very helpful!"}
{"text":"Friendly staff from the sushi chefs to the host to the server. I was served a delicious sushi roll-tuna mania very quickly. The menu has a wide variety, very creative. The atmosphere is inviting, they have a regular dining area, sushi bar and actual bar which had craft beers! I will attend again!"}
{"text":"I don't mind driving more than an hour to go here because it's really a great place. Efficient staff under the watchful eye of good management make sure everything goes like clockwork. Sashimi is fresh, well cut and well presented. The tempura batter is excellent cooked in fresh oil. The atmosphere is up beat and if you sit at the sushi bar there's good conversation as well as good background music. No wonder it's usually quite busy which a sushi bar needs to keep the fresh fish moving. Slight nag \"no noodles\". Try it you won't be disappointed."}
{"text":"This is some of the best sushi I've had in NC, period.   Living at the lake, you really miss out on some of the better restaurants. I've had a hard time finding new things to try, especially because the turnover rate for restaurants seems to be pretty high. It seems like every time I come back \"home\" to visit my parents, there are new places replacing places I never even had the chance to try, and unfortunately we find ourselves eating at the same places OVER and OVER and OVER, out of a fear of paying way too much (I know it's a pricey area to live but why do the restaurants all overcharge for mid-price fare?) and being disappointed.   I was well pleased by Sushi at the Lake. I feel a bit of a newcomer not having discovered it before. Pleasing to the eye, friendly service, and our food was fantastic. I had the Volcano Roll- looking for something a little different- and it was just great. FRESH tasting and presented prettily, and didn't fall apart between the plate and my mouth.   I will DEFINITELY be back to Sushi on the Lake!"}
{"text":"My boyfriend and I went for the first time since we are new to the area and the service was horrific! The waitress took my boyfriends order incorrectly and it took about 20 minutes for his new order of fried rice to come out. She was not empathetic at all and did not seem to care. We had to mention that the wait was unacceptable as the rest of his food was cold. Avoid going here for dinner!!"}
{"text":"Pretty spot on, good people running the place too.  Rock n Roll modern atmosphere.  Havn't been there in a little while, but def one of my sushi places in Charlotte area."}
{"text":"i am a huge fan of sushi at the lake. we drive from south charlotte just to go to sushi at the lake a few times a year. i strongly recommend the grilled calamari appetizer. one of the only places around that serves real calamari steaks. there sushi is some of the freshest around. good sashimi and rolls. we dont sit in the teppanyaki area to often but their cooks put on some of the best shows around compared to other japanese restaurants with teppanyaki. this restaurant really does not have any downfalls. the only thing they could do to make the restaurant better is to put better seats and tables in there."}
{"text":"A co-worker and I went here for lunch today, however ended up having to get our orders to go due to time constraints; the service was ridiculously slow and when we got back to work our orders were incomplete.  We were both missing sweet carrots from our orders and when I called back to advise the manager, TAMMY, of this, she was completely rude and unapologetic. She minimized the MISSING FOOD as, \"oh it's only a garnish anyway...you only get like four carrots!\" What the hell? If I paid for them, then I want them, whether it was 4 or 20. This place is completely overpriced with bland tasteless food and clearly a management staff who does not understand how to treat their customers. Needless to say, I will not be going back to Sushi at the Lake."}
{"text":"So happy that I was introduced to the Grilled Calamari Appetizer. It's quickly become my new favorite. Sooooo good!"}
{"text":"Fantastic food and excellent service!  This is a little sushi restaurant in Cornelius that has some pretty darn good food!  For the first time we had Sunomono, a refreshing cucumber appetizer embedded in a tangy sauce.  The flavors worked together perfectly and we couldn't get enough.  For our entrees we had the Alaskan snow rolls and the Mojo rolls and they were pretty good.  The spicy orange cream sauce that comes with the Alaskan snow roll is mouthwatering.  Since I'm vegetarian I did not eat the Alaskan snow roll (has shrimp and crab in it) but I did try the sauce from my friend's plate and loved it.  They were kind enough to give me my own serving of the sauce free of charge, it was very cool on their part.  However the star of the show was definitely dessert.  We ordered two tempura ice creams with a request on my side to be liberal with the chocolate sauce.  Not only did they generously pour chocolate sauce all over my tempura but they even included a small cup of it on the side so I had as much as I wanted.  The tempura ice cream itself was abundant, easily enough for two, and after eating a full dinner I wasn't that hungry for that much dessert, but after a bite, the crispy and soft texture married with the oozy chocolate sauce, I was hooked and I couldn't stop eating until I finished every last bit of it, it was perfect!  Lastly, Amanda was our server and she was THE nicest person with outstanding service.  If you're the Manager at Sushi at the Lake reading this, please praise that girl, she is making you guys look REALLY good!    If you like quality sushi and are in the area, give this place a try, you'll get good food without breaking bank, it's a pretty sweet deal."}
{"text":"Best sushi around! Love, love, love this place.  Rock and roll \"roll\" is simply fabulous. Awesome grilled calamari. Delicious soft shell crabs. Very gracious staff.  Try it, you won't be sorry."}
{"text":"Excellent hamachi and saki nigiri. The grilled calamari was amazing. I could eat that every day"}
{"text":"This is one of my favorite sushi places! It is really good and I love their unique rolls. The surf and turf roll is my favorite. I get it every time mostly because it is fantastic and I have never seen any thing like it anywhere else.   If you are looking for great option to order I recommend the sushi on the lake dinner. You get random nigiri along with either one or two special rolls.   A few things to be aware of with the sushi on the lake dinner:  1. The use wasabi in the nigiri is sporadic and unpredictable. Sometimes it is there and sometimes it is not. If it is used, there can so much that it can be way too much.   2. Sometimes you get a crab stick over rice as one of the random nigiri. This is one thing that keeps me from giving the place five stars. I guess I expect better for what they charge for it.   Overall, the food and service are great and I recommend it if you get the chance to eat there."}
{"text":"Love me some Sushi @ the Lake.... My favorites there are the Tornado Roll and the JP Burrito Roll. Hibachi is pretty good too and their chicken Katsu is really yummy also. It's just chicken tenders fried with Panko crumbs.  My family is friends with the owner and most of the servers know us, so when we go, we always get excellent customer service. Check them out if your around there."}
{"text":"I have been going here ever since I was little and it is very good! It can be expensive but it is worth it!"}
{"text":"I agree with Tom...I miss the cooktop tables. The teppan / hibachi meals just aren't the same anymore.  Having said that, I now only indulge in the fried rice, rock & roll sushi roll & the house soup.  I've never had any issues with this meal, whether it's inside the resturaunt or getting it to go.   Everyone there is super nice & attentive & the service is fast.  They have ample seating & the prices are reasonable."}
{"text":"The sushi here is great, but the service and leadership does not measure up.  Once we left after no service (waited at least 15 minutes).  Most recently, I took a swallow from my water glass, broken glass came through my straw.  While attempting not to swallow the glass, my mouth was cut in several places.  The manager (maybe owner not sure) did not seem to take this seriously, until she saw the bloody paper towel.  I'm not one to want anything for free, but a 20 percent discount seems a bit lame.  I would never expect wine or drinks free, but if I had a customer bleeding, from broken glass they could have swallowed, I would most likely take it a little more seriously.  Instead of making a scene, we payed our bill and decided to find a new sushi restaurant."}
{"text":"Ah! The legacy of the lake, Sushi at the Lake! My first and fun sushi dining experience. Wow! It has been so long ago since the first day this place was opened to the people of Lake Norman. It is the original, one of its kind for its time in the area. I had so much fun and created great memories bringing clients, friends and families to enjoy this place. It was full of energy with cool and hip music. It is a place to be seen and to dine. Local celebrities are often seen and heard. The location is excellent next to Starbucks, French Wine Bar, Etc. The whole staff and the owner(s) are like families and some staff members had turned into clients. I loved everything I had throughout the years and never had a complaint. The service and the staff were always nice and friendly. Great people, great food, great fun!!! I am missing it a great deal considering I am a walk away. I have been missing in actions but will be back soon!!!   Tammy"}
{"text":"Great food waitress was perfect new her shit.... they had Tamari prices kinda expensive for the portion."}
{"text":"In my opinion this is one of the top sushi places in the whole Charlotte area, if not the best. It's a bit of a hike to get to if you don't live in the Lake Norman area, and the traffic may seem a bit daunting, but if you want real good sushi it's worth it.  The rolls are VERY generous here, and the selection of individual pieces is the largest I've seen in this area. They also have a decent amount of non-suhsi dishes to choose from, along with a hibachi grill. There's even a full service sake warmer+chiller at the bar, so your sake is served at the perfect temperature, whichever you prefer.  The atmosphere here is one of my favorite things about it. It's always been a really trendy spot, but never too pretentious that you feel out of place. The staff is also super nice, and always willing to help you pick out the freshest sushi that day."}
{"text":"Overall decent sushi.  I only come when I'm in town and it's a solid go-to.  Lots if rolls on the menu and it's kind if confusing to find everything on the piece of paper, but the wait staff is friendly and the food good enough to make up for it.  Closer to a 3.5 star, but I'll be nice and help their average."}
{"text":"Extremely dissatisfied with my experience at Sushi @ the Lake last night. My table was approached three times because a server thought she left her phone in the bathroom and it wasn't there anymore. The third time, the bartender walked up to us and basically lectured us about \"doing the right thing\" because evidently the the tracker had been turned off after she previously came by our table. I saw no other tables in the restaurant being interrogated. So now we're trying to finish out meals while the entire staff is staring at our table from every direction, making us feel uncomfortable. As we are leaving, we spoke to the owner about the situation, and I still don't feel that we were being taken seriously. Then, there a policeman was outside. What was he going to do, search us after we had already said we didn't have the phone? Oh and guess what? They ended up finding the phone somewhere. None of the staff apologized, and I most certainly will not be returning. There is a polite and correct way to handle things in this sort of situation."}
{"text":"We just moved to the area and we were excited to see a good sushi restaurant across the way. Honestly I've had better rolls at a grocery store for way less. Not good. The tempura was decent but that's it."}
{"text":"Sushi was tasty, but nothing to rave about. Service was very attentive. The reason for the low review is because the sushi pieces were the smallest I've ever gotten anywhere. Very little food for the amount of money. I probably won't be back."}
{"text":"I was looking forward to trying a new place, especially after I read the reviews on Yelp. It was OK, but not as good as some of the other places in town.  My Wife and Daughter each had Sushi rolls, which they liked, but they thought it was expensive for what they got. I had the Hibachi Chicken, and since I don't eat rice, I asked for double veggies. It was ok, but fairly flavorless. As was the Tempura appetizer we started with. Without the dipping sauces, there just wasn't a whole lot of flavor. The Groupon was nice, but I got the feeling our hostess/cashier wasn't happy about it. Our server was great, but when the other woman brought us our check (after the server took the Groupon), she plopped the bill on the table and walked away. It might have been my imagination, but I felt like she didn't like the discount we received. I tipped our server based on the full amount of the original bill, which I'm sure not everyone does. We probably won't be back, there are just too many other Sushi places nearby that stand out more. And the fact that Sushi At The Lake is closed for lunch on weekends is kind of strange."}
{"text":"Would Give this place a 4 based on service but because food is what everyone goes for it is a 3 at best. A little pricey for the size of the sushi rolls. Nice bar area. Ambience could use some help. We got a couple sushi rolls, eel, and chicken hibachi for $60. Sushi rolls were very small. The snow crab advertised isn't snow crab but imitation crab. We probably won't be going back."}
{"text":"In the middle of a down cycle.  I've eated at Sushi At the Lake on and off since they opened and under a couple of variations on the name.  The place tends to go through cycles and it's in the middle of a down cycle.  My wife and I ate there a couple of weeks ago.  I had the Hibachi NY Strip while my wife had the Habachi Scallops. We split a Sushi@ the Lake Dinner for our appetizer. The Steak was more of a burnt offering to an unknown diety while my wife's Scallops were so overcooked the were tough and rubbery.  The Sushi or nigiri was not bad but not as fresh as I would have liked.  Service was rather poor. Place is understaffed and even though they were only half full they could not keep up.  I did not time the length of time from when we ordered to when we were served but it seemed like an eternity.  Atmosphere is not bad but it was noisy last time I was here and it's still noisy.  Apparently very little insulation on the wall and the sound just reverberates."}
{"text":"Most AMAZING food and I saw my friend Kennedy! Plus a fish tank."}
{"text":"Poor value for the money. Sushi was fine but really expensive.  I paid 14 bucks for one dinner roll that was really a regular size roll any where else.  The place is nothin to write home about side. Reminds me of a place that college students would go to. I will not be going back."}
{"text":"Fantastic sushi.  Fantastic hibachi for any other eater in your crew.  The service is great and the food is always fantastic.  This is a must stop in Cornelius.  The appeal is far beyond the sushi -- which is quite good.    The only drawback is the ambience -- don't pop the question here -- but we have come to love it and wouldn't change a thing.  This is a fun restaurant that takes its food seriously and has fantastic servers.  Always a great stop to come here.  Never had a bad meal."}
{"text":"We went to Sushi at the lake last night. We had not been in almost a year and we will probably never go back. We ordered from the hibachi menu so our meals came with soup and salad. Both were inedible. The soup was just salty broth and the salad was a pile of romaine with 2 grape tomatoes and the worst ginger dressing. We then proceeded to wait just under a hour for our entree which was just warm and tasteless. The steamed rice was soggy and the steak was chewy and flavorless. Don't bother with this place! It's gone downhill fast!"}
{"text":"You don't know how many restaurants I've seen come and go in Cornelius...for a place to stick around as long as Sushi @ the Lake, it has to be really stellar, and it certainly is.   Restaurant is always clean, they always offer a variety of specials & new rolls, and friendly wait staff.   Favorite: Surf & Turf roll.  Best Sushi in LKN."}
{"text":"My husband and I love this place!!  Its close to our home and they regularly have a Groupon.  They have every sushi roll imaginable.  Service is good but sometimes you find yourself looking for your server.  Although my husband is a condiment freak and usually needs more spicy mayo etc.  We tend to go here more during the week cause weekends are usually packed.  They do also have a full service bar and make a lot of hibachi type food selections.  If you get cold easily take a sweater of jacket...........its usually chilly inside.  Also there is no patio seating which I prefer.  Definitely worth a try!!"}
{"text":"It looks like sushi bar meets night club in there. Food was good though."}
{"text":"Nice place to grab some raw, dead fish."}
{"text":"Food is okay, but they make their customers feel awkward when you order a normal coke and they suggest you a Diet Coke."}
{"text":"Love this place like I love a good chick flick. Reliable, consistent and awlways produces the same, feel good results. The staff is always on their game, the food has never once disappointed (and we've been eating here for six years). Not the world's best sushi, but some of the best in the region. The hibachi is excellent w/steak/chicken and scallops cooked as ordered. Friends swear the tuna jaw is the best they've had in ANY state and for some strange reason, even kids like it! I miss the snow crab app but aside from that, just like Steel Magnolia's, this place is still good after all these years (and a decent sized kitchen blaze). Great for a date, family dinner or out of town guests. Loud but fun."}
{"text":"Great times here with friends~! I don't eat a lot of sushi but my friends rave about it. I get the hibachi chicken with carrots and it is always delicious. Great location!"}
{"text":"Unfortunately for me, the Sashimi 12 pc Combination Dinner was nothing special. It was only 4 kinds of fish (Salmon, Tuna, Yellow Tail and Tilapia), 3 slices each. Oh, and a little bit of diced and marinated spicy tuna/yellow tail combination. Each sashimi slice is cut bigger than usual, so it is hard to put the whole piece in your mouth at one time, unless you have an extra wide mouth or something. That's kind of a bummer. I don't think it is worth $24 at all.  I added a small salad and a bowl of sushi rice for additional $5. So that's $29 already. With one Amstel Light, the total became $33 plus tax & tip. The fish was okay, but not the freshest at all compared to what I usually have back home in DC.  Besides, my water was in this glass with lipstick not washed away, which I did not notice until half way through. Ill!"}
{"text":"Some of the best Asian food I have found in the area. Service was excellent,  food reasonably priced.  Try the egg rolls!"}
{"text":"Being from an area in the country where sushi is on every street corner, and knowing fresh sushi, I have had the hardest time finding decent sushi in the Charlotte area.  Finally!!  Sushi at the Lake proved to be worth the drive.  Yes, they are pricey compared to what I am used too.  But good sushi is hard to find in this area.  With out real competition they can charge more.  The fish tasted fresh.  Most places I had been to in the CLT area the fish tasted frozen, without benefit of a baggie.  It had that nasty pre-freezer burn taste and feel.  I truly  enjoyed it and can't wait to go back."}
{"text":"Sushi @ The Lake seems very confused... They have some decent stuff and some legit Japanese food but they definitely don't fit the right mood for a sushi place in my opinion. I place a lot of emphasis on the mood of a restaurant for how good it is and that neon lighting is just too much. It makes me feel uneasy and spending to much time in that glow might make you think you're in a strip club. But they have all the good Japanese flavor and sauces and the staff is very friendly and helpful. I can't recommend it though if you're in a more relaxed sushi bar mood."}
{"text":"Sushi @ The Lake has always been one of my favorite places in the Cornelius/Huntersville area and one we have visited often.    I would give their quality and overall taste higher marks than any sushi restaurant in the area, including Eez (who charges double but packs their rolls with rice).  The Spider, Volcano, Surf & Turf are all excellent examples of great rolls.  Prices are very reasonable and it's a neat atmosphere for sushi."}
{"text":"We pick up 2 Spark Plug Rolls and 2 Not an Eggrolls just about once a week.  We absolutely love their food and service.  In fact, my battery died one evening and they went out of their way to give me a jump!  That's service!"}
{"text":"I have tried so many different sushi rolls here and they are all amazing. Great service. I have ate here by myself and with many friends. Always quick and friendly no matter how many are in your party. Fresh tasting food and good quality ingredients"}
{"text":"I had Ashley as my server and she exceeded my expectations.  She had been there almost a generation and loves seafood like me.  The atmosphere is not 80's  as reported before.  I was listening to  new hits like \"it's all about that base\"  I will be a regular here"}
{"text":"I'm going to have to disagree with most of the glowing reviews on this site.  This restaurant is probably trying to be hip in its decor and pop music, but these things really turned me off.    Our server was also the bartender.  So, not only was she filling drinks for other servers, she was also serving the customers at the bar.  As a result, she had too many customers to serve and our table was often neglected.    As for the food, the only thing that wowed me was the grilled calamari.  The maki rolls were the smallest I've ever had.  Even their combo dumpling dish was just average (the shumai in particular had a lot of filler).   Sadly, I'm not a fan of this place, and don't plan to return."}
{"text":"I love this place! It's probably one of my favorite Sushi bars in NC! It's definitely on the pricey side, but it's got the freshest sushi!!  I love to go there for date night with my hubby or with a rowdy bunch of friends for their Teppan grill.    If you go, you've got to try the Chef Ah-Moon Special Roll: spicy tuna, cucumber, and cream cheese!!! Super delicious!!"}
{"text":"I like Sushi at the Lake just fine. I used to come here all the time about 10 years ago - because for a while it was the ONLY place to get sushi, period. Now, they have some steep competition in Davidson and Huntersville. The sushi is fresh and tasty - and relatively quick. They also have good cooked dishes. I don't think they're specialty rolls are out of this world, but they're good. I do recommend the sea bass appetizer - it's always great! Once it was a little overcooked and dry, but still delicious. We only go here when we get a groupon or something like that. Would I recommend it? Sure. Is it my favorite? No. I prefer Eez, Ming's or Sabi nearby instead."}
{"text":"Love this place but it's close for now due to a fire. They do have a second place in Mooresville. Hope it opens up soon"}
{"text":"Really good sushi. We always come back here for the grilled calamari! A win everytime.  It has been awhile since i have been back but they now have sushi happy hour where there are half off certain rolls , $4 gyoza and $5 chicken fried rice. From 5-7pm so more crowded now We love the tornado roll, spider roll, ying yang, surf n tuff volcano roll***"}
{"text":"Since my initial review back in December 2011, we've probably been back here over ten times. It's the place we take visiting family and friends to, and also our general go-to to fix our sushi craving when it comes up.  The rolls continue to be fantastic, fresh and otherwise simply tastetacular. We still get the grilled calamari with each visit, and it continues to be rock star quality. If you go here and don't give the grilled calamari a whirl you're doing yourself a huge disservice!!!  We've also had the dumplings which are nothing short of amazing. The dough is extremely light and soft, and it's not a thick, chewy dumpling like I've had at other places. The one thing I do have to rave about is the wasabi dumpling. This dumpling is infused with wasabi, making the outside green. And you definitely get the wasabi with each bite, as a bit works its way up your nasal cavity. However, it is not a normal dose of wasabi, and it is not overbearing. I don't generally like wasabi since I don't like getting that nasal feeling, but these dumplings are perfected to have the best possible amount of wasabi. You get a bit of that strong taste and feeling, and it creeps up right to the threshold, but does not overstep it. It's a really great dish.  We've been to a ton of other sushi places in the area since we've first been here, and none have surpassed Sushi @ The Lake. The ones that do match it in the taste department do not follow suit in the price department, and will charge you more for the same quality and quantity you get here. We still have not tried anything outside of the sushi for dinner, so I can't compare it for hibachi and other cooked dishes, but this is the quintessential  sushi restaurant in the area."}
{"text":"My first experience at this place was simply horrible! The service was bad, the server was not rude but she was not knowledgeable at all! The place ambiance is not inviting. The rolls are VERY small, the house salad is just lettuce with one cherry tomato. The fish quality was low and the prices were not super expensive for sushi but in this case I think it was overpriced considering the food quality and service. Will never come back..."}
{"text":"Kinda sad when the sushi roll you get is the tiniest I have ever seen! I will add a picture to show what I was served. Waiter still argued by saying \"that's what they all look like\" and basically told me I was wrong. Ordered a long time ago a $15 roll and was very disappointed with the size. I mean you can go down the street to eez and pay $15 for a much bigger and better roll!"}
{"text":"It's a shame that they lost the cooktop tables a year or so ago. While they still basically have the same Teppan menu, it's just not the same as it used to be. The show was one thing but the food is just missing a little something when it comes out of the kitchen vs when it was cooked in front of you.   I have to say however that this visit did get a lot closer than our previous one. I started with a roll of spicy tuna, cream cheese and cucumber. It was good tho a bit meager in size compared to a similar roll at Eez. I had the Teppan filet and scallops for dinner. The scallops were well seared with good flavor and the filet was a perfect medium rare and nicely seared as well. I am slightly embarrassed to fess up that I am not the best veggie eater in the world. I know..... They are good for me. BUT, I become a veggie fan at Sushi at the Lake!  Something about the way they quickly sauté them up on the flattop and the flavors they add make me happy.   Finally, the staff here is just the best. Every one of them is a smiling, whirling dervish of good service. They check on you without being overbearing, keep glasses full and empty plates removed, bring the check promptly but don't make you feel like they're rushing you out the door.  You name it, they do it well and seamlessly.   It's a cool looking, comfortable setting as well. With a bit of rocker vibe thrown in for good measure. Whenever I come I think, \"Dude, you need to hang here more often.\", and that's a good thing! :)"}
