{"text":"First appearances are great here: very clean, and chic and modern decor. Plus, I always love a good pun in the name.

The food is good. It's nothing spectacular, or spectacularly cheap - just very average all around. Good food for a decent price. 

The most disappointing factor: service. Somewhat slow, and on the cold and impersonal side. It wasn't awful or rude or anything, just below average. They seemed bored and not particularly aware of the fact that there were customers in their restaurant. I didn't feel overly welcome when inside. Small touches of good customer service like smiling, bows, and generally being polite - there was none of that here."}
{"text":"Decent food for weekday LUNCH but not the best service.

MAKI: The rolls cost more than the other sushi places in this area (Sushi Time, Sushi Extra, ToNe Sushi) but it's worth it because they are bigger and put together much nicer. They are packed well and don't fall apart when picked up.

SASHIMI: The sashimi lunch combos are good. The fish is fresh 80% of the time. but STAY AWAY from their sashimi party trays because those are a rip off. They don't tell you exactly what is included in the trays/boats so they count fake crab meat as sashimi (they put a lot of this in there). 

Word of Caution: Usually it is ladies staffed here but the last time I visited it was a male that was serving us and he demanded minimum 10% tip. I don't feel tips should be mandatory, it should be equal to the service you receive. Maybe he should have been more attentive and actually serving us but who knows... The fact that he DEMANDED it is why I will be staying away from here for a while."}
{"text":"My sister wanted me to write a review on this place because she thought it was simply terrible even though she didn't get a chance to actually order something. She visited this place today and once she sat down she saw a mouse moving underneath one of the tables. What is even more disgusting one of the waiters stomped on it and started kicking and rubbing it off his shoe toward the garbage!!! Grosssss!"}
{"text":"Great happy hour specials if you are up for an early dinner. The service is usually really fast. I always eat in because of that reason."}
{"text":"I used to live right near Sushi Queen (about 2 years ago) and had this recollection of it being really cheap and pretty good. My recollection of the price was accurate, but the quality is much worse than I remembered. 

I had the Sushi Queen Street suhi/maki combo, which comes with miso soup and a salad. The miso soup was inedibly salty. The salad was fine, but nothing special. The sushi itself was just kind of passable. The fish is of a lower quality and the seaweed was really chewy. The price is still good as this cost less than $10, but it's hard to get too excited about the good price when the food itself is so far below average. 

Don't expect to be going back anytime soon."}
{"text":"It was real so so.  I was disappointed with the freshness of the fish and the presentation of the food.   The plates and glass looked old and not cleaned properly.  On a good note,  the Sunomono Salad was pretty good... Nothing more to say"}
{"text":"Ive only been here for lunch and the lunchtime combos are between 9.99 and 13.99, all very good value for money. The portions are huge plus they come with soup and salad. Im a huge eater and even for me these are huge portions. The food is also pretty tasty, especially for the cost and its a nice enough place for a sit down lunch."}
{"text":"Inexpensive. Service too quick - please don't bring the sushi 1 minute after serving the soup. I know, I was dining alone, but that doesn't mean I want to eat so fast."}
{"text":"I got an extremely bad stomachache from this place!!!! Really good prices but absolutely not worth it. STAY AWAY at all costs."}
{"text":"If you like dirty Chinese sushi. Go here. 
Our food was poor, the service was oh-so \"un-Japanese\" and the place is LOUD! Waitresses having super loud conversations with the kitchen/each other, and kids running and yelling. 
Holy smokes. I was seriously looking for the zero stars option but apparently that does not exist.
Well, my miso soup was good. So that gets a star, I guess."}
{"text":"Sushi was mediocre. Salmon sashimi not fresh. Too much rice. Not efficient service. 

I will not go here again. It is just not good."}
{"text":"My family used to love this restaurant because when it was Sushi Bistro it was awesome mainly due to the incredible Sushi chief but he left and the quality went down. Then it became Sushi Queen and they did a renovation but kept the menu doing a fairly good job but all that has changed I don't know if it's under new management or what but sad to say the last time we went the quality was crappy. Yesterday's sushi rice, gross cold miso, poor as hell service slow as hell service. So sad we used to give 40% tips we were so pleased with the quality and service. It's a real shame."}
{"text":"I used to come here years ago during my UofT days thinking it was amazing but since then I've discovered better places.

Yesterday after the OCAD grad show, my friends and I stopped by and I ordered a spicy salmon roll ($4.95) and a spicy tuna roll ($5.25). I found that they were messily made with a copious amount of rice on each roll.

It was decent for the price but overall, mediocre at best. If you're looking for cheap spicy spicy salmon rolls, I suggest Sushi On Bloor since it's the same quality and much cheaper prices."}
{"text":"Sushi Queen is our go-to sushi lunch option because it's close to work and cheap. The quality of the fish always seems decent (relative to the price, of course). I've never had a bad experience there, but it's nothing special either.

The service can be a little spotty at times. At one particular lunch my co-worker took it upon himself to fetch the tea from the bar and serve the table. They're usually packed during lunch so the orders can come out quickly for some and slowly for others, which can be frustrating when you're starving while watching your friends eat! Hopefully they're nice enough to share.

Don't go out of your way for it, but out of the cheap options in the area, Sushi Queen is the best choice."}
{"text":"Sushi is a most delicious treat, one that I was sad to see fall out of my life as I became a bit too health conscious to enjoy tempura, white rice or excess of sodium. After a long day devoid of meals, I didn't hesitate to agree to whatever my friends suggested. Hoping to minimize the pain I'd be in later, I ordered a Green Salad, House Vegetable Rolls and Miso Soup. The vegetable rolls were the most amazing thing to grace my lips. No rice!! The roll was held together somehow by a large spiral of cucumber. They had somehow turned a salad in to sushi. I AM IN LOVE. The garden salad was also a decent size. This is the best effin' sushi place, ever."}
{"text":"I have eaten at Sushi Queen every once in a while over the last four years as I live in the neighbourhood. The food has always been acceptable for the price point.

However, after eating at Sushi Queen during the week of the 23rd of March, I became very sick. I ordered a meal that included Spicy Tuna, Spicy Salmon, and one other spicy fish roll. Certain pieces of one of my rolls were squishy and hard to break apart with my teeth. Despite this I finished my meal, paid, and left.

The food poisoning was so bad that I am still suffering from it. I cannot eat without becoming sick. I have consistent aches in my small intestines and kidneys and have missed two days of work.

I will not be eating here again and I hope this review helps potential customers make a better decision than I have made."}
{"text":"i am surprised at the bad reviews - i actually quite like this place. Its my new go-to sushi place after my bad breakup with sushi inn @ yorkville.

1) Ambience - its casual and the place itself is nothing fancy. Which makes it a good place fo casual sushi dining

2) Service - its not the best - you may have to remind them a few times here and there but given the reasonable prices i can get over that

3) food
- i HEART the CN tower roll - its really fantastic and a mix of many different flavours - great! 
- the salmon and tuna lover combos are really great. Great combo of sashimi and rolls 

Good fresh quality sushi at great prices and the deliver as well! yay!"}
{"text":"Did she just grunt? Yes, our server grunted at us as she put dishes down. The other server rolled her eyes when I asked what kind of hot tea they had, since it wasn't on the menu.
 I eat a lot of sushi and I've never had edamame served at the end of the meal before.
The food was below average and price was average. Wasabi was dry and old, very glad I had ordered vegetarian as I wouldn't of trusted the fish. My pieces of sushi were falling apart before I even touched them.
The washroom was filthy. My glass of water tasted like soap.
It was all so bad that as potential diners checked out the menu on the window beside me, I gave them yuck faces and thumbs down."}
{"text":"I went to Sushi on Queen last night for dinner. I had the red dragon and vegetable tempura appetizer. This was wasn't cheap or too expensive, it was just average. The  service was also average. The waiter/waitress will not come to you till you flag them down to order or get the bill. 

the restaurant is long and narrow. Casual environment. I find it quite odd that the kitchen was located in the middle, and the pickup window for cook food is open. you must pass by the kitchen to get to the washrooms at the back. Which i wish the kitchen was closed, b/c i don't want to see their mess. 

My red dragon sushi got thumbs up on display. Portion was also good (8 pieces) for $8.95). the fish doesn't look that fresh b/c i don't see it being shiny (it was quite matte). I was hungry and chow the sushi down in no time. The Vegetable tempura was $3.95 nice and crispy.

Overall it was okay place."}
{"text":"Wasabi not super fresh but very good service and sushi was great!"}
{"text":"GENERAL NOTES
I was walking Queen the other day with a friend, looking for a sushi place that would allow us to purchase sushi a la carte. Lesson learned: bad reason to pick a sushi place. Though nothing about this place seems to suggest their sushi doesn't taste very fresh and their rice is not very good. Unfortunately, their sushi doesn't taste very fresh and their rice isn't very good. We got a sushi boat and left almost all the sushi and some sashimi. The maki rolls were decent though and the soup and salad were good. 

MENU RECOMMENDATIONS
Don't get the sushi.

SERVICE NOTES
As with any Japanese place, the service is a step higher than most restaurants. That's because us Japanese are built to serve.

LOCATION NOTES
A quite, dimly lit restaurant that's bigger and much nicer than it looks from the outside. The bathrooms smell like a lovely woman and the decor is nice, if not outdated. Located on the North side of Queen at McCaul. 

HUMOUROUS STORY
Dinner conversation is wonderful. My friend and I spent most of the meal talking about her lack of interest in sex. It was quite befuddling, but she had an interesting theory: \"Maybe I'm just into weird shit. I don't think I'd like to be peed on but maybe I'd like being throw around a bit. Can't do that by yourself.\" Needless to say, the men's room has a few more dents in its drywall. 

No it doesn't."}
{"text":"As noted by the other patrons this place is mediocre.  Prices are slightly higher than the annex area sushi joints.  Dimly lit ambience and the menu had lots of rolls and types of sushi to choose from.  I don't remember what we ordered but nothing spectacular tasting."}
{"text":"Wonderful place! Very clean little place that had excellent service and amazing food!! You should stop in and try this amazing Japanese and sushi restaurant!"}
{"text":"The worst sushi place I have ever visited. Wrong everything ! Plates with cracked edges, \"i-hate-you\" style service, and very bad quality sushi.  Could you image, they served the sushi-combo on regular plates instead of wooden platform.  I were shocked, this kind of places should be prohibited by law :-)"}
{"text":"UGHhhhh.

Why do I always choose the worst places to eat at?!?!

What is up with a busy restaurant having bad food? Are you trying to trick me?!?!

Bento boxed lunches are well priced but the sushi and sashimi are so suspicious looking, I was afraid I was going to be sick afterwards (luckily I felt fine! Hooray! Is that star worthy?? If so, that's sad). 

The salad dressing was like thousand island with carrot mush. The miso soup was so salty.  The tempura was pretty good.

All in all, don't stop here. Go have indian across the street."}
{"text":"Horrible Service, Low quality sushi, overall dirty restaurant. Will not go back even if it was free!
I found a hair in my dynamite roll!"}
{"text":"THE PRICE (for lunch):
Great! The lunch portions are well sized, and the cost was totally appropriate for location and the quality that we got.

THE FOOD:
Actually, great. I had one of the bento sushi boxes, which came with a variety of salmon/tuna sushi and some rolls, soup and salad. The portion size was great and I felt sated and happy. The sushi tasted fresh.

THE SERVICE:
Oh my god, awful. We got grunted at as well when we ordered. Like, the only way the service could be worse is if they just ignored you - at least, they don't ignore you and they are fast. But honestly, expect to feel like you are inconveniencing the waitress.

THE DECOR & LOCATION:
Decor is modern, clean, comfortable. And the location can't be beat - close to the subway, close to a lot of downtown events, so pretty great to stop over at lunch. And it wasn't crazy busy!

OVERALL:
If I'm looking for a lunch sushi in the area, I'll be back. I wouldn't go out of my way (at all) to be back however, and honestly most of it is the service. The food and place itself is great."}
{"text":"Yummy sushi, sweet staff, cool decor.

I stopped in to grab some sushi to go. The young lady at the hostess bar took some time and helped me decide what to order because they have sooooooooo many yummy and unique options. I appreciated her doing that. 

At their Concord location I always got the \"hot mamma\" roll, so I wanted to try something new! I'm not one of those people who isn't capable of making a change! 

.....I ordered the \"hot momma.\" (._.) ..it was delicious.
They weren't skimpy on the fish which I appreciated. The roll was well seasoned and put together.

My only gripe is that they packed my fiancé's deep fried roll with my fresh roll. I don't like the idea of my fresh roll getting warmed by the heat of a fried roll. Freaks me out. However, they separated them for me so it was all good. 

I'll be back fo sho. (^-^)/"}
{"text":"I love this restaurant! They have a salmon special which includes salmon sushi, salmon sashimi, a salmon hand roll and grilled salmon. A nice perk is that extra ginger and spicy mayo are free. The service is very fast, making it a great dining experiences for professionals on their lunch break."}
{"text":"We decided to go here for dinner one night with some friends after our original plans had failed and we all love sushi so we figured we would try Sushi Queen on Queen Street West. When we arrived we were seated pretty quickly and then given a tablet to choose our menu options. It is the type of place that if you don't eat what you order, they will charge you what you don't eat but that didn't really bother us to much because we were all pretty hungry. Everything was delicious, great sushi, nice staff the only problem we had was trying to understand a lot of the items but other then that it was a pretty great experience and we will definitely be back!"}
{"text":"Sushi Queen was once my favourite downtown sushi restaurant for three reasons: 1) It was a 5 minute walk from my apartment; 2) The Calamari roll; 3) The Pink Dragon roll. Their Calamari roll is super crunchy, which is perfect for those of you (who like me) despise the chewy, gooey calamari rolls that most sushi restaurants offer. The Pink Dragon roll is a dream... A crunchy dragon roll covered with layers of raw spicy scallop - so delicious! And, very difficult to find as most sushi restaurants only offer the traditional green, red, or black dragon fare. I could eat the Pink Dragon for breakfast, lunch and dinner every day. 

In terms of décor, Sushi Queen has gotten a facelift in the last couple of years. The new dark décor is quite modern, and quite atypical of most sushi restaurants. There is ample seating room, and usually, you won't have to wait for a seat. 

Service is fine at Sushi Queen (not extraordinary), and your food comes our rather quickly. Prices are reasonable as well.

If you're in the area, pop into Sushi Queen... and make sure that you try the Pink Dragon roll!"}
{"text":"Sushi Queen, because it's on Queen Street.  Ha Ha Ha...What would they ever name another restaurant if it were ever to open on King Street??  Oh the suspense!

After 1.5hrs of roaming about at the AGO (Picasso) I was famished!  All of the sudden I wanted sushi, and there she was; the queen....
I was with my friend Claire, she came with me to the gallery.  I was so entrenched in the art I almost completely ignored her...so I thought it be nice if I'd feed her.  Total gentleman I know.

It was Queen street on a Saturday--6pm, I was surprised that we were seated immediately--but then again it's not the Ritz (I say that a lot, and now there's a Ritz in Toronto, and I haven't even been to it...I might have to relinquish my right to use that phrase).  
After five years of eating sushi, I think I've got a clear image of the desirable environment to enjoy this food; a quiet and calm environment that have both the trendy & traditional accent--Sushi Queen encompassed neither ambiance. 
It is Queen Street, foot traffic is always heavy, and the clientèle varies by work hours.  The only memorable things about the décor are the miniature geisha doll placed at the side of each table, and the name of the restaurant on the ceiling if you ever forget where you were.  Claire pointed that little detail out for me, however, I'm the type of person who looks down when in thought, so I would have appreciated that the name be imprinted on the floor instead.

Spicy tuna, spider roll, some deep fried roll that looked really good on the menu, calamari.  I think I ordered crab roll as well, this is definitely a possibility. 
The food was not remarkable by any means, and I was disappointed by the calamari.  This dish didn't taste like it would have been indigenous to any Japanese region, but rather something that would have been available at any English pub.  Either way, it costs sushi prices to eat here, and I just didn't feel like I got my money's worth.  

Sushi Queen certainly earns no seal on the Street we've named in reference to our Head of State, and this was not how I imagined ending the day after my first time visiting a Picasso exhibit.  The only reason I'm not giving it a one star is because the service didn't offend me, and I like geisha dolls.


So, any guesses on what's they'll call that imaginary restaurant I made up if it ever opens?"}
{"text":"Food is so-so- Not bad but not great. 
The combo boxes have good portions though."}
{"text":"Their vegetarian options are generally okay but go through wierd phases of being lack luster. The food is not nearly as bad as some of the places I've been to in Toronto though, so I have eaten a lot of late night Sushi Queen due to it being so close. If you consider yourself a sushi snob, do not come here cause you most likely will not like it.

On the other hand,  the service is TERRIBLE and has been getting progressively worse over the past two years. The newer waitresses do not know the menu like they used to due to the implementation of iPad ordering. If you order off the regular menu, they forget items or bring the wrong thing. I recently had to remind the waitress that my meal comes with rolls and miso soup along with the bento, about 15 mins after I had received the bento. She didn't appear concerned and only refilled my tea once. I used to be able to drink about 5 glasses with my meal and now you have to flag down a waitress to even get a second."}
{"text":"After going for a little skate, my boyfriend and I decided we would head down to another sushi joint that we always go when we're feeling for sushi. As we were walking down Queen we noticed this little spot and decided to give it a try. The food was pretty good and came out pretty quick (it was around 8pm on a Saturday/a handful of tables filled) and the service was good and prompt. I would defiantly recommend this place for the price, quality and service :)"}
{"text":"There should be half-star ratings on here. I'm reluctant to give the full on four star rating for Sushi Queen and it deserves a little more than an a-okay according to my taste buds. 
I've had takeout lunch and the bento box was enough to save for dinner. The tempura was crispy and tasty but the sushi was a bit on the mushy side.
I tried the vegetarian sushi pizza. This is a real treat for me since most japanese restaurants don't cater towards vegetarians. It was came with slices of avocado, stringy wakame and marinated shiitake mushrooms on top. yum! 
The tempura yam sushi wasn't as good. It was crispy but the the rice was a bit mushy and i think i might've embarrassed myself by trying to fit an entire piece in my mouth. as big as my mouth is, the sushi pieces are far too large to jam one in whole. wait, this is starting to sound bad. 
the wait staff come to your table often to see if everything is okay. they did forget to charge me for my drinks but I fear karma so I pointed out their mistake.
It's not authentic japanese food by any means but I prefer it more than Hosu or Sushi Time down the street."}
{"text":"My friend and I passed by this place on our shopping missions inTO and found it to be a great lil sushi spot!

The sashimi was uber fresh, as well as the Uni we sampled there which is super important cuz if the  uni and Tamago is not fresh in an establishment then you know the rest of the items suck...

very reasonably priced, would def go back if around the neighborhood!"}
{"text":"The food is medicore and the service is rude.  I went to try this place out with an old friend. Nothing bout the sushi was so great. Service wasn't that pleasent either. 

Upon paying the bill and leaving. The server had the nerve to ask for a tip. 
I usually tip if the service is great but nothing so great bout it. NEVER GONG BACK."}
{"text":"I've overall had good experiences, but last night has had me abandon it.    We sat down.  No one was there to greet us.  So we sat ourselves, and waited for 10 minutes or so before I searched around for a waitress.      

I ordered pan fried spinach ... there were two hairs in it.

One of my sushi rolls had a hair in it.   And they only gave us one dish for soya sauce.  So, again, I had to get up and search out a waitress.

The table top card holder for specials etc. looked like it hadn't been washed ... ever."}
{"text":"Friend of mine suggested this place. The interior is nice, the food was OK but the service was really slow. Maybe it's because it was packed, maybe it's a common thing. Deal-breaker for me is when I ordered Philadelphia rolls and the smoked salmon tasted like it was a month old. I was really looking forward to it too..."}
{"text":"I guess for a Queen Street Sushi place....it is ok, but I would've still opt for a different sushi place on Queen Street than this one. I can't even remember what I ordered, because nothing stood out.......everything was just meh ~ The place is nicely decorated, sushi is nicely rolled...haha....taste wasn't bad but nothing stood out. So ...meh~ sounds right."}
{"text":"No pain at Sushi Queen! My 'high-class' stomach that stages incredibly painful protests at the touch of unclean sashimi and sushi endorses Sushi Queen.  It's a risk for me to have raw fish as my stomach turns at a lot of the unmemorable sushi places in Toronto.  A stomach-of-iron, I definitely have not. Experience has taught me to treat my finicky innards with delicacy.  However, I just love sushi.  Even pain can't turn me away from trying out different sushi joints around town to seek out the clean, delicious texture of raw fish.  Sushi Queen, I salute you.

The red dragon roll in all its red tuna covered glory is a must-try.  The grilled-stuff-on-a-stick appetizer was completely over-cooked.  The mixed mushroom in a mini-wok was so good, and so too, was the grilled tofu steak.  

The interior of Sushi Queen is a refreshing break from the hecticness of Queen Street West outside.  Will be back soon!"}
{"text":"Medium Service, mostly because they are very busy, and with this comes a NYC attitude of \"what do you want\".

But I still gave it 5 stars, because of the quality and the price. Two of us had large beers, and shared 5 rolls, and our bill total was right at $50.

I was so good the first night, I went back the next day."}
{"text":"Ordered the tuna sushi pizza and was ok. Service was kinda weird.  She was kinda out of it.  Didn't make me feel comfortable which is why I stayed away from the oysters what I originally came in for."}
{"text":"I've eaten here about 4-5 times over the year and I love it. It's a great place for a date or with friends. It doesn't the ambiance of a luxurious restaurant, but the food is reasonably priced and filling. I never had to wait to be seated (even during nuit blanche), and the food arrives pretty fast. The restaurant is opened pretty late, but I'm not sure if that was only because of nuit blanche."}
{"text":"I'm very dissapointed :( I usually go to the original location in Concord and it's one of my favorite places in Charlotte. 

The new location looks great and it's nice there's so much more seating than the other one and is so much closer to my work so I was really looking forward to my lunch today. Sadly, it was not the same. I ordered a specialty roll (the veggie lover) that's $8.95 +$1 for soy paper and they made the wrong one, kind of similar ingredients but a cheaper and more basic roll, so for a $10 roll it felt like I was getting gypped. Plus, they only gave one packet of soy sauce for an 8 piece roll? I ordered a side of grilled tofu with teriyaki sauce and they didn't put the sauce on it, it was just soy sauce or something similar. The staff at original sushi queen definitely put more care and attention into their work. It wasn't busy and it took 20 minutes for my order to be ready so I don't understand how they missed on the details. 

My salad was fine, no real way to screw that up. So they missed on 2/3 and that's kind of sad, for $18 I should have enjoyed my lunch more. I would have given fewer stars but maybe this was a fluke; I'll give this location another chance... at some point."}
{"text":"Wow I am really surprised at the unfortunate low rating and reviews that Sushi Queen has received.  I have been visiting SQ for over 2 years now and have never had a bad experience before.  I enjoy it here because the prices are competitively affordable with the highest quality in the downtown ones I have visited.  

Our usual orders are spider roll, dynamite roll, avocado roll (best I ever had), green and red dragon roll, seaweed salad,  grilled squid and various sashimi which has all been very fresh.

The interior has been renovated throughout the past few years , it's sorta dark and intimate atmosphere but gets very loud when it's busy.  They also have some joint service with Tea 168 (I think) upstairs so you can order bubble tea drinks etc. 

This is definitely always my go to when I feel like sushi and I'm in the downtown area!!!"}
{"text":"I have been waiting for this place to open: 

QUEEN CITY WELCOMES SUSHI QUEEN!! 

I LOVE LOVE LOVE THIS PLACE!!!!! I sooooo happy they opened another location that's closer to me. I would go to the one in concord, now that's one is closer to me (big smile). SERVICE WAS GREAT!! GREAT SUSHI (AS ALWAYS)! This is HANDS DOWN THE BEST SUSHI PLACE, both of their locations. The prices are not outrageous. 

The decor is sample and cute. The wall art is ABSOLUTELY BEAUTIFUL, I sure it was hand painted! Clean and new. It's big with plenty of table and chairs. Even a table for parties. They have a area to wait and for to-go order and also a bar area. The staff is nice and friendly just like the other location. 

WHAT IS IT NOT TO LIKE ABOOT THIS PLACE!! JOB WELL DONE SUSHI QUEEN."}
{"text":"some people swear by Sushi Time, some by Hosu but im a Sushi Queen loyalist! great list of vegi options and the mushroom tofu stew is awesome!!!! ps the yellow tail roll is waaaay better here than at the other queen street sushi joints!"}
{"text":"First time at Sushi Queen, and I had a lot of expectations. I had the Sexy Dragon, and boy was it Sexy! Each bit was delicious. I'm not a huge fan of raw fish, but this was beyond amazing, I could not taste the raw fish. As appetizers, I got Panko Chicken with Spicy Mayo. The Panko Chicken did not deserve the Spicy Mayo. Spicy Mayo has a distinct taste with a kick that just did not settle well with the Panko Chicken. I also got the Fresh Spring Rolls. Would not recommend getting it because I have had better Spring Rolls. Sure, it was different with the noodles being thinner, but it just did not taste the same as with the thicker noodles. The sauce that came with the Spring Rolls, I would not recommend dipping into it because it was too strong--tasted like Dish Soap, if I am being honest. Overall, I would definitely go back for the awesome rolls of sushi, great customer service, and artwork that definitely makes the place homie."}
{"text":"Firstly- the server looked like we had ruined her day just by being there.  I can't remember the last time that I had such a cold welcome at a restaurant.

Anyways- onto the food.

The good points:
Their slushies were great.  We had a lychee and a cherry- both delicious and full of ice headaches.  Take the plunge and grab one if you're there.
The tuna sashimi had a good texture and flavor although it was cut pretty small.
The spicy salmon roll had a good crunch and perfect amount of the spicy mayo to be able to enjoy it without burning from the inside for the following five hours.
Prices are okay.

The low points:
Salmon sashimi.  Mushy and literally falls apart when you try to pick it up.  Was the fish market closed yesterday? Was it previously frozen? Who knows.
The basic green salad.  The dressing isn't good and it tasted like there was wasabi in it, which I'm not really looking for in a salad dressing.  Texture also wasn't good- kind of chunky.
The Philly Roll- actually horrible.  The cream cheese was the high point, but the 'smoked salmon' was discolored and actually made me gag at one point and I love smoked salmon- but this was some of the most sub par smoked salmon I've ever had.
The service. Again, cold reception, gave me an usual look the whole time I was ordering- I have no idea what her deal was, but I'm sorry that she was so miserable today.  Or if that's just her regular personality- I'm sorry for that, too.

We'll never go here again, but I'd recommend that, if you do- try something other than the actual sushi.  There's too many other GOOD sushi restaurants right in that same area that you should never have to."}
{"text":"Came here for a quick lunch on a weekday. They have very reasonably priced bento box/lunch combos, and their service makes it ideal for a business lunch. On the other hand, the store itself is not as posh or refined as some of the other sushi places along Queen West. The air conditioning seemed off as well, making for a bit of a stuffier environment. 

I had the salmon teriyaki box with tempura and California rolls, while my friend had the chicken teriyaki box. I wouldn't recommend the salmon -- it was a bit bitter from the grilling. The tempura was done quite well, actually, and I enjoyed it -- the batter was not too heavy and it didn't have a stale oil taste! The California rolls were not as great as the ones you might get at a place that specializes in sushi.

Overall the food was fine. The ingredients seemed to be fresh. The restaurant isn't too loud -- just a bit warm. I might come back for a good deal and out of convenience, but not necessarily for the food."}
{"text":"Love it!! There are 2 locations and I love them both. The creamy crab salad (I think that's the name) and the turkey egg rolls are the greatest things on this planet. There best sushi around"}
{"text":"If you want to wait 2 hours for a sushi dinner, come to this place. A full house with 2 cooks and 2 waitresses. Tai tea was sweet beyond belief, not your traditional tai tea. Can be better for sure."}
{"text":"I wasn't that impressed with Sushi Queen.  If you've read one of my reviews before, you know I base my indication of a good Japanese restaurant on the fried rice.  Well, the fried rice was simply just that.  No \"oooo\" and no \"ahhhs.\"  I ordered the hibachi shrimp and I didn't find it to be appetizing either.  More seasoning could have help some.

However, the customer service is great!  The décor is really trendy and eye catching.  It is very spacious as well.  I could see it being a accommodating for a group."}
{"text":"Really nice interior. Large, open space with modern furniture and high ceilings. A plus to me!

We stopped by around 5:30 pm to try it for dinner before a 7 pm movie. It was pretty empty but I think they just opened this location.

I got the Fantasy roll that was $3 off and the Orange Dragon roll plus some Edamame as an app. 

The Edamame was a generous bowl and was served very warm. It was good but should have come out long before our meals but was served right before it so we only ate a few.

My husband got the Teriyaki chicken plate with a California roll on the side.

My husband's meal was chicken, rice, and some veggies. It came with a big squeeze bottle of shrimp sauce which he said was tasty. He really loves boring California rolls so as far as they go he was a fan 

The Fantasy roll was just 5 pieces and it was warm which I didn't love but it was spicy which I did love :-) The Orange Dragon was legit! I would get that again!

Fast service and pretty decent sushi although I feel like it was overpriced (11-13 a roll). They have cheaper rolls but they were smaller. I think the Fantasy roll was WAY overpriced for the amount of food. 

I feel like a lot of the rolls were the same or very similar so I couldn't really tell the difference between them. Our server was good at recommending options for us.

We would probably eat there again because it's close to home and we don't have to go downtown"}
{"text":"Although I noticed this place had bad ratings on yelp, I decided to give this place a try anyways. Big mistake..... I walked in around 8:30 pm on a Wednesday night and noticed the place was quite empty. First thing I noticed was our soy sauce dish was dirty. We grabbed another one and continued to order.

I took a bite out of the green dragon roll and noticed it tasted different. The saran wrap was still on the roll! Other things I noticed was:

-ribs were soft and not tasty
-dumplings were not deep fried, just boiled
-sushi pieces in general were too big
-eel was okay

Overall: I paid $23.99 for AYCE at this joint and I can assure you it is not worth it. This place is dirty, has slow service and low quality food."}
{"text":"My friend brought me here stating it as his new favourite, adding he'd \"been a million times\". We got a nice seat by the window and our food arrived extraordinarily quickly. My golden dragon roll was still warm when it came. Nice, quick, cheap."}
{"text":"Roaming around Eaton Center on Saturday evening after the the Jays game Iriana and I were contemplating where to eat.  Thankfully the Yelp mobile app came to the rescue.  
When it came to sushi, the Sushi Queen seemed to be the go-to place to try.  Though the reviews were, for the most part average, we both thought we'd give this place a try. 
The restaurant is small, clean and has a modern interior look. however though the looks can be deceiving the true test is in the presentation,  freshness, and taste of the food.  Both Iri and I were quite impressed. Among notables, the dynamite rolls, guma roll (topped with spinach), Alaska roll, shrimp/veg tempura and edamame. Overall rating of the food and service is approximately 4.5/5!
I would definitely come back to this sushi joint and add it to my list of go-to sushi places in the downtown area.  The only drawback to this place was the awful stench in the men's restroom! Lol I had to hold my breath....Damn people need to have proper aim...if you know what I'm saying."}
{"text":"Horrible is an understatement.  Even the simple house salad was gross. Why bother these loons have no idea what service is and food is overpriced and served with a dose of apathy. Send your enemies and warn your friends."}
{"text":"Used to like it- came back after over a year. Now it's an all you can eat place... Quality has really gone downhill. We ordered from the a la carte menu but the quality was still terrible. Maki rolls were fishy and had way too much rice. They were also served immediately which made me think that they were pre-made ... Appetizers were not served until much later. Service was also slow and had to go looking for waiters.

There's definitely better places in toronto for the same kind of money.. I don't recommend this restaurant."}
{"text":"Strolling around Queen St on a Sat afternoon, I decided to enter here for dinner. 

I ordered the gyoza and the spicy salmon maki.  The maki was delicious. Pieces of tempura added a bit of texture. But the sushi was rolled sloppily. The gyoza was crispy. I don't like my gyoza dumplings crispy.  It didn't sit well with me.

But it was not busy and I had good service."}
{"text":"Inexpensive and relatively fast sushi. Is it the absolute finest or most artfully plated? No, but definitely acceptable."}
{"text":"Good value for the sushi. I am a fan of the Salmon Lover dish for dinner... includes rolls, sushi and sashimi. If you're looking for a quiet spot for a quick sushi fix this is the place to go!"}
{"text":"First Time going here. They have really quick service! Very cheap lunch bentos! And options for Vegetarians like me!!"}
{"text":"Serviceable sushi and Japanese at Sushi Queen, but it feels like they need a restaurant tuneup

I like to give a new restaurant the benefit of the doubt, but these guys need to pick it up or they will lose people.

The servers were nice, but they seemed a little \"green\" when we were ordering.

I had to keep repeating what I wanted and eventually moved to pointing at items on the menu to confirm.

It was pretty empty and yet, our basic order for three took 25 minutes.

While that's not long on a busy night, it seemed an eternity in an empty restaurant.  There were literally only two other tables.

They never brought me my soup. Argh.

Overall, SQ is decent enough, but seemed a little rough around the edges, like a new restaurant with new staff. I hope it improves."}
{"text":"There are too many great sushi restaurants in Toronto for this place to exist- particularly in this area. Our server was very unwelcoming, she did not smile even once or check in on our table (even when it was clear we were finished). She had been joking/laughing with her co-workers but remained icy in her demeanour toward us. She did not refill our drinks. All of our food was exceptionally salty. We will not be returning and do not recommend to others."}
{"text":"I went to Sushi Queen on a weekday with a friend for lunch and asked if they were doing all you can eat and the waitress all of a sudden got really mad and started to bolsting out bunch of high prices to scare us. Since all you can ear was what we were hoping for and we were willing to pay the price, we opted for the service. As the waitress walked away from our table, she complained very loudly in mandarin to her work colleagues that we were idiots whom she couldn't talk down to ordering just a bento box. Little did she knew, my friend was a native mandarin speaker, and he understood everything. Throughout the service we were treated rudely, especially from this certain waitess. When we were paying our bill, we noticed that a 15% tip was already included. We were never given the choice to give her the amount of tip that we thought she deserved. And of course this 15% tip was never mentioned to us. A final note, it was not the first time my mandarin speaking friend has heard Sushi Queen's employees critizing customers loudly in mandarin to each other, sometimes even with profanity. Except that this time we were the targets.

http://www.tripadvisor.fr"}
{"text":"My wife has been going on about this place for years and we finally went. It was not worth the trip. The portions were small, the food didn't taste fresh & the service wasn't friendly. We had one nice server but the rest looked like they had something up their butts needless to say I won't be back."}
{"text":"Great bento box served here. Nice Miso soup and excellent list of sakes.
Nice and tidy without the kitch of hellokitty or plastic sushi."}
{"text":"I hate leaving bad reviews but in this case, it is deserved and judging by other comments here, the Sushi Queen owners don't read their Yelp reviews.
 Very small portions, embarrassingly bad service (youngish waitress who gives you the F Off look as soon as you ask for the menu and throws your plates down when the food is ready). The food did not look, taste and smell safe to eat, I can usually stomach anything within some limits.
My soba noodles had rock hard slices of raw cabbage and almost raw onions, dripping in oil and totally unpalatable.  I only order vegetarian but my noodles smelled like meat (recycled oil damnit..). My husband half-heartedly worked on his eel/rice dish but kept on making \"WTF\" faces LOL
We were out $50 and still starving, no one wanted to eat their food. I wish we returned everything we ordered but it's hard when your kids are hungry and you're hungry-enough to trust what's placed in front of you. Never again."}
{"text":"Eh. I figured I'd give this place a try because I'm still on the hunt for a  go-to sushi place around here. Plain and simply, it's overpriced. It wasn't bad, but it wasn't great either. The specialty roll I got (the sexy dragon) wasn't worth the near $13 I paid for it. Not nearly enough eel sauce (which, in the future, maybe consider putting the sauces on the side for to go orders) and far too much rice. Luckily, I checked the soy sauce situation before  I left and saw they only included one. Who only uses one pack of soy sauce for an 8-piece roll? It was decent enough that I'll try more things, but for first impressions sake, I'm not in love."}
{"text":"Decided to check them out yesterday for lunch the food was fresh and cooked to order which is always a good thing for me. The only bad thing I would say is the carrots were way over cooked and the chicken needed a little more flavor and seasoning ."}
{"text":"I went to lunch here twice for work and I can officially say that I hate this place, thank you very much and that I'm never coming back here again.  They have the usual run-of-the-mill items on their menu with bento box lunches, nothing special.  Their salad dressing sucks, their service sucks, the food especially sucks.  If you want sushi to be ruined for you, this is the place to go.

Service there is not friendly, they never check up on you, when you ask them to bring you wasabi and ginger they forget to bring it and you have to chase them down for your bill.  The spicy salmon roll was made out of mushy rice and a lot of it, I had to take the rice off, there was so much.  I'm especially mad because we had to walk up to the front to pay for the bill because nobody came to give us the bill today and even more mad because they ruined my already failing fad-of-the-week low-carb diet.

No freebies like many other Japanese restaurants either, although I wouldn't take a star off for this reason, but in this case there aren't any stars left to deduct anyways, so I figured I'd just mention it anyways for the hell of it."}
{"text":"They have weird hours but their sushi is great and they have sushi specials. I really liked it and will be a regular customer. The wait staff was very friendly, professional, and timely. The sushi rolls were really fresh and the restaurant was really clean. All in all it's worth it"}
{"text":"My son and I ate here just after 12 on a Saturday afternoon. We enjoyed our food and experience. We waited about 1 minute for our seats and then we were promptly escorted to our seats and gave our drink orders. The decor is very nice. They have two lakefront minerals and various original art pieces on the wall. They played nice music and the atmosphere was inviting. The sushi was good. Although, I must admit that we are not sushi snobs. The prices are fair and I enjoyed the special..OMG roll. We will return."}
{"text":"Said I wanted good sushi at a good price and my co worked took me here and she was right. Good sushi at a reasonable price. They have some very filling be to boxes for lunch that are between 10 to 14 dollars. The salmon is nice and fresh with is a must for me. 

If you are downtown, want good sushi but don't want to pay insane amount for it, this is the place for you."}
{"text":"Had a cold welcome and the sushi was not fresh. We were given a bad batch of (expired) mango yogurt dessert and lost appetite after. We watched them throw the whole can of mango out once they tasted it for themselves. The acidic taste still lingers in my mouth even after returning home. Waving down the waiter was also a hassle because of them chattering with each other.

On the good side, the seats were comfortable.

I won't be coming back ever again because of the bad service and the lack of freshness in their food."}
{"text":"I'm a migraine sufferer and MSG is probably my biggest trigger. After eating sushi at this restaurant (one cooked salmon roll, one udon soup), I began to feel extremely sleepy... the first sign of MSG. A few hours later I had a migraine which persisted until the next day.

Will never eat at this restaurant again."}
{"text":"I also stumbled upon this place after an exhausting bout of shopping. Though I have been a sushi-ignorer for the majority of my life, I was recently forced to face my fear of fish and raw things head on when my usual \"anything but sushi\" clause recently failed to work on an out-of-town friend. I have found the perfect alternative to vetoing the plans of others: the bento box!

So, hardly a sushi connoisseur, my verdict on the (mostly) vegetarian box named after a popular Toronto street is: pretty delicious. The volume and taste and relative cheapness for these things just amazes me, and in my experience, it was one of the better ones I've had. 

The restaurant is on the slightly more classy-looking side (I'm still talking in the cheap range, here, remember), appropriate for a nice sit-down dinner, and the portions are just slightly smaller enough (the rolls, a little skinnier than I am used to seeing) to believe that the quality must be higher (I am being at least half-facetious). Oh, and my dinner date (a sushi-lover if I have ever known one) said their sushi was mighty fine, too."}
{"text":"Quality has gone severely downhill since they turned into an AYCE place. Last time I went, I found a bone in my salmon sashimi! Their sushi was surrounded by way too much rice and the ingredients they use are not very fresh. I left feeling mildly ill/disgusted. The only redeeming thing about this place is their all you can drink bubble tea for 2.99 which is nice."}
{"text":"Sushi is okay, slightly better than prepackaged sushi. I've been here twice now because my friend keeps insisting on doing so, not because I want to. Had the Black Dragon roll and found my eel to have bones, which I've never had before. One thing I do like here is the takoyaki. Service is horrible, they don't quite listen and it takes a while to get their attention for anything i.e. more water/tea or the bill. Never coming here again."}
{"text":"Have ordered here several times and had a decent meal. This last time, it took over 2 hours for the sushi to arrive and I live a few blocks away. It wouldn't normally be that big of a deal but when I called to enquire as to what the delay was, the person who answered the phone was extremely rude. She told me she could not control traffic and hung up the phone. For average sushi, it's not worth even a small headache or a long wait. Order from elsewhere. I used to be a regular (weekly orders) but they have lost my business."}
{"text":"Last night before a show at the COC we met for dinner at Sushi Queen. The restaurant is located beside the Queen Mother Cafe and has been there as long as I can remember and serves up reliable and straight-forward Queen Street sushi. The place is long and narrow with the sushi bar located at the front of the restaurant by the entrance. Beyond that lay two sections of seating, a front section split into large booths and a small set of tables sent against a long banquette and a back section of more tables. While waiting for friends to arrive I had a seaweed salad that was really good for the price paid. I thought I might have a few appetizers for dinner, enjoying a sampling of different flavours and textures but instead opted for a simple makimono plate (salmon roll, tuna roll and California roll). The place was packed and while the service can be lax because tit can get really busy we enjoyed what was served. It is the perfect place for a quick dinner before a show."}
{"text":"Sushi Queen is like every other inexpensive sushi place in Toronto (any on Queen St., or like any other in the Annex).  Lots of mixed rolls.  Fish seems like it's not fresh - frozen before, and somewhat mealy - disappointing!  

On the plus side, the restaurant has pretty nice staff, and an Interesting selection of Sushi Pizzas - I had previously only saw salmon sushi pizzas before.  Prices are cheap here too."}
{"text":"this is my go to place for sushi, amazing flavor, amazing variety, everything about this resturant makes me happy. it's par for the course on sushi pricing, but the flavor and service is Bar none. my only compliant is that this place is not an AYCE sushi place.
would recommend to anyone and everyone who likes fish"}
{"text":"It's my first time here at sushi queen. This is a small all you can eat restaurant but pretty cozy. It's clean and the food was really good. They had a Lot of variety to choose from the menu and the staff were very attentive. Overall I had an excellent experience here."}
