{"text":"I love sushi and I went out to grab one right away when I found out it was near my office! The quality is not too bad. The ingredient were fresh and it was a good meal. I got the sushi special which includes tuna, white tuna, salmon, tobiko, tamago, imitation crab, cucumber, avocado, and mayonnaise. In essence, it is a big sushi roll that isn't cut up. I did find it a bit messy to eat with just my hands. They provide a small soy sauce packet, and I find that challenging to juggle the roll and open soy sauce while I'm walking. The roll does explode a bit when I try to bite through everything. The nori (seaweed) is a bit soggy as I think they probably pre-made a bunch before the lunch hour rush. You get the sushi special half-roll for $10, and a full roll for $16. The half roll would be equivalent to a dynamic roll cut up into 6-8 pieces. I enjoyed the novelty of it. Would I actively pursue to try again? Probably not. Would I eat it again? Maybe if I cross path with it and I have a strong sushi craving. Definitely worth a try if you have not experienced it."}
{"text":"I had the sushiburri special ($10 for half), and it was delicious! Yes, it's just an oversized handroll, but it tasted so fresh and yummy. Grab a whole one for $16 and share with a friend or save half for later. They were at Mel Lastman today at the farmer's market. I was there at 11:45, so I beat the lunch mob. Service was quick. Hopefully I see the truck again so I can try their other stuff."}
{"text":"If sushi is a refined experience with chopsticks and a tranquil setting, Sushiburri is the complete opposite of that.

I usually get the Special which has salmon, tuna, white tuna, roe, avocado, and slaw among other yummy ingredients.

Biting into it is a hands on messy experience as the sushi toppings don't stay in place with the seaweed wrap. Everything is delicious and with the slaw and burrito sauce, you get a bit of the burrito experience as well. I always manage to get some on my hands as well.

Sushiburri did a great thing by making sushi fun."}
{"text":"I got the Full Size Sushi Special (Tuna, White Tuna, Salmon) for $16 which is essentially 2x of their $10 half portion. This is so expensive considering other places like Sushitto charge $13.
- First thing I notice is the size is not consistent. One of my half is bigger than the other.
- Overall taste is bland
- Seaweed was soggy
- Seaweed didn't wrap around the entire burrito so it falls apart as I am just a few bites in
- It's so watery! As I grab my half, stuff started leaking and even squirted into the table! I haven't even put soy sauce yet. This might mean it's using recently thawed fish!"}
{"text":"LOVE sushi burrito! I've been eyeing this new food trend for a while and I finally \"caught\" a food truck last Saturday, which may have been their soft opening. They even had discounts on everything. Parked outside Toronto General Hospital, it was relatively quiet since it was before 12pm and there were no lines! I must try!

I had their sushiburri special, which featured salmon, tuna, a black fish roe, generous amounts of cucumbers, cabbage, \"crab meat\" and avocado. It also had a big glop of cream cheese in it which I didn't fancy. I never liked cream cheese with sushi. The rice was fresh and soft and was glued to the seaweed wrap, which made it easy to bite into. For me I needed one pack of soya sauce per half a burrito. If you had every dreamed of a mouth fulllllll of sushi this is the way to do it. It did get messy at the end of the burrito because it's open, but I didn't mind because I was eating outside!

The service was good and they have their menu nicely displayed on the side with pictures (unlike their competitor)! The girl was really nice and explained all the ingredients to me. They had a garbage can outside for your garbage and played music! Be sure to follow them to know their next location (https://twitter.com/Sushiburritoto?ref_src=twsrc%5Etfw). Overall I think that their burrito menu is quite similar to sushitto, but they also offer Poke bowls, can't wait to try that NEXT! I'm sure the market right now have plenty of room for more than one sushi burrito truck!"}
{"text":"Ahhh the sushi burrito. Another North American invention that took something that existed already and just made it BIGGGEEERR. But is it better? I've had sushi burritos from a couple difference places now and my verdict is: they're alright. I mean, all they are are giant sushi rolls. Expensive giant sushi rolls. 

However, Sushiburri is probably the better one out of the bunch. It's filled to the edge with fresh ingredients that actually tasted really good together. I got the Unagi (Eel) burrito which included a good portion of Unagi, imitation crab meat, cucumber, and strangely....Gai Lan, or Chinese broccoli. But it worked! The entire thing was delicious! 

So why not a higher rating? Well first of all, the wait time was pretty ridiculous (lunch rush on a Friday @ Roy Thompson Hall). I understand there's probably a lot of manual effort into making each burrito, but people waited 20 mins and upwards at the food truck . The huge line you see? Yeah, those are people waiting for their order, not to actually order. 

Also, I am just not buying the value to portion ratio here. Got a half burrito for $8, this was after the $1 off opening promo they had. I don't think I have a huge appetite but I wasn't full at all. And for ~$10, you can get a bowl of ramen, or an actual sushi roll that's relatively fancy and probably more filling at a real sushi place.

Overall though, this place is a solid 3.5 and a good place to go if you want to get in on the sushi burrito idea. The truck is cute, the people are nice, and the food is tasty. The fad isn't for me, but if it's your thing, sushi hurry to the Sushiburri!

(75/100) - 2016"}
{"text":"These guys took over a parking spot previously held by Sushitto (at the Royal Alex) and confused me. I didn't realize until after I ordered that it was a different truck altogether. While OK, it was not as good as Sushitto! The size was smaller and the wrapping was horrible at the bottom. I basically had to eat the last bit on a plate with chopsticks! There's no way you could actually just eat this \"on-the-go\"without getting your hands dirty.

I would say though, that the Sushiburri truck itself looks much nicer and cleaner than the Sushitto one. The Sushiburri branding on the packaging is also way cuter!"}
{"text":"I have seen some pretty bad-looking sushi burritos in Toronto on social media... to the point where it makes me so upset to see people pay money for it. For example, too much rice, too little fillings, small size, not that fresh looking tuna (grayish...) etc. I didn't even want to try any of them until this food truck appeared recently. When I saw pictures of their sushi burritos, I had to try them. 

YUMMM it was hard to eat (get prepared to get messy and look ugly towards the end because the nori is chewy and hard to have a clean bite) BUT totally worth it!!! We ordered sushi special which had good amount of fresh tuna sashimi, tamago aka Japanese omelette, cucumber, avocado, cabbage and fish roe. The best thing about this place is the rice to fiiling ratio is actually perfect. My boyfriend and I shared the full size, and we both were full after. We could have eaten more just because it was so good. They give you soy sauce but we didn't even use it as the sushi burrito itself was already well-seasoned and flavourful. For $16 for two, this really was a good deal. (We got $2 off because they were still having a grand-opening promo. They don't have it anymore). They have a variety of other sushi burritos, and if you are not a fan of sashimi you can also get bulgogi (soy sauce based marinated meat) or vegetarian.

Overall, totally worth to try it! We walked 15min just to get this and it was well worth it. They only accept cash btw so have some cash ready!"}
{"text":"Amazing experience. Great customer service, generous portion. If you love spicy definitely try spicy salmon. You wont regret it."}
{"text":"Came across the truck with two friends when we were wandering the Yonge/Finch area.  We ended up getting full-sized sushi burritos for the Bulgogi, Spicy Salmon, and Classic.  In all honesty, we were very surprised by how much was packed away in the burrito!  (Two of us were on our way to being mostly full by the time we got to the second half of our burritos.)  I think the truck goes around the city quite a bit but if I see it again, I'll probably get something from them again!"}
{"text":"Overall it is 3.5 stars.

I ordered a Salmon Poke Bowl ($10).  Salmon was fresh; rice was flavourful.  It was a refreshing food in a hot summer day.  The quality was good, but the portion was barely okay.  The plate looked big, but it was shallow.  The portion was sufficient for a female of average appetite or a male of small appetite.  If you are a big eater, you may want to order a side or something to top up."}
{"text":"Tried this sushi burrito truck when it came to North York Centre two weeks ago. I wanted to try their bowls but they were sold out so I tried the salmon half sushi burrito instead. 

There is a long 10 mins wait after you order to get the good. For half a burrito it was $10. Pretty expensive if you ask me. 

The burrito itself tasted ok. It comes with mango and avocado. I'm not sure about the flavour combination. Had other salmon burrito from another food truck and it was seriously good. This one was just ok. Maybe it's the too thin layer of mushed rice, or maybe it's the mango. Was interesting but there's better sushi burritos out there"}
{"text":"I had 0 expectations going into Sushiburri because I'm an avid sushi fan and avid poke fan and having been spoilt in LA, I was really walking in with no expectations at all.  I got the salmon poke bowl with no cabbage (b/c cabbage really just ruins everything...).  The portion was surprisingly fair and I was quite full by the end of it.  They do give a good amount of salmon and edamame.  They were quite stingy on their crab and wakame and could have done better there.  Otherwise, it was quite yummy.  

This truck is cash only - which really is quite inconvenient - but there you have it!  I would definitely stop by again for a fair priced work lunch!"}
{"text":"We checked out Sushiburri at TIFF, and the lineup + wait was absolutely atrocious. It took forever for them to finish making our sushi burrito, and when we finally bit into it the contents exploded like a piñata.

We bought a half roll, and if you ever want to try it you should definitely use a fork and dismantle it as much as possible- otherwise the rice will start spilling down on your shirt and end up on the pavement. The eel was barely there- I think we had two bites of unagi before it completely disappeared into our mouths, leaving us with a fat roll of rice and soy sauce. 

It's a very short review because the whole experience was disappointing and not worth the wait or the money. I'm usually pretty lenient on restaurants, but I'd really advise you not to waste your time here. Try some other sushi places!"}
{"text":"Saw this truck park at North York Civic Centre along with a string of other food trucks and was excited to try a sushi burrito! The menu was pretty straightforward, half a burrito is around $8-9 and a whole burrito is $15-16. I got a whole Unagi Burrito and was pleasantly surprised, fresh ingredients and not too much rice. The burrito comes with soy sauce but the burrito is so flavourful that I found I didn't need it.

They also have Poki bowls for around $10 and the size of the container looked very reasonable so I will definitely try the Poki bowl next time! I suppose the time I went to the truck was not during rush so the wait was perhaps 5-10minutes tops. 

I didn't give them 5* because I felt the burritos are on the pricey side for essentially an oversized mega hand roll. In comparison with the Poki bowl, I suspect the contents would be more substantial in a bowl than a burrito but I will have to update this review after my second visit to confirm my suspicions.

Overall, definitely worth a try and very delicious! Get the whole wrap, it is better value than the half and they cut it into two halves so you can save the other half for later if you can't finish it in one go."}
{"text":"If you do actually manage to get your hands on some food from here, it is decent. 

I came here during TIFF when they blocked off a section of King Street that's right on the edge of the financial district. When I went there for a second lunch one day *sheepish smile* at about 4pm on a Thursday, there was a very short line and I was able to get my food quite quickly, with no fuss. I had half a Sushi Special, which seemed to have a bit of everything (and mango! I love mango!) - it was good, even though my tuna was a little sinewy. 

However, to be honest, I preferred the sushi burrito I had at Rolltation because this one had no sauce in it - it came with a packet of soy sauce instead. I wonder if it's because some of the previous reviewers complained about sogginess. It's very hard to eat with a packet of soy because soy sauce is very salty, and if you pour it into your roll (as opposed to dipping it, which would require another container to hold the sauce in), the soy sauce pools at the bottom and it makes for a very messy, VERY salty last few bites. Besides this, I think that a special aioli or some other kind of sauce really takes the flavour profile to the next level and makes the meal much more interesting.

So why did I say that it's good IF you manage to get some food here?

The next day, which was the Friday of TIFF opening weekend, there were a TON of people and Sushiburri just wasn't equipped to handle that crowd. I also decided to come here with a colleague at a more conventional lunch time, which was a huge mistake. She waited in line for a good 35 minutes before she could order, and after she placed her order, they were still serving #70something and she was #100! Besides that, as the line inched forward, they kept announcing that they were out of some fish or another so that by the time it was her turn, she had to opt for something that wasn't what she originally wanted to try at all.

As the minutes ticked by, they kept saying it would be another 10 minutes for the food to be ready, but after 3 of those 10 minute blocks, my colleague lost any faith she had that she was going to get her food (plus we were due back at the office), and she asked for her money back. So she was disappointed that she never got to try it after all that waiting. 

Additionally, I find that it's quite expensive - $16 for a full-sized roll or $10 for half, whereas the ones at Rolltation, which taste better in my opinion, are a buck or two cheaper.

Worth a try if you haven't had a sushi burrito before (which, let's face it, is a total gimmick anyway) - but I won't be a repeat customer."}
