{"text":"This place has been groupon'd too many times. I don't think they should even be using groupon...... The building is hard to find from outside because it is small and their sign is small. It looks a bit run down but the inside is fine. Its a small sushi joint with attentive servers. Although the servers have been changed up a few times. Some of them don't speak much English but they are still good. Food prices are fair and portions are really good. The food is always fresh and I prefer this place over many other sushi places. I did get a little frustrated when our orders took over 40 min to arrive but that was because the place was packed with groupon people and i guess they weren't ready to serve a full house. When the food came - all was good....fresh.

They also have really good lunch deals!!!!! If i lived close enough or worked in the area I would order here everyday!"}
{"text":"We went there with a voucher. We wait about 30 min to have a table ready for us. Every items we ordered was in the middle range. Notting special. I had better sushi in the other restaurants with better prices.
Usually I never go to this class of restaurant. I just went because Of the promotion. I don't think I go to this restaurant again."}
{"text":"Please DO NOT GO, it is not worth the money and your time. I used Groupon deal, I sorry that I even tried this. NEVER AGAIN

1. Service - none, unless you understand mandarin.
2. Place - no windows, very dark no atmosphere, I do not know why they call it a restaurant. Menus are dirty and tables too. 
3. Food, where do I start:
a. I ordered coke, they brought me a glass 3/4 full with ice, although I did not ask for ice. When I asked to remove the ice...I received 1/2 empty glass of pop. I am pretty sure that they bought cheap bottles of Coke in no frills and just using these bottles to fill the glasses. 
b. Sushi....ohhh my god, I can make a better sushi then these guys...The fish was warm, and it did not look fresh at all and they were poorly made . My friend refused to eat it. 
c. I ordered sukiyaki..., it was just unbelievable, almost no broth just cabbage and 20 grams of strange tasting meat. 
d. when my friend asked what is inside the seafood sukiyaki their answer was \"shrimp and something like that....\" 
Should I continue, I think this is enough. 

Please do not go there, there are so many good places nearby...why should you waste your time and money, to get food poisoning?!
I was stupid not to go on yelp and read all the reviews. 
Don't be greedy these \"deals\" are not deals at all."}
{"text":"Recently ordered off of justeat.ca. The restaurant is literally 600m away from me. Website said it would take 30 min. Sushi came an hour and a half later! We called a few times and they kept saying it was coming in a few minutes. I was about to cancel the whole order when the guy finally showed up. The sushi is actually good but if you want good service, stay away from this place."}
{"text":"Mediocre sushi. Don't go unless you are saving cash with a groupon... These are offered almost once/week"}
{"text":"Takeout Alert! i didn't dine here, just took home some really yummy sushi
spicy tuna, spicy salmon makis
shrimp tempura maki, avocado roll all hit the spot

I like the good quality fish + avocado inside the spicy rolls

keep up the good work!  (looks to be japanese owned or operated)"}
{"text":"Can only comment on service. Came in for lunch today. Two tables filled of four each. One had just been served their food and the other one started ordering.
I am a single today for lunch, was seated and waited 15 minutes, no one came to give even me water. So, decided on a time line, I am not waiting any longer. 
If it was a full restaurant and many waiting at door, I can be patient. but being 9 people in the place, I should be able to get served. Too bad, very close to my work.
 
Definitely do not recommend this place"}
{"text":"When Sushi Kai first opened, the quality of both the service and the food was quite good (for a Toronto sushi place that is).  With the coming of the new ownership, a dramatic decline can be witnessed.  This will be the last time I ever frequent this establishment.  Dopey, unskilled telephone staff and horrible food quality!  We ordered in and were sorry we did.  The portions also have decreased radically while the prices have increased.  Really bad food."}
{"text":"I've been here many times before and previously the food was ok, the wine was alright and the service fairly normal.  Prices worked out with a groupon.

Now the food has gone downhill, they lost their licence  - well, no wonder - no one could possibly get the smart serve as the untrained children that are serving can not even communicate in English.

Disaster !!!  I give it another month before they close for good."}
{"text":"Dirty dark and dank. It smelled funny, the food was awful. Also refused to honor a groupon because there wasn't two per table. The owner was rude and a close talker. The neighborhood is bloody awful, parking and construction. Worst meal in Toronto. Oh my god please if you have any self preservation. Avoid."}
{"text":"First off, let me say that I LOVE sushi! However, my friends and I had the worst experience at Sushi Kai a couple of weeks ago and I have not been able to even do as much as think of sushi since!

I am truly sorry! I hate to be a hater and start my first review like a big fat DISLIKE button but it must be shared with the world! I feel so strongly about this that I could not hold my disdain internally anymore...this is the reason why I joined Yelp and I believe it's the only way I can ever go back to eating sushi again. 

Please don't expect to find any positive commentary in this review about the restaurant because nothing compares to what my friends and I had to go through. I will be writing nice things about other places later because really I am not a hater...but if you are looking for positive points about Sushi Kai...please proceed to another review, because this is going to be a pure bitch fest...

So, a couple of weeks ago my friends and I decided to have a girls' night out at Sushi Kai...primarily because my friend had 50% coupons, which we happily put to use at the place. Otherwise there is no other reason to go to Sushi Kai. Inside, the place is nothing special in terms of seating arrangements. It is slightly above your average 'hole in the wall' sushi restaurant...far from a fine dining experience, which they try to refer to on the website. 

The service was very bad. The servers took forever to bring us our menus', water and food. We needed to ask for water a couple of times before someone actually brought it to us and the food took longer than the usual 15 minutes to arrive.  I was sure they were gone fishing for salmon! 

When the food finally came, the sushi itself was not good quality. It was literally falling apart...and this is just basic sushi, not even talking about the special rolls. Overall- sushi itself- not amazing! Thank Gawd for wasabi and soya sauce, which made it good enough to eat.  

At the end of the meal, our coupons really went a long way and we were all happily surprised to be paying only approx. $10 each for dinner. However, we all learned that \"You get what you pay for\" ! This does not even do this situation justice because... Little did we know , but all 5 of us were throwing up all the food 24 hours later.  We were all so sick, I could not eat anything for the entire day after and my entire weekend went to waste.  I do not know (nor do I care) if it was stomach flu or bad fish or a virus, but we all got it from this sushi place and were sicker then dogs for 2 days! That's 2 days of my life which I can never get back Sushi Kai!

Arg! At least I lost a lot of weight!  jk

Lesson learned: \"You get what you pay for\" or more like \"Coupons get you less then what you pay for\" or STAY AWAY FROM SUSHI KAI!!!"}
{"text":"Great food. I never imagined that that little place has so much good food. However, the facade of the restaurant does look to attractive but the interior is good and food amazing."}
{"text":"Sushi Kai Japanese Restaurant
Reservation: Yes

I haven't been to Sushi Kai for a while, so I decided to give it a try again.  My daddie took me to a dentist downtown so we decided to eat somewhere downtown and my daddie said they had a new ramen that's pretty good.  Sure, might as well =D

When I looked at the menu, holy moly!!!  There were so many different rolls added onto the menu!!  My daddie and I chose the ramen and lunch time lovers (sushi combo for 2 that comes with lmiso and salad).  The taste of the miso soup was really good, but the seaweed in the soup was stiff and chewy, doesn't seem fresh.  As for the salad, it tastes like one of the salads that I've made before with ginger and soy sauce and garlic.

The sushi came first, so we started munching it down.  The rice was SWEET, for my daddiei and me, it took the taste of the fish away.  And also, the rice wasn't sticking together too well.  The salmon was really soft and dissolving, but it had no taste to it.  Everything else was ok, compared to Towa and El's, it doesn't stand out that much.  The wasabi wasn't strong at all, it barely had any taste to it.  I'm a ginger person, so I forked out some ginger from the jar, the vinegar was so strong that it tookover the spicy taste in the ginger!!!  The vinegar made me squint like crazy!!!

When the ramen came, my daddie and I split it into our bowls and ate it while it was hot.  The soup base we choose was soy sauce so we can taste it.  The soup base was amazingly good!  I thought it was better than Muka (spelling?) on 14st!  The meat was soft and the noodles were just right.  It wasn't too chewy or it wasn't hard.  However, the egg was really gummy, I was trying to split it with my spoon but it wouldn't split!!
They also have 'shun', the smelly asian stuff, if it doesn't say of the menu, make sure you ask about what's in the menu.  Also, if you don't like it, make sure you tell them to not put it in.

Overall, it was good, I would go to Sushi Kai again to taste the other new rolls they have!!

Price Wise (1 being cheap, 5 being expensive):  3/5
Food Quality (1 being not worth it, 5 being totally worth it): 3/5
Service Wise (1 being horrible, 5 being amazing): 4/5"}
{"text":"The best sushi place in the Yonge/Eglinton area and there are so many :) just make sure u go there hungry!!"}
{"text":"I have eaten here a couple of times for lunch recently and I have been impressed by the service, speed and quality of the food. The one problem I have is that their prices are higher than one of the best sushi places in Calgary that is a stones throw down the street in Globefish. The difference I think that Kai has a quieter more subdued atmosphere and because they don't see as many customers, they can focus more on delivery rather than rushing the food out as quickly as possible. I have enjoyed their lunch bento box combinations and have been impressed by their spicy teriyaki chicken and their sushi offerings. I have not tried out their all you can eat offerings but think that if time were not a constraint, it would be something to try. In terms of portions, they are well thought out and in both visits, I have left full but not stuffed."}
{"text":"We had a $20 for $40 worth of food from Groupon and decided to give it a try.   Walking in, it had a nice open space and family atmosphere.

The fish was fresh (better than many AYCE).   I also liked the spider roll, which was really crispy and done well.

All in all, moderate price for good quality food."}
{"text":"We went there for lunch yesterday. The service is very friendly and the food is average.
They did not cut the portion even we used the $20 for $40  Groupon.
Worth to try."}
{"text":"This is our 4th visit, First time for lunch. They practically ignore our family of 4 for 35 minutes and served their regular lunch customers who get to order lunch special discounted prices while we had to pay full price using our groupon voucher. 1hr later remaining food came out after rush was over. My son stomach was aching by then, being hungry and waiting till 1pm.  They also did not bring napkins and plates for 4 we had to ask for remaining 2 plates. Then at the end of our meal we realized waitress missed one order. So we just said we paid and left.  So $2 parking in the apartment buildings nearby and drive from Brampton is really not worth this groupon purchase we won't ever return again. This was kids PA day treat but now got the whole family angry for such a waste of time."}
{"text":"So here's the deal, I would only recommend this place if you were in the neighborhood, and a bonus if you have a coupon to go along with it. You can find coupons for this restaurant on any deal site (dealgetter, dealticker, redflags, etc.), they sell coupons like they're going out of style. I think part of the reason is because they're a so/so restaurant with good to decent sushi depending on the day, but their service definitely needs improvement from the language barrier to attentiveness. It's a quaint and small restaurant with a decent decor. Their only dessert is green tea ice cream. 

I've been there a combined 3 times (every time with a coupon!)  and left satisfied. 

The first time (MAR 2010), I bought a couple of $14 for $40 worth of sushi coupons (really good deal) and took my bf and friends out for his birthday. For the most part service was okay, probably due to the fact that we were the biggest party in the restaurant. We ordered plenty of food including a few bento boxes, tempura, and a couple of boats including the mega salmon sushi boat, which was a real winner (salmon sashimi, salmon sushi [great ratio], salmon avocado rolls and super salmon avocado rolls for $45). Lots of drink refills, good soup, good salad and they never rush you. The bill for 8 people was under $200

The last time I went (JUL 2011) I brought along a few friends and coupons in hand. Ordered a couple of boats, some eel and tempura. The salmon was good as usual, miso soup was pipping hot but the service was a bit more sparse and never received one refill at the table. Bill for 4 people was $39 (with a $15 for $35 coupon), so price wise still better than AYCE sushi."}
{"text":"Service was bad and food was worse.  Do not get the sakiyaki.  For 14 bucks, you get a pound napa, but only 2 shrimps and 2 muscle.  It's a highway robbery."}
{"text":"Tried all you can eat. Not very impressed. Too much of rice on everything!!! It feels like they want us to fill up our stomach with lots of rice. Paying $30/ person is not worth it. They also charged extra for some left over. Well... Do not try Ayce here at least."}
{"text":"Worst...
Worst...
Worst Sushi Place of Toronto (or.... maybe World??)

No surprise why they keep issuing 50% discount vouchers from everywhere.
However, you will soon regret your decision once you get in here.

Forced to wait for more than an hour for getting their boring chirashi bowls.
Not a fan of alomost-gone-bad sashimi on the top of chirashi.
What else can I say?

It was quite surprising to see there are bunch of yelpers who rate this restaurant 5 stars.
Honestly, are you guys doing part time job hired by Sushi Kai?

I don't want to be mean, but seriously, don't waste your time and money here"}
{"text":"I've noticed the little sign outside on 14th Street advertising all you can eat sushi and have been wanting to try it out. Then I looked for reviews and read that it was closed so I gave them a call and found out indeed they were open no problemss!  Well we finally got a chance tonight and it was even better then I hoped for.

The restaurant is small but very cool and nice inside. Being a tuesday night it also wasn't very busy either, but that's ok by me.

All four of us had All you can eat and the price for dinner is $24.99 for lots of variety of nigiri and rolls, and appetizer dishes. For $28.99 you can get all you can eat with either nigiri or sashimi, if you're into that. I think you can also do AYCE at lunch too for $14.99 or something, but maybe I read it wrong.

The sushi was great and fresh. Not cheap or small, and all very delicious. The rice was a bit \"loose\" and fell apart while trying to pick it up, but that would be the only complaint. But I'd rather  have it fall apart then feel too sticky myself.

Overall, the service was exceptional, the atmosphere was cool and modern and the food was very good for AYCE. We will go back again without hesitation.
 
Oh and parking is virtually non-existant, but we used the private lot next door which is $1/hr and the ceiling is only 6' high, so use at your own risk!"}
{"text":"The woman and I were driving back from Mercury at 0130hrs on a Friday. We see the open sign, and we decide to go in. I almost contemplate an expensive ($13.50) bowl of ramen, but instead I elect for some rolls with the woman. A guy proficiently took our order, and to my delight, they had Asahi. 

GET THIS: DOMESTIC BOTTLES $3.95, IMPORT BOTTLES $4.25. By FAR the cheapest I have ever seen in this city. I was losing it, so I decided to sing \"Take on Me\" on the Karaoke. Epic fail, but the guy in the kitchin was lovin' it. The server (fit the profile of an owner) said the place opened in June 2009, he's open until 0000hrs M-THU and 0100 Sat and Sun, but that \"if there's a large party..(like the 20 Catonese speaking people drinking wine, singing karaoke, and playing cards) I may as well stay open\". This is an awesome business ethic that's rare to see in this city.

The rolls wern't EPIC like Towa, but they were very good for their price. We got 4 rolls and 2 beers for $28 tax in, plus tip. Excellent post-night-out-snack.

Instead of going for a wing night, I'll come here with a friend to get some sushi, enjoy several drinks, and just talk. Awesome awesome place."}
{"text":"I also used a voucher here.  I made a reservation ahead of time, got seated in about 5 minutes and the food took maybe 15-20 minutes to arrive at our table but the place was packed, so it's totally understandable.  Yes it was not the greatest sushi of my life, but I still enjoyed it, all the food we ordered tasted fresh, and our waitress was pretty friendly, so how on earth can people complain for paying around $20 and getting $45 worth of fresh fish?  You get what you pay for folks, if you are expecting a 4 star meal, you may wish to pay more than $20.  
Would I eat here again with a voucher?  Absolutely I would.  Without one one?  Maybe not but only because they run deals here literally 24/7, so why not save a few dollars and buy a voucher.

P.s. the sushi pizza was delish :)"}
{"text":"Had a reservation for 7:00. Our food arrived at 8:45. While the sushi isn't bad, it's average by the rest of Toronto standards. All in all, this place is not worth it. There are better places within a 10 min drive."}
{"text":"Place is kind of small. the ambiance is nothing special, but the food was great and service was fast. Our waiter Eric was pleasant and had great recommendations. The chef's specials; spicy salmon, spider roll and rainforest maki are the must have."}
{"text":"Literally the worst sushi I have ever had. We ordered delivery and we threw out most of it. The fish was not fresh and the rolls were poorly constructed. I would not recommend this restaurant as there are several better options in the area."}
{"text":"My cousins took me here after getting some groupons so we could try somewhere new.

Simply,  was a bummer on many levels. food was about on par with grocery store or airport sushi, service was the worst I've ever experienced (after forgetting over half our order, they ignored us and the hungry kids for forty minutes),no utensils, no napkins, just bad,

The highlight of the evening had to be when my cousing chowed down on glass. Yes,that's right, they served him a SHARD OF GLASS in his sushi pizza.

This place shouldnt be, save yourself, don't eat there."}
{"text":"DO NOT go unless you have a Groupon type deal since they have adjusted portions and value to match the 50% off deals that they run practically every week. 

DO NOT order the Sashimi combo unless you are an anorexic 12 year old. The \"12 pieces\" included two fake crab sticks cut diagonally so that they could pass as 4 pieces. 

The Sashimi, Sushi, Maki roll combo was more reasonable for size. 

Miso soup was average, salad was terrible. Huge chunks of uncut iceberg lettuce in a watery dressing. 

The waiters were obsequiously friendly, smiling from ear to ear every time they were called. I would give it a 2 for food and 3 for service."}
{"text":"Thursday dinner. Pretty quiet. Even with 2 waiters for a small crowd the service is not really  friendly. But they're trying. Least our food came quickly. If u can eat, $40 Groupon is not enough.overall ok Resturant, if ur about the experience wouldn't recommend. A better place for takeout than to dine in."}
{"text":"I give it 2 stars because we got our order correct and didn't wait long. However...for the price of sushi and bento boxes, the quality was similar to that you'd find at discount sushi joints. The service in the beginning of our dinner was very nice, but toward the middle/end of our dinner I felt that we left their radar completely. Sometimes they spent more time chatting with 'regulars'. When they finally came around to service me, they assumed I was through and started packing up our plates without asking! I was shocked, and sad to see a piece of sashimi go to waste because it had then rubbed against a 'dirty' dish. Ugh. Maybe they were so distracted by the super engaging conversation about the weather with their regular customer? I don't know. Maybe I came at the wrong time? But since this place is out of my way I don't think I'll return."}
{"text":"The Good, the Bad and the Ugly. 

The Good: reasonable pricing. This is especially true of the lunch menu. The soy sauce is so old it has actually started to ferment. I've decided to put that point under the Good category. 

The Bad: The quality is not so great. The tea is usually cold and the soup is actually watered down at times.  The waiting staff look like their loved ones are being held hostage in the back and management is forcing them to work...as sloooooowly as possible. A smile is usually extra. 

The Ugly: Wow. It takes FOREVER to get your food. Seriously. Ordered at 11:55am. The food arrived 12:55! I had to convert my order to a take-out. This place is ok for the price but make sure you take an executive lunch. 60 minute wait for food."}
{"text":"You might be wondering why I give this review of 3 stars after reading this. I will explain at the end. First I would have to say we have been going to Kai for many years and most of the time with a Groupon of some sort. For most of that time we found the food quality, quantity, and service level to be good to great. However, recently we have noticed a decline in the service and quantity of the food. This might be due to the fact that Groupon is takes alot of profit off the table for restaurants to run and ends up hurting the company in the long run. In my opinion, it should only be used to the intent to drive new business. The more the run the offer that more that have to sell to squeeze on the same profit. I know this is self defeating as we use Groupon from Kai all the time but I would give it up if it doesn't drives them out of business.

Also, the service seems to suffer because of the Groupon offers due to the fact the discount does not apply to take-out or pickup. So what ends up happening is since they know they will be getting 100% profit from takeout/pickup orders they service those orders first even if you arrive and you are the only one in the restaurant. We noticed this situation come to a boil last week when a couple were waiting for 90+ mins for their food to be delivered even thou they were one of the first people in the door. The man exploded and demanded his money for the Groupon he spent. Unfortunately for him, it is for Groupon to supply that request not Kai.
Also, another affect from this practice on the customer satisfaction is when they service the take-out and pickup orders first then their customers there are times when they 'run out' of salmon or eel. This is very frustrating for us because that things that we identify as sushi food is salmon and eel and it is just not the same without it. They explained it away as due to the increase in salmon and eel they don't order as much. Another thing that they have done recently is they have removed special rolls (ie. the last page of the menu) from dine in. So the only maki you can get are the small basic salmon rolls. They are okay but not what we go to Kia for. They is need to change that.

Also, another thing you might notice if you have been to the restaurant in the past year is that they put multiple tables on \"reserve\" which makes some waiting (at table or in line) why they do this. Simple reason, they can't handle the service all when the restaurant is as at capacity. They might seem like a good problem (more sales then you can handle), but not really especially when the resources are concentrated to servicing takeout. This practice also causes more and longer wait lines for you to get food in your mouth. There is an easy fix to this if you really think about it.

I said I would explain why I gave a 'good' rating (3 star) with all the previous negative feedback. It is simple, we like Sushi Kai location, people and food when all these problems are fixed and wouldn't want them to go out of business. So too many bad comments will drive away business. I am writing this in hopes the business correct these issues and revive this small gem back to its former image the way we remember it back many years ago.


Suggestions for Business Owner:
1) Notify the customers (at table to in line) if you run out of stock (fish, eel..etc). It is very frustrating to wait 60 mins and get seated and then to find out you don't have salmon.
2) Bring back special rolls for dine in customers, those are your best unique items
3) Hire another chef dedicated to takeout and can help the dine in customers when not busy"}
{"text":"I didn't even know Calgary had an all-you-can eat Sushi bar until I walked into Sushikai. What a pleasant surprise!

We went on a Saturday night and it was busy but not too busy that you needed to make a reservation.  

I'm not sure how the prices compare to other cities, but for $24 (weekdays) or $28 on weekends I was more than satisfied with the amount of food we got.  And booooooy did we eat. Some of our favourite pieces were the shrimp tempura, the BC roll, the Ebi Salad and the special hotate. 

It was one of those place that we stopped eating at because we had to, not because we wanted to. But I already have my eyes set on the next time.   The Deep fried sushi will be wine, oh yes, it will be mine."}
{"text":"The service leaves much to be desired. The waiter did not bring water to the table and did not  ask if we want any. I had to go to the counter myself and ask for a glass of water.
The food is good but not amazing. I ordered teriyaki salmon, and there was no teriyaki sauce in it. (Maybe they marinated the fish in it before frying but there was not even a trace of it in the dish they brought me.)"}
{"text":"The best Japanese food ive ever had! Fresh and authentic taste. Wonderful attentive staff. You can probably get one of those $20 for $40 coupon from a Groupon type of site for this restaurant. I keep going back to this place because the food is sooo awesome!!"}
{"text":"I wish there was an option for NO STARS! 

The customer service is unprofessional! They're not equipped to be in business! They take long for service and rude! The bitchy lady in the kitchen yells and screams in Chinese and disses all the customers and talks bad about all coupon users! I overheard them talk down on so many people! 

I usually never write negative reviews because it's not worth my time but honestly this is was horrible. 

Especially if you're a Groupon customer - just forfeit the amount cos the time you waste and the experience you get. It's not worth it!"}
{"text":"Food is tasty. Value is good. The servers are super friendly. I would give this place 4 stars easily, especially with the nice staff, but sometimes service is so slow that I have to put it down a star. Definitely check this place out (especially if you have a groupon )"}
{"text":"Will start from positive points - the sushi was really good and fresh.

Unfortunately all other points will be negative.

Very poor reservation procedure - I called and tried to make the reservation, I was told that they are very busy and \"not sure\" (???) if they can make a reservation for the time I asked for.
Then I asked for later time and was told that they will call me \"right back\".

After waiting for 15 min I called again.  After few apologies I was told that they \"will try\" to sit me at the original time I asked.

When we arrived the restaurant was half empty (and the place was very small).

The waitress hardly understood (and spoke) any English and after every question we asked about the menu she said that she will ask her colleagues, and disappeared for few minutes.

After we placed our order the drinks arrived  almost 30 min later and they did not bring all drinks we ordered.. After poiting it out it took another 15 min to bring missing drink.

Service was extremely slow, they forgot about few more requests we made, had to remind them.

Probably will not go back, there are many other good Sushi places with much better service."}
{"text":"I want to give them a rating of 0, but I wasn't sure how that can be done on here.. But basically this is by far the worst restaurant I've ever been to.

When we first walked in to the restaurant, none of the waiters greeted us, they just made us wait for over 8 min. until I got pissed and walked to their counter to ask for a table. Then when we finally sat down, we had to ask them to bring us our eating utensils because there weren't any. It took them nearly an hour to get the food to us, and everytime I said thank you to the waiter I don't get a you're welcome or smile.

Then when it was time for me to use my Groupon discount (that I paid online) for my bill, the waiter deliberately tried to prevent me from using it by saying that I must show my name on the Groupon discount code, when it obviously was not necessary because everyone knows that you don't have to be the original person who bought the Groupon item to use the Groupon code.

I was looking everywhere on my Groupon app to find my name on the Groupon code that I realized it was their lame trick to try to prevent me from using their Groupon promo ($40 off) that I bought online. I finally got so mad that the owner finally decided to stop giving me a hard time with  Giving me the discount that I bought.

Before leaving I told them that I have never dined at such an awful place that made me so mad!"}
{"text":"I think this place stays in business through Groupon type deals. I have eaten there twice, with a coupon.  The food is nice. The service we received both times was very good.  It's nothing to write home about, but a \"nice\" dinner for two for $20 (+tax/tip) ain't bad.  If I have a hankering for maki in the future, I'd definitely search the groupon sites to see if I could get another coupon.  Don't know that I would go there full price."}
{"text":"I came here because of groupon. However with groupon you can't order the party tray which is what I usually get. If this is the case when u sell the groupon you should write only access to so,e section of the menu. I really really hate merchants that does this and advertise on groupon to try to lure customers in, in some form this is basically lying."}
{"text":"2.5 star + 0.5 star for the Special Spicy Salmon Roll

I have realized Sushi Kai has been changing owners a few times.  Compared to my first visit, the menu options has decreased alot - no sushi, no sashimi, only rolls.

Food : 
1. Special Spicy Salmon Roll - salmon are thickly sliced, fat of salmon is evenly spread, the balance of avocado, salmon and their spicy dressing is excellent.  MUST TRY!
2. Red Dragon roll - decent, just another option of rolls
3. Chicken Sukiyaki - it use to be my a favorite but it doesnt taste as good now, needs more flavouring
4. Chicken/Steak Bento Box - decent, but the chicken needs to be marinated more.  

Service:
- the korean waiter is very welcoming and friendly but i dont seem him as often now
- used to be quick service but it now takes FOREVER for them to make rolls and food
- they offer a healthy option of less-salt soya sauce to decease you sodium intake

If you are looking for a nice environment to dine this is not the place because the restaurant is small and pretty ugly looking, if you are looking for a fast meal this is not the place due to the slow service... I would come here just for the special spicy salmon roll though!"}
{"text":"Very tasty and fresh sushi.  I especially liked their dragon roll (very pretty looking) and the spicy salmon maki, delicious and nicely spiced.  Its a bit on the pricey side however.  The atmosphere is cozy, but the decor a bit plain.  We had an excellent meal overall, I'd be back again if I'm in the area."}
{"text":"Like everyone else, we had a groupon with us.  Been here at least 3x now.  Made a reservation all 3x.  Was seated immediately, got our water/tea/menus immediately....fast attentive service.  Food was above average.  Portions were good (wtf are people talking about on skimpy portions?) and service is ALWAYS friendly and helpful

What more do people want at 50%-65% off?  

Love it!  Hope they don't stop selling group deals!"}
{"text":"Here's a classic example of a place that has been Grouponed one too may times. If you're going to offer so many deals, then make sure to have the space and staff to handle the influx of business. Not to mention a good product to begin with.

We had to wait for 15 minutes after being seated before anyone even acknowledged us. At least we didn't have to wait for 20 minutes at the door like the others who arrived after us-- and that is 20 minutes for these other people to be acknowledged, not to be seated!

The awful thing at this Japanese restaurant (aside from the black grease smudges on the walls) is their menu doesn't include any combos with sushi and maki etc. Only a al carte sushi or a la carte maki. So your Groupon doesn't go as far as you think it will. Ordering sushi A la carte is quite expensive.

I ordered a salad to begin, but my friend's cooked food arrived before my salad. When it did arrive, it did not resemble the picture in any way. The dressing was different and it looked like it had tofu in the picture. She assured me that it was just lettuce in the pic. By the time my sushi and sashimi arrived, my friend had finished her dinner and had to watch me eat.

I get that different things some out at different times when you go for Japanese, but this was to the point of being inhospitable. Our server did not even take a drink order from us. Sushi was meh.

Sushi Kai only had attached tables of four and very few two tops, so when it gets busy (like when they sell off thousands of Groupons), they have to seat tables of two at four tops and waste two seats because they can't pull he tables apart to accommodate other tables of two. As a result, if they have an influx of deuces, they wind up being half empty sales wise, but at full capacity table wise. Not good for business--- or maybe a way to control too much of the Groupon-ing?

Basically, the service was almost nonexistent. I wasn't even given a pen to sign my credit card bill.

Very poor business management, service and food. Value may be okay, but since you get what you pay for, that's not saying much. I give this place 6 months tops and it will be gone, or have changed hands."}
{"text":"This was our first visit to Sushi Kai, and we really enjoyed it. The atmosphere is typical Japanese restaurant, and the menu is huge. We settled on the special combo for 2, for $55, and what a great treat that ended up being. Starting with a small salad and miso, we then had gyoza (6), followed by a very generous serving of edamame and tempura shrimps and vegetables. Next came a generous sushi and sashimi platter, PLUS two large rolls of our choice from a long list. Finally, green tea ice cream. We eat Japanese food a lot, and the quality here was very high. Service was kind and pleasant, but the food really was great."}
{"text":"We went tonight without a group on coupon or anything, contrary to all the reviewers. The salmon is like butter, it melts in your mouth. All the rolls were delicious. The place was a good stop for a quick fix, nothing fancy. It could use a paint job, de-clutter and bigger washrooms, but the customer service was fantastic."}
{"text":"My friend got one of those daily deal coupons.. so $40 of food for $20.

The service was pretty much non existent. English is definitely a second language but to the point that we had to ask for another server!! I have food allergies and wanted to make sure no broccoli was part of my tempura. So then I just try saying, just eggplant, sweet potato and potato. He says; no eggplant, no sweet potato, etc.. 

So if you have no food sensitivities or dietary issues, sure go ahead and eat there. 

We ordered some spring rolls and some other appetizer and LITERALLY the spring roll burnt my lip, it is swollen as I sit here typing these words!

How was our dinner you ask.. Meh!! Considering I only every get a bento box; my chicken teriyaki was missing the teriyaki of that combination! the veggie tempura was okay, the rice was hot, the melon was fresh, the salad was fresh. 

My friend ordered a different bento box and she was not impressed with hers either. We then got the Green Tea ice cream for dessert. I was not impressed with it.

Now 2 hrs have passed by and not once did anyone come by to check on us, we had to ask for water as we asked for our bill. It is one of the few times I did not want to TIP. But my friend insisted we did, so I said $2 is more than enough!!!

We processed to Demetre for a real dessert!! lol"}
{"text":"Ugh, even with a groupon this place isn't worth it.

Passable quality on the sashimi, and crispy tempura, but incredibly mushy sushi rice, and greasy, limp agedashi tofu. The term \"worse than grocery store sushi\" was thrown around more than once.

The service was friendly and decently quick, and the place was quite busy on a Saturday evening (probably all grouponers). The colours of the walls are Toronto Rental Beige, though they tried to dress it up with some shelves and bottles.

The prices are on par with other sushi places in the city, and border on overpriced when you factor in the size of the dishes and quality."}
{"text":"I come here for lunch on a regular bases that is why when I saw a deal on groupon I bought it without hesitation. It was $20 for $40 worth of food for two people. 

I came here for lunch with a friend and as my lunch only an hour I ordered right away to make sure I have time to eat. I ordered two different rolls and my friend ordered a bento box. After 30 mins of waiting for our food I asked a waitress about our food and why it was taking so long. I pointed out 3 girls who came to the restaurant 15 mins ago and got their sushi already. The reply was that they got lunch special. Which sounded very ridiculous to me as I have ordered my food 15 mins before they even arrived and why their order is more special. There were a few other people who got their food before us as well and came much later than us. 

After 45 minutes of waiting I couldn't wait any longer as I had to go back to work, so I came to the front to ask where was my food and a man who seems to be a manager/owner said that he would start making it now. What?!!! It has been 45 mins since we ordered and he would start making it now! After a long discussion on why people who came after us are already finishing their food and how can be 50 mins wait acceptable at any decent restaurant I came to a conclusion that probably groupon 'special' make me the least 'special'. 

Very very disappointing experience. 

I got my food packed finally after 55 mins wait and was late for my work. My friend got his food sometime after I left. Still can't believe it...."}
{"text":"Wow.  This place is just wow.  My bf and got there at about 730 on a Friday night.  There were two people in front of us waiting.. About 5 tables were seated and \"2\" separate tables were reserved (more like 4 tables put together to fit 8 people,  which,  btw those tables never showed up).  I called ahead of time to make reservations and they said they don't take reservations, which was fine. But then I get there and clearly they do take reservations. 
That's beside the point.  This is just minor. 
So we got there at 730 and not one waitress came to greet us at the door. More people walk in,  and you would think they would take a name or a number.  Nope.  
About 30min pass by,  still no acknowledgement by the waitresses.  Mind you  there were 3 waitresses and 2 sushi chefs.  The waitresses Just stood by the kitchen,  single file, watching people eat. What is this!? 
We finally got seated at 8pm. Ordered. The people who were seated after us got their food first.  It's about 845 now.  I flag down the waitress and asked why the food was taking this long.  Her response \"oh we have to make food from previous orders\". No! You're bloody making food for takeout order.  Apparently that's more priority and for some reason the table who came in after us also had priority over us.  We finally got one of the rolls.  Proceeded to wait another 15min for the rest  of our order. 
We left there about 930.

Service is terrible.  Whoever the manager is should really figure out how to improve their service if they want to keep their business.  Start with acknowledging your customers when they arrive,  hire more chefs,  and less waitresses who stand there and watch people eat. This is the absolute worst service I've had and will NEVER come back."}
{"text":"I've been here a few times. This would be the only sushi place in the immediate vicinity. They have nice lunch deals, but honestly, the sushi leaves a lot to be desired. I'm pretty picky, though. I like my fish cold sometimes, and fresh. They have nice discounts if you're a repeat customer (stamp on your loyalty card), and the service is actually very good."}
{"text":"I have been to Sushi Kai about 6 times now. Obviously they are doing something to keep me going there. Admittedly there's a ton of room for improvement. Despite some crippling flaws, I still recommend this place. Check out why!

Service is absolutely terrible. This restaurant has the WORST service I've ever seen. Nearly every time I go there, food takes too long to come out. I expect no more than 15 minutes. The servers barely speak English. Another annoyance is that often times you walk in, there's no one to take you to a table. I've made a habit of walking up to the cashier to ask for a table. 

The food is so-so. I should point out that REAL sushi is about the raw fish, not the rice. Same for rolls. When you put it that way, their portion is not terrible. Sushi Kai's rolls look small, but when you analyze it more closely, the \"meat\" portion is adequate. It looks small because they use very little rice. Other dishes are also just so-so. I find their bento box to contain way too little meat. The tempura is good (it's difficult to screw up tempura). Sashimi is worth mentioning because their size is good. All in all, the food is delicious none the less. 

So despite fatally bad service and arguably small portions on some items, I still go there often. Why? It's because of their COUPONS! That's right. Let say you get a $15 for $30 coupon, and you order only $30, then you have a sweet deal. Sure it's not the best sushi. But you can't argue with the savings from their coupons. They do coupons VERY often. You can sometimes find coupons that are better than 50% off.

They are location conveniently close to Eglinton station (5 minute walk). There's also parking on the street. Good location and good price trumps bad service any time in my books. I recommend this restaurant to any price conscious foody. Just make sure you grab a coupon before you go. For many of their items, I'm not willing to pay full price. The use of vouchers is practically part of their business model now."}
{"text":"I've been here plenty of times due to all the coupons I bought for this restaurant.(bad idea?hell ya)
First of all, make sure you stand in the light or in sight of the servers because they will probably not see you standing at the doorway when you're waiting for a table. After you're seated, have fun trying to flag servers to order or even for a glass of water.The food comes out slow at times,especially during dinner.

The sushi is just average.I love their spicy salmon roll for some reason though.Must be the mixture between the avocado and the salmon and their sauce is quite delicious.Avoid any kind of udon.The soup base is plain and the soup base makes the dish when it comes to udon.

I just wish their service wasn't so bad and their hours are longer.It's no wonder I keep seeing them on online deal finders."}
{"text":"Ordered the Seafood Tempura (came with 4 shrimp, 2 crab stick, 1 octopus, 1 mussel, 4 diff veggies), Special Spicy Salmon maki roll, Japanese beef fried rice, and a dynamite hand roll. Quality of the food is okay, pretty much like AYCE sushi. The \"fried rice\" was really just plain rice and stir-fried beef/veggies on top, but it was flavourful. 

Probably wouldn't come back because quality of the food isn't that great and their prices are pretty high (what we ordered was almost $50)"}
{"text":"When going somewhere new, I usually give it the benefit of the doubt and start with 3 stars and it +/- depending on the service, food and my overall experience...

I was pleased that they were able to accommodate our large group on short notice and that they were able to honor the 20% off coupon (exp 09/21/2011 http://www.referlinks.com/promotion/promotion.php?id=842)
without creating separate cheques.
They also got our first order of rolls to use in a really timely manner (+1)

But upon our 2nd and 3rd round of rolls, and the restaurant was full, it took over 45 mins to complete the order (maybe even an hour). This included Sushi, Sashimi and rolls. Any cooked food came out after a half hour.  (-1)

The food wasn't amazing, but was okay. The Sashimi wasn't super fresh.  The Japanese Curry was okay, but it tasted like chicken soup with some spices. (-1)

Also, the menu doesn't have a Sashimi boat, only a combo with Sushi. Your only option was to get a 16 pc for $14.99. I was also disappointed that the 16 pcs included 4 pieces of crab (2 surf clam, 4 salmon, 3 tuna, and 3 mackerel) . I thought it was a little cheap. 
For a price at about $15-20 per person, you're better off going to an AYCE  to get more food, and more quantity. (-1)

I also was surprised there was only one seating at the restaurant from 7pm to 10pm. They even turned away some customers. The poor guys at the sushi bar was working non stop like a machine. There was also so many waitresses and 2 other chefs/men (not sure) that seemed to be around, discussing at the cash or serving.  They really need to balance these folks with the kitchen, otherwise there's no need for some many! (note: the place is small,probably 2 waitress could have handled it)"}
{"text":"Weelll.. I bought a Groupon for Sushi Kai and the meal that my girlfriend and I had there left us feeling very underwhelmed and disappointed. 

The service was rushed, which was a little enervating. To start, the miso soup and salad were both very watery and flavourless (not a good way to whet your appetite). We had the beef and asparagus spears to start, which were alright. The beef was unseasoned and was of poor quaility, so it tasted sort of like souped up cafeteria food. Kindof unpleasant but we were hungry.

We had spicy yellowfin rolls and spicy salmon rolls and they were beautiful and the big pieces of fish tasted glorious, however, the only thing that made them spicy was mildly spicy mayo spewed half-heartedly overtop of the rolls. Bummer. And this was the best part of our meal.

Next we had the chicken and beef hotpot. In both dishes the broth was extremely flavourless. The beef tasted better than the chicken. Both of us are foodies and enjoy picking out flavours and we couldn't taste any spice or seasoning in the broth except maybe salt and soy sauce. The beef came coated in teriyaki and was nicely sweet, however it didn't make up for the bland broth that is supposed to hold the dish together and bring out the flavour of the veggies, which were either cold and raw sitting on top or boiled to oblivion inside. The absolute worst was the chicken hotpot, which smelled overwhelmingly of boiled chicken fat from the time it arrived at our table. The chicken in the order was of very poor quality, nobbly gristly strips of fatty flavourless meat. I was very disappointed. The chicken left a lot of grease in the meal and was mostly inedible. The meal went from bad to meh to worse. 

Might be alright if you just order sushi and don't mind being treated like you're in a canteen."}
{"text":"We've been here twice - both times with the Groupon. I think it's a fantastic value with a Groupon, but not sure if I would come here on the regular - maybe for takeout.
But food was good - sushi rolls could have been a BIT tighter - but it's honestly your most basic sushi restaurant - they have all the popular rolls, nothing special or \"mold-breaking\" about their selections, but it's good if you just want a sushi fix.
The server we've had both times is a super nice guy - I think sometimes they may only have one server and a few helping hands working, which I can see how most people would get annoyed with slow service or unattentiveness - I think they are trying their best with what they have - it's not like The Keg - you really can't come in with high expectations. 
Not the best sushi place ever, but not the worst."}
{"text":"We have been to this restaurant many times, but we only ever go when we buy coupons online. The sushi is pretty good, but not something we'd pay the full price for. Their menu is leaning towards being a bit pricey for their quality.

The service can be a little slow, but the waiters and waitresses are always smiling and trying to meet your needs. The food can also come quite slowly...but that is probably because there are so many people with coupons eating there. (They often have more than 50% off coupons on those coupon websites.)

The main problem with this restaurant however, is their odd store hours. They close between 2:30-5:30 on weekdays, and doesn't open until 5:30 on weekends...and they close at 9 or 9:30 at night. I personally eat \"lunch\" around 2 sometimes because I wake up at noon, and eat \"dinner\" later at night...so it was difficult for me to ever find the chance to eat at this restaurant before."}
{"text":"Called and they said they were full but we can try to walk in after 8pm. So we did and there were two large empty tables reserved (which stayed empty till closing) along with a table for two, yet we still waited 15 minutes to be seated, why wouldnt they want more business?

It then took 40 mins for the first dish to come. The tables around us were all waiting for a long time. This didnt happen the past three times we visited because there was always just one other table.

Portions have diminished. The three slices of sashimi could've been one slice. The rice on the sushi rolls were falling apart. The seafood sukiyaki was very sweet tasting and came with tiny pieces of cut up shrimp, one calamari, imitation crabmeat, tofu, thin glass noodles and rice.

Sad to see them go downhill because people working here are quite nice. They just need more people in the kitchen instead of three servers waiting on six small tables, walking around refilling tea when everyone was starving waiting forever for food. Not sure I will be back again, even with a groupon.

They also no longer have an alcohol menu."}
{"text":"Love the place. Appreciate that they tailor the order with our little tweaks. Good portions and service is very friendly."}
{"text":"I'll admit this restaurant looks a little run down, but the sushi is so fresh and so good! I love it! The service is quick and friendly, the menu has a ton of choices. I've been many times and always had a good meal and a good experience. Close to subway and free parking on side streets. 

The tuna sashimi and spicy tuna handrolls are my favourite. My one complaint, dynamite roll is too big for my mouth!!!

They often have groupons, even for return customers, pay $20 get $40 - yay!

I highly recommend this place :)"}
{"text":"I came with a WagJag in hand on Saturday evening.  We were told it was very busy but luckily there was 1 two person table near the sushi bar.

Our server got down to table height to take our order in no time.  Very impressive.

We ordered a seafood udon soup, Japanese fried rice, Spider roll and Sushi pizza.

The tea attendant never let our cups go empty.  

Our entire order was delicious and satisfying.  The Spider rolls were humungous.  I think because they are used to serving a western audience who complains about small rolls, they had to increase the size of their rolls to please them.

The salmon pieces on the pizza were a perfect size and cubed.  

Wonderful courteous service and good food to match.  I will surely come back to this establishment."}
{"text":"I love this place!  The maki is well-prepared and tasty, but very oversized.  (I asked the waitress why, and she said it was a gimmick for Canadians.)   You get very good value for your money"}
{"text":"I came here for dinner with my boyfriend on a Groupon deal. The Groupon voucher was for dinner with a value of $40. We ordered Red Tuna sashimi; mackerel sashimi; seafood hot pot; and a rice dish. The location of this restaurant is very convenient to get to as it is close to the Yonge and Eglington subway station. The food quality of this restaurant was average. The ambiance of this restaurant was nice and cozy. I kind of liked the inside of the restaurant. It is not the most up to date decor inside, but I thought the seating was spacious. It was also nice and quiet too. I think this place would be a great place for nice quiet and causal meal with friends or even a date. Overall, my experience with this place was good."}
{"text":"I went here for a friend's b-day dinner. First off I should say, it's a pretty busy restaurant. I know a lot of restaurants in the Yonge & Eglinton area are, and this one is no exception! They do a lot of delivery, so if you don't feel like waiting for a seat, go for the order-in. 

Unfortunately we did not do that, the wait was a good 15 minutes or so, so not that bad.  The food though was well worth the wait, it was pretty good. The wakame salad (seaweed salad) is really really good - this place got me addicted to it.. I'm over the addiction now, that's what happens when you have it everyday! 

Prices are average for a japanese restaurant in the city. Overall, a good choice for group get togethers!"}
{"text":"This is the BEST takeout/delivery Japanese restaurant in the Yonge-Eglinton area and just about the about the WORST eat-in Japanese restaurant around. We order delivery from here several times a year and it is high quality, fast and very reasonably priced. I have only eaten in the restaurant two or three times and never had a good experience. They lost their liquor licence a year or two ago. The table service is extremely slow and generally quite grouchy and the seating area is very run down. This is really a take out restaurant that happens to have a few tables for eat in as well - eat in here at you peril! If you live in the neighborhood, however, there is no better place for Japanese takeout, either sushi or bento box and teriyaki selections - all excellent."}
{"text":"I was here last Saturday to redeem my voucher that was expiring on the same day. 
I've been here twice before and their services were quick! I was pretty sure, everyone who was in the restaurant had a voucher, it was pretty packed. 

I was with my boyfriend, we got a sushi + maki combo and 2 bento boxes. The service was nice, quick and friendly. I got my food pretty much within 10-15 minutes. My boyfriend was a bit upset with the food quality, but then again he was comparing it to Sushi on Bloor. We were in there no more than 50 minutes! 

I got what I paid for... $13 bucks for $40 worth of food! A bit better actually!"}
{"text":"The place was really small. Tables really close to eachother. I ordered yam tempura which was uncooked. My husband had assorted sushi and was not satisfied with quality either. 
I don't think we'll go there again."}
{"text":"I have passed this place several times and my friend did order takeout for us once from here so this is my second time eating their food.  I had a Groupon (someone seriously call for help - I have an addiction). For 20 I got $40 of food.  Seems like a good deal.  So me and my friends decided to have a Friday night Sushi and Bitch session here (that's a thing right?).  We ordered multiple bento boxes, sashimi and some bbq eel.  All were decent, filling but nothing to make your mouth have orgasms.  The service was a bit all over the place but in fairness they are slammed with takeout/delivery orders."}
{"text":"Got the Groupon on a discount so we barley paid anything (10 bucks for 40 of food). Service was fast and attentive. Food was decent and reasonably priced.  Bill came out to 60 so we only paid 35 after tips which is not bad.  But if it was regular price I would have too think twice."}
{"text":"Not bad... I've been here a couple times already, and the service and quality of food have improved over the past years!! :) Sushi and sashimi are good portion sizes.. boyfriend and I are happy customers :)"}
{"text":"Something happened to my review (got deleted?) So I'm starting again.

Anyways, I went here because it's about the only sushi place that still exists on the strip along Eglinton from Yonge to Mt Pleasant. There's not much else around here because of all the construction.

So, I walked in, and I was literally the only customer. Unfortunately, I have to echo the sentiments that have been left by others. I was not served soup and salad. I was treated like an invisible person, like I wasn't even there, even after trying to get their attention.

They must make money from the take-out business, because the lady answered a couple of phone calls while I was sitting there at the bar.

Don't waste your time at this place."}
{"text":"It was a good deal with the voucher. However, the food was nothing special. The service was ok and the fish was mediocre - not the freshest i've had but not the worse either. It sounds like many others feel the same way."}
{"text":"Every time we order sushi for corporate lunch, this is our go to. We've tried others, but nothing compares to theirs. Their sushi is made in big sizes and so much filling. Some maki rolls are like 30% filling and 70% rice lol. 

When we don't order from them for lunch, I  sometimes do the maki lunch special. This is 18 prices of maki roll for $12.

This place is pretty good."}
{"text":"Not bad sushi.  I've always had amazing service each time Ive been!  We were starving and wanted food before we went to a movie screening down the street.  The owner told us he'd do his best to get our food quicker.  It showed up not too long after.  They're some of the nicest folks running a biz in the neighbourhood.  Kudos to them!"}
{"text":"Sushi Kai is a small business located just on the east side of Yonge and Eglinton. We entered the restaurant and it seemed pretty busy for a Monday evening. It was a mediocre atmosphere, and the washrooms weren't very clean. Then again most washrooms downtown are pretty run down. What they lacked in the environment category, they definitely made up for in food and service.

Sushi Kai did not offer all you can eat. From the a la carte menu we ordered a Salmon Teriyaki and Shrimp Bento Box, and an assorted Plate with California Rolls, Shrimp Tempura Rolls, and Spicy Salmon Rolls. The food was perfect in terms of the amount and softness of the rice, and more importantly the fish was quite fresh. I thoroughly enjoyed the shrimp that came with the salmon teriyaki. I was surprised as most places don't offer shrimp with salmon for the bento boxes. I would come back again if I was in the mood for a la carte sushi over all you can eat."}
{"text":"Very easy to miss if you're driving southbound at night on 14th Street NW towards Kensington Road (it's on the right). \"Cozy\" = make reservations, especially for dinner. Tried the sashimi, my wife had the assorted sushi, our son had beef udon, plus we shared a platter with mango and tempura shrimp (\"tropical roll\") and I tried black sesame ice cream for the first time. All good. We'll be back."}
{"text":"Great food.  Fish are fresh.  Sushi quality is better than some other places.  I love the salmon boat and their spider roll(crunchy and yummy)  It a small place.  So if you have dinner on Friday night, make sure you have a reservation or be prepare to wait for a longgggg time"}
{"text":"Three of us waited forever at the door without being acknowledged.  After sitting down and requesting tea we had to wait 10 minutes for it. Cup of tea smelled like strong cleaning chemicals. One server was running around like a headless chicken serving 11 tables, putting in orders and doing cash - he appears to be the owner.  

We had to wait another 10 minutes to order.  People who came in after us had to retrieve their own menus. The entire time we waited for food no tables were cleared off. Floor was dirty and there were fruit flies.  People who had to pay their bills were extremely frustrated at the wait and some had to get up to grab their own containers for leftovers. 

This was my second time here and the first one it wasn't much different. .. and that was a year ago!  I knew there was a reason why I hadn't gone back. We left after 1.5 hours. The whole time we waited we only ate some dinky tempura appetizer and edamame because the chefs were busy with one large table's order. We were made to pay for beyond horrible service and subpar aps. Will not return. Ever. 

Don't come here. .. it's a complete waste of time and energy."}
{"text":"Yikes, what an awful experience.

So I've been to Sushi Kai a number of times in the past, due mostly to its proximity to my apartment and its perpetual presence on Groupon. (I've never gone without using a Groupon voucher.) I've never had a problem before, but last night was really something else.

First of all, we attempted to order sake (as we do every time) and were told they don't serve alcohol. What?? Did they lose their liquor license? We were both baffled, but as we're not alcoholics, we decided to stay and just enjoy the food.

We ordered quite a bit of sushi and sashimi and then began the process of waiting. We were sitting in a spot where I could easily see the kitchen and I noticed that the two chefs were devoting their entire time to filling a series of takeout orders. After twenty minutes of that, my dining companion pointed out that nobody in the restaurant, which was more than half full, had received a single dish in the time since we ordered.

Their takeout orders finished, the chefs finally began preparing food for the restaurant, but since we had arrived after most of the people that were already there, our food took an additional 15 minutes to start arriving. A 35 minute wait for some sushi! Unacceptable.

(I wouldn't have been so angry about the whole thing if our waitress had even *once* apologized for the wait or explained what was going on, but instead she just stood there with a blank look on her face. It was completely absurd.)

So we finally got our food and it was good, but we were both so pissed off it was pretty hard to enjoy it.

Needless to say I'll never be returning, Groupon or no Groupon. What a farce."}
{"text":"Dreadful!

Well, gotta love yelp! We went to S.K. twice and the food was the good, and as others mentioned the service was really so-so. Just called to arrange a delivery dinner for 4 friends for tomorrow night. I was concerned about all the bad reviews so I asked about quality and delivery -- the fellow who answered decided to hang up when I inquired quality and delivery. Geez. Thanks to others on yelp for the \"heads up\". Will move on. Thanks again."}
{"text":"I saw the groupon for $40 of food for only $20 on Groupon and I used an extra code so the final amount was $15. That's a really good deal! But after checking yelp, I got really anxious because the reviews were just TERRIBLE. I didn't know what to expect. Bad service? Gross food? Hour long waits?

So I was pleasantly surprised by the very friendly and attentive service there. The restaurant wasn't full and there were two waitresses so I was never ignored. The food didn't take too long and the portions were not skimped on just because we had a groupon! The rolls were not bad, average I would say. And the menu you can choose from is limited, so we ordered two extra special rolls. The bill(including groupon) came to $15 per person including tax/tips. Nice place to curb sushi cravings for a nice price, don't expect too much. You get what you pay for. We ordered a lot of rolls and could barely finish them. Had to stuff ourselves."}
{"text":"You can see that people only eat here to use the vouchers they have purchased - as they seem to always have some sort of deal available.

unless you come early enough - make sure you make reservations, otherwise it will take up to 30 mins to get seated (for a table of 2).

The food is ok. Not the greatest I've had, but definitely not the worst. For the price you are paying ($15 for $30 worth of food) - it's ok.

Definitely only visit if you had purchased a voucher."}
{"text":"Sushi Kai has become my go-to for takeout or sushi party platters. Chef Kai is friendly and has gone so far out of his way to fulfill big (300 piece) orders for our corporate events. The price is unbeatable for his party trays. The rolls are fresh and the fish is good quality. Staff is friendly. Haven't actually eaten in but all our takeout has been pretty good. 
Keep in mind you get what you pay for. This is no 5 star restaurant, but for a local joint and a small operation we are more than happy to support Chef Kai. Love the spicy scallop rolls and the BBQ eel. Delicious."}
{"text":"Absolutely great sushi quality and service. One of the best sushi places in Toronto."}
{"text":"I'm extremely disappointed with this place.  I've been here twice and both times, they were closed! They don't have their hours posted on their window either. 

I wasted my time commuting to find that the restaurant is closed."}
{"text":"Bought a $21 Groupon for $40 worth of food.  Service was a bit slow. Even though there was more than 4 staff working on a not-so-busy weekday evening, staff were not as attentive. Tea was weak and not hot. Should have constantly checked for basic like this to ensure quality of service.  After 10 min.of sitting and waiting, finally got our food ordered.  Food delivery speed was not bad at all. Dragon roll tasted fresh; salmon were good.  Interior needs a bit of upgrading. Overall, worth to try over Groupon deal."}
{"text":"After learning that over 60% of reviewers here took coupons off groupon, wagjag, dealfind, etc. and learning that many reviewers have succumbed to food poisoning at this restaurant, I am less inclined to go try this out myself.  I receive regular \"deal e-mails\" and Sushi Kai has been on the list since this summer (and summer was since I joined these e-mails - so God knows when they've started to promote via discount coupons).  Today, I got another promotion offer from Sushi Kai via Wagjag or Groupon and so I decided to check this place out on Yelp.  Lo and behold, the ratings were horrible.  

First off, food poisoning should never happen to anyone at a restaurant.  That is horrible and disgusting and this restaurant should really take into consideration these reviews because on one page, reviews re: food poisoning have been listed MULTIPLE times.  I may actually think I will report this restaurant to the Public Health of Canada.  

Second off, people who complain that this is mediocre sushi - I guess unfortunately in this case, \"you get what you pay for\".  There are lots of great locations serving Japanese food albeit expensive (check out Aoyama, Guu Izakaya, etc.).  Reviews are raving in those restaurants.  

Third and finally, Yelp is important.  Check it out before you go somewhere.  Never trust a restaurant offering a voucher unless you go on Yelp or Trip Advisor first.  Reviews are important!"}
{"text":"I went with some buddies from the Japanese arts and culture appreciation club I'm in for some sushi, sake and karaoke.

\"Cosy atmosphere\" comes to mind when you first walk in, from the plush, modern chairs to the reddish tables with funky squiggles, and from those paper lantern type light fixtures to the wall screen depicting samurai and from the floral motif window scrolls to the cheeky ninja stick girl waving shuriken on the bathroom door - Sushi Kai 609 has a fun and clean, Asian fusion look.

Now to the important stuff: food and drink! 

 My companions and I are now avid, no, rabid fans for the lychee slush with sake. Fresh lychee fruit is a real treat. The sake complements it very well. We also tried the mango-coconut smoothie with sake and mango-peach-strawberry smoothies with sake. It was good, but the lychee-sake combo is the best.

My companions and I ordered a wide variety of items: dynamite roll, kanpachi, miso soup, gyoza, veggie tempura, masago, tamago, california roll, fuji roll, yam fries and the tapioca with mango paradise.

Everything was delicious. However, I'm just going to highlight the more unique dishes for you here:

The fuji roll was a delightful combination of several types of seafood, some cooked in tempura format and others not. The head cook did a fabulous job on that roll. The sauce complemented without overpowering the palette. The yam fries are done tempura-style. Our group had never had it served that way before. My friend said that it was superb and that the tempura-style is a very neat twist. The gyoyza was tasty. While the tapioca with mango paradise? Well I was so stuffed that I had to bring it home. It aced the \"Next Day Taste Test\". The addition of pomelo (Chinese grapefruit) was a refreshing surprise. It's not as tart as a normal grapefruit, so it works well with the mango smoothie paradise mix.

Staff is extremely friendly and attentive without being overbearing. Genuinely friendly, not the \"fake-friendly\" we sometimes get and/or use in business situations. Since it's a fairly new restaurant, they are eager to hear suggestions and get feedback on all aspects of your experience there. 

They even gave us gigantic honey and garlic rings to try (new recipe). One member of our group said it was good but needed just a teensy bit more honey, while another said that it just needs a teensy bit more garlic. I was in the middle - it was just right for me. The fourth person in our group was too full to try her piece. I'm not kidding about the size - they were humongous!

Prices are pretty reasonable. We all blew our respective budgets for the week but we couldn't resist trying out everything. You could get thoroughly stuffed for $30 or less but if you go all out, you can easily spend $50-60 per person.

As for the karaoke, well they are new so we're sure their collection will grow. They have a decent selection of English and Chinese songs. There are some Vietnamese and Korean as well. Just one page of Japanese currently and no Filipino, so my group quickly put together a shopping list (er, wish list) of popular Japanese and Filipino artists.

They definitely will need to have more than one copy of the song lists as they build up and a little stage area for the karaoke singers.

Rating-wise: 5 stars for food, drink and service. Karaoke would currently be a 3 but I'm sure they will be building on this area as their business grows, so that will soon move up to 4 and then 5.

UPDATE: Unfortunately, this restaurant is now CLOSED."}
{"text":"I have had the privilege of being taken out for lunch here a couple of times at Sushi Kai; it is pretty busy during lunch hour because it has a great lunch menu.  For lunch at 10.50 you can indulge in a: 

Sushi Lunch: of tuna, salmon, red snapper, shrimp and masago, Sushi and Sashimi: 6 pieces of California Roll, and three pieces of Sushi, Sushi Roll Combo: 6 pieces of California Roll, Salmon Skin Roll, Salmon Roll, 2 pieces of House roll or Sashimi Lunch: 8 pieces of Sashimi and steamed rice.

What the heck, snuggle closer and try the Lunch time lovers for two at 21.00 which is 12 pieces of Sushi and 12 pieces of Sushi Rolls.

I like Sushi Kai, because it is very clean, delicious and has a really quaint traditional decor, the waitresses are always nice and although you may have to wait in line for lunch, you do get served right away as soon as you sit down.

Take advantage of Monday and Tuesday 20% off Sushi, Wednesday and Thursday 99 cent salmon, Fridays and Saturdays 2 for $3 uni and kabachi."}
{"text":"I have to say that this might the worst sushi experience I can think of. A friend and I went to Sushi Kai on a whim one Friday night. The place was very busy so we took as a good sign. When we walked in, a table was clearly available, but they asked to wait for another table. After 15min, they gave the same table that was originally open.

The drinks alone took awhile to arrive at our table. Once we ordered our food, the real wait began... We ordered more drinks to stave off the hunger, but they never came. The table beside us (who arrive 20min after us) was served before us - hate when that happens... 

When the food  finally came, my friend made a comment to the server that the portions were a bit small compared to the prices. His retort was something about getting the same deal in anywhere in Japan - not sure what his point was...

We were really hungry, so we ordered a lot of dishes, but nothing outrageous. Our bill was $100 including tip and tax. A little over-priced considering not one thing I ate stood out as a quality item.

To top it all off, my friend got sick from the food (in the bathroom of our next venue) and obviously had to call it an early night.

Hopefully others had better luck."}
{"text":"I came here with a friend yesterday and thank god we made reservations because the place was really busy.  People kept coming in and had to wait.

Although we  used the $14 for $40 Teambuy deal, it was still pretty expensive considering the amount of food we got!  The quality of the fish was decent but I've had better for much cheaper.

We ordered the $31.95 sushi boat with the sashimi and being two small girls, we both were surprised at the size of the order; we both could've finished one each by ourselves!  Even my friend was still hungry afterward!  Also, for some reason, rather than giving us a big boat with all the sashimi and sushi on it, we got a small boat with sashimi and a plate of sushi on the side.  Kind of weird, if you ask me; however, I assumed that they had maybe run out of all the big boats so I kind of shrugged it off at the time.  In hindsight, I only recall ONE table who ordered a sushi boat.

Anyway, the couple next to us had green tea ice cream and the portions were HUGE!  They probably got 4 scoops each!  I thought, \"WOW, for $2.50 an order, that's pretty good!\"  Unfortunately, when we got ours, we had half the amount!  Surely, they didn't pay more for extra scoops???

I could be wrong but I highly suspect that we were given smaller portions because we gave them the Teambuy voucher prior to ordering.  I don't think I'll come back again."}
{"text":"Their sushi rolls were alright but their sashimi were terrible! Too thick and they didn't taste that great/fresh either! 

I ordered shrimp tempura and I have to say, they were highly disappointing! For the price that I was paying, I wasn't expecting the shrimps to be as big as my pinkies only!"}
{"text":"Been here a few times, this time it's the last. Had a reservation for 5:30 PM. Food was served @ 6:45. By then my child was STARVING & getting hangry. When the food arrived we enjoyed it but the waiting was too long. 1+ hr for crab maki & tamago egg??? The restaurant was full with the one waiter, Kevin serving ALL the tables & seating people... there was another helper to pour water/tea & I overheard him telling her not to do more than that... & @ least 10+ tables were occupied the entire time... I had the steak combo & for $15 it wasn't worth it & looked nothing like the picture. They've also removed a lot of fancier things from their menu (spider rolls, unagi don, the roll made with eel - dynamite roll?) since offering the deal buys. If it wasn't for all the Groupons & other deal buys this place would be much emptier. Disappointedd!"}
{"text":"I went with my family of 5 with one of those coupons, $13 for $40 worth of food this evening. We were all very disappointed. . We waited a few minutes before someone seated us (no server even looked at us as they walked on by)The miso soup and salad wasn't bad. The kids loved the edamame. The tempura, sashimi and sushi was average (although the sashimi was a bit soft). The gyoza seemed like it was refried and the teriyaki and tempura sauces were very bland (I think they watered down the sauces). The kids got bentos and they messed up on the rolls. I have a feeling they will be re-serving the spicy salmon rolls to another customer. 
The worse was the Spider Roll. It tasted like oil that had gone bad. I told the waitress the Spider roll was bad and she asked me what she would like me to do about it. I said I don't want it and I wanted her to tell the chef. They ignored us for a while and my husband said the chef was glaring at him (since he was facing that way). I didn't like that so I asked the waitress who the owner was. She asked why I wanted to know and what I was going to say to him. I said I wanted to speak to him about the roll. I didn't like the fact they seemed to think I was making it up. I spoke to him in English and asked him if he had tried the Spider roll I had returned. He said he didn't and I asked him to try right there. He tried the tempura shrimp and I said that's fine since my kids already at 10 of them. I said the rolls I had. The waitress brought out the plate I had (3 on the plate). He tried it and agreed with me the filler (fried tempura bits was off). He did give me $10 discount for the returned roll. When the waitress brought the bill she mentioned I would get a complimentary Spider roll when I return...I told her I won't be back. 
That was one of the worst meal I had. I paid $56 in total ($26 for $80 and another $20 for the meal and $10 for tips (my husband was surprised I even tipped them). My kids are now eating leftovers at home as they didn't enjoy the meal."}
{"text":"Ups, I didn't see my previous review here and came back... Bad idea (my lunch ended up in garbage). Not sure what happened! Did I order curry at the restaurant or some spicy sauce from food court? What a disappointment. I was hungry, got my Chicken Curry for lunch, tried two bites and threw the whole box in the garbage (and was hungry for the rest of the day.) The employees were friendly, and the Miso soup was okay... and maybe (?) some other dishes are ok, too, but nobody will convince me to order from here again.
I ordered Chicken Curry to go (this lunch special came with miso soup). First, I thought that I got wrong order and I have some weird looking beef stew in dark brown sauce. The taste - very, very spicy... and simply bad. And the chicken pieces were even worst - just not a good quality meat, had to spit it out, so many crunchy stuff in it, yuck.
I don't remember when I wrote such a bad review before, but this dish deserves it."}
{"text":"This place meets par with the average sushi joint in Toronto. Standard pricing, food quality, and service. Adequate but not really a dining \"destination\" if you know what I mean. But not bad either.

If you live within walking distance and have a hankering for sushi, this place will do. Friendly staff seem intent on making customers happy."}
{"text":"Like so many others, my friend and I went to Sushi Kai because of a coupon they were offering: $20 for like $50 worth of sushi or something.

It's small and quiet in an uninteresting way. The clientele was mostly innocent looking white folks who looked like they had stumbled into restaurant by accident. That's OK, our expectations were not high. $50 worth of mediocre sushi is still worth it.

And yeah, the sushi was just as mediocre as you'd expect. Mediocre in that uninteresting, not-so-authentic, not-polished way so many of Toronto's dime-a-dozen sushi joints are. We didn't mind this so much as the fact that it did NOT feel like $50 worth of sushi. (The coupon might have been $40, but regardless it definitely was not meeting its value.) Considering we only ordered variations of tuna and salmon rolls and sashimi, we either should've gotten quite a bit more OR way higher quality fish. If I were downtown I could get way better quality and better value for the same price at New Gen.

It was enough for us to finish feeling satisfied, but it didn't feel worth its supposed value. Service was as meh as the food, which I'm usually much more forgiving of when the waitstaff is not all fluent in English, but the experience of the couple next to us lowered my opinion a bit for sure. They also had a coupon and were seated around the same time as us. The woman made a special request for one of her orders that was supposed to be not difficult to prepare. Only by the time we finished eating, only one of their dishes had arrived! They explained being in a hurry too because of a parking meter and the waitress just sort of nodded and said the food would be ready \"soon\". I know it wasn't us but how they handled that service situation definitely didn't do much to impress me!

Sushi Kai is not such an offensive dining experience, but even with Toronto's mediocre sushi restaurants, there are better options for the same cost."}
{"text":"Been here half a dozen times from last year to today thanks to Groupon and I'm surprised with the low ratings this place has gotten. Perhaps it's because i come around 5-7 at dinner, but i always get seated immediately. I do agree it takes a while grab the waiter's attention even though there's two (about 10 min) but I've always found the sushi better tasting than other joints. Food arrives promptly. From what I've tried:
The dons are always watery/soupy which i dislike but my boyfriend LOVES
bento combos : average, the sushi is my only highlight
Sushi (california, philli, green dragon) :absolutely amazing!! Portions of rice to fish are good (not too generous with the rice) and the flavors balance out very well.  Avocado is ALWAYS fresh here so any rolls with avocado as an ingredient tastes so rich and creamy. Yum! 

Definitely starting to transition to a regular here :) would recommend for sure"}
{"text":"Service was poor even though the store was near empty, food took far to long to be prepared, was some of the worst sushi I have had and they close from 2:30-5 every day without even posting their hours up on their window ? My friend bought a groupon and against my better judgement I decide to tag along with him hoping I would have a better experience this time around, paid $5 for parking just to find out they were closed at 4pm? 
Update: Same story, friend brought a groupon and made me tag along, seated several people who came after us first and ignored our complaints because they \"have to seat as many people as possible\" and waited 1 1/2 for our food and were then told to hurry up because they were closing .."}
{"text":"I went there because of a Groupon I purchased. The service & ambience were mediocre. 

The sashimi was expensive and the specialty rolls were disappointing (eg Rainforest roll). 

Even with the Groupon I wouldn't recommend going here."}
{"text":"As a sushi connoisseur I have a simple, golden rule: if the preparation of the meal takes longer than it would take me to find an ocean, physically capture a fish and/or harpoon it myself...you might be a redneck.  ha HA!  See what I did just there?  I turned that into a Jeff Foxworthy reference!  So topical!  So timely!  I am a comedic genius.

Anyhoo, Sushi Kai is good times.  Consistently friendly service with a HUGE smile - these people must be hopped up on goofballs or something because they're so damn happy to have you.  Nice fresh fish, quick prep - all good.  The maki isn't too ricey either - I hate it when some places roll the maki up with so much rice that it's like eating a hockey puck.  Sushi Kai doesn't make that mistake - their stuff is well-constructed, like the fantasy life with Megan Fox I have established in my imagination.

Bonus points for the washroom hallway cleverly hidden behind a backlit bedsheet.  I think it's a bedsheet - I don't have sheets on my bed because the orderlies think I'll kill myself - but that's a whole other kettle of fish.  GET IT?  Oh shit I did it again with the comedy.

Does this review actually help anyone really?  I can't decide."}
{"text":"Used a wagjag 2 weeks ago, and the sushi didn't taste right. Everything was warm, but we figured it was just the rice. (we got there late, maybe they had to make more)... the following night in the middle of the night, my girlfriend started violently vomiting and.. well.. but since I wasn't sick, we figured it had been her lunch that day. Needless to say the following afternoon it happened to me. We were both diagnosed with Salmonella poisoning, and considering that was the only meal we had eaten together in the 2 days, it had to be the cause. 

We have another Dealicious that we won't even be using, and they won't refund our money."}
{"text":"I don't ever take the time to review restaurants but this place was exceptionally bad. The service was prompt and pleasant but the quality of the sushi and the bento boxes was just plain bad. Only came here because of the draw of the $40 Groupon but I wouldn't come back."}
{"text":"I live in the Yonge and Eglington area, and so having a Groupon voucher is really helpful when you're hungry, but you don't feel like cooking at home. I've been to Sushi Kai about 3-4 times now and every single time I've been satisfied with the quality of food and service. In most cases I ordered a bento box and dragon roll. The quality of rolls was pretty good, not the best in the city, but pretty good considering that I paid $14 for a $40 voucher on most occasions.

I do not see anything wrong with trying to sustain your business through vouchers. I spoke to the owner and he explained to me that a number of businesses around him don't get a whole lot of traffic and business. Partnering with companies like Groupon, Dealfind and Teambuy is a way to survive for a struggling restaurant. Even with these vouchers, he told me, he's still able to make a profit at the end of the day. Frankly, that's all that matters. If he's able to stay in business and offer his food at a discount and people flock to his restaurant, it's a win-win for both parties."}
{"text":"Nothing really special here, but the sushi is adequate.

We popped in here for a late dinner. Service started out bad (3 employees chatting with each other and not paying attention to the customers). Once I got up to flag them down, they were embarrassed and service did improve considerably from there.

I had a maki set for $12.99, came with a California roll, salmon and tuna roll. Meal was decent. I wasn't overly impressed with the California roll, the tobiko was sprinkled over top rather than rolled into the middle. Not sure what was going on there. Salmon and tuna rolls were both tiny, but had a good fish-to-rice ratio. 

I wouldn't go out of my way to come back here, but if I was in a bind for a quick sushi meal I would return if I happened to be in the neighbourhood."}
{"text":"I live in Yonge & Eglinton area, so these discounted vouchers come really handy for us. We've been many times in this restaurant during the last year and I can state and swear that there is NO food poisoning there. At least it didn't happen to us, including my 2 year old baby who likes to eat rice there. 

Regarding the sushi quality, we usually order Dragon Rolls, Special Spicy Salmon Rolls - they are tasty and succulent. Spicy Salmon and Spicy Tuna rolls are good average maki, there is nothing wrong with them comparing to many sushi places we've been to.

I think just because the business offers many discounted coupons makes people look at this place as a \"cheap\", but this doesn't necessarily mean that quality is bad. Comparing this place to other places the quality of sushi is average, but it's not bad at all. The same regarding the service, it's average, but what do you expect from the average non-fancy restaurant? And average means good, in line with our expectations, no complaints.

Finally, as you can see by the waiting line many people chose to come there for a decent sushi dinner  for a half price. Which is not bad at all."}
{"text":"first time there, small cozy place. ordered the all you can eat. Good portions, reasonable prices, food quality was good, friendly service is  as well. Highly recommend this place and Hopefully I'll be back soon."}
{"text":"Ordered chicken curry, and some rolls. The rolls were really yummy...but the chicken curry was bleh. The best thing was the very helpful, attentive waitress. but nahhhh, I won't make that trek again."}
{"text":"Just got home from having dinner at sushi Kai with my son. I had the worst teriyaki steak ever but my son liked his sushi and sashimi. 
Good place for the latter although I made a mistake of going to the restroom.  OMG! Filthy, Filthy, filthy! I'm surprised that the health department allows such a place to stay open in midtown Toronto in 2017.
I have to find another Japanese restaurant soon in this neighborhood!
Don't say you have not been warned!"}
{"text":"If I could give this restaurant a 0-5 I would. 

I was hungry, very hungry -- and I had one thing on my mind. Sushi. We went past an izakaya place but thought that would be too expensive, so we stumbled upon this place and I looked at the Yelp reviews and it didn't seem to bad. 

Just so you know, I'm reviewing this restaurant based on the customer service alone. 

We walked in and waited at the front for a server to seat us -- nobody even acknowledged we were there for about 3 minutes. We decided to go in and seat ourselves even though nobody had said hi to us yet -- even when we sat down at a table for 2. We waited and a server (who still hadn't said hi) gave us tea and said our food will be right up... we told him we hadn't ordered and he said \"oh! Okay.!\" 

He slammed the menus on our table and they looked like they haven't been washed since this place opened and they were falling apart and were all around revolting. We decided what we were going to order roughly around 2 minutes after the waiter had given them to us. We continued to wait patiently for another 10 minutes -- not even a drink order! We waited for yet another 15 minutes while other people who had arrived later than us placed their orders. At around the 20 minute mark of being ignored (no drink order or food order -- we took our coats and left.)

Disappointed and will never -- ever come back."}
{"text":"I'm moving to the area shortly so I started off by finding a new neighborhood go-to sushi place. Google gave Sushi Kai most stars so we went here. I enjoyed the service - the guys were very friendly and courteous. We both ordered their combos, I had a salmon specific combo and it was absolutely awesome. Fish was fresh and savory, the hand-roll had barely any rice in it - all fish and generous serving of avocado. Will be back for more!"}
{"text":"DO NOT GO THERE!!! This place doesn't even deserve a star. I wish the rating system has \"ZERO\" stars. I went there with my husband and kids. For over 30 years eating japanese food, no matter it's authentic jap or not. This is actually the worst experience I had. Sercie was terrible, food was not tasty, and the portion was incredibly small comparing to their menu photo. The vegetables in the tempura were as thin as 2mm thickness. The salmon teriyaki in the bento box was actually made from scraps!!! It's insane, they're indeed not salmon fillet, not salmon steaks, they're SCRAPS!!! What a terrible experience we had!!! Honestly, even now, I still couldn't believe how can a restaurant serve this kind of food."}
{"text":"i wish i can give 0/5. I never write reviews on yelp, but i decided to create an account just to inform others just how bad this place is.

1. Waited at the door for over 15 mins, the place is not busy, half the restaurant was empty. Saw 3 dirty tables that was not never cleaned up. 

2. The entire time we were there, I saw 3 tables just got up and walked out because their food never came. Saw 4 groups of people standing at the door waiting to be seated and eventually just left. 

3. Took another 15 mins just for the waiter to come take our order, even though half the place is empty. There was 1 lady and 1 guy serving. Asked the lady to get us some hot water, she told us we has to get the other waiter to get it for us (wtf you need to get someone else to get us water?). Every time you ask the lady for something, she would always tell us to wait for the other waiter. 

4. Waited another 40 mins for our food to come. We ordered 2 bento boxes and 1 dynamite roll. There was a fly or fruit fly on the melon that came with the bento. My beef Teriakyi was raw inside. We had to wait another 20 mins for the sushi to come. I did not have the courage to eat the salmon roll. 

5. After we finished eating, there were people who ordered before us still waiting for their food to come. 

6. Had a big stomach ache when I was going home (probably from the salad). 

I actually told incoming people to leave as they were waiting at the door. I would have left if I didn't buy the groupon ($15 for $30)

P.S. The menus were falling apart and dirty as shit, I had to clean my hands in the washroom after ordering.

Conclusion: Fk this place. If you printed a groupon, you might as well set it on fire."}
