{"text":"I used to love this place before new management took over. Food quality has seemed to go down since then. I was there last week around lunch and had some pretty poor quality sushi. Definitely not worth the $18.99 I spent. This isnt even why I decided to rate this place. It was when I went to use the washroom at the end of my meal that i decided how awful it really is. There was mice feces all over the sink. If they can't bother to clean that up, I can only imagine  the care they put into their food. AVOID"}
{"text":"First of all, I'm not that fond of sushi. But my wife is. And I try to be a gentleman. So I often go to sushi island. It's not bad I must say. One of the highlights is the range of choice in the all-you-can-eat menu. They have sushis with brown rice, with all kind of tempuras, with all kind of fish, all kind of meat (yes meat). They even have a sushi-pizza and sweet sushis. OK for you Torontonian that may seem normal but for a frenchman it's rice-christmas! Our sushis contain salmon or tuna, seeweed, sometimes, and avocado if the place is really wild. Other plus, the stuff is good! I read that another reviewer can easily come up with 10 sushis place better than this one. I'd love to try them. As I said I am not a sushi connaisseur, but these are definitively the best I had in Toronto. Downsides now. First the service. Not the fact that they are not smiling. I'm coming from Paris, I kind of like that. But, first, because they try to make you drink tons of tea or water so that the rice expands in your stomach and you leave with a full belly that will seems empty one hour later, and, second, because they put a really nasty pressure on you so that you leave quickly your table. Not the usual 'no rush' that means exactly the contrary but insistant stare-down that tells you that if you don't exit right now the chef is going to come and use you as raw material for his brand new type of sushi. Coming with white or brown rice, tempura and gallons of tea..."}
{"text":"\"Meh\" actually sums it up really well.  Below average in  almost every way.  Not horrid, just below average.   Below average atmosphere, decor,service, food quality, selection, and yes, below average prices.   They seem mayo happy, it was used abundantly in almost every single roll.  Above average use of mayo.    So, next time you are looking for a below average dining experience, something decidedly \"meh\", THIS is most definitely your spot."}
{"text":"The food is mediocre, nothing special.   Service was HORRIBLE, never have i experienced such bad service in my life. Took more than an hr for the food to finally come and after a 2 rounds of AYCE, the waitress said that our time was up.  So we asked if we can order once more and stay longer to finish the food and she said it was ok.  Then the real horrible service came when another waitress came along and asked us if we had enough sarcastically , and that we overstayed our welcome. We told her the other waitress said it was ok and told her if they didn't take an hr to bring us our food maybe we would be gone by now.   So then we told her that she has really bad service, and she said, well that's our opinion.   Then with a smirk and grumbling she walked away. 2 mins later she comes back with our food and said, now are you happy?  Then she hovers over us and stares at us while we ate the last plates.  And finally as we were leaving another waitress comes to clean up and thank us, and the rude waitress comes along and tells her not to thank us and that we are not worth thanking.  Honestly if you decide to put a time limit to the AYCE menu, then maybe try serving the food quicker. Customers should not be forced to leave when they are not yet full.   Also even if the customer is rude which we were not, the waitress should not be starting arguments with the customers.   DO NOT GO TO THIS RESTAURANT UNLESS YOU WANT MEH FOOD AND WANNA BE TREATED BADLY."}
{"text":"Sushi Island is located not far from Sushi D (my personal favourite AYCE Japanese sushi place) and a place we often passed by with a big line up outside.  A couple of years ago, I went when a friend suggested I try it so a group of us went.  My expectations were a bit high since we thought the big line ups must mean it's a good place to eat.  We figure the turnover would mean the food is fresh and reasonably good.  We were disappointed with the service (they even told us that they had a strictly enforced 1.5 hour time limit but perhaps it was the big bodybuilder with us that scared them off but they didn't know it's the small guys that are the big eaters lol).  The worst part was the wait... they told us it would take an hour to seat our party of 4 and it took closer to 2 hours.  Didn't matter, we figure by the time they served us food, the paper napkin would probably taste good.  So, we sat down to eat and the quality was ok but nothing special considering we were starving.  The service was a bit slow but we assumed it was because it was so busy. We decided it was ok but it wasn't worth the long wait and the rolls had a bit more rice than we liked.  Several months later, we went back again because another friend wanted to try it but this time it was a shorter wait period as it was late after the main dinner hour.  We met the owner (Chinese) and she was pleasant.  My friend liked the selection because it had some unique menu items (eg. beef sashimi) not offered at the place we usually go such.  He enjoyed it and also liked the red tuna so he decided to go back again the following week.  I didn't go with him on the following occasion but he was upset when they told him he could only order red tuna once (3 pieces) because it was an expensive item so despite being an AYCE they limited his order! He complained to no avail so we have never been back since.  Not sure if the ownership or policy has changed since then but my own experience was ok so a 3 star rating."}
{"text":"Rest in Peace Sushi Island. The New Sushi Island is a poor imitation that stands in your place. How poor? Well really, it's an evil imposter, a bitter betrayal of your memory who's food actually caused me to vomit. One star is too generous.  The New Sushi island, like the old, is a sushi bar with an extensive all-you-can-eat menu. Except that where the old was good, this is not.  Here's how it went down:  seaweed and avocado salad = vast heap of grated iceburg lettuce thinly covered with seaweed and avocado so drenched in salad dressing I had to mop it up with a napkin.  ohitashi = large heap of gritty spinach with a small amount of dressing. Dish is low in flavour, high in sand.  Natural Gold Roll = they delivered a non-vegetarian roll instead and it had to be sent back. The second one was vegetarian, but high in damp tempura batter, low in flavour and loosely rolled.  Caterpillar roll = avocado on top has brown spots and looks like it has been unrefridgerated for some time. Roll is again loose, full of tempura batter, tasteless and contains something weirdly chewy.  Dumplings = clearly still made in house, these now contain noodles, a few frozen peas complete with freezer burn, and miniscule pieces of mushroom. The dominant flavour is freezer burn.  At this point the nausea set in. We left without dessert, paid and frankly fled. Ten minutes out the door and I was throwing-up. Save yourself, avoid the New Sushi Island like the plague, your gut and the street cleaners will thank you."}
{"text":"Sushi Island is very experimental with their rolls. They offers a lot of unique makis you won't be able to find anywhere else; there are a ton of random and weird ones but it's all catered to those who are daring and are willing to try. Food is to par as typical buffet styled AYCE sushi fare so nothing out of the ordinary. The waitresses are nice and the food all came in a timely fashion.  This restaurant is the place to go with a big group and share everything ."}
{"text":"I make it a trip to go out to this place. About the only downside to New Island is that there hours are very limited.   I believe they are open from 4:30pm - 11 or something around that. On the weekends they offer a lunch service.   I've had the same impeccable service whether it was a group of 10 or just a friend and I. Even with ten people we still had constant food and it tasted delicious. The Fire House roll and the Scorpion rolls are the best.  This place has had excellent food and I always plan to make it there if I am in Toronto in the evening."}
{"text":"I went to New Sushi Island last Saturday with my boyfriend and it is the worst dining experience I've had, ever.  Our waitress was superb, efficient, and knowledgeable about all the items on the dinner buffet menu, so I loved the service from her. The food was actually decent too, not bad at all. At the end of the meal, we couldn't finish 2 pieces of maki rolls (I emphasize 2 pieces, not 2 rolls) and 1/3 plate of yakiudon. The manager (or who I think is the manager) came over to inspect our plates and informed us that we have to finish everything or we will be charged full price. I know on their menu they do indicate that anything that is not finished will be charged at full price, which is actually a rule for many all-you-can-eat Japanese places as well. However, I have been to countless all-you-can-eat places and never was I charged ONCE for leftover, EVER. I understand if I left a plate of sashimi on the table, or a ridiculous amount of food overall, but this was not the case.  Anyway, being shocked as I was, my boyfriend and I still managed to finish the two pieces of sushi (we were really really full) thinking that is what the manager was concerned about, not the yakiudon. So when our server came we ordered ice cream but was told that we cannot order ice cream until we finish everything on the table. By the time I was not only shocked but also mad. What is this? Are they some sorta sushi nazi? And for argument sake, what if I prefer to eat ice cream first and THEN finish the rest of the food? I'm not given that choice? Anyway, I told her that if the owner doesn't want any wasted food, they should not open an AYCE restaurant and stick with a la carte - some wasted food is almost the norm with any AYCE / buffet restaurant. Also, I told her, as customers we cannot predict exactly how much we can eat every time we order; we don't know your portion size, we cannot predict how much we can eat at a period of time. Also, what if we really don't like a maki roll, for example? What if the fish is not fresh? Will we be forced to eat it too because of their \"rule\"? She was really apologetic and said she will talk to the manager. She came back a few minutes later, again very apologetic, telling us if we can \"take a few more bites\" of the yakitori. By that time, I was already furious as I felt like I was treated like a child instead of a paying customer but I know it wasn't our waitress' fault so I didn't bother saying anything more to her. And so we tried out best but just couldn't finish it, and left about 1/5 plate of yakitori left. Our server came over again and I asked her if this was \"sufficient\", and she said it was fine, and said sorry a few more times.  I honestly cannot believe the management at New Sushi Island. Yes, wasted food is never good, but again I need to emphasize that we didn't leave any sashimi or any \"expensive\" food behind; it was yakiudon (with mostly udon and veggies left). The \"finish-everything-or-else-charge-at-full-price-rule\" can be enforced every time if they want to but I gotta say it will just drive customers away. Don't get me wrong, it needs to be stated clearly but I believe management needs to implement the rule WITH DISCRETION!!! Just like how the speed limit on the highway is 100 km//hr, but do people get a ticket for going 110km/hr? No, they don't.  I will not be going back to New Sushi Island"}
{"text":"Sushi Island gets my vote for the most modern sushi joint in the city. The inside looks like a regular sushi place, but the menu is super creative; especially their vegetarian selection. The staff is really friendly and they sometimes give you some bonus ice cream just for placing a large takeout order. They deliver but it takes ages and the area they deliver to is small. The prices are decent, but it can easily get pricey."}
{"text":"The service here is the worst I've ever experienced.  My boyfriend and I went for all you can eat sushi. We were the only people in the restaurant, yet the waitress treated us like a huge inconvenience. We waited forever to order, the food took forever to come, and on top of that, she messed up our order. As we were ordering, we asked a couple of questions and tried to let her know about my boyfriend's food allergy and her response was an eye roll.   The sushi itself was decent but was certainly not worth the wait and being treated so poorly.  At the end of the meal, the waitress brought us our bill and we asked to pay with debit. Again, another eye roll. It took her ten minutes to bring the debit machine and the place was completely empty aside from us.   We decided we did not want to tip her since it was the poorest service we had ever had but the debit machine required we enter a tip. We entered the minimum possible (10 cents) and she openly scoffed and rolled her eyes when she saw the receipt.   We will not be back."}
{"text":"I thought this place was pretty good. Service wasn't too bad, mind you we were a group of four eating at 3pm on a Sunday. The food was generally good.  Stay away from experimental sushi (like pizza sushi), but the spicy tuna roll was crispy and delicious.  Give it a shot."}
{"text":"Fast, fresh and arguably friendly. When hunger strikes and they offer $13.99 AYCE that is both fast and fresh, the latter is much less important, so you deal accordingly.   The menu is great and varied and they offer different levels of all you can eat, so depending on your craving you can choose appropriately. The rolls are fresh and though quite basic for an advanced sushi lover, its the most advanced menu I've seen for AYCE.   The place is incredibly busy, but I've never had to wait more then a minute for a table, nor wait more than a minute for food. As mentioned at the top, hospitable service is not priority number one for the staff , but they are quite kind and thankful, quite endearing in fact. And, as a semi-regular (I make the trek there about three times a month), I've started to notice that even though they don't my name, my favorite band or where I'm from and nor do I feel they care - they are attentive and have started to pick up on my personal sushi subtleties. Get yourself there ASAP."}
{"text":"Ok, the photos I posted don't actually do justice to the ridiculousness of the food at this all-you-can eat sushi place on College street, in #Toronto. It used to be quite good, but sadly it was underwhelming and disappointing. That mackerel sashimi actually includes most of the tail! And the deep fried bananas were coated in chicken nugget coating and deep fried in the same oil as meat/fish. And the chicken and mushroom skewers... we're mostly skewer... #fail #fooddisappointment #sobad #notgoingback"}
{"text":"So I hear Sushi Island has a menu in addition to the all you can eat menu. Maybe one day I will try that 'other' menu, but for now (and very possibly for ever) the all you can eat sushi menu does it for me! HAVE I MENTIONED ITS ALL YOU CAN EAT?!?  So here's the deal, if you are going to go to Sushi Island do it right. Call, txt, email, or facebook event your friends to join you for an evening of delicious all you can eat sushi. Don't you dare take on the all you can eat yourself. It will destroy you and force you to crawl back to mommy. Bringing friends allows you to enjoy their company and gives you more sushi option to try. You don't have to polish off 6 or 8 pieces of 2 or 3 dishes all by yourself. You can one or two pieces of 100 dishes! (providing you have that many friends. if you have that many friends, can I borrow some?). More friends = More items to try.   Deanna addressed the other things I was going to talk about so I won't waste our mutual time. Do go though. Bring friends. Rock the sushi."}
{"text":"Meh is the way I would describe this place. They forgot a Bunch of items ordered so we continuously had to re order. We ended up having doubles and triples of things because of the forgetting and re ordering. The food really wasn't very good. The chicken tasted old and we ended up with a pretty unsettled and girggly stomach for the next 24 hours. You can definitely find better AYCE sushi in the city."}
{"text":"I ate here on Sunday at 12:30p. There was only one other couple eating there, which made me nervous (I never like to be the only person at a restaurant I've never tried), but I decided that most people probably aren't early risers on the weekend. Mostly I was craving sushi and the Sushi Q wasn't open yet. I went for the \"All you can eat\" lunch for $13. Not a bad deal. Started with perfunctory miso soup and iceberg salad, which was simply drowning in the, albeit delicious, ginger dressing. Ordered salmon and red snapper sushi. The salmon was so-so, not extremely fresh tasting. The snapper was chewy. Maybe this is normal texture, but i had to literally rip it into two pieces to chew it. Strange. The rice was quite warm still which added its heat to the coolness of the fish.  As for service, the only thing worse than a server having the disappearing syndrome whenever you need something, is the server having nothing better to do than watch your every move and pounce as soon as the last bite enters your mouth. Even as I was chewing the last piece of salmon, my waitress took away my plate and asked if I would like something else. I excused her as being eager to please. Next I ordered a spicy tuna roll that took awhile to arrive, probably owing to the fact that they didn't have the tempura bits on hand yet and fried them up fresh. Normally I would have tried the eel, but they did not have it on the menu as sushi and I simply couldn't eat another roll.  Again, even before I was finished the waitress was back asking if I would like anything else. The other tables were finally starting to fill, so now I took her attitude as actually trying to rush me out to get the table back. So much for my relaxing lunch and catching up on reading session.  Just for kicks (and maybe out of stubbornness), I decided to order the vegetable dumplings, pan-fried. I always like to try dumplings at different restaurants to see if I can find ones that are anywhere near as good as the ones my friends' mom used to make. As always, I was disappointed. These were filled with indistinguishable mush.  So there you have it: a so-so experience of sushi that is pretty much the norm in Toronto."}
{"text":"What on earth happened to this place?? Used to come here almost weekly and it was fine. Great selection, good food quality vs cost ratio i.e. great value for money, decent efficient friendly service.  I'm not usually that bothered by slow service as I tend to eat slowly but this place pushes even my calm patience! This happened a couple of months ago, but we decided maybe it was just an off night and were willing to give it a second chance this past weekend. Nah - sadly seems the new norm!  *If you have about three hours to kill and you enjoy looking at the ceiling decor for extended periods while your stomach rumbles in agony starving then come to Sushi Island! *If you enjoy re-ordering the same items three or four times in the hope that eventually they might remember your order and you'll actually get it then come here! *If you have absolutely amazing company to chat with and don't even notice that the gap between each plate being brought to the table can be an excruciating 20-30mins then eat here! *If you like erratic AC - one minute restaurant is stuffy and hot, next AC is on full and it's like sitting in a freezer then come here (and bring lots of sweaters)!  Kitchen/Sushi Chefs - SLOW SLOW SLOW SLOW, did I mention how slow they are at producing orders? Got to be the slowest Kitchen I've ever ever experienced.  I've never been in a restaurant where you catch all the customers at different tables rolling their eyes, giving acknowledging looks to the other tables, looking bored, playing with phones while waiting for a few morsels of food to hit their table. This happened during both my recent two visits.  Then this past weekend another first for me in a restaurant; all the Customers at different tables started talking to each other in exasperation at the slow service - all asking the same question - What Happened to this Place?? (not to mention it looks dirty and tired now, it needs fixing, repainting and deep cleaning)."}
{"text":"Not worth the money (even with the $60 voucher).   I had a similar experience as the above (left by Hello W.). By far, my worst dining experience ever. I had been to the original Sushi Island and didn't really enjoy the food, but was willing to give the place a second chance with the Dealfind voucher.  I don't know what exactly justifies adding the \"New\" to its name, but the food hadn't changed much - still worse than mediocre. I have no problem giving credit where credit is due, so I will say that the servers were very attentive and adorable, but definitely not enough for a return visit.   The appetizers and desserts should just be skipped altogether. The skin on the eggplant was inedible and the \"tempura yam\" was nothing more than a basket of battered deep fried yam fries. The ice cream also tasted like it came from a bulk supply that was on clear-out because of freezer burn.  Sushi and rolls are sub-par -  I still think that the best (affordable) sushi in the city comes from Sushi on Bloor or New Generation and for the extra few blocks, it's worth the trek.  In terms of service, like I said, the servers were great, but when it came to dealing with the owner/manager, he was a complete nightmare. I won't get into the drama that unfolded, but he was a complete a-hole and does not know the first thing about customer service. To make a long story short (and to avoid any infantile slander) he was rude and insisted on charging us for food we didn't want. Unlike Hello W, I refused to pay and paid cash for what we had and left. The manager proceeded to chase us down the street and spew threats about calling Dealfind to get my personal information.   It goes without saying that New Sushi Island will need a serious overhaul of chefs and management if it wants to avoid becoming \"New NEW Sushi Island\", but the servers should stay."}
{"text":"Hit or miss with this place....but the fried banana with green tea ice-cream dessert has me coming back.  With the all-you-can-eat menu, sometimes have to order the same dish twice as it seems to get lost along the way.  The menu is varied and has a pretty good selection of veggie options...appreciate the menu which has the description of the items, makes ordering a lot easier.  The rolls, sushi and sashmi are decent and are larger portions than other all-you-can-eat places.  Miss the cute server who had the amazing memory though...where did she go?  Seriously, she would remember the whole order without writing anything down and get it right...plus super friendly.  If it's really busy there's usually a time limit to finish the meal...at least for smaller parties."}
{"text":"Yelp should really have a zero star rating! ONE star is being way too generous!!  Let me share my horror story with all of you! My experience with this place was horrifying and i want to make sure none of you food lovers will have to ever experience that!!!  Yesterday (Sunday) it was the 13th and my bf and i were doing our pre valentine's day lunch since we had a busy evening we wanted to stay dt and grab sushi. I'm not generally a big fan of ayce but i do get random cravings.  after surfing on my phone i found this place and decided to give it a shot. As we got there the place was pretty packed the menu was decent not a whole lot of selection for ayce places. it was ok. $12.99, did not complain for the price.  we were told to write on a piece of old receipt for our orders and the food was totally NOT FRESH at all. The fish salmon sushi tasted extremely off!! i couldnt eat it. my bf ate all of it and to let everyone know that WE only ordered once and the only food we  left was yam tempura, edamame and 3 pcs of sushi that we could not finish.  As we proceeded to order our ice cream, the owner/ manager (GIRL) she YELLED at us for WASTING HER FOOD..(in those exact words) She demanded that we finish our food OR else we would have to pay full price and not get our dessert.  A few moments later, i asked to speak with the manager then..The server came back and told us that the girl was the owner and to finish our sushi and then we would get dessert.   GOT my dessert left it untouched NO TIP and never returning!!  Thanks for the horrible experience...  im sure ill be seeing this place going down and/or new owners in no time!!"}
{"text":"Worst sushi take out I've ever ordered.    My usual restaurant was closed for some reason so I thought I'd try something new.  I read the reviews on just-eat and other than comments about delivery times it had good reviews so I gave it a try.  Big mistake.   Here's the rundown of my order.  General Tao chicken - cold, over cooked with next to no sauce to mask it's horrible flavor. Had a few pieces and the rest went to the trash.   Sushi pizza (white tune) - where's the fish?  Most pathetic looking sushi pizza I've seen. The fish was paper thin and flakey.  I questioned if I should eat it but I was starving so stomach won.   Snow dragon roll -  this also had white tuna. Same situation as above.   Buffalo roll - this one I actually liked.  Would have been better if I could have seen or tasted some of the cream cheese that was listed as an ingredient but at least it wasn't as horrible as the rest of my order.   So other than quick delivery time this place had nothing to offer other than the gurgling in my stomach."}
{"text":"Im updating my review because 4 times in a row ive had bad service. I still love that they take my birthday reservations..4 years in a row but 2013 something must have blew through there and it all went down hill from there. I went there once with my bf and we sat down, no one even offered us water and we waited an hour, no orders taken. evern after waving at the waitress she didnt serve us, just a straight up diss. We left and went next door to burrito boyz.  I went there again with friends from out of town, lunch time it was dead in there and it still took over an hour to get any of our food. HELLO WAKE UP!!!!!  my recent birthday party i called the reservation weeks in advance for them to prepare for at least 20 people. Get there the table is set up everythings good. theres 2 chefs and ONE waitress, WTF. everyone was getting antsy because they were taking hours to get peoples orders out and half the time it was the wrong order. After 3 hours no one even cared that we didnt get our food we just left. I will not be coming back.   Im going to try sashimi island down the street."}
{"text":"I'll start off by saying I'm not a sushi person. I'm not particularly fond of raw, cold fish as any kind of meal. But that in itself would never turn me off going to an AYCE sushi place because there are always options that I like (tempura, enoki beef rolls, chicken karage, etc.)  My review is based on the non-sushi items, combined with service.  Almost everything I ate was subpar. Chicken teriyaki, chicken karage, enoki beef, unagi - not something I would ever order again here. I know it can be done better. This place does it poorly.  the shrimp tempura was lightly fried and fairly good. I think the only thing I liked more than usual was the sweet potato tempura. I don't like sweet potatoes, but these tasted more like regular potatoes. That's probably a con for most people though.  I was charged $20 for the AYCE even though I had no sashimi. My friends ordered it though, so I guess they'd charge me for it anyway. Just because it's typical practice to do so doesn't mean I have to like it.  Service was below average. The waitresses brought food to the wrong side of the table. We were a fairly large group, so I had no idea when my food came because it went to the other side and my friends just thought someone on that side ordered it. We shared everything anyway so they didn't bother asking who ordered what. I had to order some dishes again.   Even though the service wasn't great, our server was still relatively pleasant. One of the other waitresses at another table wasn't so pleasant though, yelling things in mandarin to other waitresses.   I'd rate this place a 1.5, but since I can't actually leave 1.5 stars, I'm rounding down. It's not the worst establishment I've ever been to, but it definitely doesn't deserve 2 stars or higher."}
{"text":"I think this place is best known for its all you can eat sushi menu, there are several price points I think ranging from about $15 to $25, the cheaper the price point the greater the restrictions.  I used to come here once in a while if I wanted to binge on a bunch of cheap sushi and sashimi after a long bike ride. Compared to other AYCE sushi places here is decent, it is not always consistent though. Certain fishes can be quite stale some times, but passable other times, it is really hit or miss, and the tempuras are always really oily.  Service is meh, the waitresses are never that friendly or nice, they are the get the work done types. Overall, I stopped going because I really can't stand the taste of low grade sashimis and sushis anymore. If I need to food binge after long rides, I rather have a huge bowl of Pho or a burrito from Burrito Boys now.  Overall, if you want to binge on a bunch of sushi and sashimi and do not mind mediocre quality fish and rice, come here, you will definitely leave stuffed and not craving sushi for at least a week. If you want quality sushi/sashimi look elsewhere."}
{"text":"After a long day on the island drinking beer with a Halifax friend, I met Evelyn W. and others at Sushi Island. We did the AYCE, but we sorta fucked it up. Actually I blame a good friend of mine for over ordering some mediocre rolls. I have always considered things like volcano rolls and the like to be kinda white-trash-y, but on this evening there they were taking up precious real estate in my stomach. Also, there were california rolls on the table. Who orders california rolls at AYCE? While I will not judge Sushi Island based on solely on a classic case of bad ordering, I have to take off 2 stars for the fact that the sushi came out slightly hotter than room temperature. I think it was the rice..hadnt cooled enough or something, but that was gross.   On the plus side, their whole menu was open for anyone doing the AYCE which included tons of sashimi, lobster maki, and the highlight of my meal - a spicy seafood soup. Get the seafood soup (that was a good recommendation, thx M.K.), but for the love of god don't just assume that you should order for the table when it's AYCE."}
{"text":"Worst Dining Experience Ever!!!  Arrived at 9:30PM and everything was going great.  Sushi was decent and sashimi slices were good.  At 10PM a waitress came over and asked if I was using a voucher and I said yes.  I pulled out my voucher number and she asked if I had a printout and said no.  Manager comes over and starts saying I have to pay full price if I don`t have it.  Which makes no sense because all they need is the voucher number and name to confirm.  He was being completely unreasonable and totally ruined my meal and my friends meal for the sake of collecting full price.  He kept saying that if I didn`t pay full price we would have a problem.  Not sure if he was threatening to call the police but we paid $25 each for 30 minutes of AYCE and a headache.  Thanks New Island Sushi for a terrible experience."}
{"text":"This place has always delivered.  The sushi is not the best I've ever had, but is good and considering that I'm there for cheap, all-you-can-eat sushi, it's perfect.  The staff has always been polite and attentive and the service has been quick.  I've been about 6 times now and it's consistently good."}
{"text":"Look, I'm Asian alright? I mean, just barely, as I'm only 1/2 Japanese and I'm 3rd generation but still, I grew up eating my Grandma's sushi so I feel I know way more than you trendy white people when it comes to evaluating sushi. Then again, maybe I don't.   Anyway, in my less than humble opinion, quality in sushi comes down to many things, but only one thing seems to be different from place to place here in the GTA - the rice. The rice is key. To me, that's the difference between good sushi and bad sushi and the rice at Sushi Island is always quality. Sweet, sticky and fresh, this place rocks because of the rice.   I usually go for the all-you-can-eat special. If you're a maki fan like myself there's no need to go for the more expensive options 2 or 3, there's enough variety in option 1 for $13.99 ($2 more Friday-Sunday). Start off basic with a crunchy roll and a spicy tuna handroll to appreciate the rice and then go nuts, there literally are no bad options.   Other than the AYCE specials, I remember the bento boxes being good value and quite substantial and the tempura is always nice as well.  A great place to eat basic, fresh, cheap sushi."}
{"text":"For an All-you-can-eat Sushi joint, this place is the best in Toronto.  It not only has sushi but sashimi too, and even beef sashimi - which i haven't seen on any all you can eat sushi restaurants in Toronto. We've even brought kids there. Dinner is $19.99 for the full menu."}
{"text":"While visiting Toronto, or the ToTo's as I like to call it, I decided to give all you can eat sushi/Japanese restaurants a try. So I go to yelp since yelp has rarely pointed me in the wrong direction in the past.  This on the other hand is one of the times yelp pointed me in the wrong direction, and it's not yelps fault. Yelp isn't a person who gives me advice, but rather a portal to read other peoples opinions. And here I will have to disagree with the rather glowing reviews of the establishment. The food  is three stars. The service brings the review down even further. Several items that were ordered were never put in, or  found their proper way to the table. The service at first was quick, but then as time progressed service began to slow down for no apparent reason. The restaurant did not become more crowded, so I'm not sure why service slowed, but it did."}
{"text":"I don't know how this place is in business - I would NEVER go back. Not only was the service horrible but the food was awful.  The server was coughing the whole time we were there - obviously sick and shouldn't have been working. At one point, we were ordering our food and she turned around and helped another table and then ran off without allowing us to complete our order.   We had to ask for our order 3 times. They didn't bring ther drinks and the bill took 18 minutes to get to the table.  Toronto has so many great sushi restaurants - avoid ths one and go somewhere else."}
{"text":"Brutal sushi house. The decor is weathered and cheap and the restaurant is absolutely filthy.  On top of that the food is mediocre at best"}
{"text":"Every now and then I encounter a place with such abysmal service that I wonder how it could still be in business. New Sushi Island is one of those places. My friends and I wandered in to grab a bite before catching a matinée. It was busy but not excessively so; we certainly didn't anticipate any problems when we decided to grab a table. I ordered a veggie combo off the menu but the rest of our party opted for the All You Can Eat special. Aside from my drink order which was never delivered (I decided to flag down the waitress after 15-20 minutes and then had to wait another 10-15 minutes for it to arrive, sans apology for the delay), I received the first part of my combo without any problem. My friends were not so fortunate.   After being cut off while trying to order multiple items (the waiter told them they had \"enough for now\"), my friends received their soup and salad but then had to wait roughly an hour and a half for the rest of their food. They inquired multiple times with the waitress as to the whereabouts of their meal and explained that we had to leave soon to make our show. The waitress repeated that it was \"coming\". I eventually received the second half of my veggie combo and offered to share with my starving friends who still had no idea where their AYCE selections were. Eventually, they received the bulk of their order, but numerous items were still missing. After confronting the waitress (again), she denied that my friends had ever ordered the misplaced items in the first place.  My friends became annoyed and asked to speak to the manager; our waitress went to find her, then returned with a napkin for us to write down our complaints. One person in our party persisted and finally the manager came to our table. She could barely speak English. I hate to be unpleasant but if you're going to operate in the food and hospitality business, you should at least have some basic grasp of the language your customers will be speaking. We had to explain the situation multiple times and the manager finally delivered the missing items with take-out containers, since by that time we had to leave.  After all this trouble, the food was mediocre at best. I have never encountered such terrible service at a sit-down restaurant in Toronto. In fact, we probably would have received better service from a hot dog stand. Don't waste your time or money; I predict they'll be out of business in a year."}
{"text":"This place is now horrible since the renovations. The food was barely edible. I have never had such poorly prepared sushi rice. It tasted like Uncle Ben's with too much water. Utterly un-sushi-rice-like. And the staff kicjed us out after 1 hour because there was someone else wating, even though we had a reservation, and there were only 2 people in total waiting. I have never been kicked out of a place before."}
{"text":"I usually get delivery or take out from here because I can't bother waiting in the long line. I've tried the all you can eat menu but the size of my appetite doesn't make it worth while. the thing i like most about sushi island is their selection for vegetarians. most sushi places I go to usually just offer cucumber and avocado rolls. i ordered vegetable tempura and what i got was mostly yam tempura with 1 piece of broccoli. their tempura is definitely not their strong suit.   the prices are decent and with take out, i think it's 20% off."}
{"text":"Sushi island is not the best sushi you will have in your life. Not in the top ten. That being said, I like it here as a sort of excessive Japanese fast food (as opposed to fine dining).  The service has really improved in the past year, the servers are nice, and totally willing to bring mountains of food to the table. I really like the crystal roll, the spicy chicken tastes like chicken wings (that's a good thing!), and I like that I can get handrolls. Not fancy, but good. I've been going here for years, so maybe part of my attraction is the tradition, but a place has to be decent to bring a group together every month. (Plus we are gluttons, and like to eat ourselves sick.) We always order the mid level AYCE, which includes all appetizers, but not sashimi.  Oh, and they take reservations. Skip the line!  $22 with tax and tip for as much as I can eat. And don't fool yourself. That's A LOT."}
{"text":"Recently Moved to the Area. And found my way to this Restaurant late evening on a Sunday.  Through the window it didn't look too busy. It is well kept (for the most part) and welcoming.  When i walked in, I was immediately greeted by almost everyone working there.  And was quickly escorted to a table for 2 (i brought my girlfriend).  This is a All you can eat / A la Carte type restaurant.   Decor: Simple, and functional. Not going to get the frills here, but its tasteful and inviting.  Their also somewhat sectioned off, if you like your privacy.  Service: I was welcomed promptly.  And directed to a table quickly.  Immediately given a menu and offered something to drink.  The hostess was pretty, and very well mannered.  Kept checking up on us throughout the meal, to ensure we were satisfied.  Food: *Note: I only had the rolls.* Rolls were made to a perfect size. and evenly distributed ingredients throughout. Use of Mayo was a little to much for my liking.  But when my girlfriend asked for less when i ordered again, they kept it in mind. (my objective opinion, never complain about getting too much of anything). Spice level was spot on.  The hand rolls were also done well. and tasted exactly as it should.  During my experience. The dinner rush was creeping in, as we were wrapping up, causing a bit of a delay in the kitchen.  But nothing to complain about (i had good company to chat with).  Price: They Give you plenty of options for pricing.  A la Carte  or 3 types of All you can eat. If you know what you want, or have an idea. Pick the right price point and you'll be happy. I went with the $19.99 All You Can Eat option.  Keep in mind, this isn't an upscale Sushi dining experience, it's a place to come spur of the moment (although, they do take reservations) and enjoy something made right.  Having Said that, the price was spot on.  The quality of food and service is what your paying for. And you wont be disappointed."}
{"text":"Great menu for all you can eat. The All You Can Eat II is best for bring groups (everything on the menu except sashimi) only $23 w tax/tip!"}
{"text":"These guys changed ownership again sometime between november and december 2014 and while the previous owners definitely dropped the ball, the new owners are great!  We went for AYCE on a sunday evening while they had the 30% off promotion. Having been a couple times before this new change in ownership I was wary - but their new chef is great, the service was lovely and although they were fairly busy for sunday night dinner we never had to wait more than a minute or two to order new items or get a refill on our tea.  The enoki beef rolls are a bit smaller than they were previously but they taste even better. The rolls were all fresh and tasty. We had at least 8 different rolls. The eel was perfect and the white tuna was tasty.  I was so impressed I plan to have my annual birthday sushi here in March! (Which is usually a group of 15-30 people)  The new owners have really turned the quality of the AYCE service around. If you have been here before and were disappointed I recommend that you give new sushi island once more chance. Granted this is still AYCE so you aren't going to get the quality you would if you were paying by the roll (Ie. I have paid $45 dollars for two rolls and 6 pieces of sushi and they were exquisite) but if you want to chow down on sushi for two then this is a great deal. They had a couple tiers of sushi. 16.99 and 19.99 options from what I recall. We went with the 19.99 as my boyfriend likes sashimi.   Great value for under $50 for 2 people to have dinner"}
{"text":"I honestly don't understand the whole Sushi Island trend, price wise - yes, great all you can eat price @ $13 maki.  If you're broke and very hungry - Sushi Island all the way, although if you're up for tasty Japanese cuisine - Sushi D is better - at couple bucks more for AYCE."}
{"text":"The game changer = black and brown rice options!  That's something that adds a distinctive spin to this sushi experience.    I've been here a few times before on the weekend and admit that the service was not outstanding; however, on a somewhat slower Thursday night, all was well.  The servers were quick and friendly and everything we ordered actually arrived at the table!  The price was fair for AYCE maki and handrolls (including miso soup and green salad): $13.99.  Although very inventive with their creations, the downside was the insertion of tempura and/or crunchy bits into almost every roll.  Of note, our waitress was cool with our request for a simpler, off-the-menu salmon and avocado handroll - maybe just because it was a slow night...?    Shout outs to the brown rice Canadian roll (with hot pepper flakes on top) and plum sake - delish!"}
{"text":"They have reopened under new management!!! I'm so glad, I love this place.  They have a 30% offer at the moment because they just opened again so now is the time to get in and try the maki and the red dragon rolls.  Admittedly, I have never dined inside, I have only had take out, but I have never been disappointed. The staff are always super friendly and the food is to die for. This is definitely my recommendation for sushi in little Italy.  10/10"}
{"text":"This is my favorite  AYCE sushi buffet, been here many times and always the food is up to par.   I really enjoy their rolls especially their brown rice rolls, I think the brown rice rolls seems lighter than the white thats why I can just eat those all night. I also enjoy their sashimi fresh salmon and red tuna. And lets not forget the Avocado salad some AYCE skimp on the avocadoes they don't. And the service is amazing their waiter and waiteress have no need for paper and pencil however they do miss 1 or 2 orders but thats legible.  So as far as AYCE go in toronto this is one of the best. Do make a reservation however even if dining alone.  Food- 5/5 Recommendations- Spider Roll, Avocado Salad, Sirloin Steak, Platinum Roll, Jade Roll"}
{"text":"Simply turrrrrrible.   Went on a Saturday night and ordered a variety of sashimi to start (mackeral, salmon, white tuna), none of it particularly good tasting. The pieces of fish weren't fresh, very sad looking little slivers, colourless and limp.  The mackeral on the other hand was not limp, in fact it was the complete opposite - tough and chewy.  I've had better mackeral out of a can.  Next up was our shrimp tempura.  Pieces were small, soggy and again limp (common theme?).  Didn't even bother to finish it.    Actually the majority of our meal was total garbage. To keep things simple...  - Miso soup (bland, lukewarm) - Deep fried tofu (mushy, zero texture, bland) - Orange Fever Roll (thought the cheese would be new and exciting, ended up being really bland, with some cheddar tossed in for shits and giggles) - Jade Island Roll (again, wanted to try something new but ended up eating glue flavoured nothing with a warm grape to tie it all together)  The seaweed salad and the Eight Firecracker roll were okay, definitely the best thing we ate all night.  Unfortunately not good enough reasons for us to continue ordering.    I don't think I've ever left an AYCE sushi place hungry.  Yes.  This was that horrible.   The waitresses were okay.. not the nicest bunch but not the worst I've experienced either. Don't think they appreciated it when I told them I'd rather pay extra to not finish my food than to eat it.  In the end they didn't charge me, but made it seem like they were doing me a huge favour.  Really?  Anyways, do yourself a favour and avoid this place."}
{"text":"My last experience with Sushi Island was terrible. A friend can not eat gluten and the staff was unable to understand or communicate which items had gluten in them. Several orders were forgotten and requests for beverages completely ignored. Todays experience was probably even more frustrating however. Walked in at 10 (they close at 11) and they were closing and refused to serve us.  My over all take away from this restaurant is that the food is nothing special and the staff gave me no reason to come back. Unreliable hours. Complete headache."}
{"text":"The sushi can be better, but nevertheless for an AYCE its decent. I believe their dinner price is around $18 so for that its not worth it.  There also are cheaper AYCE Sushi throughout Toronto but if you're on College and you really want rice instead of pasta I would give it a go."}
{"text":"The \"new\" sushi island is like any other mediocre sushi restaurant around. It obviously isn't new anymore, and the decor is although decent, doesn't reflect Japan or sushi in any shape or form. The rock like interior walls, with stone-like coral textures, are more reminiscent of Greece. But I get it, a place called New Sushi Island probably isn't going for \"best dressed\" or modern \"decor\".  So it's really about the well-priced, passable sushi and other Japanese dishes they serve here. They do that well. The sashimi tastes fine, the tempura is crispy, and the miso soup tastes miso-ey. I'd even say that the food is good. When you factor in the price, New Island Sushi gets a bit better!  Rolls are averaging to around 6-7 bucks, bento boxes around 10, AYCE ranges from 13.99 to 19.99 depending on whether you solely want maki/rolls or sashimi and other dishes.  Best bang for your buck, and seriously, bang for your buck - you get 20% off your order if you get it to go! That's a pretty good deal for decent sushi and usually, a lot of food. That's something they don't skimp on, you'll always get enough food.  Overall I'd say its one of the better places for mediocre sushi. If you're not a stickler for super fresh, innovative, chic, awesome presentations and atmosphere, this place can settle your sushi cravings and save you $20 in the bank."}
{"text":"This place is TERRIBLE. The service and food is so bad that it's unbelievable. I've never been to a restaurant with such bad servers. They are rude, forgetful and slow. I had to ask for water 6 times before they brought it and expect an average wait time of 25 minutes PER ROLL. At the end of my meal I had a few pieces left because since I had been waiting for my whole order for 2 hours, I got full, and the server had the nerve to get mad at me and demand I pay for each piece.  How is this place still in business!?"}
{"text":"Last year we had a great time at this restaurant. So last Sunday, my partner and I decided to go there again since we have an unused coupon fromDealfind.  The first thing we noticed was that their sashimi pieces were so small, we actually started laughing. It's almost like a joke. We have been to many AYCE Sushi restaurants and this one defnitely is the most stingy one.  My partner red wine came straight from the refrigerator.  When we gave them a voucher from Dealfind, the waitress told us that there has been a new owner and they are not honoring the voucher. This explained why the food quality has gone down the hill.  We argued with them for a while making a scene but it went nowhere. We asked to speak to the owner, the manager said that she doesnt have the owner's contact details. What a BIG LIE!!!  I then put down my AMEX card  and was told that they don't accept AMEX. I had to go to  an ATM 3 blocks away to get some cash or else we couldn't leave the restaurant."}
{"text":"Not a fan.  Rice overcooked and mushy, fish gritty (frozen) and poor quality.  \"Fusion\" contemporary maki... too much fried/deep fried.  There are so many AYCE places just a little further West on College, Island is not worth being marooned at.   Bleh!"}
{"text":"When assessing an AYCE Sushi joint, I grade them on 4 things (not in any order):  1) Cleanliness + Ambiance 2) Value for money 3) Quality and selection of food 4) Speed of delivery  Sushi Island is a solid 4 across the board. I keep coming back because they make a special roll of Rainbow Spicy Salmon Avocado."}
{"text":"I have five words for you. All you can eat sushi. That's right, as much sushi as you can fit in your belly for less than $20- depending on the menu you choose. If you only want maki rolls, the price is $12 and if you want nigiri and sashimi, it's $16. If you want some of the more exotic pieces, it's about $21.    Save some room if you come here though - and some time. This place gets packed (because of the sweet, sweet prices). Plus, you'll want to maximize this experience by getting as much sushi as you can, so go on an empty stomach.   They have some really cool rolls here that you can order - some with cream cheese, some ornately designed like the Green Dragon. There are a ton of choices, so variety really will keep you ordering more and more dishes. The sushi isn't a culinary delight - but if you have a hankering for  a lot of tasty raw fish, this place will hit the spot."}
{"text":"New Sushi Island is such a basic name for a restaurant. Zero sex appeal.  I ordered because I saw them on Just Eat and I was tired of referencing Yelp for reviews.  On Just eat, everything is like 181 reviews 4.5 stars...YEAH RIGHT. Nobody's believing that JUST EAT.  Just eat really likes to trick people so I'd advise that you cross reference with Yelp or Google reviews.  Anyway, I bought the $25 minimum from this place and I got a lot of food!  Was it good? Well it wasn't bad.  I like that they give you so much food but what I don't like, is how small the main ingredients are.  Unless you broke one shrimps face off and split it in half before dipping in tempura goo, I dont understand why the shrimp was so slim.  The cheese wontons were the same story.  They were big ol goathead wontons with barely anything inside...At manchu wok these are called rangoon and they're far more voluptuous. Write that down.  I dont really have complaints, its just--it wasn't awesome.  It was between \"okay\" and \"good\" I like their Miso soup but big whoop.    4 stars for not being HORRIBLE"}
{"text":"Worst sushi experience ever. Rolls were crunchy (no, I didn't order them that way) and they all smelled very fishy. Even the edamame tasted funny and I didn't think that was possible to mess up. Great service though...that's about it."}
{"text":"Sushi Island is the first place I ever tried all-you-can-eat sushi.  They have 3 tiers of all-you-can-eat, $14, $17 and $21.  Each tier opens up a bit more of the menu, with the most expensive including everything, while the cheapest only includes the maki rolls.  Partially because I'm cheap, and partially because I'm rarely in the mood for sashimi, I find that I often opt for the $14 tier, so that's what I'm basing this review on.  They have a large list of options, ranging from the basics (California, spicy salmon, green dragon) to a bunch of \"fancy\" sushi, too.  They have a few rolls made with brown rice, a few rolls with cream cheese inside.  There's even a desert sushi (called the Monkey Roll, or something like that?) which has a piece of banana and some coconut.  I try and end with this one every time.  The sushi is great in quality, but unlike some other AYCE sushi places, you order an entire order of sushi, not just 1 or 2 rolls.  I would recommend going in a group of 4, so that you can have as diverse a sushi selection as possible.  Also, make sure you and your friends are hungry.  Normal AYCE sushi rules apply, such as if you order a stupidly excessive amount, you'll be charged for the individual sushi you don't eat.  Also, this place has a time limit, and will provide you with a last call to order sushi for your table (after about 45 minutes to an hour, I believe.)  Don't worry, those 45 minutes are plenty of time to gorge yourself.  Making a reservation in advance is a great idea because there is almost always a line up."}
{"text":"God I love this place... I've been coming here since 2007 and sometimes a few months pass between visits and I almost forget how good they are.  Food = Delicious and diverse! So many unique and delicious options that you won't find in most other sushi restaurants  Price = Can't be beat. 3 levels of selections for all you can eat and a full menu as well if you prefer. Great value for the price.  Delicious! Truly my favourite sushi restaurant in the city."}
{"text":"Best AYCE in Toronto. Their sushi is very fresh and they use real Japanese soy sauce instead of the cheap Chinese stuff. Though must admit that I missed the old sushi island (before they sold it and changed the name to New Sushi Island). They used to have soft shell crabs on their AYCE menu. Now I can only get that through their spider rolls."}
{"text":"It seems most of the reviews for New Sushi Island are pretty poor but my boyfriend and I have never encountered any of the problems others have listed below.  We have been semi-regulars for quite sometime and this is because the food is decently priced and good, the service is usually great, the atmosphere is okay depending on how busy it is. When we were going more often the waiter remembered us and that was quite nice.  My favourite menu item is the enoki beef rolls, mm."}
{"text":"Definitely a popular sushi place downtown and you are likely going to have to wait in line during peak hours. I personally don't rate it very high when it comes to sushi places. In fact I can think of about 10 others spots I would pick before Sushi Island, but I believe it's the only one in that College area so I can see why it's a chosen locale.  The all-you-can-eat factor is definitely a plus but when it comes to rice just how much can one eat? That stuff expands and leaves you bloated, and if you order maki rolls you will notice they really pack on the rice to get your belly full. I've actually never had anything other than the all-you-an-eat deal so I can't really comment on the rest of their menu.  Service is kind of so-so. You never really know what you're going to get sometimes. The vibe also seems to lack a certain authenticity and quaintness that I'm used to with quality sushi places. You won't necessarily be disappointed with Sushi Island but there are definitely better options in the city."}
{"text":"NEW OWNERS!  Just a warning that Sushi Island just got sold, the new owners will name it the New Sushi Island, but I am sure the quality will go downhill.   It will change management on June 6th I believe."}
{"text":"This was definitely the WORST AYCE sushi experience I've ever had. Most of the reviews seemed decent, which is why I thought I'd give it a shot.  As soon as I walked in, it didn't look that great; we were seated near the window. The server asked if we wanted anything to drink, I ordered a Sprite. - Usually soft drinks are either bottomless or on the menu. - This can cost $1.75 and isn't refillable.  So, we ordered our Salmon Sashimi and they were cut into pieces to small, it was barely an inch by an inch. I've never seen salmon sashimi cut so small! We also ordered a lot of the sushi dishes, and the plates were not washed. My friend noticed some weird residue on the plates, and was disgusted.  We also tried the deep fried shrimp, that wasn't bad. Diced beef with garlic was perfect, unfortunately the service took forever, in an EMPTY restaurant. Just asking for water took over half an hour.  Just as we thought things would turn around, we ordered dessert and we were told only 2 of the 7 things on the dessert menu still exist. They should be taken OFF the menu if they aren't served anymore.  The bill took more than 20 minutes to come and we finally paid. If you want an amazing AYCE experience, make the drive to Markham/Richmond Hill."}
{"text":"Awful is how I would describe it.   They have been through ownership changes a lot and it just keeps getting worse. After my delivery order came an hour and a half later, I was treated to a dynamite roll that was devoid of shrimp tempura and crammed with avocado. I should have just ordered an avocado role to be honest. The spicy chicken appetizer? Yeah if you like chewing on rubber with some sauce splashed on it sparingly. How do you get skimpy with the spicy sauce??  Just don't go there. Go down the street to Sashimi Island if you must. Or learn to make sushi and just make it at home. Probably better than eating this garbage."}
{"text":"After a crazy arse concert I went to last night (METRIC!), my cousin and her friends and I went to Sushi Island.  I was actually quite excited considering that everyone has been telling me that it's \"ultra awesome\" and what not.  We went.  It's now under new management and now called \"NEW Sushi Island.\"  (Wait. what?!)  It's a small little restaurant - there were five of us, so we had to wait a tiny bit for seating.  Like my previous AYCE experience, my cousin and I decided to choose the most random sushi rolls that you can find.   The weirder - the better.  We decided to order a roll called \"Orange Fever.\" ... Weirdest choice ever.  Who the heck puts CHEDDAR CHEESE in sushi (not only that! It felt like fake Blue Diamond cheese).  Then we also tired the Firehouse roll - a roll that contained banana in it... I thought it was okay - but again, my cousin and her friends didn't like it very much.  I was disappointed with the fact that the sushi rolls were not made properly (the ingredients would fall out of the rolls when I picked it up).  Not only that - the dessert looked sketchy too.  They kept some creme brulee and cheesecake in a freezer outside - and they looked extremely sketchy (although, most AYCE places don't even have those selections... but might be for a good reason).  Would I come here again? Probably not."}
{"text":"All you can eat sushi, lovely servers and the best sake around. I feel like I am lowering my chances of getting in here again, but I also think it's my duty to share. I recommend the fresh tempura and the sashimi!"}
{"text":"My default downtown Japanese AYCE - good pricing at $19.99 for the full menu all you can eat.  If you like Japanese appetizers - this is the place to go.  Small tapas portion which is perfect for small parties.  My favs are: - fire dragon roll (limit 1 per table) - Beef Enoki roll - BBQ Set - Grilled Beef Ribs - Salmon Sashimi - good there's no limit to order but the pieces are pretty small  I'm a little surprised about the general rating but I do recommend this spot based on my own experience."}
{"text":"'New sushi island provides the best sushi I have ever had . The food is fresh and great! Strong recommend it!"}
{"text":"Went here a while back, on my way to a friend's birthday.  Stopped in for a quick bite, as I always like to try new sushi places, but sadly this will not be a new favourite.  FOOD  Miso was just miso paste soup with nothing in it (tofu, seaweed, etc).  It was still hot and tasty, but seemed rather lacking without those things.  Maki Rolls (Spicy Salmon, Spicy Rainbow, Red Dragon):  The rolls were really blaaaand.  It was nice that they included some bigger, more expensive rolls in the AYCE, but just really bland tasting unfortunately.  INTERIOR  Big place, tons of seating, and lots of Japanese decorations.  Definitely not up-scale.  Only 1/4 of the seats were full when I was there (weekend evening), but they seemed very busy preparing take-aways.  Radio music playing at a reasonable level, not intrusive (though I do hate top 40 radio).  SERVICE  Was OK.  Nothing special.  Neither friendly nor rude.  Food took an average amount of time to come out  VERDICT  Despite the decent AYCE price, I won't be coming back.  It was meh, and I definitely know of much better 'go-to' places when the sushi craving hits."}
{"text":"My holy grail sushi place downtown. Friendly staff, GREAT AYCE variety. Love, love, love."}
{"text":"All you can eat sushi; more like what they feel like remembering and bringing you sushi. Terrible Service. They literally forgot half the items we ordered and while we were waiting for stuff they forgot we waited to order more. Before long it was last call and he was claiming we never ordered stuff we asked for 4-5 times. The quality is grocery store, the meat is fatty and the sushi? well.. it's grocery store."}
{"text":"I've been here a number of times, and the food has always been consistently excellent.  I love that they have brown rice and I really like the roll with the mango in it.  This is the only all you can eat sushi place that I've seen where you can just order soft shell crab.  You just order the entire soft shell crab and feast on it just like that.  There's no stupid fillers like blocks of cheese in the sushi (yes there are actually places that do this).  The downside is that this place is always packed, so if you want to come with a larger group, you have to wait at least an hour to get a seat at busy times.  The waitresses will try to remember your order, and not write them down, and then they f up, or give you less of what you actually order (as if they underestimate how much you can actually eat).  We've had times where they would miss almost an entire round of orders.  Another negative is that it reminds me more of a bar than a sushi restaurant.  The lighting is dark and dingy, the atmosphere is not doing it for me.  Unfortunately, we don't come back here anymore because my friends went back one time without  me and the service was so terrible on that particular day that they vow not to come back here anymore.  It's a shame because other than the lousy service, the food was so good and the variety they had was stellar.  The best AYCE sushi place I've been to at a downtown Toronto location."}
{"text":"i've always loved this place! Not only is the all you can eat prices amazing but they have a number of unique rolls to this restaurant that are still my favourite to this very day! About a year ago i randomly met this guy who happens to be a food inspector for the city of Toronto. i immediately started listing off a number of restaurants and the moment i said \"sushi island\" he said well i have some good news about that one! on the health inspection standards it has one of the highest scores for all sushi locations in Toronto!... now i don't know about you but if you love sushi, you often know sushi restaurants can be risky as they often have low health scores, just because of the nature of having to use raw fish daily. but after hearing that! \"Sushi Island\" officially became my favourite. yes the place is older , not the newest furniture, paint job etc. but expensive drapes and fancy waiter outfits defiantly don't mean good sanitary practices. so don't be fooled.  For great sushi at a great cost, and on top of that the knowledge that you are being served well prepared food, i highly recommend this place!!!"}
{"text":"I've been to Sushi Island quite a few times with large groups and have to admit that despite the quality not actually being all that good, that all-you-can-eat from a large selection of maki for $13.99 makes quite a good deal.  What I like most about the menu though when I feel like going a la carte is the assortment of brown and mixed rice maki options. The avocado, inari, and mushroom Forever Young roll is a veggie favourite.  The service is never outstanding, but efficient nonetheless. On my latest visit, the server was even unapologetically coughing into her hand while gesturing to the nearest table.   The decor is interesting though, with cave like textures and large metal tiles juxtaposed with gaudy whiteboards advertising free lunch draws and fading crooked sushi posters."}
{"text":"The rating should be modified to reflect the atrocious and subpar, like New Sushi Island.  The cheerful little decor masks the disappointment served.  My friend and I settled for the $19.99 all you can eat buffet.  We ordered handrolls, fiery scorpion, grilled squid, chicken skewars, rolled beef, teriyaki beef, tuna sushi, spicy salmon maki and miso soup.    The good:  the tea, the grilled squid and the beef.  The bad:  they forget to bring us the miso soup!   The worst:  the tuna was rotten!  My friend ate it and made a face. He smelled the following piece and told me it was rotten. I grabbed the piece to smell it and he was right: that piece of fish was one smelly, rotten fish!  At this point, we stopped eating. The appetite was lost.  When it came to settle the bill, the server told us she would charge us for all the pieces we didn't consume, and my friend told her the fish was rotten. She became upset and told us it couldn't be true. When I offered her the fish to smell, she got even more upset.  Eventually, she returned and told us she wouldn't charge us but to not tell her the fish was rotten because they bring in fresh fish every day.  Sure, you can bring fresh fish, but leave out for hours to rot!    And I will say it again:  THE FISH WAS ROTTEN."}
{"text":"This place has a new owner, and is now called New Sushi Island. Blecch.  It should be called \"A Desecration of The Name Sushi Island.\" The food and service are both dramatically worse, and it's more expensive besides, which seems terribly unfair.   A few things were still tasty - the enoki beef rolls were nice, if smaller, and the grilled eggplant ditto. Granted, these items depend largely on their sauces, but still it was an encouraging beginning (even if our hopes were soon to be dashed).  The sushi rolls, formerly quite tasty, are now actively terrible. Mushy, loose, full of poorly cut vegetables and the saddest imaginable fish. Many rolls don't arrive as described (spicy sauce seems to find its way into far too many things), and some others seem to have been cut by a second-grader - some slices are wee, some are gigantic. The ingredient quality has also taken a turn for the worse: avocado, especially, ranged from far too firm to brown and overripe. I could go on, but it's all too depressing.   I mourn my old favorite, Sushi Island. Evidently a large portion of the staff have moved to Sushi Q, down the road. We're going with them. If you value your digestion, I encourage you to consider doing the same."}
{"text":"So far of the bunch of AYCE places I've been to I like Sushi Island the best. My recommendation is to go there at like 6 or a little before, because as some reviews have stated, that place gets really busy over the prime time hours. A relatively narrow but long restaurant, I find their decor a little odd. Its not your stereotypical Japanese decor. They offer a 3 tier pricing system for their AYCE menu. It ranges from $15 to $22 I believe. The difference between their pricing tiers determines from how much of the menu you can order. I usually go for the second tier. Their service is hit and miss, but I can understand that because I've found the same type of issues with many AYCE Japanese places that are popular. Why do I like this place? Their enoki beef rolls (which are my achilles heel) are the best I have had at any AYCE. The second reason is that they offer some unique items you won't find at other places, namely the beef sashimi. I was pleasantly surprised at how good this was. It is an appetizer portion, but I order a bunch of them. Although this is my favourite place so far, there are 3 AYCE sushi places in this neighbourhood of College (Sushi D and Sushi Haru). I have to still get over to Sushi Haru."}
{"text":"2.5 to be exact   As per usual expect free miso soup and salad. Our order consisted of surf tails, Shrimp tempura, a green dragon roll and a spidey roll.  The appetizers were bland but the rolls were decent. Our waitress was a wee bit distracted/hasty but not unfriendly.   It was unusually hot in there... Heard other diners noting it as well. Guess it's that no heat but not time for a/c weather period... No windows in the whole place :(  Also wasabi was not fresh (crumbly mess) but low sodium soy was available on request (appreciated).  I RECOMMEND: Anything with avocado! Happened on the most buttery smooth avocados!!  EXTRA TIP: They deliver through justeat.ca and their kitchen is open till 11 unlike most places in the area :)"}
{"text":"This is one of the only places I will actually wait in line for. Even when they were renewing their liquor license and could only fill half the restaurant, I waited. That's what cheap, delicious sushi does to people. The impatient become patient. Well, I did at least.  Sushi Island is probably my favourite sushi place thus far. I usually grab the $12.99 all-you-can-eat maki menu and go wild. For that price you can usually get 10 pieces of maki at some restaurants, and here you can order to your hearts content. A lot of AYCE places are usually really stingy on service; they think that if they ignore you, you'll get full and stop ordering. The wait staff here will come check on you every five minutes, and when you name off 20 rolls you want to order, they remember them all without writing anything down. Blows my mind every time.  Their rolls are by no means traditional, but they are delicious. The Sushi Island roll has a grape in it (sounds weird, is amazing). The Eight Firecracker Roll is rolled in a mix of eight spices -- it's spicy, in case the word \"fire\" didn't give it away. Fire & Ice has cooked fish and hot peppers...I could describe the whole menu, but I won't. Basically they offer really interesting maki rolls that don't sacrifice quality or taste.  AND IT'S CHEAP. I wouldn't go on a Saturday night, though. During the week it tends to be less busy, and the AYCE prices go up $2 on Fridays and Saturdays."}
{"text":"Cheap AYCE.  I've been here several times.  I come back because they serve AYCE right up until closing time, which most places don't, so if I get off of work late I can still come in for a quick AYCE.  The sushi rolls are pretty decent, nothing amazing but perfectly good for AYCE.  I like the grill items as well.  All right for the cheap price.  Desserts:  cheesecake is WEIRD, cream puffs come frozen to the table -- skip.    Service is good.  I find that a couple of servers are forgetful and deliver things to the wrong tables, and are hard to flag down... BUT there are other servers that are awesome and that quickly pick up on the other's mistakes and do their best to make customers happy.  This happens almost every time I've been in, but the good servers make up for it well.  Some of the tables are weird shaped and you sit on tufted seats.  There are many normal tables as well, though.  The decor is ridiculous -- they seem to put up decorations for holidays and then once the holiday is past they don't take down any decorations.  Christmas, Valentine's, it's all up all the time, and a little dusty.  I've often wondered what laziness like this in the dining room means for how they keep their kitchen...  Once I found a huge gross hair is my food.  I have a strong stomach usually but this just really put me off.  I have never been back after this.  HOWEVER, I heard that they have changed owners very recently (december 2014?).  If this is true then I will probably go back at sometime to check it out again."}
{"text":"Had Friday off and decided to drop by New Sushi Island with some peeps for lunch.  Now they have a lunch AYCE (All You Can Eat) for $11.99 pop not included.  Which isn't horrible and isn't great.  But for downtown the price range is alright.  We were starving and ordered the food asap.  While waiting a sudden hypothesis dawned upon the group, \"What kind of restaurant was here before?\"  The decor very much had a Japanese gloss over on a design that existed before.  The top 2 choices were either 1) a seafood joint or 2) a Mediterranean joint.  Personally, I think it was a Mediterranean place before.  The food came one by one and there was a constant flow throughout lunch.  There's a number of good choices that one can make.  The group really enjoyed the Jada Island Maki (essentially a shrimp tempura roll with a green grape), the chicken Teriyaki (a chicken fillet with a crispy/crisper skin on top with Teriyaki sauce) and the steak onion pieces (chopped up steak pieces marinated with what appears to be onion and garlic).  Some other notable choices included the dumplings and the green dragon roll.  Though we did have two green dragon rolls where one was good and the other not so much.  As an AYCE in downtown Toronto, it packed a good variety and though it wasn't the best it was okay.  There's a good Maki selection and the hot food choices were alright.  Having eaten the salmon sushi, it was.... mixed across the board with our group there.  They seem to be inconsistent as may be good and bad ones mixed all together.  I have a feeling it's dependent on each batch of salmon that was delivered for that month or week.   Green dragon roll was alright.  Overall, New Sushi Island is an okay choice in downtown Toronto.  But as a recommendation, only go there for lunch.  As well, I would only go there for AYCE as if you were to go there for anything else it may not be worth it.  If you're around the region, AYCE lunch isn't a horrible choice.  You'll for sure leave full."}
{"text":"This has been my old time favourite sushi place for a long time and never disappointed. For buffet style, it's one of the best ones out there and they don't skimp on the ingredients and service is relatively good. Many sushi places had come and gone, this one I always come back to."}
{"text":"I've only ever been here for AYCE, and we had a a very fun, fruitful and filling time.  They have a few limitations on their menu, but the off-limits items are exactly what you'd expect when doing AYCE. No soft shell crab is the only one I encountered in my ordering, and I was essentially testing the boundaries by asking for it. Worth a shot, though, ammi right?!  The dinner time AYCE sushi is $19.99, which is completely reasonable, as they keep their sashimi list completely open. Completely open? YES! My plate overflowed with fresh tuna and shrimp.   MUST MENTION: If you're not doing AYCE and you get take-out you get 20% off your food!  BONUS: Let me have my dog on their cute little front patio.  SUPER BONUS: Even though they have the same rule as other AYCE joints in terms of making you pay for what you don't eat, they don't follow it as long as you're reasonable. I think we had some 1 sushi pizza and 2 pieces of California roll left, and they didn't charge us.   PS: I really don't like sushi pizza. I must stop ordering it!"}
