{"text":"Never order from here. It takes more than one hour to deliver, and the food is disappointing."}
{"text":"Pretty good 
Fresh
Friendly staff 
Sashimi and fried rice recommended 
Good volume 40$ enough for 3 persons
Will definitely back"}
{"text":"Ordered online on a Sunday evening and delivery took an hour and 10 minutes... Had to even call and check on order. I consider myself a crab rangoon afficiando - these tasted like fish - assume they use the same deep fryer... And came with no sweet/sour sauce. Sushi was decent and only reason it got more than 1 star... Still nothing to write home about. Chicken in the chicken teriyaki was 70% meat, 30% unedible tendons... Disappointing dinner, although the dog was happy since there were lots of leftovers."}
{"text":"I went on the grand opening day, hoping for a great experience and grand opening deals. Nope, nothing. 

The food was slow, but they made is fresh. However, the rolls were tiny and not worth the money. You'd think they would try to impress you on the opening day, but I was left disappointed and still hungry.

Don't waste your time and money. You can get a similar quality for less at Fresh Madison Market or even head down to Wasabi for better sushi for only a few more dollars."}
{"text":"Would definitely recommend their teriyaki chicken! A lot of tasty food for a reasonable price. I usually get two meals out of it. Their rolls are pretty good too, I like their 3 rolls combo deal.

Updated Review** 08/2016

Soo they've changed their teriyaki chicken and fried rice. They now add vegetables and the sauce is very thin. Not a fan of the new recipe."}
{"text":"In this price range, it's the best you'll find in Madison. The roll combos are a good deal, and they've got good meat entrees as well. Delivery can be slow on a busy night, but overall service is great. OMG I EAT HERE ALLLL THE TIME seriously ugh I cannot get enough of dat soosh."}
{"text":"The food is good considering the moderate pricing for Japanese courses. Through this is more to the kind of \"I need a snack\" -like informal sushi."}
{"text":"This is a good place to have a dinner. GOOD VALUED dishes. Waiters are very friendly. Thx to my friend's invitation. Will come back again soon."}
{"text":"The food and service are great!
Their menu prices are really low and affordable, that I was quite surprised on how the quality of the food would be. 
The \"Mango Lover\" is my favorite roll and the combination hibachi has very tender, juicy meat. 


Also, I had to try the fried Oreos that kept being mentioned, I found them AMAZING!"}
{"text":"Prices are good, but don't trust raw fish from here. They are at best average."}
{"text":"I was craving for a ramen bowl and just suddenly turn right to find it there but nope, they don't do ramen but stir fried udon. So I gave it a try. At the first glance,  I totally knew this is not the real udon I usually have. But the second thought poped up to my mind and I told myself it's probably like a Japanese/Chinese fast foods bcoz of its name, sushi express,  so I should not expect anything but just try and see if my dish is flavorful.  Even though the dish didn't look right but the taste was quite good. Plus having yr noodle on the windiw seat was just perfect but I wanna complain about lousy noisy Chinese staffs that they just ruined my peaceful moment.  Otherwise it was just good."}
{"text":"I have had nothing but awesome experiences with Sushi Express. I highly recommend the green tea ice cream !!!"}
{"text":"Pretty fast delivery?
the portion is also enough.I have tried all Japanese delivery in Madison, this one is average but  cheap."}
{"text":"Old rice in the rolls - gummy
Old wasabi - dried and turning pale
Old ginger - white? 
Raw fish - not bad, seemed fresh
Overall - I think the low price comes from bulk prep of items that won't kill you if they're old and refrigerated, and fresh prep of those that will..... good for a stoney meal, not good if you're trying to impress with your knowledge of the local \"good\" sushi joint."}
{"text":"Food is great here. I've never been disappointed by the sushi I order. 
The girl at the front counter (she's there every time I go) is so quiet and is never enthused about her work. Awkward ordering with no outstanding customer service. 
Actually watched one of their cooks eating, talking, and making orders all at the same time. Gross. 
Food takes awhile to get to your table. I waited almost 20 minutes for 2 sushi rolls last time I was there. 

Restaurant is clean and the location is great, but some improvements could be made."}
{"text":"Sushi express is a small but nice restaurant in Downtown! The service is ok but friendly and ambience is good... The Sushi had great flavor, the Lo-main was a little greasy and so was the meat teriyaki but still had great flavor, the rice was not good really bland... Overall it was ok and I'll will give it another shot and return if possible...!"}
{"text":"I love sushi express because of the convenience and prices. I don't know of anywhere else that I can get two six piece rolls for only $8.50. It's definitely not the best quality sushi but it's still good, way better than grocery store sushi. My favorite rolls are the Boston roll and the shrimp tempura roll. If you're looking for a fancy sushi dinner I would not recommend sushi express, but if you constantly crave sushi like I do and don't always want to spend $20+ sushi express is definitely the move. In addition to the low prices they also have fast delivery!"}
{"text":"As others have said, it is not the BEST quality, but honestly it is great quality delivery sushi, especially because of the price. I love the Hot Girl Roll and the Out of Control Roll, but at the same time the tuna roll and the spicy tuna roll are also amazing. I find a specialty roll and a basic roll is the perfect amount of food for one person. Their warm dishes are also very good. I got the vegetable low mein the last time I ordered and it was the best delivery low mein I have had. More than half the container was actually vegetables, which never happens."}
{"text":"I ate at Red Sushi yesterday. This is a bit more affordable and the specialty rolls were excellent.  Atmosphere is lacking and feels dirty and grimy but I got it to go and enjoyed it very much."}
{"text":"Clearly a Chinese restaurant serving sushi. It was filling and decent, but not what I would call \"good sushi\". This restaurant (unsurprisingly) targets college students. It could use a good cleaning. 
On the bright side it was inexpensive. I would not go back."}
{"text":"While Madison, being a relatively small city, does not have much of a sushi scene, I will say that sushi express is definitely one of the better sushi restaurants on campus. Their food is relatively well priced, the combinations in the sushi recipes are great, and they have good delivery service.  I had an eel sushi roll and a hot girl roll while my friend ordered the eel sushi and out of this world roll.  Both were great, with an adequate amount of fish.  All sushis that we ordered had a good fish to rice ratio that didn't make me feel like I was only eating rice.  Great location too for the campus."}
{"text":"Hey, this ain't Jiro Dreams of Sushi.  Then again, for the price, I find the quality to be staggering.  In terms of my experience, Sushi Express has served me some of the best rolls i've ever had in a Sushi restaurant, rivaling some of Chicago's most popular neighborhood joints.  

I love how they grind the salmon and tuna in their hand rolls and maki....as well, most Spicy rolls have a dusting of panko inside giving that extra addictive texture.  The spider roll is my all-time favorite and they do it really well.  On a side note, I'm always surprised at how good my wife's sweet-potato tempura rolls look.  

All in all, if you love sushi, but just aren't willing to spend endless amounts on it, this spot is fantastic.  Highly recommended for your casual and consistent sushi dining."}
{"text":"Very fair deal; in fact, probably the best night time deal I have seen for sushi in Madison that is not all-you-can-eat. I got the any-3-roll deal for something under ten bucks; unsure if this deal continues. All three were presentable in a to-go box I picked up one sad, rainy day. All rolls had raw fish in them. I did not get sick or taste fishiness from any of the rolls. They were somewhat heavy on rice that seemed to be sitting for a bit; still better than grocery store sushi. The inside of the restaurant was decent for what seemed a predominantly to-go location; staff was friendly."}
{"text":"Awesome affordable sushi! Fast service and good deal, any three (6pc) rolls for $12! Little seating but definitely worth it, will be ordering out or coming here again for sure!"}
{"text":"Delivery's fast, the sashimi's fresh, and the sushi's good. It meets the basic requirements."}
{"text":"Want fast yummy sushi for delivery? ORDER HERE! Yummy sushi rolled well and handled with care over delivery. If you want an amazing addition, try their crab ragoons, you won't be disappointed. So far, Sushi Express has been the fastest sushi delivery in Madison (and I live Downtown)."}
{"text":"It looks like a total dive but well worth the trip. It was inexpensive and the sushi rolls were AMAZING!!!  The most popular is the monster roll and I saw why! The place is small and the tables are tight. You can see the cooks in the kitchen are and there is always delivery guy running past to deliver the take out orders. If you like a place with character and great sushi this is it!!"}
{"text":"I once vomited chicken pot pie and I'll never eat it again... This place has made me sick three times since they've opened a couple years ago and I still eat here. That says something, I think. Anyway, the food is alright. The service is alright. I always get the spicy salmon roll, which is legitimately horrible about 30% of the time, but is usually pretty good. If you do eat here, just, you know, have realistic expectations. It's an eight dollar gamble. And if you're thinking about eating here before 2:30 pm on a weekday, you're exponentially better off grabbing the $10 lunch special at Wasabi."}
{"text":"We ordered the Eel Avocado Roll, Shrimp Tempura Roll, and Dragon Roll and they were perhaps the worst quality I've had in Madison--I'm debating between this place and the sushi place run by Hispanics in Fitchburg for worst sushi. Not only were the ingredients old, each of the rolls' main ingredients were almost non-existent (e.g. there was so little eel and shrimp that we couldn't really taste them) and the eel sauce smelled of soy sauce (yes, unagi sauce contains soy sauce, but it's not supposed to *smell* like it). There was something sour in our fruitless rolls, too, which made me wonder if something hadn't been kept around too long and gone bad....

As my mom always said, \"If you want Pho, don't go to a Thai restaurant,\" and if you want good sushi, don't go to a Chinese place.

If you're looking for some less expensive, but quality rolls, try Ginza's Happy Hour. The prices are comparable and the rolls taste soooo much better there.

In fact, if you take the one-evening sushi-making class from Flambe Gourmet, you can learn to make better tasting, less expensive sushi than Sushi Express."}
{"text":"Just don't. 

I love sushi and therefore, as any proper foodie, have an ongoing ranking of my favorite spots in the city.  On a whim, however, I left my comfort zone and decided to give Sushi Express a try, since a friend once told me it was surprisingly good. I no longer trust her opinion on japanese fare. 

Let me begin that I ordered from Eatstreet.com - it's super convenient, and you earn reward points. After an hour and 23 minutes (I wish I was exaggerating that) without the order showing up at my office, I called the joint to see what was up since the delivery wait extended past the 45 to 60 mins promise. First, I am told by the girl answering the phone that they do not have an order from an hour and a half ago; I explained that I ordered off Eatstreet and I had a confirmation number in addition to the pending charge on my debit statement. She then yells to another employee, then tells me it was delivered.  The gentleman who took over the phone call from that point was extremely polite and provided excellent customer service, but that is the extent of my praise. He explained that it was accidentally delivered to the fourth floor of my building (even though I had entered the office number on the order slip... I checked to be sure this was not a mistake on my part due to the fact that I HATE complaining to restaurants. I've worked in the industry, and in no way to I seek out to make someone's day miserable).  He did offer to drive back, retrieve it from the fourth floor, and deliver it to my floor but I insisted that was unnecessary, I would just run down to grab it; he even went so far as to offer me my money back if I was not satisfied.  I'm not. 

Once I picked up my order from the fourth floor it was cold, but honestly that doesn't matter much to me with sushi, and it's not a problem to reheat crab rangoon. The sushi was mediocre AT BEST. Subpar, is actually how I would describe it.  The flavor leaves much to be desired, the \"crabmeat\" was a joke and they were rolled terribly and just kept falling apart when I tried picking them up; it literally looked like a sushi salad of brown sauce, sushi cucumber and deep fried batter. I've had better crab rangoon from a freezer bag, as well, but that is not where I expect a sushi place to shine. 

All in all; I should have taken the offer to reimburse me, then used that money to go to literally any other of the MANY, many sushi places Madison is home to and ordered a roll that was worth it. Skip this place."}
{"text":"I was actually astonished at how yummy my sushi was from Sushi Express. I ordered their 3 roll combo delivered to my apartment last night and it got here within 45 minutes. The cold rolls were still cold and my warm roll was warm, impressive!

 I had the spicy tuna roll, which is really good. They put crispy tempura bits into it which really gave it something extra. The Philadelphia roll was also yummy. One of my all time favorites will always be the shrimp tempura roll, and this one did not disappoint. I loved it so much I almost ordered some again the next day! Really, really good food and really, really cheap!"}
{"text":"Did carry-out with my girlfriend. Wait time was short, price was pretty good, and our meal was very tasty.

We ordered 3 sushi rolls: The Tuna Roll, Spicy Salmon Roll, and Eel Avocado Roll. Nothing stood out about these - They were solid, tasty sushi rolls.

We also ordered the \"Regular Sashimi\": This was a good choice! 12 pieces of Sashimi for $16! We got 3 salmon, 3 lean tuna, 3 fattier tuna, and 3... yellowtail? They were huge pieces of fish; I want to guess 1.5oz. per piece? The fish seemed fresh and flavorful - not exceptionally so - but still pretty good.

We will definitely order again. Pretty good sushi and good selection at a relatively low price. Thanks, Sushi Express.


Edit: Second trip - Ordered same as first trip, but added an order of fried calamari this time and it was OUT OF THIS WORLD. The breading was perfectly done and the squid was plump and chewy. Each ring was warm, obviously fresh, and generously greasy without having *too* much oil. Try an order of calamari out next time, no questions!"}
{"text":"I had never heard anything about this place beforehand and was visiting from out of town (Ohio), so I believe I came in unbiased and fairly neutral. My group of 8 walked into Sushi Express and noticed immediately that this was a small establishment. The restaurant probably seats 20 at most, and there was only one 4-top table open when we arrived. However, our server was very accommodating, quickly helped the parties who were beginning to leave, cleaned up their tables, and managed to seat us all within maybe 5 minutes of waiting, which I highly appreciate!

My friends suggested I try one of the bento boxes to maximize value. I ordered the short rib bento box, and for less than $11 I received short ribs, fried rice, a salad, and a 4-piece California Roll. I definitely agree that I got my money's worth of food! I ended up with enough leftovers for a second meal! The short ribs were fantastic, the salad and fried rice were average, and the California Roll was so-so but I wasn't expecting it to be great in the first place. Some people in my party got their specialty rolls, which did taste a lot better! Everyone in party was satisfied with what they ordered.

Overall, I was highly satisfied with my dining experience at Sushi Express. Would I return if I ever found myself in the area again? Most likely no, because there are so many other restaurants around I also want to try. However, if I were a UW student, I definitely could see myself swinging by every one or two weeks to get a bento box or some sushi!"}
{"text":"Good, but not great sushi. However, the prices are amazing and the service is fast. I'm a regular customer. It's a really great place for college students who don't have a lot of money to spend but want to have sushi."}
{"text":"The best delivered sushi I have had in town, which is not saying a whole lot.  Red, Muramoto have much higher quality but don't deliver.  However, the cooked item I had was terrible, barely edible, stick to the fish."}
{"text":"I was a little skeptical ordering because of the reviews I saw when I first looked this place up. After eating here though I was honestly pleased with the quality of food that they served. 
I haven't tried the sushi yet so I can't testify for that but if I were you I'd go with the teriyaki here. The chicken is lean and high quality and it's pretty reasonably priced as well. Their delivery doesn't have a 20$ minimum and their charge for the service isn't overly large. This is my go to for delivery for sure.
So yeah, this place definitely has my thumbs up as far as I'm concerned."}
{"text":"My cousin, a UW grad, took us here when we went to visit. Looks like a dicey sushi place but it was pretty happening on Saturday night after exams and graduation have ended.
I can see why, they have a discounted price if you buy two or three of the regular rolls. Then they have an extensive special roll list. And the portions are pretty filling.
The beef teriyaki comes with rice and isn't what I expected it to be (the usual piece of beef, sliced, grilled and sauced).
If I lived there, went to school there, I think I would definitely visit again. It wasn't the best sushi I've ever had, nor the cheapest. But it was definitely a nice spot to get my sushi fix."}
{"text":"I ordered takeout and they were super fast! The food was so good for a great price! If you're looking for deluxe sushi rolls for a low price, this is your place! I would definitely recommend the Dynamite roll!"}
{"text":"I love this place, and they have some of the best prices on their sushi in town, especially when you use the \"any two\" or \"any three\" option. I only ever get sushi here, and I'm pleasantly surprised each time I order something new. It's not 5-star sushi, and if you expect that, well, it's your own fault. I think the sushi is good, and order from Sushi Express regularly. It's one of my favorites. I recommend it to anyone who is looking for good sushi that's not super expensive. I prefer it over most of the other sushi places in town."}
{"text":"Food was delicious. The value of the bento box was such a value meal. I wish we had one in MN. I got the beef ribs teriyaki bento box. 10/10"}
{"text":"The food was good and I would recommend the rolls
But the appetizers should come out before you are done eating the rolls"}
{"text":"This place has great variety. I had quite the appetite, so I went with not one, but TWO entrees. I was very much pleased with the Beef Udon. The Salmon w/ Rice bowl was okay, but I probably should've went with a specialty roll. Best of all, the prices are better than a lot of other asian places downtown."}
{"text":"Unbelievable! The bamboo roll is probably one of the best rolls in Madison. Great service, fresh sushi, and super reasonable prices! I highly recommend this place!

Not to mention the fried Oreos were so great..."}
{"text":"My friends judge me because of how much I enjoy eating here. It's seriously one of the best deals in Madison in my opinion.

Their bento boxes are huge and easily enough food to split between two people or have as two meals. I also really like their sushi deals. You can get 2 or 3 rolls off a set list for pretty cheap. These rolls are pretty standard (tuna, spicy salmon, California, eel and avocado, etc) but if you have a craving for sushi it still does the trick and 3 is more than enough to fill you up. They also have some specialty rolls that cost a bit more but aren't too bad either. 

When eating here, it's definitely a matter of quantity over quality, but honestly for cheap sushi in Madison the quality isn't bad and I would definitely recommend Sushi Express."}
{"text":"I came in with no expectations because trying a new sushi place is always risky - and left completely satisfied! I had the Spicy Tuna roll - which was to die for, the Bamboo roll basically changed my life, and we finished off the meal with some delectable deep fried Oreos topped with whip cream and drizzled with chocolate!  Best sushi place in the campus area hands down !!!!"}
{"text":"First and foremost, this is not an expensive, top of the line sushi place, so if that's what you're looking for best to search elsewhere. But this place is a pretty amazing, on-a-college-budget sushi place.

I've only ever ordered out from here so I can't say much about eating in the restaurant itself but - step one: ordering online was easy-breezy. Delivery right in the time window (30 minutes, hooray!) Pretty decent sushi selection. I had one of the house rolls, the Out of Control, which was awesome, and an Alaska roll and a spicy tuna roll, which was very spicy (excellent). I'm a stickler for fresh avocado and this avocado was nice and green so that was a major plus. All very tasty, again not like a 15$ roll quality but still good quality and tasted fresh. Neatly packaged. Great sizes. 

The boyfriend had a chicken teriyaki bento box with fried rice and he absolutely loved it. The only reason I'm not giving this whole thing five stars is that the chicken, while very good, could have used a good amount more of the teriyaki sauce. 

In all, I'll be back. Great prices, delicious food, excellent service, and fast delivery (if you're looking for delivery time)."}
{"text":"Cheap sushi that tastes pretty decent. Recommend if you want something quick and cheap."}
{"text":"I feel like the term \"American Japanese food\" needs to be a thing the same way that \"American Chinese food\" applies to Chinese takeout restaurants. It's disingenuous to lump traditionalist Japanese sushi restaurants with the Americanized sushi places that serve specialty rolls that have cream cheese and spicy mayo. Sushi Express definitely falls in the category of \"American Japanese food\". I unthinkingly ordered a sashimi plate, and only afterwards did I realize my mistake. You don't come to Sushi Express to get fantastically delicious slices of sashimi from fish caught earlier that day. You come here to enjoy fancy specialty rolls that are hefty and smothered with sauces like spicy mayo or eel sauce. Don't make the mistake I did and hope for sushi that you might get in Tokyo. Come here for the fried sushi rolls, because this is America."}
{"text":"It has the best sushi in Madison! Special rolls and Any two sushi roll special are unbelievably tasty! Royal, Mango Lover, Hot girl and Lake City are my favorite! Its sashimi is very fresh! The price is low compare to the other sushi places around the area. I've been this place at least 7 times within 2 weeks! The last time I was in, I brought 4 friends with me and ordered 6 special roll and 1 love boat sushi entree! I had a wonderful dinner!! I'll definitely dine in often!"}
{"text":"It's rare I eat on my own and even rarer I order delivery for myself. I've been craving sushi for weeks and I hate most of the other delivery places around me. After reading reviews of all the local delivery sushi places, I picked this one despite the other bad reviews.

Honestly? I was expecting cheap sushi, but this is actually good. Still cheap, but good. Blandness is the overall issue I have, but they didn't actually mess anything up. I got a huge sampling order just in case my go to's were terrible like others have said. 

The fried rice was the only thing I regret getting. While it's not inedible, it's just not good. I think I might even rank Asian Kitchen fried rice above this one. It's incredibly bland, a little under cooked, and weirdly not mixed properly. As in there are patches of untouched white rice. It's weird, I've never seen that before.

The calamari is pretty average. It's what I would expect from bar food. My biggest complaint about it is the matching sauce. I think it's a sweet chili. Not something I think of for calamari. I'm not sure if I'll order it again at the price it's at for the amount and quality you get.

The spring rolls were surprisingly really good. Which is odd, because I usually hate all spring and egg rolls. It had just the right amount of fresh vs fried. If you like other place's spring rolls they might not be for you. I'd recommend giving them a shot though.

The crab rangoon is so weird. It has a boat load of crab. Seriously the most crab I've ever seen in a crab rangoon. I'm not actually sure if I like that though. I think they need to tone it down just a touch. I absolutely love that it's not a sugar bomb like most cheap places. It has a great amount of filling compared to fried wrapping. Lack of filling is always my biggest complaint with other places. So I'm pretty impressed. That being said, I'm not sure if I'll order them again. I won't turn them down if some one else orders them and offers me one.

The vegetable tempura is really good, but again bland. I got the bento box and it came with two sweet potato spears, one asparagus spear, an onion ring, two pieces of broccoli, and two cucumber (maybe?) spears (along with the small thing of fried rice and a spring roll). Even though their tempura batter could use some flavor, I'll definitely get this again. I rarely get tempura and just go straight for the sushi, but this really hit the spot.

Ok, now for the sushi. I got a three roll combo and a specialty. The combo included eel and avocado, a California roll, and a spicy tuna roll. The specialty roll was the Firecracker roll. I was expecting a bit more crunch on the Firecracker roll, but maybe I misread the description. Either way, they were all pretty good. About Woodman's premade sushi level or ever so slightly beneath it (depends on the freshness of Woodman's). The spicy mayo was a bit more tame then what I prefer for sushi, but not the worst. The eel could use a bit more sauce. Everything was pretty much what you'd expect from a cheap sushi place.

I'm pretty comfortable with the price/quality/quantity balance. My delivery was supposed to take 60 minutes, but I ordered around 8PM on a Friday and it only took 25 minutes. Impressive. I didn't have cash and tipped on card or I would have gave the guy even more. Also worth noting that the amount of food I just listed is enough to feed three people.

I'll never go here when I want quality sushi (especially not with Muramoto and Red being within walking distance from me), but this is definitely a nice drunk/don't want to get out of my pajamas option."}
{"text":"So pleasantly surprised by this place! With a name like sushi express, you expect just a fast, quick convenience store like meal, but I had two great experiences here in the past month, one being in restaurant and the next being delivery.

The restaurant is small and unassuming, but we were served quickly and efficiently. Similarly with delivery, we had very generous portions of the bento box as well as beautifully packed sushi, all in under the time that was predicted. Prices are reasonable 100% of the time, so you don't have to worry about timing it just right for a lunch special or a happy hour, which is a relief.

SO and I were boring both times and ordered the same type of thing twice, a bento box and the three roll sushi special. For rolls, overall we have tried eel/avocado roll, Alaska roll (salmon/avocado), shrimp tempura, spicy crab roll, and California roll (4 pieces come with the  Bento box). We ordered the squid bento box, which is a super reasonable price, which comes with your choice of white/fried rice, salad/spring roll, 4 piece California roll, and your protein stir fried together with veggies (broccoli, zucchini, carrot, mushroom, onion). The entrée in the bento box I feel could always be cooked a little longer, as the flavor doesn't really get into the squid and the first time, our zucchini and onions were a little undercooked, but I appreciate their efforts of using very fresh vegetables and getting it to us in a timely manner. The sushi itself was good. The flavor of everything was good, and considering the prices, I don't expect very top notch quality anyways.

Having found this place is a relief in Madison if you're looking for a quick, cheap bite to eat around state street."}
{"text":"The food was good! I have eaten cheap sushi and expensive sushi and the fared just fine! That being said I will never eat her again based on the fact that while watching them prepare mine another employee in the back frying shrimp and dropped one on the group and still used it for a sushi role!! Enough said!"}
{"text":"I gave this restaurant a pretty awful review over a year ago, but I've since really taken to this place. Their delivery time has definitely improved. The 2 or 3 roll combos are a great deal. It's not the best quality, but it satisfies my sushi craving without requiring me to change out of my sweatpants. A few times that I had the eel, there were little bones in it, so I avoid eel from this restaurant. 

I recommend spicy tuna, spicy California, and Philadelphia rolls. I've never been disappointed with these three. The rock shrimp is delicious, and the fried oreos were pretty good too (kind of soggy, but tasty)."}
{"text":"Maybe the key here is not going the veggie route. I ordered delivery and decided to try the veggie tempura bento box and the sweet potato tempura roll. 

The sweet potato roll was fine, but rolled so large that you have to eat it in bites. This of course  means that it falls apart and is kind of a mess to eat. I'd put it on par with grocery store sushi.

The veggie tempura would have been better if it wasn't cold. The veggies themselves didn't have a lot of flavor. The tempura batter itself was perfect, and the dipping sauce gave it a little help. The box of tempura included two zucchini spears, two green beans, a broccoli floret, an onion ring, and three small pieces of sweet potato. The broccoli was very mushy, I couldn't get through it. 

The bento box usually comes with four pieces of California roll and I requested they sub a veggie roll if possible. They did, but gave me a cucumber roll that was incredibly bland and falling apart. I ended up chucking it after one piece, but I do appreciate their accommodating my request. 

The best part of the meal was the spring rolls - crispy outside with a pleasantly contrasting filling. 

For delivery there was no minimum and the fee was only a dollar, but that said my bill came out to $17 with tax, fee, and tip. I paid for the convenience of not leaving my house in the cold, but it's a much, much better deal in my eyes to pay $12 for two impeccable veggie rolls and walk a few blocks over to Red."}
{"text":"I ordered delivery from here last night on GrubHub. Delivery took about an hour which I was expecting due to bad weather. I had the firecracker and mango lover rolls. I can't say that I was super impressed, as I didn't feel the food was anything extraordinary, but the sushi seemed fresh and I liked the convenience of not having to leave my hotel room. If I returned to Madison, I would probably order delivery from here again if I didn't feel like going out."}
{"text":"I was very impressed for a place called \"Sushi Express.\" I figured from the name and the signage it was gonna be gross cheap sushi, but it was bomb. The rolls were really good (the avocado eel roll especially) and we had a \"side\" of combination fried rice that was really a course of its own. And it didn't have those little sad pieces of meat they were big real shrimp and chunks of beef and chicken. Would definitely recommend"}
{"text":"We waited over 20 minutes for three rolls even though a group of people came in after us and got all their food. Asked the waitress why it's taking so long she said he's making them together? Never coming here again."}
{"text":"This was a pleasant surprise. For the prices that they charged, I expected the sushi to be just awful. 

It really wasn't. Is it as good as Wasabi, Murimoto, or Red Sushi? No, not at all. (And none of those places are particularly fantastic to begin with.) But it's really, really cheap, is delivered quickly, and totally does the trick."}
{"text":"As always, Sushi Express is exactly what it claims to be-affordable sushi that is still delicious!  You really can't beat Sushi Express' prices at $8.75 for two rolls.  Although I've tried almost every roll there is to offer under this combo, I'd have to say my favorites are the spicy California, shrimp tempura, sweet potato tempura, and the Alaska roll.  Their rolls are consistently good and fresh at a truly unbeatable price (and only $1 with no minimum for delivery!)  I wouldn't go as far to say that their sushi is gourmet or as good as, say, Red, but this place manages to offer bargain sushi that is still solid and won't give you food poisoning.  I'd also recommend the roll-combos as opposed to the specialty rolls, which are slightly less good.  Sushi can occasionally arrive at room temperature but that hasn't been a deal breaker.  I've never been let down by Sushi Express in all 4 years of being a loyal customer. Would recommend their crab Rangoon as well-seriously the best I've ever had!"}
{"text":"Place my order for delivery on a wednesday night at 7:44pm and received food at 9:07pm. 1/2 mile away and the food was cold"}
{"text":"I was excited to try this place out and then Yelp got some wishy washy reviews so I became a frightened cat. With a smidgen of reassurance, we had some delivered. It was great. It's not the best sushi in town but it kicks Takara's tooshie."}
{"text":"Where do I start? I ordered the shrimp bento box online to be delivered. I have been traveling the country for a year and a half now and have never dealt with this issue before. Apparently they put chicken broth in their teriyaki, to the point that the food is literally swimming in the chicken broth. (I've never heard of chicken broth in teriyaki sauce). I am highly allergic and could die from this. I had a few bites and started to notice a reaction. We immediately called the restaurant and they informed us that yes, there was chicken broth in it; but no, we could NOT be refunded because it was \"our fault\". I asked to speak to a manager, she told me she was the manager. She said since it was our fault for not calling, she would not refund us and hung up on us. We called seamless, they said the restaurant refused a refund.
The restaurant called back, said that \"seamless never called\", and they would refund, and we had to call seamless back.
So, here we are, round two with Seamless, who tells us they will now refund it but that we are forever blocked from ordering anything from that restaurant through them (talk about customer service).
I told her this wouldn't be an issue, since I would never order from them again anyway, and would be looking into it legally.
Since I have already started to get sick, I might be pressing legal matters and contacting the FDA.
Thanks, Sushi Express!"}
{"text":"I was terrified to try this place, because the name \"Sushi Express\" does not imply a great deal of quality. However, I was pleasantly surprised! Almost always delicious. I would encourage people to try their delivery service. Fairly consistent. 

If you are using their delivery, don't go crazy. Simple rolls like the spicy tuna is hard to mess up. I tried a specialty roll over delivery and paid for it dearly."}
{"text":"The california roll was a little dry, however, i 've ordered from here twice and they have not disappointed. I think everything here is good, I haven't had a bad experience."}
{"text":"So happy Sushi Express has made it to Toronto.

I first encountered this place in Montreal. It's real fresh sushi on the go. now it's in Toronto!!!! and in the building i work in!!!!

So i'm sure you've tried the sushi at metro. and i'm sure you've gotten take out from sushi rock or somewhere like that. When time isn't on your side, it's really difficult to just find good sushi.

Enter Sushi express to save the day.
They're constantly turning the sushi so it's always fresh. Each box has an excellenet assortment of different types of rolls (you can spend a long time trying to decide) and there bigger roles are ginormous. 
Sometimes after eating sushi i'm a touch hungry, but with suhsi express its not the case. It honeslty is good sushi, fresh sushi, and worth it, and ready to be picked up!"}
{"text":"Love this place!! Have ordered take-out, delivery, and dined in, and all were fantastic. I love the 3 rolls for $12, so cheap, but the rolls are still a great size and delicious!"}
{"text":"Okay, when you're paying less than 10 dollars for two traditional rolls, you can't expect top shelf seafood so please, lower your expectations fast.

That being said, Sushi Express is generously priced and the rolls are amazing considering the price.

I've had a pleasant experience eating in and ordering carry out from Sushi Express. I know some people have mentioned poor delivery services so maybe instead of having it delivered, pick it up yourself the next time you have a hankering for super cheap sushi."}
{"text":"This place is pretty decent as far as quick sushi goes! I love their spicy tuna roll, as it comes with a tempura crunch on top, which tastes great. Also, try their sweet potato tempura roll. 
I haven't tried a whole lot from their menu, but I do order sushi and small sides from them pretty often, especially on later nights. Delivery is fairly quick, and only $1 extra. The only thing I wished they'd change is their hours: I've not found good sushi joints open past 10pm in Madison, and it'd be awesome if they were around on late study nights, since they're right on campus."}
{"text":"Sushi Express is, as the name implies my friends have told me, a place for express sushi and value items. It lives up to this namesake. Sushi was prepared swiftly and in a nice, presentable fashion. My friends native to the Madison scene suggested to get the value bento boxes. 

My order consisted of Salmon sashimi, a Lake City roll, and a Fire Cracker roll. The sashimi arrived within five to seven minutes of my table of 8's order. It came in a pleasant presentable boat plate with ginger, wasabi, and lettuce. Soon after, my rolls arrived with a generous amount of eel, spicy mayo, and wasabi mayo sauce. Waiting just a few minutes more for my friend's bento boxes to arrive, I took a sashimi piece in stride. I was left more than underwhelmed by its frozen meat. Working at a sushi restaurant myself, I wasn't disgusted by the practice but left disappointed that it was like biting into an ice cream bar. For almost the entirety of the meal, I ate through the rolls hoping my salmon would defrost. The rolls itself were well made and satisfactory. For such an express place, Sushi Express put out fairly good quality rolls! It was slightly difficult to dip my rolls into the soy sauce dishes - they were wide and narrow, only scratching the surface area of each piece dipped. The shrimp tempura in each roll was large and plentiful. The fish topped along was not frozen however, so it was an enjoyable experience on behalf of the rolls. 

The service was better than expected for an express restaurant! The waitress was patient with our party. If you're looking for a quick bite of sushi around Madison, definitely check this place out! Additionally, the bento box values are pretty nice a la my party's decision! Worth trying out next time I'm by as well. Would I return? Probably. Not for the sashimi though."}
{"text":"Bless Sushi Express. After living above this restaurant last year and moving away from it now, I regret not stopping by more. For the generally solid food, super reasonable prices, and speed, this place totally rocks at what it does: express sushi.

Some of my favorite things on the menu:
3 rolls for $12.50: The best deal. Perfect to split between two people and at a price of a little over $4 for a roll, this is seriously unbeatable. Their rolls are always decently sized and they don't skimp on putting in the main ingredient (throwing shade at other places that try to substitute extra rice - WE KNOW WHAT YOU'RE DOING) and also always add a nice amount of sauce. My favorite are the eel avocado, eel cucumber, spicy tuna roll, and tempura shrimp!

Gyoza: Yum. Simply just good. Comes with dipping sauce to make the experience even better.

I haven't ventured much outside of their rolled sushi menu to try out any sashimi options or even any of the cooked teriyaki items. I think that Sushi Express is the perfect place to stop to get your sushi fix quickly and without breaking the bank, but I would probably go to Red Sushi or Sushi Muramoto if I'm looking for more of a sit-down place or higher grade sushi. 

The restaurant itself is pretty dark inside other than a few seats by the window, so it's definitely not somewhere I would go for a nice dinner. It doesn't always feel super clean inside either, but it might be the lighting that contributes to this as well. Would recommend going here for take out and enjoying it in the comfort of your home. 

Also other pro-tips:
- If you're in a rush, call ahead and do a take-out order! They are crazy fast and will have it ready for you when you come.
- Eat the guava candy that comes with your check, such a nice way to end the meal.
- EatStreet usually has a coupon for orders made online.

Overall, great place to get sushi on the go but would probably never go out of my way to stop here."}
{"text":"Let's get one thing straight: I am not rating this restaurant on the same scale that I would rate established Madison Sushi restaurants such as RED or Muramoto.

My husband was working and I wanted to spare the embarrassment of going to a restaurant by myself on a Saturday night.  Sushi Express had sent me a pamphlet and I was feeling adventurous (but clearly not adventurous enough to leave my house).  After reading previous Yelp reviews, I hesitatingly decided to order some delivery and I am glad I did.

I got the \"Any Two Roll\" special with a tuna roll and a Philadelphia roll. I also got an additional dynamite roll.

Delivery was faster than other reviews made it out to be (which is surprising considering it was dinner time on a Saturday during student move-in weekend).  The sushi was pretty much what you would expect.  Not excellent.  Not bad.  The rolls were kind of small, but I felt satisfied and could even leave some pieces in the fridge for my husband to eat later.

Basically, if you want GOOD sushi, get your butt to a sit-down restaurant.  If you have a craving and don't want to put on a bra or something other than sweatpants, you really won't be disappointed.  

...I seriously hope this review doesn't make me seem like I've given up on life."}
{"text":"Go-to place for sushi delivery- great 2 and 3 roll combos for unbeatable prices. Delivery is only $1 and there is no delivery minimum! The sushi has never disappointed."}
{"text":"I have ordered take out and delivery on a few occasions.  I have been pleased with the flavors and the speed.  So far I have only had rolls and tempura.  I hope to span out on the Teriyaki and Donburi menu soon.  The only roll I was a bit disappointed in was the eel roll.  It tasted okay but not as good as other locations.  But the tuna, Philly, asparagus, and other rolls have tasted very good.

For take out, the front is not as fancy as other Japanese restaurants but it have a comfortable small dining space.  The kitchen and sushi bar are more functional than pretty.  The staff is efficient and seem to work very well together.

I recommend this space if you are looking for a good and affordable sushi experience without the expense of a fancier dining spot."}
{"text":"The prices are cheap!! The sushi doesnt compare to Red or Muramoto, but they keep their rolls tight and rice sticky. The basics are better here than the specialty ones, and theres usually a deal on them through yelp or their pick-up options. The staff are so kind and really want to make you happy with price, portion, and time spent making the food."}
{"text":"Went here yesterday evening just for a quick dinner. I'm allergic to sesame seeds so I told the woman who worked there and she said she would make me one! I wasn't shocked but I was happy about their accommodating hospitality. I got the salmon cream cheese avocado sushi like the one that was displayed in the front. Very creamy and Yummy. It was around $7 including tax. I should have took a menu with me. It looked like they had a really good variety of other choices there. And sushi tacos! Really good for a food court restaurant... At least that's how it looks.ü I personally think they should open up an actual restaurant in the area if they don't already have one. I don't like eating in food courts... Especially underground. Something doesn't feel right about it."}
{"text":"I usually order the monster roll or the spicy crab roll! They are sooo good. Fast delivery and pretty inexpensive. It doesn't happen all the time but my crab rangoon this time were so full! It was awesome! The only thing was they were out of the soda I wanted so they fave me two bottles of water instead.  Water was a better idea thanks for looking out but they shouldve called."}
{"text":"Ordered for delivery at lunch and was very impressed with how fast the food came. I was told an hour and it came in less than a half hour. I ordered from here by a friend's recommendation. Don't let the name concern you, this is not gas station sushi!  I normally order shrimp tempura but didn't today because I didn't want to end up eating it cold. Instead I got the 3 roll combo which was a great deal! I got the Philadelphia, Spicy Tuna and Spicy California roll. I wasn't too impressed with the spicy Tuna roll, however the other two I really enjoyed! They were fairly large pieces and was impressed how flavorful they were. I will order from here again and can't wait to try more of their rolls."}
{"text":"Do you like warm sushi? I don't. My husband believes this place is better at lunch, but I was not especially impressed."}
{"text":"Not bad at all for food court sushi.  It is in my building so a great quick option.  Unlike other plastic boxed sushi, it is always fresh."}
{"text":"I ordered the spicy salmon roll, tuna roll, and eel roll for sushi and the chicken teriyaki.  The actual tuna and salmon seems to be minced up, not a filet.  Nothing was in the rolls except the rice and protein.  I had assumed there would be some avocado or cucumber of some sort mixed in but nope.  Don't get me wrong, it definitely filled the sushi void in my stomach but now I know why this place is less expensive than the others.

The chicken teriyaki was bad.  Simply bad.  It had no flavor and tasted like it was steamed and then sautéed with some sort of dark flavorless sauce.  The fried rice was made the same.  I mean, come on!  Can we get some sort of flavor with my food.  I don't care if it's a flavor I wouldn't care for as long as it's a flavor.  It's as Sushi Express was afraid of offending people's taste buds so they decided to go with no flavors.  Stick with the mall food such as sarku's for chicken teriyaki.

Ugh, can't believe I needed to add salt to every bite.  Avoid this place if you can help it."}
