{"text":"Nothing particularly bad, but not too great either.  The poor staff was running around trying to keep up so service was really slow.  Management should consider having one more server.

I'm almost embarrassed to say I tried the Sunday all-you-can-eat menu, something I never, ever do, preferring quality to quantity.  But what the heck.... it was exactly what I expected, with the exception of the teriyaki salmon which was actually quite fantastic."}
{"text":"I have to agree with some of the reviews here. The Sushi is sub-par. Tried it just recently for the first time and have no plans to return."}
{"text":"I ordered from Just-eat.ca
The food actually was good. 
But service was really bad. 
If i give 30 min to prepare, i had waited an hour for the food to be delivered.  i received them an hour and half min later from the time i placed an order. What the Just Eat. ca staff said \" i understand it 15 min late.. \" its not just 15 min. Estimated arrival time had once changed to 20 min late. And 30 min late again. Once driver saw me he started complaning me. He sounded like he came early but i didnt receive call and no one answered even if he knocked the front door and side door. Maybe he dialled once for short time and hung up before my phone rang. 
I was pretty upset but i just let him go without saing anything. I was going to pay more tip for driver but i didnt want to. Food was great but servie is bad. If the service is good, i would order from here next time again."}
{"text":"I got one of their \"special\" rolls - the tempura tuna roll. Extremely poor quality. I can't remember the last time I had such bad sushi, not even in the all you can eat Japanese buffet places. This is coming from someone who grew up in Toronto and eat sushi weekly.

Pictures other yelpers posted: decent amount of filling, not much rice. 
My tempura tuna roll: Ridiculously massive amount of surrounding rice, tiny barely visible tuna that is overcooked and completely tasteless. Tempura refers only to the batter around the roll. 

To summarize this \"special\" roll: take your most basic tuna sushi, add extra-extra rice, remove most of the tuna, increase the price.  

I haven't tried anything else from their restaurant, so maybe the other items on the menu are better. But I have no inclination to go back. Not worth my calories, even if it is free.

Service was friendly, though slow."}
{"text":"When this restaurants didn't pass the health inspection in February 2013, because it wasn't following the basic hygiene rules, we still kept patronizing it because we thought the food was good and so was the value.

But today the waitress really pushed my boundaries.  I am sorry, but bringing a tray full of someone else's dirty plates with leftovers and placing it on my table in front of me, while collecting my dirty dishes is absolutely unacceptable!

Someone needs to train the wait staff and explain to them that in Canada diners don't like seeing other people's leftovers and fish bones while they are eating.

It was disgusting.

Salmon sashimi was not fresh."}
{"text":"Bad food, bad service!
We got the all you can eat special and ordered a few different rolls and chicken/beef dishes. Not only did they not being all the food we ordered (I hear they do that often at all you can eat places) but the ones they brought were very low quality sushi. 
The chicken katsu didn't even look like it was meat. We had to keep asking them to bring the rest of our order. In the end they didn't even bring us the ice cream we'd ordered and we waited so long that we just gave up and decided to leave!"}
{"text":"One of the better Asian all you can eat menu I have found in Toronto, price is quite decent and you get unlimited Green tea as well although it seems a bit watered down.Service could do better, if you order 20 items from the all you can eat menu they will bring all the ordered food at once which to me does not make any sense as you have to shove all the food down quick so the rest does not get cold.  Even when asked to bring out food slowly there seems to be a language barrier most of the time between the waitresses.  Some other reviewers have questioned the freshness of the food but I don't think that is an issue.  Improve service and you will get 5 stars."}
{"text":"I'm surprised this place only has four stars. I really like it here! I find the service fast and friendly, the food good and the portions generous. This tends to be my go to sushi shop! Full disclosure though I am a vegetarian so I do only eat the vegetarian options ;)"}
{"text":"Can't think of a time this place has every disappointed me in either dine-in or take-out scenarios. Sushi rolls are generous, and always well executed. They never skimp on ginger and wasabi. 
Not the cheapest sushi house known to man but definitely worth it"}
{"text":"I've been a longtime regular customer of Sushi Gen for lunches, take out, party platters. It's one of several sushi joints in my neighbourhood.  As of today I am boycotting Sushi Gen.  Last night I ordered sushi delivery and when we sat down to eat the tuna and salmon rolls and sushi all smelled bad.  They tasted extremely fishy.  As a regular sushi eater I know this is not normal with salmon and tuna.  I called to complain. To my surprise there was no apology.  Just the opposite.  I was told the fish was fine.  When I asked for a refund I was told they couldn't credit me.  This despite the fact they had my credit card number on file.  The best they would do was offer me a credit for half the value of the order.  They would not apply the refund to my credit card.  I was told to remind them next time I ordered delivery.  I told them they should apologize and credit me for the entire order.  No dice.  I was angry enough to get in my car and take the food - which was mainly untouched - back to Sushi Gen.  They looked stunned when I walked into the restaurant with the order.  I gave it to the sushi chefs and invited them to eat it.  They stared at me in silence.  Still no apology and no offer of a refund.  Unbelievable.  I won't be back.  This morning I have the runs and a very upset stomach.  I will be advising the health department.  And I will share my story with all my neighbours and friends."}
{"text":"This is an decent lunch spot. They were nice enough to substitute the salmon for tuna on the premium bento box. It was very busy so the service was a bit slow."}
{"text":"Sushi Gen is my go-to for AYCE in the Yonge/St Clair area. For a little over $20 I feel like I get my money's worth: the fish ranges from good to great, depending on the day and type, and the selection on AYCE is fantastic. I love the seaweed salad, rainbow rolls, and sashimi. And when I order something new and wacky (e.g. the arctic roll), I am not disappointed. Friendly service, good sushi fix."}
{"text":"I live in the neighbourhood and I often go there to take out sushi. Take out sushi comes with miso soup and salad. It is nice. I usually order salmon and avoid rolls. I think it is cheaper than sushi in grocery stores. I have never eat inside, though. The service is usually good. When I am waiting for take out sushi, they give me a cup of tea. During the winter, they give me a hot cup tea. During the summer, they give me a cold glass of tea. It is nice."}
{"text":"Hit the sweet spots. Service was a bit slow but people are super friendly. Prices were excellent for lunch with decent portions. I ordered a chicken teriyaki that came with rice, miso soup, and veggies for $7.99. . My girl friend ordered yam tempura ($3.99 for big portion!) and vegetarian sushi. Woo! belt coming off. Definitely a filling meal! Haven't explored the other options but will come back another time to try them out!"}
{"text":"I consider this one of the better sushi establishments on the Yonge line.  Being so close to home we would frequent quite a bit.  There was a change in ownership and since then the service had declined immensely.  The food remains of quality although if it cannot be serviced they're will no longer be a neighbourhood sushi joint or gen to go to."}
{"text":"The quality of the sushi is OK, service is marginal, but the fact that they serve AYCE (all-you-can-eat) lunch at 3 P.M. is a bonus. Price is the usual price for AYCE.

Went to Sushi Gen for at least the 3rd time with m'lady last Sunday hoping to get AYCE although we thought we might've missed it as it was around 3 P.M. To our delight, we were told we could have AYCE.

The people that acted as our servers kept changing. One of the spilled water on my foot as he overfilled my cup. Another one spilled my soup as he was placing it on the table. At the end, I had to go to the counter to get my bill as no one seemed to be interested in bringing it to me, even though the female server had confirmed that we didn't want to order anything more.

The menu I must note is a tad skimpy. For the same price, the Queen St. location of Aji Sai has quite a bit more sushi to choose from (that is comparing AYCE lunch at Aji Sai on Queen St. to AYCE lunch at Sushi Gen). The did have a fair choice of flavours of ice cream for desert, however that was the only desert they offered.

The quality of some of the sushi was not the best (looked dried out and old). Most of the rest looked pretty good.

All-in-all, I'd return to the place, however it's far from my fav."}
{"text":"Decent sushi. Nothing to special but well worth the money. Got delivery and was quick and fast. Got a discount when I used justeat ."}
{"text":"Sushi is great but a bit inconsistent.  It's now called sushi gen and the new owners seem to have it together.

Dynamite roll is my fave.  And anything with that spicy mayo on it is good.

Great bang for the buck here."}
{"text":"If you are starving, you can choke down this food. It's meant for people on the run and it's really not awesome.

The fish didn't taste fresh or sweet and although the service was fast, it wasn't good food, period. The rice was hard which made me think they undercooked it (blasphemy!) and it was just 'okay' because I was starving and didn't want to hunt for another place to eat at."}
{"text":"This place is a nice sushi spot on Yonge/St Clair but I only go here if I'm really craving sushi and it's right in front of me because 

a) The customer service downright sucks. I've eaten in the restaurant and had take out and the service was horrible. 

b) The lunch menu is alright but the rolls are much tinier than the regular menu sushi rolls...as in significantly tinier. I wasn't sure if I had 6 pieces or 6 crumbs.

c) They seem to run out of crab often. ??

On the plus side...the rolls are fresh."}
{"text":"I work in the area and Sushi Gen is my favourite place for sushi at Yonge and St. Clair. However, today was a horrible experience. 

A group of 8 us made lunch reservations. The waitress took all our orders and quickly brought out our soup and salads . Everything was acceptable until it was time for our main meals. While all my friends got there meals quickly mines was no where in sight. After waiting for some time (by now the 7 other people are taking the last couple bites of their own meal)  the waitress notices me looking around and asked if I got my meal which I told her I didn't. she walks to the back and after a few minutes another worker comes out and tells me my order will be made right away and that it was accidentally given to another table! By the time the food came, everyone else was done and I had about 10minutes left in my lunch. I ate a few bites and had to leave.

I understand mistakes happen but providing me with an apology was not justifiable."}
{"text":"Service was great the sushi was not. It was not fresh and they use more filler than fish.
It was my first and last time there, honestly we were grossed out."}
{"text":"i work around the corner and come by for lunch every day - usually get my standard LS2 lunch special that comes out for less than $12 for twelve pieces of sushi. include the salad and miso soup that comes along with it and you're set for the entire day. although, i read signs that stated they're bumping up their prices so not sure how that's going to affect me giving them business."}
{"text":"Great place to go if I'm craving sushi. It's not a top sushi but it's tasty, cozy atmosphere and always take out when I'm passing by. All you can eat starts at 2 only, and doesn't have much variety but still makes me happy. Should include more sushi options at AYCE."}
{"text":"Review on the Run:

With all the sushi options in a 1 block radius (it's nutty how many there are!! 2 East of Yonge, 1 West of Yonge, 2 South of St. Clair, 2 North of St Clair, including Sushi Gen) this one doesn't cut it.

I deem these places fast food sushi.  It's cheap, but you really (and sometimes don't) get what you pay for.  Service was supremely slow, and the quality say compared to Ichi Ban or Daeco is miles apart.

Conculsion: Eat Here?  No."}
{"text":"AYCE is very good, lots of selection and they kept offering round after round, didn't disappear later in the meal which you do find at some establishments. Short ribs TDF"}
{"text":"Only sushi place in the immediate yonge/st clair area that offers all you can eat.  All-you-can-eat price is a little steep and I find that there is usually WAY more rice vs. fish.  Overall, the sushi is good and I have never had a bad experience - but I definitely think that there are better places in the city to go to."}
{"text":"This has been the worst sushi experience I have had so far. Came here for all you can eat sushi. Waited 30 minutes in between orders and they could not even get our orders right. The sushi was really poor quality and they don't seem to know how to count or what sushis were ordered. After waiting for so long for our orders and following up twice, our orders would come incomplete. The rolls hardly had any meat in them. It seemed all their rolls were just rice cucumbers and seaweed wrap with a touch of fish (maybe two out of 6 rolls had them). Towards the middle of our meal I just wanted to leave. It was sad really. I hope no one else has to come here."}
{"text":"This is a great place to come for AYCE lunch for $12.95 (on weekends ONLY). I have been coming here for over 2 years now and the quality and flavour is consistently top notch. 

The service is fast and the manager and waiters are all very attentive and friendly. The fish is always fresh and although I don't order much from the maki/sushi selection, the hand rolls are always good and the hot food is GREAT. The Miso is standard good, the salad is amazing everything you tick off in the order sheet will be delivered as a FULL order...no short changing or jipping on the portions here. They have a flavourful Udon, the terriyaki chicken/salmon is good, the Kalbi is delicious, as well as the grilled salmon belly.

I'm always stuffed and satisfied when walking out of here and its a solid go to spot at Yonge and St. Clair with a parking lot across the street."}
{"text":"Cheap, good value for the price when considering quality alone. However, for a la carte, the quality of the sushi is below normal.

3 rolls, miso soup and garden salad for $12.95 is competitive and one of many combos they offer. However, I found to be the rolls to be small and management very unyielding in substitutions without paying an extra $1. The restaurant is true to its roots and has large pieces of cucumber in its california roll, which is most definitely a disappointment when you're eating and paying for it a la carte, and I'm not convinced that this is made up sufficiently by the cheaper price... 

No AYCE on weekdays at lunch, despite the deceptive \"Japanese Buffet\" in their window, though they'd be happy to charge you AYCE dinner prices (and offer you AYCE dinner) if you'd like.

Service is good and they often came by to see if I needed water or any further assistance. I noted that they also speak Cantonese and Mandarin."}
{"text":"I come here all the time. Some times I'll order through Just Eat app.
Amazing quality & price for the AYCE.
I love sushi, but I mainly find average quality for this price. Sushi Gen is really good. The price for quality, incredible! The service is hit and miss (last night it was a miss, non attentive servers). However, My biggest problem is every time I order the ice cream they serve it with plastic spoons. WHY??? Plastic spoons for in house orders? It's bad for the environment, and it's tacky!
Other then that, I give the quality of food two thumbs up!

Updated: Came back again (this time for lunch) because they have excellent sushi, however the service was the worst it's ever been. The server put the miso soup & salad on the other end of the table (I'm by myself) and then when she brought the sushi, dropped the plate in front me and said \"here\". It'd be funny if it weren't so rude. I've dropped the rating from 4 stars to 3, due to the terrible service I'm now consistently receiving. Hoping they improve because their sushi is really good."}
{"text":"So, I was planning to go to the Harvey's across the street for lunch, as they are dependable and that location is really well-run (will write a positive review of them later, as they really deserve it). But I went to Sushi Gen for lunch with a co-worker about a year ago and, while the wait was verrrrrry long, I remembered the karaage (chicken nuggets) were especially good (I also had the katsudon, which must have been unremarkable as I don't remember it at all). 

So, I decided to check it out again, this time with a different co-worker. She is very picky about food and (ultimately, wisely) decided not to get anything here. I ordered the lunch special to go. When the guy asked me if I wanted chicken, pork, or fish, I asked him which he recommended. He smirked and said something like, \"I can't really say. I don't eat here\". Okay. Yes, I know, I should have hightailed it at that. But my lunch hour was already half over and, honestly, how bad could it be? 

I found out shortly. After a mysteriously short wait, the guy called out my order. My co-worker later was wondering exactly where the food (I went with the chicken) was prepared, as the guy just pulled it up in a bag from under the counter. I said, \"Thank you!\" and the guy literally rolled his eyes. My co-worker and I burst out laughing as soon as we got out the door. \"What was that about?\". The staff gave off a vibe like they REALLY did not want to be there, so I guess they have issues. 

So, I get back to the office and crack these containers open. The chicken was good last time, so I'm looking forward to the chicken cutlet. Uh oh - it's not looking good, people. The alleged \"salad\" is two green pieces of lettuce, one white one, two cucumber slices, and approximately seven small slices of carrots. If it was revealed to me that this was someone else's plate scrapings, I would feel happy - if only in that my suspicions were vindicated. 

Onto the main course. The chicken (I hope it was chicken) cutlet was unpleasantly fatty. The breading was not put on properly and immediately detached itself from the meat. I don't blame it. This was inedible. 

It's hard to screw up white rice, but the master chefs at Sushi Gen are nothing if not unique: this stuff was as tasteless as a Trump tweet and as cold as my heart after wasting my hard-earned cash on this disappointment. 

This non-meal was topped off by the surprise. Lurking underneath the meat was a bed of rancid Chinese noodles. Again, this is a Japanese restaurant. I lived in Japan for six years and have never seen these noodles served in a Japanese restaurant. But, sure, this is Canada, so a lot of \"Japanese\" places are Korean or Chinese-run. That's cool. And I don't expect anywhere the quality of Japanese food in Canada (maybe in Vancouver, but not in T.O.). Finally, Toronto is all about \"fusion\", so no problem on the cross-cultural deal. But, again, these noodles were ROTTEN. I confirmed with my co-worker, who recoiled at the stench. 

The miso soup, likely from a package, was fine. I threw the entire rest of the Sushi Gen \"lunch special\" in the trash, where it belongs. 

Yes, this is a lengthy review. However, those who took the time to read it will be rewarded by not wasting their money & time on the off-putting offerings, served up by sneering staff at this establishment. Disregard at your peril!"}
{"text":"This kind of place exists to accommodate quick lunch orders and large office party crowds - not to regale you with it's unique take on sushi or some astounding standard of authenticity. It succeeds in its purpose: serviceably-good food and good service."}
{"text":"At Sushi Gen you get good value for your money. They have excellent lunch specials on beef/chicken/salmon teriyaki, udons and makis. If you're in the area and happen to crave Japanese food, do pay Sushi Gen a visit. I think you won't regret."}
{"text":"Awesome place for AYCE LUNCH.  I wouldn't go for dinner because its not worth the price, but for lunch its only $13.  Its right across the street from my apartment which is why I frequent it so often.  It is not amazing sushi, but it is GOOD.  Lots of sushi options as well as appetizers and hot dishes. Very friendly service."}
{"text":"Competent but less-than-creative lunch specials, but was playing all Tom Jones for lunch. That goes a long way."}
{"text":"AYCE here is very good.  LOTS of choices and the food is made well. Sushi rolls on the AYCE are small and don't have too much rice -- which is exactly as it should be for AYCE, very good!  I've been here several times and I always notice many people from surrounding businesses grabbing takeout on their breaks and other customers seem to be regulars, which is a really good sign. Service is friendly and accommodating.  The only odd thing is the beef teriyaki comes as a pile of shredded beef, which isn't like most other places.

And free wifi!"}
