{"text":"By far the best place in the ne. They have a good selection of sushi roll and entree. But the thing to try is their sushi pizza best in Calgary and made right. The staff are very friendly and they make you feel welcomed each time. Never a disappointment."}
{"text":"Very delicious but too small rolls ... Won't be full after $54.00 expensive ! Not sure if I will return ... We were there for the Wednesday date night so I'm not sure if the weekend service will be any better .."}
{"text":"Good quality fish, value and great service. Has become a routine lunch spot.  Good bento box lunch special and love the cones. Small and starting to get busy. Worth a go."}
{"text":"My go to sushi spot in Calgary! This hidden gem never fails to disappoint. The sushi rolls are always fresh and tasty. The service is always up to par! My favorite is the spicy salmon sushi roll. Can't wait to try more!"}
{"text":"I went here for dinner with my son and it was ok. I feel for quality versus price there is way better. I might try the bento box for lunch one day. I will drive further for better."}
{"text":"This is THE best sushi place I have been to in Calgary. I've been to 5-6 other sushi places in the NW and this is by far the best one. The fish is always fresh and the rolls are well made and delicious. There is a very large selection in the menu and everything I have tasted is delicious and fresh. The presentation of the food is beautiful and artistic. The staff is super friendly and service is great each time I've been there. It's a small hole in the wall but worth the trip to the NE."}
{"text":"AMAZING!!!! I will never go to another sushi place in NE Calgary ever again! Their Sushi Pizza is a must, crunchy rice and seaweed patty with tuna and salmon on top drizzled with a sweet spicy sauce! We also recommend the Lion Roll, Unagi Paradise and of course the classic California Roll! Great price point also!"}
{"text":"THE BEST sushi spot in Calgary! The \"Sushi Pizza\" is to die for! Great service!"}
{"text":"Should have known as we drove into the lot...\"hidden gem\" as per some of the yelp and google reviews?  Not really. Once seated inside our spidey senses were tingling due to the decor and general feel of the restaurant.   The menus should have given it away.  A bit rag tag looking.  Plus recognizing quickly that this was likely not a Japanese run sushi place did not bode well. Still we pushed on and ordered a la carte sushi.  Very subpar quality sushi plus the prep by the sushi \"chefs\" obviously need them to have some refresher courses on how to prepare and present fresh and tasty sushi.  Smallish sizes and squished firmly together in a very robotic looking sense.  The rice was not balanced for moistness nor seasoned with vinegar correctly.  And the quality of the fish was from lower grade sushi fish. Waitress also did not inform correctly about ingredients as the allergies detected the eggs in the gyozas.  After we asked again the waitress admitted she didn't know what was in the ingredients as they were made offsite.  All she knew was that they were purchased \"from a Vietnamese place\" she later informed us.  If you don't know then you should tell us so in the first place?  Wait till they get someone who has an anaphylactic reaction. Don't believe the great google reviews.  On closer scrutiny of some of the reviewers and their other reviews, it sure seemed suspiciously like planted or paid reviews.  The yelp reviews seemed to over rate this place also so not sure I believe they're authentic reviews. Beware."}
{"text":"These guys took over this restaurant from Sushi Chopsticks a few months ago and I have been meaning to try them out for some time.  The decor appears to be exactly the same as before.  The menu is changed from Chopsticks.  We were there for lunch so we really didn't look too deep into the menu... but it seems like they have the standard things in any sushi restaurants.  I ended up ordering the bento box.  I thought it was a little pricey at $12.95 for what you get.  The fish on top of the sushi was cut thin... something that I expect from a $9 bento box, not a $13 one, so I was a bit disappointed about that.  Overall the food was acceptable, but not exceptional... service was good.   However, I probably will come back for a quick sushi fix, as there is a lack of sushi restaurants in the area."}
{"text":"Ok.  If that was insane good.  Not only was the sushi pizza da bomb, so was was out server, Vila.  The kitchen served us well.  Don't think about eating here...eat here.  Smaller room...maybe 40 seats but super delish.   Thanks Vila"}
{"text":"I wanted to treat my family to a delicious sushi dinner, but had no idea where to go in north east Calgary. I decided on Sushi Toki based on its location and the almost 100% 5 star reviews on yelp. I was not disappointed. We were greeted promptly by a friendly server who explained the menu to us, since it was our first time. We started with Gyoza and assorted Tempura. The gyoza we savoury and hot. There was a generous amount of tempura which included four large prawns and a variety of veg, such as sweet potato.   For the main course, my daughter enjoyed the Teriyaki beef. It was a huge portion of Kobe style beef with onions and mushrooms. We shared four rolls: the Fire Dragon, spicy California roll, regular California roll and the Calorie roll. These were delicious and fresh.  Check out my photo of the sushi and you'll see what I mean.   Do yourself a favour and check out Sushi Toki. I will definitely be going back."}
{"text":"Just tried this place out and picked out out as it was closed to another place we wanted to go but it was closed. We tried 4 specials rolls, all amazing, super fresh, some sashimi also amazing and to cap it off this deep fried banana dessert that my boyfriend even loved and he doesn't like banana with other stuff usually. I would real recommend it, we found it pretty affordable and good service."}
{"text":"Sushi is extremely fresh and their special sushi pieces were delicious! Had sushi with mango crab and rice and it was surprisingly a great pair! Had the fried banana for dessert and it was pretty damn amazing, you get to choose a scoop of ice cream (went for the black sesame yum) and each piece of fried banana was sprinkled with sugary goodness! If I lived in the area this definitely would be my go to sushi spot! Great fresh food and great service!"}
{"text":"This is bar none the best sushi place! I have not tried a lot on the menu but what I did try was fantastic!! Tempura California roll, beef yakisoba! And to finish deep died bananas with black sesame ice cream. And the service is awesome, friendly respectful young men cooking and serving!!"}
{"text":"Great service. Great food. Would come again and again. Sushi pizza a must. Very fresh and fast. Sapporo cold!!"}
{"text":"Finally found another sushi place close to home after my beloved Aji closed down!  This place rocks! The sushi is fresh and they have unique and traditional rolls. Their Sushi Pizza was a hit! We ordered an extra one, for science, to see if the crunchiness would last the drive home as we order takeout a lot...it did and was quickly devoured. The Rock and Roll was pretty spectacular as well.  The prices are perfect here. Most sushi places around me are quite expensive for subpar, rice heavy rolls.   This will be our new regular place for sushi!"}
{"text":"In my opinion, this place has the best sushi in town!  I love that they have a \"special\" roll almost every week.  They are friendly and the sushi creations are fresh and tasty.  My favourite place!  I only wish they opened another location in the NW."}
{"text":"If you're looking for a quick sushi fix this is your place. They have a menu full of delicious choices and it's a quaint restaurant. Everyone that works there is super nice and I come back every week."}
{"text":"Seriously led astray by the glowing reviews.  I realize we're in cow country, but calling this place even average is a compliment.  My only sushi experience in Calgary so far, but if this is what is considered good here, I'm sticking to land-based fare.  We started with a few apps, including the \"deep fried octopus.\"  These were definitely just squid tentacles...rubbery, overcooked squid tentacles with a \"we're not so fresh\" flavor.  Three of us got the sashimi combo...supposedly 15 pieces, but maybe 3oz of fish total...smoked salmon, shrimp, yellowtail, octopus, & mackerel.  Chirashi actually looks like a better play here...slightly less variety but appeared to be a better portion.  Even the green tea tasted watered down.   What actually does look pretty solid here are the rolls, based on what I saw coming out on plates.  Certainly much better looking than the sushi / sashimi.  We didn't get any rolls so I can't comment other than looks, so if you end up here, try that.  It's also pretty cheap, so if you're sushi-on-a-budget, maybe that'll work for you too.  Just didn't do it for any of us."}
{"text":"Had a great time in here. The food is fresh and great, and we are impressed by the special sushi and sushi pizza. The service is good!!! I will be back Sushi Toki for sure and i highly recommend it.."}
{"text":"Little hole in the wall but the service and food was incredible!! Done hesitate. Delish!"}
