{"text":"Super Maki Set B used to be a delivery staple in my house, until one time when we received some very poorly cut salmon and my hubs was immediately turned off.  However when I'm in the area I still stop in for the spicy tuna roll every once in awhile. It is fantastic and the place is really well priced. I think the salmon \"incident\" was a fluke and I would definitely return and recommend it to those in the area looking for a sushi fix. The delivery is also very well priced and their Maki Sets are great value, comes with green salad and miso soup! Also if you're over a certain amount they'll send a free California roll.   Nomnom"}
{"text":"I always hit Susha Xtra up when I'm at Queen & Spadina... Since I don't usually feel like eating burgers. The bento box are great deals for the portion and options.  The sprint combo is perfect for me which includes; chicken teriyaki, white rice, veggie tempura, beef gyzo, salad, miso soup, Samon & cucumber maki for an economical & $9. It's great for getting a beautiful delicious variety. Totally worth a try."}
{"text":"Doesn't honor coupon. \"Special menu with markup prices\""}
{"text":"There is nothing extra about Sushi Xtra. Infact, its easily classifiable as your average run of the mill sushi place with many variants of dynamite, dragon and spider rolls.  I ordered the most exciting thing on the menu: a fire dragon roll with hamachi. Sounded sooo damn cool. Little did I know my roll was going to be blow torched, literally, to produce the 'fire' resulting in a slightly burnt rice taste with every bite. Not to worry, the yummy seaweed salad made up for it.   The portions are generous where the service is not at all.  With Aji Sai on its left and Hosu on its right, I cant see any reason to come back here."}
{"text":"This place has been my go-to for incredibly cheap sushi for years now. While the quality of the food isn't as great as something you would get at a nicer restaurant, the portions and pricing make up for it.   I always order a bento box and the amount of food you can get for less than $10 is obscene. I'm never able to finish it, and it always comes out fresh and steaming. The sushi is good, the service is decent and the drinks are cheap. As far as sushi goes on that part of queen street, it's probably one of the best places for your money."}
{"text":"Excellent selection and convenient location. Food was served a little slow (25 min) but decent quality."}
{"text":"On Saturdays and Sundays between 12-4pm they have half price sushi. Love this place, always tasty and always friendly service."}
{"text":"I love this place, they have the best maki in the city. I came here specifically from Leslieville today and was thrilled to see they now have half price sushi on the weekends from noon till four pm.  They are super fast and friendly, and the food really fresh. Ive been coming here for years now and have yet to find another sushi shop on the city that comes close."}
{"text":"Itadaki-masu!  The type of comfort food I love involves a hot bowl of rice and a hearty piece of protein (preferably grilled or fried) -- like Chicken Teriyaki.  Sushi Xtra has one tasty Chicken Teriyaki.  Chicken is juicy, moist and wonderfully caramelized.  It has good balance of color and smoky flavor that I look for.  Their sushi is not bad either, especially Dragon Rolls and Spider Rolls.  Shrimp tempura and soft shell crab are always crispy.  Friendly service, always a delightful experience.  An extra plus:  Reasonably priced.  Gochiso-sama deshita!"}
{"text":"We were strolling Queen West and decided to stop in for lunch.  It was a Saturday so they had this 50% off promo - the catch... a) You have to order a minimum of 20$ (reg. price) worth of food, PER PERSON, to be eligible for the discount b) if you arrive with a small child - they will make you spent 20$ (reg. price) worth of food for that child as well (3 years old....)  We complained and they let us order off the regular menu, which ended up causing even ore problems in the end.  Service was horrible, absolutely horrible.  I never expect good service at most sushi places to be honest but this was sub par even for a place like this.  The waitress did not speak much english, she got our order wrong, and then when we told her she took all of the food away that we had already started to eat and took it back to the sushi counter so they could fix it - and asked \"did you touch any of it\".... She then came back to the table 3 times to double, triple and quadruple check what it was we ordered in the first place (RED dragon roll...)  They took so long that we said forget it we don't want the food, bring us the bill for the rest (what the kids ate) and call it a day.  All of a sudden she arrives at the table with the plate of food that had  a corrected order (20 minutes after mentioning it was wrong) - we told her we did not want the order as we had told her and to take it back - she faught with us.  She then returned AGAIN, but this time with the original plate of food, with the roll that was wrong removed - we absolutely did not want that plate back, it had been taken back to the kitchen and we have no idea if it was even our plate to begin with.  So she left and returned AGAIN with that plate (one roll missing) - again we told her we don't want it, to bring the bill and take it back.  She argued the whole time.  When they finally brought the bill it was all the wrong prices - each item was charged between 2-3$ higher than menu price.  After complaining to a different employee we got this sorted out after 15 minutes of waiting.  The food we did get was not very good, the restaurant is excessively overpriced for almost all items!  Service was absolutely horrendous and in the end they claimed \"it's been so busy we made a mistake\"  even though the restaurant was nearly empty until we were getting ready to leave.  We were there for 1hr 20m - got 2 sushi rolls and a green salad which we didn't think was going to show up, an additional 3 sushi rolls were delivered wrong, taken back and then cancelled.  I can guarantee we will never return or recommend this restaurant to anyone.  If you want sushi in the area walk a few blocks East on the south side of Queen and stop in at Sushi Time!"}
{"text":"Some of the fish tasted funny, so quality wasn't amazing. Customer service and price were both decent.  M'lady and I decided to try this sushi joint that I've been meaning to try for a while, as we were in the neighborhood. I got a chirashi (my favorite sushi/sashimi combo dish), and m'lady got some tempura.  The meal came within a reasonable amount of time (about 10 mins as promised), and the price that I likely to gauge sushi venues with (average of $1 per piece) was definitely less at the very least for my chirashi meal. All the meals came with soup & salad.  A number of the piece of fish in my chirashi tasted very similar to the smell of fish that were just caught and removed from a lake. An odd taste that I've never experienced while having sushi, which I did not find overly appealing. M'lady complained about having symptoms of food poisoning after her meal. Also while the rest of the pieces of ginger tasted fine, my last piece of ginger had a very strange taste.  So all-in-all based on my experience with the quality of food at this venue, I wouldn't likely return there again."}
{"text":"Sushi is alright but service is terrible. We had a rotten vegetable in one of the rolls and instead of apologizing, the waiter yanked our dish  , tossed out the roll that was bad, and then slammed the dish back on the table. Had terrible service all throughout that I've actually never experienced at a restaurant before . It's a cheap spot but not a place I would recommend .A lot of great and affordable sushi in Toronto that you should try before this place"}
{"text":"This place never lets my boyfriend and I down! We love it so much we order from here weekly. My favourite part about this place is they deliver late on weekends!"}
{"text":"There was a live ant in my sushi. A LIVE ANT. Mistakes happen, I get it. But then they refused me a refund. Wait, what?  So they pass me to the owner. I speak to him, and he also refuses me a refund because I didn't keep the sushi with the LIVE INSECT embedded in it. First, there's no way I'm putting that in my car, and second, why would you want me to bring a live insect back into your restaurant? He tells me that he's been in business for 10 years, which isn't really an argument, because there's still a live insect in my sushi.   Then he hangs up on me. No goodbye, no nothing. He just says \"I can't help you\" and hangs up."}
{"text":"So this place was super convenient at a time when I was feeling really hungry and during a month when I have been craving sushi like all the time! WTF I usually crave super junk food all the time.  This place is a decent size, the seating is good with some nice booth seats at the rear.  I went on a Sunday so was a nice surprise to find out that it was a 50% dealio so bam ordered a variety of stuff and we left happy customers.  It was not the best sushi I have had and the menu was not the best but for 50% cheaper sushi it is still a decent place to pop into. Wish they did that with the alcohol too."}
{"text":"I've been frequenting this place for years, and I must give it the golden \"best cheap sushi\" award. In my books... The Fire Dragon rolls and the teriyaki salmon are my faves."}
{"text":"This place have a half price deal every weekday & weekend (happy hour from M-F 6pm-9pm & Sat & Sun - 12pm - 4pm) but place was still pretty empty.  They have a special half price menu  Food was okay - got the tempura app, Sashmini app and 2 rolls of Shibuya & Black dragon doll.  The half price deal is weird cause it is calculated for every $20 so it was odd.  They didn't tell you beforehand and when I got the bill it wasn't really 50% off as we didn't order $40 to get $20 off.  To make the best of this deal try to get orders of $20 each haha.  Overall, the fish was pretty fresh and the rolls are done correctly without too much rice on it.  Service was very good as the girl came over 5-6 times to fill up our tea and asked us if everything was okay."}
{"text":"Sushi Xtra has delicious food, quicks service and half price happy \"hours\" (12 - 3) on weekends. There are lots of sushi places to choose from on this stretch of Queen West but nothing beats the price on weekends during happy hour. Definately my favourite place for sushi lunch in the city."}
{"text":"One of my fav budget maki places. $40 bucks gets two people stuffed with two appetizers and 2-3 maki rolls. Fish has always been very marbly, fresh and just the right temperature. Rice is great, not too hard, not too mushy, not too sticky. Nori is not chewy, doesnt interfere with favor nor texture.  I have been back about 15 times by now and havent had a bad experience yet."}
{"text":"Been coming here for a few years, with overall decent experiences.  Today, one of my coworkers was served a deep-fried cockroach, in addition to his dumplings. As bad as that was, the staff's reaction was even worse. Upon alerting the waitress to the situation, she simply took the tray (and item in question) away, and brought back replacement dumplings... in what seemed to be the same tray. No further comments, nor apparent concern.  Full bill charged.  As Yelp says, \"Eek! Methinks not\"."}
{"text":"I like this environment. Very friendly staff. One one my favourite sushi is the fired dragon roll. It's taste is very different. I think the price is fair here. Big portion of food such as salmon curry rich and salmon sashimi."}
{"text":"Ordered sushi pizza and extra salmon sushi combo.  Food came quickly and the quality of the salmon in the sashimi was very good.   Food quality was good, portions reasonable, and prices are reasonable.  Good place to come for a quick meal."}
{"text":"\"Sushi happy hour where everything is half off? Hmm okay, let's try it.\"  The minimum amount you need to order is $20; you pay $10 since it's half off. Not bad. Smart idea. And you can get very full from your choices. I got the Godzilla Roll, tuna maki, and tamago sushi.  But the taste is okay. It's not bad, but it's not superb either. The Godzilla Roll, for example, was different than what I expected. When I think of Godzilla, I'm thinking big and fiery, so I thought this roll would be big and decorated with spicy sauce of some sort. They got the size right, but no sign of the sauce; just a single squeeze of mayo across the roll. And the tuna maki rolls weren't very consistent; some pieces had more rice than the other. Tamago was alright, but it didn't taste as soft and sweet.  My wasabi had a weird chili flake...not sure what that was about. And the ginger slices had a piece of seaweed on it.   Service is kind of brisk and not so friendly. They don't seem to enjoy working here.   It's very average and if you want a quick fix for sushi (and get full), I think this is a place to go. But I'm sure there are better sushi places around."}
{"text":"Worst place to go never get your order right. Rude and hangs up on you. ... Don't recommend this place for anyone !!!"}
{"text":"Walking around Queen St. West with my friend, was getting hungry and tired. We walked into Sushi Xtra looking for our roll fix. We got seated in the booth all the way on the back, I like the high seating, so your not playing awkward staring game with the people in the next booth.   Portions were really good, tasted fresh! Bill was $38 something not including tip. Pretty fast service, got our food within 10 mins.   Friend ordered, calamari and dynamite roll, dynamite tasted the same as always but the calamari was really good here, just wished they didn't give us Diana sauce with it, I would've preferred something else lol   I ordered the vegetable spring rolls ( nothing special, taste the same in most restaurants) and got the fire dragon roll as well.  It was really presented really nicely and even better when it tasted as good as it looked. I uploaded a photo of this artistic roll :p   Good place to dine for quick lunch break and cool off too, they blast the A/C here, also come before 4pm to get a spot and do their lunch special!"}
{"text":"This sushi place is our spot. My boyfriend and I come here pretty often (maybe once a weekend?). They have happy hour 1/2 price sushi on the weekends. They have a delicious torched salmon roll (fire dragon roll) that is our favourite roll we always get. We come here so often that we have our menu memorized and the waitress knows us. Love this sushi place. It's nice and has a nice atomesphere. Perfect for little dates or for quick bites."}
{"text":"Everyone who ate sushi from this place had food poisoning. Never going back.  For Japanese cuisine, freshness of sushi and sashimi is most important matter especially in summer time, but this place has horrible and terrible condition of raw fish. If you care about your own lives. Dont go."}
{"text":"Oh boy has this place changed.  I used to go here often with co-workers 2 years back for lunch as they served great sushi overall.  I went here last night and had the weirdest pieces ever.  I got the 3-maki combo which came with spicy tuna, spicy salmon and dynamic (not dynamite) roll.  Essentially, their tempura was like a week old because it was cold and very hard to bite into.  The miso soup served before the meal was also lukewarm and everything about the place I remember changed a lot.  The sushi definitely did not seem fresh at all as I was eating it with just mushy feel on the sashimi in the rolls and hard pieces of tempura mixing in an unpleasant taste.  We went for dinner and noticed that a lot of tables were empty - perhaps it was a sign.  I hope this place changes back to quality food."}
{"text":"Great place. The management and the menu changed few years ago and it's been fantastic ever since. There's a  happy hour on weekends when you can order $20 worth of food and pay just $10. Their special rolls are great and pretty much everything is tasty. Waitresses are friendly and service is really fast. This is not fine dining, but delicious comfort sushi instead. For that purpose this place is just great."}
{"text":"After an afternoon of checking out the shops along Queen West, we decided to check this place out after walking by it earlier in the day.    Let's be honest, the 1/2 price sushi from 12-4pm was the initial draw and since my friend an I love gorgeing on sushi, this place was like manna for us.  First impression?  Ok decor, clean and tables filled with patrons (always a good sign).  The menu pretty good, lots of options.   We ordered quite a few dishes, 6 in total.  The sushi was ok, and there was plenty of it.  For $20 we ate to our hearts' content.  I quite enjoyed the spicy tuna roll, but everything else was average, and whle the sushi was CHEAP, it's important to remember that you get what you pay for.  While we sat there eating our food, I couldn't help but think that the fish wasn't as fresh as it could have been, and that the serving sizes though adequate, could have been larger.  The service was just ok.  Would I return, probably, but not on a regular basis."}
{"text":"These guys serve up some amazing sushi.  No joke.  Very high quality stuff!  Their maki combo sets often include 3 different orders of sushi (that's 24 sushi!  Give or take...) and range in price from $10-$15.  I highly recommend the maki set 'E.'  Some people may think to themselves that for $15, they can get an All You Can Eat sushi deal at several other restaurants.  But think about it.  Are you really doing anything other than hurting yourself by eating more than 24 sushi?  24 is a lot.  24 is enough.  The only bad thing about this place is the service.  While they were very attentive and on the ball when we first got there and ordered, after that they sort of disappeared.  When we finished and finally flagged someone down for a bill, they brought it to us, and took our credit card.  Unfortunately, after waiting over 10 minutes for them to return our card (and not getting it back) we had to flag someone down and ask them to bring us our card and piece of paper to sign.  So, service is not their strong point."}
{"text":"Notable Tip: Free California Roll on delivery orders over $25 (which means delivery is also free too!)  As M P. mentioned, when you order delivery it takes it's time (about 45 minutes) and seems as though they've been made far in advance! We ordered the Party tray A and most of the fish were really slimy and mushy as if they've been left out for a few hours.  But there's nothing really special about this place, the prices are okay and the food is meh. Nothing to get worked up about, the standard sushi place (of which I'm finding there are far too many of in Toronto!)"}
{"text":"Do NOT eat here. The food made me violently ill. I should have known it was a red flag when I saw employees sleeping in the booths in the back of the restaurant, very unprofessional... But the price was right. Anyways I was poisoned for 24 hrs. Muscle pains. Cold sweats. Heavy vomiting and diarrhea. I can only imagine the other poor patrons who were eating there probably all got sick too."}
{"text":"I don't know if you noticed, but I was born an Asian - specifically Korean - which has a lot of similarities to Japanese culture, and one of them, is our love of raw seafood.  I have had a good share of seafood - live and dead - in various places and I am quick to promote really great spots. Why?because they are hard to find (And there are so many now) and they really deserve praise (because I'm a very picky food lover).  I am even quicker to spread the word about the bad spots (because there are so many and nobody is so rich that they throw away hard earned $ for crap, when just down the street you can get wonderful noms for around the same price).  This spot was the first one my friend and I spotted - and we were so eager to sit and catch up, that we didn't give it much thought that there was only a handful of Asian people inside(a quick lesson: if you're at an Asian food place and there is no Asian beside the waitstaff - that's not where you should eat. ALWAYS eat where there is Asian guests in it, we know our food).   I walked in and I was pleasantly surprised that its pretty nice inside, though grungy outside - said to myself, \"this is gonna be awesome.\" The service was good - i thought in the beginning. She brought us drinks, and the food was rather quick to come. Of course, there was much food left over - and my friend and I had to take a breather. I SWEAR TO EVERYTHING HOLY, in span of 1 minute all 5 waitstaff on duty asked us if they can clear the table. They didn't once check if everything was good during the meal(which was fine), it started to feel like they were not particularly interested in anything but about turning the table (meaning, get people in , serve and out they go so they can serve more people). If she offered to pack my food to go, I think I would have said yes. Of course, this could be a sign of service excellence -everyone is concerned about making your experience great - but they should maybe have approached it with some time lapse and different manner.  Now the food. I think I may be biased - but this is not fresh fish they service here - I know this, because I've had sashimi in Japan and in Toronto as well - for not much more than I paid here ($20); but moreover, because at times it felt like I was biting to a thawed meat. You know that feeling, when you bite in - it's mushy outside but inside is crunched up ice? THAT one - it was not quite thaw. Another sign that it's not really fresh - your tummy feels sick. As I mentioned, not only am I born Asian, but in a culture where eating raw fish is not - weird. Our body is more accepting to it - and the fact that it's sitting in my tummy and causing it to ache (and really makes me want to gag) after 5+ hours is not a good sign to me. For what I got, it's way too expensive. I DON'T DO PAIN FROM FOOD.  So.  If you want big sizes for cheap - here you go - Asian version of Mcdonald's;  It's just one of many sushi places that just doesn't appreciate the art, but is capitalizing on the trend. If you want at least a decent plate of fish, Aji Sai is just down the street - it even has an all your can eat menu , and its filled with Asians. All the time."}
{"text":"Everything was pretty good and fresh.  However, the Salmon was waaaaay off.  My girlfriend and I barely touched it, which was no good.  Everything else was great, but I just couldn't get over the Salmon."}
{"text":"Craved for Japanese food while working a night shift.  It was 10:50pm on a Tuesday night and they close at 11pm.  I thought we should give them a call anyways to test our luck and see if they will deliver.  LO AND BEHOLD, they said they going to deliver.   We ordered four different sets: 1) summer combo: salmon teriyaki, gyoza, shrimp tempura,3pcs salmon maki and 3pcs kappa maki, rice $9.95  2) super maki set F: Salmon & Avocado roll, Dynamic Roll, California Roll $12.95 3) super maki set B: Spicy salmon roll, Spicy tuna roll, Dynamite roll $12.95 4) Handroll set: tuna, hamachi, salmon, California hand roll $8.95 - total of 4 miso soup and 4 salad Total: a bit over $50  Overall, the sushi pieces were okay, nothing special.  The handrolls were filled with a lot of rice and lacked fillings. Eg, there was only tuna and onions in the tuna handroll filled with a lot of rice.  The miso soup tasted a bit off- sour.  The salad dressing wasn't that great - too liquidy.    I didn't like the fact that they only provided four chopsticks.  I guess they provided one for each set we ordered.  There was more than four of us that shared all these food, so unfortunately, we had to end up finding extra utensils.   I'll give them 4 stars just for their delivery services."}
{"text":"Quick lunch here and I ordered the chicken kastu lunch special. Service was fast and attentive with a prompt glass of water and miso soup to follow. My food came shortly after. The lunch special consists of fried tofu, chicken cutlet and rice. Not bad for a meal under $8.00."}
{"text":"I only come here during the weekend happy hours. I always get seaweeed salad (slimy and tasty!) and two rolls... costs around $10 bucks after the discount. Unfortunately, miso soup is not part of the happy hour. My friends get there fire rolls (they torch the tops, so there's that burnt taste).   Downside: Service is inconsistent!"}
{"text":"They lost me as a customer and I have never even been there once.  And to add to that I will make sure anyone that I know does not go there.  The bait-and-switch scam they pulled off with Red Flags Deal of the Day will only come back to haunt them!  And rather than realizing this and dropping their \"special menu\" and honoring the deal as expected with their regular menu they gave me the option of \"coming in and getting my $15 back\".  So basically I will need to make a trip to a restaurant (which will cost me) in order to get money I got scammed out of back.  I can't believe how badly some people can screw their own business over."}
{"text":"DO NOT ORDER FROM THIS PLACE. The delivery guy is pathetic!!!!! I called the restaurant and placed an order for delivery and the guy on the phone insisted I pay cash. So I went out of my way to walk to the bank.... I wish I didn't bother. The delivery man came and it was $18 and I only had 20's on me.... He called me a stupid **** and yelled all the way down my hall. Totally inappropriate dude. Can't believe the kind of stuff that people do!!!!!! He's lucky he even got a $2 tip. Disgusted"}
{"text":"Everything here was fine except the food.   The portion on the bento was big but the food was just off.   The tempura was too greasy and some portions of the rice for the shrimp teriyaki was dried up.  The shrimps was not \"crushy\" and tasted funny.  It was hard to pin point the problem - perhaps the ingredients were not fresh?    I did not finish my food and walked out the restaurant not feeling well physically.  I'll not go back again."}
{"text":"My good friends had recommended this place a while back and I've been here at least 5 times now. They have happy hour on all sushi for half the price on Sat & Sun from 12-4pm (spending a minimum of $20 per person from the menu and paying half at the end). My favorite orders are definitely hands down the torched fire salmon dragon roll that is topped of with this amazing sauce and the enobi rolls (mushrooms rolled with beef & teriyaki sauce). The rolls are so deliciously amazing....and I've never had this roll anywhere else in my life.   This place is in the best location possible on queen street for a quick bite before or after some intense shopping therapy. The deal is so amazing that I recommend this place all the time to any of my friends. It is also accessible through the Queen street car and/or the Spadina streetcar."}
{"text":"For cheap and reliably 'well-it-didn't-blow-my-mind-but-it-filled-me-up' sushi, this is the place! Their super maki sets are super filling and are a great choice for pick up or delivery. The extra bonus is their pickup only takes about 10-15mins to be made.  The service is... a bit indifferent. It's certainly not the warm and fuzziest of places. And it's usually almost empty when I head in, but since it's been around for over 5 years I assume its busy period is lunch.   The quality of the sushi is a bit tastless and rice heavy, but it's super filling! If you're looking for a date spot, keep heading west and visit Tone. But if you want a money conscience sushi/maki place to hit up (especially at lunch), this place will deliver."}
{"text":"If theres a way to rank this restaurant 0 stars, I would give them 0 instead of 1.  If you eat here, you will get food poison and die.  I used to eat here often, but the quality of the food has gone down, and recently pulled off a scam by offering a special menu with doubled prices for people who purchased a 1/2 price coupon online!   I am NEVER going back here again, not even for happy hour 1/2 price!"}
{"text":"HORRIBLE, HORRIBLE  SERVICE.  I have gone to this place atleast 1-2 times a month and today my friend ordered 2 lunches they gave the WRONG thing which was her error but when she tried to correct it by getting them to just add to the order they misunderstood and gave us  the wrong order again. We told them it was wrong and they wouldnt help correct the problem.  THere ENGLISH is completely horrendous, for lunch they made us pay $50 .  And said it was our fault.  I WILL NEVER be going there again.  God for bid you try and fix a misduplicated thing.  THey should not work in Toronto if They cant speak basic english.  You would think they would have better customer service."}
{"text":"I ordered the Take combo. It literally had all of my favourite items in it and it was the perfect amount of food for a reasonable price.   I would definitely come back. Not the best sushi I've ever had but perfect for what you may for. Really enjoyed it"}
{"text":"So back again. The spicy tuna has returned to its former glory!!!  My review in October complained about it being mushy."}
{"text":"Food quality is quite barfy here, but the draw is 50% OFF the entire menu if you go on Saturday or Sunday between 12-4pm. You can pig out for $10. Portion sizes were good for most items.  However:  -Fish not very fresh -Ikayaki (grilled squid) was overcooked and chewy -Seafood salad was kind of gross  Service was not bad, average decor, lots of tables and the place was packed.  Basically, only eat here if you are going for the cheap happy hour. Otherwise, go somewhere with better food!"}
{"text":"Loved the half price deal before 4pm! Sushi is good but you get what you pay for here. I've had worst so this is a good place if you want a quick sushi fix."}
{"text":"BEWARE THE SALMON SASHIMI! I have been going here for years and generally speaking I have enjoyed their awesome \"Salmon Lover\" sashimi platter but my last few visits had me gagging. The sashimi was not fresh... it had that dreaded \"fishy taste\" non sushi eaters fear .  I have never has such terrible sashimi in my life and for $16 I expected something better. I have never had issues with any other food here but my love for sashimi has forced me to scale down some stars and maybe look for another sushi place to love."}
{"text":"This is the first time i order delivery from this place, i ordered chef's selection Tray A, i was disappointed! i am a big sushi lover and this is the first and last time i order from this place! The pieces had a lot of rice in them and not very fresh... i didn't eat it all & ended up throwing the sushi i ordered... what a waste of money!"}
{"text":"The food was alright but the customer service was completely awful. I went with my friend while it was half priced and you needed to spend $20 to get 50% off, but once we ordered they told us we couldn't share and couldn't get the deal. Completely rude and unexpected."}
{"text":"Sushi lunches in fair Toronto are high on my list of favourite meals anywhere ever. So cheap, so plentiful, and the competition is so real that everyone has to keep it fresh.   I met up with my baby for a quick lunch near his office, and though there were many sushi options, we chose here because, well, it was the first one we saw and neither of has eaten all day. No one wants loving lunches to turn hangry, so we popped on in.   I had a $14.95 maki set. It was incredibly plentiful and fresh, but about double what I'm used to paying at similar establishments at lunch. My server was also a total crank bucket, which obviously I didn't appreciate.   I'll return, but only in a pinch."}
{"text":"We placed an order on Saturday to have the food delivered to our door on Sunday, for Mother's Day. They got here on time, but I suspect the food was made hours beforehand so the sushis and sashimis were not as fresh as they should be, and the tempuras were mushy by the time the food arrived.  Best thing though is if your order is $25+, delivery is free. They even throw in a Cali roll on the house. Good deal, huh?!?"}
{"text":"Good prices, you get a lot of food for what you order. The rolls are decent but tempura is kinda meh. Miso soup was not hot enough. No A/C so be ready to order something cold. Would go again though, good value. And apparently on the weekends, they do half price sushi as long as each person orders at least $20 of food."}
