{"text":"I went for a quick lunch, grabbed a plastic container and paid $17 for a small container and a bottle of water. This usually costs $10 in a mall...and I will get at least a smile from the employee.

The quality was terrible, it wasn't fresh, the wasabe was enough for 2 slices and the ginger was white and dry. (I should have taken a picture... unbelievable)

Not only I was badly impressed with the food but the service was really bad for an empty restaurant. I was the only client and had to wait 2 minutes at the counter before one of the 2 employees stopped what they were doing. 

There was no napkins offered or on the display. 

I will not return to this or any other store of the franchise. The Worst sushi shop ever..."}
{"text":"First time going here & my last. Not setup like any sushi place I've been to before, looks like the McDonalds of sushi.  Place was pretty empty, only 3 other customers & no one bothered to talk to us for more than 5 minutes, finally someone asked if we needed help. Then we said we would like to order, they said we couldn't eat it inside. If they would have greeted us right away and told us they were closing soon, we could have left right away instead of wasting our time. Go here for bad service & probably low quality sushi.
Go to Yuzu instead, a much better place!!!"}
{"text":"This doesn't qualify as sushi.  I ordered some specialty rolls and some regular rolls.  All tasteless.  McDonald's tastes better than this."}
{"text":"This review based on their Ramen only.  

First time walk-in on a whim seeing the 'now serving ramen' sign.  Broth was better than some but definitely not dedicated ramen house. 

Had the seafood ramen. Egg was boiled well done  (usually semi-runny at a ramen house), thin slice of salmon was disappointing considering they could have cut larger).

Noodles had some 'chew' to them but nothing special. 

The tempura shrimp was not bad, very tasty but batter a bit thicker than I like.

I think this place is more of a takeout place for weekday dinners. 

Did not try but the sushi selection and variety is very good. If you come here, go for the sushi. If you want ramen, go elsewhere."}
{"text":"I usually like so much Sushi Shop but this one is awefull! I dirty and people somnot friendly! Dont go there!"}
{"text":"I've been coming here for a few years now and am constantly impressed with the sushi here! It's the best quick takeout sushi spot I've found in the downtown core for a quick lunch or picking up dinner on your way home. 

Really fresh (great quality ingredients) and well priced. I always order the custom rolls which are made fresh on the spot. The Salmon Kamikaze roll is really good and comes with the best soy sauce (it's slightly sweeter). The location is small but very clean and the staff are always super friendly!"}
{"text":"Trotting around my work-hood, looking for a new place for lunch. I had seen Sushi Shop during their construction, but promptly forgot them as there are oodles of sushi shops in the Bloor/Yonge area. But I was right there so in I went...

While I liked the miso soup (with tofu and greens) it was pricey at $2.50 a cup.  I was disappointed by my express box of spicy tuna, Cali roll and salmon/cream cheese. Maybe I should have done a custom order at the lunch bar, but I was in a hurry, and it was the most appealing of the boxes on offer. 

Their house soy sauce comes in a nifty container but it tasted really sweet to me. Kind of like terriyaki sauce and not pure soy. It was too sweet for me to dip my sushi in.

I really wanted to like this place (hooray for female sushi chefs!), but when I can get better at Longo's for less, or fresher and tastier at Asahi, why would I go back?"}
{"text":"Amazing service. Newly renovated. Great prices and unlike the other franchises they don't skimp on the fish. Also very kid friendly."}
{"text":"Nice people at the cash but compared to other sushi shops they add more rice and tempura and skimp on the fish."}
{"text":"While this is a nice fresh location with friendly staff, it suffers from the same problems as almost any other quick (pre-made) sushi place I've been to: watery miso soup, tasteless fish, and pretty high prices. I spent about $14.50 for a small combo (2 sushi, 10 pieces of maki), green tea, miso soup, and Pocky. 

The one piece of salmon was fresh enough and of a decent size but really had little flavour. The hamachi was a little better, but was strangely firm without the usual buttery-ness I expect.

To be fair, the soup did have some nice seaweed and green onions in it, but without a broth with flavour, it fell flat.

Maybe I went overboard on the Pocky."}
{"text":"Good sushi. Very interesting combinations.Terrible, terrible service. We were there on weekend with a couple of our friends. We had to wait for a simple combos for 40+ minutes. By the end of the period the place was empty. 3 guys were working behind the counter... And still it was slow. Plus they made a mistake in my order. And also forgot to serve one of items, but charged for it. Add zero attention to customers (after all they did not even come to ask if all good, if we need a check, or at least to apologize for the mess).  Sushi places are not missing... Will pick another one next time."}
{"text":"Sushi Shop is by far one of the best Japanese stores I have been to. So far, I have been to this location and the one at Yonge-Eglinton. There are no designated customer sitting areas but the important thing is the fresh, high quality sushi! The rolls are always packed with ingredients and tastes so much better than you would have imagined. The presentation is just exquisite. 

Their menu consists of traditional sushi you would see at other restaurants and interesting fusion type sushi. The choices are endless with new items being introduced on a regular basis. They have a large selection of delicious rolls for vegetarians and anyone who does not like raw seafood. I love that they incorporated different types of vegetables and sauces into their rolls. It gives the sushi an 'edge'. The combinations in the fusion type sushi complement each other very well. For example, the Sunburst is served in rectangular pieces and even though it includes lemon and orange masago, it is light and balances out the flavour of the smoked salmon. I have to note that the soy sauce, a light sweet taste, is found in a circular container which is more sanitary and convenient than the take-out packages you normally find. I recommended this place to my friends and they absolutely loved the food too.

If you are on a rush, they have a selection of combos ready for you to grab on the go. If you are trying this place for the first time, do not try the Red Tiger roll. I found it too salty for my taste and I do not wish to taint this remarkable place. Needless to say, I will be returning to try the Sirocco and Calypso."}
{"text":"Wow.. This is what McD's of the sushi world would be. Expensive, crapy quality, and more cucumber in the roll than fish!!"}
{"text":"Staff was very pleasant and helpful.   Order was taken promptly with a smile.  Food came fast and presentation was fantastic. ...best Sushi I've had in a while.   Thanks to the staff,  I will see you again."}
{"text":"Same as previous reviewer, this place is clean, very fresh, and affordable.  Seriously, if you get take out from here and get take out from a restaurant, I think you can't tell the different.  So why pay more at restaurant?

Staff are very friendly.  Call me cheapskate, but I always compare price and thickness of the fish you get.  And this place well deserve my 4 stars."}
{"text":"had lunch here with coworkers. we were able to eat within our hour long lunch break, the sushi was made freshly and was tasty :) will plan to return here again. 

tip: order the lunch special if you want a selection of items for a reasonable price"}
{"text":"I've had the sushi from here a couple times now, and I have to say it's VERY good. For a sushi place in Union station, this place probably has the most fresh ingredients I have ever had in sushi. This being said, as a vegetarian, the options are quite limited. There's only one veggie lunch/dinner (depending on the time of day) combo, and there's nothing special like yam tempura or spicy rolls for vegetarians. The rolls that ARE in the combo (usually mixed veggie and avocado) are really fresh and tasty, but plain. 

The service here is alright, it IS a fast-food type store after all. The first time I ate from here they had run out of napkins which was a bit silly, but otherwise I haven't had any problems.

Finally, I find it to be a bit pricey, as you are only getting sushi in the combos (no salad or soup or anything), but only a bit above average. You have to pay $0.50 for spicy mayo on the side which is a bit annoying, considering spicy mayo really doesn't cost that much (and everywhere else I go, they give it to me on the side for FREE), but I'll deal with it.

Overall, the sushi is very fresh and convenient. Variety is good for those who eat fish, and price is slightly too high."}
{"text":"I can't lie; I'm just not a fan of take-out sushi joints. The quality of sushi in general is just a lot different on the east coast from the west coast, which just makes the whole ordeal even more touch-and-go. But there's something different about this particular Sushi Shop, at least. 

Nestled in the side of a Cafe Depot, it seems almost superfluous, with a giant (I mean, really, really big) vent air conditioner drying out the air and smothering the atmosphere with a continuous hum. Maybe it's to keep the rice formable? 

As with many other Sushi Shops, I'm sure, their menu is broken down into either individual orders (my west-coast senses shout at such pricing!) and combo sets (where deals are had and lunch is eaten.) But you can fresh-order combos, and perhaps that's where my feelings go from suspicion to enjoyment. 

The staff, if nothing else, seem to really focus on making the sushi. Each set shows attention in labor, precisely packed with individual \"tray soy sauce\" containers. You can pretty much eat from the bag without any of the usual \"where do I dip\" hassle. Flavours are well done and many of the specialty rolls actually taste like there is a reason why they cost so much. (Sushi Shop should not be confused with cheap - a set is in the $10 neighbourhood, but you're probably not going to survive on trying to order something much cheaper than that.)

In this wild-east frontier of sushi, experienced sushi connoisseurs can more or less tell if they should return after a single visit. Usually it's due to a bland flavour here, a missing menu option there...well, I can tell we'll return. Maybe that says it all."}
{"text":"This is your typical mall fair sushi.  Nothing overly outstanding.  But, if you're in a hurry and need to satisfy that sushi itch, then this place will be perfect. It's a good amount of sushi for the price, too."}
{"text":"Wow, This place can roll these babies out, in lunch rush hours.. This lady (girl) can make them \"faster then a speeding bullet\", what out supergirl, lol..
watching her make and run a crew is very entertaining while waiting for you sushi.  The menu will blow your mind on so many selections and in great details of whats in the sushi. they have soup, drinks and a place to sit in back or like a bar area. tje staff is friendly and patient when your ordering. They serve them in nice plates if dine in..  

The price are very reasonable..

Ever in Toronto again, this will be my 1st stop.."}
{"text":"What the hell is sumomaki?  I'd never heard of it but soon learned through a quick Google search that it's a large roll (hence the name; cute but gross) with cream cheese and spicy mayo (even jalapeno, apparently, at some other places).  Barf.  If that's not nauseating enough, you should check out the \"sushi desserts,\" which we found too terrifying to mock.

Starving and desperate, we tried to order the most normal-sounding items on the menu.  Thank the lord, mine had to be freshly prepared and was acceptable, as long as I could shut the other stuff out of my mind.  My parents, poor souls, had to eat refrigerated sushi that had been made who knows when.  Tasted like cardboard.  I don't know what got into us, but we even took some back to the hotel for my brother-in-law, who must have thought my sister was leaving him.

I'm all about innovation, evolution, and pushing boundaries.  But these ridiculous concoctions are criminal.  Just leave my sushi alone!!"}
{"text":"Not an expert when it comes to sushi but this place is cozy for a quick dinner. the menu has every combination of sushi you can imagine. The portions are quite big or reasonable sized for what you pay. I'd recommend this place to my friends."}
{"text":"Not worth your time.
I didn't have high expectations going into this place the first time, but I didn't realize the sushi would be that bad. I tried two dishes here, the spicy salmon poké bowl and one of their pre packaged sushi combos.
The Salmon Poké : bland and didn't mix too well; looked fresh but it didn't taste like anything. The salmon had no taste, and despite the vegetables looking fresh, it didn't combine well to make a bowl. It would have tasted better individually, but even then the salmon's taste was off putting.
The Spicy Sushi combo : please don't get their pre packaged sushis. For me it tasted at least a week old. The salmon did not taste like salmon but something that was rotting. I was surprised I didn't get food poisoning for eating that stuff.

This place gives off the vibe that it would actually sell fresh sushi, but please don't be fooled like I was. Their sushi quality is one of the lowest I've ever experienced."}
{"text":"MASSIVE RIP-OFF!!!! 32 dollars for a tiny box of sushi that wouldn't have fed two people. It's a crappy cheap sushi chain restaurant. Which I wouldn't have minded if they were actually affordable. Don't waste your time and money. Oh, and they're only open till 6."}
{"text":"Being there number 1 customer in Montreal I decided to stop by at this sushi shop location. As soon as I walked in no one greeted me or wanted to take my order until I said \"can I order\".  I made a simple order took about 20 minutes for my sushi to prepare and on top of that there was some fish crumbs on a couple of my sushi rolls. I am strictly vegetarian and don't eat fish so this to me is super disappointing. It's sad to see them losing a customer."}
{"text":"My Favorite Sushi by far , I love the spicy salmon roll & the chicken roll. the food is constantly fresh and delicious.  Most time the line up is huge for lunch so call in your order ahead of time. Also it is expensive"}
{"text":"Why oh why does Sushi Shop have weak wasabi? I know its really just glorified horseradish with some food colouring tossed in, but really. Come on. We want the heat! Why give us something that more closely resembles play dough :( 

Maybe I should start bringing my own tube of wasabi to leave in the fridge at work for when I order sushi. Its tasty and always fresh, but Im always disappointed with their wasabi."}
{"text":"Just finished our first take out order from this location and we were not impressed. We tried an assortment of rolls, sashimi, salads and sushi pizza. Everything looked great but was completely lacking in flavor. The sashimi was minutes from being off, but what really killed it was the packaged crab and frozen salad shrimps used in the seafood Fuji bowl. Considering the price of our meal ... we expected much more. We will take our Friday night sushi dinner elsewhere from now on."}
{"text":"Love this sushi shop, super friendly and helpful staff...the sushi is always fresh and delicious"}
{"text":"I really liked this sushi, very creative- try the large rolls. True, it's western style sushi ( lots of rice, little bit of fish) and dining in is not much atmosphere. But as take out was great. On the pricier end, but you really only need two rolls to be full, so 15 dollars and you are good."}
{"text":"Came here for the first time while visiting Montréal. Stopped by to get a quick bite to hold us over until dinner. The staff was friendly and the burrito was made in less than 5 minutes. It was delicious, fresh and rolled well. Definitely recommend trying this place out. Could use some music in the place though. Kinda quiet in there."}
{"text":"This place has great lunch menus and I just ordered a box of 75 pieces for my birthday and everybody loved it! I definitely recommend it for a lunch or take-away option. It's always fresh and good quality."}
{"text":"I come here a lot, I live near by. My usual appearance comes after work or if I work from home then I come by after the lunch rush. This looks like a fast food sushi spot but it's actually some of the freshest, choicest sushi in the city. For that reason it isn't as fast as it might appear to be. There are to-go options if you are in a rush. I've also struck up some very pleasant conversation with the owner of the place who is always there. The sushi is large, flavourful, and always fresh. Also, and this is a chain thing, it is the best soy sauce around. If you live in the area, stop by!"}
{"text":"I've been going to Sushi Shop since they opened. I was so glad they came to the neighbourhood! The staff is super friendly. They even know me now when I call in my order.

The sushi is fresh, and they have a ton of neat kinds. I also love the brown rice option, which is surprisingly not mushy and very tasty. The seaweed salad is really good too.

For a quick sushi option in the neighbourhood, this is the place!"}
{"text":"Disappointed! 

normally their rolls are ok but not smoked salmon and salmon tartare.

overpriced to start with, and then picture of the smoked salmon and salmon tartare on the menu is different from the actual item. picture provided where the top is from the menu and bottom is the actual item you get."}
{"text":"The process is pretty simple.  Mark your selection on the menu and hand it to the cashier.  They bring the food to your table. 

The portions were large and the flavor was good.  The fish wasn't too cold with that frozen texture you sometimes encounter. 

The only tip I have for them is to place a sign to let you know where to order."}
{"text":"Been craving for a Poke Bowl for some time now and tonight, my friend and I managed to try this place out. We had literally just wolfed down some street meat outside of the building and were walking back towards ACC for the Adele concert when the picture of the Poke Bowl caught my attention. After a few minutes of cursing ourselves for eating some very overpriced lame street meat, we decided to split a bowl. 

We had the Salmon & Tuna Poke Bowl which was absolutely delicious. The salmon and tuna were both very fresh and the avocado, was so buttery. The bowl was about $13 and was pretty reasonably priced given the freshness of the diced sashimi and the serving size. It also came with a side of miso soup which was also pretty good. I loved it so much that I would even make the trek downtown to try out the rest of their menu items. If they had later hours, I probably would've gone back after the concert to try other things. 5/5"}
{"text":"This is the 2nd Sushi Shop location I've hit since the beginning of the month and I'm still very impressed.  This time around, I ordered the same Salmon and Tuna Poke Bowl to-go I had the first time, but will save that for tomorrow. The service at this particular location was different from the one by the ACC.  As my friend had pointed out, though they were on point with prepping our food, there was that lack of communication.  Our orders came, but we were never informed.  Mind you, the place was near closing so there weren't many customers that they didn't have the time to just say or even bring our orders.  There was however, a kind young gentleman who brought us one of our orders to our counter.  He probably noticed that we had to get up to get our other orders.  Other than the lack of communication, they were still quite nice.

Lobster Tacos - I love love love the Asian flare tacos where the shells are made of fried wonton, so I got pretty excited when I first saw their tacos on their menu.  The shells are of course not very big but the amount of lobster was generous for its size.  Lobster already doesn't have much flavour and even with all their fixings, the lobster was still a little bit on the bland side.  But if you can handle some heat, the jalapeño slice complimented it very well.  4/5.

Tuna Tacos - I'm really loving their tuna here.  Very fresh!  I preferred their tuna tacos over the lobster tacos for sure. It had more flavour, even the bites without the jalapeño slice.  I've been looking for the best tuna taco out here in the GTA and these may very well be the best ones.  Still doesn't beat the ones I had out in B.C. at the Beach House but pretty close. 5/5. 

Black Mamba - Our new foodie goal is to try pretty much everything on their menu so this was one of the maki rolls we tried and I personally enjoyed it very much.  Because it had some shrimp tempura in it, it was nice and warm, so very different to many other maki rolls.  I do wish it had more spicy mayo on it though, or at least on the side.  Still, it was very enjoyable. 5/5."}
{"text":"We're really picky coming from the west coast.

What was really weird was that it didn't taste like sushi. Instead of sushi, it tasted more like a... rice and fish product. We tried a number of the rolls and the pressed sushi. Of the bunch, the best ones we had were exotic and smoky. Tuna tartare had too much panko (almost half). Tofu pocket was okay.  The wakame lacked flavour and was too dry though. The sushi pizza, you could see that it was deep fried, but it just didn't taste deep fried at all, plus the rice was way too dense. Finally, we tried the dessert sushi, but it's wrapped in rice paper, salad roll style, which is... just not that good. We would not recommend it (and the flavours didn't mix all that well).

Not a place we'd return to."}
{"text":"Sushi-on-the-go!

This is a great spot for people who want a quick sushi fix on their lunch break.

It's a sushi fast food joint, so it's basic and not very fancy.
It takes less than 5 minutes to grab some pre-made sushi and run.
They have a fair selection of rolls including ones made with brown rice.
The service is quick and the staff is friendly.
A few days ago, they revised their menu and it looks great!

I tried their new item Hako, which is pretty fun!
$6.25 - $7.55 for 6 rolls that look like... little party sandwiches.
Flat sushi in layers, salmon, shrimp, mango, avocado, spicy light mayo, tempura.  I'm a fan!

The sushi here may not be mind-blowing, but it's fresh and decent for the price."}
{"text":"I love love love Sushi Shop! Do not mistake this for a fast-food sushi place where all you'll find is stale sushi made ahead & placed in fridges. Although you will find that (not stale though), and it's pretty good, if you have time for a proper sit-down meal, you will be pleasantly surprised to find some of the better sushi in the city. 

Here are my favourites:
- 911
- Sweetheart 
- Philly
- Saumon épicé
- Inferno
- Smoky

(All of that costs about $50 tax-in). 

This sushi is seriously GREAT. 

I have but one complaint about the restaurant, and that is that it's sub-zero in there. And I mean like, arctic-cold. Year round. In summer, I have to bring a sweatshirt. And in winter, nothing will do. Tonight I had to wear my jacket, a huge scarf around my head and neck, and leather mitts (not the easiest to eat with chopsticks but kudos to me, I did it!).  They actually have air conditioning going all year round. A constant cold blast of air coming from the vents, which you can't avoid no matter where you sit. I truly don't get it. 

Speaking of sitting, they have some cute little tables with comfy couches and arm chairs to sit in... There are only a handful of tables in the place, but never more than 1-2 tables are occupied when I've been here. I think a lot of people do take-out. 

Anyway, dress for the North Pole and head over to this sushi shop and you'll walk away cold on the surface but warm on the inside from having had some seriously tasty eats."}
{"text":"I feel like this place has gotten worse and worse. I used to go there sometimes for lunch and even though the food is overpriced it was decent enough quality. Last time I went I paid $17 after tax for a combo and the rolls were terrible. Even with the lack of good sushi options in the Path I'll skip this one next time."}
{"text":"The place has a beautiful menu that has a picture for every sushi. Very tempting. 

I have been trying various sushi spots to find one great place where I don't have to spend $100 but still get good sushi. Somehow that hasn't been going well, and Sushi Shop has been added to that list. I had high expectations after reading the reviews but it really wasn't that good.

The sushi rolls were below average, I had the sirocco (the best from all), dragon and smokey. All of which were pretty dry tasting. I also had the shrimp tempura and the coating was too thick (not light and crispy).

Don't think I'll be spending $30 here again."}
{"text":"I have nothing against this place, my review is something against this whole Sushi Shop chain.

I understand that innovation is the key to success, but Sushi Shop has gone way too far.

Now before you imagine me screaming BLASPHEMY at every item they have on the menu, allow me to explain.

Sushi with cream cheese? Wait what?

Sushi with BROWN RICE? I mean, sure you want your food to be healthy and all, but brown rice is NOT the ingredient used in sushi. The texture is weird, the taste is bad, and the sushi rolls had no consistency at all. It's like replacing the spaghetti pasta with rice noodle in an Italian dish, it makes no sense whatsoever.

Not to mention their nigiri sushi is so wrongly prepared, that the fish fell off from the rice base instead of sticking to it like it should.

Fail."}
{"text":"Great location, this particular sushi shop happens to be across the street from my work and makes it my go to sushi lunch spot. 

The building also hold a Thai express in it and the location is very clean and well kept. 

All sushi is made fresh to order or daily there are combos made. I particularly love their poke bowls and I recommend them to anyone."}
{"text":"The food is amazing even the basic avocado rolls! Super fresh ingredients. Tacos are bomb. Service is efficient and super duper friendly."}
{"text":"Best sushi ever and always fresh and well made

Lots too choose from and they always come up with new things to add to their menu

Love the fact that they have different size platter for parties or gatherings

If you want anything off the menu best thing is to call ahead of time and like that its ready when you get there and you don't wait.

Nothing bad to say about this location but would be awesome if they delivered.

They take cash, credit card and debit as well"}
{"text":"Oui, pas mal! Si on veut manger rapidement des sushis, c'est la place qu'il faut. Etant donné que c'est une chaine, on en retrouve un peu partout dans Montréal. Ce ne sont pas des sushis de haute gamme, mais le gout y est assez raffiné. 
Le service rapide permet de ne pas perdre son temps à attendre la confection des fameux sushis.
ça change des fast-food traditionnel."}
{"text":"Grabbed some take out on the way home (on a weeknight at 7pm) and was absolutely shocked how good it is for take out sushi! How can it be fresh at this time of day?! 

$14.95 for a combo that comes with free miss soup: 6 piece jumbo roll of shrimp avocado crab tobiko, another 6 pieces of avocado roll and 4 pieces of nigiri. 

Everything was fresh and delicious. The jumbo roll was really flavourful. Shocked that the avocado was so ripe and good quality that what I thought was a crappy filler roll was actually delicious. All the raw fish on the sashimi was good too. 

To top things off service was very friendly and chirpy from the cashier! I can't believe they have such poor reviews. What a great experience."}
{"text":"Honnetement : un sushi shop c'est un sushi shop. A celui sur l'ile des soeurs j'ai toujours eu des produits frais et prepares pour moi. Comme a tous les autres, ils offrent le comptoir pour emporter.  Ils ont aussi cette petite section ou ils vendent des produits pour preparer les sushis chez soi. 

Mais la 4e etoile revient a la terrasse exterieure qui m'a permis de diner dehors et de profiter du beau temps avec mon amoureux. 

Ne vous deplacez pas pour y aller,  mais si vous vous y trouvez et cherchez un lunch rapide vous serez servis :)"}
{"text":"A good place for a quick fix for sushi! It gets super busy and popular during lunch time. However, it's far from authentic... Though I am sure authenticity isn't the point.

A colleague treated me to lunch today, and we decided to go here. I took one of their premade sashimi combos, while he grabbed one of the premade nigiri and roll combos. They offer spicy miso soup too, and apparently it's just normal miso soup flavoured with sriracha.

My sashimi combo was of a decent size, but also quite pricey at $17 ($15 for the actual meal, and I believe there was an extra cost for the soup, though I could be mistaken). It consisted of three avocado rolls, three cucumber rolls, and roughly 8 pieces of generous salmon sashimi slabs on top of a bed of julienned cucumbers and adorned with two pieces of pickled radishes, and two cut pieces of artificial crab. My meal also came with a tiny container of wakame or seaweed salad, which is absolutely my fav.

A couple things to note right off the bat:

1. The soy sauce is SWEET. I am positive that they added some sort of honey sauce to it. The sweetness isn't as prominent when you're dipped rolls or anything with rice into it, but when I put my plain sashimi inside, it became very obvious. It wasn't a flavour I enjoyed, as it didn't feel like I was eating sashimi.

2. The wasabi isn't spicy at all. I typically don't add a lot of wasabi to my food, but it was completely bland.

3. Most of my maki rolls came with less filling than expected, and was often squished - but that's to be expected!

Overall, I was fairly pleased with the portion size (loooved the generous slabs of salmon sashimi) though I was very thrown off by the sweet soy sauce and non spicy wasabi. It didn't feel like sushi as a result :("}
{"text":"Great sushi!!! After the maple leafs game last night, I was lured by the buy-one-get-one free deal. I ended up with 16 pieces of maki roll sushi for $12! How amazing is that? 

The servers are friendly and like conversation, even at 10pm. Sushi was fresh and delicious. Big sized rolls, super awesome!! :)"}
{"text":"Convenient location especially if you are in a rush and looking for sushi takeout. The quality was average."}
{"text":"The service at this shop is extremely slow, you easily wait 10 to 15 minutes for your order, busy or not busy. 

Sushi Shop is very strong on good looking presentation but it doesn't give them anything if their product isn't good. The sushi are okay, I could name other places were the sushis are delicious, this place isn't the case. 

I order a poke bowl from this location and the salmon wasn't fresh. Every time I eat here, I don't feel good after. After today, I won't be going back to Sushi Shop, I gave them more then enough chances. So many great places to try in Montreal, if I were you I would skip this choice."}
{"text":"Always a great experience and the staff are very friendly. The sushi is fresh and I like this particular store better than a lot of other well established sushi joints in the city. Highly recommended and try one of their lunch boxes today for a quick meal!"}
{"text":"Average Sushi Shop. Generally everything is pretty fresh. Take out lunch combos are a pretty good deal between $7-12. Nothing fancy and not what you would call \"authentic\" but reasonable for a quick lunch."}
{"text":"This sushi shop opened not to long ago and it's been busy ever since. I lunch order there almost every second week and I go pick it up since they don't have delivery. They are fast and the sushi always tastes amazing! I would definitely recommend the combos at lunch, they are cheap and delicious! And if you're in a rush, it's best to call in advance with your order, that what I always do! :)"}
{"text":"They will put your food in micro-wave for whatever you order that's meant to be warm.

Their poke bowls are poorly made and the over do it with the soya - which ruins your meal.

I've tried this place 3-4 times and it just gets worst."}
{"text":"A very nice and clean sushi shop. The sushi is always fresh and made well. Their pre made sushi in the fridge is always fully stocked. Combo F is my favourite.The service is always friendly and they are pretty quick on the made to order. I eat at this location a lot and only one time the avocado was so hard I couldn't eat it but they made me new rolls right away with no questions asked. Out of all the sushi shops in the West Island this one is my favourite."}
{"text":"Very watered-down soy sauce and very very thin slices of salmon - as thin as paper. You can barely tell there's fish on your rice."}
{"text":"Went there last Sunday, about 2pm, with my kids.  Restaurant was virtually empty...only one other couple seated when we arrived.  We ordered and when the food arrived, we asked for two extra plates (as they had placed our two orders of sushi on one plate).  We were told that they \"did not\" have extra plates.  Really???? What restaurant says that, especially when there were only about 6 people in the restaurant at the time.  When they reluctantly gave us a very small bowl, rather than a plate, it was NOT clean!   When I asked AGAIN for a plate (this time making it clear that 4 people should not be expected to use one plate) they reluctantly gave me one extra plate....after my third time asking.

Furthermore, the washroom also really needed cleaning.  I would avoid this place."}
{"text":"Passed by this shop walking down Old Montreal. The really high quality pictures caught my eye and I wanted to know what sushi tacos were. The pictures of their food is beautiful, inside if the shop is very clean. We got the tuna and the salmon Taco and at the price of around $7.5, I would expect a good portion. NOPE. These tacos were about the height of three small fingers with very little fish. Utterly flabbergasted that I was duped by the pictures. Not worth it at all. 

As for taste, they're pretty good. But I wouldn't go back nor bring friends here to try it. Simply because the novelty didn't meet expectations and price was not worth it. 

At least I can say I had sushi tacos."}
{"text":"I got food poisoning from their sushi today. Started feeling nauseous within an hour after eating their food. Had to leave work and go home. Ended up throwing up and did not recover until evening time. I think the health and food safety org needs to do an inspection here. Something is very wrong. Will definitely avoid."}
{"text":"I used to go to Sushi Shop a lot in Montreal as it was a quick way to get sushi without waiting too long or having a full sit down meal.  For a person on the go, it's a nice substitute for your typical fast food such as burgers, pitas or generally anything around the bloor/church area.  This location is a good spot as there isn't too much around that is priced this well.

The staff are friendly and the service is quick.  I haven't really waited too long to cash out, even during peak hours such as lunch.  There are sometimes spots to sit down, but it's really much easier to get your food to go here and be on your way.

I would compare the sushi to that of Loblaws around the old Maple Leaf Gardens.  It's relatively fresh and not as bad as the stuff from No Frils or T&T.  I keep coming back if I'm in a rush or craving some sushi."}
{"text":"Came here last week to try to use a coupon for black dragon rolls. Was given the run around that it was close to closing and that it would take 25 minutes to make my order (which wasn't particularly large). I'll rerate when I get some food/ can use that coupon."}
{"text":"The salmon/tuna poke bowl was fantastic but a bit on the small side and lacking enough fish considering the price. The Magik seared salmon roll was also quite good. The salmon sushi burrito tasted kind of plain though. Regardless, I found all of the items to be very fresh with high quality ingredients. The establishment itself was minimalist and clean. 
Overall I found the prices to be slightly on the higher side considering the portion sizes, hence my 4 star rating. Otherwise, worth a shot."}
{"text":"The poke bowl i got had barely anything. I was given brown rice instead of white and it was undercooked. It was sadness on a plate for my order....for almost $15 it wasnt a good value for me at all."}
{"text":"For the price of $14, I expected at least 4 Star and at worst 3 Star ......I ordered the today special salmon poke bowl. Not sure if I missed the fine details, it was quite spicy! I'm okay at taking heat by surprise, but it was the salt level that i could not handle.  The presentation was lovely and ingredients itself is fresh and nice - salmon, avocado, tempura crumbs and lettuce on a bed of brown rice.  I think it must've been one of the sauce, that was sooo salty and unbearable. I almost couldn't finish it, but for $14.....I had to somehow get it down! Not a great first time experience, not sure if I'd go back. I tried the Yoi place next booth a number of times and have all been happy with it, so I think I'll go back to Yoi next time ..."}
{"text":"How good is your day when it starts or ends with Sushi

This is closer to a 3.5 stars. Nothing mind blowing, but solid

It's so close to everything, especially the Park and the Mountain.

The prices become decent with coupons, but I almost gave up since nobody could understand my order over the phone. But it still cost me $35 just to be full.

The food at all Sushi Shops seems to taste the same, whey you don't wannna rock the boat in terms of going out."}
{"text":"Who knew that such decent sushi could be had at Union? I arrived at Union a little bit early, and decided to quench my thirst and tickle my belly. I have always wanted to try this place but never got around to it until a few weeks ago. And there is my disclaimer; if the Sushi shop has somehow changed management, or they're using floor scraps or something, this review is pretty solid and current. I had a lobster maki roll and a limonade. The lady at the counter recommended it, saying it was very good.  Let me tell you, I've been dreaming about that roll ever since. I looked online to find the recipe to make it at home, I've searched every avenue to discover this recipe!  I'm just going to have to find myself at union on a regular basis, in order to buy this roll. It comes with a delicious sauce you dip this lobster roll (wrapped in lettuce, with all kinds of flavorings inside). It is literally a party in your mouth. The only reason why I give it a 4/5 is that a lobster at my local Superstore costs about $10 bucks, and this was a bit more than that. My wallet feels the pain whenever I shell out so much money for such a luxury. But a lady must please herself, mustn't she?"}
{"text":"Blink and you'll miss it. 

There are at least 3 other locations within walking distance, one within the same complex if you want to eat in, only one small table and 2 chairs here.

This location is good for summer as they setup a few tables outside or you can sushi away during the festivals. 

As for all sushi shops, they are a bit pricey, and this location seems to make mostly pre-made sushi and some items from their main menu are not always available."}
{"text":"Very cute sushi shop at a great location. They use quality ingredients and items are made fresh. You can watch how they make it which is nice. The owner is very friendly and there is a wide selection of sushis to try. They have poke bowls and fish tacos too, yummmmm.

You can find free parking at the residential streets right beside this place. Definitely would recommend you try it"}
{"text":"wow, worst ramen I ever had. 

Nisshin Cup noodle for $1.39 would have been better than this $11.45 (CAD) Seafood tonkotsu ramen. 

It is a sushi place after all. But avoid ordering the ramen at all cost. 

Reasons are:
1) Noodles weren't springy like Ramen noodle ought to be. 
2) Broth was not a ramen broth, it tasted like miso soup, no flavor of Tonkotsu (Pork bones) at all. 
3) Then the broth had Japanese shichimi (7 spices) in it, which is normally used for soba noodles, not ramen. very weird. 
4) It also had deep fried tofu skins on it, which is a typical condiment of Udon noodles. 
5) Seafood was basically fake crab stick, a piece of sashimi (unreal).. and some small shrimps. 

Did this place think you can just mix in all noodle condiments into ramen?!"}
{"text":"Desperate for a bite of lunch after landing at Billy Bishop and before departing from Union Station, I turned to Yelp, which pointed out the Sushi Shop in the Union Station food court. This really was a perfect find - not a fast food option, nor one to cause a tummy ache from sugars or gluten (too personal?). 

Staff here are warm and friendly, and were easily able to accommodate a swap of tempura for cukes in the roll I requested. I had a few minutes to spare, so I opted for a few choice from the menu, but those in a rush can grab the pre-made items that are packed and ready to go. 

These guys really have take-out sushi figured out; the soy sauce comes in a small dish, with a sealed lid you can pull back to create a little vessel of soy waiting for your sushi! Best I've seen for take-out sushi. 

Will be returning on my next trip through Union Station for sure."}
{"text":"This is the Sushi Shop location on the main floor of the McGill university health centre Glen site, it's located about halfway between the RVH and the MCH.  It's the standard sushi shop menu, there's a good selection of ready made rolls or you can order from their menu.  They are usually pretty quick and order is usually ready in under 5 minutes.  Service is always friendly and food is fresh.  Good lunch option if you're working or visiting the hospital."}
{"text":"Sushi Shop does what it says on the box... for grab n go fast food sushi, it's pretty good.  Generally pretty fresh and with decent quality ingredients.  You can pick up a pre-made selection or order off their menu if you have a little more time.  Lots of choice of different rolls.  I like their maki printemps, nice and light.  Their soups tend to be sodium bombs so beware if you're watching your salt intake.

This location in westmount is always nice and clean and has good service."}
{"text":"The Sushi Shop is in the strip mall part of the Walmart complex that faces Cote Vertu just east of Rue Begin.  

This place is cool I have to say.  I didn't stay long as I was just in the mood to take out.  I looked at the menu online and to my luck they had a Combo \"N\" already in the fridge ready to go that was just made.  I also had to wait a short while because I ordered a karaage appetizer as well.

I love fried chicken.  If I have an opportunity to get fried chicken at a place that's serving sushi whether it's in the form or karaage or katsu I'm taking it every time.  Luckily they have an option to just get the appetizer which is just the chicken itself, not an entire combo meal so I went with it.  I have to say it was so cute!  It was in what looked like a Haagen Dazs half liter but when you take the lid off it looks like a mini bucket of fried chicken!  

The menu has a lot of choices and some while they may seem trendy some also seem kind of cool and different.  They had sushi tacos in that the shells are wonton type and they serve them with salmon, tuna or lobster.  While sushi burritos are not exactly new, they have that as well and if you so wanted, you could get ones made with karaage.  Between other items I haven't even really seen before they have a lot of stylish and colorful selections to choose from.  

What I ordered was exactly what I had wanted which was a mix of maki a couple pieces of nigiri and that nicely fried and tasty karaage.  The pieces seemed larger than other places that I've seen serve karaage which were more bite sized pieces.  The karaage came with a nice spicy mayo which was perfect.  These deep fried delicious pieces of chicken are not dry but just right.

The Sushi shop for me was a nice quick take out order but it could also be a nice relaxing place to sit down and have made to order as well."}
{"text":"After walking past this place for a year, I finally decided to go in.  It took me so long to try out this new sushi joint because I thought the menu looked a little overpriced.  This day I decided to treat myself.  

I ordered the Seafood Ramen with Tonkotsu broth.  The portion was pathetically small, and the broth was bland.  I inhaled it in 5 minutes and was nowhere near full.  To be absolutely fair though, the ramen had a good variety of fixings.  It had shrimp, salmon sashimi, imitation crab, half an egg, bamboo shoots, seaweed, bean sprouts and tofu.  TINY, TINY pieces of the above.  

I went back for a sashimi combo.  It's fast food sushi so it was just sashimi in the clear clamshell - normally I'm too good for sashimi in a box but I thought it looked acceptably fresh.  The selection was boring.  Salmon, tuna, some white fish that was probably tilapia, and imitation crab.  

The soy was cool though.  They have their own special Sushi Shop blend.  It was slightly sweetened, so I didn't even mind that it was low sodium.  

I ate it all.  I paid over 25 bucks and I still wasn't full.  I know if I kept going back to the cashier and buying more food, *eventually* I'd get full.  But I was running out of time and money, so I stopped.  Why did I pay so much to put myself through all this frustration???  

I guess this is the place for you if you're a healthy professional watching what you eat, but I'm a gluttonous foodie Yelper.  There are no fat or ugly people in here.  That's the image, and I guess I'm just not their target clientele.  It's a brown rice, low sodium, gluten-free kind of place.  The portions are small because everyone's on a diet anyway.  Blech."}
{"text":"This place is definitely not the best sushi shop that exists but it always tastes really fresh and the staff are really nice. They aren't equipped with a deep fryer so you can't order anything with tempura or pizza sushi or the cool new ball shaped sushi:(The seating is very limited especially now that the café next door is being renovated. They have a table especially reserved for their boss further limiting the seating. They have this large air circulating system (or whatever it is) that makes a lot of noise and also takes up counter seats and is a huge eye sore.  On the plus side, it is conveniently close to school and they aways have a good assortment of pre-made combos ready to eat."}
{"text":"Quick, fresh sushi! The service is very friendly and they give good suggestions if you don't know what to get. 

2m from it, there is a SAQ for your alcohol need! In the summer, bring your food to the Mont-Royal park for an improvised picnic. Or you can also sit next to the front window and watch people walk by.

This is one of my favourite sushi shop as they pay attention to detail! My sushi is always tight and tasty.

Get sushi, maki or poke bowl!"}
{"text":"Same as all the other Sushi Shops in town. The only reason I go is because the choices at 1000 de la Gauchetiere are so limited."}
{"text":"A bit pricey but they have a large selection. The shop is always clean but that could be because no one is ever inside. The staff kinda ignored me while preparing my to go order, he was training a new employee. The sushi was good. The rice was a bit stiff but I was expecting that."}
{"text":"I buy many time sushi here. Its not bad. 
But until one time we find out we have pinch of hair in our poke bol and the sushi wrap roll. 
(thats was happen few months ago) 
OMG so nasty! Not only one hair it's a pinch au hair. We going back to ask a refund. We never coming back here: 1000 De La Gauchetière"}
{"text":"My sister is keen on this place so we gave it a shot tonight, and ended up getting way too much stuff - well, ok we managed to eat it all but I was stuffed by the end. We got: salmon tartare maki, tuna tartare maki, 9-1-1 roll, sweetheart roll, exotik roll, calypso roll, and the sirocco hako (sort of like pressed sushi). For the price, everything was pretty spot on, the only thing I found was that the smoked salmon they used was a little too smokey, it permeated the sweetheart roll even though it was mixed with raw salmon.
They have things already made if you need to stop in and grab something quickly, and they're much better for you than fast food - so what more can you ask for? 
No it's not the hippest joint with swank decor, but if you want sushi and you want it now, then this is a great choice."}
{"text":"I'm quite surprised by all the negative reviews here.  This is a fast food chain for sushi and maybe because I'm always in a hurry, I lower my expectations.  

However, there's a diablo roll which I find absolutely delish.  It has some spicy salmon on top and is well made.  They usually have a express combo and I get that. I do admit at over $10, it is expensive, but fast food is always expensive (i.e. McDonalds combo even cost around $8, so I don't expect sushi to be cheaper).  

I also remember having the cherry blossom roll and it is also very good.  However, the other basic rolls like California and avocado are very basic, but it's not bad.  

The miso soup is too salty though and it is from a package (I think).

Overall, it's a great place if you have a sushi craving, work in the area and need a quick lunch.  Not worth making a special trip, but worth it if you are close by."}
{"text":"DO NOT EAT HERE!!!

What a disappointment. I cannot even believe this place passes for Japanese food. We ended up getting the ramen....  well they call it ramen. It was literally chicken broth, some noodles, the chicken was cold waiting for the soup to heat it up, and the egg was precooked and tossed in there (also cold). The food was absolutely disgusting, but since it was already paid for we tried to add their \"spicy\" sauce in an effort to mask the flavor.  Their menu labeled \"spicy\" is literally a dime size amount of Sriracha sauce which we scrapped into the bowl hoping the next bite would be better- we were wrong.

If zero stars were possible I would have chosen that. Unbelievable."}
{"text":"I've wanted to try Sushi Shop ever since my brother raved about a \"legit sushi place that's fast food style.\" There was one in the Bay Concourse at Union, but now that the whole area is under construction, I'm glad a new one opened up here. 

Sushi Shop is a modern-looking little store serving up typical, ready-to-eat sushi boxes as well as customizable orders that are freshly made in front of you. I was very impressed with the selection available. They've got different types of sushi, sushi pizza, as well as noodles. Their rolls are pretty creative and come in a small size (8 pcs.) or large size (5 pcs.) They also come in nifty shapes, like a ball (temari) or a rectangle (pressed sushi). 

I got the Salmon Kamikaze roll, a larger format roll that comes with miso soup (regular or spicy). That was almost $8 with tax. Portions were quite large with a good amount of ingredients within each piece. I thought the flavour of the roll was decent, but not spectacular. I was expecting more spice, but it tasted more like a California roll. The salmon itself tasted somewhat fishy (but Sharon, salmon is a fish harharhar). I know, but sometimes tuna or other species have this fishy taste that salmon lacks. But this salmon had that taste. It wasn't bad though and all the ingredients tasted pretty fresh. 

Overall, pretty good stuff for a takeout place. They just recently opened so I think there is a lot of potential here. One thing they definitely got down is their marketing. They serve their own branded soy sauce, which is sweeter and packaged in a cute Sushi Shop cup. They've also got branded chopsticks, branded napkins, and your order is delivered in a pretty stylish takeout bag that makes it look like you went shopping when you're supposed to be working...

(40/100) - 2016"}
{"text":"5 star for sushi platters. 
3 star review for poke bowl.
This is my go to spot for sushi platters - always an impressive and delish spread. Clean store, Staff is always very friendly, and service is quick. Best to pre order platters if possible. 

We tried the poke bowl after becoming obsessed with the bowls form Roll Nation (at Yonge and eg) - but we're extremely disappointed: we both ordered the salmon and Tuan poke bowl and both bowls were missing the orange mango, and were filled with way too much cucumber (like really bad ratio)! 

I've been ordering sushi and platters for almost 3 years from this location and have always been so impressed - I think they are trying to expand the menu too much to accommodate trends (sushi taco) - play to your strengths, and stick to what you do best."}
{"text":"Quick and tasty sushi. The spicy tuna sushi is really great. This location is a bit nicer than some of the other sushi shops. They take call in orders but can get busy at peak times so make sure to call in early."}
{"text":"4.5

honestly i was plesantly surprised at the concept of this sushi restaurant.  its more of a stop off cafeteria vibe...but surprisingly i liked it.  how can you go wrong with sashimi tacos?  they were delicious i could live off those.  it would be nice if the taco had more sashimi in it but stilll yummy none the less."}
{"text":"I very rarely leave yelp reviews but this place is just so bad that I had to. I walked in at 5 for sushi and they said they did not serve it in the evenings (not sure why since other yelpers mentioned they have discounted sushi after 5). They offered their hot food menu which includes $8-$9 ramen which is what I ordered. They used one of their $1.50 packets of instant ramen noodles with the msg packet of seasoning and added one frozen dumpling and three onions. My 8 year old nephew makes better ramen. They should be ashamed of themselves for not taking any pride in their food. Also, they lied to people that came in after me to say that their debit machine wasn't working all day (I used it). Save your dollars and go buy Mr Noodles for lunch!"}
{"text":"So this is a little Shop that's part of a mall at Atrium le 1000, more of a food court with an indoor skating rink. I thought this part of the underground was a lovely place to visit.

The food court was clean. Staff were bilingual and pleasant. 

We only stopped to get a small bite to eat during our journey into the underground. I don't remember what ma la femme avait mangé. But I got a tuna taco. I still remember it, it was a little bizarre, but delicate with some spice and overall delicious. For a chain restaurant, I was most impressed. 

I'm missing Montréal, but I'm sure I'll be home come this winter!"}
{"text":"Best option at the 1000 Atrium food court. The poke bowls are prepared on the spot and the ingredients used are good"}
{"text":"This restaurant's approach to \"Asian fusion\" seems to be \"infuse Asian food with as much mayonnaise as possible\". My \"poke\" was kind of like the Asian version of a taco salad...mostly iceberg lettuce, with some rice and marinated fish and fried breadcrumbs (like tempura batter), and an overwhelming amount of spicy mayonnaise. I couldn't really taste the fish because there was so much mayo.

Maybe the fusion concept works better in the other dishes, but the poke certainly wasn't worth the price. I would give 2.5 stars if that were an option."}
{"text":"This place deserves a 3.5 rating.  I made a reservation for 12:30pm for 2 ppl on a busy weekday, and they honoured it with their very limited seating. Service was great - they brought our food to the table with a smile.

The sushi was fresh and looked pretty much like the picture on the menu. My friend ordered the seared salmon poke bowl and asked for it to be fully cooked, and they promptly said no problem. 

For a fast food sushi place, they have done a pretty good job."}
{"text":"There are 26 or more Sushi Shop restaurants in Montreal, and tons more in many other Canadian cities. I'm not sure how this site differs from the others. All I know is, they are everywhere! And nearly every bus that passes has a Sushi Shop ad on its side. There's no escape!

This was a decent sushi restaurant, albeit quite small, with few tables. I liked how it seemed to be a real neighborhood place, with some young couples coming in, a few singles, an older couple, and us, my family of four. Many folks came here to pick up sushi to go. 

The menu is beautiful, and the sushi was artful. We liked the tv screen depicting various menu offerings. All were crafted as if art pieces. 

As new diners to this restaurant (or ANY Sushi Shop for that matter), it was very unclear to us how the whole system worked here. The man at the counter beckoned for us to come over there to pick up menus and then he told us to have a seat. We sat at a table by the window and went over the extensive menu. Everything looked so good! And reasonably priced, too. We waited for the guy - or anyone - to come take our order, but nobody did. FInally we approached the counter again, to be told we had to place our order there, pay, and then the food would be brought out to us. Gosh, it wouldn't been good to know this 15 minutes earlier! At any rate, when the food did arrive, the sushi was fantastic: fresh, beautifully plated, delicious. My ramen soup was a bit of a let-down, though. Despite the photo presented in the menu, the soup bowl was super small, and the broth was meh. But the sushi was great, and if and when we return, we know to avoid the soups and just order sushi."}
{"text":"Best sushi ! Fast service, nice staff and delicious sushi! I tried different kind of sushi and they all delicious. Recommand!"}
{"text":"Sushi Shop's amazing website intrigued me and I decided to try them out. The product shots make their sushi look like art and I've never seen sushi quite as nice as they portray on the website. Prices seemed reasonable and I was really excited to dine there. 

As I got there, it became quickly evident that this is actually just a fast food sushi place. There's some seating but I wouldn't stay and eat there as the place gets super busy and loud and people bump into each other constantly - a very chaotic experience. Because the place was so busy the sushi chefs rushed the orders very quickly and obviously the end result looked nothing like on the website and the rolls were quite ugly.

I took the sushi home hoping that it'd be at least delicious and it was alright but nothing special. I would give the sushi three stars taste wise but overall rating is 2 stars as I feel I was lured in with false advertising and should've walked out."}
{"text":"This is my go-to sushi shop as I live close-by. I've been here so many times that if I checked in each time, I would for sure be the reigning Duchess here lol but alas, I always forget. 

Anyway, it has good service, comfortable seating and surprisingly yummy and fresh rolls. I normally order from the menu so they make the food fresh for me. My usual order is the 911 tuna roll (fave), the green salad, the popcorn shrimp, and the volcano poke bowl to share between 2 people. Let's just say this location has saved me from many sushi cravings and I'll probably be back soon!"}
{"text":"While this location is spacious and clean, the portion size was significantly smaller than my go-to location in Westmount. Got the same as usual, volcano poke bowl (fave order) and to my disappointment, it was a good 1/3 portion smaller. I paid almost $15 for it!

Also, veryyy slow service. Took 20 minutes to get my lunch and the place was pretty empty... not sure I'll be back often! The Westmount location is still my favourite."}
{"text":"I got the black mamba roll. It honestly was average at best. Sushi Shop is just one of those places that you stop by if you're really hungry and don't care too much about quality. I wouldn't really stop by again unless I'm desperate."}
{"text":"If I could give zero stars I would. Just wanted a quick snack. Worst sushi I've ever had. I ordered a roll with spicy salmon tempura and green onion.  When I got it there wasn't any green onion. I went back and he said he thought he heard me say I didn't want it (lie) and gave me really old dry green onion in a container. The rolls were sloppy and small and the tempura was soggy. Avoid at all costs."}
{"text":"At this location I've had a sushi combo (roll and nigiri), a poke bowl, and the pork belly ramen. 
The sushi roll and nigiri were fine. 
The salmon poke bowl was a disappointment. The amount of salmon given was about equal to one piece of nigiri. On the plus side I did enjoy the crispy rice as a base though again more ingredients than filler (rice) would be nice. 
Last the pork belly ramen wasn't at all passable. The soup base was flavourless and had a metallic after taste. They could be more generous with the toppings. 

I had higher hopes for this chain as it seems to get good reviews at their other locations"}
{"text":"Situated at the super hospital Glenn. This is where you want to go eat when you're not satisfied with the typical hospital food. 

I had their salmon poke bowl and it was delicious. There seems to be a \"poke bowl\" phase since last spring but you can't ever have too much poke bowl in my opinion. The salmon tasted fresh. The ingredients were all fresh actually. The quantity was decent and the pricing was the same as other sushi shop. Considering the rent at the super hospital must not be \"super\" cheap. The employees are friendly. A great change of taste from your hospital food.

Fun fact, did you know you can call in advance to make a reservation then pick it up later? Great service if you work at the hospital and just go pick up your order on your break."}
{"text":"Giving this place 4 stars because their sushi is always fresh. However it is overpriced. I had their new salmon poke bowls and I was very impressed. The flavours were on point and made me nostalgic of the poke I had in Hawaii."}
{"text":"Order the sushi burrito. Mistake. Pretty underwhelmed to be honest. Its like eating a sad burrito for 15 dollars. I think my favorite part was the soy sauce. I could have gotten like 3 subway sandwiches. Nice staff though."}
{"text":"I'm not a big fan of chain restaurants or sushi, yet this Sushi Shop puts a smile on my face every time!

The service here is stellar, and I always get the freshest and best ingredients. For what it is, a fast food sushi shop, it's the best around! 

Definitely somewhere you should check out for lunch sometime if you're in the area."}
{"text":"Just visited today for a quick bite. Decided to try the salmon poke bowl while my girlfriend chose the salmon tacos. Took about 30-40mins for the food to get to us. We were also the only people in the restaurant at this time. Quality of the food is average. First and last time I'll be visiting this establishment."}
{"text":"The Sushi Shop inside Glen Hospital is my favorite. Since I work at the hospital, I've had lunch here many times and the quality has been consistently good. What I especially like about this location is that they don't skimp on the fish. Their sushi are loaded with the good stuff! Also, they're open later than the cafeteria and many other restaurants inside the hospital so that's pretty convenient.

The staff is very friendly here. If they're not too busy they'll even offer to heat up tempura shrimps and other premade items that are usually eaten warm. Most of the time there are many premade plates (which is what I always go for) and it tastes fresh and delicious. I eat here once or twice a month and have never been disappointed."}
{"text":"Ventured to Sushi Shop today to get a taste of their poke bowls. I ordered the Volcano Poke for $12.95. 

Although the presentation was great, the poke was a disappointment. It was very bland and there were only hints of tempura and the amount of sesame was very subtle. There was a lack of sauce and the lettuce to rice ratio was too high. Even when I gave the bowl a thorough mix at the beginning, there was a lot of leftover rice at the end. The menu description says there are 5 different sauces (onzu sauce, spicy light mayo, light mayo, Japanese mayo, teriyaki sauce) but there were too much mayo that overpowered all the others. The best were only the seared salmon that was lightly torched and the free miso soup that came with the meal.

This experience was definitely not worth $13 but I will probably give their sushi a try next time."}
{"text":"This is a take out place.  I first came across this chain on a drive through Montreal.  When at Yonge and Eg, I typically choose to go to Sushi Rock.  I quickly realized with a baby, I needed to change my plans.  It would have been too hard to put him back in the car seat, drive a few streets down, park the car, get him out and place my order...You get the picture.

This place was walking distance to where I was, they had trays of sushi pre-packaged, and were able to quickly make up anything else I ordered on the menu.

For a take out place, it's ok, but not exactly sushi-fine dining.  It is what it is.  It's good for what it is but not the cheapest."}
{"text":"I guess I'll never enjoy these type of \"fast food\" sushi places. The sushi I ate was very unimpressive with little flavour, they all stuck together and the big rolls fell apart with little trouble.

How can these shops be so popular with other sushi places like Fuki or other sit-in experience have the quality of food that vastly surpasses the poor man's lunch I enjoyed at Sushi shop?

It's not like I'm paying an economic cost here, it was $12.50 for 13 pieces and I can get far better quality AYCE Sushi for $15. It doesn't even come close!

At least I didn't get sick! (+1 star)

If you want cheap, on the go sushi (like a reviewer before me indicated - McDonalds!), then this is the place for you, for me? I'll go dine at better Sushi joints from now on."}
{"text":"How come none of the ramen restaurant is Path accessible?  My craving for ramen needs to be fixed when I don't wanna walk with crazy windchill or on the slushy sidewalk in the Winter please.

I was so happy I found this Sushi Shop at this Path location and it serves ramen.  Finding this place might take some efforts for people who don't usually use the Path.  I walked thru the Path to Standard life Centre via TD Centre, then looked for a direction signage to145 King Street West.

I ordered the Shoyu Shrimp Tempura.  The broth is very plain but still acceptable to me.  It is not greasy at all and serving ingredients a bowl of ramen usually have.  However, the noodle is so wrong.  I believe a wrong type of noodle is used.  It does not have the hard and chewy texture that Japanese ramen noodles should have.  Portion size is fine for me but definitely small for men's appetize.  For $11.24 after tax,  I think it is not worth it.  I am very disappointed to their ramen.  I think I will only stick with their sushi.

Other than this, the service is good and friendly for a take-out food place.  The shop is not too big but still provide few comfortable tables and chairs for eat in."}
{"text":"Yes, yes, yes! That's what you'll be saying with each bite of scrumptious sushi from this location. Tip - if you work in the area, call ahead and order off their menu. Absolutely delish! :)"}
{"text":"Bon sushis, service un peu lent. Le design est similaire aux autres Sushi Shop, donc élégant."}
{"text":"Nouveau restaurant, très beau design et accueillant. Les sushis sont délicieux. Très bon service au comptoir."}
{"text":"Young, friendly staff. Very good food and you can definitely taste the quality. Would recommend to anybody craving some good sushi."}
{"text":"Took way too long. Half an hour later than they said. I'm very disappointed.

There is no excuse, if I call ahead and order and they tell me it's going to be 45 minutes, then I expect it to be basically ready when I get there. I can't express how frustrating it is to be told \"oh, just another 5 minutes\" for half an hour... for take out sushi. Ridiculous.

Having said that, this encounter seems to be unique to this location. Other visits to various Sushi Shop franchises are typically much better."}
{"text":"Advised restaurant I had celiac, they were very knowledgeable and understanding.  Can't guarantee no cross-contamination but I wasn't sick. AND hey had GF soy sauce. Thank you!!"}
{"text":"This place was pretty brutal. The fish itself was good but everything else was just plain bad. I placed a large order to take back to my hotel for my coworkers and I to enjoy while we worked on finishing a presentation. When I got back to the hotel I found the edemame frozen (and already peeled), the tempura had obviously been refridgerated and was cold, and the rice under the sushi fell apart when you tried to pick up a piece.

The saving grace from this being a one star review were the staff.  They were very accomodating and did their best to put the large order together in a timely fashion."}
{"text":"What a cute spot! The staff was so nice and the food was delicious. I came here multiple days in a row during a business trip to the convention center."}
{"text":"I swore I'd never go near another after my rip roaring fight with the one on Sources, but here I was holding some pretty damn tasty,  yet totally overpriced sushi tacos."}
{"text":"I am pretty fussy about sushi...and have grabbed some Sushi Shop downtown in a pinch...pretty good for cafeteria style. 

But this location...they have their regulars? And trust me..they get served before the plain villagers.  

I waited 45 minutes for my sushi, I finally stood up and asked how much  longer, while the anger shoved the 2 counter girls to serve one loud woman who had just walked in to make anything she needed immediately...and my food had not been looked at yet. 

Never again. I asked for my 34$ back (this was sushi for one!!!) While the manager bad mouthed me to his staff for being impatient. I pointed to my prepaid bill that at that point I had been there for 54 minutes according to it. He said \"good luck finding better than us.\"

Hahaha. Ass."}
{"text":"Thought this was just so-so. Maybe I should have stuck to just sushi rolls, but I decided to get something warm and went for the tonkatsu ramen.

For $10, the ramen was on the smaller side. The noodles were not thick and chewy, but instead the kind of thin noodles you get in an instant packet of ramen. The chicken tasted a bit artificial (similar to McDonalds / Subway chicken) and a little rubbery. The broth was also not flavorful. All in all, it was disappointing.

The tekka maki roll was ok - nothing to write home about. I was hungry and it was edible but it's nothing I would go out of my way for.

I had higher hopes for this place, but will probably go elsewhere."}
{"text":"Not too bad for a sushi-to-go place. The pre-packaged rolls are pretty bland w/ tons of cucumber and avocado rolls. If you want some fresh sushi, I suggest taking the time to dine-in instead. The ramen was below average for a $10 bowl but it's a mall sushi place after all. Their \"designer sushi\" was pretty interesting. Tried out one of their Hako sushi and it was actually pretty good.

The only complaint I have with their prioritization skills. I group of 4 ordered the 60-piece giant platter right before me during the lunch rush hour. Just b/c those people were fine with waiting 30-40 min doesn't mean the rest of the people in line were fine with it as well. They ended up assigning all 3 sushi chefs to making the giant platter instead of doing a 2-1 split. My ramen came in 10 min and I had to wait another 30 min just to get my 6 pieces of sushi..."}
{"text":"The only thing good about sushi shop is that if you go at closing time they give you free sushi boxes! Its not the best quality, but its cheap and on the go! There is not that many people here, since their is so many restaurants in proximity you never have to wait."}
{"text":"Across the street from Place Des Arts. Service is not so fast. Takes them quite a while to prepare an order when I was the only one there. I never buy the \"pre-packaged\" meals, I always order fresh. However when I was eating it, it really wasn't fresh. I was so bad, I had to ask for my money back, how unpleased I was. 

The place is really small, you can hardly move around properly. 
Really not a good place for sushi."}
{"text":"Fast food sushi? Yes, this place nails it. Sushi Shop is hands down the best fast food sushi chain I have eaten at. In the downtown core/financial district, no place even comes close. Step aside, Bento Zushi, Umi Sushi Express, and all you other pathetic places.

At Sushi Shop, the sushi is very well made. Ingredients are fresh. Ratio of rice to filling is excellent and generous. And service is pleasant. Having a brown rice option is also a plus. Note that I typically order items off of the menu, so I don't know how good their premade to-go lunchboxes are.

Another great thing is that their soy sauce comes in a little dipping box, unlike the other places where you squeeze the sauce out of some packet onto the tray and hope that it keeps together enough for you to dip your sushi. This makes the whole experience so much better. The one drawback to this particular location is that it's located in Union Station. That place is grimy, and I have a general distrust towards any food establishment there (I shudder to think of what the McDonald's back kitchen/storage looks like)."}
{"text":"Always loved Sushi Shop- usually get it in Montreal but I had to try it in Toronto too. Simply amazing"}
{"text":"Yep, this is another location in the cheap and convenient Sushi Shop chain.  Not the best sushi shop, but probably the best Sushi Shop out of the bunch. The food is quick, the price is right, and the service here is about as good as it gets. We're always greeted with a smile by the kids who work here. This is our go-to choice when we're feeling lazy, but as an easy choice it certainly isn't a bad one.

Note: This location isn't open on Sundays and closes at 8pm on weekdays."}
{"text":"Mmmmmm de très bons sushis, lorsque l'on veut manger à la maison avec un bon vin. Faites les préparé à l'avance et frais fait. J'évite de prendre les déjà préparés. j'y suis une fois par semaine. Une étoile de moins pour le service désorganisé et l'attente malgré que nous les faisons préparés."}
{"text":"I tried their delivery service. The food was delivered promptly but I had an issue with the delivery guy. He expected me to tip after getting charged 2$ more on my receipt and he was very pushy with it. 

Although, the interaction with the delivery guy turned me off from ordering again. I have to tip 2-3$ more in addition to my 2$ overcharged on the 24.78$ bill by the restaurant. I got the tuna poké bol with two pieces of seared izumidai and two pieces of Philly Kunsei Syake. It wasn't anything memorable to write about and the freshness wasn't there. I don't expect to get anything fancy out of the sushi shop....The price was okay considering the amount of fishes you get in your order, it was worth it. 

Will I order again? I highly doubt it. After getting scolded by the delivery guy for not tipping more after getting charge 2$, I don't think I will order again. The 2$ goes directly to the restaurant pocket and not the delivery guy. THIS does not sit well with me. I should have tips anyways but my past experiences on delivery service noted this as a rip off... Probably a common practice these days."}
{"text":"Union station is pretty big and with all the construction and someone unfamiliar with it, it can be a bit tough finding the food section.  I was really confused as I was near the car rental counters and for a moment I thought... are all the food shops closed because of the construction?  Head towards the lower ground floor and the most eastern part of the station - there you will find tons of fast food places.  I had a flight out of Toronto Island airport and figured it would be better to grab something from the station rather than chancing what little they had at the airport (not all airports can be like T5 at LHR!).  

The sushi here is so awesome coming from a train station!  I was surprised how cheap it was but I am coming from the UK.  I picked up a variety roll box and a shrimp tempura roll and it was so good!  If I had more time and space in my stomach I would've loved to try some of the other things like sushi pizza!  Later I realised this place was a chain and can find it all over Canada but regardless, awesome place for sushi... esp on the go."}
{"text":"Was in the Bloor Yonge area the other day an decided to stop by since I had been craving sushi all morning. When I first walked in I was greeted right away despite the busy lunch rush. The back fridge was stocked with ready made sushi combos if you're tight on time and didn't want to wait 5 - 10 minutes for the sushi chefs to make a fresh one. Unfortunately, it should be noted that if you are vegan such as me you will have to wait for a fresh one to be made with substitutions as the ready made ones contain mayo. All in all the wait time wasn't too much, the staff were super friendly, and the food was pretty good considering it's fast food status."}
{"text":"Sushi Shop is fast food, so you shouldn't have high expectations. That said, I think their quality has been getting better recently and they have added a lot of new things to the menu. It's not authentic by any means. Most rolls have tempura bits and many have non-traditional ingredients like cream cheese, chicken, mango, etc. But the last few times I have been here, the rolls have been surprisingly tasty! My favourite is their box sushi with crispy torched-salmon, avocado, and mango. Yum! Not bad for a quick, convenient meal on the go. Call ahead for pick up because if they are busy, it can take 20-40 mins. for them to prepare your order. I don't think many people get the sushi to stay (the place is always empty), but they do have ample seating with a TV and selection of magazines and newspapers."}
{"text":"NOW OPEN. Same location as Thai Express -- in a shared cafeteria. Place is very clean. Food is fresh and delicious. Had the tuna tartare. Very tasty and well priced.

This location is new, but not easy to find. It's just off Decarie (Autoroute 15 S) adjacent to the Walmart parking lot. It is a small place, cafeteria style, in the same building as Thai Express. Very good choice for a budget-conscious traveler, for lunch or dinner.

Please note, this place closes early (weeknights at 8 PM)."}
{"text":"This place is the impersonation of sushi as western food. I have never been interested in eating there, and only went there because ABSOLUTELY EVERYTHING ELSE was closed. 

They don't even serve you real green tea, they have a display where you can grab you (canned or bottled) tea, or whatever drink you want. For some weird reason all their combos include something with avocado. I asked for the brown rice combo, it's GINORMOUS and, of course, there are avocado makis. The nigiris are just blah - but I'm not a huge fan of nigiris. 

I would only come back in the same situation - if I were starving and had nothing better around.  The food is ok and the makis are giant, but it's waaaay overpriced and you can find much better sushi around this neighborhood."}
{"text":"This location is smaller than the usual locations (has room for 2 people to sit down), but perhaps people rather sit outside in the Place des Festivals. 

If you've never been to a Sushi Shop before, don't limit yourself to what you see in the refrigerated display. Mark up on the menu what you want to order, takes about 5-10 minutes (during the off hours). Excellent sushi, great for take out. But if you're looking for fancier ambiance, try Place des Festivals, a bit further downtown."}
{"text":"Let me start out by saying \"I do not like fast food\" and rarely eat it unless desperate. But \"take out sushi\" isnt fast food in my opinion so when stuck in Union Station (delayed during my daily commute) I gave it a try.  They have \"pre-made\" and made to order options. Both are fantastic! Ingredients are fresh, and layers are just right - not overly saucy or too much rice (like some places do).  I would have thought it was a bit pricey before I tried it - but like they say \"you get what you pay for\" and its worth it here!

Service is phenominal. Always a smile, a recommendation, and fast!  Even better you can actually call ahead and they will have your order ready for you as you run to make your train. What more could you ask for?

Obviously I have been back many many times since and every time the quality and service have been the same. This isnt a one hit wonder. 

They are welcome to stay at Union Station and I encourage them to teach some of the other eateries there how its done.

This is a \"dont miss\" folks!"}
{"text":"This store of Sushi Shop maintains the standard for fresh fish and has always all the ingredients for the relatively big menu. It is a good option if you want to pick quick sushi lunch or dinner. The place itself is neat, but not very inviting to stay and have the meal there. Most of the time the restaurant will have ready combos to pick or you can order  from the menu if enough time, it takes 20 minutes to prepare. The second option is better if you want to remove the mayo from the rolls, the personnel will accommodate similar request. Not a fan of the miso soup, also the rice is sometimes drier then it should be for sushi."}
{"text":"I tried my first Poke bowl here! 

They had a promo for the Salmon Poke Bowl for $11.95 I believe, a dollar less than the $12.95 regular price. However, they also had a promo for a free drink if you ordered the Poke Bowl, so to my surprise, this promo isn't available with the $11.95 promo, and a drink itself is $2? What is logic???

That alone was a weird experience with the cashier. As for the food itself, I really enjoyed my dish and it was definitely filling. My poke was essentially sushi in a bowl, which I enjoyed a lot. 

It's just a shame that their promo is set up very poorly. I'll be back, but I'll opt for the better deal after getting all the information before ordering next time...."}
{"text":"We got off the train at the Rue Saint-antoine stop and were greeted with cold winds and sideways rain but luckily for us, the station was connected to what we initially thought was an indoor mall because there were many shops and different eateries only to find out later that it was actually the Montreal Congress building, so that was cool. It was no wonder there were so many people looking fly in their expensive suits.

Sushi shop had a very impressive looking menu and this is why we ended up eating here to wait out the rain. The workers were super nice! They didn't treat us any different despite our being significantly underdressed in comparison to the other people there. 

My parents ordered the California roll and while the flavors were good, they both thought the rice consistency was too soft. I watched as my father battled bravely with his chopsticks, trying to not drop all of the sushi stuffing as he picked it up from the tray and swiftly maneuvered it to his mouth. My mother watched with a smile as she decidedly gave up and just picked it up with her hand.

I ordered the tuna tacos and the exotic roll. It had pineapple, mango, shrimp, Krab, and avocado; it was great tasting, and certainly hit the spot. I will agree that the rice consistency was odd for sushi though. The shell for the tuna tacos were not fresh and I found them a bit overpriced considering the size/quality. 

I think what I enjoyed the most was the Miso soup, I found it to be very delicious and hit the spot with it being cold, and rainy.

While I wouldn't consider sushi shop a foodie destination; it's good for a quick fix, or if you've got some time to kill and need a snack. Customer service was great."}
{"text":"FRESH...TASTY...SO MANY CHOICES!!!! I honestly wish this was a fancy dine in place because of the extensive menu. It is more of a on the go/take out. There are places to sit though. The ladies working are very nice! I've tried a bunch of various rolls from here and they're always A+! My friend swears by their poke bowls, she say they're the best in TO!! Well done Sushi Shop!"}
{"text":"Sushi shop is good. 

But seriously. This location ? Never again

I asked for two sushi rolls. Two employees. One customer. 

They kept talking and talking and talking, taking ages to make two stupid rolls as I was just sitting there in front of them, not wondering one second if maybe they should stop talking and start actually making the rolls. 

20mn later (not kidding) I had the rolls. Finafuckinglly


Maybe too angry to enjoy them, and it takes a lot to make me angry, but seriously. Do your fucking job"}
{"text":"I went here the other day after picking up one of their takeout menus and salivating over the awesome types of sushi they have.  I got a pre made box of sushi, only because I didn't have time to wait for an order to be made.  As soon as I walked in I was greeted with a friendly hello, and asked if I wanted complementary miso soup.

When I started eating the sushi I have to say it is by far the best sushi I have had, and beleive me, I've tried a lot of places.  Both in Toronto and Mississauga.  The rice layer is not thick and chunky, rather an accent to the sushi roll, and the fillings are tasty and fresh fresh fresh! Even though mine was pre made.

Ill say it.  It's my favourite sushi place now. Even though it looks like a \"take out fast food sushi place\" it's quality is amazing."}
{"text":"Cette succursale Sushi Shop se démarque réellement de ses consoeurs. Le service  y est hors pair. Je suis venu ici tard en soirée, 15 minutes avant la fermeture. J'ai commandé deux combos sushi pour apporter avec quelques extra pour ma conjointe. Malgré l'heure tardive, et malgré les exigences particulières de ma copine, les 2 employés se sont exécutés avec sourire et rapidité, allant jusqu'à me faire quelques suggestions pour agrémenter notre repas. Les sushis étaient frais et délicieux. L'intérieur du resto était d'une propreté sans faille. La décoration est zen. Il y a même une petite carte des vins qui offre quelques bouteilles de blanc, dont quelques une en petit format. Super! Dommage que cette succursale se trouve un peu trop loin de chez moi sinon, j'y reviendrais souvent."}
{"text":"My favourite sushi place in Montreal. 
It's \"fast food style\" but it's quick and delicious and everything always looks and taste fresh. 

Great picture menu, detailed and simple to understand. 

Staffs always friendly. 
Nice simple decor, probably standard because it's a chain restaurant. 

Definitely the best chain of sushi shop."}
{"text":"Seemed like fresh tasting inredients and textures, but the taste were a lesser than enjoyable experience, compared to other similar sushi places (I've never been to a fancy sushi restaurant, so I'm not comparing to those).

I tried the \"Vancouver\" Maki, which had: smoked salmon, avocado, light cream cheese, and sesame seeds on the outside of the rice. It was actually very dull and unpleasant to feel and taste a brick of pure cream cheese in each bite :( It completely drowned away the taste and texture of the fish, and made the entire texture mushy because of the avocado texture next to it. Needed less cream cheese, and instead of it being just plain, the cream cheese should be mixed with seasoning, like spicy sriracha sauce would have suficed. Not ordering this again...

Also tried their \"California Classic\" Maki :kani kama, avocado, cucumber, light mayo, and sesame seeds on the outside of it's rice layer. This was very dull tasting compared to the way other low grade sushi restaurants make their california rolls. They didn't put any egg in it, which I felt it really needed that extra kick of saltyness that would have brought to help the other ingredients spring up together. The cucumber was the best part, because it was the only taste that stood out really. The \"crab\" in it was ok, but the entire thing together was lacking, and I won't be ordering that again.

I also ordered their seaweed salad, which is usually a favorite of mine in every sushi restaurant. It tasted dull, and a bit soggy instead of the usual fresh and crispy wetness other places make it. They don't put enough seasoning or chili in it, so it didn't satisfy my favorite craving :(

Their menu in their restaurant does not give their available choices any justice. Looking at their online menu now, they have some very interesting choices that are shined more there, yet seemed like rubbish on their in-location menu :( I regretfully ignored those as they didn't jump out enough.

Costed me 21$, I gave a 3$ tip at the counter when I paid because their debit machine offered the choice to tip. That was strange, since it their garbage had a place for customers to put their empty trays ontop like they're suppose to clear out their own table... I didn't do that since I already gave a tip, which was just a little over 14%. Eventhough I paid at the counter, the employee still brought my food to my table. However, for what I paid, this was still too expensive for this level of sushi. I should have opted for the all-you-can-eat sushi a few blocks away if I knew I would need to spend around 20$ for a regular sushi meal here.

They didn't give me enough wasabi paste. Enough soy sauce though, but I didn't appreciate it being in a to go package. I didn't mind that they didn't give me pink pickled ginger, just regular \"white\", which means to me less food coloring, so I was happy with that.

I didn't go to the bathroom, but the place seemed clean and very modern. Their tables were way to high for their seats, so it was awkward for me to eat with my food above my chest, but at least the couch wall seats were comfortable. 

I saw the customer near me order the \"sushi burrito\". I think that was a fantastic idea but I don't regret not getting it, because it's just one \"sandwich\". For that price, it's not worth it to me. They should add a cheap bowl of asian soup of the day to that, and make it a combo for that price in a place like this. If they're just going to be serving one burrito, than it ought to be similar to the price of one hamburger in a fast food place, which on average is around 5-7$... instead of the 12-14$ they offered. You don't get an entire filet of fish in any of them, so they shouldn't be charging this high price. I've tried a mexican burrito in an actual restaurant before, and they served me it with filet mignion meat inside. That dish was a full dish; complete with side dishes, which was just a couple of bucks more than what this place charges for 1 sushi burrito alone, yet they managed to add in a hell of alot of beef... so when I look at the market, I can understand why this place (sushi shop) was empty when I went in.

(Looking at the other reviews here, I noticed that there are people who are paying over 30$ for their sushi meal here... No way lol They're dumb lol This isn't a real restaurant (yet, hopefully!) This is just slightly above cafeteria level, yet still below all-you-can-eat taste. This place doesn't know how to combine ingredients, they're just throwing random items together. I say there's potential here because at least it's not stale. They have all they need, just have to get a good head to put it all together right... suggestion: since you have good ingredients, but don't know how to put them together... then let customers order their own customs rolls, since you make them fresh anyways!)

Cheerful and polite employees. 
Nice looking place.
Fast service.
Fresh ingredients.
Needs better management on organizing their menu."}
{"text":"Really inconsistent. I came twice before and the sushi store was closed after 5. What a bummer. But had some good dragon eye the second time round. Not a bad place at all if youre around the block and craving for sushi, if you dont want to travel too long."}
{"text":"I've been a fan of Sushi Shop for about 6 years now, ever since I found it in Quebec. 

This is probably as close as you'll ever come to a 'fast food' version of sushi. This isn't really the sit down, relaxing, and romantic atmosphere that you get with most sushi places. You go in, grab a combo (or place an order), wait a couple of minutes and go. Many have asked if there's a need for such a thing, but with fast paced business men and women who are trying to keep healthy, I'm confident there's at least large market. 

In this review, I'm comparing this place to other Sushi Shops I've been to. Sushi Shop's defining qualities include innovative and tasty combinations of rolls (cream cheese + sun dried tomatoes was one flavor they used to do) and deliciously flavored rice. I didn't taste any of that here. 

This sushi shop in particular is merely ok. It's a little smaller than most and while the workers were nice and the food fresh, the taste fell a little flat.

Lately they've introduced brown rice into a lot of their rolls, which is usually optional. I personally hate brown rice, because has a slightly sweeter taste and a grainier consistency. This adds up to something that tastes similar to my mom's morning porridge.  And Sushi Shop doesn't seem to be always separating the two types of rice. I'll have one roll that tastes fine, and yet the next piece I'll be bombarded with porridge flavor in my seemingly perfect white rice roll! 

Perhaps it's all my imagination, but either way at this particular location the flavor isn't as popping as the others."}
{"text":"This is one out of a chain all over this city. I wouldn't come here to have sashimi or very traditional rolls, but what this little shop has going for it is the creativity of its combination rolls. In one prepared box, each piece will be comprised of an array of different ingredients, which will keep your palate guessing.

The cute dessert sushi gives this place an extra star. Fresh fruit replaces fish and is wrapped in white instead of black seaweed. The chocolate dipping sauce in a soy sauce container is an added bonus."}
{"text":"I haven't given out very many one stars, but this place is a HORRIBLE excuse for sushi or japanese. You should be able to tell by the plethora of NON-asian people that run this place.

Don't get anything raw - it tastes like crap. The cooked shrimp is too chewy. The pieces of fried tempura are like stale bits of bread crumbs. When I eat this, I feel like i'm biting into one of those cute erasers that look like sushi but is actually rubber.

Even the RICE on these things is horrid. Avoid sushi shop!!!!!"}
{"text":"Great place to grab quick lunch in the neighbourhood. I got tuna tartare rill and red tiger. Both were delicious! Way better than what I expected from this place!"}
{"text":"My friend was hosting and got a huge plate of takeout sushi from sushi shop and I'll admit, as a sushi junkie, I enjoyed it but afterwards it made me feel weird for the rest of the night. Can't comment on service or price-tag but the sushi rolls looked well and tasted good though."}
{"text":"While the little fish symbol for Sushi Shop can be a welcoming sign for quick, fresh, and healthy lunch fare in a sushi-barren city like Ottawa (where I first came across this chain), the same feelings are no where near evoked in the sushi-metropolis of Toronto. In this city where cheap (although rarely quick) sushi is so easily accessible, Sushi Shop's \"environmentally friendly\" mandate would make a great differentiator if they could only follow through completely.

The decent effort that the chain makes includes using only yellowfin (vs the endangered bluefin) tuna, napkins that are made from 100% recycled fibres (of which 60% are from post consumer materials), and reusable laminated menus paired with markers for dine-in orders. However, anyone remotely environmentally minded will quickly note that the large number of plastic boxes, prepackaged soy sauce and dips, and disposable chopsticks and cutlery cannot be ignored.  I didn't notice that any of these were biodegradable - correct me if I'm mistaken. 

For the love of sushi and the environment, these comparatively high prices could be justified if only their vision to be environmentally friendly was better rounded.  How about providing separate garbage bins for recyclables, biodegradable materials, and waste? Eliminating packaging whenever possible? Once, even my 'for here' tartare maki was wastefully individually wrapped before plated. What about pioneering the reusable travel chopsticks trend in Toronto by selling them in-store?

I like this location of Sushi Shop better than the one at Carlton and Yonge since it's a little bit hidden and has large windows perfect for people watching. The menu is a little different (in a less traditional, but still palatable and flavourful way) and the fact that the food is both available immediately and not prepared the night before (as the grocery stores do) is both satisfying and convenient."}
{"text":"I don't give too many onesies and twosies, but I believe this place merits it on one main level that trumps the modern high ceilings, giant photos of good looking sushi and the staff who get something for effort. 

The real issue here on two specific occasions is this; I was attracted by all the ads and photos of their somewhat new Temari offering. It stands for \"hand ball\" or the like and are rice balls either stuffed, mixed or topped with various ingredient combinations. 

In sum it adds up to this; too expensive for the lack of quality ingredients in the 4 balls themselves. The photos are quite misleading and in the case of the crispy lobster balls is virtually faux...where's the beef comes to mind...pretty much lobster rillettes at best. 

I think you can read between my overt lines that I was really disappointed times two."}
{"text":"I pass by this sushi store everyday but always seemed to walk in and walk directly out. 
Why? The rolls look really dry, artificial and tasteless. 
I finally mustered some guts a few days ago and tried it out and guess what? It was actually dry, artificial and tasteless. 

I really hate wasting food but this was one of the few times where I threw away half of my sushi platter. 
Sushi shop is also extremely overpriced for bento sushi. I would even dare to say that Longo's $7 sushi across the street is better than here. 

Punchline: it's as tasteless as it looks."}
{"text":"Came here for a light snack as I didn't want a full meal. I got a small maki package it was decent. I'm not sure if I would eat here again. I'd have to try something else."}
{"text":"Place is a tad on the expensive side but the quality is really good. It seems stuck in between large price for small portions but the portions are good. But there seem to be other places nearby that have a better ratio if you are willing to walk a few minutes more."}
{"text":"I've only ever had the poke bowls from this location so my review is based on that. The first time I picked up from here, I ordered the shrimp poke bowl. I found there to be too few shrimp and considerably less than I had gotten at a different location. I called in my order about 10 minutes before arriving and when I got to the cash, they told me that it wasn't ready yet. I assumed that meant that it was nearly done but then the employee rushed to the side and started making it herself. I was a bit annoyed that they forgot my order but it was busy that day so I understand.
I picked up again today and had the salmon poke bowl. I found it to be much better and the fish tasted fresh. The only issue was that I had asked for no seaweed and they put some anyways. However, the employee called me right after I left the store to warn me of the error and to apologize. I really appreciated getting the call and found it to reflect well on the business. 
Is this place the best restaurant for a poke bowl? No.
But I will order if I get a poke bowl craving."}
{"text":"Decent sushi but is not worth the price, extremely over priced for what you get. I've had better sushi for less, not worth it."}
{"text":"Good poke bowls but super expensive! $14 for a bowl. They should add more veggies. We would eat here again but not often bc of price. If they have any competition w better prices then we would go there."}
{"text":"I came here for lunch the other day and I had a fantastic green dragon roll with seaweed salad. The friendly staff made my food quickly and although it was \"fast\" sushi the quality was noticeably better compared to some sit down sushi restaurants. I give it a 5 star rating when compared to other lunch express sushi joints. Great for a quick, healthy and tasty bite to eat on the go!"}
{"text":"This place is incredibly slow. Avoid especially if you're looking for a quick lunch break at work. My order was processed after the order of the customer who came in after me. ??

The staff is nice, there is free green tea, but the service was incredibly slow. The sushi shop on Notre-Dame is much faster."}
{"text":"One of the better fast food Sushi Restaurants. Especially on your way home from work, while you wait for your train at Union Station, pick up some sushi!

My favorite sushi I tried here is the Spicy Shrimp Sushi. They have some pre-made sushi, you can just pay and go. Otherwise their specialty sushi they make fresh in front of your eyes. It may take 5-10mins, but definitely worth the wait!

Spicy Shirmp sushi contains - Shrimp, Japanese crabstick, avocado, lettuce, green onion, tempura, spicy light mayo, red masago, sesame. The best is the spicy mayo sauce!! Mmmm, ok now I am craving sushi......."}
{"text":"Évidemment, il s'agit d'une chaine bien établie d'un style restoration rapide. Vous aviez faim et vous aviez peu de temps, Sushi Shop sera satisfaisant.

Si vous recherchez un goût de sushi authentique, vous seriez déçu. Il y a une bonne variété de makis dont certains font l'objet d'un mariage des cuisines de l'Est et de l'Ouest. Une belle fusion... parfois douteuse.

La succursale sur St-Martin est de petite taille avec tout au plus 15-20 places assises."}
{"text":"Pricy compared to other sushi joints in the area. I do like the kamakazi rolls alot though and the california rolls as well since they are large. The soy sauce has a sweet taste to it and I actually like it a lot. Still, this place is too expensive for what you get."}
{"text":"Parce que je sais qu'il y a beaucoup plus de restaurants à sushi qui sont locaux et d'aussi bonne, même parfois de meilleure qualité, j'ai failli donné seulement deux étoiles au Sushi Shop, mais vu que c'est vraiment mon \"go to\" favori quand je suis absolument épuisée après le gym et trop paresseuse pour me faire à manger, je dois leur donner au moins un 3 étoiles! Parfois je me prends des sushis commandés et préparés sur place mais je commence à avoir mes combos favoris dans les boîtes pré-faites. Ma règle générale : si j'y vais le midi, je me prends une boîte car ils sont souvent faits la journée même, et donc seulement quelques heures plus tôt, mais si c'est pour le souper, dans ce cas-là, j'en profite pour prendre quelques rouleaux plus spéciaux."}
{"text":"nice close location for a poke bowl. i got the salmon poke bowl, but like the other reviews, would agree it is quite expensive. i also expected more salmon in the salmon bowl."}
{"text":"After getting our brows done down the street, we decided to come and eat at this little shop at the corner. It is meant to be takeout place but had quite a few tables to sit in so that was a little confusing. She also brought our food to us so I originally thought it was sit in. 

Anyways, back to the main point, I really liked the variety and the types of sushi you're able to get such as pressed sushi, large maki rolls, balls of sushi, and so much more. It's very experimental and they have really cool flavours and combinations. Each dish ranged from $5-$9 and we found that two dishes each and a shared dish was the right amount of food and made us full for the two of us. The quality was good. If they upped the quality and had more quality control (my maki was cut unevenly) I would have made this a 5 star review. 

I give them a 3.5+. It's a decent a la carte sushi joint and I would come back if I was in the area."}
{"text":"Fair enough, confortables chairs , nice service, big windows, seems clean. For a quick lunch or dinner."}
{"text":"If you are hungry and hurry its a good spot, dont spect to much but the place is quiet, clean and free self service tea :)"}
{"text":"Do Not Get Sushi Here, Its not Fresh!! I ordered from the menu with the expectation that they will make the sushi fresh but instead they took from their premade refrigerated stock and present it in such a way that it was made to order. It tastes absolutely stale and disgusting!!! Even the ginger and the wasabi looked stale!!! Who knows how old is this stock... if you are corporate or the store owner please reply here for an explanation. Thank you!!"}
{"text":"yes it is a chain
and yes i am sure that if i went to japan they would not have half of the ingredients they feature here
but who cares
it is fresh and tasty and i am sure i will go again and again for their imaginative rolls"}
{"text":"UPDATE: they now close at 9pm on weekdays!!!

omgawd it's crazy I'm giving takeout sushi 5 stars.

This is THE place I order from when I have (forced) to work overtime. Unfortunately Sushi Shop closes at 8pm so I can't always make it there.

TIP: they take orders on the phone! They didn't ask for my credit card info so I didn't need to pay until I arrived. PLUS by the time I walk there from my office, the order is ready (lineups here can get long!) This is awesome!! 

What else is awesome? 
- soy sauce comes in a sealed container, actually wide enough to fit your sushi (even if your chop stick skills are terrible) AND plenty enough for at least two sushi rolls!! Say goodbye to soy sauce mess!! Remember back in the day: soy sauce ketchup packets that are insanely messy AND LITTLE, tiny soy sauce cups where you'd eventually lose most of it to one/two sushi.
- Red Tiger maki roll: lightly torched (TORCHED) tuna with shrimp, spicy mayo, tempura.. it's really delicious
- Spicy mayo is actually spicy
- gigantic menu with so much to choose from (blossom sushi, sushi pizza, beautiful maki rolls)

YUMMMMMMMMMMMMMMMMMMM. When I work pass 7pm, my company will pay for dinner. And I come here. It makes my overtime nights enjoyable! (before 8pm of course)

If you order about 2 fancy rolls, it can come to about $20. Not ideal for lunch..."}
{"text":"Sloppy staff. This is the second time I've got to this resto and I've ordered sushi and half the ingredients are missing. For example I ordered a syake tempura, it comes with saumon and green onion. All that I've received was just saumon. I don't know if they don't care or just aren't trained. I've been to the one downtown and it's never happened. Clients expect a certain taste to their sushi, and if an ingredient is missing it completely throws it off. I won't be going here again."}
{"text":"Wanted to give this place more stars because I did thoroughly enjoyed my sushi (although it is mall sushi). However, it took me too long to get three rolls of sushi, about 20 minutes, and everyone else who came in after me had left. Although I did order the sushi balls and the special sushi... The sushi is a bit pricey - faring about $4-$8 a roll. I come from Brooklyn,  so I gawked a bit when the total for three rolls came up to CA$25! I'll try other places in Montreal next time, but for now, I would say this place is fair..."}
