{"text":"I agree with Wendy.  It definitely seems like this is their first restaurant. 

I ordered takeout on a Saturday night.  They told me it would take 30-40 minutes so I came back after 30 to find my food ready, but cooling on the counter.  Hilariously, both their credit and debit machines were broken so I had to go home to get cash.  By the time I got it home, some of the dishes were cold.

The food was nothing special.  Lamb korma came in a watery sauce that was not at all spicy (as they had told me it would be - that's why I ordered it).  The yellow dal was comforting and delicately flavoured. The chicken biryani was bland, though. The garlic naan was also meh.  I've had way better.

Sad to say, but the best thing about the meal was that it was 20% off.  They had some kind of takeout special.

Also, I think some of the 5-star reviews on here are fake. I hate when businesses do that."}
{"text":"I just signed up for Yelp so I could write a review of this place. It was the worst, absolute worst food I have ever eaten. And usually I don't complain if I'm not cooking. The Mulligutawny soup was a weird white colour and had pink chicken in it. Like chicken korma, it was disgusting. And the pad Thai was complete mush. Over cooked, old, soggy, I was afraid to eat another bite. Don't go to this place. Save your $. This place changes over every 3 months, probably same owner, different type of food every time. No one ever in there, should have been an indication. totally regret eating the few bites I did. I can't warn you enough. Do not eat here."}
{"text":"Very dissapointed in this place...Went for lunch amd ordered Butter Chicken...it had maybe 5 small chunks of chicken in a soup of sauce...the Pakoras were okay.  Doibt I would go back...theremis far better Indian options around..."}
{"text":"I ordered takeout on Saturday night. The food arrived in 25 minutes! I was pleasantly surprised on how quickly my order arrived - until I opened up the large brown paper bag. The food was not fresh. The rice seemed to be reheated , the bread was also reheated, the butter chicken tasted like a sauceless version the PC one you buy at Loblaw's,- probably defrosted and heated before delivery.  Sutra is a massive disappointment. The portions are very small and are bulked up with potatoes,  the naan is greasy, the basmati is crunchy in parts. I will NEVER order from this place again."}
{"text":"Our experience of this new restaurant in the Roncey neighbourhood was disappointing.  The food and service was mediocre. We had to sit ourselves down and wait for 20 minutes even though the place was empty before being served.  We eat a lot of Thai and Indian food and the dishes we ordered were either bland or oddly overspiced, including the mango salad. I really hope the business makes the changes needed to be successful."}
{"text":"I'm not sure about their sit-in dining but we ordered delivery from this place tonight and it's the worst delivery food we've ever had. I'm rarely compelled to write a Yelp review but went straight to my laptop before even finishing the food. The portions are so small and while the website offered nan bread with dishes, it didn't come. They didn't do Indian or Thai dishes well. Both the Mussaman and Spinach curries were watery and the butter chicken had four or five sad looking pieces of chicken floating in a very soupy broth. The Som Tam papaya salad was filled with lettuce, which anyone who ever has this tasty and spicy Thai salad knows is not part of the dish. If an Indian restaurant is going to take on Thai food, they should learn its ingredients. Sadly, as noted, they don't seem to even know how to make Indian food. A huge waste of our money."}
{"text":"I don't write reviews. But I feel like I need to step in here and defend a new business. 

The food is excellent. I have had the same Lamb Korma dish a few times and it is delicious (not watery).

There are always growing pains and Sutra is filling a void in the neighborhood for good Indian food. 

Sure they don't have their ecommerce game together yet, and the delivery is a little bit inefficient at times, but they are always so nice and the food is great. I don't see why a 1 or 2 star review is fair or necessary."}
{"text":"I had high hopes - as a lover of hakka food - this was not close to being decent.  In fact, the noodles might as well have been spaghetti noodles.  The beef had a ton of fat.

As for the Indian food - I tried the rasmalai - clearly they have bought frozen pre-made deserts and are not making it themselves.

That said - I am still missing Lucky Chinese - and I am on the hunt for a good Hakka restaurant downtown.  

I wish Sutra the best - as it must be hard to start a new restaurant - but get a new chef and take more pride in the ingredients you choose.

Best of luck

N."}
{"text":"Worst delivery service ever. Good took over 1.5 hours to come in, no excuse as it was a nice weather day. Based on other reviews this place seems to not have any customer service experience, I won't order again."}
{"text":"So I'm giving this place an extra star because the service was great and they did constantly fill our water without us having to ask. The food came in reasonable time, and we got what we ordered.

As for the food it was O.K but nothing special. Our beef dish had a lot of cinnamon on it. I thought it tasted good but if you don't like cinnamon don't order that meal. The butter chicken was also just O.K. I was expecting more of an authentic food selection but tasted very western.

Also a couple sitting near us was complaining about their dish having way too much garlic in it."}
{"text":"Fairly new Indian joint in the neighbourhood! Friendly staff and food is flavourful. Def worth checking out!"}
{"text":"We had high hopes for an Indian place that delivers in our neighbourhood but sadly won't be ordering from them again.

Food is average if not slightly below.  Butter Chicken is okay but way overpriced, I would say that is the case with all the dishes that come in very small containers.  Yellow Daal is pretty flavourless.  Veggie Pakoras were the best part but have still had much better.

Service on the phone is rude.  \"And what else?\" is literally all I got between \"can I have your phone number?\" and \"your order will be there in 50 minutes or so\".

Our main beef with this place was the delivery.  Came on time but when we opened the bag, the container of rice was at the bottom, squashed and broken so most of the rice was at the bottom of the soggy bag.  Why was the bag soggy?  All the dishes were on their side and the Yellow Daal leaked out everywhere.  We had about half left of the already small dish.

On the phone I was told I'd be getting free curry chicken, even though I hadn't hit their $40 threshold to warrant one.  However, it came with the chicken fried rice as per the cost of our order. So now we had fried rice AND the rice we ordered... yeah.

So I complained.  They came back fairly quickly with a full container of Yellow Daal, curry chicken and another container of plain white rice.  However, the delivery guy told me they \"vent the bags\" which... yeah, huh?  Why anyone would is just nuts but that wasn't the issue, the issue was food was all over inside the bag. He then told me I should't have expected curry chicken since I didn't cross the $40 mark, to which I quickly said the woman on the phone offered it to me and gave me the option to so to take it up with her.

It's a very competitive market out there, you can't be rude to costumers, you can't serve mediocre food at such high cost and you simply can't deliver everything in a brown paper \"vented\" bag, without the proper balancing inside so things don't tip over.  EVERYTHING tipped over.

As much as they rectified their mistake, the food wasn't good enough to order again.  With Om and Mother India within driving distance, I'd sooner do pick-up with them as they are two restaurants that know what they are doing."}
{"text":"This may have been the worst dining experience we have ever had. To be fair, I think they had opened very recently and they seemed totally unprepared for customers. The restaurant was very warm, the service was very slow and the food was almost inedible. We ordered the pakoras to start and when they finally arrived, they were nothing like pakoras. When we asked the waitress about it, she simply said that this was their take on pakoras. That fine but they weren't pakoras and they weren't at all what was pictured in the menu. Things just got worse from there and when our main courses arrived my husband found his to be inedible due to the spicing. Now he likes very spicy food so this was odd but I tasted it and it seemed as though someone  slipped during the cooking process.
My advice, skip this place at all costs. We left feeling frustrated, hot and hungry."}
