{"text":"Suzie's is about as good as a family restaurant gets !  The food is great,  the whole family makes you feel at home, and it's such a bargain! 
I highly recommend the daily specials and breakfasts."}
{"text":"Excellent, family restaurant! Can't say enough about this place!  I've had the chicken paprikash and chicken & dumplings. Both entrees are loaded with chicken, flavorful with super generous portions. Fresh, crispy salad and rolls.  Seriously a wonderful find. Never disappointed and the prices are very reasonable. Better than what my Granny made!."}
{"text":"Dined here twice during summertime. Both experiences were better than one would expect, and it's because of the FOOD! Hooray for great line cooks and wise management.

My group of 40-70 year olds have tried many dishes, from paprikash to the greek salad with stuffed grape leaves, whatever we order, it's always great.

My turkey rueben was perfect! Hearty bread, plenty of JUICY turkey, grilled to perfection. The french fries come out hot and crispy. 

On my second visit, I challenged them to go off-menu and they delivered with aplomb. Having seen my wife's greek salad with chicken, I wanted a salad with chicken as well. They don't really have that- so the cook improvised with tasty results.

Try Suzie's and you'll be glad you did."}
{"text":"Went back.service really great
Food very good but when the cook (?) Left the kitchen (In a dirty t shirt) and argued loudly and angrily
about his pay we got up and left.
Too bad. I really liked this place food prices and service. Maybe too much family not enough restaurant."}
{"text":"AHHH.....Suzies, suzies bell...lol...well, the folks are great...iwner is snappy and 1 waitress who does not smile, speak, says have a nice day or more coffee?.. but the food is...food..we went for Breakfast monday through friday with my friend and saturday with the wife...well, they need to add more breakfast foods like sandwiches and stuff... but well cooked and fast...well, i spent 15 bucks a day x 5 is 75 bucks..plus 2 buck tip...and saturdays with my wifey around 19 bucks...so...94 bucks a week...then, one day a note on the menue said because of egg prices..all breakfasts with eggs are 1 dollar more...really?... well, that stopped me from going there mon - friday...then saturday i mentioned when they asked where we have been I said i thought the 1 buck extra was too much...well, she snapped and said, you pay what they charge 60 bucks a box...well, i then said well, I DID PLUS....so..went from 90 bucks a week to 12.00 maybe a sat... sad..."}
{"text":"This place needs a serious makeover!!! The chairs and tables look very ran down and the food isn't too far behind the decor.... But you get what u pay for! It's cheap and convenient since I'm in walking distance. I got the vegetable omelet and found a hair so needless to say, my breakfast was over after that!"}
{"text":"Another great, no fail place for breakfast in the Brooklyn area. 

Friggin, 4 bucks for two eggs, toast, hashbrowns and sausage? \"Hell to the yes\", says my inner cheapass.

They've also got omelettes and stuff."}
{"text":"Great service, food and price. This is my favorite place to go for breakfast. Nice and simple."}
{"text":"Not a good experience this last time. Place needs at least new chairs and tables. Most are wobbly. Had open face roast beef...which was ok. Finished, pushed my plate to the side. Waited for check for 10 minutes while the waitress stood at the counter. I walked up, and got a \"Where's the check?\" That was a first  ."}
{"text":"My favorite breakfast spot! They have home made sausage gravy that is the best around. Very small place and popular for dinner because they have dinner specials starting at $5.99. Get there early because they do run out of things sometimes. Very friendly staff."}
{"text":"I went on 5-27-14, I ordered the special CITY CHICKEN which was excellent the mashed potato's did not disappoint, the vegetables were over-over-cooked carrots which I left untouched after initial taste.  The gravy was on the salty side but by no  means too salty to eat.

The highlight was the Chicken Soup which was free with special...the soup was excellent right mix of noodle, veg and flavorful broth! 

I would recommend to anyone."}
{"text":"Continuing our tour of restaurants housed inside former Taco Bell's we came here.

Menu is prototypical diner food - burgers, open faced sandwiches, breakfast food. Prices are fairly cheap with most of them hovering around $8. Macaroni and cheese is literally from a Kraft mac 'n cheese cup microwaved.

Burger was very good, with a predominant garlic flavor. Turkey club was ok. Lemonade was very watery and probably needed to be changed.

Restaurant was quite clean and the service was excellent."}
{"text":"Garbage. Dirty. Disgusting. Waitresses with attitudes. Cooks use their bare hands to pick up everything! Even foods that normally require a utensil. Food is very plain, bland and flavorless. Not even salt being used! I had to wait for a meal that was ordered by phone before my arrival.  How hard is it to make a soft omelet and toast thats actually toasted and not just hard? They touch money and food with bare hands. Prices increase by several dollars from one day to the next. Eat here if every other restaurant in area has already closed."}
{"text":"Good food, good prices, and the staff is very friendly. There are many locals that come in all the time! They can be a little inattentive, but they are still very kind and pay attention to your order."}
{"text":"Great food! Best 2 or 3 egg breakfast specials EVER! There was a group of ladies who stopped me today to compliment on their food and said \"The Chef knows what he's doing!\" We agree! Friendly Service! Stop in!!"}
{"text":"Why did it take me so long to check this place out?? I live in the neighborhood and finally stopped in for breakfast. We were seated right away, service was friendly and attentive. I ordered the classic (eggs over easy, hash browns, bacon, and a biscuit). It came out super fast and was excellent. The perfect amount of food, and cheap! My husband got the biscuits and gravy and almost licked the plate. The interior has a comfortable atmosphere and you can tell there are lots of regulars. Chicken paprikash is the Thursday special so you can bet we will be back to check that out!"}
