{"text":"Very unique taste yet delicious! Love their noodles bowls. A small homey environment. Friendly service. Would recommend"}
{"text":"Tried their hand made noodle not spicy with ground pork. The soup is flavourful but the noodles is too thick for my liking. I should have asked for a thin noodles. The chicken with chestnut was a good complement to our noodles.  The service was very friendly and fast. The server speaks Chinese and English so ordering was easy."}
{"text":"I didn't have high expectations when I knew this restaurant from Insauga. Was surprised by their unique taste and delicious homemade noodles. Most of the Szechuan restaurants give you same taste on different dishes but this won't happen here. This becomes our favourite restaurant!!!"}
{"text":"Honestly the food here is amazing, once you go here you will definitely want to come back again. Although the decor and area may not be so intriguing believe me, you want to try this place. Also, the food is so reasonably priced! You will definitely get more than you paid for. I usually get the Sichuan noodles, spicy and I ask to substitute pork with Chinese pickle. But keep this in mind if you are vegetarian and would like to make substitutions, they are not always very careful with this. I have encountered a couple circumstances in which I've ordered something with Chinese pickle instead of ground pork and found a couple pieces of ground pork. This is probably due to the fact that they use the same spoon. For me it's not a problem I can just pick them out, but nonetheless it's something to keep in mind. The staff is friendly and the food is great. It's a cozy little restaurant where you will get good quality food. I 100% recommend!!"}
{"text":"It's ok. Food mediocre at best. In thought the places looked messy. Unkept.  Made you wonder about the cleanliness of the food then I read the other review about bug in the food doesn't surprise me.   I wouldn't go back."}
{"text":"I got the hand made noodles spicy with beef! It was great flavour and reminded me of back home in Chengdu. It's definitely not close to the spice that Szechuan is known for but it was good for the price!"}
{"text":"I was pleasantly surprised by this place! We started off with the cold noodles in chili sauce and szechuan peppercorns which we enjoyed. The peppercorns added a lot of kick and numbing spice to the dish. Only order if you can handle spicy food.   Next I had the house made noodles with pork intestines and beef. The pork intestines tasted slightly pickled which helped to cut through the heat of the spicy broth. The Mister opted for the hand-made noodles which I preferred over the house made kind. Both were wide noodles, but the handmade noodles were thinner ( similar to ho fan) and had a smoother taste.   I would definitely recommend this place to people that enjoy Cantonese style street noodle soups or Vietnamese pho. It's not as spicy as other Szechuan restaurants i've been to, but there's still a lot of flavour in the broth."}
{"text":"I ordered the spicy beef noodle soup. The broth has the perfect amount of heat and the flavours are wonderful.  The joint is cozy and the food is made quickly. I got take-out and it was ready within 5 minutes (on a quieter week-night).  I'm looking forward to coming back!"}
{"text":"This place is good, cheap and fast.  I've been there several times for the 'Sichuan' noodles and the boiled dumplings with chili oil, and I always leave satisfied.  The place is small, but I have never had a problem getting a table."}
{"text":"Very authentic Szechuan fare. I love their steamed dumplings with chilli oil and noodle soups."}
{"text":"I really liked this place and I was a big fan of their dan dan noodles. However my last experience was pretty terrible as I found a bug in my spinach noodles. I felt disgusted and couldn't even finish my meal. I will definitely think twice about coming back. Please wash your vegetables thoroughly before using them !!"}
{"text":"Went there last night before going to airport. The restaurant was frosty as the attitude of the unsmiling wait staff, maybe cause they knew how bad the food would be. I had one of their special hot and spicy soups with beef and spinach noodles. The soup was extremely greasy to point of being inedible, a few veggies and some fatty pieces of beef. Left most of it. Avoid.  P.S  The positive reviews with nice pictures are likely owner/staff reviews."}
{"text":"This place is very delicious and cheap. I came in and ordered their hand pulled noodles with pork stomach. The broth was very spicy and flavourful.   The service was very quick and I didn't wait very long for my food."}
{"text":"Small spot, came here with two other people and we got the braised eggplant, beef with onions and peppers, and sautéed chicken. We all thought that the eggplant was delicious. Nicely sauteed and oddly came with a ground beef sauce that was also very good.   The chicken was nice and looked really cool too, with lots of dried chilies served with it. What was odd was that the chicken was cut into very tiny pieces but still had the bone in so you had to sort of pick at the bones to get the chicken, which was a bit tricky. We also thought it was a bit too salty.  Finally the beef with peppers was fairly ordinary. Next time I think we will get a noodle dish as that seems like what everyone was getting, we just didn't feel like having noodles at the time."}
{"text":"If you want the most delicious noodles, you have to eat here,if you were about to die and ate these noodles you would be able to run a marathon I've never written a yelp review until now,THATS HOW GOOD IT IS !!!!!!"}
{"text":"Amazing small cozy place to have amazing amazing noodle bowl. Me and my husband ordered D2: Spicy beef noodle bowls and dumplings with spicy oil. One of the most amazing noodle bowls I've ever had. It was soooo flavourful and made to perfection. Very friendly staff. Gona come here regularly now."}
{"text":"This is a small place that has about 10 tables.  It's a clean place with an interesting decor.  We wanted something hot and spicy on a cold evening.  Also hoping to get rid of my stupid cold with spicy goodness!!  We ordered D2 - spicy hand made noodle with pork intestine and D3 sliced spicy noodles with beef, and boiled dumplings.  What an absolutely tasty noodley bowl of goodness.  The pork intestine was several slices of tender perfectly seasoned meat served with some baby greens and al dente noodles in a rich tasty broth.  The boiled dumplings while not visually appealing are a generous bowl of fresh made dumplings with a juicy filling.  It comes with a spicy dip that goes perfectly with the dumplings.  Service is prompt and friendly.  We came by around 6pm and there was a steady flow of people coming and going during the dinner hour.  I will have to dream about that magical bowl of goodness until I can slurp again...."}
{"text":"Been wanting to visit since they opened, but never got around to it until recently. It's a very small restaurant, and they didn't have any heat on so some people still had their jackets on. It wasn't that big of a deal because we warmed up pretty fast. The waitress was really nice and served us in a timely matter.  My boyfriend and I both got D2. homemade noodles. We chose spicy broth, I chose beef and boyfriend chose pork intestines. We also got dumplings with chili oil on the side. It didn't take long for our food to come out even though it was a full house.  We were insanely satisfied with our food. I thought the broth was going to be oily because of the chili oil, but it wasn't even close to it. The broth felt light and was full of flavour. The handmade noodles were delicious and had a nice chewy texture to it. The beef and pork intestines were good as well. The dumplings portions was a lot larger than I expected. They were extremely juicy and went well with the chili oil.  I would come back to this place and would highly recommend it to friends."}
{"text":"I had the large hand made noodles that came with an assortment of meat and noodles. The noodles were very well made and there was a good amount of meat included.   However, broth was too salty.  While I really appreciate the concept and I think they will do well for those who like high sodium levels, I'd be slightly hesitant to come back.  Great noodles though."}
{"text":"Called in and ordered food at 20:16 today, got my food at about 21:00. The food was 20$ plus 5$ delivery fee. When I opened the package, there was no chopsticks or forks, nothing. I called them at about 21:16, and told them what happened. The girl who picked up the phone told me she would ask somebody to send me chopsticks. I went downstairs and waited for about 30min. The last call I made at 21:46, the girl who picked up the phone told me they can't send anything to me because there is no driver. I was not mad until she asked me to look for a store to buy forks. I just got to Canada for business this afternoon, and stayed in hotel. I don't know anything about where I am. It is almost 10pm and she asked me to walk out to buy forks which I should not worry about when I order food. I told her that I've been tried to ask the hotel to give me, but their restaurant was closed. And I don't really want to go out to look for store!! She said, then you'll have to wait until somebody working in the restaurant gets off work at 22:00, and walk to my hotel to give me chopsticks. I never had any experience like this even when I was in China. If I can find a way to solve this, I wouldn't even make the call. I'm very disappointed about what they did and how they solved this problem."}
{"text":"eaten there twice.  first time a couple month after they just open, they r really good. Owner is quite courteous. food is surprisingly awesome. atmosphere is really cozy and comfortable.  returned this year. totally different. the portion size is smaller, taste is going down. feels like the chef substitute high quality spice with inferior one. worst of all, we order the hot pepper chicken, paid 14 bucks for it. there r few dry up chicken thigh with bones, rest r all peppers. what heck, such a ripoff!  will never returned. Owner is only there to make a quick buck with no long term vision. soon they established a group of Students customers base (yes, most the customers r students nearby), they dont care anymore"}
{"text":"Finally some legit Chinese noodle place in Mississauga! I ordered the Spicy Hand-Made Beef Noodle. The noodle is very chewy and it's cut in short pieces, so you won't splash your noodles all over the place. The broth is numbing spicy, at first it tastes great, but after a while it does get a bit salty. It also comes with a complimentary Chinese kimchi. Service is great, the waitresses are very friendly. I would definitely go there again!"}
{"text":"This hole in the wall place I would never have known if I wasn't told about it.   This place is usually packed with Chinese people so it's got to be good.  We both ordered hand pulled spinach noodle soup. Mine with minced pork and his with beef.  Delicious! You have the option of getting it spicy or not. I only do slight spice coz spicy was too spicy for me from a previous visit.  I also love their boiled dumplings with chili oil.  Place worth trying!"}
{"text":"The food is delicious and the service friendly. Get a bunch of dishes and share so you can try many things. I wish we had tried more."}
{"text":"Handed.pull noddle is my favourite. Nice and spicy a little be on the oily side. That is ti be expected from szechuan cuisine. Beef and intestine are my favorite sellection of meat.  Place had its own parking within the plaza. Very convenient. Place kinda look like it stuck in the 1980. Kinda look like an old school Chinese  restuarant."}
{"text":"Amazing flavours! Love the authentic hand made noodles. I dont mind spicy foods but the spicy beef noodle bowls has the perfect amount of spice and flavour thats not overwhelming to the taste. Definitely my new favourite comfort food for the winter time."}
{"text":"Love this spot. Very traditional. A bit hesitant on trying some of the \"non-commercial\" menu items but so far everything that I have tried has been amazing. The House Special noodle bowl is fantastic, definitely one of my favourite soups ever. Try the broth as spicy, the noodles remind me of pasta noodles and are super soft. This is definitely one of the \"go-to\" favs in the area if not the city! Try it out, you won't be disappointed!"}
{"text":"Definitely one of my favourite noodle places in Mississauga! The location may not be the best but the food is yummy and satisfying. I always get the spinach noodles which are always cooked al dante and just to note, the spinach noodles are limited each day to 20 bowls (as indicated on the menu).   The noodle house has various noodles to choose from- handmade noodles, spinach, sliced noodles, rice vermicelli, Szechuan machine made noodles, tan tan noodles. You can choose the spiciness of the broth and the topping. The toppings available are pickled vegetables, beef, pork intestines and minced meat. As mentioned, I typically get the spinach noodles but my friends enjoy the homemade noodles and the rice vermicelli. The vermicelli here are the thicker type and not the typical thin ones. You will not go wrong with any of the above choices! The portion sizes are either small or large and the spinach noodles is just one size. We also like to order the wontons in spicy chilli oil. This dish is fragrant and delicious and there are roughly 15 dumplings- good portion size.   Other than noodles and wontons, there are other dishes to choose from. The plaza itself has limited parking and the restaurant does get full quickly. Prepare to wait but well worth it!"}
{"text":"We are the regular here. We both love the dandan noodles and spicy handmade noodles soup and these are what we always order. The portions are good, love the taste, prices are reasonable. However, dont expect any good services from here. The owner only hires students in the front they are not so attentive. Overall, food is great!"}
{"text":"I definitely would've given a much higher rating if the food isn't that heavy and unhealthy. Obviously, this comment is very subjective, but don't take me wrong, the taste of the noodles and dishes here are authentic and there is no other restaurant in Mississauga offering the same style.   My partner and I ordered two different kinds of noodles. Mine is the special hand-made spinach noodles with beef, as stated on the menu, this special noodle type is only offered in limited quantity by daily basis. As you may find in the photo related to this visit, the colour of the spinach noodles looks very bright, it actually makes me very uncomfortable and doubt if they put any artificial stuff in the flour to make the colour (I am just guessing but hopefully it is truly made by real spinach). My partner had the hot special sliced noodles with the Chinese pickles. Her comment is that she likes the spice level and enjoys the overall flavour. The side dish we ordered was also very special. It is called Sliced Dry Lettuce Root. We never had it till this visit. We highly recommend everyone to try it out. You won't have it at other places.  As you can see I give a somewhere positive comment above. The only factor holds me down and rates it an average is its unhealthiness. If you look it in all three photos I took, you can easily see the red spicy oil floating on top of the soup base and at the bottom of the side dish. Apparently, I don't directly drink this liquid but it is very sticky on food. Thus, no matter we had the noodles or the lettuce roots, we can't get rid of the oil but eat it along."}
{"text":"They fed us chicken feet without telling us. I have never been fed chicken feet before, with the bones! Worst Chinese restaurant  I have ever eaten at in North America. I can never eat here again. Ruined my day."}
{"text":"After trying the hand pulled noodles here, I really don't know if I'll ever be able to compare hand pulled noodles anywhere else. The flavour of the soup is incredible and not overly spicy. It has a nice, peanuty taste with the perfect amount of spiciness. It was a very unique broth that I haven't experienced elsewhere. The noodles are so soft and wonderfully chewy. I didn't think I'd be a huge fan of the thickness of the noodles but it was absolute perfection. The noodles also came with a generous amount of meat which is rare to see at noodle places especially the ones in downtown Toronto. The house special fried noodles are also incredible and perfectly seasoned. This place truly makes me appreciate the GTA and how amazing and diverse the food is here! The food is very legit and well worth the drive over :)"}
{"text":"Love this place. It's in a small ghetto plaza beside a funeral home but the food is fantastic. Prices are reasonable as well. It's usually young kids serving us but they're pretty nice and can speak English. I totally consider this a hidden gem. They have tonnes of specialty noodles and the ma la spices are super well balanced. Don't be afraid , it's not that spicey at all"}
{"text":"a small haunt in a small plaza serving up szechuan goods from a rather small menu.  i showed up here last night with pretty high expectations as it has been at the top of my mississauga to-try list for a long time, and i was not disappointed one bit.  the spicy hand-pulled noodle soup is hands down the /best/ bowl of soup i've had in the city.  the broth is incredibly fragrant and tasty, loaded with garlic, chili, and szechuan peppercorns.  the noodles, while being pretty damn heavy, are thick, chewy, and fun to eat -- think slightly chewier than al dente.  i like that they have pork intestine as an option for the protein, but they have less adventurous options such as beef for you boring people.  the icing on the cake is the $8 price tag for this very hearty serving of food."}
{"text":"I was pleasantly surprised when I happened upon this place. Tasty dishes, affordable, and clean. Minus one star for the servers not tying back their hair and failing to remove finished plates from table."}
{"text":"I seriously couldn't expect a chinese restaurant opened in this location. I passed by many times since June and didn't notice it.  The waitresses were friendly, and one of them could also speak cantonese. She was willing to explain their menu and suggested which dishes were more popular. There were limited tables inside. The service was speedy. I have to say their food was pretty good. The noodles weren't over cooked. The dishes weren't shy on the tasted. Their were enough spices and spiciness to them. They were a bit salty but I think this is the szechuan style and it is supposed to be like that. If they cut back the saltiness, it won't be the szechuan style.  I would definitely go back and try their other dishes"}
{"text":"Probably authentic, as clients are from Mainland and servers speak broken English, but I think the food is just too heavy for me.  I got A2. Handmade Noodles \"Spicy\" in Soup w/ Beef, but this is not really soup you can drink.  Unless you like drinking oil...tasty oil.  There was a thick blanket of oil coating the noodles underneath.  Noodles were a bit undercooked.  The cow probably died of old age as it was tough and grisly.  I don't want to totally slam them 'cause it's probably authentic, just \"off day\"/not really my thing."}
{"text":"Very tasty soups with lots of flavour and spices. Very fresh handmade noodles that have a springiness to them. The appetizers are good too. Beats all similar noodle spots in GTA thus far and I've looked around trust me."}
{"text":"Visited on a Saturday night with my partner and it wasn't too busy. We had D2 the spicy hand pulled noodles with beef but there was barely any beef and not spicy at all. The noodles were nice and chewy.   The reason I gave 2 stars is the service was severely lacking. Two tables that came after us received their food before we even ordered. The waiter asked us what we wanted to drink but he forgot and we didn't receive our water until another staff member noticed. I ordered D2 and my partner ordered D3 but one of the servers made a mistake and served us both D2. My partner was tired of waiting so he ate it anyways. The staff noticed once they brought out D3 and they apologized.   Overall, food is decent but the service was awful. There's better places for hand pulled noodles."}
{"text":"Best soups around with a large veriety  .most authentic of them all@xxxxxxxxxxxxxxxxx"}
{"text":"Came for lunch - only takes cash or debit. Had the hand pulled noodles and Sichuan wontons. I am a Sichuan native, and would say this food is pretty good. Not the best, but works as a taste of home  Noodles were immaculate - perfectly done and chewy. Overall, wished noodles were more spicy.  Also the potatoes they gave for a side dish were too starchy and not crisp."}
{"text":"I came here a few times and I would always get D2 Hand-made noodles with beef, spicy. The broth was very flavorful and wasn't too spicy. Good portion size for the price $7.99. We come here for hand made noodles when we don't want to drive all the way to Toronto or Markham."}
{"text":"This is a tiny little restaurant in a small plaza, so although there's limited parking, I've never had any problems finding a parking space.  I've been here a couple of times and I always order D3 which is the spinach noodles in the spicy broth.  I don't really have a tolerance for eating spicy foods but this broth is so fragrant and it tastes amazing.  Since I can't really eat spicy, but love the taste of the spicy broth more than the non-spicy, I usually ask for an extra bowl to scrape out some of the chili oil.  This way I can have a tasty broth without the heat overpowering everything else.  The noodles are nice and chewy and the portions are very fair for the price.  I've also had the regular hand made noodles which are also just as delicious.  I would definitely come back again."}
{"text":"I think this is my favourite spot for hand pulled noodles, it's even better than the places in Markham/Scarborough!! I love their spicy hand pulled beef noodles, even their spinach noodles is bomb."}
