{"text":"This is a great place. While the burgers and souvlakis are excellent what me and my family really love is the fish along with their greek salad. The fact that they're greek helps! Great stuff. Friendly local folks."}
{"text":"It was my first time trying this place.  They have good selections of food; fish, wraps, burgers, salads, the list goes on... I got the souvlaki chicken wrap and I must say its pretty good! Price was worth the taste!  Good place to stop by after long hours of studying at the library.    Il come back for sure!"}
{"text":"i love mom and pop owned places, burger joints, pizzaria's etc....but this one missed the mark for me.  i recently moved up to Aurora from Markham and this pales in comparison to Tom's burgers.  i've only been there once and i might give it one more try (i really don't like writing negative reviews) .... I think they're Greek or Macedonian owned like alot of burger joints in and around toronto, so as you can expect the people are friendly and the prices are reasonable, and of coarse the decor hasn't been changed since the 70's..... if i go back i'll write another review, wish me luck!"}
{"text":"I ordered burger and fries , no drink. It took over 15 Minutes to get my lunch. The fries were great and the pre processed burger was large and cooked well but the bun was only warm so a bit mushy. I didn't eat it all just not my  cup of tea. Also the price was over $ 7 so a little expensive for what you get. I will get my next burger from a chain that provides better quality and much better price."}
{"text":"My kids eat here all the time so today I decided to have a cheeseburger. It tasted delicious. It's a family business with very reasonable prices. There's a good size menu that includes Souvlaki, Fish & Chips, Sausages...do if you ever in Aurora, Ontario give these guys a try. I hope you enjoy their food as much as we did."}
{"text":"Huge burger which was delicious.  Fries were a little underdone but I usually ask for well done and didn't.  Service was friendly and fast.  Would go back!"}
{"text":"Good burger, don't think it's home made, poutine was ok nothing to brag to my yelps about, I wouldn't class this as a great burger joint more of a greasy spoon wanna be  I will say service was good"}
{"text":"I must say I was looking forward to trying this place out for some fish and chops and burgers and was a little on the disappointed side.   Overall it wasn't a bad experience, but average at best. I had the fish and chips, the fish looked like it was gonna be awesome cooked to a nice golden brown, as I cut into it I found the batter to be a bit too crispy than I personally prefer. As well I found that the batter retained quite a bit of the oil which kinda killed the flavor of the fish. I did appreciate the the fish was a decent size and not all batter with a sliver of fish. The portions of everything were a real good size.   My wife had the burger and I found it very average, I was disappointed to see they weren't made in house, but were a generic frozen burger instead.   The service was friendly and everything made to order right in front of you which is a nice touch too.    The atmosphere is very Canadiana, hockey jerseys and memorabilia coat the walls and the choice of colour is nice and not flashy, comforting and subtle.   I wouldn't be opposed to going again, but I don't think I'd go out of my way to do so."}
{"text":"I've been coming here for the last 15 plus years on and off.  It's been consistently great.  You get a better product than fast food chains, at a better price.    I always get the hamburger combo for lunch.  The toppings are fresh and you can see them cooking your food."}
{"text":"Great local spot thats easy to miss. This place is a hidden gem on the busy street of young and Wellington. The burgers are fresh and cheap, the chicken souvlaki is to die for a must try from this spot. Its moist and tender, the tzatziki and fresh veg makes for a great meal. Make sure you get it on one of there fresh pitas !"}
{"text":"Every town have their own favourite burger joint.. Markham has Tom's Burger, Thornhill has Golden Star, Scarborough has Johnny's. Aurora has T C's!!   T C's Fish & Burgers has all you hope for at a greasy spoon: burger, hot dogs, chicken wings, fish and chips, souvlaki.   Though this place is more like a takeout joint but do have ample seatings if you do want to stay in! But all the food are served in paper plates with plastic utensils can be hard to cut the fishes.   4 oz burger/small fries/pop ($5)  - A great value!! I dare to compare to the Hero Certified Burger I ate last week.. This is so much more taster! The patty is moist and tender and nicely cook with grilled mark! I can see the open flames occasionally from the grill!  - Nice fresh toppings and have a choice of regular or whole wheat bun  - Fries are nice and crispy on the outside   Halibut Fish ($6.50)  - great tasting and light batter.. crisp and crunchy  - Halibut Fish did get dry... maybe Haddock will taste better? Since they do offer choice of Haddock which is a little cheaper.   Nice, friendly atmosphere. Seems like most people that dropped by for quick bite or takeout are regulars.. what a good small town vibe!!"}
