{"text":"i was looking for a place that sold real Mexican tacos. so i ask a friend and told me this was the best place in town. and i agree. the burritos where not that big but still good. now the tacos where amazing. best in flour tortia."}
{"text":"So good.  This place is true to their motto... It truly is one of the best carne asadas around.    asada parillada da perfecto con puro sabor."}
{"text":"Skip Filibertos and all other -\"bertos\" for that matter. Next time you are in the mood for good, authentic mexican tacos go there! Their meat is tender and tasty. There is a small salsa bar that in my opinion could use some beans to complete the meal. But maybe thats just me. The salsas are good and the restaurant is clean. Only one restroom for both males and females. The staff is friendly, short wait time, the menu is affordable and they have indoors/outdoor seating. There is no Koala-care station for babies. But the food is amazing, I promise."}
{"text":"The food was god but really could not enjoy it to the fullest because of all the flies..there were so many flies inside and outside.landing on the uncooked food.. The guy sitting next to the meat made no effort to get the flies off the raw meat ... they really need to get that under control.."}
{"text":"great food and environment..  I enjoy the food !! Burritos are good !!!!!!"}
{"text":"Love this place from the food to the atmosphere its great. There tacos are so good and homemade torillas. Also there toppings bar is the best one ive seen in awhile."}
{"text":"Excellent! Authentic Mexican food. By far the best Mexican food I've ever had (hometown is Philly so maybe that's not saying much). Their plates are huge portions and so delicious. Great service! I could've ate there every day. I will absolutely be back on my next trip to Phoenix."}
{"text":"Carne Asada is on point! I want some now just thinking about it. I live in Surprise and come all the way here just to eat there food. Tacos & burriots, BOMB! Something so simple done right. Just carne asada. They have other items and stuff but i just come here for the carna asada. Plate thats feeds about 3, $15. Think its a pound of carne asada and like 15 tortillas...Great value."}
{"text":"Very amazing food! This was my first time here and I felt right at home when I bit into my food! Don't worry everything here is good and you won't be disappointed!"}
{"text":"Excellent salsa options. Tripas and pastor tacos were excellent, prices were good. The meat by the pound is a great deal."}
{"text":"Food is amazing!!! Staff is great!!!!! Place is clean!!! No loud music. Needs to expand though. Place is way too good to be so small."}
{"text":"this place is really, really good. there are lots of places like this in phoenix/tucson - i've been to many - and tacabron is in the top tier. their salsas aren't the best, but the menu items are excellent and the prices are in line."}
{"text":"I fuckin love these tacos. In my opinion the asada & barbacoa are the best. The salsa actually has flavor...good plain avocado sauce.   Very cheap & fast yet food is hot!   I am literally willing to drive 45min from the east valley for them..while flipping off all the gross filibertos on the way here.."}
{"text":"This was without a doubt the worse restaurant I have ever eaten at. I would highly consider never eating here. Asada was fatty, customer service was terrible and I didn't receive what I ordered. I would of rather ate at Quiktrip down the street and had their hot dogs from weeks old (thats an exaggeration) but save yourself the trip and keep driving."}
{"text":"I recently went in to place an order for a meeting staff lunch, the manager was rude and acted like he didn't have time for me. I placed a $100 order and he treated me like crap. Good is good but won't go back because of him. He wouldn't give me plates in fact he sold me plates."}
{"text":"If ur looking for street tacos; this place will do! Got the family pack carne asada ($16) that came with 15 yummy mini flour tortillas.  The carne asada was good. would've loved more marinade in it. And just to feel like I was spring breaking it up in Mexico; got some coronitas. ($1.80 each) The setup is a lil awkward when ordering; kind of cramped and you don't pay until you get ur order . Outside patio was perfecto with music pumpin'. Everything is served up in styrofoam; so ur gonna have to sacrifice the environment people!,  for some yummy food.  Dress: anything goes, from jeans to ladies in their cha cha shoes and piñata dresses  :-\"}
{"text":"This place has the best tacos that I have ever had.  It's hard to find and doesn't stand out, but I'm glad a coworker told me about this place."}
{"text":"This place wins me over every time.  Can't go wrong with any meat but the carne asada is Sonoran perfection.  Their salsa bar is small but packed with goods.  What amazes me is the same guys continue to work here EVERY time I come.  Seems like family.    Always feels strange to not pay first when ordering but you'll be glad you haven't cashed out when you go for seconds :)  I give em 4 instead of 5 stars for their awkward standing around bumping into each other waiting for your name to be called.  Better to look or listen for a number on intercom."}
{"text":"Went twice this weekend. Everything was amazing. Everything. Cabeza and lengua are musts. The red salsa with black pepper is totally unique."}
{"text":"Best. Lengua. Ever.  Carne asada, barbacoa, frijoles, and salsas were dope too.  Add in a tacate, and it totaled $12.  Amazing food for an equally amazing price."}
{"text":"This is the spot if you're looking for a dive with amazing tacos. No frills just really really good food. Real tortillas!"}
{"text":"Lets talk about TA CARBON. Found this place through yelp on accident and glad I did. On the outside just looks like another old strip mall building. Nothing flashy,new or shiny. Walk in first thing you see is the flames from the grill with the meat sizzling and tortillas being warmed up. YOU CAN NOT GO WRONG WITH ANYTHING ON THE MENU. So many choices with everything tasting great! Great flavors with many choices of salsa from the salsa bar. THERE IS NO OTHER MORE AUTHENTIC MEXICAN RESTAURANT THAN TA CARBON!!!!!"}
{"text":"The best beef/carne possibly in the US. I've had mutliple joints in Southern California and this was my first time trying one in Arizona. I'm assuming Tex-Mex can't touch this although I'll admit I know nothing about Tex Mex. I consider that a whole different type of food. If this is the best carne in Arizona, this is just as good as it gets."}
{"text":"I have been looking for a restaurant that would make tacos like back home. Coming from a person born in Mexico, this place tastes like home. By far the best Carne Asada Tacos i have tasted here in the States. I would have to dry back to Mexico to taste real Carne Asada Tacos but not anymore. Forget all them Betos places, this is the place to eat real Carne Asada Tacos and Burritos. Place is a bit small, they do have a patio area but in this heat, please. I look forward to bringing the rest of my family over ASAP. I know they will love it just as much as I did."}
{"text":"Best Must have tacos in all Phoenix. Great Sonora style grilled carne asada... it's the most descent carne asada in the state."}
{"text":"The employees were very kind to us (even though we came as a big group of 10+ and it was like 15 minutes until closing time) They were very patient and the food was muy delicioso! Tip: get the platos if you want to eat a lot of tacos- better deal) THANK YOU TA'CARBON, I will definitely come back!!!!!"}
{"text":"The tacos were amazing and they were cheap! I've tried a few places in Arizona, they've all been double the price and they're not as good as this place! Highly recommend this place!"}
{"text":"This place is bomb.com!!!!! Very reasonable prices with many options. Pure Mexican food not at all Americanized! I would highly recommend this place to any meat lover!!"}
{"text":"Loved it! We had tacos - carne asada, al pastor, lengua,  tripas and shared a large (flour) quesadilla. Everything was very good. A LOT of meat on the tacos and super cheesy quesadilla. Loved that tacos are served plain so add ons from the salsa bar are completely up to you. Salsa bar has all the usual fixings including a variety of salsas. Very reasonably priced. Very casual place. Highly recommend."}
{"text":"Chuck, with Chuck Mosher's Hauling, saying, I Love the Large meat and cheese , steak , crisp ( Grande' Caramello) , they are the main thing, I go there for !  very good, with a plate , to go, from the Salsa bar ! :-)  Hi Gilbert, and , all the guys , at this location, are Great !"}
{"text":"Best carne asada on the westside of Phoenix! Never had a bad meal. I usually stop by for lunch, but went in for dinner one night and there were even what seemed to be high school kids playing as mariachis. They have an awesome salsa bar. My favorite spot. Best in the westside! Bravo! Mucho gusto!"}
{"text":"My wife had dinner, and, let me add that she is ultra critical of carne asada here in the States. Her standard is set by carne asada in Sonora which, admittedly, is very tasty. She said the meat is comparable!  Like: Lorenza - a bit small but very tasty, the beans are like in Sonora! Cleanliness  Wish: A few more around Phoenix"}
{"text":"Awesome street tacos. Can get a little busy because food is so good but other then that great place to go for great mexican tacos"}
{"text":"Best carne asada tacos in Phoenix  , place is clean ,  fast and friendly service , they have a salsa bar 7 different salsas"}
{"text":"Tacos here are good because of the meat and the small flour tortillas which make them the closest thing to the real thing (mexico street tacos).  The bar with the salsas and other condiments is well stocked but the \"water guacamole\" and the veggies are not seasoned well and don't complement the tacos very well.  Place is always crowded which means tacos are good, just don't expect a quiet comfortable dining experience because you will be rubbing elbows with people.  If compared with Mexico tacos this place falls short, but compared to everything else around here in Phoenix, this place is pretty good, top 3 taco places in the city that's for sure."}
{"text":"Best tacos in Phoenix. The pastor are my favorite. Its kind of in the hood but the place is worth it."}
{"text":"This place was amazing!!!! Great tacos. Highly recommend!! It was like being at a Mexican taco stand without the stand. What a find!!!"}
{"text":"Great little taco shop.  Excellent carne asada and a great salsa bar.  They also have roasted jalapenos which was a huge bonus for me. There refried beans were tasty too."}
{"text":"Really really good food. Great place. Tacos where delish. I had tripa which incase you don't know it's guts. Grilled. Amazing"}
{"text":"Carne Asada Burritos  Tacos de Pastor  Salsa Bar Bean & cheese burritos  Seats available  Price"}
{"text":"I walked into Ta'carbon this mid-Sunday afternoon as a referral from a Hispanic friend,    \"You want real Mexican food, then go to Ta'carbon.\"  So there I went. It is a Mexican fast food (comida campesina) restaurant. We walk in around 4pm and  it is packed. We overhear that is normal. I look up at the menu board that is right above the front counter. The menu is in Spanish with English subtitles I inwardly smile and think,  \"how appropriate.\" having lived in Mexico I don't particularly notice the language difference,  but on seeing the menu I  look around and realize the clientele is almost 100% Hispanic. Me and one other the exception. I think,  maybe this restaurant does serve real Mexican food. My anticipation meter subtley rises.  I look up at the menu board and decide right away to order one of my favorites, Tacos al Pastor. When I resided in Mexico City for a few years that dish was a perennial choice. I would be able to judge well the quality of the Ta'carbon food with my previous experience with these tacos. I told the wife (the Sinaloense) to go ahead and order for us. She enjoys organizing things, she took immediate control and starting working the ample salsa bar while I went to find an available table. It was crowded so I worked to find one. There is a nice selection of salsas a cream green smooth and light,  a tomatillo with a little bite and two reds with a moderate and a heftier spiciness. The condiments are fresh and tasty.  After the Sinaloense finishes setting up our condiments I begin to feel perplexed. The restaurant patrons are quiet. It's noticeable. It's strange. I learn back and take in the restaurant's panorama. What is causing this quiet ambience? There is background music, mariachi,  of course, it is ubiquitous Mexican white noise,  the perfect element for Ta'carbon. The eating area I is a little hot. There are four ceiling fans: two are silently whipping around, one is limping along and the last one is on an extended siesta. Mexico!  It's warm but not overly so and more importantly the clients don't care,  they keep streaming in. The serious quiet attitude of the patrons continues to intrigue me. Then I notice it. I see the source and am surprised. The source of the seriousness flows from the countermen. The behind the counter team is absolutely unique. Being a gringo l am accustomed to the tried and true clutch of obsequious smiles and attitudes of wait staff. In Gringolandia that is what consistently works - this is not Gringo Land. These boys in matching red polos are serious about what they do and they express it in every move and motion. They move in an almost militaristic precision with their only strategic objective as pure customer satisfaction. In dealing with the customer they are completely focused, serious with no hint of a smile or obsequiousness and they treat everyone exactly the same. In walks a young Latina with every curve perfectly placed as she saunters up to the counterman he focuses completely on her order his eyes stay fixated on her eyes. He's utterly professional what a relief it must be for the customers to know that everyone from olive cleavage to octogenarian dentures receive the same exacting service. The countermen could be aptly described as the Mexican cooks 'Seal Team' Red; dedicated, disciplined and focused. This professional quiet aura is transmitted to the customers. It's magical.  The tacos al pastor arrived,  they were delicious not dry, but moist.  The small hand - made corn tortillas were on the side just like Mexico City tacos. The tacos come desegregated allowing one to construct them as one wishes. So the Sinaloense and I happily constructed away. She drank an agua de limón and I had Senorial,  an excellent Mexican soda just right for tacos.  As we got ready to leave after such an intriguing experience and a sumptuous meal I saw a sign on the wall,  it read,  ¡Viva México! Roughly translated it means,  Long live México! I left the restaurant thinking,  \"Yeah, viva México and viva Ta'carbon!"}
{"text":"Beer selection: 7 oz. Bud Lights? Lose 1 star. Awesome salsa and toppings bar. Add 1 star. Excellent tacos pastor. Add 1 star. Barbacoa. Asi-asi. I'll be back for more tacos pastor, but I'd sure like a 12 oz. Negro Modelo with it."}
{"text":"We decided to go to Ta'carbon based on previous reviews. We were surprised to see that there is an outdoor/patio area were we could eat.  The inside dining area was very small but the patio for a nice dining area.  There were mostly people ordering to go but we placed our order and were called about 8-10 minutes after. Not bad, but then again we weren't in a hurry. There were 5 of us and we had a little if everything. I tried the pastor(pork) and barbacoa (shredded beef)tacos on flour tortillas and loaded them up with cabbage, onion, cilantro and lime. The barbacoa were very good and my favorite.  My son had a caramelo which is a quesadilla with grilled steak pieces and he really likes it.  My daughter and husband had the tripas tacos and they both thought they were good but a little salty.   My husband had lengua tacos (beef tounge) and he said, and I quote ,\" they were awerome!\". Alas, he also had two huevo de borrego tacos( get ready...sheep testicles).  They were apparently juicy and tasty. I'm glad he got his fill at Ta'carbon because there's no way I am touching sheep's testicles!  So in closing, there are lots of choices and the prices were very, very reasonable."}
{"text":"The best carne asada in town. I have to give them however 3 stars as their service is extremely disorganized. There is no line to order & if your taking your order to go is best if you just call ahead as on the weekend their waiting times are ridiculous. A bigger locale and more organization would do this business wonders. I will still come to get my carne asada fix but I sure do hope they expand to another (bigger) locale soon!!"}
{"text":"Great place to go if you want real carne Asada and its too hot to grill outside.  Closest to authentic Mexican food in the area."}
{"text":"Best carne asada tacos around. I work a few miles away from here and we usually eat this at least once a week. The Asada plate is good, and the Alambre plate is even better! These guys are quick, have a great salsa bar, and consistently make really good food!"}
{"text":"Hands down best tacos in town. The carne asada tacos will remind you of Mexico. Give it a shot, you won't be disappointed."}
{"text":"Best tacos hands down. I can go on and on with this review but ultimately you have to try it for yourself. What are you waiting for? Why are you still reading this? GO! NOW!!!"}
{"text":"If you want real authentic tacos,frijoles puerkos and REAL (not powdered) horchata this is the place to go! The staff here is super fast compared to the flood of orders they get and how busy it gets. They have REALLY good salsas and the tortillas are always warm. The downside is this place is always busy and seating is limited so its best to just take it to go, because it does tend to get loud. Other then that this is by far our favorite place to get take out on the weekends."}
{"text":"Really good and authentic Mexican food.  Nice blend of fresh and up to date with authentic Mexican food!"}
{"text":"I had to give them 5 stars, service was good food was amazing I will be recomending this place to everyone and will be comming back."}
{"text":"Legit tacos.  The real thing.  No idea why there arent 1000s of reviews.  They were gobbled down by all."}
{"text":"Food was good reminded me of the backyard taco stands from back home in socal. However the customer services was awful! The manager and workers needs a course in communication because they were beyond rude! How can you treat someone with disrespect when they are coming into your restaurant and giving you business for the first time because they don't know the menu? They only offer asada and pastor tacos with a side of shitty attitudes, enjoy!"}
{"text":"Best tacos in town, by a long shot! If you are in the area and want a quick bite to eat, look no further. Although it constantly stays busy, they still manage to have your food ready in no time! They offer a wide array of meats to choose from, my favorite being the \"Pastor\" which is a marinated pork. They also have have to go by the pound, so if your in need of last minute catering give them a call!"}
{"text":"Best tacos and quesadillas in town this is the closest thing to any taquerilla in Mexico  especially  Sonora."}
{"text":"Great carne asada, beans & corn tortillas. The salsa bar is unreal and the prices are equal to Taco Bell. They need more locations!  Thank You"}
{"text":"I just went here for my second time and am still in love with the Carne Adada Tacos. I usually add lettuce, onions and cilantro, avocado sauce, and lemon juice. It makes the Carne Asada taco to die for. I recommend this place to anyone who loves a satisfying Mexican food meal. Will definitely being going back again."}
{"text":"Yo tenia tiempo q no compraba hoy compre un plato de asada cuando llegue a my casa me di cuenta q tendria q comer tacos de cebo o pellejo la carne bajo la calidad de antes la mitad de la carne era pura basura"}
{"text":"Great Food, great prices. Would definitely recommend. Carne Asada burrito has an awesome flavor."}
{"text":"It was a nice place to go when they started this business a few years ago but this last time i noticed that they started  using cheap tortillas from your local store and less meat per taco!?... other than that the horchata is bomb!"}
{"text":"This place is AMAZING! I have never had tacos this amazing in my life! The place is pretty small however it is very crowded! I understand Why it's crowded the food is delicious! I ordered three streak corn tacos and I was in heaven! The tortillas were soft and the steak was juicy and well seasoned. Can't wait to go back!"}
{"text":"Best tacos de lengua and quesadillas ever! But be ready to wait- no matter the time or day, this place is always PACKED! The guys are really quick to take and make your order but the tiny space makes it a little tough to stand around. But it's definitely worth the minor claustrophobia because the food is always excellently portioned and full of flavor (just like your nana makes)!"}
{"text":"Asada tacos were excellent.  Went here for lunch today with co-workers and will definitely be returning soon."}
{"text":"This place is legit. I was visiting the Phoenix area and happened upon it by luck. It's the kind of place where people go to experience bold and fresh flavors, particularly the locals, and it was pretty busy the entire time my family and I were there. The Mexican restaurant next door was dead, and this place had a full lot. That says it all for me. I had a medley of tacos---overflowing with meat---and if I didn't have a couple of tired young kids with me, I would have eaten about 15 more and then collapsed in the corner and died a happy man. All the meat was delicious. And none of the sauces were labeled, which made me feel like it was even more legit. They were very fresh and flavorful though. The food was inexpensive: I got 7 tacos, two beers, and sides (to include jalapeños) for $17. Loved it."}
{"text":"The best tacos in town! You want authentic street tacos? Come here. Friendly people and always busy for a reason."}
{"text":"Really good Mexican food. Felt like I was back home in Cali at a good mexican restaurant. My kids loved it as well. We would be back."}
{"text":"Holyyyyyyyyyyy hell! If you are in PHX and you don't stop here, punch yourself in the face. Best food I've had in months and that's not just Mexican; that's food in general. Gonna climb a mountain and scream about how great it is! Only ting I can complain about is they were out of cheesecake so I said to gimme the flan.... out of that too. But of course they were, the place is amazing! I was only person in line and by the time I got my food, the line had 12 people in it. The food was cheap and quick. Cost me $8 for three big tacos and a Mexican orange Fanta. They also gave me a plate that was literally full of cheese cause I asked for side of cheese. Omg!!! Stop what you're doing and come here now!"}
{"text":"This place rocks. Food service where great. The place was packed and the people where all happy and good vibe. First time there and it won't be our last. My co worker said it was good and the real deal for Mexican food. The whole meal was less then $25.00 bucks with beers. Best of all was the mariachi band wondering the restaurant. If you want the real deal then this is your place"}
{"text":"Great food, Simple and well done. Like a taquito stand in Mexico except inside a building. Keep up the great food."}
{"text":"Best carne asada! Marinated. You legit need nothing else to go with it. Bean and cheese burrito also! Recommended! Street tacos are beyond!"}
{"text":"I came here one afternoon for lunch. When I walked in I was struck by the immediate thought of, what kind of shit show is this? No line? No order? 3 dudes standing at the counter with pads in there hands but only one writing anything down? People are dodging,  darting around, some wait in the line, some do not..? I had no clue where to even begin. I finally found out who was just standing In the center of the restaurant and who was in line and placed my order. The guy looked so shocked at me for ordering in english I thought he was going to throw me out. He finally took my order and I began waiting. I waited for 46 minutes for my three tiny street tacos (although they smelt amazing I must admit). At that time I realized guess what, I had better leave so I can get back to work in time! So the imaginary tacos that I never got to eat were amazing! Thank You Ta Carbon! Great tacos!"}
{"text":"My wife and I love this spot, everything taste fresh,from the carne asada to al pastor tacos. After our order is placed I step over to salsa a bar, and get all the goods for tacos ( fresh). We sit inside and eat our tacos, and drink our Mexican sodas,the best. Only reason I don't give them five stars is inconsistency, meaning carne asada is not always the same tastiness, which doesn't happen often....but. The other would be they're not always open on time, as matter of fact hours differ from yelp....not open until 12 on Sundays instead of 10. Hopefully this is corrected so the masses won't be kept waiting for the goodness. Warning this spot gets packed quickly, but service is fast."}
{"text":"DAMN!  Tacos pastor THE one, this place will be visited frequently. Another one of those good mom and pop restaurants. Had carne asada tacos and pastor tacos.... Pastor, hands down my favorite...please let this place be around  for a long time, salsa bar not shabby. Strong work guys!"}
{"text":"Good carne asada. Wish they could do something about the flies hovering all around. Guy at the counter was very nice and courteous. Would return if in the area. Order, eat, then pay. Enjoy!"}
{"text":"I love these tacos! Best carne asada in town I wish they still catered I had them for my baby shower and everyone was raving about how amazing they were. From the salsa to the guacamole to the tortillas to all their choices of meat. It hits the spot every time."}
{"text":"Best tacos in town by far!! Can't beat the price either. With two locations in the valley that are always CLEAN and really nice staff you're sure to make this an enjoyable experience.. Highly recommended from carne Assad tacos to Barbacoa.. they have very good tortillas and a salsa bar ...  I love this taco shop"}
{"text":"Best tacos in town the carne is very good , they have all types of meat Quality is good  they have a salad bar with 7 different salsas everything here is good , they are always busy so come with time !!!"}
{"text":"I gave this place a shot because I've tried just about every taco shop within the area and wanted something new. I'm so glad I did. Their setup is simple.. Good meats cooked over charcoal grills that give it awesome flavor. They don't serve rice but do have beans and offer a bar full of fresh cut veggies and salsas. I would recommend this place to all my friends. Definitely adding this spot to my daily lunch rotation."}
{"text":"2nd time eating hurr & it's delicious. The closest street tacos Mexican style ish you'll find in Phoenix. BOMB.com!!! I come outta my way to eat here. Highly recommend. And there's a guy who sells illegal DVDs of movies that are in the theaters now...can't get any better than that..."}
{"text":"So coming from they bay area(831) in California were Mexican food is the staple food to eat i want to find that taco place here in phoenix that reminds of the bay are or even better Mexico. I do have to say that the tacos de asada are by far the best tacos at ta' carborn. I tried al pastor they are good but no match to what i have eaten in my home town of Watsonville. The tripas or tripe was also no match. Don't get me wrong they are still good and worth the trip if you want some tacos. All in all i would go back to try more stuff on their menu. The salsa bar is amazing the only thing i would add is grilled onions to add to the tacos. Now who doesn't like grilled onions on their tacos? Anyways if your in for some tacos, you cant go wrong with ta' carbon,enjoy fellow yelpers."}
{"text":"Best tacos in town must try if you haven't been here your missing out the tacos are always fresh and authentic salsa bar is good too"}
{"text":"Hands down the best tacos in Phoenix. It's a crazy situation. You place your order and go hit the salsa bar. While you're distracted with the plethora of salsas and accoutrements, an angel sneaks in through the back door and laces the succulent meats with with angel dust. This guy is no rookie, he been blessing tacos for a minute. Now, you being none the wiser, are about to eat tacos that might as well be served on the holy grail. Yo I'll slap ya moms in the face for these tacos right here!"}
{"text":"Ta'Carbon is a good authentic Carne Asada restaurant! The food is so delicious, and fresh! The only thing I hate is that it is always packed and that the place is so small! I would recommend for anyone to eat here the good is so good!"}
{"text":"California needs some of these tacos. I came here because my friend recommended them to me. I will be coming back when I visit Arizona again. Hands down the best tacos I've had in the United States."}
{"text":"I think I found a new favorite Taco spot I had to carne asada and one lingua the carne asada were pretty damn good for a taco shop they cook it on coal first she get that smoke flavor in the meat then they finish it off on the flat top their tortillas are crispy but still soft the meat was a little salty though but still so damn Delicious lingua was some of the best I've had in a long time the only thing that sucks is there ordering system there's no line it a free for all and then you pay after you eat so if you want I guess I could slip out the back door if you wanted but over all a good place"}
{"text":"I love their food real authentic mexican food. The best tacos and beans in phoenix I can eat this stuff all day every day. Hands down beats filabertos and any other place you can think of."}
{"text":"You don't get better carne or beans than this place. I always recommend getting the carne asada plate."}
{"text":"Hands down my favorite fast Mexican food. There Barbacoa is SO good. The only thing I wasn't super impressed with is their carne asada but it wasn't even bad it just wasn't my favorite. Their sauces are good too. Their burritos are so filling and there tacos are so good! This was one of my biggest cravings back when I was pregnant!"}
{"text":"This place is ridiculously good. Their barbacoa burrito is the best thing ever. And their green sauce is bomb! Their carne is good I've had better but still decent."}
{"text":"Extremely fast service, fresh sides, and both meat selections are excellent. My favorite on the west side!"}
{"text":"This place had a really good food, great variety of tacos and Mexican food. Great service and reasonably priced. It was small and loud but otherwise good. Sketchy people hanging out in the parking lot and a man trying so sell homemade goods out of an ice chest in front of the restaurant. All in all great food, wish they had chips to go with the salsa. I would definitely eat here again and recommend this spot."}
{"text":"I've heard so much about this place and their food, so finally this weekend I decided to give it a try. OMG delicious food. their tongue tacos are the best. I definitely recommend it."}
{"text":"Lets be clear, the food was great and \"salad bar\" thing is great.  The cabbage adds a texture element to the street taco that is amazing.  The service was excellent too, they actually let you eat first and that is not the taco shop norm... But when you order in waves, it allows you spend more money.  The only reason I am not giving them 5 Stars is because of the price.  I have never paid more than $0.75 to $115 for s street taco, ever... Okay, sometimes I get o high end places just for their street tacos ruing happy hours... But damn near $2 a piece seemed steep.  My bill was $43 which would not be unusual if I wasn't ordering tortillas with a couple of table spoons of meat on them.  Im familiar with that area and tacos, and seemed a bit steep.  But the food and service is amazing... Price point needs to be adjusted (there was no shortage of people willing to pay that price though).. I could be completely uneducated on origins of the meats... But I doubt it."}
{"text":"Best Mexican food I've had! I love Mexican food and I feel like I'm pretty picky to what meets my standards for damn good original Mexican food. This place blows any other fast food Mexican out of the water. 5 bucks for a small bean burrito, asana street taco, 5 mini tortillas for $.50 and a water! The salsa bar is one of the freshest I've ever seen too with lettuce, pico, carrots, onions, cilantro and great hot sauce! I would drive from Peoria to come back and would love to see a location further north as the Mexican food up by me is subpar:( This good took about 10 minutes, which for fast food most people think is long but trust me it's worth it bc nothing's pre-made. It's all prepared by hand right there behind the counter.  This is an authentic taste of a restaurant in Mexico, make the trip it's worth it!"}
{"text":"Street tacos = happiness  These street tacos equal bliss.  I truly look forward to devouring these tacos."}
{"text":"While my mouth said this wasn't bad my stomach greatly disagreed. I tried this on a whim from a coworker that I do lunch with every Saturday and it came highly recommended. Considering we had done the same place for about 6 weeks straight for our weekly Saturday lunch I caved and gave it a try... BIG MISTAKE!  As mentioned above the taste of the food was good, however, there was something off with it as I have had digestive distress(nice way of saying what it's really doing to me) since 11am yesterday and have to question either the conditions of the kitchen or whether the food was handled or stored in a sanitary manner. Either way, this'll be the first and last time I eat here."}
{"text":"This place is awesome. Tacos de huevos de beceros. So rad to see a joint with balls. Literally.   They charge you after despite it being counter service, so you can order more easily.   Will be back next time I'm in the 602."}
{"text":"Very quick service and delicious inexpensive food. I had the barbacoa plate that came with meat, beans and 6 tortillas."}
{"text":"Best tacos on the planet! Open kitchen, you can see them barbecue the meat over mesquite. The smell is pure heaven. Great salsa bar."}
{"text":"Ta Carbon was da bomb. The Lorenza was my favorite and I recommend it because it is juicy and delicious. I also recommend the Pastor,because it is plain with exciting flavor.          To wrap it up (get it \"wrap\" it up!) it was better than school food.   Ps... I'm 8.  (this is my mom's phone)"}
{"text":"This place is phenomenal!  I had a quite a dilemma while eating here: i was sad because I didn't want my meal to end... But also i wanna eat it as soon as I can because the tacos are so much better hot off the grill...  I got two ASADA (steak) tacos and two PASTOR (marinated pork) tacos. The ASADA was delicious as expected. Tender juicy steak nom nom.... And the marinated pork was full of flavor...but personally I still like the asada bettter. Their salad bar has a good selection of toppings and tasted fresh... The cucumbers with lime and salt! Mmmhmmm... One thing that would be better would be labels for the salsa because I wasn't sure which is hot or mild so I just got the green tomatillo salsa and the avocado sauce.  I found out so interesting that they ask for payment at the end of your meal. I think that it is a great idea to bring in more business. It worked on me because I ended up getting one more taco lol.   Service was really good. It was super fast we received our food less than 10 minutes after ordering.   And I have to mention how they maintain their place. The dining room is very clean AND the restroom is also very clean   Can't wait to try more of the menu items next time.  4.5 stars!!!!!!! But really close to almost five!"}
{"text":"Great food and really clean restaurant. It was barely 11am and there was a line. Got the Hazz burrito...really good. They were grilling jalapeños along side the meats. Also, great salsa bar."}
{"text":"The food here is good... Really good honestly! Not priced to bad . Can feed a family of 4 for $25 due to there family meal deals! ONLY PROBLEM HERE IS THE place! It's to damn small!!! To many people often times not enough room to sit & it's hot in there! I would go back but never on a weekend. & never to dine in! Service is good. Meat is cooked on grill right before your eyes!"}
{"text":"Yummmm to this restaurant. They have such a variety of tacos to choose from. They have a salsa bar too. Love that! They are really busy though and the tables are dirty from them not cleaning them quickly enough."}
{"text":"Sooooo good and inexpensive. Not a fancy restaurant so don't expect to be wowed by the atmosphere. Just a really delicious, hole in the wall restaurant. Hole in the walls are the best though! If you're not snotty, eat at this place for some truly authentic Mexican food."}
{"text":"Now this is authentic Mexican food with good prices !! Skip good. Amazing prices. Tacos staring @ $1.85 - $2.10   They even has testicle tacos ! xenophobes beware. Not for me since the texture was to soft. I like crispy textures. My Fav was the Mixto meat. Half steak and half Pork meat  The burrito we had was Mixto and was full on meat ! Well marinated and under $5 !!  Great salad bar too ! Lots of pickings and salsa to chose from. Good came out fast.   For 4 tacos, a burrito and a drink we paid around $15 and it filled us up ( me and gf ).  WILL DEF RETURN !!"}
{"text":"I am Mexican and when wanting some authentic Mexican food I always turn to Ta' Carbon.   Their pricing might be a bit higher than your average \"taco shop\" but it's 100% worth it. They're food is always fresh and they grill all their meats daily. They do have a few beers available in Bottle if your feeling like having a brew.   They have Tacos and Burritos as well as combination plates which are my favorite. They also offer tacos with either Corn or Flour tortilla. They have a very convenient Salsa bar and plenty of seating.  The line can get long sometime but don't worry the food usually comes out quick and don't worry if you don't get full you pay at the end of your meal so you can keep ordering tacos!   Perfect Spot for TACO TUESDAY!"}
{"text":"West Valley's best kept Mexican food secret. The caramelos are so good. The salsa and toppings bar is legit. The prices are very affordable and buying meat in bulk amounts is great for parties or events, make sure you call ahead."}
{"text":"WOW ... WOW... WOOOOOW  Best tacos ever... always packed to the max inside with us Messicans tryna get some REAL grilled Meximeats. Politely elbow your way to the front counter...place your order ..eat...THEN pay  Impressive salsa bar.bottled mexican sodas.street tacos.burritos.carne asada.al pastor.caramelos. small or large quesadillas.and pick your tortilla with EVERYTHING flour or corn???  Great for big parties too with their large packages that offer family style meals with meat pounds and tortillas and lots of seating."}
{"text":"Some of the best tacos in town!! and that's a bold statement in Phoenix. Ta'carbon is like a step above a taco truck. Food is as legit as it gets, only difference is that you can sit in down at a clean table and enjoy your food and not do the standing hunch. We ordered the lengua, asada, pastor, mixto (50/50 steak/pastor), and tripa tacos. Generous amount of meat on fresh flour or corn tortillas. Tacos, burritos, and quesadillas only come with meat and you fix up your order at the condiment bar. Fresh onions, cilantro, salsas, limes, and cabbage. The only thing that would make this place better is a drive thru! Definitely one of my top taco joints in town! You also know you're in the right place when there's not a whitey in sight ha!"}
{"text":"This place is absolutely amazing! The tacos are delicious with a wonderful salsa bar. I wanted a chicken casadilla but they did not have chicken so I got al pastor. I had never heard of it before but my goodness!! It was the best casadilla I had ever had. This is one of my main spots now. I recommend stopping in here for lunch or dinner if your ever in the area"}
{"text":"This place used to be sooo good. The food is still pretty good, but not as it used to be. I loved the carrots and guacamole with my tacos but sometimes they don't even put them out anymore. What's a taco without guac?!?!? The carne asada is still good but just can't enjoy the same. It's always packed and usually no where to sit. I hope they go back to the drawing board to when it first opened!"}
{"text":"This is my go to place for mesquite grilled carne asada tacos. They got a salsa bar with all the fixins. If you like tacos, this place will not disappoint you."}
{"text":"This place is a great place to go to, food it cooked to order, delicious, laid back and worth the wait."}
{"text":"The food was so delicious...I couldn't stop eating it. There was no table conversation because everyone was so busy eating. We had a family style meal...the asada was so good, probably my favorite, but the pastor went the fastest at our table. All the salsas you could choose from made each taco different and exciting. The next time I'm in Arizona I will come back!!!"}
{"text":"This food is the best I have had for a long time. First time we had tacos, they were full of flavor. Their mini bar had pretty much everything to make your tacos with. That was about 3 weeks ago. Just stop yesterday to have lunch. The food was good as usual and I was happy camper when I left. This place get pack and have to say I will be back."}
{"text":"IPlace is so good! As soon as you walk in, you'll notice that everything is made on their grill which adds a unique \"BBQ\" taste to the food that you don't find at many Mexican restaurants these days. Great selection of choices in the menu as well!"}
{"text":"Yummy beef tacos!!! 3 to 4 Tacos fills you up. Very clean place. And their horchata is good."}
{"text":"The best carne asada I've ever had. Get the asada plate, it comes with meats, beans and tortillas (flour or corn). It's a great deal and the food is just incredible. Nice salsa bar too."}
{"text":"Thank you hubby for reminding me that Ta Carbon was in this city last time we were on a road trip. How can I forget? This time we were closer to this location and had to find a way to get their carne asadas to-go again. We almost didn't make it because we weren't in this city long enough but my brilliant thinking decided to hit here late at night to take out for the next days lunch on the road to the Grand Canyon. Yes I did wonder if it will taste less fresh but when something is made fresh the night before, it stays fresh the next day :)  So in this case wow thanks Ta Carbon again for the most yummy lunch on the road.  Even at late night this place was hopping. We had a funny incident where everyone in front of us plus us thought there was a drive thru here and got all backed up by a parking car so we all had to slowly reverse out n repark lol that took up a bit of time but we went in ordered our carne asada family size meal and extra tortillas and again they gave us all the stuff we need to pack to the brim their amazing salsas, Pico de gallo, fresh salad fixings which they kept restocking. Loved how they just let me pack it all in and then some. Wrapped it all up for me, got our food in 15 minutes and bagged it all to seal it in for the next day. Love this place, fast, efficient, fair in price.   And what do you know. Our hotel heated up the meat and warned our tortillas for us the next day and we ate it on the road. So good still. Fed our family of 7 and had leftovers for dinner. Now that's amazing!   Wish we had one here in town because we'd hit it every weekend ;) definitely will be back. Fresh, fast and consistent. Thank you Ta Carbon!!"}
{"text":"Greatest tacos of all time!!! We will drive all the way across the valley (Chandler). So good!"}
{"text":"Fast and friendly service!!!! It was pretty busy even though they were going to close soon. The tacos are AMAZING! We ordered several different meats, al pastor, carne asada, cabeza, tripa, and carnitas! They were all seasoned to perfection and I loved the fact that none of the meats had the fat that other places leave on there taco meats! The carne asada burrito was also great, and they can put beans in it if you'd like.   The salsa bar is huge and they also have huge grilled jalapeños! YUMMM! I will definitely be back for some more delicious tacos! Can't wait to try out the rest of their menu!!  BRING A LOCATION TO MESA PLEASE!!!!"}
{"text":"Really good authentic Mexican food. Delicious, good price, and a good amount of food. Ill be back tomorrow."}
{"text":"This is one of the best taco places in the valley! Authentic Mexican here! I run there as often as I can. They are very fast here"}
{"text":"Fantastic asada, maybe the best in the Valley, and well worth visiting.  The best and most popular option is to get a family pack and pick up 1 or 2 pounds.  This is a really basic asada... it's not heavily marinated (or maybe not even marinated at all).  But it's perfectly salted, and then cooked up over a charcoal grill.  When you add in the fact that the price is fair (something like $17-19 for a family pack that will feed at least a few people) and the tortillas are good, this place is tops."}
{"text":"Mediocre food, failed check out system, and inattentive customer service. Onions aren't diced or peeled properly. The staff doesn't seem capable of handling rush hour business. Smells nice walking in from the parking lot, but left disappointed."}
{"text":"I am so upset with myself. I have lived about 1.5 miles away from this place for the last 4 years. The exterior does not do it justice so I have never pulled in to try it  or read about it before today. I decided to look up some new Mexican places around my house , and this one has really good reviews, so I went and checked it out I could not believe how many people were there, even still it only took about 7 or 8 minutes total to get my food. They are cash only so make sure you go with some cabbage. They have a huge BBQ constantly grilling carne asada right inside the restaurant over hot charcoal. They also have some pork varities but I have not tried that yet. I had some carne asada tacos and oh my gosh they were so good. They are served on the freshest mini flour tortillas I think I've ever had they were so good. Everything seems like it comes plain, if you want to add on onions or salsa or the pickled vegetables you do that yourself after hitting up the little salsa bar. They also have a few different types of Mexican soft drinks in glass bottles. The place itself is just the bare minimum, its just a little tiny place that serves street food, but the food makes up for the decor. I am so glad I tried this place it's a great cheap meal and it's right down the street! Next time I will try some of the other taco and burrito types, I saw Pastor and barbacoa and a few others as well that looked good! This is real Mexican food, not tailored for Americans or gringos, I was the only white dude in the whole place out of about 30 while I was there!"}
{"text":"This is a great place loved the tacos and kids even asked for seconds. Horchata is really good too. I would recommend this place and it is worth the drive"}
{"text":"Best Tacos in Arizona hands down. There is no place in Arizona like this that we've tried. Unlike \"chain\" restaurants these tacos were fresh. The Flour tortillas were simply amazing, pair that with there Carne Asada and some goods from the salsa bar and you have yourself the best taco in Arizona. Constant flow of customers and great seating for families of all sizes. I also recommend any of there Quesadilla's. Glad I stumbled upon Ta' Carbon!!"}
{"text":"A hole in the wall that is well worth the drive. The tacos are great, the caramelos are scrumptious, and the prices are unbeatable. This is always my go-to taco shop."}
{"text":"Ta Carbon is really a play on words on the traditional Mexican saying \"Esta cabron\". But rightfully said so, this place esta cabron, this place is badass!  Its small, set in a corner of a strip mall, almost hidden, but it gets lots of repeat business and its like going to someones house for a bbq!  The grill is on fire with four cooks on stand by, theres a salsa buffet style setting with lots of delicious salsas to choose from.  Their carne asada has got to be some of the best in town, and the food is always served right off the grill. Dont be scared, if you want badass Mexican food straight from the grill, this place is sthe shit!"}
{"text":"Best Carne Asada Tacos. Fast! Even though it's always super busy and definitely good customer service and clean!"}
{"text":"The best tacos in town! It doesn't get any better than this place been coming here for a couple of years never dissapoints !"}
{"text":"This is the Real Deal Mexican very authentic restocking the Salsa every 15 minutes and everything made to order with Super light Tortillas! No matter what you order you can't go wrong!"}
{"text":"Ok. I had heard and read many good reviews about this place.  To be honest I have my favorite taco place already and it has been my favorite for years!!! But I don't get to go that way too often because is close to central Phoenix and I live farther west. So for that reason and because I was near by this place my mom and I decided to give it a try. Well let me tell u...this place didn't disappoint me at all. Best of all my mom (who by the way is super picky when it comes to Mexican food) loved it!!! We had tacos al pastor and tripas. Both were bomb!! I also order a small caramelo (cheese and carne asada flour quesadilla). It was good but for my taste, carne asada was a bit salty.  They have a salsa bar with different kind of salsas, pickled carrots, cabbage, onions and limes. I tried the red and toasted chile sauces. Both lack flavor and heat. I usually love the pickled carrots but this ones had no flavor. They didn't even tasted like carrots. We also order a carne asada and bean burrito to go for my wife. Well she didn't like it so much but because they were very skimpy with the beans. She liked the carne tho.  We were definitely be back. Tripas tacos are my fave and this place has the best tripas in town!! I just hope the add more flavor to their salsas and their pickled carrots.  Try the JAMAICA agua fresca. Is to die for!!!"}
{"text":"I wasn't very impressed with this taco place, they have a lot of young kids running this place, I came on a Friday night and they were busy but the tacos and burrito were lacking a lot of flavor.I normally order carne asada and al pastor and the meat didn't taste fresh, I wanted to take it back and complain but I figure this is the last time I come to this location. I've been to the location on  camelback and 59 and it's so much better. I guess I was expecting the same quality since it's the same chain. You're better off going to the one on 59 bc they're so busy that you know you're gonna get better quality food with authentic flavor.... Let me tell you guys, I'm all about good fresh quality food especially when it comes to tacos.... And so far ta carbon on 59 is the best taco place...."}
{"text":"What a sorry experience this was. The carne asada was mystery meat I spit half the meat out chewy nasty rubbery crap.  I told the order-taker that this was my first time there I would like to try something good, I like the carne asada he said oh yeah it's really good, not really.  This place was recommended to me by my homeboys, unfortunately I must have gone on a bad day. My espanol is passable but wasn't worth crap, my fault.  Don't go there for the carne asada, try everything else Tijuana Taco Style that might be the better bet.  I don't like leaving negative reviews but my carne asada was a waste of time and space and since I went out of my way to try this place well fuck me.  The taco salsa bar was dirty well not so dirty but there was no more salsa verde, onions, and napkins. The pico de gallo was okay, a lot of jalapeno but then I like spicy and I'm good with that.  But the place was packed so obviously I don't know what I'm talking about.  Since they got a big sign at the door saying no guns allowed, to hell with that, I'll spend my money elsewhere."}
{"text":"I didn't like the burritos, they don't even come with beans and rice! It's just meat!!! I asked if they can put beans and rice he said yes they can which they charged me extra for it. I got home and none of the burritos I bought have beans or rice!! Never going back there again!"}
{"text":"First of all, great tacos!! I love the name, sounds like Ta'Cabrón haha!  I will for sure come back, they had the grilled taste but the beer was not as cold... that sucked.  Better than any taco place in the Inland Empire back in California where I'm from.  100% recommended. The place gets packed but your tacos are ready right away."}
{"text":"Good quality meat and decent salsa bar. I enjoyed my meal , but the way they takes orders confused me a bit but it's an easy adjustment. Carne asada, tripas, and pastor were the best. Stay away from the burritos, very dry. But tacos are amazing"}
{"text":"I'm not quite sure why such good reviews. The place was clean, and the guys Ok. But the place was HOT, like no AC hot, and we're in the middle of the summer!! And the food, was OK, but by no means great. I had tacos de cabeza, they had no flavor. My kids had burritos de barbacoa, and again, cooked OK, but no real flavor. The salsas were OK, but I'm not going out of my way to eat here."}
{"text":"Fast and to the point, great carne asada, was not a fan at first however can't go wrong at this place. It's a pretty standard setting however the food is what matters. Just don't forget to pay before you leave."}
{"text":"Went there not knowing what to expect!!! Carne Asada tacos, yum with the fixings bar. Orange fanta and I'm a happy camper!"}
{"text":"While visiting family in Phoenix stopped there to eat because of the reviews. Delicious! Meat was so flavorful and juicy! Only bad was that we had to wait for a table and the parking lot isn't big so finding a spot was a mission. Other than that, it was definitely worth the wait!"}
{"text":"My favorite tacos in Phoenix. Super simple menu, everything is really good. They also have carne asada by the pound. Great place to go with a group of people.   Only downside is the tiny parking lot."}
{"text":"Tacos asada unbelievable. Tacos barbacoa finger licking good. Pastor and chicken I would say 4stars kind of hard to beat the asada. That smoky flavor is addictive. Aguas de horchata and my personal favorite cebada (barley water)."}
{"text":"Meat on my mind, mind on meat.  While being on the road for work I try to find tasty Mexican spots, and don't always have much luck BUT I am so happy that I came across Ta'Cabron.... Carbon.   My co-worker and I were starving, and we wanted tacos, burritos and more tacos.  Being disappointed from other spots that we had tried we were a bit apprehensive about this place, however we were not disappointed.  Meats tried: Carne asada/Al Pastor- succulent, well seasoned.  Meat so moist made you want more and more. Every bite aroused my taste palates and I was hooked.   Tacos were a decent size, only complain I have is on the burrito.  It is not big enough!!! I suggest you order two if you are really hungry OR order extra meat.  (they remind me of Taco Bell size burritos) and they also do not add rice or beans (I don't even think they sale rice, but  they do have beans, so you can add beans. you just have to tell them.) The meat is so good, that I know alone it taste just great.  They have a great salsa bar in which you can load up on guacamole, and all levels of spicy stuff and cebollitas.  Customer service is good, they are fast and clean and very inexpensive. I wish they had this place in LA.  I will def be back.   XOXO B"}
{"text":"Delicious. Ordered 1 pound of asada and 1 pound of barbacoa with all the fixins. Great choice. Everything was delicious. Made a great meal for a lot of people for a great price. Highly recommend it. Great customer service. Kinda loud and crowded but soccer was going on. Decided to take it to go! Still highly satisfied with my visit."}
{"text":"I give this place a 5 just because the pastor meat is delicious. But if I could rate them based on customer service I wouldn't even give them one star. They are so rude! Whenever you ask a question on something about their menu they give a smart ass answer, and since it's so noisy in there it's hard to hear sometimes and they give you attitude for not being able to hear."}
{"text":"In a city where taquerias  abound, this very popular joint stands out. Even if there's a queue when you come in, don't worry - you won't be in line for long because the staff is very efficient. After you place your order, you are given containers which you can fill from the very generous salsa bar - pickled onions and other veggies, different kinds of salsas, fresh cucumber slices, etc. You'll definitely be pleased with your order, as I always am. If you can't decide or if it's your first time here, I recommend the plato mixto; this has enough meats, refried beans and really good tortillas to make 8 to 10 street tacos ... for less than 7 bucks! Fast, tasty, and very inexpensive - always a winning combination."}
{"text":"Not sure what everyone else was eating, but for me it was just okay. The meat had a great flavor/taste but a slight tough and fatty at times. The salsa bar seemed to be flavorless and cut down with water or something. Every great taco must be accompanied by a great salsa/chili.  If your in the area I would give it a shot."}
{"text":"Service is garbage.. The majority of the guys working there have bad attitudes. U ask for something and its like they are being forced to do it, and they do it with a stank face..... But theyre food is delicious and makes up for thyre lack of costomer service.. if they got rid of theyre bad employees and asded some descent ones my 2 star rate would get bomped up to 4 or 5.."}
{"text":"¡Muy authentico!  Like you've been transported into the middle of Hermosillo.  Only gringo in the place.  Loved everything I had."}
{"text":"When there is a line outside of the door waiting for a place to open you know you are about to get good food. Don't let the line intimidate you though, not only is it worth it, you'll have your food in 15 minutes. I'm on a mission to find the best tacos in Phoenix and right now this place deserves to be in the top 3 of my list. Some people say a taco is a taco. No no no. There is an art to making a good taco and this place has mastered that art! I can't wait to go back and try more, as well as other items on the menu!"}
{"text":"I had 2 carne Asada tacos \"Haas\" (I think that's what it's called) this place is by far the best in AZ!! I also got a steak quesadilla and that was amazing as well! They have friendly and fast customer services."}
{"text":"I had 2 carne Asada tacos \"Haas\" (I think that's what it's called) this place is by far the best in AZ!! I also got a steak quesadilla and that was amazing as well! They have friendly and fast customer services."}
{"text":"I couldn't believe this place had so many reviews and such a great rating, so I had to try it for myself. WOW! It did not disappoint. This place is amazing. We ordered the steak plate (to make our own tacos) and a mixed burro. Very fresh and authentic, but what brings this up to 5 stars was the salsa bar!!! So fresh, flavorful, and just the right amount of heat for whatever level of heat you're looking for. We also had the horchata and it was a delicious call to cool us down when we were too ambitious with the salsa. Great staff, great food!!"}
{"text":"My brother and sister were coming in to town and my step mother asked me if I could try to find a place near my brothers house that would feed 6-8 people for under 200 bucks. After doing some yelp research I came across Ta'Carbon. Not only did we stay under 200, we where under 70 bucks before tip. That included a variety of tacos, burrito's, a cheese crisp for my 2 year old nephew and some beers for the adults.   On top of how cheap this place is, the food was amazing! I felt like I was back in Rocky Point. I use to go there 3 times a year in and right after high school and we lived off street tacos while we were there. These were the exact same as I had, had then. They even had the awesome salsa bar. Every thing made from scratch. Even the same great, fast, service with a smile you would get in Rocky Point. One of the cooks in the kitchen even heard my father talking about how much he loved the hot sauce and he came out and brought him the \"stuff from the back.\" It was FIRE!! And oh my goodness.... those refried beans. SO DANG TASTY!! I've seriously been telling everyone I can about this place and I have been craving it every day since. I found that they have a location a bit closer to me, so I will be paying them a visit soon."}
{"text":"5 star! Phenomenal food. Seating area is always kept clean. Overall a fantastic place to eat at. Great service. They speak English and also Spanish. By far my favorite Mexican food restaurant in Arizona"}
{"text":"Nice Hole-in-the-wall joint for street tacos! No chicken!"}
{"text":"Great food at great prices!  I have to say they have the best tacos in all of Phoenix, and maybe all of Arizona.  They make their food fresh in front of you as you walk in.  It can get a little crowded, especially on Friday and Saturday nights, but that's to be expected of a place with such great food.  I wish they would expand, as they have limited seating inside the restaurant and sometimes you can hardly move around the salad bar without bumping into peoples' chairs or people in line to order.  They do have a patio area that I prefer eating in, especially in the cooler months of the year.  You have definitely got to try their gringas!"}
{"text":"I cant believe how lucky i was to have came across this on yelp!!! Wow wow woww i wish i had this at my local area. Definitely stop by you will not regret it... The tostada was good... The buritto hazz omg a must!!! You need to go asap!!!!! This place is under rated"}
{"text":"I was speaking to a driver on the way home. We had a discussion on the best Mexican food here. She said this was the most authentic place to go. My mom and I went, and this place is Super Busy. Once they sell out of an item for that day, that is it. We had 2 tacos each. They have a condiment bar, with lots of salsa and lots more.  They were decent, but I would not go back.  Just not something I want to eat again.  Other patrons made it great for the 4 stars. If it was just the food it would be 2."}
{"text":"Yesssss! It's authentic, fresh, & amazing! Hubby loves the carne asada and says it's hard to find places that do it that perfectly the way this spot does."}
{"text":"Great tacos, great salsas to go along. Many options on the menu, authentic mexico style tacos. Best I've had here in Phoenix."}
{"text":"I really have nothing bad to say about the food, the tacos were really good..carne asada and barbacoa..we also ordered beans and it came with a lot of tortillas. I liked the salsa bar, it's in a small space though and hard to move around the other people. They have no chips or rice, so don't ask, like I did. Staff are efficient even when it's crazy busy, and they aren't comping your meal, you just pay after you eat!"}
{"text":"Stop reading this and immediately go.  Between my wife and I we had a mix of tacos, burros and quesadilla...caramelo, asada, al pastor, beef tongue and beef cheek. Beans are ridiculous & salsa/veggie bar adds anything else you may need. I said stop reading and go what are you waiting for!!?"}
{"text":"Great Authentic Mexican food. Their topping and salsa bar are always fresh and fully stock. The staff is friendly amad helpful."}
{"text":"Came here with my wife for lunch. Tacos and beans were delicious. Customer service was ok. Wouldnt mind eating here again. Pretty tasty!"}
{"text":"All I can say is YES!!!!! Finally a place that does it right!   Recommend the HAZZ and CARNE ASADA tacos."}
{"text":"I've been on a hunt for good street tacos & with the help of yelp I found great tacos here at Ta'Carbon! Fast service, great tacos, good service, & can't forget the salsa bar with many options to choose from! Best tacos I've had in awhile. This is now my taco spot."}
{"text":"Ive been here 3 times already , and every time has been packed , which is a good sign. Ikind of dis like having to squeeze through to get my salsa and garnishes, maybe its time to get a bigger spot? haha . I'm a huge fan of Tacos de Cabeza , alot of places have too much fat and are really greasy , but here its ON POINT . I havent tried any of the plates they have on the menu , usually stick to tacos . My daughter gets a cheese Quesadilla on a corn tortilla , and my hubby almost gets one of each taco on the menu ha . the green salsa the have there is the best ive had since my mother in law & the guacamole sauce (i think thats what it is) is also great . On my last Visit i had done take out , ordered 4 tacos de cabeza , i was craving it like crazy, took less than 10 mins, took me another 10 to get home , peeled back the foil and realized that I got Carne Asada, i was so sad or fat that i got dissapointed and ate my food unhappy , but that was partially my fault for not checking my order . i'll be back soon when im craving tacos !"}
{"text":"Delicious but avoid going on the weekends cus your not going to find a seat n are going to have to watch people eat for 30 minutes before you have to almost fight for a seat lol"}
{"text":"Love the food! This place is great. Even they're beans are delicious. Only thing is it is not baby friendly. The location we visited did not have a changing table in the restroom. It was also a small location. Other than that, service was great."}
{"text":"Such a delicious and fresh taco shop! My favorites are the carne asada and pastor tacos. Then they have a condiment and salsa bar. Food is so good. Seating is tight - would be nice to have more outdoor seating or get it to go. Also the people crowd around the salsa bar because it's in the corner, it's so popular they just need more space."}
{"text":"a fail-proof place for great mexican food. i have tried everything on the menu and its all great!! i even had them cater my wedding!! cant wait till they open the new place on 43rd and thomas!!"}
{"text":"What can I say? ¡Esta cabrón!  This is probably the tastiest authentic Sonoran-style burrito I've had (I had the Burro Hazz). Price was good, too."}
{"text":"Hubby wanted street tacos & this was recommended by a few people.  We walked in at noon right as they opened & it was already packed.  They had a salsa/condiment bar right in the middle of the room which kinda skeeved me out since so many people we're standing around it (flipping their hair, coughing etc).  I ordered 2 carne asada tacos & hubby ordered 1 carne asada, 1 pastor, & 1 taco with carne & green chile. They came out right away & I was really impressed with the amount of meat they gave us.  My meat was pretty pink & I wasn't sure if it was due to a marinade or being undercooked? The meat was pretty flavorful, I did like that nice smokey taste from the grill. I could only eat 1 taco, it was way too greasy for me.  The tortilla was greasy as was the meat.  My husband devoured his & couldn't stop talking about how these tasted like the ones back in Mexico. I felt pretty queasy the rest of the day from the amount of grease.  Since my husband loved it I know we'll be back, I noticed they had bean tostadas & bean tacos so I may try that next time."}
{"text":"Food and service are excellent. I love this place. The tacos are the best. The place is always clean and the service people are so friendly."}
{"text":"A friend of mine recommended this place Ta' Carbon. Being the taco freak I am I HAD to try it out. I was not disappointed at all. It was so freakin' amazing! The barbacoa is the best thing I've had in my mouth in a long time. Lol! Seriously though!! So, so good! The carne asada was pretty amazing too. I rate it a 10/10! I like that the tacos come plain and they have a salsa bar so you can top the tacos with whatever toppings you want. I highly recommend this place."}
{"text":"Hands down the best carne asada and tripas in AZ, I do miss the cucumbers they had at one time tho"}
{"text":"I recently went to Ta'Carbon with my neighbor who is a big fan. He pretty much knows were all the good taco joints are around the city, so I tend to trust him. :-)  I feel like I was in Mexico. At a taco bar. At a tasty, delicious taco bar! Props to the staff because they are smoothly bilingual.  Anyway, I digress. Basically you walk in, stand in a line that moves pretty quick, look at the menu and tell them what you want. You can have tacos, quesadillas, and platters. They have a salsa bar that has hot and mild salsa, pico de gallo, cilantro onion mix, fresh sliced cucumbers, shredded cabbage, marinated carrots, avocado cream, sliced limes, sour cream, jalapeños. Everything is well-stocked and made fresh. On the menu, all the meat is cooked over a large charcoal grill with a big hood over it so it isn't too smoky. You can have pork or beef asada, al pastor, BBQ. For the more adventurous, they also grill up cheek, tongue, tripe, etc. You give them your order and name. They give you your drinks- Mexican sodas or drinks like Horchata. Go up to the salsa bar and get your sides. Food came out pretty quick. Platters are the way to go. More meat than single tacos and those beans were tasty. There are some tables inside and there was a patio with misters. It stayed consistently busy. Lots of people picking up take out orders. You pay at the end.  It was a decent meal for about $6 for food and about $2 for the soda. It's always a good sign when you go to a Mexican restaurant and a lot of Mexicans are eating there. I will be back. You can pick up meat in catering trays - one or two lbs, to feed a crowd."}
{"text":"Soooo I ordered a taco de Barbacoa and a burrito and my taco was ridiculously salty which was sad and then I bit my burrito and realized it came with nothing but meat. If you want beans and cheese its extra. I've never been to a Mexican restaurant where you had to pay extra to eat an actual burrito when you order a freaking burrito. Don't call it a burrito. Call it a super taco cus thats basically what it is. But yeah the carne asada is decent and the place is really clean but I am genuinely upset about their so called burritos. I am writing this review from the Filibertos drive thru where I'm getting a real burrito."}
{"text":"If you want authentic tacos, this is where you want to go. Their tacos are so bomb! We get the Hazz, Carne asada, and Barbacoa tacos. Everything is always fresh and flarvorful. They have a salsa bar with all types of toppings and different salsas. I don't know how anybody can give this place anything less than 4 stars. There's never really a good time to good because it's always packed!"}
{"text":"Love it Simple and delicious  Everything Mexican street tacos should be!! Must try al pastor"}
{"text":"This is a good OG taco shop just south of Downtown Glendale.  Busy spot with limited seating inside and several seats outside on the patio.  Delicious salsa bar with cucumbers, hot carrots, limes, Pico De Gallo, guacamole sauce, tomatillo salsa, red tomato salsa, cabbage, and purple onions.  Meats have good flavors but tortillas could be better.  Jamaica to drink was only average tasted like it is not homemade, I would recommend ordering a bottle of soda instead.  Overall I enjoyed the food for a Phoenix taco shop, which despite the fact they are eveywhere in Phoenix, as another yelper stated, they don't compare to San Diego shops. The ordering system is unorganized and the guys taking the orders don't seem to care about what you are ordering and don't want to help at all.  I ordered the mixed plate but they gave me tacos instead.  Be prepared and clear on what you want before you approach the counter, there is no real line, just look for the guy who is ready to write your order on the paper pad.  I would go back and eat again but this time with some experience to help my experience."}
{"text":"Well the food is eatable way to small and crowded in there they have a patio area as well but be aware you may get attacked by all the flies. To ease this experience they do serve beer"}
{"text":"Just passing thru Phoenix and decided to stop in from great reviews and cheap price. There was no place to sit so we took everything to go. So worth it! Everything home made. Cheaper than fast food chains and definitely better!"}
{"text":"The best carne asada I have had.  This brings me back to a torta I had in Puerto Vallarta.  I recommend this place with two thumbs up. Also Barbacoa taco also tasty.  Very friendly staff and super clean inside as well."}
{"text":"I almost died twice on my way to try Ta'Carbon tacos! I'm sad to say it was not worth it. Truly a let down. I was super excited too.   I tried their Caramelo, Taco Hazz and steak taco with corn tortilla. I was expecting them to be good but all I had was steak filled with cuero (fat) within every bite.  Also, the set up is a little confusing. People were lined up weird. They had good cucumbers and nice bar area at the very least.   If you're looking for authentic tacos head to Taqueria Tepehuaje for great tacos and vampiros. Btw, it's a food truck. Please don't expect anything upscale."}
{"text":"Ok adventurous diners, I don't want to write about this place because I want to keep it to myself....seriously!  This place is awesome.  If you're searching for excellence Mexican foods, cheap, and authentic stop your search and check out this place.  Everything is fresh and the meat quality is the best (Angus beef).   Above the top quality meat, this place has lingua (tongue), tripes, and calves ball.  The lingua just melts in your mouth when you eat it. The tripese and the calves ball grills on the open charcoal pit. The aroma it's like Argentina grilling their beef on the open pit.  All I can say is YUUUUUM!!!"}
{"text":"Meat here is ON POINT  Fast service Good salsa bar - although nothing was very spicy tbh   We had :  Mixto burrito - this ain't that filler shit. You know how most burritos are mostly rice and brand and all that. Not here.   Lengua taco - even my bf liked this. I always like to try lengua at a new place because I love it when done right. My bf will usually try a piece of meat and have me finish. But this time he went in on his half. It was big pieces and tender perfection.  Huevo DE becerro - this was a first. Didn't know what it was. So we asked. Took a risk. And I liked it. My bf couldn't handle the texture. It's balls btw.   Pastor taco - yum. Honestly we inhaled our food so I don't remember this in particular   Barbacoa - yum . Yeah inhaled this too"}
{"text":"One of my favorite taco joints in Phoenix! Their consistency is unmatched, and their tacos are always on point!! Great place to stop in for a quick lunch, the most pleasant aspect of this type of Mexican food stop, is the build-your-own salsa bar, loaded with all garnishes for any taco lover, which eliminates the need of having to ask for extra or to shamefully ask for \"No onions\" for example. Carne asada is some of the best, hands down, and barbacoa is outstanding! It's too bad they're only out west, would love to have one closer to home."}
{"text":"My husband, his brother and I were in the area for some business and I was starving by the time we finished (who leaves the house in the morning without coffee or breakfast! Yes, sadly it's me!). So we head there at around 12:15pm. Not too busy. You order when u come in and then sit down. When the food is ready, they call your name. The menu had very good stuff and very weird stuff! I decided no weird food for me today, so I went for the Asada tacos & I chose to have them on flour tortillas. I also ordered my favorite drink, Jamaica (which is basically the Mexican Hibiscus drink). Food came out in a few min. Unlike some other restaurants I've been to around town, the tacos here are served plain, meaning just the meat on the tortilla however u have the freedom of adding whatever toppings you want at the salsa bar which has about 4- 5 different salsas, pickled onions, cucumbers, carrots, etc. I topped my tacos with some chopped onions with cilantro, pickled onions (yeah I'm a big fan of fresh onions, shhhh!), shredded cabbage, salsa verde and some guacamole sauce and lime. We sat outside since the weather is finally getting better in Arizona and we dug in. Yum!!! OmG, this is great!!! My favorite other restaurant in town has Asada but no sorry not as good! This is worthy of five stars! I ordered 4. What 4! I had to go get one more (honestly if my brother in law wasn't with us, I would've gotten even more but I got embarrassed cause he only ordered 4 for himself and I'm thinking of an even 6th one here!). The meat was cooked perfectly. Perfect seasoning, perfect flavor, it was absolutely delicious!  My husband and his brother ordered Asada too but, they also ordered 1 intestine taco (forgot what it's called). The smell of it was so strong, I wanted to be adventurous and try it but the smell kept putting me off. Eventually I decided to try a small bite. Oh no, this ruined my day I had to spit it out. No more intestines for me, ever! My husband and his brother enjoyed it a lot though. They love it. Ok guys! You win the adventure trophy. Great find! I can't wait to go back again."}
{"text":"Very good... We got the family meal, asada and adobada.  Asada was cut in small tiny peaces and didn't have chunks of chewy fat as sometimes we get at other places. Adobada was soft, juicy and flavorful. We got a lot of small tortillas perfect for making the tacos, lots of good salsas. Price was good for the amount of food we got. Had lunch and dinner for family of 5."}
{"text":"I had been going to this place on 59th. This past weekend I went to the Thomas location. Let me start by saying this great food. KEEP YOUR RECEIPTS I just checked my bank statements and somehow the tip I left for my pick up order had been changed. What kind of business goes that route, I've disputed with my bank since. Sad I loved this place but you'll will not be getting any from me again. If anyone has had the same problem please let me know"}
{"text":"Great food. Never a disappointment. Fast and friendly service.  The carne asada is cooked perfectly and has little to no fat so that's good. The tripas are crispy and delicious too. I would recommend the plates. You get more bang for your buck that way."}
{"text":"This is the most authentic Mexican carne asada you can find in Phoenix. Their tortillas, beans and carne are perfect! Even their bean burritos are to die for!! They are always very busy but it's totally understandable. Their customer service is great!"}
{"text":"I LOVE THIS PLACE. It's seriously my favorite taco place in Phoenix! What I always get is Tacos Al Pastor and they are sooooo good, I seriously recommend. They also put double tortilla and I always love that. The places is ALWAYS full but the boys are super quick and they get your order quick and you get your food in no time! A trouble I always get at food places is bad service or rudeness but all of the men are seriusly so nice, they greet you, and talk to you friendly. I love it. Their salsa station is also great! Their aguacate (avocado) salsa is the bomb. Their horchata, too. I seriously love this place!"}
{"text":"This is quite a distance from where I'm located (East Valley), pero cabron, the travel time is worth it! I've had just about everything from here because I have a condition where I can't stop eating tacos (feel free to name it). Try the mixed tacos/burros, it's pastor and asada medley that is delicious as it is beautiful. Tacos Lorenza's are in a league of their own (\"THERE'S NO CRYING FOR TACOS\"). Also, make sure you don't skip out on a quesadilla...or three...caramelo or gringa, pick your poison. When you're in line to pay, try not merging to the ordering line, easy mistake. Pero si ordenas mas...pues agarrame tres con todo, aquí te lo pago (not really). Great spot, go check it out!"}
{"text":"Estoy encarbonado! Estos tacos de barbacoa e asada faltaba sabor. No sé porque tiene 4 estrellas. Pura basura.   Stay away from this place if you have high standards for Tacos.  Meats were flavorless and lemonade was disgusting.   Had better tacos off the street.   If the people of Phoenix think highly of this place, I feel sorry for them.   I've had much better tacos in LA.    I want to eat tacos where I can belch and still enjoy the flavor.  Right now I'm belching grease residue.  Yuck!"}
{"text":"Insanely good.   If you like old school authentic Mexican food treat your stomach.   Great tacos."}
{"text":"Love love  this place! Cannot decide if I like the marinated pork or the asada better! Tons of fresh salsas and every one is great!!"}
{"text":"It's a tiny little place with no air conditioner, but really tasty and cheap tacos.  I had the bbq tacos, carne asada, al pastor and tripe.  I didn't care much for the tripe tacos, but I think it's an acquired taste.  My husband had a beer for $2.50.  In addition to cheap tacos, they had a little salsa bar.  Some how, even though the food was cheap, we still managed to spend like $40.  The tacos are under $3 for the most part.  I think my husband ordered a burrito to take home which was $4.  I guess the cheaper the food, the more compelled you are to buy! :-)"}
{"text":"Reminded me of the great mexican food I used to eat in monterrey, mexico. Get the Gringa, whih is a quesadilla with beef and pork."}
{"text":"Tacos are delicious and they have homemade tortillas too. I recommend the asada and pastor super yummy. When you come in you stand in line and order what you want then they call your name and you go grab your food and sit down. They have a large variety of meats and sides you can order too. Would have given 5 stars but the guys taking our order weren't really friendly and they seemed upset that we took a few seconds to look at their menu and ask questions."}
{"text":"As you walk in the indoor seating area is tight but there is more outdoor seating available.  The salsa bar is located in the indoor space which can get crowded easily.  When you approach the counter, there are several individuals taking orders.  I'm assuming this is to move the line faster which seems like a good idea.  It was my first time there and there were two ladies ahead of us.  They seemed a bit overwhelmed by the menu and the gentleman who was taking their order seemed frustrated that they didn't know what they wanted.  He gave them a big \"eye roll\" while they were looking up at the menu so the guests did not even notice this but I did.  I thought to myself, how rude.  In retrospect, I should have walked out and not given them my business but I stayed and placed my order.  So another gentleman came up to us to take our order and we were ready and clear when we placed our order. I ordered tacos de barbacoa and tripas, while my boyfriend ordered the mixed plate that should have included beans and they got his order wrong.  The presentation looked delicious but found the tortillas to be bland (Like Mission Tortillas).  With the right tortillas it could really elevate the flavors of the meat but realized I've had better.  Even though they got my boyfriend's plate wrong, he liked his food and said he would eat there again.  Based on the rude customer service to the guest before me, I won't be returning.  In addition, I found the Jamaica drink bland.  Ta'Cabron (shit it's hard) but I'm only giving them a 3-star rating."}
{"text":"this place is great. you have to try the tripas. get them extra crispy. the carne asada is also very flavorful."}
{"text":"The tacos and beans are sooo delicious!! I love this place, except the establishment is tiny!! Not very comfortable, but the tacos make up for it!"}
{"text":"This place gets quite packed on the weekends but food comes out fast and staff is friendly.  Comparable to this restaurant is East Valley's Backyard Tacos (my favorite tacos in the whole valley). Here, the meats are grilled over a fire, tortillas are not home made, salsa bar is loaded with many options, and also a lot of meat options.  I got 6 tacos total. From favorite to least favorite - I got barbacoa, carne asada, hazz (carne asada with green chili and cheese), and al pastor. Tacos are fairly priced and cheaper than most locations at $1.85 for most meat options. The barbacoa is finely shredded, allowing more of the brine to get soaked up and prevents the beef from being dry (one of my favorite barbacoa in the city). Carne asada is good but not the best. The hazz is good. I was not a fan of the al pastor here. I just feel like it's lacking a distinct flavor and texture that is unique to al pastor. I feel like the texture of the al pastor is too damp compared to better ones.  The salsa bar is loaded here and I must admit their salsa is better than Back Yards. However, I do wish this place had pickled onions and grilled onions/jalapeños."}
{"text":"WOW- what great Carne Asada!  5 STARS for little non-descript strip mall restaurant with some AMAZING food!  Someone brought this into work for lunch, and I'm hooked.  I've been ONCE, and did not stay to eat there.  I ordered a large take-out order.  The smell is heavenly.  This is a little \"hole in the wall\" type of place in a west-side strip mall.  I went out of my way (geographically)  to get this, and will make a special trip there again soon!  If this was near home, we'd be having it at least one night a week.  Their little tortillas are so GOOD- freshly made, and i am especially partial to the flour tortillas.  Smoky, salty meat.  VERY flavorful and generous portions.  The sauces and salsa buffet provide great selections for your garnishes.  Next time  you are in the neighborhood, stop in and pick up dinner for the family- they will thank you!"}
{"text":"I recommend the trepitas and the carne asada tacos!!!! Omfg  it's amazing all sides are always fresh and the meat is so good !!!! Ugh it's a must"}
{"text":"En lo personal me encanto ta carbon. Su carne asasda esta llena de sabor no se porque los comentarios de que la carne no tiene sabor prueben el burrito de asada y los tacls de asada en tortilla de harina estan deliciosos. Gracias ta carbon"}
{"text":"Outstanding food!  Tacos are the best that I have tasted in the valley. Reminds me Cali from where I come from."}
{"text":"Omg. If you want authentic taqueria feels....this is it. So good. Brought be back to nights in Mexicali eating tacos with the family.  Recommend. 100%  Area is a little sketchy....but hey it's Maryvale."}
{"text":"We drove 5 hours and the first thing we wanted were tacos! We ordered 2 lbs of Carne asada and beans. They weren't great, but we were hungry. Family of 6.  By 1:00 am 3 of us were up throwing up and in the bathroom of our hotel. By 4 am everyone was sick. I am certain it was this place."}
{"text":"Found Ta'Carbon by reading other Yelp reviews. We were in the area and didn't know where to eat. It is awesome! We tried several tacos, the Taco Hazz was my favorite. We also had a quesadilla which reminded me of being in Rocky Point, it was delicious.  They were super busy the whole time and I can understand why, it is the place to go for authentic street tacos. everything runs smoothly, quick, and efficient.  Although not located very close to us, we will be back!"}
{"text":"Now this place is the ultimate winner, not only is it already on my list of favorite Mexican restaurants in Phoenix here, it also is worthy of being the #1 taco spot on this list! Ta Carbon is a delicious Mexican place, and their tacos are amazing as well! I mean just look at the picture, pictures don't lie! They are so casual and focus completely on the food, that it's really not shocking that their tacos are some of the best in the valley. Plus their name is hilarious if you speak Spanish"}
{"text":"This might just be my favorite place in all of Arizona. The meat is so ridiculously tender. Plus you get all of the toppings you want! Just a heads up, you pay after you eat! This is the way authentic Mexican restaurants work. They trust you, so trust them. It's great!"}
{"text":"I've been to plenty of taco shops all over AZ and I have to say hands down these are the best carne asada tacos i have had, period. So much flavor in the meat and the salsa bar compliments the tacos great. Taco de cabeza was also very good but the asada was the best. Horchata was good but a little sweeter than I'm used to. Being the best carne asada tacos you would expect the prices to be high but it was very cheap here. You will not be disappointed, guaranteed."}
{"text":"Simplemente delicioso! with the double tortillas you can make way more tacos!   go if you can! you wont regret it, true to the bone! ... I mean to the meat!"}
{"text":"This place lives up to the reviews. Tacos-excellent, burritos-excellent, service- top notch AND fast, condiments and sides- fresh and tasty! If you want fresh, authentic, fast and super inexpensive Mexican food, you owe it to yourself and family to give this place a try. I have a feeling after you come the first time you will be back as I will!"}
{"text":"Don't go here if you're trying to have some fine dining...but do go here if you want authentic, flavorful carne asada tacos with avocado salsa that's probably going to ruin all other tacos for the rest of your life. I highly recommend the carne asada, al pastor, lengua, vampiro and pretty much anything else they have. And always order the coke in the bottle-because it's the Mexican one and in my opinion tacos without coke in the glass bottle is highly lacking. There's plenty of seating the only thing is Parking can get packed. But well worth the visit for no frills, cheap but delicious tacos."}
{"text":"This place is a bit of a drive for me in the East Valley, but it's worth it.  I used to have a go to taco truck  in Phoenix, but one day it just disappeared and we have been looking for comparable tacos ever since. Finally we found Ta'Carbon.  The only thing it is missing is carnitas, but they do the carne asada and al pastor so well that it makes up for it.  It is also immaculately clean and looks recently remodeled."}
{"text":"Just recently tried this spot. Great tacos! I had the Asada and Hazz. Would definately recommend, inexpensive as well.  A cold beer on the side definately compliments the tacos."}
{"text":"Just had the carne aside tacos. They were just okay. Not much flavor in the meat. I did like the salsa bar. When in Phoenix, there are other places I'll head to before this one."}
{"text":"Being from Texas we have plenty of amazing tacos. This place, I love it! Best I've had in Phoenix so far. I plan to work my way thru this menu during my stay. Last night was the Asada burrito. Tonight was the Barbacoa. I have had the  Al Pastor tacos multiple times. No complaints whatsoever. Keep up the good work and thanks."}
{"text":"HUGE FAT ZERO! !!!! Im here this very minute. The food is good BUT the attitude of the workers don't make up for there BAD ATTITUDE!!! They had me running around asking different people for cilantro. come to find out they don't even speak English and we're laughing at me and making jokes about it!!! jokes is on them because I speak read write and talk Spanish and English. AGAIN HUGE FAT ZERO"}
{"text":"Pretty big menu, cheap prices and a super fresh salsa bar make this place awesome!   Not really much about this place is that interesting, except that you order at the walk up bar, they call your name and you pick up your food.  When picking up our order the guy at the counter told us we pay after we're done...well, some pretty lively conversation and a few beers later we promptly ran out on our tab (by accident).  After a few hours my friend realized we hadn't paid and went back to settle our tab.  TaCarbon, just a suggestion, get your payment at time of food delivery!!!!! This place is run sort of like a cafeteria - there's no reason to think you have to go back after you're done eating!  Anyway, the food was tasty! We had the lingua tacos, the pastor plato and Tecate - made for an awesome lunch! They have outdoor seating and some pretty sturdy heaters for the patio - it's a good thing because it was packed inside with a crowd that included a lot of kids~"}
{"text":"My new fave!!! Love the beef and pork! Wish they had chicken, but it's okay. Delicious food!"}
{"text":"I love coming to eat here with friends or family  because they always make everything delicious! I would recommend to anyone who wants some yummy Mexican food to go check it out! They have tables inside and outside and have reasonable prices."}
{"text":"I went to this place expecting to eat some of the best tacos but I was extremely disappointed. The carne asada tacos were full of fat so I had to be picking the fat out of them. The salsa's had no flavor. The guacamole was not from fresh avocados, it was probably from some type of avocado mix. Definitely not authentic Mexican food. If you want some real tacos go to Montebello, CA., in the intersection of Olympic and Saybrook."}
{"text":"Since it has had a 4.5 rating for a while now, I went to see what all the hype was about.  It's a little hard to find as it's tucked away on the northwest corner of the shopping center.  I was greeted in Spanish (no comprendo?!), ordered a Carne Asada burrito ($5.10 after tax), and it was ready no more than 60 seconds later.  It was hot though, but I wasn't impressed with the size.  There was a little topping bar with salsas, pico de gallo, and some other stuff.  I was done eating and out of the place within 4-5 minutes.  Keeping in mind that I was not eating that fast, that should give you an idea of the size.  The taste was decent, but nothing special.  There's a slim chance that I'd go out of my way to give this place a second try."}
{"text":"This place is great!!  I would say their food is a lot better than canelos.  The only reason I would give them less than 5 stars is their horchata.  It has so much milk in it!! Also, they should do cebolla and chile asado."}
{"text":"Best, best, best Mexican food I have ever tasted. Love to see the actions of their chef cooking. Everything tastes fresh and GOOD!!!!"}
{"text":"This place is soooo good. We tried pretty much every taco on the menu and you can't go wrong.   My favourites were the Hazz and the Tripitas.   I'm a native of Phoenix, but I live in Australia now... I miss having authentic Mexican food and have introduced my New Zealand husband to what real Mexican food should taste like. Even though he's not as adventurous with the different types of proteins, he enjoyed the Ta'Carbon tacos...even the huevos de becerros!   Will be going straight to Ta'Carbon next time I'm in Phoenix to get my tacos fix."}
{"text":"My boyfriend and I eat here all the time...best street tacos I've found in the west valley...I have taken just about everyone I know to lunch there.  My only request...open one closer to me!!  51st and Cactus area could use some good street tacos!!   YUMMY!!"}
{"text":"Excellent, inexpensive and authentic. Great service as well! Very friendly though they are busy!"}
{"text":"Carne asada tacos were amazing!! It was my first time going to the place and I always pass it.. definitely going to be stopping more frequently. Staff was friendly as well. My newborn was screaming and I was so embarrassed and everyone made me feel at ease talking about their own child thank you."}
{"text":"Awesome food. Def worth the drive. Tried the caramelos, larazos and carne asada tacos... All delish! Will find a way to come back."}
{"text":"Fast service and delicious food. We ordered a meal for 18 people to be done by a certain time and they had everything ready by the time we arrived. Everything was packed up nicely. The only thing they didn't do was label the items not pack any of the veggies or limes i had to do that myself and it was a bit difficult because it was a lot to pack for 18 people. However the food was super delicious and everyone that ate it agreed. The beans weren't as tasty as expected but did the job. We will order from here again."}
{"text":"So good.  So. fvcking. good.    Do yourself a favor and get some carne asada here."}
{"text":"Wow! Very good food. Came here with my family. We got a caramelos de asada as well as 2 pounds of asada. The beans are super good! Would definitely recommend this place! And good service as well. Very clean!"}
{"text":"We have all been in a lot of Mexican restaurants but the tacos in this restaurant are special. Authentic Mexican tacos. The location is the reason that I gave them four stars also inside the restaurant is a little crowded but yes this is a place that you keep in your list."}
{"text":"While the quesadillas are solid, I come here almost exclusively for the tacos. The mesquite-grilled carne asada with flour tortillas makes for a perfect combination. Equipped over a dozen options, the salsa and sides bar doesn't leave much to be desired. Overall, this place is delicious and affordable."}
{"text":"Delicious! Super hopping place. Good choice of Mexican sodas. Tried the asada and Maxx, delicious!"}
{"text":"Ok...so I know I have said this before, but this is legit.    These are the best tacos in the valley...perhaps anywhere! It wouldn't have even happened had Fajardo's Cafe been open! We had driven out to Glendale and it was closed, so I jumped on Yelp and this place came up!    It's a very small place and if I hadn't read Floyd C's review, I probably wouldn't have found it! (Thanks, Floyd!!!)  It is on the north east corner of 59th Ave and Camelback.  However, it is facing 59th avenue...yeah.  we drove around a few times...then read the review! Oh....gotta love random adventures leading to a diamond in the rough!  You go up to the counter, order...and they hand you a little plate to fill with all of the fixings they have at the salsa bar...which to be honest...they're all AMAZING!!!!  Plus, they have cucumbers, lettuce, onion/cilantro mix, carrots and limes! LIMES!! Remember...I have a lime fetish.    ***the ONLY complaint I have...and it is not even that big of a deal and I won't be taking any stars away is that they don't have cilantro alone...I hate raw onions. Like to the point of having a close to \"ick\" reaction! *** Anywhoooo...  I ordered 2 carne asada tacos and a lengua taco with a side of beans.  The lengua (tongue...yes tongue) is absolutely flavorful and SOOOOOOOOO tender!  The carne asada is probably the most flavorful I have ever had here in the valley!  The beans are amazing and super yummy...it seems to me that they have chorizo and cheese in them.    The service is quick and not so personable, but not rude at all! They are busy and are pretty much just making sure to get everyone their orders!  We will be back! Every Tuesday! ;-)  Wanna know how much we enjoyed our meal?  We each ordered a carne asada burrito to go...for lunch tomorrow!  We never do that!    So who is up for Taco Wednesday? Thursday? Any day that ends in \"Y\"??"}
{"text":"If you want some legit Amazing Mexican food come here!! This place is DELICIOUS!! My absolute favorite is the Cabeza Tacos, but the Carne Asada tacos, Caramelos, Lorenzas, & Beans are soooo goooood as well!!!  If you are a first timer you should definitely order one of everything I mentioned above!"}
{"text":"The meat selection is good and is very flavorful. Try them all n you will understand. Lots of salsa n sides to add to this very affordable tacos/burritos. Must come for great mexican food"}
{"text":"The food is great but it isn't worth your money. I had a carne asada burrito and it was so thin and I paid a more than I usually do for a burrito at a Mexican restaurant. I do not recommend. Plus the customer service here is horrible! I rather spend my money somewhere else."}
{"text":"I thought this place was a great lunch spot. My favorite thing was the steak quesadillas. I really enjoyed the tacos as well. One star was removed because they forgot my tripe taco and I was really looking forward to that. I love their sauce bar!"}
{"text":"The best tacos in Arizona.  Always packed and you need to order by the pound to save a little money.thee best I say..."}
{"text":"I tried the Asada burrito and the el pastor tacos, definitely authentic and awesome Mexican? food. Bonus for the salsa? bar and condiment selections."}
{"text":"Pretty damn good I must say, their beans are crazy, outa this world, so the bean n cheese burro's are worthy of a drive for me. The Barbacoa? Amazing...Asada? a little bland but quality beef so its pretty good, its all grilled on a charcoal (?) bbq rt off to the right, under the exhaust hoods...The salsas are some of the better I have had, but not hot enough..LOL...Overall a high quality, VERY consistent product, I urge everyone to give it a try if your in the neighborhood. BTW, the location is a little tricky for 1st timers, its on 59th about half a block north of Camelback. Its a lg strip mall and its rt next to the auto parts store..."}
{"text":"THE MEAT....I want to write the asada they serve here  a love song; it deserves novels and sonnets and statues built in its honor. But I will suppose this review will have to suffice. This is the most juicy, flavorful meat I've maybe ever had. And the tacos are dirt cheap. Amazing."}
{"text":"Best Street Style Taco in the Valley!!! A bit pricey but worth it! Lengua is the best!"}
{"text":"I'm not sure how this place isn't 5* I'm from Tucson but I live in the east valley about 30-45 minutes depending on traffic & we will take this drive for tacos. It is the closest thing to Tucson food! We don't eat tacos ever in chandler because we haven't found a really good place there. Now I don't want to! The meat is cooked fresh on the grill, everything is made right in front of you, the beans are amazing, they have cevada!! I am not sure that anyone would want to go anywhere else unless they're going to Tucson. Also the customer service is GREAT!"}
{"text":"I come here at least once a week. Not a fan of the burritos but they do taco's very well. Anything you get, carne asada, pork, it's all good. The dining experience is different, you go to the counter, pick what you want, then you either get a tray or to go box for the salad/salsa bar. You pay after your food is done, which is interesting but makes things quick.  This place and La Santisima are my favorite taco places. TaCarbon being the better deal."}
{"text":"A very strong 3.49  I started to wonder why they were almost as many cars here as Jack in the Box and Burger King in the same neighborhood at lunch time.  So last week I stopped in.  It wasn't real busy when I got there at 11 but things were going strong by the time I left.  I decided on Asada because I saw it being grilled.  I got the plate which came with beans and your choice of tortillas ($6.00).  I also got a large Horchata.  Very well flavored meat but a bit on the chewy side which seems to be the norm for grilled Asada.  The beans had something in them which gave them an orange tint and was quite tasty.  The salsa bar was pretty complete but I wish the three different red salsas had labels so I could get the mild one with out having to get a cup of all three to figure it out.  I imagine their tacos, burritos, and quesadillas are all just as good as my meal was.  Contrary to the average Mexican fast food place this one had a fairly small menu and was nicer inside.  There is also a good sized patio."}
{"text":"Oh LORDY.  First things first, I come from San Diego, king capital of delicious Mexican food, so I am super ultra picky and self-proclaimed snob about legit Mexican and all the other Mexican('t) food.  The first time I came here, the carne asada taco transported me back to El Patron or Lolita's in San Diego and I KNEW I had found my favorite place to get my Mexican food fix.  Tacos are crazy cheap - carne asada taco is $1.85, and they have a really hefty selection of things from Lengua (to DIE for, so freaking tender), all kinds of pork, beef cheek, and my go to, the TACO HAZZ.     Let me describe to you the Taco Hazz: It is steak, melted cheese, and green chiles, compiled together for the sole purpose of bringing you to heaven.  Only for $2.10.  WHAT.  I ate 3 of those in 15 minutes and left feeling like I could die happy.   Let's also talk about the sides bar: they have a variety of sauces, veggies, limes, and even whole char-grilled green chile peppers.  Their hottest red sauce is legit hot, which is a rare find in my opinion for a taco place.  All the other taco places I've been in in Arizona had sauces that don't really have a spicy kick to them.  The star of the show though is this incredible smooth and creamy guacamole that tastes really cool and refreshing when paired with the hottest sauce on top of that delicious savory meat and tortilla.   I will drive from north Glendale just to come here.  Now please excuse me as I food coma out."}
{"text":"This has the best Carne asada tacos anywhere in the valley! Full of flavor and pretty good prices! I wish they had more indoor seating but oh well. Service is fast and friendly! I've been coming here forever and can't get enough of it!"}
{"text":"This is probably the most authentic carne asada you will find in the whole entire valley. They use mesquite charcoal to grill their meat. The real sonoran way. Soy de nohales sonora y le pega un quemon a varios taqueros de allá."}
{"text":"Tacos were good...guy taking orders not so good...was rude and made us feel unwelcome."}
{"text":"The carne asada was great... Good flavor, cooked over charcoal... The al pastor also tasted really good... Salsa bar is not bad.. I asked for a side of beans and rice but they don't serve rice... So i ended up with a side of beans only... That was weird... What i didn't know is that my order of beans also comes with tortillas... Not one or two tortillas, but TEN. What the hell am i supposed to do with all these tortillas??? I had a few with my beans but ended dumping the rest... Actually there are a number of weird things going on here... You order your food at the counter, then u get a small rectangular styrofoam plate for the salsa bar (never seen that before... Lil cups for salsa, sure, they had those... But a little square styrofoam plate for cucumbers and carrots... Interesting)... Then when the food is ready, they call your name and place the food on one of those little styrofoam plates right on the counter... They don't use the order number on the receipt or any precise method like that... So if your name is Helen, Ellen might grab your taco... If your name is Eric, Derrick just got your burrito... But assuming you get the food you ordered you wont be disappointed, good flavors... Its all meat for the tacos and burritos... So u end up relying on the salsa bar to add something to your meaty taco/burrito... I didn't mind. Okay, so now I'm done with my food... I guess I'm supposed to throw away my trash (not sure, so I'm just watching the locals to see what they're doing) but they don't give you a tray so i'm stacking all my little styrofoam plates and slowly walking over to the trashcan trying not to drop all these salsa soaked plates on the ground and make a huge mess. I had to make two trips because i had too many of these damn little plates...  Okay so now i'm ready to hit the road... But wait - now i gotta pay. So you got to go up to the counter again tell them your name and the pay the bill... Again if your name is Filbert, you might end up paying for Dilbert's quesadilla (okay, u get the whole name thing now)... But its just kinda weird and inefficient... They also have a drive through window... But they don't use it... The drive through window is boarded up... Overall the food is really good but it could just be organized a little better."}
{"text":"This place is LEGIT.  I wanted some real Mexican food and this place delivered. Order at the counter, grab your salsa from the salsa bar and wait for your tastebuds to thank you. I ordered a variety of tacos and sampled my friend's burrito. The tortilla was fresh and ALL of the meats (we ordered 4 different kinds) were delicious. Tripe was clean and flavorful. Agua fescas also didn't disappoint. We went right before the lunch hour and was able to grab a seat.  Hands down one of the best Mexican restaurants I've been to."}
{"text":"Excellent tacos! The pastor, and asada were both really tasty. The Taco Hazz have asada, melted cheese and green chili and they are to die for. Best tacos in the area for sure."}
{"text":"Love their tacos! The salsas are really good too! The beans are on a whole 'nother level of deliciousness!!  The food is amazing and there isn't usually a wait for your food."}
{"text":"This restaurant has the best Mexican taco. You can have: asada, lengua, tripa, pastor on corn tortilla.  I am gluten sensitive, and only request for corn tortilla and no oil on them. This is my favorite place to come for real Mexican tacos"}
{"text":"Best tacos ever !!! I feel like I'm back at home when eating here, los frijoles puercos are the best in town !"}
{"text":"BEST BEST BEST TACOS EVER. No one else is even close to having that good of tacos. And not only the tacos but the salsa and guacamole is delicious. I never want to go anywhere else. If you haven't tried it yet, do so.  :)"}
{"text":"Damn, may have found my new favorite local Mexican food spot.  The salsa bar is amazing with tons of options.  The carne asada meat was awesome.  Will definitely come back soon."}
{"text":"Best tacos in the state. I eat here every Thursday. Usually start thinking about them around 6:00 am."}
{"text":"This place has some excellent tacos and it definitely is authentic. My favorite is the carbon. Service is fast, and their bar with salsas is great. Plenty of selection for toppings for the tacos. Would definitely recommend trying this place. Prices are cheap."}
{"text":"I'm on vacation I'm originally from Las Vegas,  I was at the Swap meet here in Phoenix and asked one of the vendors what's the best taco place in town and recommended Ta'Carbon, and to tell you the Truth these are Some of the Best Tacos I've had in a while totally recommend this place is bomb had some tacos de cabeza and Lengua definitely the business!. Will be back on our next trip back prices are reasonable you guys definitely need to check it out!"}
{"text":"Legit. 4.5 stars out of 5   Would go back. Great tacos. I don't like writing a lot when the food is good. Just go. Thumbs up."}
{"text":"The best ensenada style street tacos this side of the border.  Way better carne asada, pastor and carnitas than any place in Phoenix.  Give it a try you will not regret it."}
{"text":"YES, finally found a place that makes awesome baja style tacos. These taste just like the ones we get in Ensenada or San Felipe. $1.70 each. I tried the pastor, asada, mix and barbacoa and they were all awesome. My favorite is pastor and their salsas are awesome too.  I can't wait to go back."}
{"text":"The meat is really good here the only thing i dont like is that the rortillas are really really greasy. Other than that its great!"}
{"text":"I felt like I was on  a street corner in Ensenada. Great tacos, and you have to love the homemade looking BBQ grill!"}
{"text":"We went on vacation to Phoenix a few years ago and ended up here. We returned about 3 times before we left (within the week)! We are relocation to Phoenix and the carne asada is the #1 thing we can't wait to get again!"}
{"text":"This place is EXCELLENT. It's seriously buzzing, and the cooks and employees are always kept on their toes to provide excellent service and a clean place to eat; indoors and outdoors! They had heating lamps outside since it was chilly which was awesome!  The only thing I wish they had was a bigger inside, it was packed inside and it was hard to grab condiments (lettuce, salsas, guac, etc) without bumping into other people's elbows :(  Other than that, this is seriously a great place to get Mexican food that I've been to yet!!"}
{"text":"Finally tried this place- went in during the week and after the lunch rush. It was clean and quiet. We were greeted by a young man lacking in customer service skills. We placed our order, served ourselves to the salsa and veggie bar. I tried each salsa and they were all good, however, my favorite was the green salsa with avocado. When we got our order, it wasn't right- 2 of the tacos were different than what we had ordered (young guy lacking skills) but we ate them anyhow. The tacos were delicious.  They have a variety on the menu of items to choose from. Unfortunately they were out of dessert the day we were there, but overall, great food, a bit small inside but they offer outdoor seating. I did speak to the manager regarding the young man- this is why I gave it only 4 stars but the food was five   We definitely will return."}
{"text":"best tacos in phx that i know of so far and for a long time by far my best choice for authentic tacos"}
{"text":"This place is awesome!   Real Mexican style tacos!  Visiting AZ for MlB spring training and decided to yelp a Good taco place.  This place exceeded my expectations reminds me of my trips to Mexico when i was younger.  You could taste the delicous marinated in the meat.  They chop the meat into tiny pieces and don't use the meat fat to fill your tacos.  I can't stand tacos with a lot of fat.  The place is very affordable .. we ordered 7 asada tacos 1 bean and cheese burrito,  1 quesadilla and 2 large drinks. Total was $22.   We will be back for more every time we are in AZ visiting."}
{"text":"I was very disappointed with the carne Asada tacos.No flavor lots of fat in them. My husband usually eats like 10 couldn't even finish 2. Carrots had no flavor. The only good thing where the corn tortillas. I will not be coming back to this place. I'm not sure how it has 4 stars."}
{"text":"This place is always busy and always amazingly yummy. My husband and I found this place by accident and it was a great mistake! We can not wait to go back. Love me some beans with cheese and some cucumbers."}
{"text":"Best Carne asada in town. Never disappoints. All the salsas are great tasting and not jus spicy. I add bean and cheese in my burrito for a filling full or half meal. The Cabeza is Chihuahua Ranchito style which is very rare in this town."}
{"text":"I've been living in Phoenix for about 5 months now and have tried many different taco places and 'ta Carbon has to be by far the yummiest taco place I've found. They're quick, delicious and have fresh condiments ready for you.  I only had their carne Asada which is my go-to taco choice just in case I don't like them, I can tolerate them. But this place exceeded my expectations. The Asada is yummy, I have no doubt that the other meats are equally as delicious too! So I'm definitely coming back to try the variety of tacos they have here and their burritos!  Definitely recommended!"}
{"text":"Best authentic street tacos in Arizona!!! The meat is tasty and is of good quality. The horchata is also very good and tastes fresh. The salsa bar has a wide variety of options which are all great. Definitely would recommend to anybody looking for great tasting authentic tacos! Only downside is that it is quite small with not too many tables."}
{"text":"If you are looking for fast authentic delicious tacos, this is your place! The meat is always great! The beans are a little on the runny side for me. The serve Mexican sodas, waters, and beer! Perfect for a quick lunch, rapid service!"}
{"text":"Holy cow this place is good.  That must be what they are serving, holy cow meat.  They have a nice selection of sauces in at the topping/side bar.  I stick to the pica de gallo because it's nice and spicy, but refreshing against the greasiness.  You can't go wrong with the steak options especially since it's actually the cheapest of the choices(somehow).  If you love meat, you'll definitely love the value and quality of this place.  They grill the meat right behind the counter and it's a spectacular aroma for carnivores.  Only downside is it gets crowded near meal hours, but you can't really blame them for that.  The large seating gets filled up anyway, but they make it really easy for you to take your food to be eaten elsewhere.  Great service(cleanliness and politeness)"}
{"text":"A good place to get some street style tacos. It can get a little crowded at times. Prices aren't to bad. If you have enough people or real hungry. Might be cheaper to get the meat by the pound."}
{"text":"If you want good tacos only get asada everything else is whack   Good variety of salsa bar two thumbs up"}
{"text":"This is going to be the shortest review I've ever written.  All I can say about this place is WOW!!!  So good!!!  Unfortunately I live in Yuma, or is be here all the time.  GO TEY THIS PLACE!!!  Amazing!!"}
{"text":"Disappointment. Tongue taco and a mixto. Zero flavor. Salsa. Zero flavor. Beans. Zero flavor.  They get 1 star for clean bathroom."}
{"text":"Best carne asada in town.  And it's cheap.  There really isn't anything more that needs to be said."}
{"text":"Definite best street style tacos around. Salsa bar is very good. Carne asada tacos are always fresh and tasty. Never a bad meal"}
{"text":"awesome, authentic,  tasty, we lived in Sonora and their good is spot on!  stop by there!"}
{"text":"I had heard good reviews about this place from my husband's brother but was warned that it was a bit expensive for fast Mexican food. When a groupon deal came out for it, my husband and I decided to try it. We thought it nothing out of the ordinary and their portions were small and overpriced. I'm fit and eat healthy portions and found myself needing more than 2 burritos to feel satisfied! That will definitely be first and last time I will be going there as the service was poor. It wasn't so bad that i wasn't greeted or made felt welcomed. What bothered me more was that the men at the counter were eating from the batch they were preparing and while they were putting my order together. That is a major food handling violation. I will not be coming here again."}
{"text":"So I been eating tacos for awhile now lol! I've eaten New York tacos, Chicago tacos, California tacos, and now tacos in AZ, this is by far my favorite place for real authentic tacos Mexicanos. The lengua tacos are delicious, the Cabeza tacos are epic, and the salsa bar, is on point! Give it a try you won't be disappointed."}
{"text":"Yum yum yum everytime! I can't get past ordering the mix burrito. Love love love it be prepared for a wait because this place is popular."}
{"text":"Excellent meat....excellent salsa bar! It's a good thing I don't live near or I would be there all the time !"}
{"text":"If you are craving real south of the boarder tacos this is the place to go! I had carne and pastor tacos and it was exactly what I was looking for!"}
{"text":"Well ... if you read my other reviews you'll know about my Mexican-ness and I can tell you that their tacos are on-par with the best I've had en el D.F.  Sorry if they aren't up to your \"California\" standards. But, then again, California hasn't been part of Mexico since the mid-1800's, right?  All their meats are juicy, delicious, and authentic.  The price can't be beaten.  The only concern I had was that the restaurant is in the middle of the \"'hood\" but if you are judicious in your dress and attitude you won't have any problems.  Please give them a try!"}
{"text":"Let me put it this way: if you like this place you lost your taste buds somewhere, you don't know what you're talking about. Everything mediocre about mediocre Mexican food. Really salty beef masquerading as Carne Asada.   The worst. Can't I give \"no stars\"?"}
{"text":"Absolutely fantastic carne asada tacos. Hubby knows delicious tacos since he is a foodie from mexico and was delighted to find a great taco place in the valley. Recommend getting the parillada/package when having multiple people. It is worth the price!"}
{"text":"This place is without question my favorite Taco Shop in AZ !!!! Period!!  I had no idea what I was missing until I was brought to this wonderful establishment by a friend of mine.  So here's how it works, they grill up the meat and tortillas on a Mequite Fired Grille. You will not believe what kind of flavor it adds to the meat. They offer the standard Carne Asada for the White Boys, but I would stay away. It is far too simple.  If you want to experience some real flavor, go for the Barbacoa, Lengua, Al Pastor, or Tripas. The Tripas are deep fried and so damn flavorful.  They have a ridiculous salsa bar, with amazing salsa's, but you have to ask for the Habanero which they keep behind the bar. They also have fresh cabbage, onions, limes, and peppers with carrots at the salsa bar.  All I can say, is you have to experience the simplicity and mesh of natural flavors. The true experience and blend of flavors is truly indescribable.  The place is clean, super authentic, and always full, even in the morning hours.  it is a straight up Mexican Joint, so learn some damn Spanish and be respectful!  This place is so worth the drive, I now go there at least once a week! I'm craving this place just writing about it.  Trust me on this place, and write a more descriptive review and tell me how right I was by recommending this place. I swear that they put something in the meat to get people addicted, it's that good!  Salute! =)"}
{"text":"As soon as I arrived to AZ we looked for a taco spot and this place did not disappoint! Their tacos are authentic. I usually order Asada tacos ($1.85). The meat is really tasty. Their burrito and quesadillas are good as well.   They have a small station with different kind of sala"}
{"text":"Out of the 4 places we have visited, this one is the best. The service was pretty good, they were all attentive to the customers. The meat is well done, all their salsa is favorable which is not common, price is perfect based on the portion. The reason for the 4.5 tacos is the sitting area inside could have been a bit bigger though the outside has more seating."}
{"text":"A 4 only because it's too small. Food and service is good. But too many people at the salsa bar bumping into each other. Expand this place and I give a 5"}
{"text":"Everything you want in a taqueria.  Awesome grilled meat, good tortillas and fantastic salsas.  Incredible value too."}
{"text":"Very very disappointed! I had heard great things about this place unfortunately it was overrated. I got food for 7 of us. The tacos were extremely greasy yet dry. They are nothing special for sure. No one finished what they ordered. Extremely tasteless. I will stick to my mother's tacos."}
{"text":"I've been hearing about Ta'Carbon for quite some time. And while I didn't quite have my mind blown in the same manner that most people seem to, I did feel their tacos were definitely in the higher ranks of the many, many options that we have here in Phoenix.  My girlfriend and I went on a Friday night. The neighborhood itself is a bit sketchy. I'm not even sure if I'm supposed to be here after sundown. The joint itself is very small and was extremely packed with customers and a small group of musicians. This definitely isn't your white-washed 4 dollar taco shop, that's for damned sure! It's the real deal - or at least as real as you can get for street tacos without buying directly from a truck.  The ordering system is kind of weird. You order your food, they take note, prepare/serve you the food at the counter, and then you pay whenever you're finished. A bit odd, since it's an open invite for people to just take their food and not come back and pay.  I thought their carna asada and barbacoa were both excellent, with a surprisingly good quesadilla offering to boot. Tacos are presented bare, so experiment as you wish at the salsa bar.    Are they the best tacos I've ever had in Phoenix? Not quite. I feel that Backyard Taco in Mesa has them beat, but I'm definitely not discrediting this place. If you're into authentic street tacos, you'll be quite pleased.  Recommended!"}
{"text":"Wow .. Idk how pple can drop anythg less than 4 stars here ... The valley or whatever AZ natives call this place suffers from great Mexican food. I challenge any1 to find a better \"taco\" shop w an expanded menu, beer, patio, fresh grilled meats behind the counter n an overall kick back low key atmosphere w easily the best salsa bar I've seen - Been coming here since 08 .. The carne asada is amazing n the staff has always been friendly!"}
{"text":"I used to love going to this place until I got EXTREMELY sick having lunch there. Can't go back now and it's a shame... I had the chicken and pork tacos..."}
{"text":"This place is great. Love the tacos and salsa bar. Favorite taco is the hazz. Looking to try a quesadilla maybe as I hear great things.  Try it."}
{"text":"Some of the best street tacos in town!  I have not tried other things on the menu, so I am not sure about things, other than the tacos.  Whenever I am in the area, I stop by, because they are that good."}
{"text":"love the concept of serving your own condiments and paying for bulk cooked meat. Definitely in close second to best pastor I've had in Phoenix."}
{"text":"If you want authentic Mexican food, this is the place to go! I ordered a bean and cheese burro and a steak quesadilla. My friend have the carne asada tacos and both of us could not have been more pleased! The most flavorful carne asada I've had. We will definitely be returning!"}
{"text":"This place is packed and you know that when we are the only gringos in here that's a good sign!  The condiments bar was great and we liked the pastor tacos a lot; the asada ones were ok and the quesadilla was also very good."}
{"text":"Delicious tacos and burritos. This place is a must try. Prices are very reasonable. I get the mixto platethay comes with carne asada and Al pastor and includes beans and rice along with tortillas for less than $7. They have different salsas.   They accept cash or cards. The only thing about this place is that it has a tiny parking lot. It's always packed and truly delicious food, it's a must try!"}
{"text":"This is by far the best Mexican food I've had in phoenix! The beans and carne asada are great! Great customer service!"}
{"text":"Its freaking good my favorite its the campechano burrito and agua de limon Tripa in this place its bomb Really recommend this place"}
{"text":"Off top one of the best street tacos around. Bomb quesadillas to. Never regret going here."}
{"text":"I love their quesadillas with carne asada I think that's the only thing I have ever gotten here but it is so delicious (greasy though like really extra greasy)"}
{"text":"Now this is the place to come for some real good tacos. Price is inexpensive and you get the real deal tacos. Flavorful carne asada fast service and salsa bar.  Staff is real helpful for those who can't make up minds. I like this place because I know I can get some good eats with family and friends. They do have an outside patio with plenty of seating for a group. Now this is how you eat simply and deliciously."}
{"text":"This is what I've been craving since I moved to Phoenix 6 months ago. I'd move in next door if I could."}
{"text":"Mother of all authentic Mexican Taco Bars in Phoenix. The Salsa Bar here is wow. Carne asada plate. These guys are serious."}
{"text":"Quick and fast service! Quite salty though. You just need to make sure you stock up on the lime at their salsa bar."}
{"text":"Their carne asada tacos are delicious. They brought me back to when I lived in Mexico. The carne is cooked on a wood grill. No eating here should be a criminal act."}
{"text":"Good lord this place is like Christmas in your mouth... authentic and flavor is on point. Go, you will certainly be hooked I am sure!"}
{"text":"Hands down the best tacos in town!! The carne asada with flour tortillas are my favorite! Pastor are my second favorite.  If you feel adventurous I also recommend the tripa (crispy beef intestine). Seriously.   The tortillas are what really make the tacos. According to the owner, they import them directly from Mexico twice a week!  Don't forget the salsa bar and make sure to add some lime and green guac sauce with your favorite salsa to your tacos- the runny guac mixed with the lime and salsa will create an explosion of flavor in your mouth.   Paying at the end is a great convenience especially for a larger party or with new guests as you may not know how much you'll like these tacos until you take your first bite and you'll keep asking for more!"}
{"text":"Sometimes I wake up in the morning CRAVING carne asada tacos from TaCarbon. This place is the real deal. The employees are amazing and the food is delicious. My coworkers and I plan our week around when we can get from Tempe to Glendale for taco day! Thanks to all of the guys at TaCarbon for always being so great!"}
{"text":"Their meat is always great and fresh. It doesn't have much fat. These are the most phenomenal street tacos I've ever had in my 19 years of life. The workers are so kind and generous. I love Ta'Carbon !"}
{"text":"I made a quick stop after the Dodgers spring training game. The food was great, I got 4 tacos and one of them Gringas ( a mixture of meats) . I gave 4 stars because it's small. They have outside seating but since its a popular place, sitting can be difficult. Overall, it was great and I would definitely go back."}
{"text":"Anything you want! There's the menu, which is amazing, then there is whatever you want, they'll make it happen. In house pit fires and stand prices that make you happy. Pay after you eat, when your satisfied."}
{"text":"GREAT FOOD. If you want good tacos, come here. I have only been here once, but will be returning. Portions are nice, you leave full, and staff is friendly. The only reason this isn't a 5 star is because it was confusing to pay. They write down your order, make it, and then they have to search for your ticket in order to pay. Seems like the honor system, and I hope people don't walk out on them. If you paid up front, or they had a separate area to pay, this would be a 5 star review.  Go for the food. Don't let the paying process deter you."}
{"text":"Awesome tacos! I'm giving it a 4 because it was very crowded. The salsa bar was not in the best place for such high volume. Too close to the tables by the wall. People were over each other. The food was great tho !"}
{"text":"This little place has the best tacos I've had in the area.  The way they cook all of the meats right on the coal fired grill behind the counter, along with the various toppings, makes for a brilliant little place to stop in for lunch.  My only regret about Ta Carbon is there is no location in the east valley!   I have a feeling they'd make a ton of money out here, as there aren't a lot of taco shacks with amazing food.  I just wish I lived closer."}
{"text":"i went for the Tacos Al Pastor.. was not very impressed. Carne asada was pretty good, cabeza did yhe job but was missing something. late night post drinking spot for sure! didnt quite suffice my taco craving."}
{"text":"One of the first times I ever had cheek or tounge. Very good carne and even better salsa to go with it."}
{"text":"I come here every Friday, I drive about 45 minutes to get some tacos, but these tacos are not like any other tacos! The way they cook their meat is very flavorful smokey, VERY DELICIOUS! you order your food they keep your tab up front just in case you want to add on to your order WHICH YOU WILL because it is so good. SUPER CHEAP and you get your moneys worth! THEIR salsa station has a variety of toppings and salsas ranging from mild to HOT HOT HOT. There roasted jalapenos are so good! VERY PACKED all the time, waiting time for your food is fast though. They have a very friendly staff! i highly highly recommend this place!"}
{"text":"Best taco joint in phx! Carne asada plate with chesse and beans and side of corn tortillas is the best you will not regret it and the salsa bar is an added bonus! Best place to go!"}
{"text":"The asada is good taste like charcoal but there pickled carrots are bland and their salsas are flavorless."}
{"text":"I have eaten tacos from countless establishments in PHX over the years, I would have to say the meat here is this best I have ever had. Its cooked over over a coal fired or wood fired grill and has a smokey char taste to it which is heavenly. Been here a number of times and have only had the carne asada tacos. First time here came at 9:30 pm on Friday night there was not an open seat in the house. BTW I was the only white person in the whole place of about 40-50 people. Lol.. The place is very clean and welcoming, the salsa bar is very fresh and has a good selection of fresh salsas and veggies. The staff is on point, very professional and friendly. You wont find better Mexican food at the prices here."}
{"text":"Best places for tacos in Phoenix!   Ta'Carbon is not only clean, fast, and delicious, it's about the only real tacos in Phoenix. The staff are friendly and bilingual.   I would recommend the wire plate or alambre in Spanish. It's a mixture of cheese, onion, peppers, bacon, and beef with your choice of flour or corn tortillas. A side of beans with cheese and an horchata to drink and you won't regret spending a single dime!!!"}
{"text":"Tacos are good. This place is super. It's expensive for me, but it's justified for dozens of tacos that we eat in one sitting. Absolutely beautiful place. I recommend, you will always be full."}
{"text":"I don't care if I yelped their original location years before it was cool, this place tastes just as great. You need to hear it again. In addition to a fresh salsa bar with great variety (like limes for days!), and amazing grilled meats (like the best asada in the valley), this one has great, quick service.   Also, the best bean burritos on the planet.   I guess the only thing you can criticize them for is a lack of seafood options, but you've got like a million other places to indulge in questionable ceviche. This place is amazing at what it does, and it shouldn't be a surprise if they open up a third location in the near future.  PS- their staff didn't even judge me when I decided to be basic for once and have tortillas de harina. They're nice!"}
{"text":"I can't find a better Mexican grill anywhere. I'm addicted to their pastor, asada, and quesadillas. Their service has improved, so it's only a few minutes for my meal on even the most crowded days. And the prices are modest for the quality of your meal. Next time you're in the west valley and want Mexican, come HERE. If you had another place in mind, I doubt it's as good!"}
{"text":"One Word AMAZING!!  You can't go wrong with this place,  and the price is right.  It was pretty busy yet our food was done in no time.  I tried, Taco de asada,  adobada, barbacoa, taco hazz( which has melted cheese, green chili)  and they were all bomb. They also have authentic Mexican sodas, I had their horchata nothing special but good.   It was pretty crowded inside but great thing they have outdoor seating!"}
{"text":"Delicious authentic food! We had carneasada tacos and they were perfect! The drive from Mesa to Phx just for the food, was worth it!"}
{"text":"Freaking amazing tacos!!! The beef was great, the avocado salsa was amazing and the corn tortillas were super fresh but the absolute best part was the lengua!!!  Let me tell you, this place does it RIGHT. Fall apart tender and bursting with flavor. I'll be back specifically for the lengua. It's worth the trip all the way down the 17 for me!"}
{"text":"Ta'Carbon is my and my fiance's all-time favorite place to get tacos. I always get carne asada tacos with lots salsa, onions and cilantro, and a squeeze of lime juice. Perfect! They are the best I've ever had. The salsa bar always tastes fresh, with lots of flavorful salsas. Everything from the meat to the corn tortillas to the salsa bar is great. The guys at the counter are always friendly, and they let you pay at the counter after you have feasted on your delicious tacos. I have no complaints about this place."}
{"text":"Delish... spicy... flavorful... quick. Love the salsa bar. Reasonable prices, great service and tasty authentic Mexican offerings. The alambre didn't disappoint."}
{"text":"My favorite tacos in town, the place is always clean, and the salsa bar is always fresh and organized. Great customer service, and affordable prices. The \"plato de asada\" is one of my favorites, comes with beans on the side and several tortillas to make your own sized tacos. The \"aguas frescas\" are always tasty and served cold, I recommend trying horchata which is (mixed rice and cinnamon)."}
{"text":"Sheesh, bless you Yelp for helping me navigate through bad taco infested waters to find places like this. Maybe my reviews are normally positive which would take away from credibility, but keep in mind I only go to the highest rated places. Hard to get your heart broken that way. Anyway, two thumbs up for this place and it's smoky flavored meat products."}
{"text":"Unbelievably authentic Mexican style grilled meat.  The salsa bar has everything you could want. And I dare you to beat the price"}
{"text":"This place has the best tacos in the valley.  I've tried so many places only to be disappointed... Finally found the best carne asada tacos. Everything is fresh to order right in front of you. The service is great, staff is friendly. It's a small place but there's plenty of outside seating. Sometimes I wish they were open after 10pm for a late night meal.  This place is totally worth the drive of you are not in the west valley. You will not regret it."}
{"text":"This is definitely authentic Mexican food. I ordered a Plato (tortillas, beans, and your choice of meat) and quesadilla. Salsas are on point. You pay until after you eat, which makes it a home-like experience."}
{"text":"Tacos were amazing.  We loved the salsa bar.  They kept the tacos coming and our tab open.  We just kept going back for more. Thinking Christmas dinner here next year!"}
{"text":"I am sorry.. but coming from California my taco standards are high and this place only gets 2 stars because it was open when we went to eat eat.   No flavor on the Asada or Pastor. No flavor on the salsas. Now I know why everyone was asking for the salt.  I feel bad for the locals if this this the \"go to spot\". I would rather had gone to jack in the box and got those tacos.  I don't recommend this place."}
{"text":"Amazing street tacos!!! This place is the best hole-in-the-wall taco shop. Their meat is super delicious and they prepare your food fast. Great prices and friendly cooks. All around best taco shop in Phoenix so far!"}
{"text":"Great Carne asada tacos....real authentic!!"}
{"text":"So it was Tuesday and ofcourse I wanted tacos. Worked out well because I was in the Phoenix area. Low and behold this place not only had great prices, but they have a \"Mexican\" salad bar with veggies and salsas. And they sell beer.  All I want in life it to enjoy my tacos with a beer. Coronitas to be specific.  If you are in the area, this is a must visit. And not just on Tuesdays either."}
{"text":"Very bad experience unfortunately. I really wanted this to be my new taco place! First they got my order wrong. Something was missing. Since we determined I had not paid for it since it was forgotten to he written down, I decided to pay for the missing item. The guy who took my card instead accidentally charged me for the original order. Now my bank has froze my account for fraud since the two amounts were the same. To top things off the guy said he would give me the last item free and refund my money.  He only refunded half and did not give me my order..... Never coming back here again....."}
{"text":"Legit Carne Asada done right! Worth the drive! Salsa choices are delicious too! We will definitely be back!"}
{"text":"I'm from Cali and we went just to watch the dodgers play camelback...I asked my comadre what is good out there she said \"ta' carbon\". We went to check it out...........we took the first bite and literally my brother and me looked at each other and he said these are the best tacos I've ever ate aside of my moms food lol! My mom was sitting right next to him! I couldn't agree more to me the asada and the tortillas de harina! They are delicious. Many people rave here about the frijoles. I must admit Sonora has a different way of eating tacos...but hey I'm not criticizing if anything the food is soooo good so flavorful and the tortillas de harina are to die for! The staff is quick friendly and efficient! Muchachos gracias...la sacaron del parque!"}
{"text":"Excellent asada. We loved the hazz plate with asada, green chillies, melted cheese, beans and tortillas. The caramelo was tasty as well.  Be warned, this place is small, there is a hot grill and it is fairly steamy in there. You walk up to order but pay at the end.  There was some great salsas - we didn't try every single one though."}
{"text":"We searched for a Mexican restaurant and were not disappointed in Ta'Carbon. We weren't expecting a \"fast food\" place but our food was delicious. I had a burrito that was big and very flavorful. A real Mexican treat."}
{"text":"Why are there almost 5 stars for this place? I went here last night because of the high rating. I got there about 40 minutes before they closed. The service was fast... But the food was greasy. Greasy quesadilla, Greasy tacos, Greasy loaded potato. Ma'an I'm not coming back, & fear the backlash!!! IYKWIM"}
{"text":"Omg where do i start i freaking love this place for street tacos! They have a bar with different salsas and toppings for your tacos. I would recommend the hazz plate it's so good. Also have a good experience here."}
{"text":"Great food for pocket change.  Let me explain, $1.75 for an asada taco or marinated pork taco.  If you are really hungry go for the asada burrito and $4.50 later you could feed yourself and a guest.  If your thirsty buy a 12 ounce 2.50 Tecate to wash it down.  Seriously inexpensive and great grilled flavor on the meat.  Maybe because they have an open fire grill inside.  Just be prepared, its gets warm inside maybe in the 80s when I was there and with the crowd of people ordering to go it gets warm.  Just slightly uncomfortable hot, like almost breaking a sweat.  If you can't deal with it order to go the meat is worth it.  Also please don't go here expecting great customer service or a great atmosphere, this is a simple 35 max capacity room that grills meat.  Go for the food and that is what my review reflects.  I did not go here expecting red carpet service, please do the same and bring a hearty appetite.  If you are looking for this place it is not on the main street of camelback it is situated facing west and is north of the Orileys auto parts.  I was almost disappointed because I went at night and it took me 5 minutes to drive around the almost abandoned shopping center to find it on the far north corner.  It also did not help all the windows are blacked out at the restaurant.  I will be going back for a to go order so I can impress my coworkers with my new found asada burrito that puts all others to shame.  Till I find another great place I have conquered the quest of best lunch burrito."}
{"text":"You should smell the smoke from their wood-fired grills. Simple and clean flavors with a salsa bar. Super fast and amazing prices."}
{"text":"Came to Arizona for a week on a business trip and wanted to get some authentic Mexican tacos. I was not disappointed. The meat tasted exactly like tacos from Mexico and they even have that \"watery guacamole\" they also give you the option to eat the tacos on a flour tortilla which is a plus. They were really quick as well. Overall really good service and delicious food  definitely stop by!"}
{"text":"We come here every time we are in Phoenix! Place is amazing and super cheap!!! Authentic Street Tacos."}
{"text":"~$2 Tacos  YUM. As authentic as it gets. I love that you can find all the \"weird\" stuff here like cabeza, lengua, tripa, etc. As much as I love the al pastor and asada, I haven't found too many places that offer the other stuff. I love that they pack the tacos with meat! They give it to you plain and you can add whatever toppings you want from their salsa bar. I loved everything except how grainy their horchata was :(   Service was fast and friendly. I got my food within 5 minutes of ordering. Tables were clean. I'll definitely be back for some more tacos!   Environment: 4/5 Food: 4/5 Price: 4/5 Service: 5/5"}
{"text":"Ta'Carbon - Perfect Score! 43rd Ave & Thomas Cost: $2 Service: 5 of 5, Super friendly and nice! Very clean, and inviting.  Presentation: 5 of 5, put on your own toppings, come wrapped.   Taste: 5 of 5, Fantastic! Real charcoal grill taste, smoke and seared in flavor. Great Carne, Tripa, and Cabeza. These guys really focus on doing it right!"}
{"text":"This place is legit good tacos and quesadillas. Order a load of stuff was 30.00 4burritos , 12 tacos, and some. Will be back"}
{"text":"This is my favorite place in Phoenix. By far. I drive 20 miles to get there at least once a week.   Asada is tender and flavorful thanks to the mesquite grill and great cooks. Salsa bar is very generous, grilled jalapeños are great. Fantastic prices, too."}
{"text":"First off to all the haters who expect seating to be like a Cheesecake Factory, shut up and get a taco at Cheesecake Factory.  The valley is littered with \"gourmet taco\" joints that taste like hipster shit. It's one of the most annoying things about Phoenix.  Tacos are hard to screw up but Phoenix manages to screw up almost every taco it makes... BUT then there was Ta Carbon...Ta Carbon is easily the best taco spot in all of Arizona.  Best salsa bar, best tasting meats, and fast service every single time i come here. It is a tight fit at this location, but some of the best food I've ever ate didn't come with a lot of space, and i don't go to a taco spot to stretch out and enjoy shitty food, i go to destroy amazing tacos. If you've travelled to Mexico and are comfortable around crowds, then you'll love this place.  If you've never been outside the reaches of Scottsdale and enjoy elevator music and Calvin Klein underwear commercials, don't go here, its not for you."}
{"text":"Hands down best tacos I've ever had the meat is always fresh after trying this place it's the only place I go to for authentic tacos that salsa bar is always on point you can help yourself if you haven't tried this place your missing out it's the BEST"}
{"text":"I had the Carne Asada and port flour tacos.  Great flavor, fair price.  Seating area is no frills, but very clean.   Ill be back."}
{"text":"This has to be the best and most authentic Mexican food in phx!!! EXCELEENT carne asada, and tortillas are fresh."}
{"text":"Me and my friend were in the area and decided to stop here for lunch.  I'm always down for some good tacos and this spot looked pretty legit.  From the sound of it, it reminded me of Tacos El Gordo back in SD kind of.    We walked in and placed our order.  I got 3 carne asada tacos on corn tortillas (I noticed here in Phoenix, they give you the option most places..corn or flour) and I got a small carne asada caramelo (quesadilla/mulita).  My friend got some carne asada tacos and some lengua I think.  We had Mexican Cokes to drink.  Quick rundown on how everything was...............  Carne Asada Tacos ($2.00)-  Legit.  The carne asada was cooked over charcoal and had good flavor to it.  Minimal gristle/fat which was nice.  They come plain on double layered corn tortillas.  I topped mine with some onion/cilantro mix and some hot sauce.  They were pretty good...best carne asada tacos I have had so far in Phoenix.  Caramelo ($2.50) -  This was a mini quesadilla with carne asada.  It was filling and delicious.  Same good carne asada and a good helping of cheese.  I would definitely get one again.  They have a larger size too (probably in a flour tortilla) for like $5.00.  Total for everything was around $20.00.  My friend bought me lunch which was awesome and much appreciated!  I even scored an extra taco because she couldn't eat her last one.  When it comes to an additional taco, don't have to tell me twice...ate that sucka in 10 seconds flat!  I could see myself coming back.  This was the closest thing yet to reminding me of Tacos El Gordo or Tacos El Poblano in SD.  The guys working there were friendly and personable.  Nice little spot!"}
{"text":"I had been to the other Carbon a few years back, and thought it was excellent.  I was craving some kind of carne asada today, so I decided to stop by here.   I went with a carne asada plate and told the guy I just wanted the carne asada, no beans/rice/tortillas.  Just under $7.00, I was handed my plate and took it out to the car.  Open it up and it had beans on it.  The beans kind of shifted around and got into the carne asada which was whack.  Flavor of the carne asada was good, but the portion was a bit skimp and also had a couple pieces of gristle in it.  Was it good?  Yeah, it was alright.  Will I be back?  For a plate, no.  For tacos, eventually, yes.  Service was quick and friendly, and they do have a nice salsa bar (salsas, cucumbers, onions etc.).  Once I can eat carbs again, I'm sure I will try them out once again and get some tacos or burritos."}
{"text":"Amazing, flavorful, delicious, mouthwatering, best, mouth-gasm...  These are a few words that popped into my head while eating here. Their food is amazingly flavored and well made. I would eat here everyday if I were closer. One downside is that they have a \"no firearms allowed\" sign on their door. That's the only thing that pissed me off. Buuuuuut... I did come here for food, not target practice."}
{"text":"Excelente tacos and beans their beans are seriously way delicious. Order a big order to go home so you can upgrade your lifestyle a little bit.  Tortillas are super fresh too like you wish your Nana had dozens of these on deck you wish."}
{"text":"La mejor comida Mexicana en TODO Phoenix, grata sorpresa encontrarme con linda gente de mi querido Agua Prieta. Gracias por la atención Aldecoa."}
{"text":"Absolutely excellent. My wife and I found this place on Yelp and loves it. Everything was cooked to order and their salsas were off the charts!"}
{"text":"Love the carne asada tacos here.  One of my favorite spots for getting tacos and you get yummy grilled onions too."}
{"text":"The best carne asada tacos I've had in Arizona, maybe anywhere else too. Place is always packed so you knows it's too notch."}
{"text":"Just the smells walking up to this place get the mouth salivating. The smell of burning meats is just intoxicating.  It is lunch counter with a few tables inside and a few tables outside.  Very simple place with some kick a$$ food.  Some of the best beans I have had in a long time.  The street tacos were insanely good and I could have eaten a dozen of them.  Definitely a place to return to when in Phoenix."}
{"text":"Whatever you do you use cash at this restaurant I went there and use my debit card by the time I got home they put a $52.78 charge on my card for a freaking bus pass on a shuttle bus to Mexico. Whatever you do you  use cash do not give them your card they leave the register and go out of your sight and that's when they do stuff with your card. A bunch of Thieves I would never go there again as long as I live I don't care if their food was laced with gold leaf a bunch of crooks hope they rot in hell. I've been trying to call their restaurant for the past 20 minutes since I saw this charge on my card and of course I can't get through to anybody. I'm going to call the police and have them meet me over there I'm not putting up with this."}
{"text":"This so far is my favorite taco spot so far in AZ ,  All kinds of meats and tacos and burritos, This place is always packed so get a table asap when available"}
{"text":"Probably some of the best carne asada tacos I've had in the Phoenix area.  This place and Tacos Sahuayo are probably the two best around in my opinion.  I'd have to eat them back to back to make decision as to which one is the number one best.  This place also has a salsa bar which allows you to pick out some salsa/sauces/veggies for your tacos.  Sure this place isn't perfect- it's small inside, they have a strange ordering system (you pay after you eat, even though there is no table service) and there is a lack of beverage selection, but the tacos make it all worth it.  Trust me.  I've had tacos all over the valley and these guys do it right."}
{"text":"Terrific tacos!  My hubby and I drove across town to lunch on these meaty delights. I am particular about meat and the carne' and pastor were perfectly spiced and tender to the tooth. We enjoyed both the corn and flour tortillas but my vote was for the flour, delicate, buttery and tender.  Worth the drive. It was packed before 11:00."}
{"text":"Great food at a great price. The place is kinda small but the food compensates for it! Love the salsa bar. It is kinda loud but what do you expect from a place that is fast and cheap in prices. Nothing beats like tacos made from scratch especially the tortillas."}
{"text":"Well, I found it. I finally found it. The best tacos in Phoenix. Hands down, no question, it's not even close.  I've lived here for about 4 months now and have been to about 20 different taco stands, joints, holes in the wall, trucks, and high end eateries who think charging $3.95 for a street taco is warranted. Damn them, I tell you! Damn them all to hell!!! TaCarbon is the real-deal-Holyfield, my taco loving compadres!  Nothing pretentious here. Not even plates. Everything, I mean everything, gets served on little styrofoam trays. Don't expect to sit down and have a waiter come to your table and take your order either. You walk in, go straight up to the counter, order your food, grab some sauces, and take a seat. They will call your name when your food is ready. The place is small, jam packed, hot, with a line out the door. And you better know what you want when you get to the counter....patient customer service isn't on the menu.  The food, however, makes up for all that.  The tortillas are exceptionally yummy. I don't know if they make them in house or if they are delivered from somewhere else, but they are the best tortillas ever.  The Hazz (taco or burrito) is the best. Carne asada with roasted peppers and melted cheese on corn tortillas. Insanely good. I had a Hazz taco and burrito.  The Lorenza is another little nugget of heaven that you need to try. We tried almost every taco on the menu and we weren't disappointed with any of them.  If you want to taste the best tacos and burritos in Phoenix this is a place to go. The carne asada is amazing, the tortillas are out of this world, and the sauces are excellent.  Is it in the best neighborhood in town? No. But there are kids and families in a fun and relaxed environment.  Indoor and outdoor seating, oh, and ice cold cervezas!!!  And finally, each taco is under $2!!! Viva-la-good-deal!!!"}
{"text":"Holy guacamole this place is AWESOME AWESOME AWESOME.  Talk about authentic Mexican food.  Perfect flavor, awesome service, restaurant was clean.  They had a great variety of items.  Everything is fresh and made to order.  I can't say enough good things about this place.  I tell EVERYONE about it.  Best in the valley by far."}
{"text":"Great food, food comes out pretty quick considering how packed the place was. It's no frills but super affordable and it has a crazy amount of flavor. Watch out for the salsa though, it's crazy spicy but good. It's off the regular path of hip food joints but it's worth the drive if you want some just plain really good Mexican food."}
{"text":"Seriously legit tacos here. Meats are all amazing. Actual big chunks of tender lengua. Horchata is good as well. Just some talented gentlemen workin away back at the impressive grills coaxing consistent awesomeness out of their magical meats. Great prices as well."}
{"text":"Best tacos I've ever had in the US!!! I'll definitely be coming here again!!  I tried the carne asada, barbacoa, hazz taco, and caramelo all were delicious! Horchata is good too."}
{"text":"This is by far my favorite place to purchase \"tacos de tripas\" yum. Everything else they cook is also very good and fresh. Love that they have a fresh salsa bar"}
{"text":"Best carne asada tacos around.  We always get the 2 pounds of carne asada to go.  It comes with tortillas, salsas and all the toppings.  You can also mix the meats.  You can get one pound of carne asada and one pound of the other types of meats.  Can't go wrong here.  Try it out and thank me later."}
{"text":"Food was aaahmaaaazing and a great price. Me & my 2 kids ate for under 20 bucks. It was extremely crowded... probably the only downfall to this place because it was like waiting to get into the club. But we'll still be back. And if its super crowded again we'll just grab it all to go. :0)"}
{"text":"This is an authentic meet eatery . Carbon fully flamed at all times you happen to walk in !!  This restaurant is great to eat and also to take out .  I was a little confused on the payment strategy !!  They have two locational as far as I know . The only thing is go to restroom before you go there. Bathrooms are not dirty but have a string smell . It seems to be water r from street sewer !! Other than that amazing spot !! To have real meet !"}
{"text":"Me encanta ir a comer ricos tacos de carne azada ellos ofrecen paquetes familiares de 1 o 2 libras muy conveniente para llevar a casa...lo único que podrían mejorar es rentando otro lugar más grande porque se llena a manera q ya no cabe uno y creo que este es un buen problema que lleva a una mejor locación!!"}
{"text":"Best carne asada in town, hands down. Salsa bar is always fresh and well stocked. Restaurant is always clean and service is fast."}
{"text":"So I ordered the Alambre. Wow wow wow. The carne is cooked over the wood fire. Nice smoke flavor from the BBQ. The tortillas were fresh and soft. The salsa bar has everything you need and fresh. Homemade salsa. Fresh cucumbers. They have grab and go grilled jalapenos. The staff is polite and help you if need assistance with menu. The restaurant has tables indoor and covered patio. The place was clean and neat. I have family in Mexicali Mexico and this little place here took me right back to the place we go in Mexico. When you are looking for Mexican food, you should want to be taken to the home land through the food. This little place sure takes you there. If you have never been, go see these guys and they will take you were need to go."}
{"text":"Get a double Family pack of Carne Asada, corn tortillas, a big order of beans as much salsa and limes as you need. This meat is grilled over charcoal for super flavor. As good as anywhere in Sonora or Jalisco. Get this to go on a Friday night and you will eat like a King all weekend and be a Family hero. Don't be shy the very friendly staff will help you when you step up to the left side of the counter. Get a take out styrofoam to go carton to put your salsa and vegetables into to take home.  If this food tastes like the homemade carne Asada your friends serve you should not be surprised to find out they really picked up a to go meal from Tacarbon. Open until 10:00 and you can eat on the patio.  I love this place."}
{"text":"I have eaten here about 60 times. Get the Carne Asada Family pack 2 lb size. Get an extra dozen homemade corn tortillas. Get all the salsa and limes, carrots, jalapeños, etc from the salsa bar. You can fill up a big square take out container so you can carry it out to your car in one trip. This is fresh cut meat, salsa and verduras. Cooked over real charcoal just like in Guyamas, San Carlos, Puerto Vallarta or Guadalajara. And way better than any place in Rocky Point. Get a quart of beans and take it all home to feed a house full of people who will think you have a relative from Mexico who owns a Restaraunt. Every other place I ever get Carne Asada street style or ranch style tacos anywhere else I just wonder why did I pay twice as much and get stuff that was not fresh THAT HOUR, NOT JUST THAT DAY, like I get at Ta Carbon. You can call your order in ahead of time and you probably only have to drive an extra 10 minutes from north Glendale to get to 59th Ave just North of Camelback. Take it from a Native Arizonan and try this wonderful place out. You will find helpful an courteous personnel to help you get your order just right. Just walk up to the left side of the counter to place your order. It will be crowded, but don't worry they see you. You will be craving this food at least once a week."}
{"text":"This place is amazing! The tacos taste like that just like across the border. Whenever I'm in town this is where I'm headed."}
{"text":"Can't leave here, without feeling sorry for everyone that thinks this place is a \"5 Star Mexican place\". Coming from SD, this place would close down in a month if they opened there. Had the carne asada burrito. It was okay. Good flavor but cheap meat. Chewy and fatty"}
{"text":"Pretty packed... Limited seating but good food! Salsa bar on point! Had barbacoa, lengua, tripas, and taco hazz. Barbacoa was tender and delicious... Lengua also. Tripas were good I like them a little more crunchy opposed to chewy but they were good. Taco hazz it was steak with green chili and cheese... It was good but when I go again I'll probably stick with the barbacoa. The hubs had carne asada and he said it was good! We will be back! Prices are great!"}
{"text":"Tacos are delicious and their salsas are good too. Their horchata is amazing. Best taco.place ever this place tops it :)"}
