{"text":"Don't go to this restaurant got food poisoning from the shrimp burger. Service not good waitress with attitude after receiving a bad tip and bragging about to her colleagues. The menu is over priced would not go back ever again."}
{"text":"I attended a benefit dinner tonight I was looking forward to the food, what a disaster. The smells in the air really threw me for a curve. Then the food arrived, I've never had a fish dish that STUNK so bad. That wasn't the end of it ,the porc dish was tough &dry. Looked great on the plate but that's all she wrote. Positive points, service was great except for one waitress who did not know what to do when I said I was Allergic to shellfish. Although another staff member quickly corrected the issue.  All show no go. It was my second time here first time was better but they could not get medium rare right so I just ate the filet mignon, it was medium well. The place is busy someone must be satisfied or maybe its the ambience which I enjoyed , the staff is super friendly . Probably the friendliest I've experienced in a long time. It was a set menu, that tried to hard and failed. Third time's a charm"}
{"text":"The decor 5 star. The service 5 star. The food and the main reason to eat at the restaurant 1 star. I Ordered the grazed meat. I hated the sauce that they put on it ."}
{"text":"We went with my boyfriends' parents who were visiting us - they are from Western Europe. We went also with our 3 year old daughter. It was during lunch hour. We loved the food, my parents-in-law fell in love with the braised beef. My daughter had the mini-burger & fries, absolutely cute meal. The service was very friendly, the decor was OK, we had a great time at this restaurant. A little pricey though. The place was also empty when we went so I fell like a lack of atmosphere."}
{"text":"the service was nice, but the food is SOOOOO overrated. I always pick the most expensive meal to make sure that what I eat is good. Turns out it was disgusting, felt like white people don't know how to seasoned their meals. It basically tasted like salt, pepper, and Ice. OH AND THEIR SALAD,  I DON'T KNOW IF THEY THOUGHT I WAS A GOAT OR SOMETHING BUT SERVING SOMETHING SIMILLAR AS BASILIC IS NOT A SALAD. and their fanous poutine, guys, it tasted like pure shit. this restaurant is fancy looking but the food is saddly, not good. Food court in the carrefour laval serves better food than this shitty restaurant. If you want to WASTE your money, go ahead!"}
{"text":"Bonne bouffe, belle ambiance et excellent service, garder de la place pour les oreo frits!!!"}
{"text":"I've been wanting to try this place for awhile, so last Saturday night as my bff and I searched for a restaurant close to home, we decided to give it a try. 

We called at around 6 for 7:30 reservations and were told that it wouldn't be a problem but that we might have to wait 10-15mins for our table. It was full when we got there but after the promised 10mins we were seated. 

The decor feels like upscale chain restaurant for lack of a better desciption - everything is nice, modern and \"chic\" but the place is too big to have a really upscale restaurant feel to it. 

The menu is 1 page but with plenty of options and intriguing choices - we had a hard time deciding what we were in the mood for! In the end, we decided the appetizers all looked too good to pass up and decided to share a few of those. 

We had heard great things about the LIL BIG MAKS  which were supposed to be mini burgers with the elusive McD's big mac sauce. They were adorable, 3 mini burgers  served with a mini container of spiced matchstick fries, and delicious with very fresh ingredients and a generous piece of meat. The sauce wasn't exactly big mac sauce but it was definitely good! 

We also couldn't resist the LOBSTER POGOS (I have a weakness for all things pogo!) They were 3 very generously-sized pogos served with lemon dill aioli. They were delicious - with slightly sweet batter that went very well with the lemon dill aioli dipping sauce. The lobster flavour wasn't very pronounced but very fresh. 

Our last choice was the BACON CHEDDER CROQUETTES which were a bit of a miss after the other 2 dishes. They were overly crispy and overly heavy and the bacon was a bit too smoky and overpowering. The serving was very generous - about 6 decently sized croquettes. 

We were sadly too full for dessert but their options looked tasty and we have to go back to try the deep fried oreos!

Prices were moderate - 3 shared appetizers and 2 glasses of wine came to about 85$ with tax and tip - but the portions and glasses were very generous and filling. 

Our waiter was adorable - very plesant and helpful. 

If you're in Laval, give it a try....its definitely better than a lot of the other chain restaurants in the area!"}
{"text":"I was at table 51 yesterday and wasn't to impressed! They have a wide selection of wine in cellar but don't know  how to serve it ! The bottle was taken right out of the cellar at 55f .Villa Antinori Chianti . Imagine now the waiter asking me to taste it ! I told him you should have a bottle of red always out of cellar rotating for customer . 
I let the waiter know and he offered me another bottle which he said he keeps outside ! I said to him it's ok ,I will let it sit ! The food was not bad but I've had a lot better for the same price with nicer settings ! I spend 175$ including tip for two people that day ! It was a lunch ! The waiters and waitresses kept coming by trying to take my last bite , plate away ! At least 5 times ! Never again !!!"}
{"text":"Wow ... Best word to describe my experience.  Jean was our waiter and added to the outstanding experience.  

Had the poutine and Jean waited to take our meal order because it was out of this world but very filling.  

On a lark we ordered a pulled pork sandwich because how could we only order an appetizer?  Also amazing btw!

So because we are in French Canada and because I'm in love we ordered desert ... Cheese cake cup ...

I have to say first night in Quebec beyond expectations!!! And I've been here before.   Come here ASAP!!!"}
{"text":"A nice place with nice ambiance and good service. However I was a bit disappointed! The food is ok and the prices were not reasonable. Went there with my wife and kids, it is definitely not kids friendly, they have absolutely nothing for kids, we were recommended to order a regular sandwich and make the kids share, not a good idea at all. 
We ordered Ceasar salad, and it wasn't so special. Usually restaurant like Baton Rouge would offer that kind of salad for free. It was not so special at all. 
We ended up paying more that what we got. I would think it is more suitable for people with no kids, there is a bar area and televisions if you want to watch the game."}
{"text":"Not too impressed with this restaurant. I left hungry and dissatisfied. Croutons in the Cesar salad had some kind of chemical tasting smokey seasoning, the hummus and guacamole platter tasted like they took it out of a store bought container and my shrimp burger was extremely oily and tasteless. 
The only thing I like was the decor, service and the comfy booths. And that is why they are getting a two star instead of one."}
{"text":"My life is at steak here!

I don't eat meat normally but I came here for my boyfriend's Christmas staff party so I decided to throw all caution to the wind and indulge in a meat fest. It was totally worth it on every level, even to the part where the bar maids were totally dumb about our drink orders, I would definitely go back to:

1) act very pretentious and pretend I am a rich member of the 450 

2) mini big macs (yes and it is the greatest thing ever)

3) deep fried oreo cookies. It is true. They exist. And so do leprechauns and unicorns."}
{"text":"I've always over looked this place and I'm not really sure why. It's a really trendy place with some good looking food and a good vibe. The menu is vast but not overwhelming. They offer a good variety of dishes so there's something for everyone. I had the beet salad as a starter, onion soup and then the braised beef. Everything was really good, but a little on the sweet side. The braised beef was truly fall off the bone as described in the menu and comes with a hearty side of potatoes, turnips and carrots. The portions are generous and satisfying. I'll be going back to try some of the other stuff on the menu. Service was good and prices reasonable."}
{"text":"I went to Table 51 tonight with some family and friends from the area. I was very pleased. I had the beef tartare for starters, and then decided to have the beef braised poutine as my meal. So so happy, with both dishes. Tartare was so tender and flavorful (I have to get tartare when visiting Quebec). And the poutine was delicious, topped with really tender braised beef. Gourmet poutine! (I may have to try the place in Montreal known for fois gras poutine.)"}
{"text":"My sis took me to Table 51 with my 2 nephews. 
The place has a really fun vibe. Our waiter was very attentive and the food was really good. 
We shared the Lil Big Mack's, they have the Big Mac down to the tee. Nothing like the taste of a big mac, they came with a mini side of match stick fries.
My sister ordered for me, it was a carnita sandwich with a side of slaw.
This was the best pulled pork sandwich I have ever had in Canada. The meat was moist, tender, and seasoned perfectly. The slaw was creamy and tangy.
My sister had a Ruben sandwich, with fries and a side of mini pickles in a small jar.
This too was very yummy, but still preferred the carnita. I think the Ruben could have been more tender.
My nephew had a Mac n Cheese, which I have to say was so fresh and I would go there and just order that and be satisfied.  Loved it.
We also had a Lychee Martini that was way to strong for me and my last encounter with a martini ended with me getting acquainted with porcelain. 
All in all it was really good and would recommend this place to anyone. Just be aware that it is pricy but once in a while you gotta spend some money for something different."}
{"text":"I had the Asian salad with chicken. It was good tasting but I found the dressing was too much. It would have been better if I asked for it on the side. 

Also had the deep fried Oreos with vanilla ice cream which was on point; didn't disappoint. 

If you are in town, it's worth a try! Location is great as well at carrefour mall."}
{"text":"Reservations were at 7 got there a bit early had to stand around at the bar when there were tables availble they moved us twice as we were 6 being squished in a little table even tho there was a huge round booth. One of the bartenders didn't know how to make a Cosmo she handed me this dark red drink which I knew by the color it was going to taste awful and I was right. Food arrived pretty quickly lobster tacos were meh didn't like them but my bestfriend did. The waiters kept coming by to play never have I ever with us (3 men)they were very sweet, but still a little unprofessional asking who's done 3 sums lol we weren't a bachelorette party just a group of girls.I don't think I would return as Laval is a cold place people don't smile around there especially in the restaurant.
They have a deep fried Oreo only cool thing there."}
{"text":"Nice restaurant, decent service. Food is however the weak point: they try to make it fancy, but it doesn't work. It looks nice, but taste is average. Not bad, just average."}
{"text":"Something tells me the lobster tacos I ordered were maybe made of canned lobster meat. They did not even have the decency of properly draining the water. Since it was 22$ I really thought it would be fresh pieces of lobster meat, you know like the 20$ fresh lobster roll with big chunks of claws and knuckles meat I order when I'm in New York. Also ordered the Asian salad that was truly insipid."}
{"text":"Nice place, good service (exceded expectations), food overall  is good. 
Gave them 1 star simply because I can not tolerate a restaurant that tries to pass a common item as an expensive item. 
On the menu they have a Jamaican Pork served with wild rice, to my surprise the rice was a common white long grain rice, instead of the characteristic black full flavoured wild rice. 
We talked to two servers both said \"it is wild rice\", really? I want to think they do not know wild rice, shame on the kitchen!
I like wild rice a lot, I order it whenever I can and also have bought and cooked it. 
They lied to me."}
{"text":"Seulement $$$? Je mètrerais plus $$$$$ c'est certe chic, mais loin d'être une excuse pour te vider les poches. Services OK, malgré qu'on m'a déjà pressé pour finir mon assiette car le resto est over booker. Mes pâtes étaient pas fraîche je crois non plus pour le prix... J'y retourne pas a moins d'être millionnaire et mal prit (mais je préfèrerais prendre l'hélicoptère pour partir loin, loin de là.)"}
{"text":"I don't understand why the average rating is 3 star here. Salad, steak, and service were great. I did't have any reservation on a Saturday evening but they kindly found a table for me. Very lovely place."}
{"text":"Been there a few times.  It started off by being really good but lately I haven't been impressed. My favorite app is the mini big macs and for dessert the deep fried oreros are to die for. The lobster tacos were okay but I wouldn't get them again and the filet mignon was delicious."}
{"text":"Over staffed , very pretentious place , food quality is far from what it used to be. The wine selection is very very limited , they even offer people gift cards to change their reviews which is completely unacceptable. Who ever is in laval try ZiBo at centropolis newly renovated great service perfect dishes better prices."}
{"text":"This review is a bit old, so my memory wavers.

My wife and I went to Table 51 and I ordered the house specialty... the Braised Beef. The braised beef is a slow-cooked good portion of meat served on the bone in a deep plate with grelot potatoes and carrots in a delicious sauce. The braised beef was simply out of this world and something I have never tasted previously. I truly recommend trying it out yourself.

For dessert my wife ordered the fried Oreos. I already had my fill with the excellent braised beef but curiosity got the better of me and I tried a few.... it was delicious and fought my wife to get my due share! LOL!

As far as decor goes, if you enjoy retro-styled 60s cafeteria-like ambiance then this is the place for you. I don't recommend this place for romance as it was really noisy and lacked intimacy. The seating isn't particularly comfortable.

The service was more than adequate and the price range was expensive but completely worth it."}
{"text":"Great drinks and really nice staff but thats where it ends.
Easy on the fancy display for the chicken wings and I m still wondering how you can allow yourselves there charge $16 for 6 wings with barely and I repeat barely any meat, no joke. You guys need to get off your high horses and realize you're a shitty restaurant in a mall in Laval near bed bath and beyond . I gave it 2 stars cause drinks we half off from 4-8 but this place is WAY over hyped."}
{"text":"Salads are amazing especialy the nicoise!Nice VEGAN options, everything else is also good!"}
{"text":"C'est bien. Excellent service. Bonne ambiance festive pour un mardi soir. Décoration agréable et moderne."}
{"text":"I've been to this place once in a while,
love their starters menu.  My favorites
are the mini burgers and crab cakes, recently try the lobsters tacos as well,
great food, atmosphere."}
{"text":"Felt like i was at a disco tek, very very loud. The place was packed, it's always packed. The decor is nice the service is great, the food mehhh...
All the dishes we had and all of us were like this is just mehhh, don't get all the hype. Sister in law swears by this place. From what I've seen in a lot of these restaurants over here is that they are all show and no go. Everything looks good the decor is always nice the service is typically good but the food lacks. The poutine was different from any other poutine i have had (and in 15 years of coming to Montreal i have had a lot) but it was good. They didn't use frites they used boiled potatoes then smashed and fried with braised beef cheese curds and gravy. I am a fan of simple and classic poutine, but i would have this again. The deep fried oreo's were surprisingly good, but as for the rest of the food I'm sorry just didn't do anything for me.
I don't care how nice the place looks or how nice the plate comes out if the food falls short in taste."}
{"text":"Nice place for business lunch/dinners. not too loud, good variety of food. The pork sticky buns were fantastic!  The large tater tots were a crowd favorite as well and plenty to share."}
{"text":"I did not understand this place. The food was ok and really chic. However the prices are Crazy with a capital \"C\".  It's not a place to bring the kids, and its a very bad idea to even think about it. A family was sitting next to me, and the kids were driving me crazy. If you get a family next to you RUN. 

The decor is less then impressive and lack imagination. 
The service is dreadful. The waiters expect a 25% tip, and have attitude that they can not control, it was weird and I did not expect that. Could of been that night, or just that waiter, but its not a place I would return to soon."}
{"text":"Went to Table 51, a couple of times last week. It's a decent place, nice ambiance and decor. Friendly  and helpful staff maybe a bit too helpful, the reason I say this is because there is not one waiter designated to your table, everybody works together which is good in one sense because you always get service but you also get asked a billion times if your order was taken if u want ketchup for your fries! Lol (speaking of personal experience of course). The menu has a lot variety you are sure to find something you like. It's also a great place to relax after all the shopping you do at Carrefour Laval. The prices are okay, they're not cheap but not pricey either. 

The food was good, I had the mini bigmaks which I really enjoyed. They're kale salad is really good too. Another delicious treat on their menu is the fried oreos OMG sooooo good. What ever decided to do you must try that desert, even if you are not an oreo fan. You gottta try it."}
{"text":"They make some delicious upscale pub-grub in a fine-dining environment. The poutine with braised beef starter is too large even if you split it for 2 but insanely awesome. Their steak, while it doesn't compete with Chophouse standards is very good and definitely worth revisiting and their famous braised beef is equally delicious.The Red Velvet Cake was ridiculously good. I could of had a second piece."}
{"text":"Always a great choice! Delicious appetizers, delicious meals! Anything you want in one place. I believe on of the best places to eat in LAVAL. Try their Kale salad, chicken wings (best ever!!), popcorn shrimps, and BROWNIES (best of the best!)"}
{"text":"Great service from waiter even do we never got his name... Food took a little long but worth waiting for. 5 cheese macaroni was o.K. but beet salad was spectacular as well as the salmon tartar very fresh. And for desert of course key lime pie which was the best I ever had!!!!"}
{"text":"Over priced for the greasy food... Very nice service by the waitresses hence the 3 star rating"}
{"text":"Lorsque je suis arrivé dans le parking du Carrefour Laval, j'étais sur mes gardes en voyant l'immense devanture du Restaurant Table 51. Je ne sais pas si vous êtes comme moi, mais un restaurant dans un centre d'achat, ça ne m'a jamais donné l'impression que c'est fameux.

La preuve qu'il ne faut pas se fier aux apparences.

Nous étions sur la terrasse lors de notre souper (en juillet). Le serveur nous a offert une excellent service de par sa connaissance du menu et par son charisme tout adapté à notre groupe de 4. 

J'ai vu une poutine au menu,... je n'ai pas pu résister !

La poutine au buf braisé était une des poutine les plus originale et les plus délicieuse que j'ai manger ! (et j'en ai essayer des poutines!). Composée de patates grelots et de fromage en grain, arroser d'une sauce somptueuse et de buf braisé. C'était un pur régale. Mes compères ont choisi de commencer avec les tartares et ils ne manquaient pas d'éloges pour l'assaisonnement et la quantité généreuse.

Vint le moment du dessert ! qu'est-ce qu'on prend ?

Oreos frits? Vraiment ? Pourquoi Pas!

C'est un des meilleurs dessert que j'ai manger ! Le tout est assez simple mais tellement bien pensé ! Un Oreo est trempé dans une pâte rappelant la pâte a beignes que nos maman faisaient  et ensuite frits. le tout est servi avec une immense boule de crème glacée vanille maison !

Il faut que vous alliez essayer cet endroit !"}
{"text":"Came to Table 51 for a quick lunch on a Friday. I had the steak salad and my husband had the reuben sandwich. His reuben sandwich was ...... no Schwartz sandwich but it was tasty though really really greasy. I am biased as I appreciate hearty sandwiches minus the grease. His accompanying kale salad was awesome! Generous portion of kale with slices of cheese drizzled with a vinegrette, it was above my expectations for a side. My steak salad was tasty as well, romaine leaves, I think there was swiss chard in there, fried onion rings, goat cheese, cherry tomatoes, the flavors were delicious. My only complaint is that they were a wee bit stingy on the steak portion. But I also had the same complaint with my baton rouge steak salad, maybe I should just order a whole steak next time :) Between the steak salad here vs the one at BR, I'd go for this one. We also had the lobster taco, it was delicious! Lobster filling with mayo and mint I'm guessing, lobster was fresh and pairs nicely with mint. Small portions but it's an appetizer. Prices are ..... high. But the atmosphere is nice, chic and hip. I guess that's partly what you're paying for. Service is fair. I want to give this place a 3.5 as I didn't find it super esp when you compare the price but there's no half measure."}
{"text":"I haven't felt that bloated after a restaurant since years... Food is fatty, full of sugar, over processed... and overpriced...

Fortunately service is very friendly and efficient."}
{"text":"Very over priced for mediocre food. I wouldn't recommend it. The only good thing on the menu was the mini Big Macs. For the price you pay - go to Mc Donald's!"}
{"text":"Super modern and beautiful place with a good service. 

Not sure it is classified and \"French\" in Yelp... it looks like more as a steak house. 

The portions are HUGE. When we received the starters we cancelled one of the mains... 

A few vegetarian options... but very tasty! If you feel sharing... The hummus and guacamole can be shared for 2 people or even 3 if you are willing to be more generous. The rouleaux de courgettes au chèvre was very good!!! 

We had a Beet Salada and shared for 2 since we were good after the 2 starters. 

Sadly I didn't have \"space\" for the dessert... but I'm planning to come back for the Oreo frit. 

Worth saying the place is huge and super loud. Good for groups. But I would stay way if I was planning a romantic night."}
{"text":"This placed used to serve an epic pork chop - it was huge and juicy and super succulent, and one of the top two best pork chops Superwoman and I had ever had. That was back in 2015.

We recently returned to have it again because we've been missing it since then, and it was a huge disappointment. It was thinner than before, and the meat was very dry. It was overcooked. Plus the new way they were serving it paled in comparison to what they served two years ago.

We also had the crab cakes, which were barely warm and tasted like they were made in advance and reheated, instead of pan-fried to order. The salad it came with was good but had way, way too much dressing.

Combined with the fact that the Carrefour is also way less impressive than before - a lot of stores you might find at Eaton (both the Toronto and Montreal one) instead of mostly higher end stores like before, and much more pared down decor, we will probably skip Laval next time we go to Montreal."}
{"text":"After a few long years I decided to come back to table 51. I came here years ago when it first opened, not much has change. There is a lot more people that come here now compared to when they first started. I took the pasta of the day and I can't complain, It comes with a soup. The soup was a sweat potato cream based and it was really good. The pasta of the day was alright, the Alfredo with left over braised beef costed 21$ for the plate plus tax, not so bad I say."}
