{"text":"It is very sad that this place used to be \"the place\" for tacos! We used to wait hours to get served back in the day. Now, they have so much room and the SERVICE SUCKS and the food quality is horrible. Old meats, waitresses that never, ever, come and check on you. My family is from Sinaloa, and Sinaloa food is above these standards! 
Que triste que antes este lugar era una fregoneria de lugar! Ahora todo save a viejo, el servicio es lo peor que llo eh recibido! La mesera nunca nunca vino a rellenarnos los  pepinos, nos dieron 3 limones contaditos! Soy 100% sinaloense y este restaurante no es buen representante de la comida! Aparte super caros, ni que fueran tacos gourmet. Me da mucha pena escribir este comentario por  que como Mexicana el chiste es apoyar negocios Mexicanos! Lo peor Es que tan bonito que esta el restaurante! 

Ay caretas mas buenas, baratas y mejor servicio que este restaurante!"}
{"text":"Bomb ass tacos y mariscos!! If you don't speak Spanish don't worry they can give u a gringo menu lol.  The marlin tostada was the shit! No rosarito but good enuff!!!"}
{"text":"Such a lovely place but it lacks something. It was my first time here but maybe not my last. I might go back only if I am very hungry and I'm close by. I had a shrimp tostada and it was great but the enchiladas were dry full of lettuce on top.

A fly decided to go swimming in my beer, and that's a NO for my beer etiquette, and that made me leave the place.

My bill was pricy for the quality of the food."}
{"text":"I do like the food here. Big bonus is that they are open 24/7 over the weekend. I ordered the chicken chimichanga combo. It was good. I will revisit again soon."}
{"text":"This chicken mole was delicious, especially with the tomato salsa. Corn tortillas homemade and thick. It was good Mexican food through and through. Tasted like a Mexican trip to the Baja. Best horchata ever btw. Got a slight spice to it, but just barely. The michelada was tasty. Service just a little slower than you might expect elsewhere so I wouldn't plan on coming if your in a rush. Definitely coming back and glad I found it."}
{"text":"I just try the Michelada Sinaloa style and was awesome, and the Gorditas plate was really good too :)"}
{"text":"The place was empty at peak lunch time -- first clue, but we were hungry. 
Sticky floors, sticky everything. Should've walked out. Instead of standing around chit-chatting, they should've been cleaning and sprucing up. The place looked tired and dirty. *shudder*
 Actually ordered and ate. Never again. With so many quality choices."}
{"text":"Food and service is horrible and not to mention it being OVER PRICED!!!!
We stopped by while in town, since my husband loves sea food, however we weren't expecting to wait 40 min for our dinner!! Not to mention that my husband had to go into the kitchen and complain about food taking long!! What a horrible place
Over priced on a camarones rancheros plate!! sadly we paid $15.00 for a plate that was over flowing in a sauce that tasted more like tomatoes! OK but I also got 3 slices of bell peppers with 6 shrimps. Place doesn't deserve this Star! 
I would not recommend this place at all!!!
Total bill was $70.00 DIDN'T LEAVE A TIP$$$"}
{"text":"I'm not one to write horrible reviews, and the 2 stars are because their food is good. Their service is horrible, it's chaos in here, we didn't get our order taken, we moved from one table to another just to get recognized. We didn't have a waitress/ waiter. The food is really good they just need help with their structure and it would be a 4 star place easily."}
