{"text":"Yes, this is a weird place.  (Mexican food + asian owners + halal ingredients = Taco King)  The nachos with guacamole were very good, but oddly presented (we \"ate in\").  Rather than serving them on a flat plate with the beans and quac on the side, they were brought in a closed foam clamshell (large rectangle) and the beans and guac covered a third of the order.  1/4 filled tiny containers of salsa and sour cream accompanied the order.  Tasty but messy.  My wife and I ordered the cheese quesadillas, me with beans and she with chicken.  I'll get hers over with...the chicken was a bit salty.  Now, the bean quesadilla. What can I say?  Do you like beans?  Wait...do you really like beans?  No, that's not it.  Hmmm.  Got it!  If beans are your favourite food in the world and when asked, \"what would you like for your last meal (and every meal until you die)?\", and you answer enthusiastically, \"BEANS!!!\", then this dish is for you.  There were a lot of beans.  And some cheese.  As the others say, order by number, and if you're starving and have no choice (or really love beans), this is your place. ________________________________________ ALERT ALERT ALERT ALERT ALERT ALERT  According to Joe Fiorito in today's (May 26, 2010) Toronto Star, as of June 15, Taco King is no more.  They are switching to Chinese food. ________________________________________"}
{"text":"we got delivery from here during the Olympic hockey finals, we ordered 4 different kinds of quesadillas (jalapeno, chili, steak, chicken) and guacamole. It was very good but ordering was kind of annoying as someone else has previously stated, English is not their first language, and neither is Spanish as one would expect.  So a tip is to order by the number, don't even bother saying the name of what you want, they did a good job though. The food was good and the guacamole was fresh and had everything a good guacamole should have.  Not to mention this place is really cheap too, if you want an alternative to ordering pizza/wings I would recommend getting an assortment of stuff from this place, it makes a good fun assortment."}
{"text":"Taco King is surprisingly good for a Chinese owned and operated, Danforth Ave., halal Mexican joint. They do delivery, take-out, or you can sit at one of the 4-5 tables. Just don't pronounce things with a proper Mexican accent or the Chinese staff will have no idea what you're talking about.  There are a wide variety of options here: hard or soft tacos, quesadillas, tostadas, fajitas, burritos, and enchiladas. I went for an Al Carbon (grilled steak) and Guacamole ($2.49) tortilla. The steak was surprisingly good; big juicy chunks of well seasoned meat. The guac was decent as well and plentiful. This came on a nice freshly made 8-inch flour tortilla. If you're looking for a full meal you'll probably want 2-3 of these as they're not that big.  The tacos are hard shell style and not nearly as good as the tortillas.  An interesting place worth checking out both for the mixing of cultures and the decent Mexican eats."}
