{"text":"I render this verdict with no credentials other than a passion for good food. I claim no special knowledge of any kind of Mexican food.

But without any doubt I can say: these are the best tacos and burritos I have ever eaten."}
{"text":"I've had the tacos and torta and have been very happy with both. Love the fresh cilantro and onions they use. Very convenient in that you can call in your order and within minutes it's ready. Only wish they would offer fresh chips and salsa as a side....I know it would go over well."}
{"text":"I can only speak for the fat burrito, it's my go to, it's huge, wonderful, full of fresh flavor. Not what you would get at a Mexican restaurant. It's better! Don't be fooled by the little red trailer, they have it going on!"}
{"text":"Best Mexican food in Huntersville! Great food and super nice staff."}
{"text":"One of my favorite places! Everything is great. You're missing out if you don't try this."}
{"text":"I saw the 5 stars review on yelp. So, when I was in the area, my daughter and I tried their taco and sandwich. To my amazement, the meat is not juicy even though the taste is good. I wonder if we got there too late and we were getting the leftovers. I will not make a special trip to go there anymore."}
{"text":"I work in Huntersville and was tired of the same okd fast food lunches. I found the taco truck on yelp with great reviews so I figured what do I have to lose. I want to keep this simple. Just go! Give it one try and I promise you will not be disappointed. 
Cheers"}
{"text":"SO good! Honestly haven't had such tasty tacos since San Diego. I got the steak tacos with cilantro and onion and used the red sauce for a nice medium spice. $2 per taco- you can't go wrong with that! No drinks, so you can take your food home or eat in the car & buy a drink at the gas mart right beside the truck. Highly recommend!!!"}
{"text":"When we first moved here, I never thought I would find authentic tacos in the Lake Norman area. It took us about 6 months and a personal recommendation for us to test out this taco truck.

I am so glad we did, because...

It. Is. So. Good!

Most people would not expect to find, fresh, tasty food from a taco truck parked outside a gas station. Delicious food from a food truck rally in Charlotte? Yes. But next to a BP? Thankfully, I didn't let the mere location get in the way of trying it out.

The couple running the truck are bilingual, and extremely friendly. And boy, can they make a mean taco!

I think we have tried everything on the menu at least once, and the only thing I was not delighted with was the pollo (chicken) taco. BUT, ask them to make a chicken taco mixed with chorizo, and the world is good again. Our favorites are the pescado (fish) tacos, pastor (pork) tacos, and tortas.

The tacos come with two corn tortillas, piled with the meat of your choosing, onion, cilantro and salsa and a lime wedge on the side. Muy, muy bueno! 

What makes this place rock, is the price. $2 for an authentic, fresh and tasty taco. Yes, please!"}
{"text":"I love this truck and the ladies who run it. Very sweet and accommodating. The tacos are fresh and delicious but definitely need the accoutrements. Load it up with cilantro, onions, sour cream, both salsas (especially the green one) and squeeze the lime over top. Never had a better fish taco than from this truck. The corn tortillas are so soft and smooth and stretchy... Seem freshly made. This is an almost weekly stop for me."}
{"text":"coming from Southern Cali, this is as close as it gets.  they don't steam the tortilla.  The asada is perfect, simple and on target.   Salsa is dialed in.    The Taco is 100 percent.   The burrito is overload... rice and cheese..   it would be excellent if it was asada, pico, and torilla, but to the dinners choice....  price is perfect...


Was there at 11:30 and had a line of 14 persons on a tuesday...went back on saturday..1300 - 7 people standing in line...  excellent service, great price,  great food."}
{"text":"Great Quesadillas, tortas, and tacos.You know it serves great food when you see all walks of life lined up (construction workers, business men, doctors etc.)"}
{"text":"There is no other place you need to go to get phenomenal Mexican!  The fat burrito, soup, tacos...  they will even grill a fresh jalapeno and put in your to go box if you ask.  We quit going to the restaurants when we found out about them.  Also, the will cater for you too.  They did a Cinco De Mayo party for our neighborhood village.  Can't say enough great things"}
{"text":"Fast, inexpensive, fresh...it is a food truck, so plan to take it with you. Have been multiple times with great results and good meals."}
{"text":"Absolutely the best fish tacos I've ever had. Made to order, plus red and green chili sauces are incredible."}
{"text":"I rarely leave a negative review, much less a one star review, but in a word, my meal was AWFUL.

I ordered the barbacoa \"fat burrito\" without lettuce tomato or onion. I thought fat referred to the heft of the burrito, but in hindsight, perhaps it was literal. 

After about a 10 minute wait, my lunch was ready. Unfortunately, I took it to go, and returning to share my displeasure isn't worth the time or hassle. 

If the long wait was strike 1, then strike two was the loads of lettuce and onion in my order. That alone wouldn't lead me to leave a bad review. Mistakes happen, but it's disappointing especially since i watched the gentleman write my 86 requests on the order sheet. 

The third and final strike was the horrendous quality of the meat and disappointing flavors. The barbacoa was bland and every bite was literally unrendered fat and connective tissue (See my photos). 

The hot sauces were decent, but I had no use for them as I couldn't get past 4 bites of my 9 dollar (10 after tip) carry-out burrito. 

Not sure what all the hype is about..."}
{"text":"I can't believe that some of the best tacos I ever had came from a truck in the parking lot of a BP gas station, but that is about the size of it.  The Taco Truck serves them up perfectly seasoned with sauteed onions and cilantro on a nicely heated corn tortilla.  I loved the pescado(fish) and asada(steak) but I didn't care for the pulled pork taco or the sauces they offered....not bad, but I'm more of a tomato based salsa chic and the red and green sauces they offered just didn't work for me. The fish quesadilla was also quite tasty.......I have a feeling The Taco Truck will be seeing me on a regular......."}
{"text":"The Best Tacos in the area hands down - Food is fantastic and fresh.  I have a slight addition........ I eat here 2-3times a week!

They are up there with the best in Charlotte, if not THE best tacos."}
{"text":"Great little red food truck right next to Harvest Market.   All the reviews are on point.   Fantastic and a must go.   Really!"}
{"text":"The best Taco's I've had outside of when vacationing in Mexico."}
{"text":"Hands down best authentic Mexican tacos in Huntersville. They are parked in two locations throughout the week. 

Wednesday & Thursday: BP Gas Station off 115 (Old Statesville Rd, next to Garden Grove Nursery

Friday & Saturday: Garden Supplies off Statesville & Gilead, across from the new hotels & Cookout.

Be sure to call ahead to make sure they're stlll there and their current location. Cash only. Tacos are only $1.75 each. 

I've ordered their Asada tacos and they are legit. Just the right amount of onion and cilantro. Red and green sauces are BANGIN'."}
{"text":"I have had the tacos, both burritos and sopes from the Taco Truck and all were great.  I prefer traditional street tacos and naturally get the steak tacos.  They are always prepared quickly but more importantly are extremely delicious.  The red salsa that comes on the side is a perfect match for the steak tacos and lime.  Lastly, it is hard to beat the prices and this seems to be the only worthwhile place to enjoy a good meal in Huntersville."}
{"text":"This place was authentic, genuine, and the family of Arturo and Juan were very caring and sweet. I would highly recommend this wonderful family for a great authentic Mexican meal. I have visited Mexico City, and it tastes exactly the same! Definitely try the pastor tacos and burritos as well as the torta."}
{"text":"I want to give this a 3.5. The tacos were good. They were fresh. The meat wasn't anything special, and the pastor and asada were both pretty dried out. Honestly my favorite part of the whole thing was the green and red salsa/hot sauces. The red tasted kind of like a smoked chipolte pepper vibe. Both were very different and very tasty. The employees were very friendly, and I think they only take cash so I ran into the gas station beforehand. I'm a taco truck fiend, so while I want to give them 4 stars just for the effort, the taste just wasn't fully there."}
{"text":"I gave it 3 Stars for the hot sauce, it is actually hot.   These reviews are crazy, 4 and 5 stars?   Really?  Well, I will give it another shot and order something difference as my $7 Carnitas quesadilla was bland.  The lack of queso cheese was kind of depressing.  For what it lacked in queso, they made up for it in onions and cilantro, that is piled on.   As a few others have reviewed, this truck is nothing special, the proportions are small and they do not take cc."}
{"text":"Real deal tacos, priced right

The reason you go to a Mexican restaurant is to load up on chips and salsa, but you come to the Taco Truck for serious tacos. I was blown away by the $2 tacos and certainly recommend trying the $1 upgrade to fish, if that suits your tastes. Prepared fresh with a nice medley of flavors.

Check out Facebook for more up-to-date location information; I stopped by while driving from GA to VA and was glad to get some Cheerwine from the BP station. The corn tortillas are soft and don't break apart and the included sauces add a nice extra bit of flavor. Really not too much else to expand upon here, but just a solid lunch on a budget.

Bored of the typical office lunch out? Stop by here and go home happy."}
{"text":"Awesome tacos the the spicy pork is great. The only down side is no place to sit.  Wish the took credit cards don't always have cash. Love this place."}
{"text":"We love everything we've tried here! Real authentic Mexican dishes, simple and to the point. I only wish they did chips and salsa since we can't find a Mexican restaurant around here that knows how to make salsa. I hope they open a restaurant of their own one day because these guys know what they're doing, keep up the good work!"}
{"text":"We always order the steak fat burritos!!! Never disappointed & for $18 for 2, they're huge!!! I always come home & top it with sour cream so it's perfect after working all day. The ladies are always nice & pretty sure they know us now after coming so often...lol"}
{"text":"Nothing too special about this truck. The food is somehow bland and the portions are not that big but compatible with the price they charge. This truck sits at the BP gas station on 115 and it is a cash only business and they have no sodas for purchase. The food is nothing too special, there is another food truck in front of a Mexican grocery which is much better and accepts credit cards."}
{"text":"Arturo taco truck! Yes simple and delicious food prepared ...you guessed it ..in a truck! The location of the truck changes sometimes so it's best to call and check, you can also order ahead and pick it up when you get there. Bring CASH no credit/debit cards.
Tacos -I had a steak and also a chicken taco, they are prepared simple on a white corn tortilla with meat, cilantro and onions you have to tell them if you want these toppings or it's just meat. The steak was best in my opinion. They come with 2 sauces red & green one is spicier than the other. both are very good and add some moisture to the taco. 
The ladies in the truck are friendly and from what I could see everything looks clean. The prices are very reasonable just remember cash inly"}
{"text":"I made a special trip to exit 25 to try *The* Taco Truck and was greeted by a very nice couple and simple menu. Don't be intimidated if you don't speak Spanish, they are bilingual (he more than she) and have the menu broken down to make ordering easier for those who were not lucky enough to be raised in the heart of good Mexican food. For today I can only rate the Taco de Carne Asada. 

I would say the tacos are a 3.5, maaaybe 4 stars. The carne asada was tender w/crisp edges, very little fat. Loved the lime, grilled onion and healthy dose of cilantro. I think what woulda made this a solid 4, for me, woulda been a light drizzle of fresh creme. The salsas are rockin' but not for those w/a wimpy tongue. As it stands, I still prefer the tacos at Burrito Loco but these are also quite good.

Tip: get extra grilled onions; they are sweet and your taste buds & tummy will thank you!"}
{"text":"I think there may be two different food trucks and only a single entry on here for Yelp.  I am not sure of this but I suspect this is the case.  I went to a food truck in front of a convenience store and it wasn't good at all.  The meat was so stringy and chewy that I could barely even eat it.  The tacos fell apart and made a mess.  I would have been better off eating them out of a blender since it was a total disaster.

I also really didn't like the tortillas used at all.  They are those cheap one you can get 100 of for like $2 at Food Lion in the bag with the yellow label and the Mexican flag on it."}
{"text":"It rained today, all day, and when I went to the taco truck this afternoon it was pouring! Most people would probably turn away and that's understandable but not if you have had these tacos before. The 3 nice ladies working the truck opened the window in amazement of why this guy is getting tacos right now. I don't speak the best Spanish but I think they understood me when I pointed at my soaked clothes and said, \"you have some great food here\". They laughed and I was on my way home, soaked but happy. I won't get into the food too much, but it's awesome and authentic, everything tastes fresh and clean. Do yourself a favor and try this place, but maybe wait for a sunny day!"}
{"text":"Only place to go for street tacos around. I got 20 minutes outside of my way home to get these tacos sometimes 3 times a week. Everything is fresh and prepared to order perfect food stand"}
{"text":"UPDATE (Jan 2012): The truck is now at the BP gas station on Old Statesville Road in Huntersville (near Micky's Bistro) from Mondays through Thursdays. They are at the seed store on 21 on Fridays and Saturdays.

I'm a huge fan of authentic tacos, and the Taco Truck delivers!  

I have tried the carnitas (pork) tacos and the pescado (fish) tacos, and both are wonderful.  And at $1.75 each, they are a bargain!  The tacos are served on double corn tortillas with onions and cilantro. (If you like cheese on your tacos, you will need to either ask for them to add it, or add it yourself at home.)  The pork is crisp and cut into bite-sized pieces - just right, and not at all fatty.  Similarly, the tilapia is bite-sized and grilled, not fried. The tacos are served with two salsas - one smoky red, and one green.  Both are spicy and outstanding.  Really, I think they are some of the best salsas I've EVER had. 

I wish they had a few sides to offer, such as beans or rice.  That's the only reason for dropping one star.  But, the tacos are phenomenal and I'll definitely keep returning!"}
{"text":"Cooked as soon as you order it with fresh ingredients. So tasty! It's also very quick so it's great when you're just driving by and are craving a few tacos."}
{"text":"This taco truck is a little piece of heaven. Small booth in the parking lot of a gas station that serves excellent authentic Mexican food. Tried both the burrito and some tacos. The burrito is large and filling - unless you're starving you probably don't need the fat burrito. The tacos are amazing - simple ingredients cooked perfectly. My favorites were the steak (asada) and chorizo but everything was tasty. Definitely worth a stop if you're in the area."}
{"text":"I'm obsessed with these tacos. Chorizo and pastor every time. They're the real deal. Look for the red trailer at the shell off Gilead or the BP off old statesville."}
{"text":"This lil taco truck is the kind of authentic food that the charlotte area needs. I've spent a good bit of time in the southwest where authentic street style is by far more plentiful and they could hang with those guys any day. Food is fresh and made with care and the staff is always incredibly friendly. Give them a try, you won't regret it."}
{"text":"Outstanding flavors at a great price. Lot's of other reviews give the details so I will make this one of my shorter ones and just say, GO!"}
{"text":"I drove by this truck many times before I decided to give them a try.  Boy am I glad I did!  Simple, tasty Mexican style tacos, they're da bomb.  I've been back many times since. I'm partial to the spicy pork tacos.  Its worth the trip, highly recommend."}
{"text":"Fish sopes are perfect.  Everything is made fresh while you wait.  

This is definitely our go to Taco Truck.  Good job!"}
{"text":"The best tacos in town!  Really like the spicy pork tacos the best!!  Their salsas are delicious!!!  The burritos are big and tasty too!!  Great people too!"}
{"text":"I became aware of Arturo's Taco Truck by randomly perusing Yelp one day and I was instantly intrigued. I'm a fan of food trucks, and to hear about one locally that was serving up fresh, simple Mexican food I just had to check it out. I headed on over to the Seed Supply on a warm Saturday afternoon with the miss' to grab some grub.

The couple running the Taco Truck are extremely friendly and welcoming, something you definitely want to see from a food truck. The menu is pretty simple and straightforward...they offer a variety of Mexican staples like tacos, quesidillas and tostadas with several different meat options including beef, pork, chicken and fish. The miss' and I each ordered a taco and something called a \"sopes.\" 

I went with the asada taco, and it was one of the simplest and tastiest tacos I've ever had. It consisted of two flour tortillas, the steak, onions and cilantro. Everything was not only delicious but also extremely fresh-tasting. There are a couple of different topping options, such as fresh lime and either red or green salsas. The red salsa was mild and not very flavorful to me, but I really dug the green salsa. It had some really good heat but it didn't overpower the overall flavor that it added to the taco. The miss' went with the chicken taco and it was the same case. The green salsa was a bit too spicy for her, but with the red salsa she was pretty darn happy. Not only were these tacos delicious, but they were also only $2 a piece, which is a steal for such high-quality food.

The sopes were a bit more \"complex\", and kind of reminded me of an open-faced sandwich. There is a thick, \"doughy\" fried tortilla/cake as the base, and piled on top is meat, onion, cilantro, a hunk of a jalapeno pepper, shredded cheddar cheese, parm cheese and sour cream. It's quite a lot of stuff heaped onto a small little fried base, and it was a bit \"much\" for me, though it's worth noting that it's only $2.50 a piece which is pretty close to the plain taco price. While it was filling, the flavor was spot on. We both ordered ours with carnitas and the porky goodness melded quite well with the other strong flavors of cheese and sour cream. It was a messy meal but was quite filling, and was worth every penny.

What it comes down to is that you can get delicious, high-quality food for a ridiculously cheap price. While I personally wouldn't recommend the sopes, the tacos are off the hook and definitely worth making the trip out to check out. While the food isn't as \"fancy\" as stuff at Baja Soul, the tacos tasted better than either there or Unica. Arturo's Taco Truck is by far the best place to get your taco fix on."}
{"text":"Great place to have a bite to eat. 
$7 for a steak burrito. Sit outside under the tree at a table.
Cash only .
But atm inside the gas station."}
{"text":"I had the honor of attending a quince that featured the Arturo's food truck. At least it was the feature for me! It was my first time trying real taco. And let me tell you, i wish every Taco Bell could be replaced by an Arturo's. But until then, I dont mind driving the extra miles."}
