{"text":"Whoever ranked this higher than one star has never been to a decent sports bar. I can appreciate the charm of a good dive, but this place was all dive and no charm, with a dash shitty service to top it all off."}
{"text":"My gf and I walked in and sat ourselves as there was no one greeting or welcoming us in. We sat unattended by anyone for about 5-10 minutes until finally the bartender came to our table. Thinking she was going to be uber sweet and apologetic for the wait considering there were probably only 5 people inside the spacious bar at the time- she actually rudely said \"ok I'm going to have to see IDs because you look too young to be in here.\" We showed the woman our IDs and she said \"alright what can I get you then?\" I asked for a Dr Pepper because I wanted to see some sort of food or drink menu to choose something I wanted. She said they didn't serve anything that wasn't booze which was fine so I just asked for a water thinking she would bring us menus next. She took a long time to bring us water then left us for a long break again after dropping off our waters... Still no sign of a menu anywhere. Waiting for another 10 minutes. We got so bored waiting for any kind of good customer service we just left. A pretty terrible experience here. Don't waste your time."}
{"text":"The service (by the wonderful Lauren) was great, and the drink choices were strong and cheap. $4 for a \"Mad Lauren\" which only took two for me to feel it the rest of the night is better than an $8 shot on Mill. The people were interesting, and the owner extremely nice! Yeah we stood out like sore thumbs because we were college kids, but no one even cared. How can you beat it? Chill atmosphere, good cheap drinks, and great tunes all night long. Pretty sure our next ladies night wel'll skip Mill and come here instead! And did I mention the best after hours bar pizza I've ever had? Yeah, there's that too!"}
{"text":"Good owner, nice bartenders , cheap drinks And good food. Tons of tvs to watch the games. Relaxed and chill dive bar."}
{"text":"Where do I start with this place!? Their drinks are strong and inexpensive... And their food is so delicious that I can no longer have wings, philly cheese steaks, or soft pretzels anywhere else because they suck in comparison to Tailgate! Come for the food and drinks and stay for the darts, pool, barkeeps and locals! Who needs Cheers when you have Tailgate!?  Ps.- Lisa and Jude rock!"}
{"text":"Great service by one of the all time greats! Great drinks, great food, great service.  Robin crushes it!"}
{"text":"First time in.  Good drinks and bartender.  Would have given more stars if it didn't turn into a romper room. Door says 21 and over only but there were kids in there running around while their parents were drinking. Not really my scene.  Ran off a couple other customers too."}
{"text":"A bar & chill... pool, darts, sports, jukebox, and fantastic pizza of all things. I work close by and am always tempted to cruise in. Especially during work. The layout is pretty awesome, for some reason it just feels right. It is like the porridge that is not too hot or too cold. I brought a friend in, and some old dude from across the bar quickly reached out and bought her a drink. haha, thanks man."}
{"text":"Great place! nice food, good prices and really nice crowd of locals! Mondays get super crowded!"}
{"text":"Great bar. They have great food specials everyday. Sports bar with 10 TV's. Bartenders are the best in Tempe. 5 stars."}
{"text":"Fun place! There for NFL game & regulars were friendly. Wings were good. Easy on prices. If it served Pepsi, it would be 5 stars. RC cola is okay though"}
{"text":"The moment we walked in we knew we made a mistake. We walked in on the first Friday of March madness (we were the first ones in that morning) and were promptly told that the volume of the basketball games was going to be muted when patrons came in who wanted to listen to music. Being the only people in the bar, we ordered a pitcher and sat down to watch a game. After a bit another game came on that we wanted to watch and the lady behind the bar made it pretty clear that we were putting her out to change the channel. We finished our pitcher and literally ended up all walking outside and having one in our party pay for the pitcher because we thought we were going to get yelled at. I really have no idea how this dump has a 4 star rating. If you listen to 1 rating here you would do yourself a favor by listening to this one and going somewhere else. We did have a good 1 and a half games of darts before we ran for our lives. But maybe we just caught it on a bad day, I'll never go back to find out."}
{"text":"On-the-money divey little hideaway. Cool bartenders, good wings (with quarter wing night on Mondays!) and my kind of neighborhood bar ambiance. Just moved to Tempe and this is one of our go-to spots. It's the right amount of dive and rowdy for a good night and they serve food 'til almost last call. I'll be there for a strong drink soon."}
{"text":"My wife and I made our first visit to this bar because we heard how awesome their Wednesday steak and shrimp dinner is. OMG, the absolute best steak I've ever had outside my house. 14-16 oz Ribeye, grilled to perfection, half a dozen fried shrimp and a huge baked potato for 13.00 dollars. The staff were awesome Lisa is a feisty little lady, funny and awesome. I will so recommend this place to every person I know. The entire staff was outstanding, none of this \"not my table\" BS like a lot of places. not a fancy place but very clean."}
{"text":"Pretty chill relaxed bar. Although I have seen first hand what happens when you piss off the bartender Robin.(Wouldn't recommend it) Great wings for Monday night football. Good specials."}
{"text":"Great spot. Good food, excellent service and good prices. Good people take this place over the top. If you like to sit and watch football Sundays it can get pricey, but you will have fun."}
{"text":"Im actually a regular!! My favorite bar tender is Lisa, shes awesome!! My wife loves the lady cuz shes the only bar tender there that makes a killer Jamaician 10 speed, shes heavy handed so my wife loves it!! The food there is the best bar food ive actually EVER HAD!! Well worth it, cheap and delicious!! I usually get a thin crust pepperoni pizza with wings (always) and a pitcher of blu moon with my wifes 10 speed!! Less then 30 bucks!! Perfect pricing for a good time!! I recommend this place to everyone!! Its to good!!"}
{"text":"Ive only been here for lunch but this looks like the place where you can go and just get completely trashed out of your mind. The lunch was great and inexpensive. This HUGE burger and fries for like 4.99 or something close to it and I'm still here wondering the the hell people even go to McDonald's and eat that trash. I was also surprised to see actual bristle Dartboards at this place. If I lived near this place I wood definitely be a regular."}
{"text":"Got into town Sunday and wanted to kill some time watching the football games so I stopped in this spot prior to checking in to my hotel.   I had only planned on being there for an hour or so enough time to consume a few drinks but the place had interesting vibes. It's definitely a dive bar, but the bartender was great and fast considering it was a nice crowd.   The drinks were mixed great proportionately and the food was good. Ordered the wings and was quiet pleased!"}
{"text":"I'm not much of a dive bar person. However, the place is rather interesting. It has that \"old bar\" feel where people come there to just relax.  Heck, you can even chat with the bartender - try that in Scottsdale! There was even a chick that was there at the bar reading a book. Talk about chill.  Is this a place I'd go out of my way to attend? Is it a place I'd go if I lived close? I'd say so!   Also to note... I was actually confused at the bill. three drinks and my bill was like $8. $8 for three drinks... which in comparison would probably barely buy me one drink in Scottsdale. With that said, if you plan on buying LESS than $10 in drinks/food... then you gotta pay CASH."}
{"text":"This bar has been our favorite Tuesday lunch spot for several years now. On Tuesday they have all day 1/2 price appetizers. This means all the lovely bar food that they already offer at a very inexpensive price, becomes a very good deal.  Let me back up for a minute to explain.  At your average restaurant you pay on average between 65-85 cents per wing. At Tailgate they are everyday priced for $6 a dozen, or 50 cents per wing. On Tuesdays (and Mondays after 3pm) they are half price, or a measly 25 cents per wing. I guarantee you won't find a better deal ANYWHERE.   And it's not just a cheap price, their wings are some of the best I've had, especially at that price point. They are perfectly deep fried, juicy, and a good size. Most places to sell wings for this price they are the size of a 2 year olds pinkie. Not here, they serve large wings. We always ask for their Hot and BBQ sauces to be mixed, which as simple as it sounds is probably the best wing sauce around. Don't believe me? Head in there on a Tuesday and find out for yourself.  Overall the atmosphere is great. The main bartender who's company we always enjoy I believe owns the place as well. She's hilarious to talk with and is on top of it keeping the drinks full.  Overall I highly suggest you check this little hole in the wall out. You won't be disappointed."}
{"text":"4 stars brought us to this Sports Bar. Unbelievable. This place is 2 stars at most. Food is overcooked & nearly non-edible. I tried to order a cheesesteak & when it came back burnt I tried to order a burger & apparently the grill closes at 6pm. Seemed to be only locals, trying to play music over the NCAA tournament games. Thought I was coming to a sports bar..."}
{"text":"My kind of drinking place. Big ass bar. Lots of talkative friendly people. Mature acting students and a crowd beyond our college years all come together and have a great time. Food is good and prices reasonable. Food special M-F if you're drinking.  Bottled beers kept icy cold in a bed of ice.  Smoking patio in the shade. Plenty of parking. Great selection of artists on the jukebox.   They have a stage but I have yet to learn of live music or a karaoke night,  maybe soon."}
{"text":"We've heard of Wednesday steak night, and how good it is.  That is the under statement of the century.  The steak is huge and cooked to perfection.  Big baked potato AND fried shrimp. This dinner was A + delicious!   Fun bar, very friendly staff."}
{"text":"The wife and I stopped here for a bite and beer and was surprised. The steaks we ordered were huge and very tasty. Overall good beer selection and great service from Robin made foe a great evening."}
{"text":"If you go here on Mondays, they have 0.25 cent wings if you buy two beers. Got 2 beers and 12 wings for $11. Pretty great deal. WARNING: You will wait 1-2 hours depending on how busy it is. The wings are delicious, especially BBQ flavor. Waitress was very nice."}
{"text":"thursday should be a national holiday! seriously...$1.00 hotdogs(and they are awesome)...cheap beer and interesting people. smoking patio and jukebox.  i dont ask for much...so this place makes me happy.  great bartender (lisa) too.  just saying."}
{"text":"Dear god this Ribeye is amazing. Cooked to tenp. and 13.00. So delicious.  The bar itself is a total dive with dart leagues and beer. But somehow they have some great food and a ridiculious price.  But yeah come to grub out."}
{"text":"Dive \"sports\" bar.  Not a 4 star establishment by any means but the beer is cold and the bartenders are friendly.  Go here and get bombed."}
{"text":"I've been to two birthday parties and a Superbowl party here, plus came for a few meals. It's impressed me each time and I am not a bar person. The bartenders are top notch, accomodating, friendly but firm when needed. Most of the regular patrons are friendly to newcomers, or you can choose to have a private conversation and tune everyone nearby out. They have a well organized bar with all of the obscure bottles such as Sloe Gin, Creme De younameit, Whipped Cream flavored vodka, etc. They serve lunch, dinner, happy hour specials and have a late night menu as well. There are a dozen or so TVs, darts, ample parking, clean restrooms, etc. Accepts credit cards with a $10 minimum. Huge thumbs up."}
{"text":"Discovered this place while in Phoenix for spring training. Very friendly bartenders and good prices with surprisingly good bar food. I would love to give this place five stars. The reason I can't is because the men's room is literally the worst smelling I have ever been in. I am not lying when I say I literally got the dry heaves every time I went in there. I came here every night during spring training in 2016 and in 2017. I really had a good time. I just hope they get that bathroom situation taken care of before I am in town again."}
{"text":"I really like this place for what it is, and never pretending to be what it's not. Tailgaters is a great neighborhood bar... They have well priced, ice cold beer, a solid food selection, great service, and relaxing bar to sit and relax.   For the most part, the crowd is fun and friendly. However, they also seem to attract a few jerk off customers, who lessen the experience. That is the only aspect that prevented me from giving a five star review."}
{"text":"First of all, this is NOT a sports bar. Just because you have a couple Diamondbacks pint glasses does not qualify you as a sports bar (they had cops on). Came here looking to get a beer and some food when I was in town. Right when you walk into this dark grungy bar you are immediately hit with a rancid odor. Once I saw the \"food\" being served I decided I was going to just have a beer and head down the street to get food elsewhere. After having my beer I used the ATM in the bar to pull out some cash to pay because I didn't have any on me. I did so and as I was finishing my beer the bartender took my ATM receipt which was at the ATM (I didn't see that it spit it out) and instead of asking who it belonged to or just throwing it out she decided to read the balance in my checking account out loud to the entire bar. I couldn't believe it and still can't, what nerve? All and all the bar smelled awful, was filthy, and was not a sports bar in any way shape or form. I would recommend going to any of the other places in the area, especially if you are hungry. I left and went to Boulders on Broadway which is a block or two down the same street and had a delicious lunch, watched sportscenter on the TV and had about 40 beers to choose from instead the 4 or 5 Tailgate \"Sports Bar\" & \"grill\" had to offer.   The only positive I could take away from this \"sports bar\" was the beer was cheap, though the glass it came in was filthy. Hope this is helpful : )   Also a tip for the \"sports bar,\" put music on or something, it is weird sitting in a bar watching cops on mute with no music or sound."}
{"text":"Located right near the Eba tea corner in WakiWaki on Broadway (near Palo Verde for you lushes), Tailgates is kind of a dude bar...but with real darts and the best BuckHunter arcade game YET.  I learned about this place since a friend started picking up some bartending shifts and invited us to place darts. I use to love to play darts back in Boston, but most dart boards out here are those terrible electronic ones (ICK) or in the worst place in the bar...or simple just one (A-hem, Casey's). So I was stoked to see four real dartboards (they have dartboard champion nights here), but the real beauty was the ULTIMATE BuckHunt game with all kinds of new exotic animals to \"Lets Go A-Huntin'\" (did I mention I am vegetarian?-but can't resist a bright orange plastic rifle?).  The bar is located back near the joint, straightforward sports like bar, a little dirty, not a place to bring guys in nice polos, but they do have decent beers on tap for pitchers, and they just added Stella on tap, always nice option.   There is a smoking lounge off to the side of the bar and you can go outside w/your beverage and have a ciggie if so desired.  I believe there is food here, but I come here pretty late at night so don't have the pleasure to recommend anything.  As a note, besides the bartender, I have usually been the only woman in this bar. In fact, I only come here with my Mr. Mustachio. I wouldn't really recommend a woman to come here alone or to have a lady's night outing here b/c you are about to enter the man cave of TVs, beer, darts and games-I am sure the guys would swarm you (and your ladies) just to have a lady to hit on. You have been warned!  Easy parking (and easy bike riding for me) makes it a nice little quick stop when I don't feel like dropping money at Boulder's for their premium  brew or getting slushed on PVs Big Gulps of wells."}
{"text":"Nice local bar with the family feel. Had a fish & chips that was spot on and the price very reasonable. I will surely go back! Wnt back the day after which seemed to be dog dag (1$ for a dog). Gr8 place!"}
{"text":"This is the watering hole closest to my humble abode, so I may be a little biased, but I love this place. It's exactly what I would picture when given the phrase \"hole in the wall bar\", and that's what I'm looking for when I just want to relax and unwind or even pregame.  The bartender/server/foodrunner/barback that basically runs the place (I seriously don't know what the owners would do without her) is so nice and a very cool person to interact/chat with.   The food, while not as extremely diversified as it could be, is always prepared when you order it and comes out hot and delicious.   They have a cool side patio to smoke on. The bar also falls right on the Orbit route so it's just a quick lift back home or to a different location."}
{"text":"Went here tonight with my man and had an awesome time. The very nice girl from Boston and NC was awesome and we both had the pleasure of meeting her. Great bartender and is super cool! Thank you!"}
{"text":"One of the worst Bars I have ever went to. Waited over 5 minutes to get a menu, over 5 minutes to get my drink and over ONE HOUR to get my food. I ended up leaving before even getting my food. I then confronted the waitress about my experience with them and she was nothing but a jerk. Very disrespectful, clearly didn't want my business back. I will never be going back. Extremely disappointed. The one star is only for the 25 cent wings (minimum of 10 with a purchase of 2 beverages)."}
{"text":"Cut my lip on a broken glass. Enough to make me unhappy then I want to payup and leave. Not possible. Ten dollar minimum. So I ask her about the Rye whiskeys, she says \"they're all the same, whiskey.\" No they're not. Rye whiskey is not the same as regular whiskey. I actually came here because a certain bar across the street had shitty service. Only, to have to pay more and continue my bad service. Hey, I'm only being honest"}
{"text":"If you're looking for a dark semi-seedy whiskey tango bar, you've found your diamond! This is a cool place to play a game of pool or shoot some darks and have a night cap. I wouldn't come here for the food. Expect some surly bartenders, but in general, if you're on their good side you're gold."}
{"text":"The spot to be on game day. Great promotions during football season and even better food. Chicken wings are phenomenal."}
{"text":"I'd like to make a comment about the place but since I left without eating, drinking or for that matter even being acknowledged as a patron.......I waited at a table for 5 mins while room cleared at the bar...I then sat at the bar and watched as 3 \"bartenders\" checked on the other guests (who's leftovers were packed and beers were full) and completely ignored my companion and I...no drinks, no menus, not even water...just waiting and resentment! 10 minutes we sat...staring in the general direction of someone who MIGHT be willing to get us drinks....but no no no...it wasn't till I got up and stared walking out the god damn door did one of your skilled servers asked if we needed something...yes I'd like the 15 I wasted in your craptastic establishment back can you do that? No? Great I'll JOYFULLY spend my hard earned money elsewhere! And boy do I like spending money at bars....where they actually serve me!!! WILL NEVER RETURN!!!"}
{"text":"I have been here a few times now and I have to give it a good rating... Although it is kinda divey, I was super pleased to see they have REAL dartboards.   This pleases me so much I had to review.  If you just wanna go to drink and play darts, I highly recommend.   I don't necessarily recommend eating there, however. My boyfriend ate there once and he suffered the night through...I would not eat there after his experience.   But for beer and darts, yes, GO."}
{"text":"They clearly forgot our order of wings as we were waiting for at least 45 minutes and people who ordered after us got their food before us.  Really disappointed since a friend recommended this place to my boyfriend.    I wanted to edit my review and say that the wings were delicious, even if the service wasn't great."}
{"text":"Always have a good time at Tailgate. It's a great local hole in the wall where the bartenders are extra friendly and give special treatment. Whether you are having a bad day, got dumped, or lost a friend, they always go above and beyond to make you feel comfortable and will buy you a drink. Try the moonshine, it's intense! Or stop by on Monday for .25 cent wing night. Will always be my favorite hole in the wall. Don't take my word for it though, c'mon down!"}
{"text":"It was very dark, empty, and seemed like a dive. There were at least 10 televisions, but only 4 shows be aired, including a regular Tim Allen show. Really? Food was basic, nothing to make me want to come back for. It took 30 minutes to get the food (pizza and pretzel) and both were burnt. Sodas were flat - we explained this, but she didn't care and talked over us. There's one pool table, a stage that was empty (and no lights were on it during our visit to promote it at all), and around 6 - 8 tall tables/chairs (aside from the seating at the bar). My husband went previously during football season, but I don't know why I'd return. I'll be going elsewhere, most likely Freezers!"}
{"text":"Simple but good. I'm an easy going guy and like my food the same. Nothing jumped out and hit me either way, good or bad. It was tasty food prepared simply and very inexpensive. Atmosphere is relaxed, especially for a sports bar. Best part is they are open late."}
{"text":"We had been told that the food at this sports bar was good.  We decided to give it a try on a Sunday afternoon.    The order was for pizza and chicken wings.  My husband had the pepperoni pizza and I had the teriyaki chicken wings.  They were both good choices.  Even the server was good.    The only complaint we had is that it was pretty noisy but that's fairly normal for a sports bar.  We would definitely go again."}
{"text":"WAY TOO MUCH DRAMA AND BS HERE! Good food and people are very friendly but the drama is rediculous."}
{"text":"Steak and eggs special on Sundays which is great for early foot ball games.  Divey but friendly.  Old tvs but enough of them because its not very crowded."}
{"text":"Stopped here to kill time and watch football before catching a flight. The bartender (female, but I don't remember her name) was very helpful and suggested a drink for me (I'm not a beer lover), which was delicious. It was composed of red wine, blackberry vodka, and fruit juices, so it was similar to a sangria with a little extra kick.  There was a bunch of \"regulars\" here sitting at the bar, and I could see why since the staff was so friendly and the prices were very reasonable."}
{"text":"If I could give this place zero stars I would. Customer service just hung up on me...they did not correctly represent their Groupon and ruined my friends birthday-we paid almost 300$ for two tailgate tickets and no one seemed to even know the relationship existed. I am beyond livid with this pathetic excuse for a business who tell me \"it's Sunday I don't what to tell you there is no manager\" and proceeds to hang up on me. Please don't give this place any of your money. They don't deserve it."}
{"text":"It's a bit of a 'dive-bar', just the basics and not real pretty.  Reminded me of the basement bar in my college frat house, only smaller. Good pricing and the bartender was very nice.  Food was just ok, but I didn't have the wings."}
{"text":"Great little pub and eatery with a nice variety on the food menu, and what appears to be a pretty well stocked bar for the unpretentious patron not looking for spectacular, just good ol' down to earth service, friendly locals, tasty vittles and cold beer on ice.  They have Jagger Miester on tap, they call something like the Jagernator ...I was tempted, maybe next time I'll walk in and act like I know what I'm doing and call for \"a shot from yagernator, please\" That'll get the locals attention...can't wait!  A plethora of TV's but on my visit last night on my way home through Tempe, I thought, hey, the first game of second round Stanley Cup playoffs....need to find a spot to wet my whistle, and boom, there's Tailgate! No Hickey? Come on, so I asked. They had to ask ME what channel, and of course I knew, so it was cool, and all worked out.  I'll be back, and maybe get a game o darts in. Seems like a good place for football, and oh ya, the crunchy chicken wraps are yummy!"}
{"text":"So who knew there was such a thing as a toast bar? Well, Tailgate has some mighty nice white bread available and toaster right beside it for Sunday morning football. Very good service here on a Sunday morning, and the food was good. Not over the top great, but solid for our party of nine. We kept our wait staff hopping and she was very very efficient and friendly too. Great sense of humor - thanks for keeping us fed and quenched!!"}
