{"text":"I like it for what it is - an American Chinese restaurant catering to Americans.

First, a slight rant. Where ethnic restaurants are concerned, people frequently confuse the words \"authentic\" with \"delicious.\" Chinese food can be authentic and crappy, authentic and delicious, not authentic and crappy, or not authentic and delicious. This place happens to be the last.

If you're looking for good Chinese cooking, this isn't your place. Chicken feet, tripe, duck tongue soup, fish maw soup, bitter melon, XO sauce, stinky tofu - you won't find them here.

Sweet and sour anything, General Tso's, lo mein, and an assortment of Japanese and Thai dishes - done up exactly the way you like if you're a fan of American Chinese. Delicious!

They do have natto, that's almost worth the trip for me."}
{"text":"5 stars!!  My brother got the Amazing Chicken which is literally amazing!!!  I got the black and gold roll and spicy crazy tuna roll!!! We both got chicken egg rolls!!! Sooooo delicious!!! Will continue going back.  Very friendly and efficient service too."}
{"text":"All I can say is I've never had bad food here. Ever. The lunch bento is a great deal and I frequent this place often for lunch when I'm in Monroeville over at the convention center. The nigiri is always slamming. Its a big menu covering Chinese, Japanese and some Thai cuisine. I never eat the same thing twice here so I have PLENTY of choices. If its you and a friend, I suggest the sushi for two."}
{"text":"Taipei Tokyo is one of the best kept secrets in Pittsburgh.  Their sushi is fresh and great value for the price.  Bruce, his wife and all of the staff are very friendly and make everyone feel welcome and at home.  Rarely do I ever have anything but sushi, but friends regularly get Chinese dishes and are never unhappy."}
{"text":"This was my go-to place, mostly because I lived up the street, and yes, I was lazy and had them deliver.  Hey, when you snag a parking spot in front of the door, losing it is not an option.  The owners are sweet with a freaky memory.  To this day, I could probably walk in and he would recognize me and make a joke about how I would always get delivery (not to mention what I ordered).  The staff is also quite friendly and attentive.  If Zu still works there, tip him well as he is a riot.  The General Tso's is quite good although I always asked for well done and extra sauce.  They have a few other decent dishes although since I have not lived there for almost 2 years, my memory is hazy.  Unless things have changed, I would avoid the sushi as it's not the freshest you can find.  Overall, it's standard (but tasty) Americanized Chinese food with a few traditional dishes thrown in for good measure.  It's pricing is on par with other places but they have terrific lunch specials as well."}
{"text":"My husband and I stopped here on a Sunday night, 7pm.  The outside doesn't look like much, being lost in a strip mall, but we were very pleasantly surprised.  I loved the atmosphere.  It was warm, inviting, low music in the background.  The service was exceptional, plates were picked up as soon as you were finished.  For dinner we had pork dried dumplings, Amazing Chicken and fried rice.  Everything was delicious.  They have quirky little sayings on the menu next to each item which we had fun reading.  The Amazon Chicken was sliced chicken in a perfectly seasoned peanut sauce.  We were expecting to have leftovers for lunch, but ended up eating everything.  

There are no free refills, but the price of a soda was so low that it didn't matter.  The waiter didn't say one word the entire meal, but for some reason it was fine and gave us something fun to talk about. If this place was in my neighborhood, it would be a weekly stop."}
{"text":"Four of us longtime customers were here last Saturday night and we're quite disappointed. Taipei Tokyo used to be reliably a good place to go. But not this night. Chefs matter so maybe that was it because the food was tasteless, from shrimp in chili sauce with no chili, to stuffed eggplant. Granted, mu shu chicken is not the most seasoned dish in the world, but it should taste like something. The shumai appetizer was congealed starch. Chopped shrimp? Not in any of the six pieces. Worst was it was all lukewarm at best. The mu shu pancakes got delivered five minutes after everything else, with many other tables getting served in the meantime. And, that is an indication of how the service was."}
{"text":"Great food and the best sushi around!  
Love their General Tso's and their Dynamite sushi is absolutely awesome!!!
You can't go wrong dining here!"}
{"text":"My absolute FAVORITE Chinese place in the area. 

It is a clean environment with awesome food. All of the employees are helpful and kind! I always get my takeout from here.  

Thumbs up!"}
{"text":"I was by myself and the service was not what I expected. I was seated quickly but took the waitress some time to get to me. Once she took my order and brought my food I did not see her again until I had to ask for the check . The food was good and the appetizer I got was just OK. Next time in town I will try elsewhere and keep looking for a great Chinese place in PGH."}
{"text":"I updated review because it is unfair for me to give a poor review on such a good place because of condiments. I wish I knew where to buy those mustard packets to keep at home, that would solve my problem."}
{"text":"This is going to be short, sweet, and to the point. 

1) I have never had a bad meal here.

2) I truly believe that they serve the world's greatest General Tso's chicken

3) It is a fabulous spot to cure a hangover."}
{"text":"This is my favorite Chinese restaurant in Pittsburgh.  I also prefer it over the national chains like P.F. Changs.  The food is always well prepared and delicious.  My family's favorites are Beef with Broccoli in Spicy Brown sauce, Beef Lo-Mein and Sweet and Sour Chicken."}
{"text":"Chinese cuisine excellent. A favorite of the Chinese community in Pittsburgh. Small unassuming restaurant in Monroeville Mall, Pittsburgh.  Many authentic dishes esp Taiwanese dishes. Roast duck and vegetable dishes recommended. Sushi ok. Excellent service. Eating with a larger group (6 or more) allows you to order more dishes and not relying on 1 or 2 dishes. Reasonably priced."}
{"text":"Good sushi and Chinese is rare in Pittsburgh. My fianceé and I recently moved here from Chicago where we were spoiled by great cheap eats. 

Taipei Tokyo has the best general Tso's chicken in Pittsburgh, and their sushi rivals Chaya. Unlike Chaya, it is very modern sushi, with gourmet sauces. 

The \"wasai\" special roll was among the prettiest sushi I've ever seen, and definately the tastiest. Here's it's all about the unique special rolls that aren't on the menu. It can be difficult to find out what they are, as the polite staff doesn't speak much English, but absolutely worth the awkwardness."}
{"text":"My first review of any business ever.  I have gone to Taipei Tokyo a few times a year for the past 10 years or so when I am in Monroeville.  The food is decent. I know the male owner of the business who always greets me warmly.  Ordered lunch today and a takeout dinner.  Was surprised by the small portion and even more surprised when I received the bill and was charged for a refill of a fairly small cup of Diet Pepsi. I don't remember being charged for Pepsi refills there and wouldn't expect to be charged at a nicer restaurant for refills.  I told the waitress that I would like the refill charge to be taken off the bill (more on principle than anything).  She refused and sent the owner's wife to the table who preceded to harshly tell me that her restaurant has charged for refills for 18 years. When I asked her to remove the charge, she angrily said that she would but that she didn't like my attitude! I told her that I didn't like her attitude and that she would be losing a long-time costumer over a refill charge. She told me not to come back!  No problem.  I never will.  Terrible customer service."}
{"text":"My family and I were in the area looking for somewhere to eat dinner on a Sunday, and we came across this place. I wasn't expecting much--just the usual Americanized Chinese food--but that's not we got here. Granted, my experience was a little unusual.

The atmosphere of the restaurant is quite nice; it's pretty large. A few minutes after we were seated, the owner came by and started talking to my parents. He was very friendly, and recommended a lot of authentic Chinese dishes that weren't on the menu.  In the end, we ordered completely based off his list, which included items such as pork belly with mustard greens (????) and bok choy (??). It was a very satisfying, delicious meal. (However, it was only when the check came that we realized how much more these dishes cost.)

I realize that this was a rarer experience, and that the owner would never have recommended these dishes had we not been Chinese. However, this was the only time I've eaten here, and it was a fantastic dining experience, so I feel that this review should reflect that."}
{"text":"This is my only go-to for lunch take out. Have to have at least once a month.  I've actually been a fan since they were King Wu (notice their ph no. is 373-KING?) I can't comment on the sushi, but the Chinese side of the menu is awesome. Always fresh. Always good."}
{"text":"This is not just a Chinese food place. Incredible service. Friendly personable staff. Incredible food. I recently learned that I have an allergy to soy. Was very disappointed thinking I wouldn't be able to eat here anymore. Came in and asked. They offered to make ANY item on the menu without soy. And then began immediately listing everything I could have unaltered.

It's a must go!"}
{"text":"My family and I have been going to this restaurant for years. The owners are very friendly and the food is very delicious. Over the past couple of years, they've fell off a bit. It use to be no matter what time you got your food, it would always be fresh and tasty. Now, it seems that the food taste best when you get it anytime before dinner. Anything after that can be a hit or miss. There are always generous portions of food and their prices do beat most places. There are a few waitresses there that are kind of rude. And this girl who is always at the front register (she is in charge of take-out orders) is rude sometimes also. Despite some of the not-so-great people, overall, this is one of my favorite restaurants, and it is definitely a place that hits right at home for me. I would recommend the General Tso's chicken, Volcano sushi, green fugi maki sushi, spicy tuna sushi, octopus sashimi, Lions head, any of their rice combinations, and the seaweed salad....pretty much everything! :-)"}
{"text":"One of the first sushi places in monroeville other than Shogun probably.  Dynamite roll is what it says it is.  I always like it when I lived there and wish I still did just for that restaurant.  Bruce the owner if he's still there remembered my name and I wasn't a regular and visited maybe once a year.  That's customer service."}
{"text":"Went there for dinner one night and was seated right away. The place was kind of busy so I thought to myself that this place must be it. Opened the menu and noticed the prices were a little steep but still gave them a try. We ordered vegetable rolls as an appetizer and the orange chicken and the amazing chicken for our dinner entree. We wanted to have some vegetables with our entrees and the waitress told us it was an extra $3 with the orange chicken so my wife ordered that. We get our food and the vegetables we got was 3 small pieces of broccoli and a few pieces of onions and less carrots... $1 per broccoli... RIDICULOUS!!! The orange chicken was very good but for $12.95 for such a small portion left a bad taste in my mouth! The amazing chicken was not amazing at all. They should really rethink the name of that dish. After we were done, the waitress asked us if we still wanted the vegetable roll appetizer and of course our answer was no. There are other good chinese restaurants around. I would never ever go back nor would i recommend this place to any of my family or friends."}
{"text":"This is hands down my favorite sushi restaurant in Pittsburgh! I get the spicy crunch tuna roll and it never disappoints . It's in a odd location but don't let that fool you.  It has amazingly fresh food, wonderful service, and is a very welcoming feel to the restaurant. I love everything on the menu. Haven't in the 13 years of going had a bad meal . I would give it 10 stars if I could !"}
{"text":"Great food and great service!!! Highly recommended best food in monroeville I ever tried!"}
{"text":"This is my FAVORITE Chinese restaurant.   They have a very unusual menu which is a mix of Japanese, Korean, and Chinese foods.   I've never had a bad meal here; everything is great.

I am not a sushi fan, but all of my friends who like sushi love this place.


If you like ginger dishes, I would highly recommend the Sun Bay Jee.   It is awesome."}
{"text":"The service was nice and prompt. The wonton dumplings and spring rolls were eh. The calamari and General tso chicken was pretty good. The black and gold roll was good and filling. Not a bad place for sushi, would come again for the maki."}
{"text":"We have been eating here for 10 years. We love it to say the least. Tonight we met friends for sushi and drinks and we were not disappointed. They had new sushi menu options to offer. We decided to stray from our comfort zone and try the new dishes. We got the dinosaur egg and salmon toro and neither disappointed!!! We love this restaurant and recommend it to all!"}
{"text":"Went in there today for lunch. The place was almost full when we came but there is a lot of space here. We were promptly greeted and seated. Our server was very prompt and she suggested us some drinks which would pair will with our food. I ordered shrimp fantail and gold-n-black chef roll along with sake. My wife got vegetarian fried dumplings and vegetarian pad thai (yes, she is one of those). My appetiser was amazing in taste n texture and the sauce which accompanied it was a show stealer. The roll came out really well in terms of presentation as well as taste. My wife loved her pad thai and veggie dumplings as well. She also had an apple martini which she didn't like much as it was too sweet. All in all, we enjoyed our experience and will definitely come here again."}
{"text":"When here for lunch with my girlfriends.....I cannot believe the positive reviews of this place - food was terrible!  the service was fine,  but I ordered the tempura and they must have cooked it a day or so ago, because it was cold and it was stiff like a rock!   they definitely don't cook this to order- which makes me wonder what else they don't cook to order!!!  be very careful of this place - I won't be back, ever!"}
{"text":"Hello! This place has improved vastly from my last visit. I think with all the competition in Monroeville they upped their game. Sushi and sashimi were very flavorful and portions generous. The staff are as friendly as can be without overwhelming you. I'm very happy I came back!"}
{"text":"Nice service.  Sushi was mediocre, it was not cold."}
{"text":"The food and service is fantastic. They even made us what wasn't on the menu. Great place to relax and enjoy some good food"}
{"text":"Love this place!! Staff is very friendly! Atmosphere is relaxing! Sushi is awesome! Have tried a couple different menu items all good! Spring roll is best i have ever had!! Take out is fast and friendly!!!!"}
{"text":"If you like hot pepper Asian food then you have to get the hot banana pepper chicken (or beef).  It is hands down the best Chinese food I have ever had in the greater Pittsburgh region. All of their food is good to great, but the hot pepper dish is next level.  It is HOT, so if you do not have tolerance for hot foods then this might not be for you."}
{"text":"I tried Taipei Tokyo in search of good sushi in Monroeville. I did enjoy the roll I had, but the Chinese food I ordered to go with was very subpar. Nothing wrong, but Chinese takeout is definitely better, so it wasn't worth it to me! The atmosphere is also extremely quiet, which isn't bad, but not a great place to go catch up with friends. Service was very polite and prompt, but I don't think I'll be in a hurry to go back."}
{"text":"This restaurant is amazing. Very convenient, very quiet, lots on the menu, great service, classic decoration, and tasty food. The owner is very nice, kind, sweet, and funny.I recall that they are the only people that have the marvelous sushi Dragon Egg from where I've been. My favorite soup that they have is Miso Soup and my favorite sushi is California Roll. That is just my opinion."}
{"text":"Trick to eating @ this establishment is bar seating! Otherwise TaiPei is a busy place especially with the holiday season!
Great food! Never a problem with service! Courteous, friendly, & food is delicious!"}
{"text":"EXCELLENT Chinese food and sushi!  Everything they make is wonderful; they do not disappoint!  Every time we visit, the restaurant is always busy -- definitely a good sign!  Staff is extremely friendly, and the owners, Bruce and Heather, are great with remembering customers.  They really do have the best sushi (love the dragon roll and the pink lady) and sashimi (salmon is a favorite!), and we also love the basil chicken (sun bay jee) and ou shee pie goo.  Although, everything we get is delicious!"}
{"text":"Love, love, love this restaurant! We eat here all the time. The staff is very friendly and quick. The food is amazing. The only drawback is the size of their menu - it's huge, which makes it hard to choose a dish, but I've never gotten anything I didn't like."}
{"text":"Ok sushi and ok chinese not the best but fast service and they are kind."}
{"text":"My family and I have been going here for at least 10 years now. When we don't want to cook dinner at home, this place is definitely our go to! With my dad needing a healthier diet, the chefs in the back are quite understanding about making things well less oil or whatever other special orders we may request. The food hits the spot for us but the quality of service is the cherry on top. The owners are so sweet and the staff are all really nice and tend to your needs even when it's super busy. With the years we've been coming here, there have been small complains and when any, they're solved immediately!"}
{"text":"My first time going to Taipei Tokyo was with Jenn, actually. What a small world Yelp is. Or else, frequent reviewers run in tight circles.

Anyway, it's really a shame that the best Chinese food in Pittsburgh is in Monroeville, and even then is only 4 stars. There was nothing amazing about this place, but the food is great, and they also have a sushi bar with some decent variety. Can't beat that!

There are also some nice phrases (read: translation mishaps) on the menu that I enjoyed reading. My favorite was on the salt & pepper seafood: \"You can not resist to try!\" I now use this phrase daily."}
{"text":"I lived in several big cities and I still remember this restaurant as being the BEST takeout Chinese food ever.  I would look forward to every Friday night just knowing I was getting takeout here it was that good.  I loved the Kung Pao chicken.  I will say anything Japanese I did not try, only Chinese, so I cannot give it 5 stars.  I ate inside about 4 times, same great food."}
{"text":"DONT EAT HERE!!! HEALTH DEPARTMENT WAS NOTIFIED!!! Me and my husband grabbed take out from here on 12/09/2016. We ordered chicken and broccoli and fried rice...got home and opened the container and hair was all inside my rice and the smell!!! It smelled like the eggs in the rice went bad, it was awful! I drove all the way back for a refund and they REFUSED MY REFUND!!! Even the manager acknowledged something was wrong with the food and the obvious hair inside didnt belong to me!! Save your money and steer clear!"}
{"text":"Love this place. Recommend sesame chicken. This a is a regular for me.
Better consistency than most chinese I have had in Western Pennsylvania."}
{"text":"This is more of a 3.5 star rating.  We went to Taipei Tokyo after Christmas shopping this past Saturday.  I had been there one other time over two years ago and didn't recall much about what I had or that it was just ok.  Lured by the mention of sushi, I agreed to go again.  

It was late by the time we left the mall close to 9:30. However, I checked Yelp and their hours were posted as open until 11pm, Friday and Saturday.   So since they are located only minutes away we continued on.  When we arrived we were promptly seated and given menus but told up front that they close at 10:30.  Not the most welcoming arrival but ok.  I left to use the restroom before sitting down, and when I came out the server was over asking almost immediately what I wanted.  I hadn't even opened the menu yet.  I start looking and about 2 minutes after she had just asked she comes back to ask again.  Ok I know you close in 40 minutes I get it but can I have a minute please?  Matt decides he wants sesame chicken, his famous go to Chinese.  I knew I wanted Sushi or Sashimi but wasn't sure which one.  The price for sushi here does seem a bit high, so I decided to just get an appetizer of sashimi.  Matt had left to use the restroom and again she came over to our table to take our order!  This was a total of 3 times in 5 minutes... Annoyed? yes

So on her trice visit I tell her I think I am ready just a few questions.  This part bothered me more than her rushing our orders, she couldn't really answer ANY of my questions.  I asked what kind of fish is on the sashimi appetizer...um, not sure.  Ok so she asks lady at the bar.  Tuna, salmon, and white fish.  No comment on what kind of white fish.  Ok I will have that.  Second question, your house duck how is that prepared?  I understand there is a bit of a language barrier here but my questions weren't crazy.  Yea she didn't know.  I said is it pan fried, sautéed, deep fried?  Oh deep fried in a pan I am eventually told.  Ok is it cooked to order?  She had no idea what that meant!  Let me translate, can the chef make it the way I want, I want medium rare?  Deer in headlights... She nervously says again how it is cooked and says not it is probably just well done.  Well then no thank you.  I ordered Shrimp Pad Thai, extra spicy.

No sooner does she leave the table she returns with my sashimi, seriously a five second turnaround.  Ok it's raw it doesn't take much to cut up.  The sashimi was very good and fresh, something I will admit I was nervous about.  There were a total of 9 pieces, 3 each of the above mentioned fish.  I was only about half way through when out came our dinners.  This was a total of less than 5 minutes.  Wow...

So the food was overall a solid 4.  My Shrimp Pad Thai had good flavor and a nice portion, while the Mr. loved his chicken, but the service was so in our faces.  She asked us to pay the check almost right after being served stating the registers close at 10pm.  Um ok... then at another point she came over, me mid chewing, and asked me to hand her my empty beer bottle.  No this couldn't wait until I came up for air, she needed to clear our table stat!  It was a bit over the top to say the least.  I ate a little more but we both decided to just get everything to go since it was uncomfortable.  

Next time if we decide to visit we will make sure it is several hours before close or for takeout."}
{"text":"Simply the best Asian food around. Family owned and operated. Bruce and his family are always there to make sure your dining experience is the best it can be. Moderately priced and above average food from your typical General Tso to a more traditional tastes like Sun Bay Jee (3 cup chicken) hot pots for you to choose from. They also have sushi available. Some standards along with some of their unique rolls you can't miss are; Pink Lady (my favorite), Black & Gold, Sex on the Beach, etc. We have been going here for years and have never been disappointed. Some of our favorties are Sun Bay Jee, Tokyo Steak, Pad Thai, Egg Foo Yung, Garlic String Beans, and the Amazing Chicken is just that, Amazing! They do have take out and the lunch specials can't be beat with the lunch boxes and prices. Just go and enjoy!"}
{"text":"I love this place so much! I've grown up going here and many years later it's still at the very top of my list for favorite Asian cuisine. Everything you get on the menu is amazing and you can definitely tell that the food is great quality. Also make sure you end your meal with some Mochi for dessert you won't regret it :) so tasty!!"}
{"text":"So many wrong reviews, very poor service.
When comparing to other local Chinese places (in order of thier appearence):
No hot-tea
No refills (or very slow refills.. maybe 1 per visit)
Only 1 small bowl of fried noodles no matter if you are eating alone or with 3 friends.
Ridiculously long wait for initial service and food.
Very small portions - not even a standard lunch sizing.

The food itself (no matter how little of it) wasn't bad and the fried rice was excellent.

We won't be back and will stick with my sometime stale fried noodles at China Palace right down the road."}
{"text":"Took my mother here for Mother's Day because we couldn't get it to her favorite Italian spots and I came into town last minute for a surprise, gave this place a shot and well well worth it! I wasn't impressed with the tempura shrimp appetizer but the main courses were probably the best I've ever had ( no joke). The service was top notch also and a great atmosphere!"}
{"text":"What a nice, lunch time surprise this was!  I had a business lunch here that did not disappoint.  

The sushi is, flat out, fantastic.  So good, in fact, I'm looking for more reasons to be in the Monroeville area to have it again.   

They also offer some varying Asian cuisine - that looked delicious and was seemingly being enjoyed by other patrons in the restaurant.  

While the decor is a little dated, the service is courteous and friendly and the sushi is freshly prepared.  The place even offers some rolls and sashimi not often found elsewhere - so, all in all, there's plenty of variety to meet almost anyone's sushi palate.  

From full suits and business outfits to wind pants and t-shirts, this place satisfies a wide range of customers...and does it well!  I'm already looking forward to my next visit...maybe tomorrow:)"}
{"text":"Excellent sushi for the price. The Chinese food here is very well prepared and presented in good fashion. The overall menu is diverse and tastes much better than similar Asian fare offered at places like P.F. Chang's. Highly recommended."}
{"text":"Best Chinese restaurant!! Great sushi!"}
{"text":"Easily my favorite place for sushi. They have many types to pick from, my favorites are black and gold & pink lady.  Have but had anything bad on their extensive menu yet.  Owners  Bruce and Heather are extremely welcoming and are sure to stop by your table too see how you are enjoying your meal."}
{"text":"We kind of got stuck at the Mall during lunch hour, and this was the closest option. We didn't have huge expectations, but this exceeded them! We had pork potstickers that were quite nice to start with. I had a lunch special, starting with egg drop soup (good!), with orange chicken (really delightful, with tangerines, even though the chicken was just a tad dry!) and fried rice (could have been better, a little dry). My husband really liked the chow fun noodles. All in all, definitely the best Chinese food I've had in Western PA, though I haven't been to that many. I'll be going back!"}
{"text":"My wife & I have traveled extensively throughout the US of A and we often seek out sushi when we travel.  Even I find it bizarre that Taipei-Tokyo has become our point of reference for sushi, but it is true.  We often concur that our neighborhood sushi is better than what we are finding on the road.  Not that they are perfect here, but on most nights, and we eat there often, the sushi melts in your mouth, doesn't fall apart, isn't so large that it would choke a horse,  and has great taste.  We haven't been to Umi in a while, but we always thought them to be the best in the 'burgh, but for the price difference, we are more than happy with Taipei-Tokyo.  We also enjoy the spicy Chinese food here.  The (non-authentic Chinese) General Tso's  here is wonderful.  Throw in the friendly staff and owners, and we rarely leave here without a smile on our faces and  content bellies full of satisfying food.  Of course, a half hour later we're hungry, but ......."}
{"text":"Taipei Tokyo - These are cities in Taiwan and Japan being named here that giveaway and designate the style of food you are going to see in this restaurant in Monroeville. Taipei City is the capital of the Republic of China (Taiwan) and of course we all know Tokyo is the capital of Japan. In the US their location is situated in a nearby annex to the Monroeville Mall.
Basically they are a pretty decent Chinese restaurant with a good business in Sushi.
Eat In or Take Out. We have done both ways and both in and out are pretty good.  Also we have dined on Chinese and Sushi and both are good. The have a wide ranging menu with choices galore and the food is nicely presented and consistently good. For those inclined there is a full bar.
Service here is very quick and friendly enough, but certainly efficient is the best word I would say.
This restaurant is usually very busy, but not with too long of a wait. I think the wait is shorted by how fast and efficiently they get the food out to the tables who have ordered. There are a good number of booths, a number of 2 and 4 top tables and several large round tables for groups. I love round tables for groups. Very accommodating I would call it. Take out is very fast and is ready almost always before you can get there it pick it up. 
No reason to be shy to eat here, but no reason to travel any great distance either. But you might want to just to try it. If you are anywhere in the East, this restaurant will provide you a decent selection and quality of food. Price-wise they are very reasonable. So I'm saying based on service, price, selection and quality, this could be the best Chinese restaurant in Monroeville."}
{"text":"Yummy homemade dumplings. You just gotta try them, there very good. 
The rest of the menu is standard American/Chinese food and sushi. Don't be taken back by that the food is fresh and great tasting. 
I found service to be a bit inattentive. My drink went empty and no one came to refresh it. I'm not sure why because there seems to be plenty of people working. I rated the place average. I left an average tip."}
{"text":"My first time and it did not disappoint.  I read reviews and couldn't decide what to get.  Tried the chicken with peanut sauce and it was great.  The flavor was just right not real sweet. It was a large serving so I had it for lunch the next day and it was still good. Everyone at work said it smelled terrific. Service was speedy and friendly. Can't wait to return."}
{"text":"Their lunch box is a great deal if you're looking for a little bit of everything. Soup, salad, rice, sushi, and an option of meat or vegetables was only $10 and absolutely worth it! The restaurant has a relaxed vibe with dim lighting. The hot tea was also really good. They have their own version of yumyum sauce (if you're familiar with other restaurants) however it's an additional fee. 
Great spot for lunch!"}
{"text":"Not only their sushi is great but also their \"regular\" Chinese specialty dishes are exceptionaly delicious. The place is very cozy and especialy good for big groups of friends - ready to feast on tasty Chinese food."}
{"text":"The Sushi Hand Rolls the very best in Monroeville. I highly recommend the Pittsburgh, Philadelphia as well as the Rainbow rolls, they are fresh prepared by hand and your able to watch as they make them for you. Taipei also offers the best Asian food in the area. I have enjoyed the most of the Chicken dishes. My favorites being Chicken/Broccoli and Cashew. I am not a huge spicy dish lover, so curry is definitely out and can't comment. I have had family members order from the beef section and have never had anything negative to say.  Family owned and operated and always present in the restaurant. The service has always been consistently pleasant and accommodating. I have never had a disappointing dining experience here.  If you enjoy really good Asian food please try Taipei Tokyo it is well worth the trip. Huge Fan and Highly Recommend."}
{"text":"I've been here several times over the last five years or so.

This is the Best vegetarian Chinese food in Monroeville, and among my favorites for best Chinese in the Pittsburgh Metro.

I recommend the Broccoli with Garlic Sauce, Mapo Tofu, Chow Fun Noodles (these are large flat noodles similar to Pad Thai). Fresh veggies, cooked just right.

Brown rice available for a modest $1 extra."}
{"text":"First time for us going to this joint.  Very busy at lunch!  Always a good sign.

Sushi for Two - Great presentation in a sushi boat.  Sushi is fresh and served at the perfect temperature.  Not to cold, not to warm - just melting in your mouth.  Just FYI, they use the expensive imitation crab.  If you do not know the difference, then you have not visited enough sushi joints.  Just sayn'

There website is down, so I cannot tell which rolls we ordered.  They were both specialty rolls.  One was the eel topped on with spicy tuna inside.  Both were in the $12-$15 dollar range, I find specialty rolls around that range is pretty across the board.  Therefore, I am not sure why the other Yelpers said the sushi was expensive, also, the rolls were normal size (another Yelper said the rolls were small).

Another Yelper said service was terrible.  Not sure about that, our server was awesome.  The manager came by twice to ask how we are enjoying our meal.  Both the manager and server said thank you on our way out.......   

In closing, there is a wide range of reviews, the three bad ones that I mentioned above and others ---- then there is several 4 and 5 stars, I am not sure what is going on with consistency or the place or maybe its the Yelpers, who knows!!!  I do not care, it was yummy!"}
{"text":"more garlic than olive garden in ma poo tofu. could only taste GARLIC for 2 days.  very disappointed."}
{"text":"I wasn't expecting the level of quality. From the first time I visited (years ago) they've had consistently, better than anyone would expect to find in Monroeville-quality sushi. It's not the best in Pittsburgh, but better than most."}
{"text":"Can food reasonable price suggest the wonton soup. Had
 the amazing chicken was very good. The server was friendly and food was good."}
{"text":"Great place for Chinese and Japanese cuisine, but I love their sushi most. Highly recommend the Dragon and Rainbow Rolls -- their presentations are works of art!"}
{"text":"The most authentic Chinese food you can get in the Pittsburgh area.  I am not a big fan of Chinese food (despite being Chinese), but I can say this reminded me of my mom's cooking and the Chinese restaurants I went to in the Bay Area.

Usually very crowded on the weekends.  Food is not bad.  The dishes often have odd names such as \"golden treasure chicken\", which can be slightly confusing.  I have never tried the Japanese food so I am not sure how it is here."}
{"text":"This place is and always has been consistent.There is really not many decent places to eat in the eastern side of Pittsburgh (Monroeville, Penn Hills areas).
This is an exception: Fare menu pricing, good middle of the road Chinese food and ok Sushi.
I've never gotten sick eating here and my food is always hot.
The staff is always friendly and the service isn't bad either."}
{"text":"Don't be put off by the name, this place is neither Taiwanese nor Japanese. It's your typical run of the mill American Chinese place that serves sushi. The staff is quite friendly and the service is good but don't expect anything other than mediocre food. If you're a fan of American Chinese food, you may like the fact that you can get basic sushi here and superfluous rolls that mask the quality of the fish. I prefer to enjoy my fish which is why for me Chaya is the best option in Pittsburgh. One may think it's too much to expect authentic food in Monroeville but  Udipi and The Green Mango prove you can. Taipei Tokyo tries to do too much and should instead concentrate on offering authentic Taiwanese cuisine along with American Chinese favorites for those who are used to their \"Chinese\" food tasting a certain way."}
{"text":"This is probably my favorite Chinese restaurant in the area. I have never had an entree that wasn't perfect. If you love sushi, it is the best around as well. The staff is friendly and helpful and accommodates our large crowds we sometimes have without a problem. Certainly worth checking out if you haven't already!"}
{"text":"They have the fastest service I've ever seen.  Almost to the point of questioning whether they had massive quantities of food stock piled in the back that they just served when people ordered it.  I know that wasn't the case since I had a special request on one of my sushi rolls, but I still can't believe how quickly our food came.

We visited on a Friday night and the place was packed.  Nearly every table was filled with eager diners.  In the very brief time we were waiting for our food, the server brought noodles and duck sauce and was prompt with our beverage service.  Everything we ordered was fresh and tasty.  The major downfall to me was the size of the sushi rolls.  One of the rolls I ordered was $13 but only had five fairly small pieces.  It was tasty, but compared to other area sushi options, I thought it was a bit steep.  My fiance chose a chinese menu option and was equally pleased with his choice.  It was flavorful and he fared much better with the portion size.

Overall, I enjoyed my dining experience, but in the future, I'll probably stick to my standby of Azon Wok in Plum."}
{"text":"Taipei Tokyo is more than a restaurant. It's more like a gathering place for a group of quirky regulars and the awesome bartenders. If you're looking for a good time, go by yourself or with just one other person and sit at the bar, even if you're not drinking. The bartenders are the friendliest, most attentive bartenders around. Listen to the conversations-- there is such an array of interesting people. I've been a regular here on and off for at least 8 years, and I still meet new people who can share a good story over a Sapporo or sake. 

Oh hey, they have food too! The sushi is in my opinion the best in Pittsburgh. The fish is always fresh. I've met people from as far as Nebraska and California who say that when they come to Pittsburgh, they always come to Taipei because it has the best around. I'll just have to take their word. There is a variety of interesting rolls, as well as the traditional maki and nigiri. There is a good blend of Chinese/Taiwanese and Japanese food, with a few things like pad thai sprinkled in. The price is definitely reasonable, especially because the restaurant has a great, relaxed ambiance that surpasses a lot of the higher-end Asian food places in Pittsburgh. It's open a little later than your average dinner place, too, so it's nice to hit up around 9 when some of the other places are closing. It's definitely worth a drive out to Monroeville sometime."}
{"text":"I'm kind of weird about my sushi: I'm wary of trying it in new places, because if it's disappointing, that's a lot of money to spend on an unsatisfying experience.  This is probably the main reason I keep coming back to Taipei-Tokyo.  It's probably not the best sushi in the Pittsburgh area, but it's pretty darn good, and definitely reliable in its quality.

Service here is always pretty decent, and the hot foods are also definitely on the thumbs-up side of things.  This restaurant has been through a couple of permutations during my lifetime, and it's been a family destination of ours for as long as I can remember.

It's definitely tough to go wrong with Taipei-Tokyo."}
{"text":"I haven't tried their hot food, but the sushi is way over priced for what it is. I can go up the street only a block away and get higher quality and more reasonably priced sushi. TaiPai Sushi is such s waste of money, hopefully their hot food makes up for it."}
{"text":"Pink Lady - while those words didn't exactly roll off my tongue, it was some of the best and most creative sushi I've had. Top 3 for sure. It has salmon, eel, salmon crunch, cream cheese, seaweed salad and tuna IN IT and it all sits on some crazy sauce that they thought up...which is amazing. The only thing I can compare it to is if you mix hot mustard and sweet and sour sauce together (which is great by the way). It's not that, but close. It's pretty spicy but with some awesome sweetness and I can't say enough about the creativity on this. 

I also had shrimp and vegetables which were what you would expect, but really fresh. I tried some different sushi last night as well as Pad Thai and loved everything. Since I have several more trips out this way I will be visiting again real soon. 

It may look cheesy and sit in a strip mall, but everyone there is extremely friendly and the food is outstanding."}
{"text":"Meh totally spoiled by all the places in the city that this disappointed me. The food wasn't bad, it was the portions vs the prices that really sucked. The decor was boring and probably never ever updated. Weird tiny booths. 

I ordered tofu with broccoli and it was served on basically a side dish. Maybe had 6 or 7 pieces of tofu? That cost me $11. Then I ordered a avacado roll. 6 absolutely tiny rolls came back. They were good but the seaweed paper was kinda dry! That was another $5. 

 I rarely eat everything when I go out but I finished with more room in my stomach after 15 min. They also have lettuce in their veggie sushi roll.. super weird. Lettuce!!?? I will only go back maybe for convenience."}
{"text":"I've ordered from here several times and honestly its absolutely delicious and the service is great!!! I love the general tso chicken and the hot and sour soup too"}
{"text":"Place is little but the food is very very good. The service is also very good. If you like Chinese and Japanese this is the right place."}
{"text":"This place was fantastic.  Sushi was very good."}
{"text":"I had to knock this place down to three stars.  For starters, remodel this place already!  Neon lights in an early 90s style in the place is just not attractive.  Also, the bathrooms here are dirty, not to mention extremely outdated.  They have so many people working here, I would think one person would be able to scrub the bathrooms down.  

Next, the soups here just plain suck.  They seem to put flour in all of their soups, and they are also lacking in flavor.  

The sushi however is very good here.  Although, it would be nice to see maybe some sushi specials every once in a while with different \"special\" roll items.  

I will still keep coming here though, because there aren't many other quality sushi options in the east suburbs."}
{"text":"One of the best restaurants for Chinese/Asian food in Monroeville. The owners are very friendly and I have never had an unpleasant experience in my past few years of dining here or ordering take out.

My only issue is that there is little lighting and it is kind of dark, perhaps in need of revamping the interior (kind of outdated aesthetics), and their sushi is subpar, but the rest of the menu is great. Lunch menu and its prices are reasonable too. Decent sized restaurant which is good for small get togethers with family and friends, and it's not too loud either. Overall, I love it here and I would recommend it to everyone."}
{"text":"Easily in my top 3 work lunch places in the Monroeville area. The lunches offer lots of food at a good price. Brown rice is extra. I always get the broccoli in garlic sauce. It comes with an egg roll or soup. The hot and sour and egg drop are both very good. $6.25 for all that. 

The Japanese lunch boxes are a good choice, too: they come with a little bit of sushi and a salad. The ginger dressing is unique but tasty. 

There are roll specials, too for $10. 

If I am feeling opulent, I get the Chinese lunch AND the house vegetable roll a la carte. Or a whole order of General Tso's Tofu from the main menu. I was warned that the tofu was a big order. But it was crispy on the outside, custardy on the inside and tangy good. I ate it all. I am fat. 

Free hot tea when you eat in. Once, I saw a server opening a pounder of Coors Light and pouring it for someone at their table. It was 1130AM on a Wednesday. 

They have a full bar."}
{"text":"Fabulous Chinese food. Outstanding service. Calming atmosphere. Reminds me of the noble Chinese establishments of yesteryear. Fried rice is so nice and fluffy. Sesame chicken is succulent, white meat. Sauce not heavy, just right. Staff is formally dressed. Owners in suit and tie. Great prices."}
{"text":"I like Taipei Tokyo.  The restaurant interior itself looks a little dated, but that's no reflection on the food - the food is good.  I've tried a couple dishes - my favorite being the \"Amazing Chicken,\" which was white chicken in a peanut sauce. Very good!  I've also had the Kung Pao and Garlic chicken, both of which were tasty as well.  Some of the brown sauces (such as the Hunan chicken) seemed to lack flavor, but it was still okay.

I've only ever really done takeout here and the woman at the counter has always been kind."}
{"text":"I have eaten here several times.  The food is ok. The problem is that there is no description of the dinner on the menu.  I got Cashew Chicken.  It was LOADED with mushrooms.  I hate mushrooms.
When I asked the manager why descriptions are not included, his reply was that there was not enough room on the menu."}
{"text":"Sushi for two was great. Loved the sushi boat it's served in - see pic. 
Slow but friendly service."}
{"text":"This place is gross! The chicken I ate here was raw! Will never go again! The sushi was decent for cheap sushi however when it came to the food it was inedible."}
{"text":"Went for lunch and it was quite good. We split a dragon roll and each got Japanese lunch specials, and everything was done well. The owner was chatting with regulars in the dining room, the service was fast and pleasant. I'd definitely go again."}
{"text":"This is a very solid Asian food place in Monroeville. As you know, Monroeville is land of the chain restaurants and there aren't many local places to eat. I was very pleasantly surprised when a friend of mine suggested the place to me and told me the food was good. 

Not only are the portions huge, but the prices are very reasonable (especially for lunch). Service is always very friendly and quick, and the servers are incredibly attentive. 

Two cons to the place: the decor (outdated, drab, and harsh neon lighting) & the sushi. The taste of the sushi is absolutely fine and is fresh, but its very expensive and the rolls are quite small. It's just odd because all of the other entrees are huge! 

All in all, I'll be back to this place for sure."}
{"text":"The food Was excellent, and the service was excellent. I'm was here in PA visiting from out of town. Everything went well, and I would definitely return if I have the opportunity."}
{"text":"Incredible sushi. Best in town!  Their bento boxes for lunch are great too. The service is friendly and the location is pretty easy to find. We usually get take out orders for Lunch at my office. We order from here at least once a week we love it so much!"}
{"text":"I am a sushi junkie, and this is my go-to place for sushi. It's also great to take my non-sushi loving family there, since they can get their Chinese favorites. Try the Black and Gold roll: it's beautiful and delicious!"}
{"text":"Food is very good, and has a very clean and calm atmosphere. Always good sushi. A little lacking on the variety of soft drinks. But every other aspect has been pleasant and delightful."}
{"text":"One of the better Chinese Restaurants in the area, and the owner does a great job of customer service, the only problem is that I can't say the same about the rest of the wait staff. Our waitress often makes us feel like a burden to her as customers, and the food quality suffers as they don't deliver appetizers, soups, entrees in  a timely fashion."}
{"text":"Taipei-Tokyo is a busy Asian restaurant.  Their sushi is good and their meals are very good.

The Hawaii 5-0 is a HUGE serving of all kinds of seafood and there is nothing lacking in flavor.  We have had many items from this menu and never been disappointed in portion or flavor.  Sizzling Delight is delightful!  The Hot Pot is one of my favorites.

The only negative here is that they are quite quick.  Quick like super fast, thank you so much, many people waiting for your table, bye-bye.  Not to say that the service isn't very good, it definitely is - just be aware that they are there to get the tickets turned."}
{"text":"This restaurant is one of my favorites anywhere... Great food and staff is so nice and friendly.. I suggest the Orange Beef.. I get it everytime I come here!!"}
{"text":"Best Chinese / Japanese in the area! Always solid sushi, their lunch specials include soup salad sushi and teriyaki! Their dinners are a bit overpriced but you get enough for 3 or 4 meals. The general Tso's chicken is always amazing. You will not find better sushi or teriyaki. They do NOT have hibachi but this place makes up for it twofold with food quality and ambiance. Offer takeout that is really fast and courteous."}
{"text":"Really friendly people work here I'm always greeted and service and food is always amazing I hugely recommend. You can really tell they take ownership and pride in their business."}
{"text":"Love love love Taipai Tokyo. These folks remember your name!  Seriously, how many restaurants can that be said!?!  Everything on the menu is great. Had hot and sour soup today and pork lo mein. Very tasty. My go to though, because of the vibrant flavors, is the Basil Chicken. And I totally enjoy the Black and Gold roll which has soft shell crab in it. 

When you have a taste for this cuisine, be sure to stop in, say hi to Bruce, Heather and Jay and enjoy the food. I always do."}
{"text":"Came in on a Tuesday night with my boyfriend and his teenage son before going to see a movie.  Maybe the best sushi in Pittsburgh!  Had the Hot Pepper Roll and the Pittsburgh Roll.  The outside of one of the rolls was slightly fried and battered and it was still nice and light.  The fish was very high quality.  My boyfriend equally enjoyed the sushi.  His son ordered General Tsao's chicken and we all had a bite.  The sauce was delicious.  Server was excellent, no complaints there.  We will definitely be back for more!"}
{"text":"Go there all of the time. I think the owner lives there (I am sure he doesn't) because he never takes a day off. Food is always good, and the place is clean. Would recommend to anyone."}
{"text":"I've been here twice and was not let down nor impressed. 

Something that does stand out is that you can go completely off menu and let the Mandarin speaking waiter recommend you a bunch of dishes. They are not bad but not overly amazing either. The entree dinner prices are a bit higher than I would expect from a mall strip location. The portions were a little above average--sharing is harder but definitely enough for one person per dish. 

I expected to see more Taiwanese dishes but they are mostly all mainland. The little eateries in Squirrel Hill are a lot more authentic and varied. There are a lot of Asian restaurants in the area so I probably wouldn't come back here unless someone treated me."}
{"text":"Hands down this is my favorite place to get Chinese food! I've been searching around the 'burgh for the best, and my friends... this is it! They are clean and friendly and have a variety of food available for all tastes.

Whether you like chicken, seafood, soup, or sushi, you will find it here my friends. This is a great casual or semi-dressy date night spot or an easy and quick take out- if you call ahead of time. They offer a dimly lit setting and also a bar. I've never eaten or drank at the bar, but it usually seems to fill up pretty quickly with regulars on all nights of the week.

On weekends and during dinnertime this place can get pretty packed. If you prefer a quieter setting with less wait time try coming a little early on a week night.

Plus, I suggest the sesame chicken!"}
{"text":"Great service, delicious food! The sushi was fresh and expertly rolled; the General tso's tofu is the best I've had in Pittsburgh. A diverse-but manageable-menu suits the varying dietary restrictions of your party. Only downside is the seating is a bit tight. We will definitely be back."}
{"text":"The best the area has to offer. Their Pink Lady will make you lick the plate. Sushi is always fresh and properly served. Rolls are great and innovative. Wasi is exciting. Not a bad dish in the house. The lobster when available will have you grinning like the butchers dog. 
The most friendly staff around. 
Try it. I have friends travel from all the surrounding counties."}
{"text":"Excellent food and staff, I truly enjoy spending time at Taipei-Tokyo. Their lunch specials and entrees are always great. Also, the selection of quality sushi dishes leaves nothing to be desired."}
{"text":"This is definitely my regular sushi spot - I always start with the miso soup and hot tea and usually get a few rolls. I usually get the rainbow roll and either something with spicy tuna or the volcano roll (my favorites). I've been to a ton of sushi places, but Taipei Tokyo is my ultimate favorite. The staff is really great because they all act like they remember you every time you walk in and they all wave goodbye to you when you leave - it is a warm and welcoming atmosphere. Their chinese food is also really good - i generally order my chinese in the form of take out so that i can sit on my couch and watch netflix while eating it. They pack the take out bags really nicely and the portions are equal, if not greater than they would be when you're dining in."}
{"text":"We have been eating at Taipei Tokyo for many years and enjoy it every time. Yesterday we had the 90th birthday party of our mother - 50 people - and the owner Bruce did everything right. The food is amazing and fresh and gorgeous. And more than that Bruce was always around helping and available and the servers were perfect. Everything was right!"}
{"text":"I cant speak for the Sushi portion of this place, and perhaps I will come and try it one day. But for now, Ive done Chinese take out here and I was not impressed. 

The reason being is I can get better  tasting and pricing on Chinese takeout elsewhere nearby. So when given my options, I choose the other place. However, my bf loves the general tso's chicken here which is why we have eaten here twice already. The fried rice is decent, a bit more expensive then its competitors. Maybe its the atmosphere? I just prefer not to eat in at a place that is so dim to where I can barely see my food. I am not sure but this place doesn't quite strike a chord with me."}
{"text":"i was only visiting pittsburgh, but this place had very good food and a great staff.  Their sushi was solid, I didnt think amazing, but nothing wrong with it.  Their General Tso's chicken was great.  I'd go back."}
{"text":"My favorite restaurant. Hot Banana Pepper Chicken is my go to dish. I have enjoyed many things on the menu. Everything  is amazing. Also the best freshest Sushi and Sashimi. I highly recommend this restaurant for the food and their excellent service."}
{"text":"This place really is a hidden gem for Monroeville.  It probably wouldn't stack up too well in most other cities, but for here it's worth your trip.  Especially, for sushi in the suburbs.  I took some members of my team there today and I decided not to order sushi like usual, but try some of their \"chinese\" food offerings.  It's located in a strip mall like many of the finest chinese/japanese places are and it was packed with many native folks.  There were more people here today of east asian descent than american (a good sign), incidentally took the team to El Campesino in Monroeville yesterday and again, more mexican than americans.  The interior is nice enough with roomy seating a small bar in the front and a small sushi bar in the back.  This place is the best sushi in Monroeville (although saying that is like saying being the valedictorian at Hill District High School), anyways.. They keep this place really dark.  I don't mind this, but during the day when you step outside it's like you are leaving the cinema.  The service is excellent.  I'd say maybe even 4 stars.  I'm always impressed when we go here how attentive without being intrusive they are.  We sampled a lot of things.  One person tried the barbecue spare ribs which were a good size and didn't taste like they were under the sunlamp too long, but overall lacked much flavor.  Another tried the \"dynamite\" roll which is a very americanized version of a sushi roll.  It's basically a california roll with diced imitation crab warmed up with some cream based sauce put on top.  I didn't really care for this.  I think it would have been much better without the gooey sauce and if the \"crab\" on top was cold and spicier.  I tried the egg drop soup which was relatively bland.  We also sampled the szechuan (sp?) scallops which were quite good and cooked perfectly with a delicious brown sauce.  I had the lamb with barbecue sauce which was a lot of really tender perfectly cooked lamb in a nice sauce.  Some others tried the General Tso's and Kung Pao which were very acceptable.   If you are into Americanized Chinese and you are in the suburbs you could do a lot worse than this place.  The ingredients are fresh.  The food is cooked well.  The service is great and the price is reasonable.  One last thing, they are more than happy to customize your order if you don't like certain things or want others added.  This place should probably get 3 1/2 stars."}
{"text":"Not my favorite sushi in monroeville but delish food overall. I like their array of cooked sushi as I'm still able to enjoy it during pregnancy! Friendly staff."}
{"text":"I've given this place many chances. I have so many friends that rave about Taipei Tokyo, and it is always crowded at lunchtime. Why? The food isn't that spectacular. That's not to suggest that it's bad... it's just not great. 

The menu is really big, but I'd expect that from a restaurant that has both Japanese and Chinese food. Sometimes the choices are overwhelming, though. 

I like sushi, and no matter how much you doll up a roll with sauces and roe, the most important thing is the freshness and quality of the fish. That simply doesn't come across in Taipei Tokyo's food. This restaurant purely exemplifies the two-star \"meh\" review. 

The saving grace of Taipei Tokyo are their bento box lunches. Ranging from 8-14 dollars, they have a nice portion of food and includes a soup and salad. Service is nice, but can be slow, especially during the busy lunch hours. 

All in all - not a bad place, but I'll be going elsewhere for my sushi."}
{"text":"Love the quality of service, and the sushi is amazing rivaling the best sushi I've had in New York, Atlanta, and LA.  How is this establishment not packed to gills on a Saturday night?  Highly recommend the Chirashi Don and anything with Unagi in it, but the friendly and courteous service made the whole experience even that much more unique.  I would go back here 100 x infinity!"}
{"text":"Always have good prompt service. This is where all the locals go. They have been around forever and know what they are doing. Sushi is awesome, love the pad Thai! 
The pink neon lighting is the best. 
I eat here and get take out, orders are always correct."}
