{"text":"While I remember the sushi being good, the service now is terrible. I waited over five minutes to be told to sit at the back table (I was not escorted to the table, nor was i given a menu at the time), then over five more to receive a menu and after ten more minutes of waiting I walked out.  There were only a few people in the place, so it was not busy, they were just not interested in serving me.  Service is as important if not more then the product. I won't be back."}
{"text":"The first time I went, the service was really bad. The waitress barely came to check up on us and I had to walk up to the counter FOUR times to get attended to.  Here's the kicker, there were only 2 tables with customers (including mine) in the restaurant and every time I approached the waitress she was texting on her iPhone. You would think that if I asked for the menu, she would come over and see if I wanted to order dessert.  When she brought over the ice cream mochi we ordered, she did not think about bringing the ice cream that came with the dinner set.   At my second visit, the waiter was very sweet and provided great service but he charged us for spring rolls we did not order. We had told him that we would take it if it was free and he replied, \"Yes\". I don't want to knit-pick so let's move on to the food.  I thought if I ordered different dishes the second time around, I would see the potential of this place. The beef teriyaki was one of the best I have had; very tender and succulent. The white rice was tasty as well. The Dragon roll was delicious but the rest of the rolls we tried were below average-average.  The Fire Dynamite, essentially a spicy shrimp tempura roll, lacked the spicy taste and was bland.  The Spider Roll, basically deep fried crab with vegetables, was crispy but did not have enough mayo sauce which made the roll very dry. The Yam Tempura roll was also bland while the California roll was alright. For the price they were charging, I expected high quality rolls.  The restaurant appears elegant from the Japanese décor on the walls down to the stones used to hold your chopsticks.  It has a traditional yet modern look creating a pleasant atmosphere. Even their soy sauce containers looked sophisticated. However, beneath the illusion, you will realize this overpriced restaurant is serving you food you can find elsewhere at a better value."}
{"text":"Worst service I have ever received!!! They could care less about the costumers....so many better Japanese restaurants to go to, skip this one! They will make mistakes on your bill and hope you don't notice."}
{"text":"This place was great....I've been here 3 times now and each time I was impressed.  I've had the spicy salmon and spicy tuna rolls as well as the dynamite roll and salmon sushi.  All the fish was quite fresh.  I've also had the bento boxes which are really good.  For an uptown sushi place it's pretty good quality.    They also deliver in the area and do takeout as well.  I'll def go back!"}
{"text":"Went with a groupon. When we showed the groupon as we ordered, we got the look from the owner. The night did not go well...   We were the only table that night, and the service was still terrible."}
{"text":"came here for lunch.  First my order was wrong, ordered sushi lunch and was charged and given the sashimi lunch.  There was VERY little sashimi.  The whole lunch package was small for the price. It was a rip off, I was soooo hungry, that I had to put soy sauce all over my rice and fill up on that.  Would not go back.  So many sushi restaurants out in the GTA that give you more for you money with quality on the lunch deals."}
{"text":"I like this place. My husband and myself ate there once and we found it affordable and really good. The service was great, but we were there late so not many people. Since then, we've ordered and pick up sushis from there several times and it has always been really good, although a little pricey for pick-up. Once we ordered the large vegetarian sushi plate and I was a little disappointed. It was very affordable, but not nearly as satisfying as usual."}
{"text":"Stumbled into this place back in the summer (2016)... my best friend and I were hungry walking out of the Winners so we decided to check it out. Wonderful owners and staff... really lovely food.. and their spicy edamanme is genius! Sushi pizza... spicy tuna roll and their soups are me faves! Tried their curry chicken about a week ago and once again was thoroughly impressed:) I know Scarborough has so many places to chose from.. and believe me when I say I already have my regular to go to places... but i highly advise if yer in the area to check it out!"}
{"text":"These guys are sneaky. My bill totalled 28.85 but my HST was 5.17. I look at it and think to myself... Wait, this doesn't look like 13%... It's actually 18%.. So they added 5% on my bill but under the HST... as far as I know this is illegal.  Service was slow. I had to stand up and ask for the menus after 10 min wait. Waitress was courteous and apologized. Portions were a lot smaller than the price suggested, especially for the shrimp tempura. My girlfriend and I left the place almost hungry (and my girlfriend eats little). Quality was unimpressive. Not horrible, but nothing remarkable. We had udon soup and fried udon noodles.  I went there the other day for lunch and left satisfied. They actually have decent lunch deals.  But because of the lack of honesty with the bill, lazy service and small portions, I have no option other than suggest you stay away from this place."}
{"text":"This Japanese restaurant is located right next to Chucky Cheese, so it's convenient for those hungry families as a healthy alternative than pizza. I heard the owner is Chinese but was trained and work in Japan. The food and pricing are decent for a Japanese place. However, I didn't think the shrimp tempura  was worth it because they are small for about  $7. The place is not as big as I thought, so I recommend making reservations."}
{"text":"I've been there about 3 time,they never disappointed me.Everytime I found new fav from there.  Recommend:   1,Definitely \"Sashimi \",Fresh,big portion,Juicy...  2:Fried Udon,the one I ordered first time there and really surprised by the texture of the udon and the well-balanced sauce  3:Teriyaki Chicken Lunch Box:Chicken are so tender and juicy,sauce not too salty or sweet,love it ,and good portion again  I've been Aoyama for their signature sashimi,did turn me down,but this one never turns me down,so sad to see it's under-rated review on yelp"}
{"text":"Purchased a groupon for 2 people for this place. Did not seem worth it at all. Service was terrible.  The groupon $28 for 3 course meal for 2 people.  It came with an app that had choice of edamame, salad , shrimp tempura. I ordered the shrimp tempura it came with tempura veggies too. For the main there is choice of terriaki or a jumbo roll I chose a rainbow roll (it is 11.99 on the regular menu) my hubby also ordered a roll (10.99 on regular menu). It took the server a long time for him to clear our plates. We asked him at least 2 times for our dessert. Then it took him a long time to bring the bill. The bill surprised me since the \"original\" price of the meal would have been 60ish. The food alone was $55 but looking at the regular menu it would have no way added to $55. The owner increased the value of the groupon and we had to tip and tax on the original amount.   We definitely would have spent LESS if we did not purchase the groupon to come here. Service was the worst of the year. Would not come again."}
{"text":"This place makes some good sushi. It taste fresh, looks good on the plate, and that's about it. Nothing really stood out to me, other than one thing, the price. The prices are a bit on the expensive side. Maybe I'm more used to the pricing in Markham, where the quality might be a bit lower, but this one seemed quite expensive. It comes out to about 30$ per person for a relatively small portion. One thing that I observed, is that the restaurant has a more honest Japanese feel to it, not overly cluttered with cheap Dollarama Chinese turned Japanese type decor."}
{"text":"I bought using Uber Eats. The process was fast, within seconds of making the request the restaurant confirmed my order, was surprised especially since it was around lunch time, I thought it would be delayed, I got the Katsu Don, which on the app was labelled one of the most popular dishes. I was disappointed. It was fried pork on plain white rice. No seasoning on the rice, which is okay, but I expected more. The actual fried pork was good, but a bit too dry, especially on unseasoned rice, the meal overall just tasted meh."}
{"text":"I bought a TeamBuy $40 voucher for $20, with very low expectations, since I kind of knew that this was a Chinese-run Japanese restaurants.  The food for the most part was very good.  We ordered a spicy tuna roll, chicken terriyaki, udon, and a sukiyaki.  The spicy tuna roll was well done; the fish was very fresh, and not too much rice - albeit very small for 7.95.  However, for 15.95 for the chicken terriyaki dinner, it didn't come with anything other than rice!  No miso soup or salad.  If you want to attract people to come, then you have to allow them to have a full meal, otherwise they won't return.  A miso soup was 2.50 extra, salad probably more.  It's really unfortunate, because the food was quite good.  But charging these types of prices for the portion sizes willl not result in repeat customers.  I don't think I would return, but with a second TeamBuy voucher, and their unwillingness to refund it, I think I will have to!"}
{"text":"Came here because we had a group in. For two people,  we each get a three course dinner.   I had a salad, spider roll and then green tea ice cream.   My wife had shrimp and vegetable tempura, rainbow roll, green tea ice cream.   On the groupon menu that they gave us, they also provided entree selections for chicken teriyaki, salmon teriyaki, and beef teriyaki. Or the last option is the jumbo roll, which we both chose.   The rolls are not jumbo at all. They are just regular size.   Salad came in a big portion though, larger than what you get at an all you can eat.   Shrimp and vegetable tempura seemed quite good actually. Comes with 2 shrimps and maybe 4 vegetables ranging from taro, and eggplants.   All in all its an average Japanese restaurant. Sushi wise, it's nothing special, the spider roll with soft shell crab is not that good actually. The rainbow roll is a bit better.   Last thing, it took them 20minutes after they took away our entree plates to serve the ice cream... That was a downer"}
{"text":"It was.. alright.  not the best, but not the worst.  I didn't see any daily $5-6 specials as everything started at about $7.99.  Had the Spicy Maki set for $12.99.  For that price it doesn't really compare to a place like say Ichiban.    The service was fine.  The Food was fine.  Everything was.. well fine.  Not sure if I'll remember to come back or not though."}
{"text":"I like this sushi bar because it's clean, the location is convenient, and the service is friendly. The menu is a bit limited, and the price a bit high, I must admit, but when I need a quick lunch or take-out dinner, it's a staple. The fish is fresh and the sushi absolutely is solidly good. I would increase the star rating if they expanded the menu and matched their prices to their competitors."}
{"text":"Sushi is a bit pricey but the a la carte deals are amazing and well worth it. Beautiful place though. Love going there when I have a sushi and shrimp tempura craving"}
{"text":"Having my favourite style lunch at Takara Dune Japanese restaurant. Food tastes great, fresh. Service quick and wait staff very pleasant. Free parking, clean, price point for food is ok. Nice Japanese pop music playing in the background. I've eaten here on my travels 4 times in the last 2 years."}
{"text":"Came here for lunch today with coworkers and the restaurant was quite empty. Service was relatively quick, but with only two wait staff it took them a while to serve our entire group of about 10 people.   The food was average, the quality is similar to sushi you would find at an ayce joint, so if you prefer variety, you might be better off going to one of those joints.   Overall, the place exceeded my expectations for service and food quality only because of the low reviews the place received. If you work in the area and want a quick sushi fix, this place is a decent option, but I wouldn't go out of my way to try it!"}
{"text":"I used to frequent Takara Bune regularly.  I always thought it was a bit on the pricey side, but I really enjoy their asparagus rolls and their lunch specials.  I went recently and noticed the pricing has risen significantly.  10 dollars for 6 small Spicy Salmon rolls, 3 or 4 dollar increase on some of their lunch specials. I can't afford to go here anymore. I found another place nearby Sashimi House--better prices and great food.  I got 50% more food for the same price. I won't be back at Takara Bune...I don't mind a small increase...but 3 or 4 dollars more? Thanks but no thanks."}
{"text":"I came here for dinner with my boyfriend on a Groupon deal. The Groupon deal was for a dinner for two people. We each got an appetizer, an entree, and a desert. We each ordered the shrimp and vegetable tempera. I ordered the salmon teriyaki and my boyfriend ordered one of their jumbo maki rolls. For desert, we both ordered the ginger ice cream (not every Japanese restaurants offers ginger ice cream). The service at this restaurant is pretty good. The server was friendly and attentive. Although, it wasn't busy today in the restaurant so I am not sure how it would be like if the restaurant is busy. The food was average en par with other Japanese restaurants in the same price range. Overall, my experience here was good."}
{"text":"I really love this place.  It's small and quiet and quaint and the food is really great.  I'm a big fan of Katsu Don (basically a rice bowl with a pork cutlet baked with egg and onion - sounds simple, but when done right, it's a little bowl of comforting nirvana!).   And I have to say that the Katsu Don here is spot on.  They've won an award for it as well...  I've tried a lot of other things, and all has been prepared with care and flavour - from sushi rolls, to sashimi, to gyoza and the baked oysters (love 'em!!).  The staff are friendly as is the chef.  Their not loud and bustling, just quiet, friendly and polite.  Odd location in a mall/plaza with a Chuck E Cheese, Winners, Food Basics, and Joe Maggiano's at Sheppard and Victoria Park."}
{"text":"This place is actually pretty good.  I also came here with no expectations, and was pleasantly surprised.  The service was reasonably good, the food was good.  The service was prompt (which is necessary for lunch service).  I was really happy with this.  This place is super close to my parents house, and I have no idea when it opened, but yay!  I'd come back for sure."}
{"text":"I love their Don Buri's!  The perfect mix of rice and soup. Not soup and rice. Loved the sliced and tasty meat. Great dish for a cold day. Their sushi lunch specials are also delicious. The salad is a fresh difference from other sushi places due to the variety of vegetables used.  In terms of service, if you make the mistake of sitting in the bar, they forget about you and don't clear your plates nor refill your tea. Best to get table service."}
{"text":"We're regular here ever since we came here with a Groupon couple of years ago. Now we visit here once every couple of weeks.  The service is warm, and the food good. Their lunch specials are pretty good too.  Not sure why the negative reviews, I guess you can't please 'em all..  P.S.: Those with Groupon and complaining..The Groupon amount is deducted after taxes. If an institution is doing it pre-tax, that's nice of them. Most don't! And, please tip based on the final pre-discount, not the post-discount amount. It's demeaning to the employees, and embarrassing when we are seated next to you."}
{"text":"I came here for lunch with colleagues. They recommended a bento box instead of sushi rolls claiming that it will be faster. 40 minutes later, the bento boxes arrived. I appreciate the effort, but this sushi restaurant is very average."}
{"text":"This quiet little neighbourhood Japanese restaurant is a family favourite. While there are a few little things that take away from a 5-star rating, I like to support local, family-owned businesses and the quality of the food here is very good. Always fresh, made-to-order (as it should be). It is a little pricier for a small restaurant but if you want mediocre food for cheap prices go a few blocks west to Sashimi House, the prices there are fantastic but you get what you pay for.   As a previous poster mentioned, although this is a Chinese-run Japanese restaurant, the owners lived and trained in Japan and are not only fluent Japanese speakers but highly skilled Japanese chefs. Don't judge based on the ethnicity of the owners. This is much more authentic than a lot of other \"Japanese\" restaurants in the area.  Pros: - food is fantastic. Fresh sushi/sashimi, generous portions, food is always hot. The dinner sets are in the $14-17 range and typically only come with a bowl of rice. For a few dollars more upgrade to a bento box, it's worth it.  - Quiet atmosphere - it can get busy during dinner hours on Friday and Saturday nights or during lunch hour during the week, but with only about 10 tables it's a nice intimate atmosphere. Nicely decorated, clean, cozy. - Very friendly staff - as a family-run operation, the owners themselves are almost always working. Ivan is always at the sushi bar and Lisa is either clearing tables, serving customers, answering the phone, or in the back in the kitchen bustling around. Their kids are often seen helping serve evenings and weekends too.   Cons:  - though the servers are very friendly, service can sometimes be slow if they forget to come back to check on you.  - Since it is a small restaurant, it can fill up/get busy very quickly and the noise level rises accordingly - it's in kind of a funny location, tucked in between the Winners and the italian restaurant. If there's a big Chuck-E-Cheese party parking can sometimes be a pain but it's a big lot, only a real issue when it's raining/snowing and you don't want to park far away. - the patio is cute in the summer but you're basically sitting on the curb looking at the parking lot. Realistically nobody wants to sit out there.  ** DECEMBER 2013 **  They have this amazing Holiday Sushi Platter special on right now - $50 for 68 pieces of their specialty rolls, plus you get a $5 voucher for your next meal. Picked up one of these for a pot luck I went to last week and it was fantastic. You want to talk about value? Well here it is. For $39 you can get a platter of 48 maki rolls from Tako Sushi on Don Mills but the quality is sub-par and they're just plain salmon, tuna, cucumber, and California rolls. Take advantage of this special, you won't be disappointed!!"}
{"text":"10 piece sashimi lunch special with bowl of rice and also comes with miso soup and salad $10.95 - the sashimi was fairly fresh but portions small  Eel with rice $11.95 - I have had AYCE eel with rice that tasted better than this. The eel was rubbery and portions extremely small. I recommend Osaka Sushi Japanese Korean Restaurant if you want some real eel with rice  2 piece uni sushi was about $8.95 or so. Once again small portions and didn't taste that fresh  Normally I would give 3 stars for a place like this but when compared to other sushi restaurants which I have given 3 stars this one is determinately a step below. Perhaps I didn't order the right items on the menu but I was quite disappointed when walking out - its the same feeling you get when you finish watching a bad movie in the theaters.   PS - for the guys out there - extremely attractive waitress alert  :)"}
{"text":"Picked up tuna maki to go. Was quite tasty. Presentation was nice, ingredients fresh however quantity was a touch light for the price. Came with a very small salad and soy sauce. The staff were incredibly friendly and hospitable, offering me a lovely green tea to nurse whilst waiting for my order. The restaurant was clean and pride of ownership was evident."}
{"text":"I've gotten Takara Bune on several occasions as a take-out and dined in.  Take-out has been okay thus far.  I ordered their salmon avocado roll, which was pretty good (they custom made it - not on their menu) and ordered a spicy salmon roll.  I wasn't too impressed last time with the fact that my spicy salmon roll's tempura bits tasted a bit stale.    Recently, I had a dine-in experience and portion sizes were standard.  However, they seriously need to change their soy sauce (b/c it's way too salty) and ruined my sushi.  They also should change their tempura sauce to be a bit more flavourful (lacked some sweetness and was a bit too salty).  Finally, their appetizer salad was lacking freshness.  There were definitely some bruised pieces of lettuce in my salad, which I was definitely not impressed about.  Their teriyaki sauce was also a little off too.    Like Jennifer K has already mentioned - I'm impressed with their use of ceramics!!! Did you know that plastics can actually trap in a lot of bacteria when the paint crack?  (also another reason, my friends, if you have cats, to use ceramic or metal bowl b/c they can chin acne from all that bacteria...ANYWAY)...  This place isn't cheap.  But it's not immensely expensive either.  Definitely will come back for take-out for rolls though.  You just have to know what to order I think!"}
{"text":"Went there with a Groupon 3 course dinner for 2. Nice décor, ok service. Appetizers were good & decent size. There was VERY limited options for main meal & only 1 sushi option available. My partner & I both had teriyaki (beef & salmon) & the vegetables that came with were so salty. Only ice-cream was offered for dessert, nice flavors but the smallest serving of ice-cream I've ever had. Even with the Groupon it didn't seem worth it & for a sit down dinner we were done in 30 mins..."}
{"text":"This place is next to chucky cheese.  I was at Chucky cheese for a birthday party, but didn't want to eat there.  So ended up here.  It was a Saturday afternoon. Not busy at all.. maybe due to being a long weekend. Atmosphere is nice.  Bathrooms very clean and smelled great!! Cups and plates don't smell like soap.  I ordered the Sashimi lunch (10pc raw for $12.98)  salmon was good!! the rest was ok, not bad. Miso soup was good, rice was hot.  Service is good.  I don't anything to complain about... except as mention in other reviews.. the portion is small.  The price should reflect the location.. i can see this place having these prices downtown (bay/bloor).  But its at Sheppard Ave.. attached to a mall and next to chucky cheese.  So..  4.5 stars for quality of food ! 4 starts for cleanliness and atmosphere, and service. 3.5 for value for your moneys worth.  The Plus side is  , if you want good tasting sushi, and you just got paid,   You don't have to drive all the way downtown, and find parking to get good sushi !!!"}
{"text":"Bad service, we paid for tips and they were chasing us for more. The food is a bit more on the salty side as well."}
{"text":"I came to have lunch at Takara Bune with no expectations. Maybe that's the reason why I am so pleasantly surprised!!  Lunch Specials  from 11:30 AM to 5:00 PM. Talking about long lunch break!!   Different daily special for $5 to $6! Talking about value?!  And for me, my choice is always sushi!  Sushi Lunch ($10.95) comes with miso soup and salad exceeded my expectation. Nice balanced Shari rice, crunchy seaweed rolls and fresh fish. The only complain is the portion...  Free WIFI!   Friendly service!  No plastic plates are used... I hate those plastic everything in some of the Japanese restaurants! Here only nice ceramic table wares!  Value not equal to CHEAP!  Accepts all credit cards!  I will be back!"}
{"text":"Quality was decent.   Went there for dinner.     We ordered a number of maki rolls and the bill was almost $30/pp - and we didn't eat much.    Wasn't really a good value for money... for this price, go down the street to Aoyama and have a way better meal!"}
