{"text":"This is a great little place that I frequent for sushi lunches with work peeps. I have not been brave enough to try the \"sushi buffet\" just around the corner (my stomach rebels at the thought of those two words in a sentence).   ANYWAY. The atmosphere at Takumi is Asian-cool and relaxing. Nice little bar area. Their take out service is top-rate and very courteous.  I am not going to sing the praises of the sushi per se: it's just fine, doesn't exactly outshine other Madison options, but hey--I'll keep coming back."}
{"text":"I wish I could give this place 4.5 stars! My husband and I got the spicy squid salad to start. The texture and flavor were good, but it wasn't very spicy. We ordered omakase (chef's choice) for two for our entrees. It was amazing! They had a great variety and we got to try things we've never had before.   The drinks were tasty and the service was great. We will be back soon (and often) for omakase! This is hands down, the best sushi restaurant that we've found in Madison... And we have tried almost all of them :)"}
{"text":"Outstandjng sushi with a great variety to choose from. Sashimi (sake) was some of the best I've had. Candy Roll may be one of the Top 3 best rolls of all time.  Service was good.  ONLY reason 4 stars and not 5: they don't have brown/black rice (But most other sushi restaurants don't either). Definitely an instant favorite and I'll be back."}
{"text":"Can I give ZERO here?!?!  What an awful place for sushi and I literally cannot believe this is so-called \"best sushi\" place in Madison!  One of the sushi we ordered was Inari sushi (bean curd). The first second I saw it I know it might not taste good. But I put in my mouth anyway. What a bad idea! It tasted like they put cooking wine in the bean curd, which is absolutely not right becoz the bean curd tastes either sweet or sour but nothing like wine!!! I don't think they were fresh! It tasted like the bean curd had been kept for way too long and it fermented!!! I had to spit it out bcoz I didn't want to get food poisoning!! The waiter came but denied immediately anything wrong with the bean curd. No apology or anything. I heard the guy behind the sushi bar even asked the waiter whether we are Chinese. They were talking in a dialect from China. But unfortunately, I happened to know that dialect. They came back and denied any bad food again but still no apology for anything. The guy behind the sushi bar also had a weird smile on his face and was looking directly at me. Some kind of provocation?!?!  Didnt touch anything else, I left. Def NO COMING BACK!!!"}
{"text":"I have been there a few times now with family and friends. I am not a fan of raw fish but I do like California rolls a lot. They are different than regular grocery store sushi.  My husband is a fan of their Sashimi and some other things I can't remember. I am usually not a fan for Japanese food due to their blend taste but so far Takumi hasn't disappointed me yet."}
{"text":"When I go to sushi restaurants I don't fuck around with the novelty rolls that contain deep fried, bread battered stuff. Any average Joe sushi restaurant can take shitty quality fish, smother it in batter, deep fry it and call it tempura. I take my risks and go straight to the pure raw stuff. Classic sushi and sashimi. I've been burned by this before at less-than-quality sushi establishments but takumi hits the bullseye here. The fish is fresh and delicious the moment it hits your tongue. The Wasabi is also strong and not diluted--it shoots right up your nose. The service was quick and the presentation was expertly prepared. They give you generous portions on the sashimi. I would definitely come back again. Thank you for reinstilling my trust in strip mall sushi restaurants."}
{"text":"We called at 2:00 pm to see if they would take us for lunch and the manager informed us they could, but that the restaurant closed at 2:30 pm.  We arrived at 2:14 pm and the hostess refused to seat us.  We asked for the manager. He came out to see us at 2:18 pm and informed us that we were too late.  He wasted our time. Poor communication, poor service, poor review.  Do not go there."}
{"text":"The sashimi supreme was excellent. Large portions and very fresh. Definitely worth a visit."}
{"text":"I go to Takumi about twice per month. I don't get sushi for myself but I bring it home for mi esposa and this always goes over very well. I've never eaten inside of Takumi but I generally get great service from the host who has my food. Rarely have I ever had to wait for my takeout, they tell me it'll be ready in 20 minutes and it is ready in 20 minutes. My wife enjoys the sushi a-la cart especially the tuna, salmon, squid or whitefish. The challenge with any sushi restaurant of course is freshness in raw fish, and we've never had an issue with Takumi on this note. Price is fair, I've never been there for lunch but I recall seeing some very good prices on rolls for lunch specials."}
{"text":"The sushi here is great, the atmosphere is cozy, and the service is friendly and attentive. We went on a bustling Friday evening and were seated at the sushi bar. While I prefer a table, it was fun to watch these chefs--they worked ridiculously fast, which showed in how little time it took for our food to get to us, despite the place being packed.   Our waitress was very friendly, and particularly accommodating of my boyfriend's 8-year-old daughter. For example, she was trying to use chopsticks, and very determined, but kept on dropping them. Our waitress, despite being super busy, asked us if she'd like chopsticks with a rubber band to make them easier to use. Once the kid had those, she was using them like a pro. Now, this may seem like a small thing, and perhaps it's not that unusual, but we've never had anyone offer this before. It seemed like a very thoughtful gesture.   I ordered the sushi deluxe (chef's choice), and it had a good variety of fresh, flavorful fish.   Overall, I'd definitely recommend this place if you're on this side of town!"}
{"text":"Great sushi- we had the iron man special. That included lobster, tempura, avocado. Nice atmosphere. The miso soup was delish! It was so delightful to have good sushi as we live in a community where that isn't present!!"}
{"text":"Absolutely delish. Me and my father go here at least once a week and the service is fantastic each time. Oysters are great and come with a tasteful saki sauce. All of the fish is fresh (I requested to see their order forms, they get new produce thrice weekly.) And their clear broth soup is fantastic. Only downside is the house salad, which is occasionally bitter in respect to the lettuce. I'd blame this on a bad season for lettuce though as even flemings had this issue."}
{"text":"This had to be the most disgusting sushi I've ever had! The service was awful. It took me over an hour to get 3 rolls to go. Then not only did the rolls fall apart they had an awful taste."}
{"text":"We got there late on a Friday but they did hibatchi just for us. Probably one of the best hibatchi chefs we've ever had!"}
{"text":"Sushi is good here but the service is atrocious. The wait staff treat you like you're a burden.  We've been here for 20 minutes and haven't yet been served water.  If you're looking for an elegant experience, this place isn't it.  If you're looking for decent sushi and are willing to wait and wait and wait, give this place a try."}
{"text":"Nope.  Nice staff, but sushi not so nice. The pieces are way to big at least twice the size of normal, which makes it not as enjoyable already. Then the quality of fish just isn't there. I've never spit out tuna belly so not sure what their \"tuna belly\" was. Not worth $9 a piece for sure tho."}
{"text":"having been on a budget for 4 months that doesn't allow for sushi, i was very excited to try Takumi.  i was impressed, pleased, and full when i left. the chefs were all very professional and seemed to be having a great time. the fish was very fresh. i was talked into the bluefin they had just gotten in that day and opted for the tuna as opposed to the toro (there was a $5 difference/piece) and it was very good. a smooth texture and very good color.  the other signature rolls (crazy tuna and sweet heart) were just as good. it was nice to try those new flavors, especially the seared tuna inside and spicy tuna with tempura crunchies on the outside.  we were also presented with a complementary crab stick salad (which also had tempura crunchies and a spicy mayo sauce) and were surprised by a desert consisting of a very delicately-balanced orange rind holding apple bits with a creamy honey sauce and the fruit of the orange on the side. i think it was their way of saying \"thanks for spending so much!\"  we got warm sake, five rolls, three pieces sushi and an order of gyoza for a total of $76. not bad at all, except our eyes were much bigger than our stomachs and we had happy friends to bring the leftovers to."}
{"text":"This is our favorite Japanese restaurant in the Madison area. The sushi is always fresh and flavorful, and the staff are also very nice. We came to celebrate my husband and daughter's birthdays and the staff was nice enough to provide a complimentary dessert (fried ice cream!)...yum! We love the specialty rolls (dragon, rainbow, spider, etc), but even the more common rolls, i.e. Spicy tuna and California rolls, are super delicious!"}
{"text":"This is one of the best places to dine in Madison. Their sushi is second to none in Wisconsin!"}
{"text":"We were driving through Madison and decided to stop I for Sunday lunch. We were really impressed. The fish is fresh, the portions are huge. We had the sashimi happy hour special - the pieces are big. Kids shared the bento box and loved it. Staff were very pleasant and kind, my 3 yr old jammed his finger in the bathroom door and they all helped."}
{"text":"Watch your credit card statement, they increased the amount  not a fair business practice"}
{"text":"Delicious everything! Ordered gyoza and oshitashi to start, salmon and super white tuna sushi, and a yellowtail scallion roll. My partner ordered a bento box and loved it. Really fresh - yum!"}
{"text":"THE MOST AMAZING SUSHI RESTAURANT IN MADISON!!!!  i love their sushi so much,they had really-really fresh fish and good service,nice guys and good atmosphire. i like takumi's raw seafood,specially their fresh sea urchin and oysters just like melt in mouth,owwhh...thats so good,,,like it!! if i could give them 10 stars,i will then. great sushi,keep it up!!!"}
{"text":"REALLY great sushi!!!  I live in Chicago and have family in MN; we ALWAYS make sure we stop at Takumi on the way in or out of town.  Service is always great, excellent sushi selection, and the prices are awesome!  Truly a gem!!"}
{"text":"Pretty good, but not amazing. I had seafood tempura and a roll. I was a little disappointed with how much everything cost. If it had been a little cheaper, I would have given it 4 stars. Sure you can get away with spending less but you may go away hungry!"}
{"text":"While going to UW-Madison (graduated in Dec. 2007), we came across this little, cozy sushi restaurant near east towne mall. And we absolutely loved it! We loved it to the point where we became frequent customers (the waitresses knew our names). The price was very reasonable and the fish was always fresh. Also, if you sit at the sushi bar, the chefs will typically give you free sushi / salad as well. I noticed that they had a hibachi grill in the back, but never tried it.  Takumi is highly recommended. Out of all the sushi restaurants in Madison, this is the absolute best! We will definitely be back next time we are in Madison."}
{"text":"I tried the Sweet Heart Roll - Spicy scallop & tempura fiakes rolled w. tuna on the top and I had some sashimi and miso soup.  They serve the nice beige ginger and a nice big chunk of wasabi with which you can torture your sinuses.  The roll and the fish was good.  They have an area with an authentic table, low to the floor, where you have to take off your shoes.  Nice if you want that extra Japanese ambiance.  Since they went so far as to setup a Japanese style table, I'm surprised they didn't serve the miso soup Japanese style (no spoon)."}
{"text":"I usually don't give 5 stars unless I am that impressed. Since moving to Cottage Grove six months ago I have been on a search for the best sushi in Madison, I have tried all of them.  Some I even reviewed--check out my history. See my wife and I are foodies, relocating my business from California and my wife buying a small farm (7 acres) to start growing organic veggies & raise chickens. Takumi is a small cozy place with a warm feeling to it, with caring and attentive staff. In California I was spoiled with a Japanese sushi chef named Nao-san who understood our search for Traditional Japanese Omakase.  The head sushi chef at Takumi is the only sushi chef in Madison who gets it. If it's not fresh he will not serve it, order Omakase for 2 and watch the magic start. It's a privilege to eat at his bar.  P.S. The bartender is a cool dude who makes a wicked cocktail."}
{"text":"I was on the fence on whether I should give 3 or 4 stars, but decided on 4 because of the value you get. I should also point out that my review should have an asterisk by it because I have only ever eaten lunch there, and have never paid for an individual roll (which I would assume would be of better quality). Their sushi satisfies my desire for sushi, and tastes pretty good, but it by no means is great sushi. I do however recommend this place, because the 3 roll lunch special is $13, and comes with soup or salad, making it a great place for sushi if you are on a budget."}
{"text":"Not bad at all.  For my money Muramoto's is the first choice for sushi but, Takumi is a decent little place that is a good value.  Their sushi is fresh and is very appealing to all senses.  The high back chairs and attentive staff also give you the feel of being at a higher end restaurant.  The only feedback I have is that the place could be a little tidier and loose the music that gives off the feeling that you are watching that anime stuff."}
{"text":"This was our 5th, or maybe our 6th visit to Takumi. The service on a very busy Friday evening was friendly and attentive, without being overbearing.  The food was fresh and perfectly prepared.  The presentation was appealing.  I have eaten sushi all over Madison and Takumi is second to none.  Even our grandson, who is 6 and a half going on 16, enjoyed this visit.  We will be back."}
{"text":"Love this place! By far one of the best sushi places in town, next to Muramoto's. I have had sushi at ginza, and takara and all the other places but Takumi's is way more fresh. Try the Chef's special roll of the day, I have never been disappointed. I am orignally from the east coast where seafood and sushi is plentiful, this is just as good as the places back east. :-)"}
{"text":"You know those moments at lunch time when you're thinking, \"I could eat the same, reliable things...Or I could take a risk and try something new.\" That was the exact scenario that led me to the Takumi Madison Japanese Restaurant for lunch. As it was the afternoon, we all ordered the lunch specials: Three Bento Boxes ($9.95 each) and one Choose Three Sushi ($12.95).  The place was pretty packed for a Thursday, but we were seated right away. Each of the lunches came with salad or miso soup -- we ordered both. The soup was pretty good, with small tofu pieces and plenty of wakame (seaweed). The salad had a miso dressing with one slice of tomato and cucumber.  The Bento Boxes we ordered were the chicken teriyaki, vegetable & chicken tempura, and the vegetable & shrimp tempura.  Each of the boxes came with a small side of sushi, chef's special side (in this case, it was fried shrimp prices that looked like fried bananas), and fruit (canned pineapple and two orange slices). The sushi we ordered was the salmon skin roll, shrimp tempura and California rolls.  Let's start with the chicken teriyaki. In a word: Wrong. I've had plenty of authentic Japanese teriyaki meals, and they typically pride themselves on freshness and authentic flavors. This was not the case at Takumi. The chicken was not grilled, but looked closer to the Tyson ready-made chicken breast. Even worse, it reminded me of some of the not-so-fond MREs I ate in the military (meals ready to eat). Actually, I think I may have preferred the MREs. The sauce was completely flavorless and the onions were raw. Just awful in every way. Seriously, this is the worst chicken teriyaki I've ever tasted.   The tempura was clearly more of a comfort spot for the Takumi. It was actually pretty good, with large slices of fresh vegetables (sweet potatoes, broccoli, asparagus, zucchini). The Tentsuyu (Tempura Dipping Sauce) was also not bad. Then again, kind of hard to mess up on fried vegetables. The shrimp was also pretty good, all around.  Their saving grace was the sushi, which I'm assuming is what most people come there for. The California Rolls on the sushi plate were hands down the best on the meal, followed by the salmon rolls.   Now, I fully understand the whole \"small delicacy\" aspect of Japanese food. However, at ten bucks for the lunch special, I expect them to load up on vegetables (not the case) and get the main course spot-on. They missed it completely.   Bottom Line: Although the sushi was pretty good, it could not remotely make up for the terrible chicken teriyaki and unevenly balanced price-to-portion ratio. This is the risk you take for unknown lunch. For me, certainly not worth returning."}
{"text":"Awesome, awesome place. Tucked away so that you could easily miss it. Definitely coming back. Get the hibachi, so so worth it. Amazing place."}
{"text":"The quality of fish here is very good. I liked how they added some tempura flakes to their spicy tuna rolls to give it that extra oomph. I'm not a fan of specialty rolls so I can speak to that but the yellowtail I got was  good quality stuff.   Great staff that pays enough attention to you to warrant their tips. Although I am only in town for a week, I intend to dine here regularly.   I got the sushi deluxe with two yellowtail scallion hand rolls. The nori was of a good quality and had a nice roasted aroma.  The place is hard to find at night.  The sign isn't illuminated. If you are facing Eye Contact, they are the last space on the left."}
{"text":"Definitely deserves 4.5 stars. Excellent service, great food. I would recommend this place. I will be back."}
{"text":"We absolutely love their fresh sushi and customer service is great.  The wait staff is always attentive, and we tip well.  We just wish they were open more frequently; several times we have showed up (e.g. 4:00 p.m on a Saturday) only to find them closed, and have been disappointed."}
{"text":"Sushi is decent, and good for a quick lunch before having to get back to work. Their tempura lunch bento box is a pretty cheap and good deal. NEVER order their udon. All they give you is noodles in a bowl without toppings. You might as well go down the street to hyvee and buy a $1 pack of instant udon and pop it in the microwave instead of spending $15 on a bowl there."}
{"text":"All the typical offerings of a sushi place, all fresh fish, friendly staff. Nice experience and good sushi. Will definitely be back when in the area."}
{"text":"Amazing sushi. The place is pretty small but has a great ambiance about it. Reasonably priced sushi an it is presented very well. Will definitely come back anytime I am in Madison!"}
{"text":"Regularly priced for a sushi restaurant. I would recommend going during the lunch, 12.95 for three rolls and soup or salad; lunch bento is also available for about the same price. The meal was good but average, great for the lunch price but wouldnt pay full price for some of the rolls. I'm sure their signature rolls, like most other places, would be a better quality but for a steeper price. For dinner visits, the martinis are amazing."}
{"text":"I get the same  ...damn  ...thing  ...EVERY TIME  I'm here!  It's just comforting; whether chillin' here alone, with my friend Jennie or taking an order home to go, it's the dinner sized Bento box with teriyaki chicken & shrimp w/ Miso soup and extra wasabi & rice.  Yummmmmm.  Spankii Style.  Go here.  Eat.  and LOVE it...  Spankii Yum-Yum has spoken..."}
{"text":"I just went to Takumi for my birthday dinner. I've been there before and everything has always been fantastic! My favorite part, however, was the fact that they have a private tea room where my family and friends could have some privacy while enjoying our amazing sushi. I will continue to go there."}
{"text":"This was my very first visit to Takumi and I had chicken tempura udon for lunch.  I was looking for an authentic Japanese food experience and was excited to find this place in Madison.  The ambiance of the store was nice though I was seated at an awkward table which was in front of the entrance door.   The service was so so. I was not greeted at the entrance and it actually took more than five seconds for one of the waiters to notice me. I was promptly seated. However, through my meal alhtough I was offered water refills I was not once asked how my food was.  The udon broth tasted rather bland. It was just the noodles, broth and kamaboko. No green onions. The chicken tempura was crispy however, again bland to my taste. The mushroom and broccoli tempura had absorbed too much oil to my liking. I have not tried any sushi. They might taste better, but I am not returning for any tempura nor udon."}
{"text":"There are pretty limited options for Sushi on Madison's east side.  For the best in the area you will need to head downtown, the west side also has at least one solid offering.  But when Takumi opened it was a definite step up from what used to be availble on the far east side.  I favor nigiri and the fish here has never dissapointed.    The only two complaints I would mention are that the chef's choice dinner meal always includes the exact same fish varieties and I much prefer the spicy tuna rolls that consist of chunks of tuna vs the ground up spicy mayo blend that Takumi serves.    That being said Takumi is very conveniently located, reasonably priced, and the food quality has always been very good."}
{"text":"Uneducated and dishonest. Rude and unbelievable  I am very confused about why this place can receive 4 stars in yelp. If you can see this message by any chance. Good for you. Otherwise, I hope you will think twice.l before you walk in. We were a group of 7 who had lunch there. The waiters were really rude, not just one of them but all. We only saw one of then gave us a smile when we were paying the bill. They are uneducated and unprofessional. They wouldn't even let you finish your speak when you were ordering and they gave you a bad look when you take longer. Also, they gave us the wrong food and wrong bill.. I understand shit happens sometime. But were paying the bill, they add 17% tips in the bill and did not mention it in our \"final bill\". So on 2 of the 3 bills, we paid extra tips. Thanks to another friend who saw the original bill and found out the fraud. They deliberately cheated us. The reason is I signed extra tip because on out bill the top section is empty and after I signed extra tips and handed back there ticket. They didn't mention a word. And when we came back and change the amount. They acted like nothing happened. If you are going to this place, I am not saying you will get a bad service like us. There might be other reasons they did this to us. Like we are tourists or we are Asians. But I just don't think this rude and dishonest restruant does not deserve a 4 star. And maybe they should do something else other than serving food which they are obviously not good at."}
{"text":"This used to be our \" go to\" sushi place.  Past couple of times haven't been good. We went there closer to dinner when it wasn't busy. Service was good but the food made us sick.  I decided to go yesterday in hopes to give it another try, I now have food poisoning.  Not worth my $22.  I'll stick to other downtown or typical grocery store sushi."}
{"text":"Worst Japanese ever. Shrimp teriyaki consisted of uncooked vegetables, warm shrimp, and lukewarm teriyaki sauce poured over the top. Shumai were lukewarm. Server seemed unhappy to be waiting on table. I wonder if she knows there are 20 restaurants within 1 mile? Next time, I won't choose this place."}
{"text":"Sweet Heart Roll was delicious and service was great. The sushi combo dinner was good as well. One of the best sushi places in Madison. We will definitely be back."}
{"text":"Not at all impressed.  The bass was seared 26th a torch leaving acrid smoke taste. The edame appeared microwaved as it was rubbery."}
{"text":"Too hard nigiri. Too hard rice.  Looks they don't know how to make it. This in not Japanese sushi. But it's okay for my hungry stomach in this time. Botan ebi, this was opposite open!  All fish are dried.  But it's okay for my hungry stomach alone dinner. They charge hot tea as well. Never back again."}
{"text":"Another amazing dinner never disappointed! The sweetheart roll with fresh tuna was amazing"}
{"text":"Just passing through the area and needed a sushi fix.  These guys fixed me good.   I was a little concerned about their location, but once we were inside it was clear we made a good choice.  They greeted us immediately with a big smile, found a place for us to sit and took drink orders right away.   They have a large menu full of all kinds of rolls and other stuff.  But I'm a conventional sushi eater.  So I ordered the sashimi deluxe.  All I can say was it was fabulous. Large pieces of excellent quality fish.  But it wasn't just the quality ... the presentation was first class.  I'll post a pic, but it really won't do it justice.   I also had the baby octopus salad.  It was good, but I was expecting it it be a bit more spicy.  Also ordered the oshinko sampler.  It was ok too, but could have had more oshinko in it.   The bottom line is that I would definitely go there again and again if I was in the area.  You sho"}
{"text":"You can call ahead and pick up your order, this place is always busy. Every Friday my coworkers and I order their lunch special.  Very reasonable for 2-3 different rolls AND miso soup.  The place is always packed, people are nice, very clean, and I like the ginger here better than other sushi places."}
{"text":"Great, entertaining sushi chefs,  relaxed atmosphere,  and attentive staff!  You know a restaurant is good when you see the same staff and chefs each time you go there!  We've ordered just about everything on the menu,  Oyako donburi, bento boxes, sushi rolls, habachi at the habachi table, and drinks - all superb.  The staff remembers you and caters your order with attentive detail.  We really appreciate the fact thst the sushi artists will banter with you, instead of being serious and reserved at the other sushi places.   I like how their habachi comes with your choice of ice cream in addition to soup, salad, shrimp appetizer,  and rice.  You can even change the rice to fried rice or fried noodles for a small upcharge.  For my birthday,  they have a gong ceremony along with a giant fried ice cream dish! It's hilarious!   They have one tea hut-style seating room,  so if you want to dine there,  better reserve it.   Come here for beautifully presented sushi,  amusing habachi,  or their many other wonderfully homey Japanese dishes!"}
{"text":"I was pleasantly surprised with this restaurant! I have only had sushi here. A few we tried were: angel roll, crazy tuna, spider roll (I forget all we had!) and we were very happy with all of them. I also had very good miso soup [lots of wakame & tofu] The Sashimi [Tuna & Salmon] was soo fresh & they were big pieces!  The service was great.. had another Sapporo before my other was finished! The restaurant is very homey, nice & clean.       I would recommend Takumi any day for sushi! Try out their specials!"}
{"text":"We stopped here on our way home from Minneapolis. The location is easy to get to from the highway. The food was typical and well prepared. Nothing special, but decent."}
{"text":"Always 5 stars. We have been a number of times and our only disappointment was when we arrived to find the Hibachi chef had the night off (lesson learned, call ahead for reserve.) From sushi to hibachi, steak to seafood, you can not go wrong here. I prefer the filet on from the grill but friends have said the Hibachi steak is good too.  Two thumbs up!"}
{"text":"Here for my sons birthday party. Hibachi time! They did a great job, very entertaining, and the food quality was very good. I had the tuna, which was amazing! Sushi grade. Steak was super tender, too. My son's only complaint was that the tricks weren't dangerous enough:)"}
{"text":"I went to Takumi for lunch with three other business travelers from Washington DC.  I have been so many sushi places while traveling on business and this is among the best.  Lunch specials included two sushi rolls with either soup or salad for under $10.  I had the Spicy Tuna and the Spicy Tempura Shrimp rolls with the Miso Soup.  The soup was really flavorful and had lots of scallions and just the right amount of tofu.  The sushi was REALLY good.  The Spicy Tuna Roll was exactly what I expect in a spicy tuna roll - a good mix of spicy, smoky, and umami.  I tried the Shrimp Tempura Roll because I wanted something a little different from sushi I usually order, and it was great!  It had a good balance of avocado and cucumber and it was nice and crispy.  Our server was very friendly and helpful when we were trying to decide between a la carte options or the lunch specials.  They don't have lite soy sauce on the table, but they'll bring some if you ask for it.  Overall, good service and good food for a great price."}
{"text":"I really enjoy the sushi here, and the service is absolutely wonderful! Everyone is friendly and the chefs love to show off to you and get you your food quickly.   I've been working on going to all the sushi restaurants in Madison and this defiantly one of my favorites!  The only thing that threw me off a little was their mushroom soup. The first time I ordering it they had the typical mushroom slices, however when I came back a week later they had small mushrooms with long stems that tasted a little slimy.   Overall though, the environment was great and they have a private room for larger parties and offer to have one of their chefs cook in front of guests in that room."}
{"text":"I love that this restaurant is located right near the mall. Looked up \"sushi\" near Sun Prairie and Takumi popped up on Yelp. Walked into to modern decor, a great seating arrangement, and friendly staff. I would say this is a family friendly restaurant...my kids we're being absolute angels (sarcasm) and the waiter was extremely kind.   Came here to specifically eat sushi, but there is a hibachi area located towards the back of the restaurant. There is also a sushi bar for all you single ladies and gents. An awesome fish tank for you to stare at while your watching other people eat and patiently waiting to be seated.  Ordered four different rolls to try and a kids chicken hibachi meal all for about $60 and some change. I've tried 3 other sushi restaurants in Madison and this has to top the other guys by far. The rolls are generous in size and stuffed with filling. I love that they use fresh ginger and not the pickled pink stuff. My spouse said the wasabi was so good it opened up his sinuses. Taste tested my kids chicken from the hibachi - the chicken could've been stir-fried a little better and nothing fabulous about the sauce.  Would definitely come back for sushi."}
{"text":"This place was okay. Wasn't the best sushi I've ever had and the waitress kept forgetting my order... the warm sake was good and the Mai Tai was pretty good too!  I enjoyed the miso soup. I may have to bring a sushi connoisseur to help me pick out a good roll or something. Anyway... I may try elsewhere before I recommend this place to my friends. It's not the first place on my list. I wish it was though.... had good recommendations from my friends. Anyway, bathrooms were pretty cleaned, it's a bit small but there are private rooms and hibachi available as well. I've yet to try the hibachi. It was a bit cramped but there was enough elbow room to enjoy your meal. It's a good place for kids as well."}
{"text":"It was so awkward when we walked in. It was awkward when we sat down at the sushi bar. We sat there for 15 minutes and the sushi chefs literally avoided eye contact. The food was alright. We got omakase for two and it was so mediocre. Spend your money elsewhere. Two stars is for our server. He was extremely nice and attentive."}
{"text":"What an amazing surprise!  It's a family tradition to stop in Madison on the way back from any trip to Minnesota or the Dells and we usually go to another hibachi place.  My mom has zero sense of direction and led us to Takumi and we are so glad she did.  While it wasn't the place we were expecting it was a great experience.  We had the entire hibachi room to ourselves and the service was outstanding.  The portions are huge and extremely fresh.  My wife ordered the tuna hibachi and they brought out a huge fillet of sushi grade tuna.  Her meal was a steal as I am sure that ordering that much sashimi would have bankrupted us!  Their sushi also looked outstanding, but we kept to the hibachi.  If I didn't live 300 miles away I would regularly frequent Takumi!"}
{"text":"My fiancé and I searched all over the madison area for a good sushi place. We were beginning to lose hope until we ate at Takumi. Now, I won't go anywhere else! The service and the food are the absolute best hands down! you will not find better sushi."}
{"text":"The ambiance is very nice and the staff are friendly! The Candy Rolls are soooo good (don't let the name fool you, it's not actual candy)! I thought the prices were super reasonable! I just wish I had tried the hibachi!"}
{"text":"I love sushi.  A lot.  And I don't mean that I like california rolls, or ones with cream cheese and 14 sauces on them.  I mean I like eating delicious raw fish and slightly seasoned rice wrapped in seaweed with hints of cucumber and maybe avocado.  My favorite roll is a spicy tuna and my favorite place to get it is a tiny place in the middle of Indiana.  But neither here nor there, the spicy tuna roll is what I judge all other places on. Takumi's spicy tuna roll is perhaps the epitome of average.  There is nothing wrong with it, but it's not amazing.  It is like many other places, chopped up tuna mixed with a spicy mayo type sauce rather than a piece of tuna fish with sauce drizzled on top, but after so many spicy tuna rolls, I can't really fault them for doing it just like everyone else.    Other items I've gotten at Takumi are the Mango Cruise roll, the Rainbow roll, the Eel Cucumber roll, Miso soup and Edamame.  All of these fall under the same category of perfectly average.  They are all tasty, I enjoy them when I'm in the mood for sushi for dinner after work, and I would rather get sushi from Takumi than the local grocery store sushi bar.    The prices are fairly reasonable, you can get the basic rolls for around 6 dollars and the obnoxiously fancy ones can go up to 18 bucks.  I often do takeout/delivery but I have eaten in once which was perfectly lovely.  Very comparable to other small, Japanese restaurants that I have been to.  They do have a sushi bar that you can sit at, but the place is so small you can observe the sushi chefs from nearly every seat in the restaurant.  They also have hibachi grills towards the back, though I have never done that, nor seen anyone do it.    Overall, Takumi is great if you are looking for a quick, standard sushi meal without the hassle of going downtown or spending exorbitant amounts of money.  They aren't usually terribly busy which means getting a table is a cinch, something that cannot be said for places like Red Sushi downtown."}
{"text":"I had the 3 roll lunch special and they were all fantastic, so much so that I couldn't decide which piece to eat last. ;)  The only complaint I would have is they use a small water glass and my server never returned to fill it.  I will definitely be back.  By request, I had the salmon, spicy salmon and salmon avocado. (I like salmon. LOL)"}
{"text":"We go to the SUN PRAIRIE location and its a struggle to not go every week (gets expensive)!! Just love it! We wont go anywhere else.  I recommend the wasabi sting roll or the candy roll. This place is really small so I suggest you go during odd times otherwise you'll have quite a long wait.  The host/waiter is SO friendly.  Always smiling and making sure your as comfortable as can be while you wait. I even have friends from out of town hooked on this place.  Every time they come to visit they insist on sushi!"}
{"text":"Totally nondescript spot in a strip mall on the east side of town, about 6 miles from the capitol. It's definitely worth the extra drive, though -- sushi spot where the waiters and chefs actually speak Japanese. I had the udon and five pieces of sashimi. Udon was delicious and tempura didn't taste like it came out of a box or anything (like it does at so many places). Sashimi seems like a ripoff at first, since you only get one piece for order. But the size they give you is equivalent to the typical 2 or 3 pieces you get elsewhere. They're big giant slices. I think this is mostly good, but with certain types of fish, it's hard to chew such a huge slice, and there was a bit of a rubbery action with some of the tuna and yellowtail cuts when I tried to down them in two versus one bite.  Decor is mostly tables and booths -- no frills, so no inner decor costs passed onto the consumer. Also, there are like 8 stickers for the Fraternal Order of the Police on the front window. No clue what that's about lol."}
{"text":"I am visiting here from D.C., and this was fresher fish than I have ever found there. Very impressed, nice atmosphere and great service. We liked everything we had, especially the sashimi special."}
{"text":"I debated between a 1 and a 2. It just wasn't good. There were bugs on the sushi bar. It took foreverrrrr to get our check and people were yelling throughout our entire meal."}
{"text":"This place can be hit or miss. Sushi is generally good, but other menu items are of variable quality. For example, on my last visit, one person at the table had a hair in her salad, and my udon was overcooked. The waitress corrected the issues promptly. I also question the general cleanliness - bathroom was a messy and the dining room floor is always sticky. I get sushi to-go only...rarely eat in."}
{"text":"I was craving Japanese food and was a bit nostalgic about the lunches I had while living in Japan. I noticed Takumi while heading for a dinner with family members on a previous evening, so I thought I'd give it a try. I had the pork cutlet bento and was very pleased. The cutlet was very tender and the breading was crisp and light. The sushi choice was a bit uninspired, California roll, but it was tasty. The box was beautifully presented and more than adequate in quantity for a very filling lunch. I did have to ask for rice, which seemed a bit odd. My waiter was very apologetic and provided the rice promptly. The prices were reasonable and the service was excellent. The lapse with the rice and the uninspired choice of sushi are the only things keeping me from giving this a five star rating. Takumi satisfied my nostalgia for Japan and gave me a very satisfying lunch experience."}
{"text":"Lunch Special! 9.95 for two rolls and soup or salad.. talk about a deal!   Ok, now down to business:   The decor leaves something to be desired. There is a sad fish tank and fountain at the entrance. Seating is limited, but there are several private rooms.   Their rolls are fresh and delicious. My personal favorite is the vegetable tempura that comes with huge pieces of sweet potato. Also, their seaweed salad is fresh and flavorful.   I have gotten take out a few times and it it always fast and fresh. Even ordered earlier in the day for a timed pick up in the evening.   This is the best place for sushi on the East Side of Madison."}
{"text":"Very disappointing. I went here on Yelpers recommendations. What a mistake.  I got the shrimp tempura udon. The broth was flavorless. At least the tempura was cooked well. Also got a flying fish roe sushi. VERY FISHY TASTING.  Two of my friends and I that ate the shrimp got sick. POISONED. The other friend didn't eat the shrimp and was fine. Punk.  Beware. Be scared."}
{"text":"Great lunch spot in Madison.  I haven't tried the sushi yet, but I got the hibachi lunch special and it was fresh, tasty, affordable, and quick.  All the things you want from a lunch stop.  I'll give the sushi a shot on my next trip up to Madison.  Service is friendly and the atmosphere is a very typical casual sushi restaurant.  Sushi bar on one side with seating and small tables on the other side.  $8.95 gets you a hibachi grilled meal of vegetables, white rice, your choice of meat ($1 more for shrimp), shrimp appetizer of 2 pieces, and your choice of salad or soup.  The sauce was a little sweeter than what you would get at an actual Japanese steakhouse but tasty.  And the portions are large, so there was plenty of food.  I'll definitely be back."}
{"text":"Love this place, my boyfriend and I love that there is such a decent sushi place on the Far East side. It's even reliable for Togo orders. I highly suggest this restaurant. The sashimi has always been fresh and they have decently priced drinks."}
{"text":"I would like to argue that good ambiance is everything; the food tastes better, you're in a better mood, you have a better time, and you're more likely to give a positive rating.   That said, Takumi has this down - from the woodwork, to the paper-facade inspired ceiling and room arrangement, I walked in and felt instantly cool. The only thing they're missing is a soundtrack - the noise from the hibachi room and general dining chatter made the experience incohesive at times.   The proportions and presentation of the food is more like Japanese home-style cooking rather than fine dining. We ordered the shrimp and veggie tempura and the age tofu for appetizers. We also ordered the chef-selected two-person sushi platter, which was just okay. The hot sake is good, and goes with everything. If you like matcha brown rice tea, I recommend ordering the hot tea.   The best part of our plate was the two, deep-fried king prawn heads perched on our sushi platter. I ate the remaining meat and took the rest of it home to cook in rice porridge. Delicious.   If I had to take anyone out to eat sushi in Madison, this place is in my top two picks."}
{"text":"Excellent sushi... the other dishes including the hibachi are just okay...  and serve is at times a bit clumsy.  but the quality of the fish itself is by far the best I've had in the city.  If you want originality seek out Miramonte or Sushi red.  If You Want Excellent Raw Sushi Come here."}
{"text":"This place is the best. My favorite restaurant. Other sushi places are more expensive and less delicious.  You can't beat Takumi!"}
{"text":"Came in for dinner on a Sunday evening and was seated immediately. Staff seemed friendly. Food was pretty good and did not take too long to prepare. Staff tolerated our toddler who wanted to walk around the restaurant while we waited for our food."}
{"text":"Interesting and tasty selections, new rolls specific to their location that I haven't seen anywhere else. Glad I read the reviews, it's a great place to eat."}
{"text":"We tried Takumi for an early dinner last weekend. What a pleasant surprise. This is now my favorite sushi restaurant in Madison.  We were seated immediately. Our waitress was prompt and friendly. The menu includes not just a variety of sushi, sashimi, and nigiri but also a variety of kitchen entrees and of course hibachi. We had sushi in the front room so we didn't see the hibachi tables in the back room but we could hear the happy clamor from other patrons.  I ordered the spicy squid salad, the chirashi and my partner had a couple of rolls. The squid salad was delicious! Great portions, tender squid, great flavor, lots of spice. The portions in the chirashi blew me away. There wasn't a lot of variety. Four fish, one shrimp, some egg. There were three slices of each fish, but each slice was the size of 1 1/2 to 2 slices at other restaurants. It was like having 24 slices of raw fish instead of 12. All very fresh and tasty. I did think there was too much seasoning on the rice, but I was very pleased with both of my dishes. My partner really liked his sushi rolls. Six pieces per roll, but the rolls were bigger and cut thicker than other sushi restaurants. Again we were impressed with the portion sizes.  My one critique is the chairs. They are very worn and appear desperate to be replaced or repaired. The cushions just sink as you sit and provide little support.  The service, the food, and the portions all added up to a really great meal, despite the chairs. I can't wait to go back to Takumi and try more."}
{"text":"I was aware of this place for a long time, but never tried it until recently. It was really busy when we ate there and we had a different server showing up to our table when we ordered, the brought out food and refills, etc. Service was still fast and they were friendly. I had the Lake Side Roll which had king crab, caviar, avocado and shrimp. When they brought it out it had four big piles of roe on each piece, all ditfferent colors.  It was a nice looking dish. I liked almost all of them, expect the green one hit me right in the nose with a pungent wasabi flavor. I probably should have seen that one coming based off the color. My husband had the Dynamite Roll which is a deep fried roll with  spicy tuna, yellowtail, cream cheese, avocado and baked scallop with crab meat. He really enjoyed and I might be trying  that roll the next time I go. We also had a couple of pieces of ebi and tuna sushi, both were very decent."}
{"text":"Wonderful place. Went with two good friends I'd not seen in a long time & we had the best time whilst the staff were very attentive but not intrusive. We \"closed the place down\" staying & talking til closing time & we'd been there 2.5 hours! Staff very nicely ejected us (we didn't know it was closing time).  Quality & presentation of food was excellent. Only reason I'm not giving it 5 stars is because of value: An a la carte order of unagi sushi was about $2.75. I thought I'd get a couple pieces but it was just one piece. I thought I would get more."}
{"text":"Super fresh sushi!  My co-workers and I go at least once a month and the sushi is always fresh.  The lunch specials are a good value too."}
{"text":"I was very impressed by the sushi! I grew up with a Korean neighbor who's mom owned a Japanese sushi place back in Korea, therefor I grew up on old passed down recipes that are very well done!  I came in from out of town and went here because it was close to my hotel... And I would recommend it to anyone who will be in Madison!   I had Inari, which is not always at sushi places :(, an avocado roll to eat between things and a some sort of crunchy roll with salmon inside and crab on the top... I wish I looked back at the description because there was something in there that tasted so good!!"}
{"text":"I got takeout from here and it was kind of \"meh\" for me. I got the calamari which I wasn't all too impressed with, it tasted like it was out of the freezer isle. It wasn't bad but I wasn't a huge fan. The sushi looked amazing, so I was excited for that. I got the angel roll and it was pretty good. I don't know that it was worth the price, but I would be willing to go back there and try another roll."}
{"text":"I visited this restaurant this past weekend with high hopes of great sushi.  I have been here twice before and had great experiences...hence the 3rd visit.   We arrived just after 5 P.M and the place was already pretty full.  We were led through the restaurant and found menus on the table.  The waitress just dropped the menus at the table before we even reached it, leading to confusion around whether this was where we were to sit or not.  We had to ask her if this is where she wanted us and from her waitress station, she said yes.   We ordered 3 rolls, miso soup, and seaweed salad.  I had a glass of wine and my boyfriend had a Sapporo.  Our food came out timely and looked amazing...as usual.  We ate at a reasonable tempo and noticed the restaurant filling up rapidly.  There were people waiting but also people leaving so they weren't waiting long.  Our plates were cleared and we were enjoying the rest of our cocktails when the manager came up to our table quite abruptly.  He said hello, I will need you to move to the bar area or leave so that we can turn this table.  We were FLOORED!  Had he asked if we minded moving, I may not have been upset.  Instead, there was no kindness to his approach!  I realize there were people waiting but there were also people leaving.  We were clearly finishing up only to essentially  be asked to leave.  I really did enjoy this place.  Unfortunately, my continued patronage to this restaurant was not valued and I WON'T ever be  back.  I was truly disappointed with this experience and will make sure others are aware.   To top it off a fellow diner waiting said to us, \"thanks for hurrying\".  Guess that type of attitude while dining is contagious."}
{"text":"Best sushi restaurant in Madison. Make a reservation especially  on weekends. It's worth the wait though."}
{"text":"Takumi is hands down, the best place to get sushi in Madison! My girlfriend and I have eaten here at least 20 times, and are always satisfied with our experience. The sushi is always fresh, prepared exquisitely, and presented elegantly - I've noticed they don't have a cookie cutter operation either - sometimes I'll order the same plate, and it will be presented in an entirely different manner - I guess it depends on the chef, but what stays the same is the high quality each and every time. Also of note is that the prices at Takumi are a few bucks cheaper than most other Madison Sushi joints.   The waitstaff at Takumi are top-notch as well. They work together to make sure you are taken care of, and they're always friendly and welcoming.   Perhaps what I like most about Takumi is the relaxed atmosphere. Other sushi joints in Madison don't give a crap if you are comfortable, and just want to rush you in and out, get their money, and serve the next customer. - this makes the sushi experience far less enjoyable. At Takumi, it can be busy, but it's at least quiet enough that you can hear yourself think. The decor is simple and modest, and while you're eating the best quality sushi in Madison, the general feeling is unpretentious and welcoming.   Please dine at Takumi - you will not be disappointed!"}
{"text":"Overall, good sushi place. Tried the \"Hidden Dragon\" roll which was nice. Not the best I've ever had but pretty good."}
{"text":"I went here for our family xmas dinner and it was a blast! We went in for hibachi after a few drinks at the bar and some sushi. Would have been a perfect experience, but we had to wait 15 min for someone to come up front and talk to us, then another 20-30 min at the bar waiting for someone to come around and take our drink order. Rough start, but it ended well.   Positives:  - Great sushi! Well formed, fresh, and it came with plenty of ginger and wasabi  - Hilarious and fun hibachi chefs  - Very quiet and relaxing atmosphere outside of the hibachi area  - They've got a room you can reserve for bigger groups  - The hibachi chefs were generous with the saki  - The food was outstanding  Negatives:  - It took way to long to get noticed by the hostess and wait staff  On the plus side, since it was close to xmas a bunch of folks came in to do caroling while we were waiting, so it helped to kill some time.  Overall it's a great experience once things get rolling, I definitely recommend the hibachi, and I'm looking forward to going back."}
{"text":"Standard sushi place.  Perhaps a little above average for the middle of Wisconsin,  but a little below average in my book.  I'll be back though!"}
{"text":"To me there is two ways to judge sushi.  One based on funky creative rolls and are more \"fusion-y\" and two based on good classic rolls that are consitent.  If you want #1 you go to Restaurant or Sushi Muramoto, if you want #2 you go to Takumi.  They are always good, always quick and always afforable.  I love that they have take out and lunch specials.  Their lunch combo of two rolls and soup or a salad is a steal!  There is something about their california roll that makes me order it, even though I would NEVER order it anywhere else.  Their fish is always fresh.  Some sushi restaurants when they have a deal will just add more rice and less fish, Takumi is nothing like that.  I trust that no matter what or when I order it will meet the standard they have set time and time again."}
{"text":"Pleasantly surprised. Nice, relaxing ambience. I went during lunch, the prices were reasonable. Presentation of food was great, although a friend said the roll size was a bit smaller than other sushi restaurants. I will have to go again on Sunday, when there are specials."}
{"text":"Bravo. A friend recommended this place to me as the best sushi in Madison and I knew I had to give it a try. Takumi did not disappoint.  My companion ordered the greens salad and mushroom soup. I was initially surprised at the prices, as they seemed a little more than the same items at similar places like Ginza or Takara. However, when the items arrived I quickly realized the difference. The salad was more than double the size of other restaurant's and featured a wider variety of fresh vegetables. The mushroom soup was exquisite-cooked in a delicious broth and filled with large portions of scallions and a variety of hearty, fresh mushrooms.  I ordered two roles as part of their Sunday Happy Hour (1-4 PM with several deals): the Spicy Tuna roll and the Philadelphia. While both rolls I would consider typical, the way Takumi prepared them really stood out. The tuna consisted of some delicious fish, accompanied with a soft crunch, while the Philadelphia roll featured cream cheese, cumber, avocado and scallions.  The cheese and crunch both added a real nice texture balance to the fish and rice, providing a taste which I know will stick in my head for a while.  The service was attentive and the decor of the restaurant was simple yet elegant and comfortable. I am definitely going back as I am eager to try the Habachi."}
{"text":"Best Sushi joint in Madison, scratch that, all of WI. I love it here and am perfectly happy having to drive an hour and a half just to eat here. The food is always fresh and tasty, never have I had a bad roll! Even tho it can be quite busy, the staff has always been extremely friendly and never will make you feel rushed. Takumi is a pretty small restaurant and fills up very quickly, so its probably best to get a reservation -especially on the weekends- AND be on time for said reservation cause everyone should experience this tasty, wonderful place and never have to wait to terribly long for a seat."}
{"text":"Above average Japanese restaurant.  Inventive chef uses fresh sea food  to create some memorable sushi rolls.  Ok setting off the East side mall Strip. A bit drab interiors but the food makes up for it. My wife and I been there for dinner and lunch the next day on our Madison visit recommended: spider roll, sashimi on rice, giant clam.  Beware, hot saki, too hot. I guess they didn't watch James Bond."}
{"text":"A tasty treat of a little restaurant in a nondescript strip mall, but on walking in it was packed with other people enjoying some really good sushi. The seaweed salad was generous and a perfect starter, followed by some hot miso soup, and a roll that I can't remember the name of, with chili sauce and fresh jalapeños on it--it was awesome. Their presentation is excellent and the service was very attentive. Will return for sure."}
{"text":"I was in Madison for a week on business and had dined at a few locations. On my way to the airport I was looking for somewhere to eat and happened upon Takumi. Upon entering I was greeted promptly and decided to sit at the sushi bar. As I looked over the menu I was pleasantly suprised to find Toro (fatty tuna)! This always makes me happy. I ordered some along with the Black Jet roll and the Angel Hair roll. All of it was quite tasty. They also offer a good variety of saki.  The service was excellent. Everyone who works there was attentive to my needs. The prices were reasonable. I left happy and satisfied. Next time I am in Madison I will definitely be coming back!"}
{"text":"The fish pieces used for sushi and sashimi were all pre cut, so the edges are incredibly dry and lost the fresh taste."}
{"text":"Well I gotta say this was a pretty great find! Some of the rolls were the best I've had ! Godzilla and kiss of fire were stellar. For the low carb people - naruto roll ! So good and the lobster tangle roll was my favorite. The sashimi toro was okay. The mushroom soup was huge and rocked. The yellowtail appetizer was my favorite !! This place was overall great. We had to ask for some things twice and he couldn't understand a lot of the things we asked for, but it didn't take from our experience."}
{"text":"The waitress in this restaurant apparently don't know how to smile! She just wear a long face. The sushi is is expensive and unauthentic.They have artificial crab meat in the dragon roll instead of shrimp tempura! And the pock tonkatuso is the worst one I've ever had. Really thin and tasteless! Not the same with the pictures showed on yelp. The teppanyaki is ok but the sauce is bad. We spend $100 for two person but feel very disappointed. I guess they have customers since this is the only restaurant in Madison offers teppanyaki and other japanese food. I would recommend Muramoto and VIP if you want to have sushi. Don't go to Takumi! I would never go to this place any more!!!!"}
{"text":"This place is fantastic! I have never dined in, but it looks very nice and cozy inside. The staff is always extremely friendly when picking up take out. Everytime I come here, the food is incredible. My latest roll was the Kiss of Fire. I highly recommend it. It has become my favorite roll! They also have great standard rolls e.g. spicy tuan, etc. I've never had a bad piece here."}
{"text":"Went twice for lunch 2 weeks in a row. This little east side strip mall sushi Zen gets very busy at lunch. First time we were lucky to get a table and both of us ordered the sashimi sushi combo which included choice of soup or garden salad with ginger dressing. We both got the heavenly soup with healthy amounts of tofu and dark leafy greens. Takumi is unlike any other sushi joint. They give you big buttery portions of sashimi. Huge. So next lunch I ordered a few rolls and added on 2pc sashimi knowing they are huge."}
{"text":"I order pretty simple maki rolls, but Takumi is one of my favorites in Madison, and definitely the BEST east of the Square. A lot of places seem to make rolls with a bunch of rice and a tiny piece of meat in the middle. Takumi gives you a nice hunk of meat with a bit of rice around it - definitely an awesome value and the reason I keep coming back. Always tastes really fresh. I've never actually dined in, always do \"to go,\" but staff is always incredibly kind. They have a steep minimum for cards ($15 I think?), but it's not super hard to meet if you're eating sushi. I did try the spicy scallop once and was very underwhelmed, it seemed to be ground up meat mixed with the spicy mayo stuff. I'll stick to my tuna and salmon rolls, and will be completely content with it. For to go orders, I also appreciate that they give you soy sauce in a container that allows you to dip sushi into - no annoying paper packets that you have to try and drizzle over the rolls. Might seem small, but it makes a difference."}
{"text":"I am used to Sushi in Milwaukee, so I had high expectations for Madison. Don't be fooled by the exterior, this place is amazing. The atmosphere is cozy and semi-fancy and everyone is very accommodating and friendly. We had ordered Spicy Tuna and Salmon roles- whig I assumed they were gluten free, but when they arrived to the table I noticed they had tempura flakes in them. I asked the waiter if I could have another order without the tempura flakes because of my allergy and he was very happy to. Not only this, but he gave it to us for free! The waiter was very fun to talk to as well. If I am in Madison again, I will definitely go here first!"}
{"text":"My favorite Japanese Restaurant.  In our family it has become tradition to go out for a nice dinner and let the birthday boy/girl decide what kind of cuisine to go for. For our son's 20th birthday, he opted for Japanese cuisine and after some research, we found Takumi in Madison. It came highly recommended by many, so we figured we would give it a shot. When we walked in, the light aroma of teriyaki and miso was very welcoming. The dining room was small, but very tasteful.Over on the right, there was a nice size sushi bar where all their sushi is prepared to order. Two separate rooms for Teppanyaki groups complete their dining setup. We started with Shu Mai, sushi and sashimi and got a mouthful of flavor. Their Shu Mai was absolutely perfect. Perfect seasoning, perfect temperature, perfect flavor, perfect doneness. The sushi tasted fresh and crisp. The sashimi was fresh, clean and flavorful. Their chef salad is simple, but delicious. I have been in many Japanese restaurants and often find the typical ginger salad dressing either to vinegary or too gingery. This one, however, was very nicely balanced. We moved on to our main dish. One of us had a chicken and vegetable tempura bento box, one of us had steak and lobster hibachi and one of us had chicken yaki udon. The only two minor flaws I can think of was that our dishes came to the table in shifts. The hibachi and bento box were only 2 minutes apart, but the chicken yaki udon did not arrive until 5 minutes later. Secondly, every dish, all the starters and all the main dishes all had one lettuce leaf and one maraschino cherry. It would have been nice to see some creativity with the garnish, but the quality of the food was so good, we quickly forgot about the garnish. The tempura was light and crisp, the lobster was plump and full of flavor and he steak, well let's just say I've had worse steak at restaurants that call themselves a steakhouse.  Out of the many Japanese restaurants I have eaten at, I have to admit, this one is the best one yet. It will be hard to top the quality of the food we had here.  Count on an average of $20 to $30 per person for a complete meal (starters, main and drinks). Well worth every penny."}
{"text":"Takumi is by far one of the best Japanese restaurants in the Madison area. My family and I have been going there for 4+ years and no matter the time of day or day of week their food is always fresh and tastes delicious. Our favorites are the spicy tuna roll, california roll, and veggie tempura roll. While we normally stick to sushi rolls I've had their hibachi as well and enjoyed the same deliciousness. The chefs are talented and the wait staff is very nice and accommodating (bonus for loving babies and young kids!).  I've always had an excellent experience."}
{"text":"I've been to this restaurant a couple times since moving to Madison from New Jersey. It reminds me of the place I used to go to- small, no frills, hospitable servers.  The sushi is pretty darn good. I was even allowed to customize a roll to my liking which I appreciate. My only complaint is that the menu doesn't say how many pieces of sushi you get in an order. I ordered an Alligator roll that I requested with cream cheese, no caviar and spicy mayo & eel sauce (you should try it if that's your thing) but I was disappointed to receive 5 pieces of sushi that I was able to scarf down with no problem. I probably would have ordered something else or more than one roll if I knew what I was getting beforehand."}
{"text":"Excellent sushi...I have been to every sushi place in Madison, and this remains my favorite.  Specialty rolls are delicious with very reasonable prices!  update:7/2012 I would now rank this palce 3rd in madison, behind muramoto and red sushi."}
{"text":"Excellent sushi and sashimi!  The sashimi platters are wonderful and the presentation is divine.  The specials always offer a nice unique twist so I highly recommend trying them when you visit.  The service is sometimes a little slow big the staff is friendly and welcoming so you don't mind the wait, just something to keep in mind if you're in a hurry.  We keep coming back to this place because it really is a great find for sushi at an affordable cost."}
{"text":"This place rocks!  Spicy Lovers Roll and Kiss of Fire roll are my favorites.  Tried the mushroom soup and really enjoyed it.  The service is always top notch here and the Sushi chefs are the best. This place is small but it is inviting.  They have a good variety on their menu and it accommodates most of my friends palates."}
{"text":"Another great recommendation by a colleague for a lunch meeting. There was space available, no wait. I was greeted warmly and seated promptly. Takumi offers a variety of lunch specials for around $10. I ordered the two roll combo. Takumi's menu includes many sushi offerings. Some familiar, some different then previous Japanese menus I have seen. I had the spicy salmon roll, it wasn't \"fishy\" tasting at all, which, although it is fish, is a good thing in my book. I also had a basic cucumber/avacado roll. The lunch special comes with a choice of soup or salad. I enjoyed my food immensely. I will be back, and would recommend Takumi to those looking for a good sushi restaurant."}
{"text":"Coming from Chicago, I'm used to big, perfectly sculpted sushi rolls! I recently moved to Madison and I was looking for a good place to take my boyfriend who's never had sushi. The restaurant itself looks really cool, but the sushi is sub par. We ordered a dragon roll and a naruto roll. Both rolls were smaller than I'm used to, only 4-6 pieces. I'm used to rolls being 8-10! The pieces were unraveling and falling apart, so it was difficult to dip in soy sauce and wasabi. That's not even the worst of it. Later that night and the next day both my boyfriend and I were feeling sick. We won't be coming back."}
{"text":"Sushi and hot food are good some days and mediocre on others.  They seem to have become less consistent lately."}
{"text":"I had chicken hibachi and it was so good! A lot of flavor! I did have some sushi and for someone who didn't even like such I thought it was good! Will definitely go back"}
{"text":"I had high hopes after reading the reviews, but was severely disappointed both worth the service and the food.  I attempted to call in my order and called them four times... all calls went without any answer. When i finally drove to the restyaruant to order. It took several minutes for someone to ask to seat me. I ordered 2 specially rolls that weer mediocre at best (and that's me being nice.... REALLY nice). We also ordered the teriyaki chicken entree,which was the worst teriyaki chicken I have had in my life. I am very disappointed in all aspects of this sushi joint. I highly recommend driving to the west side and eating at the place in Hilldale.  They, on the other hand,  are worth the drive and the money.  I feel like I wasted 50 bucks . Ugh."}
{"text":"FINALLY! Passable sushi in Madison.  Do not be put off by the 3 star rating--I can assure anyone reading this that Takumi's sushi is the best in Madison, and getting 3 stars here is an accomplishment. That statement may lead you to believe that I'm a bit of a prick when it comes to judging food...and you'd be right. However, I am most critical of sushi, by far.  Rundown:  I went to Takumi for lunch with a couple of friends. I got the sashimi and sushi combo--4 pieces of each, soup/salad, and a spicy tuna roll. The salad was excellent, but aren't they all? That ginger dressing is addicting.  Sashimi: It came with 4 pieces--yellowtail, basic tuna, salmon, and what I believe was mackerel (unsure). I like leaving it up to the chef to choose--they know what's fresh. Tuna and mackerel were so-so. Mackerel...maybe not so fresh. Yellowtail was fresh and quite good. Salmon was very good and the best of the bunch--you can usually tell by looking at the fish what quality it is, and this was excellent.  Sushi: Tuna, yellowtail, salmon, shrimp. Shrimp is the only difference here, and it was good...but most shrimp is good. No surprises.  Spicy tuna roll: Quite good...even though it was a roll! They threw in some tempura pieces/toasted panko, and it gave the roll a nice crunch. I approved and ate it all. Delicious.  So, there you have it--this place is the best in Madison...by far. Takara, Red Sushi (awful), Muramoto--Takumi trumps all of them. Would I go back? Yes, definitely. Especially at $14.75 for that massive fish combo. Sushi coma."}
{"text":"Without a doubt, the best sushi in Madison.   Their dragon and rainbow rolls are enormous and quite tasty. Rolls never fall apart, have well-balanced proportions of protein and rice, and are aesthetically very well put together.   Bento box lunch specials are affordable and generously portioned. Service is nice, friendly, and attentive.   I've had many awful sushi meals downtown--so it's great to have a place as solid as Takumi by East Town that pays attention to consistency and freshness of the fish."}
{"text":"Was visiting Madison for the weekend and staying out by East Towne mall. Just looking for somewhere good in the area and saw the positive reviews on Yelp so decided to stop in for dinner.  As an alumn of the UW and familiar with most of the sushi options around campus, this trumps them all. Our sushi was generously portioned, reasonably priced and very fresh. Service was also very friendly and fast.  We shared a few different rolls, but really enjoyed the Spicy Tuna roll (one of the best I've had) and the Sweet Heart roll. Prices were very reasonable ($5-$6 for traditional rolls, $10-$13 for specialty rolls) and as noted above the rolls were generously portioned and the fish was extremely fresh.  I can't see myself visiting Madison again without stopping here for lunch or dinner along the way."}
{"text":"Had dinner here around 8:30 pm on a Tuesday night; only a few tables occupied and a couple of lone diners. So, initially, we weren't sure if it was just a slow night or if this is normal for them? We did notice that the servers knew many of the customers so it's safe to say they have frequent diners who enjoy the place.  We were having an off night so we weren't spending too much time on the menu. I mean, we ordered chicken tempura, pork katsu, and the spicy lovers roll. Not really exciting dinner choices BUT the taste made up for it.  My boyfriend may have felt the tempura batter on his dish was a little much, but it was his first time having tempura at all and I think he still enjoyed it. The pork katsu was a bigger portion than expected, so I was able to bring the other half of it to work the next day and I enjoyed the \"overnight mushiness\" of it. The spicy lovers roll was indeed spicy, at least it was for me, but it had a good balance of sushi and sauce. It's definitely a roll we'll order again in the future as a \"usual.\"   Next time we come, we'll explore more of their signature rolls. Lots of interesting and tasty choices available!"}
{"text":"The teriyaki was good. Cooked right but a little too much onion served with it.   I being from a costal state. I usual don't get sushi when I travel in the mid-west. But from the other reviews I figured I would live a little. Sushi wasn't bad, portions were good and some of the rolls cut a little too big for one mouthful.   Ask about the sushi specials when you go. If sitting at the sushi bar, ask if the chef has a special roll they like to make.   Hibachi fill needs a reservation, as it appears it's only open certain times."}
{"text":"Fresh ingredient for sashimi and sushi. Overall is ok but not quite authentic. Still not bad for Japanese food but not the best.  A bit pricey, $55 for two."}
{"text":"Everything was fine, there were no issues, food was fine - but nothing was \"special\" either."}
{"text":"Love this place. Been here 10+ times, with solid lunch specials, good prices, quick service, and ability to park and be seated. Solid rolls, very much like the menu at Takara."}
{"text":"Not sure what others have had here,  I generally trust such high ratings when there are a large number of reviewers.  Now I may be the odd man out here, but my experience was less then stellar.  To start I had a fly annoying me my entire meal, and that fly was not an employee.  During my meal it kept landing on my fish which may have caused some of my uneasiness.  I ordered the sushi platter for 1.  That should be renamed sushi for someone who is going to go out and eat again in 10 minutes as it left me completely unsatisfied.  Further,  the choices in the platter outside of one slice of tuna, and salmon, would be listed as items most likely not ordered.  Example,  deep fried Prawn Head with no body attached.  I assume I was supposed to eat that...no thanks.  As well the raw shrimp, who eats raw shrimp..in Wisconsin?  Seriously!  Think twice on that one.    Anyway,  YMTM - your move to make.  But I would rate this as just above fast food strip mall sushi, maybe.  This is not 4 star restaurant quality sushi.  At all."}
{"text":"Fabulous! Super fresh food and really fast and attentive service. I've sampled miso soup all over the US and this was definitely a contender for best soup. The decor is really cool: they even have a traditional seating area with cushions on the ground! I had sushi while my mom had a bento box. Both were great. I would definitely go back!"}
{"text":"Came here for lunch with my bf. We had the lunch special, one bento box with pork and the sashimi/sushi platter. It was definitely more than enough food for the two of us! I like how generous they were with the portions. However, the sushi could have been better. The sushi rice was too cold, I wonder how much effort would it requests to keep the sushi rice at room temperature. I always hate it when the sushi rice is cold, and after watching \"Jiro Dreams of Sushi\", I realised I was right about this."}
{"text":"Top rated so I tried it. I suspected by the \"Chive on\" shirts and the close proximity of the Dells that Madison doesn't have the highest standards but boy oh boy. Chirashi had frozen fish (which they kindly tried to fix, but just brought more frozen fish with ice on it). CA roles were ok. Dynamite role: pass.   Won't be back for sushi anyway. 3 was a gift rating IMHO."}
{"text":"Nothing great about this place. Terrible rice, which makes or breaks sushi. Unfortunately the fish had a fishy taste and smell. Service was great."}
{"text":"What a diamond in the middle of the rough.  I had the shumai first and it was tasty but definitely needed extra sauce for the dipping.  It was well cooked.  Next I had the alligator roll and for the price I must say it was rather small but my doubt was set aside at first bite.  Possibly the best roll I've ever had.  Still warm and crunchy and fresh and awesome and the sauce woohoo.  I have been to very nice very expensive sushi spots on the water and this roll will last in my memory.  I washed it down with an Asahi."}
{"text":"Favorite sushi place in Madison. They make the best spicey seafood soup and naruto roll.  Service is good and staff always thanks you for coming on your way out.  The only negatives is that it's a small restaurant and can feel crouded, in addition to having to wait a few minutes to be seated during busy times."}
{"text":"Great Sushi, affordable lunch selection. They however dont deliver as it says on their takeout menu."}
{"text":"I absolutely ADORE Takumi.  I go there whenever I have the hankering for sushi. Their prices are very reasonable, and their chefs are fantastic. I especially love sitting at the bar to order from the little pointing menu.  Anything with eel is probably my favorite, but I've never had a loser here.  I've tried many things--sashimi combos are the way to go (get the one with the eel roll!).  Is this the best sushi I've ever had?  Nah. But for the price?  Hell yeah, it's awesome!  I'm obviously not the only one who thinks so either--this place is always full.  You often have to park kinda far away and definitely watch your elbows through the meal because the place is packed.  Always a good sign, no?  PS--It's a few doors down from Penzey's and Half Price Books--two of my favorite places. Don't forget to stop there, either!  ;)"}
{"text":"Takumi is on my top 3 Sushi spots, too bad I live 150+ miles away.   We walked in with no reservation and the restaurant was packed, luckily there was a couple leaving and we were seated right away. After reading a few reviews, I realized it's best to reserve before going.   Menus were passed out, and orders were taken within 10 minutes.   Rolls ordered were - Naruto Roll  - White Dragon Roll - Crunch 2 in 1 Roll   All our items were ordered off the \"Takumi Signature Rolls Menu\" and lets just say, all these rolls were beyond amazing.   The Salmon on each roll was fresh, so fresh the salmon melted as soon as you put it in your mouth. Naruto Roll was very interesting, instead of seaweed and rice rolled around the avocado, salmon, and salmon roe there was cucumber. The Crunch 2 in 1 roll is a personal favorite and I have a tendency to try any crunchy roll order at any sushi spot I go to; Takumi did not disappoint with this roll. The White Dragon roll was a simple white tuna and salmon roll topped with a unique special sauce that had a sweet then salty taste; delicious.   I will be back to try Takumi's other signature rolls and their desserts the next time I'm in Madison.    Overall   Service was great Very fresh salmon Great selection of rolls  Many signature rolls"}
{"text":"My experience as Takumi was fairly average for a sushi place in the Midwest.  First, I would like to clarify that we did carry out this time, but I happened to be in the restaurant long enough due to a long wait...  The website claims to have online ordering, but when you actually click it, you are prompted to call in. Why would you even have that button?   When I entered the restaurant to pick up my order I thought for a moment that I may have walked in through the back door. There was no host or hostess present. I was standing around for at least five minutes to the point that other groups walked in and were standing around with me. Eventually the hostess showed up, and I told her my order was carry out. She didn't really reply and ended up seating the other groups. I took a seat at the bar, which was fairly messy. The bottles behind the bar were scattered about and there were old meals on the bar that hadn't been picked up.  My order came out about another 5 minutes later, and I headed home.  The meal was well packed. We ordered one spicy salmon roll, one spicy tuna roll, one eel with cucumber roll, one tuna with avocado roll, and a side of miso. The order came packaged with two sets of chopsticks, two packets of soy sauce, and an appropriate amount of ginger and wasabi.  The rolls were pretty average, but they were good enough for carry out this evening. I enjoyed the tuna and avocado roll/eel and cucumber roll. The spicy rolls were not quite the way I like them. The fish was ground up and mixed with the house's spicy sauce. I think spicy rolls are better executed with high quality whole pieces of fish. When the fish is ground, it is somewhat questionable. Also for some reason tiny pieces of crunchy material was mixed into the ground fish. I'm not quite sure why.  The sushi was okay and the service was fairly slow. The sushi house doesn't begin to compare to my favorite Midwest place nor anywhere in the Bay Area. I would probably do carry out here again because it is fairly close to my place. If I wanted to dine in I think Red Sushi on the square is a much better option."}
{"text":"I am a big fan of Japanese food, and I have to say the food and service at Takumi is the worst ever! The sushi and fish is not fresh: if this were my first time to have Japanese food, I would not want to have Japanese food any more. The waitress is so rude and not friendly. The price is ridiculous for such bad food and services. I very much regret spending $100 at Takumi. :("}
{"text":"For the only Hibachi restaurant in the area, it lives up to my expectations! I made a reservation for Hibachi on a Friday evening to enjoy with some of my family. The restaurant nicely accommodated us, which was greatly appreciated.   I started off with a glass of Chardonnay, that was just ok. It wasn't a great choice for the only glass of Chardonnay offered on their menu, but it was drinkable.   Along with the miso Soup and delicious salad, I ordered the Salmon and Shrimp combo. I'm surprised it wasn't already an option on the menu, as this was an off the menu choice for me. The shrimp and salmon were good. I've definitely had better salmon, but it was still good, just a bit overcooked. The only real problem I had with the chef was the amount of soy sauce he put on the food. The food was literally drenched in their thick soy sauce. Had it not been for so much sauce, I probably wouldn't have left with a stomach ache.  The Hibachi (Fried Rice) was excellent! I highly recommend ordering the fried rice instead of steamed when doing Hibachi. It was so fabulous that I almost ordered a second portion of fried rice.   Overall, the dining experience was nice; however, if I ever would return, I'd definitely ask for the chef to go light on the sauce for me."}
{"text":"The best restaurant in town like always fresh sushi and all the food is amazing no regret come to Takumi restaurant great service and great customer who always come to that place big tump up for them"}
{"text":"I have always enjoyed Takumi whether it was for a sit down meal or pick up.  In terms of the quality and presentation of the food, everything is excellent. They are always pretty quick to make things too even if it is busy.  The service is always very good as well. The wait staff is very helpful and attentive if you may need something.   If you live on the East side and don't have time to go downtown (Love Red Sushi too), come to Takumi!"}
{"text":"This place is not good for sushi. I'm sorry. It's just not. The fish is not fresh (slimy in fact) and the prices are no better than anyone else. People who like this place have not had good sushi. My tip: go some where else: Sushi Red,  Wasabi, sushi morimoto. All of these are better."}
{"text":"We went to this place because of its high rating on Yelp, and it deserves it.  We had too many items to list and they were all good. The fatty tuna sushi (toro) is to die for. The rice is cooked and prepared perfectly. It's a very pleasant surprise to find such a high quality sushi place in a small city like Madison.  Only two minor issues:  1) Soft drinks are from cans, so no free refills. 2) The cooked and fried rolls are not great, but I knew they wouldn't be (cooked rolls never are). I ordered them because the people I was with are what I call \"white boy sushi\" eaters and are not entirely down with raw fish yet. They were more comfortable after this experience.  Highly recommend."}
{"text":"My local sushi experience in Madison has been confined to the less than stellar ones you typically get in buffets. So to change that we decided to venture out for a Sushi only dinner and landed here.  Ambiance: The color palette, furniture choices make the place feel a little cramped, but not claustrophobic.   Service : I can't comment on anything else but Sushi and a good Sushi does take time. It took longer for us (Over 30 mins) as we were given our entire order altogether. The \"View\" made the wait fun though as we watched in awe the sushi masters clinically prepare rolls in front of us!  Food : Our good fortune that we got a set of chairs at the sushi table. We ordered a portion each of Sunrise Roll, Dragon Roll and Dynamite Roll. All three rolls were absolutely Delicious and some of the best \"Ala Carte\" sushi we've had in a while. The seafood was fresh and high quality, the rice moist and cooked to perfection. Everything was prepared with surgical precision and flavors were spot on!   Value : At about $15 a roll for the ones we had, not cheap but then the sushi was worth every bit! Will return for sure."}
{"text":"This review is long overdue.  We have been visiting Takumi since we moved to Wisconsin 9 years ago.  They have seen my son grow up to teenage years. The quality of food and friendly service deserves more than 5 stars.  It can be very busy at times but we always have a great dinning experience. Our favorite spot is at the sushi bar.  We have had family visiting to celebrate our son's birthday for several years so we like to treat them to the hibachi room. It's a fun experience!"}
{"text":"Stayed in the Midwest for a weekend and decided to grab lunch here on a Sunday. It was a standard place that was nothing special but for value and convenience as well as freshness, I give it 5 stars!  We ordered two lunch specials, one being a hibachi steak and the other being a shrimp terriyaki bento box. It was a fantastic value. The miso soup and salad starter were standard and good. The hibachi steak was pretty good. The sauce is not like usual hibachi sauce, but I appreciated the lightness of flavor as it coated the vegetables and steak. I was also impressed with the bento box. We received terriyaki shrimp, some fried shrimp shumai as well as a salmon avocado roll. The fried shrimp shumai was surprisingly light and delicious and the shrimp were a very decent size. I was impressed by the freshness of the salmon and overall, felt that it was a very filling lunch and did not even come close to breaking the bank!  Overall, the hibachi and terriyaki did not blow me out the water, but the freshness of the sushi roll as well as the service, atmosphere, and great service really impressed me. Not a bad place to go to at all!"}
{"text":"Fantastic sushi...spicy lover roll is excellent"}
{"text":"It is with a heavy heart that I write this negative review. Takumi used to be one of the favorite spots in Madison for my girlfriend and I to get sushi, but that changed tonight. we had a couple grievances tonight when we decided to dine there for dinner, a few of them were small issues. One of them was a major problem. I had ordered a piece of smoked salmon for a sushi appetizer and received mackerel. Not a big deal at all. They replaced the sushi with the correct one and let me eat the mackerel as well, which was very tastey. When we received a complimentary dessert, they gave us only one spoon. Also, this is a very small issue almost not worth mentioning. These two problems only serve to highlight the major red flag that occured in the middle of our stay. The thing that has made me reconsider ever returning to Takumi was this: as we sat at the sushi bar waiting for our meal, a small cockroach wandered past. Right in front of me, AT THE SUSHI BAR. I was in shock. I watched this dime - sized roach stroll past my dinner plate and into the fixture of the bar itself via a gap in the wood, right where all the fresh seafood is kept and handled. My girlfriend and I were in shock.  Immediately after calling the host over to quietly complain and demand a new seat, our rolls arrived. Our hunger and disbelief got the better of us, and we stayed for our meal. However, once hunger was sated and clarity of mind returned,  I started to feel angry and disgusted. The host offered us a fifty percent discount (after our server initially and \"accidentally\" handed us the full bill), the aforementioned comped dessert, and a promise that they were already scheduling an appointment with their pest control. I feel that because I was originally handed a full bill, something that made me quite angry, that I accepted the discount a little too easily, having been placated from the anger that I was just about to unleash. He also confided that he and other members of the staff have been trying to get the owner to remodel the sushi bar. What he left unsaid was that they are pushing for a remodel because this problem has happened before. Their general attitude towards us also hinted to the fact that it was not a surprising complaint. I was at first conflicted about exposing this information to social media,  because we stayed and ate, we accepted their discount and apology, and it was once a favorite location.  After thinking about it a little longer, I am still offended. We were both surprised we even stayed. I think because it was so incredibly ridiculous that something like that could happen at a supposedly upscale sushi restaurant, one that we have frequented many times, that we didn't react correctly."}
{"text":"Shot in the dark but it paid off, start off with Japanese pickles and takuma spinach. Done. Could of ate that alone and been happy, but finished off with a salmon cucumber sushi roll and soba beef noodles. Yes I may have over did it... But so worth the trip."}
{"text":"Although normally good food, the service has been less than par that past several times. Recently we had reservations for 7pm in the Hibachi room for 20 people. The waitress took drink orders, but when the drinks arrived, my order and other guest did not get our order. I had to ask twice, and was told by the waitress that she busy and only had two hands, pointing to the soup she was carrying. At 7:15 almost all of the guests had arrived but we were missing a few, so we got started with ordering rolls. We were then told we had to get our main orders in and to be done by 8:30 as the room was reserved for another party. So we did. We end up at Takumi until 9pm, no other party arrived. We choose 7pm since in the past that was the last reservation of the evening for the room, so we knew there wasn't going to be another party after us. Why lie to us? With our orders, my husband and I wanted steamed rice instead of fried rice. When the rice didn't arrive for us and the rest of the group started eating their fried rice I asked the hibachi chef and then the waitress for our steamed rice, ok, ok was the answer but they ever brought it. The rest of my food was getting cold so we ate our \"meat and veggies\" without. When the waitress came around to take dessert orders, I asked again about the rice. She asked it we still wanted it. Really? After all the meat and veggies were gone. Then to top it all off, when one of the latecomers ordered his food it came straight from the kitchen, no time for the hibachi chef to cook it live, which was fine, but he ended up with food poisoning. Next time we want hibachi, we will definitely look elsewhere."}
{"text":"I used to LOVE this place, but lately it has really gone down hill. We went for lunch this past weekend and ordered toro which was $9.00 a piece. At that price you expecta nice piece of fish. The two pieces arrived scored like a piece of octopus, which immediately worried us as that is usually a practice they use when a fish is tough in order to make it easier to chew. My boyfriend made a horrible face after he put it in his pouth and pulled a small bone out of it. My piece was so inedible that I had to spit it out. The last few visits were ok, but not great. This just totally put me off to the restaurant all together."}
{"text":"really loved this place. We came here on the weekend for their lunch specials and the bento box and hibachi were both very reasonably priced. We had a salmon avocado roll that was full of salmon and avocado, something that usually doesn't happen which was very refreshing. the fish was fresh and the portions were great. Definitely worth it to come here."}
{"text":"What a find! We've eaten Japanese food all over the world and takumi is exceptional. The toro and yellowtail nigiri was perfect, nice rolls and a good selection of saki. The star of the place is Amanda- super attitude, very capable and knowledgeable. Don't miss this restaurant!"}
{"text":"Decent sushi but not amazing. Rolls are average and fish is fresh for the most part. The sweetheart roll was my favorite item since I love anything with spicy scallop and tempura flakes."}
{"text":"HIBACHI Review:  First, we couldn't be seated at the Grill because neither one of us made reservations. My response: It's Madison. I didn't expect, nor think I needed them but I learned that day.   Dined at the sushi bar as the gentleman requested.  Ordered the steak and salmon hibachi.  Well, \"I have experienced better.\"  Although the online menu offers steak and scallop which is what I wanted - it's not allowed in the restaurant. Ok  : /. This is how I ended up with salmon.  Salad & Soup brought at the same time.  The Dark broth Miso wasn't the best. Actually, it wasn't good because I didn't eat it all and I love miso.  Salad: Usual. Lettuce, Tomato slice, ginger sauce.  Requested Noodles for my Dinner and there's a $2.95 upgrade. I received rice.  No worries, let the server know and it went away. My plate arrived before my dining party member and he ordered Chicken Teriyaki.   His plate: Sizzled. Look appealing. But he's from Seattle and says he hasn't found good Teriyaki just yet. But said it was okay. It came with a choice of soup or salad and white rice. Said the soup was ok but asked, \"How can you go wrong with miso?\" I smiled. No need to give my thoughts (that's the southern lady in me that won't let my real opinion out. Believe it or not, I don't say everything that comes to mind.)  He eats.  I pick at everything because it's buried under some brown sticky sauce (akin to a gelatin). Had I known this I would have said please put it on the side.  But I don't so I pick.  I eat the veggies I like (musrooms/broccolli/onions). There are way too many zuchinni pieces which made me think, \"They must have too many zuchinni's in the kitchen?\" Either way... STILL NO NOODLES.   He's talking. I'm talking. I'm sharing. Here take the steak pieces and here's half of my shrimp app. The typical Hibachi sauce arrives. I then take it on myself to ask for some of his rice because it doesn't look like I'll get those noodles.  As soon as I get a scoop (the rice) the noodles are coming. Sheeesh.   These are not the noodles I expected but they're noodles and I had a hankering for noodles. They were over cooked and had a bit of water left of them as if they hadn't been drained. The rice started to look and taste better.   I boxed more than half my meal after scraping off the sauce. This was  let down to me because (1) I really wanted Hibachi, (2) I trusted the very few reviews that mentioned the Hibachi, (3) I wanted some noodles, (4) I had to be fake and engage my company even though I didn't agree. So I guess this would be better at the Hibachi Grill with a show and neighboring party but don't order it away from the grill. It's just not worth any amount of money. Sadly, I can't recommend & I really wanted to like this place so we'll try again and get sushi or make reservations for the grill."}
{"text":"I really enjoyed this restaurant. Sushi was amazing and it's not over priced. Had the Love Boat and it was a perfect option for two. Had a good mix and variety so that we could try many different items. Also had an appetizer just to try a couple other items off the menu.  I will be going back again. I just wish it was not on the other side of town for me. But worth the drive."}
{"text":"They got a jumpstart for being the first sushi I've had in six months AND having toro on hand.  But this is a tentative 4star, only because that may have skewed the experience.   I've been here a couple of times and mostly had the sushi. It's been fresh ad decent quality each time, so no complaints at all there. The only thing I'd mention as a drawback is the market pricing. You know the line \"if you have to ask, you can't afford it?\". Well, the market price for Toro is $9 per. I'm the only one who orders three pieces blindly, but it's sad when you spend more on Toro than the rest of lunch combined.   That said, the lunch specials were awesome. Both the bento box and the shrimp tempura with udon were great and relatively inexpensive. They have a decent selection of sake and beer, and while they aren't Muramoto, they are a very affordable, quality alternative.   Definitely worth the stop if you're near the east side."}
{"text":"We both had hibachi ( salmon and steak, chicken and steak ) and both were not good. The steak was bland and the salmon was slimy. It felt and tasted more like stewed meat. We didn't sit at the hibachi grill. Maybe that was the problem."}
{"text":"The sushi here is very good. We usually go to one closer to home as this one needs us to drive for over 20 min.  I would give 4 stars for the food.  Service however.....what is the problem to give hot tea? Why it cannot be real hit? We didn't order look warm tea - we order \"hot\" but they cannot deliver. Also - we had to ask for refill more than once...more than twice.  And for the end - they running out of dessert...."}
{"text":"No idea what happened when my daughter and I decided to finally try Takumi's sushi.  We typically go downtown.  We went in ( 2:30 in the afternoon on a Saturday) there were only of tables taken.   The gentlemen greeted us and said it'd be 1/2 hour wait???  Ok, I get it if there was a shift change or something but SOME sort of explanation would have been worth returning but ....nothing.   We left and will not return (which is a bummer bc we love sushi)"}
{"text":"Don't let the strip mall foul you! This place is delicious.   We got the chef's choice for two. Plenty of food with highlights like fried shrimp heads, uni, and scallop. Very good deal. Service was also prompt and friendly.   After almost 6 years in Madison, this place has finally knocked Muramoto down from my favorite sushi place. Prices are comparable but with higher quality and variety in chef's choice options.   And the sushi comes in a boat. Just saying."}
{"text":"Three of us went last Saturday night for their hibachi. Despite being busy, we waited 15 minutes, and then were seated with another group of two. After waiting 10 more minutes because another reservation was late in arriving, we were told that the reservation for 3 had finally arrived but with 8 people. The hostess/waitress matter of factly said the five of us already seated needed to give up our seats so they could seat the whole new group of 8. We were so offended that we immediately left and went to a nearby Chinese restaurant. Despite enjoying Takumi's food in the past, after this embarrassing experience, I can't imagine ever returning."}
{"text":"Stopped in for lunch with my husband and we were quite pleased. It's hard to know what to expect from a restaurant in a strip near the mall, but this place delivered tasty sushi quickly and at a good price for the quality.  It's clearly a busy lunch spot, but we were seated right away. Service was good, especially at keeping drinks full. There are several reasonably priced lunch specials, and we each picked one and shared an appetizer. The shrimp Tempura was great, though the mushroom tempura was a little greasy-tasting. All the other veggies were good, and it was all piping hot and crispy. My three roll lunch special was very filling and I'd probably order smaller or skip the appetizer next time. My husband got a lunch special that was a mix of sushi and sashimi, and the large and very tender pieces of sashimi were the standout. Overall, we really enjoyed it. I'm sure we'll go back to try dinner, and I'm happy to have a place on the Eastside to get sushi lunch quickly and cheaply!"}
{"text":"Nom. Great price for great sushi. We got the three roll combo deal and it was very filling and delicious."}
{"text":"The place is very small so you may want to call ahead to see if they have tables available if you have a large party. I don't think they have a table that is large for more than 4-5 people."}
{"text":"Takumi was one of my favorite places for sushi when I lived on the northeast side of Madison. Portions are reasonable for the price, the atmosphere and waitstaff are quite pleasant, and the food's always been very tasty.  I primarily order nigiri or rolls, but friends have said that the bento boxes and donburi are quite good as well. It tends to get a bit busy at times, so if you're not a fan of cozy, you can always order your food for pickup as well!"}
{"text":"Bento Box with shrimp and veggie tempura was yummy.   Since I've been here for 5 days this place has been one of the places that knows how to give good Customer service. Thank you.   We can in for lunch and the portions are filling and fresh.    I'll definitely be back when I return to the Madison area."}
{"text":"this place was FANTASTIC! i was in the area running some errands by myself and needed something to eat quickly. my stomach suggested sushi, so i did a quick google map search on my phone for sushi places nearby. when this place popped up with rave reviews, i decided to try it on a whim.   now, i LOVE sushi. i have had really bad sushi and really good sushi (in Alaska, talk about a fresh salmon roll!), and this was by far one of the best sushi rolls i've had. i got the rainbow roll, and sometimes rainbow rolls are iffy because of the temperature of the fish, but this one was spot on. all the flavors were perfect and i really couldn't have asked for a better roll. i also had a bowl of the miso soup and was not disappointed.  the staff is friendly, the decor is unobtrusive, and i was in and out quick (but they don't mind you staying a while if you'd like either, my phone told me there was free wi-fi and there was a gentleman in the corner reading a book while munching his meal at a slower pace than is customary for sit-down, non-diner places. but no one seemed to mind, and i noticed they kept his drink--and mine for that matter-- nice and full too). pricing is nice too. lunch specials looked good, but i was there for dinner (which starts at 4:30p), and my roll and soup were about $15.  i would highly recommend this place and i will definitely be back. my husband doesn't like sushi, but they have a full japanese menu along with the sushi, so no worries there!"}
{"text":"Today my spouse and I walked in to eat lunch. We waited to be seated for more than five minutes, during which time several employees made eye contact with us but did not speak with us, seat us, or even say, \"We'll be right with you.\"  We will not be going back."}
{"text":"Always have great food, quick service and from the 50+ times Ive been here hardly anything to complain about. If anything the only small issue Ive had is finding somewhere to sit during peak times. Parking is also shared and that can be a challenge. In all the restaurant rates very well for what it is."}
{"text":"Whenever we try a sushi restaurant that we are unfamiliar with, we order one Philadelphia roll, observe, look at the quality of fish in the sushi bar window.  Unfortunately, what we were served after waiting for 15 minutes was pretty poor quality sushi and service.  The roll has too much avocado and the fish had no taste what so ever. To make matters worse, the wasabi was old and discolored and hard in places.  If you are from Madison and think this is good sushi, then you have never really had the good stuff.  After one roll, we got the check and left.  The local grocery store here in suburban Chicago (Marrianos) has much better sushi than Takumi."}
{"text":"The few times I've been here I was pregnant so I couldn't try the sushi. I need to go back to try it out. My hubby and I had the teriyaki salmon with shrimp and veggies. It comes as a meal with soup,  salad and a scoop of ice cream. For the price it was great and tasted really good. The decor is cute but the place is small and had a long wait on the weekends. I wish they took reservations for couples on the same day but there isn't much room for a baby in a car seat anyways. This place is definitely worth visiting, I only docked a star for the really long wait for 2 people (almost an hour)"}
{"text":"The Love Boat is loaded with so much fresh proteins (sashimi, nigiri, and rolls) that it made 3 of us completely satisfied. I also ordered seaweed salad as an appetizer - really good, I love the salad so much.  Not entirely the best sushi in the world, but I'd say it's the best in Madison. Authenticity aside, the ingredients are fresh, and service is not bad, either."}
{"text":"Oh the distances I'll go for some sushi...  I actually misread the address to this place and thought it was near W. Towne Mall....good thing I was already in East Madison, or I woulda turned around and came right back home.  I ordered the seaweed salad and the Angel roll, and the total bill came out to a little under $20. Pretty standard for a sushi place.   Seaweed salad - it really hit the spot, but it wasn't anything extraordinary. My main issue with this appetizer was how deceiving the presentation of the dish was!!! What I thought was a heaping mound of wakame was actually a thick bed of cucumber slivers covered by a thin layer of seaweed. Totally PUNK'D me there.  Angel Roll - Delicious! Really, it was. I've never had sashimi that actually \"melted\" in my mouth, but the sashimi at Takumi did just that.  Halfway through the roll, I started deconstructing my sushi just so I could have the fish by itself...a first for me, so you know how truly QUALITY the fish they served was. As with the seaweed salad, my only gripe with the sushi was that the roll was SO dinky I'm sure that I could have finished two full rolls with room left for dessert!  Anyway, a few minutes into my meal, I started to hear loud clanging and gasps. SURPRISE! I guess Takumi doubles as a teppanyaki place as well as a sushi bar. Interesting...  Really, Takumi deserves 5 stars for the quality and the freshness of their sushi, but I have to dock a star just because I really don't think I got my money's worth...but I guess that's the price I have to pay for quality sushi in the midwest!"}
{"text":"Good place to get sushi here in Madison. Classy atmosphere, yummy food, a little pricey (but typical prices for sushi). The best part is probably the awesome lunch special that goes on Sundays as well."}
{"text":"My boyfriend and I came here for dinner on a whim - we hadn't heard about this place before but saw the good reviews!  We ordered the futo roll, the asparagus roll, and split the shrimp tempura udon meal.  I really loved the futo roll! It's very unique, filled with a ton of mixed veggies and seafood, and only $5.50! Definitely try this when you visit.   The asparagus roll and udon entree were good as well, compared to other places where we order this. The udon soup and tempura was a good size portion (enough for us to split this time) and wasn't greasy or too salty.   Aside from the futo roll, nothing on the menu blew me away with uniqueness, but it definitely did a good job with quality. I'd come back here again."}
{"text":"I came here twice and I have absolutely no complaints about anything.  The first time I came here, I came with my sister. We sat at the sushi bar and we both ordered 2 rolls each - we were served quite quickly. The rolls were very good.  The second time was tonight when I came with a large group of people (there was about 13 of us). We were sat in back at the hibachi grills. There were enough of us that ordered hibachi so someone cooked our food at the grill - it was very entertaining to watch the chef. We all had a lot of laughs. The sushi rolls were very good as well. There were no complaints about the service - the waitress was very nice and checked up on us frequently.  I would come back if I was in Madison again."}
{"text":"Pink lady roll, eat it, you can thank me later. :)  The drinks that they make here are really... really good. Do not underestimate, get a cocktail.   Sitting at the sushi bar is a fun way to eat at a sushi joint, but I like to grab a table with the wife. They also have some really cute little rooms that you can reserve.   You can order to go, which I do when I want to \"cook\" dinner for the wife. ;)"}
{"text":"Really great sushi! Fantastic vegetarian options! I definitely recommend eating here."}
{"text":"Delicious place to go to treat yourself!!! Fresh flavorful sushi every time. I was completely satisfied"}
{"text":"I've always suggested this place to friends and co-workers. I usually get takeout from here twice a week. Sometimes they don't have the order ready as soon as they state when you place it, but the most I have ever waited was an extra 10 minutes. The food has always been fresh and tasty.  Until today. I ordered the 2 roll lunch special and a dynamite roll. I started eating my Dynamite roll only to sudenly have excruciating pain in my mouth. Turns out there was a large piece of wire in one of the pieces!! I cut my tongue and jabbed a hole in my gums. Needless to say I will not be going back. It's one thing to have an 'off night' food wise... But there should never be an excuse for safety issues like this."}
{"text":"Best sushi place in Madison. Service is fast and very friendly. Fish is the freshest I've had in Madison. Price isn't bad for sushi."}
{"text":"Ate at Takumi again tonight, Sunday, 25 Sep 2016, and it was as good as ever.  For a change, I decided to try Seafood Tempura after seeing it pictured and described in someone's yelping.  It was very good, and I'm glad I tried it - though next time I'll be returning to the sushi, which is superb.  I also had a very delicious baby octopus salad.  It looked suspiciously hot, that orangey color that often means chilies, but there weren't any, it was nicely flavored and delicious.  Whole baby octopi, I'm sure I'll never again eat so many octopi in one day, since it is normally the adults I'm dining on.  My dining partner had a large platter of sushi, I know there were mackerel, albacore, bluefin tuna, salmon, scallops, shrimp, toro, red snapper, squid, tamago, uni (sea urchin), and octopus, but think there were others, as well.  One minor flaw, he had Uni, and commented that he was sorry he saved it for last, as it tasted off, or past its prime.  We should have said something to the restaurant, but since we didn't, I'm not holding it against them, as I'm certain, had we complained, we would not have been charged for that piece.  I'll be uploading photos of the items we had, soon, too.  One downer, and not at all the  restaurant's issue, I can rarely manage a check-in here, as my internet connection just doesn't work there.  Bummer. ________________  Thursday, 20 Oct 2016 -  Mitchell went in to pick up sushi takeout to eat at home.  The manager, recognizing him as a good/regular customer, asked if he also liked rolls, and Mitchell named one roll he likes.  The manager gave him a complimentary roll, and made Mitchell happy.  Thank you!"}
{"text":"Terrible customer service!!! Very rude and ignorant and spoke with a very condescending tone. It's funny because all I wanted was sushi and this place will never get my business again. Anywhere else that has good sushi in east madison? I'll keep You guys updated on good places to eat that actually appreciate their customers :)"}
{"text":"The ambiance is cool but this is definitely not a fancy restaurant. The drink was strong, food  was good and the service was nice. It was worth the trip"}
{"text":"We have gone here for two years and the sushi was usually good. Last night though while the fish was good the rice was on par with Piggly Wiggly at the end of the day. Tough and mealy.  Probably an off night and not typical in my experience. We had a spider roll and the crab was bland and the rice had no integrity and the whole thing fell apart."}
{"text":"Decent sushi for a city of this size. I ordered the sashimi sampler and one roll and was generally pleased with the quality and freshness. The price was still pretty steep, but I guess it's not out of line for similar cuisine in Chicago. Certainly worth a look if you have a sushi craving in Madison. I did get my order to-go, so I can't really comment on the restaurant itself."}
{"text":"I still really like this place.  However, my last few visits have been met with spotty service and warrant a downgrade."}
{"text":"I've passed this place a few times and completely overlooked it until recently. I won't be making that mistake in the future.   My date and I knew that it was a small place so we called on a Saturday night to see if they took reservations, they don't. Instead when we got there we had to wait at the small bar area until a seat opened up. A young lady asked us if we'd like something to drink and then left and forgot about us. It was forgivable, because they were busy and we assumed that once we got a table we'd get their attention.   When you go here, expect to wait. On a busy Saturday night a table still opened up fairly quickly. We knew what kind of sushi (tuna rolls and the lake side rolls) we wanted right away as we had been perusing a menu at the bar. The waitress took our order and returned a bit later to ask us if we knew what else we wanted. I ordered beef teriyaki and the date got chicken tempura.   One entree showed up first, then the sushi followed by the other entree, so the food came out in a weird order. But the food was delish! We dug into the rolls first. The tuna rolls were big and tasty. The lake side rolls were an interesting fusion of flavors. The caviar on top gave it a nice crunch, but the crab meat was lost on my taste buds. Once the crunch of the caviar subsided it just tasted like cooked shrimp and avocado. I'm not sure if I'd eat these again.  Both of the entrees were ample in size and sizzling hot when they came out. For the price this place is amazing. I had to take away a star for the service and the drinks. I understand that they are busy on the weekends, but it seemed like none of the servers have distinct tables. Sometimes they forget to check on you, other times a different server will come up to you and ask you if you've already put your order in. I'd suggest avoiding the drinks. They are small for the price and don't taste the greatest. I'll be back again."}
{"text":"Second visit. Once again, fantastic!! Service is great and I really like the chairs there. Comfy. The rolls were great. Spicy tuna I guess was just okay but that's all I got for complaints. The Angel Hair Roll with apple in it was tasty. Good lunch special prices."}
{"text":"Go for the bento box lunches! Great deal! Good food! This is a good sushi place in town and the hibachi is probably the best around. There regular menu has a lot of options though too, and a lot of it is quite good."}
{"text":"We have been to Takumi dozens of times.  I have never been disappointed.  Service is always good.  The miso soup is great and the sushi has always been fresh, for Madison that is.  I couldn't imagine having sushi on the west coast.  It must be amazing.  Prices are high but that is expected for good sushi."}
{"text":"A very decent sushi restaurant in a little strip mall. And despite their apparent obsession with James Blunt music, it was quite an enjoyable lunch. Rolls were tasty and well priced."}
{"text":"Decided to venture from Verona \"all the way to the East Side\" based on the number of positive reviews on Yelp.  Was not dissappointed.  Takumi is located in a nondescript strip mall around East Town Mall.  We walked in about 5:45 and grabbed 3 seats at the Sushi Bar.  The cold spinach appetizer was served broken up and slathered with a sesame dressing.  A little different, but a cool and fresh start to the Meal.  My sons had the fried Gyoza.  Good and the disappeared quickly.  My older son and I are Sushi fans and we ordered an assortment of Nigiri and rolls.  In my opinion, good sushi is defined by texture and temperature of the fish.  The fish here was silky and soft and served just a bit above cool.  Nice.  Too many sushi places serve their fish too cold, destroying the subtle differences in flavor.  The portions of fish in the Nigiri and hand rolls was also really big.  No skimping here!  Overall I would ranks Takumi a notch behind Muramoto for best place in Madison.  It is better than Takara on the West Side and blows away anything else on the list.  It's 15 miles from my house, but I would definitely stop there again when on the East Side."}
{"text":"This place was amazing! I wanted something tasty and fast...and that's what I got! Service was impeccable and the sushi was fabulous! Try the alligator roll and the wasabi sting roll! YUM!"}
{"text":"Excellent food. I love their sushi. It is unbelievable how fresh it tastes! The staff is friendly as well. Prompt and kind."}
{"text":"I've been meaning to write a review for awhile now, but I wanted to check the consistency of the restaurant.  One thing I've seen more restaurants fail at than anything is consistency;  one night they'll be great, the next horrifying.    The best restaurants make the dining experience effortless; you don't feel like you're waiting for anything, nor do you feel like you're being rushed.  The best meal I've ever had has been at Chez Panisse, precisely because the food was perfect, and the timing was perfect as well.  Most restaurants are like Muramoto at Hilldale, where one night it's great, the next night it's like meeting up with that one night stand that you meet up with again, where you wonder what the hell you were thinking.  Any sushi chef that douses fish in sauce is covering up something, just saying.  Anyway, I'd put Takumi in the former category.  It's an upretentious place, so if you're looking for uber-hip, look at the rest of the sushi places in Madison, but know that you will be served inferior fish for higher prices.    But if you want quality fish, order the omakase at Takumi--This is chef's choice, something lost on a lot of people.  But who knows better what is fresh than the person who's preparing the fish?  I knew I was in the right place when he threw the tray of uni out because it wasn't good.  My husband and I have been here a good dozen times, and both the service and the fish have been consistently good.    If you do not like lots of mayo or cream cheese in your makizushi, let them know (they will default to this), but take heart, because there is good nigiri in Madison."}
{"text":"Ya this place is hit or miss, most times i have been it's a miss. Only sushi on east side or i would never keep giving it another chance. Just ate sushi roll and nigiri, all tasted mediocre and unsatisfying. Will not be back. Spend your money at Red or Takara 88"}
{"text":"Definitely best sushi in the area.. very good and fast service, their specialty rolls are always fun and yummy. The staff at the sunprarie location are GREAT too. never had anything here that was not totally yummy!"}
{"text":"A lot of people rave about this place, but I found their sushi to be mediocre at best. Maybe it's because I'm used to California sushi, and I've been spoiled my whole life. But I would not eat there again."}
{"text":"Surprisingly very good sushi. Prices were a little expensive however that is to be expected if the quality is there. I would definitely recommend!"}
{"text":"Was craving for fresh, raw fish and I got my fix. The place is clean with nice & quiet ambiance. Our waitress is very attentive and helpful when it came to suggesting something good from the menu. I thought sashimi means that a raw meat/fish is sliced thin. But they served me pieces of fish that are thick & chunky. Regardless, I enjoyed them especially my favorite salmon & that super white tuna recommended by the waitress. They just melted in my mouth. I love how the chef took time and effort to create beautiful platings with vegetable carvings that are artistic. The price is so so....expected anyways when you want some fresh catch from the sea."}
{"text":"Best Japanese place in town! Go with the sashimi and you will not regret! I've been here lots of times, and always enjoyed the chirashi and dons. They have super fresh seafood, and all in large portions. This time I tried the sake don (salmon) and was covered with 9 pieces of thick-cut fat salmon, super fresh, super yummy. I've never tried their rolls before, but thy always look pretty nice. Their lunch bentos are also a very good deal."}
{"text":"My favorite place in MADISON area for Japanese food !!! Sushi, rolls & sashimi  Reservation highly recommend !"}
{"text":"Good food but the service was less than desirable.  We felt like we were being ignored since our waitress only came to check on us once after taking our order"}
{"text":"Located on the East Side of Madison, right by East Towne Mall, it's typically more of a treat to come out to this Takumi Japanese Restaurant.   Yesterday, since I was carving some Shrimp Tempura Udon (after watching videos on how to make some online) and giving that we were in the area to go shopping nearby, we decided to stop by this location.   We ordered three different lunch specials, so I was able to have my shrimp tempura udon with miso soup and three rolls of sushi: eel avocado, shrimp tempura and spicy tuna. All of which was fairly delicious as we struggled to eat all the of the food.   Service was decent, when my cup of water was low, it only took a few minutes before the server came by to fill it back up. Prices are reasonable, a little higher but for the quality of food, it was good."}
{"text":"What's good: vegetable tempura, Godzilla roll, Sapporo.   What's disappointing: 30 min sitting at the sushi bar before our appetizer arrived. Another 10-15 min before the rolls were ready. Won't return based on the long wait."}
{"text":"I like to order sushi from Takumi for take out since they are close to home. Always pleased with the sushi. I won't say it's the best sushi I\"ve had, but still good and convenient. A few seats at the bar/counter are available where you can have a cocktail if you wish, while waiting for the sushi to be made. Still have yet to dine in here."}
{"text":"Pretty nice place. Everything was clean. Waitresses were friendly and helpful. I told the waitress to decide for me (menu was huge). She brought me Wasabi Sting. I'm not a fan of wasabi, but it was great! I would go again to try more rolls. Things were priced a little high, but the sushi craftsmanship was there, so... ;)"}
{"text":"Eeeehhh....it was okay. I was impressed that they had hibachi here, but I didn't leave smelling like a grill. It's separated pretty well from the rest of the restaurant, so if you hate hibachi smell, this might be for you.   We had a Foxy Lady roll and a Lobster Tangle roll. The Foxy Lady was decent, but nothing to write home about. I say that because every time I have good food, I write my mother a letter and tell her about it.  The Lobster Tangle was good. I liked the little seaweed business on it, and the lobster was delicious. But not really fifteen dollars delicious.   It was decent, but frankly I've had better sushi at Edo on Park. I'm not sure if I'd go back and try anything different, not with the choices available in Madison."}
{"text":"I love this place! The food, service and setting is always so great. The candy roll is my favorite and they have really yummy ginger dressing.  I would highly recommend this sushi restaurant over any other one in Madison -- including the more upscale ones."}
{"text":"Order Omakase (leave it to the chef). You won't regret it."}
{"text":"Yes.  Great food.  Service is wonderful.  It is a bit small so get there as early in the meal hour as you can since it will fill up.  They have a sushi bar as well as two hibachi grills in the back.  This is on my favorites list!"}
{"text":"Great Japanese restaurant for the area!  The sushi was delicious and the happy hour special of $1.50 off all drinks is nice too!  They overcharged me for the Saki but were very willing and gracious to change it on my bill.  Highly recommend it."}
{"text":"Recently had the sushi here and it was pretty good. It is not the best sushi I have ever had, but for Madison it is pretty good. Cities by the ocean always have the best sushi and obviously most fresh!"}
{"text":"Best sushi in Madison! Best sushi ever actually. I went here for the first time and had to go again a week later. Super nice staff, good specials, huge selection. You can't go wrong with what rolls you pick. Green caterpillar is my favorite."}
{"text":"Best Sushi in Madison! Take out is great and pretty timely. But it is also really nice to get a table and eat there."}
{"text":"I love sushi.  Takumi presents the best sushi In Madison outside of 2 downtown square options.  Friendly efficient staff.  Always consistent and delicious.  Classic warm & inviting sushi restaurant ambiance.  Love the red river roll, amazing roll, wasabi sting roll as well as the a la carte sushi.   Top overall kid friendly Japanese in Madison.  We bring our family at least every couple months.    We have been to the newer habachi place 1 block west.  Takumi blows it out of the water from a sushi perspective.   From a habachi perspective both are very good.  If you want a more intimate experience go with Takumi.  If you like the more open public dramatic style you can consider the newer one."}
