{"text":"This place is a hidden gem just outside of Cleveland. The fresh roast beef and corned beef are amazing. The sandwich comes on your choice of bread and the portion is huge and so flavorful. One of my favorite lunch spots in the area."}
{"text":"Best corned beef in Cleveland, period. \"But Kels! Slyman's is the holy grail mecca of corned beef in Cleveland according to the people of Yelp!\" Yeah, well I'm telling you no. I almost didn't write this review because I want all of you to continue going to Cleveland Corned Beef Co and Slyman's so the line is shorter at Tal's, but today I'm feeling generous.   #1, the bread. You can choose whatever bread you want as it's a bakery, but the delicious standard rye holds up to the sandwich. #2, the meat. Cut thick, perfect amount of fat, perfectly seasoned, not mealy like Corned Beef Co or slimy and fat covered like Slyman's. Tender, juicy and wonderful. #3, variety. Tal's has a ton of sandwich combinations in their deli, so if you're feeling crazy, add stuff to it.   On second thought, continue going to Slyman's. More Tal's for me."}
{"text":"I've bought several things from Tal's and have never been underwhelmed. (A little pricey.) But it's one of those places where I'm like a kid in a candy store and would grab a little of everything if not for the cost. Sandwiches are huge."}
{"text":"Absolutely amazing ! Food is awesome..friendly staff .. Not to mention the Frank Sinatra playing all the time ! Definitely a thumbs up"}
{"text":"I've been coming here since it was a tiny store about 20 years ago.  I live in san diego now, and I really miss these kinds of sandwhich shops.    The corned beef, the capicola, and even the bologna sandwhich are all incredible.  And who could forgot that giant cucumber they stuff in every bag.  Its enough food for 2 people."}
{"text":"For anyone that says the corned beef is the best, they haven't had Joes Deli in Rocky River.  This place is terrible...at first sight, they had a lot of nice options.  We ordered the ruben sandwiches, $12.30/sandwich.  I threw mine in the garbage.  The thick slices of corned beef were the FATTIEST I've ever had.  I can't imagine anyone putting that in their body."}
{"text":"Excellent sandwiches from this family run deli.  Always too big to eat so one can feed two people easily.  They use top quality meats and the best bread in town."}
{"text":"I liked their corned beef better than slyman's. Crazy, I know! But the corned beef sandwich is excellent. It's enough for two meals...  Great local deli."}
{"text":"Tal's has pretty much everything you need for convenience.  They have snacks, a deli, lottery tickets, and beer.  Their deli is excellent, especially their corned beef.  It always smells good inside the store, as well.  It is a great place!"}
{"text":"Most. underwhelming. corned beef. sandwich. EVER!!!!!  Ugh.  So bland.  Flavorless.  Nothing!!!  My husband was away for my birthday, and upon returning from airport the next day, decided to bring home a luncheon surprise.  What a waste of $11.00.  $11.00!!!   I felt so guilty!  I would never recommend this place for their corned beef, ever...."}
{"text":"My company ordered the sandwich platter for a holiday party. The meat variety (turkey, ham, roast beef, salami and couple others) all looked very fresh and tasty. I ate the turkey, very tasty. The bread, again several varieties (white, rye, etc) all very fresh and very good. The potato salad, also good, tasted homemade, perfect amount of mayonnaise and seasoning to potatoes. The treats also looked good, but after filling up on the food, had no room left.  I had never heard of this place before, but now I will make a special trip to Parma just to check out the store as I have heard they have a lot to offer."}
{"text":"So grateful to have found this place. I am from Youngstown and have lived in the Cleveland area for over a year and this place is one of the very few I have experienced such hospitality and kindness I felt like I was back home. The pepperoni are to die for and the rye bread used to make the sandwich we got was outstanding. Will definitely be back"}
{"text":"Went in for a corned beef and got a sandwich full of fat.  The woman at the counter was extremely rude! She forgot all of the condiments that were asked for.  I'm not sure how this place has so many good reviews. If the corned beef wasn't so fatty it would be good. So better luck next time?"}
{"text":"I have been here a few times. Sometimes it is great sometimes it's horrible. Today it is horrible!! Fattiest corned beef I've ever had. Asked for horsey sauce, got plain horseradish and a TON of it! I don't think I will be going back. $11 for corned beef fat. GROSS! What happened Tal?!?"}
{"text":"This place is top notch when it comes to deli meats and cheeses. Their prices aren't bad and their corned beef sandwiches are the most amazing thing ever put between slices of fresh bread.   It seems to be family run too with cute ladies running things.   It is a liquor store as well, so you can pretty much make it a one-stop lunch break...get your booze and cold cuts in one stop.   They sell Boars Head too."}
{"text":"The quality of their corned beef sandwiches doesn't seem to be were it used to be. It's just kinda bland no real flavor to it. I don't mind paying 11 dollars for the sandwich if it taste good but I just think it has no real taste like they used to."}
{"text":"I went there over the weekend to get a sandwich.  I know that Tal's is known for their corned beef sandwiches, but I was really in the mood for an Italian sub.  I was quite disappointed to see that you can only choose ONE kind of meat to put on your sandwich at Tal's!  You can have salami.  You can have pepperoni.  But you can't have them on the same sandwich.  Gee, thanks.   So I ordered my salami sandwich, which came with approximately a full pound of salami on it, and the woman at the counter asked me if I wanted mayo on my sandwich.  I told her that I did.  When I got home I realized that my GROSS sandwich had Miracle Whip on it, NOT MAYO.  She didn't ask me if I wanted Miracle Whip on my sandwich, and if you don't know the difference between Miracle Whip and mayo then you shouldn't be selling sandwiches.  I wasn't happy about that.  My sandwich was ruined.  It was a complete waste of money.  Later that night I went to eat a pizza that I bought at the deli counter.  I believe Tal's buys these pizzas from a local bakery.  They are packaged in a big Ziploc bag that has a label affixed.  The pizza looked fine and I put it in the oven for approximately 20 minutes.  I ate a piece, then about halfway through my second piece I noticed that a thin layer of mold was covering it.  I threw it out and resolved to NEVER go to Tal's again.   Plus, while I was there everyone working at the deli was pretty rude.  They don't take debit or credit cards either.   Never again!"}
{"text":"I love corned beef so when I seen the reviews about them I decided to go check it out. I was definitely disappointed. My sandwich was nowhere near as big as all the other reviews described. The meat was definitley chopped into chunks but it was loaded with fat. I found myself fighting to eat the sandwich with the amount of tough fat stuck between the meat. It was horrible. The store was amazingly clean and everything looked fresh so I decided to give them another try before I just said the hell with this place. I found myself going back about 2 months later only to have the exact same experience. I don't think i'll be back."}
{"text":"I am SOOOOO beyond disappointed. I went online because i always pass this place, the website made my mouth water. They advertised they sold all types of specialty deli meats, board head products, wings, pepperoni bread, all the fixings for an awesome football sunday.  WRONG! I went in on a friday, around 4pm, my stomach empty and i was saving it for what i hoped would be this awesome meal from Tals...  I was greeted by a 15 year old boy, he yelled \" welcome\" scared the bejesus out of me. I ran to the deli counter only to find maybe 10 different deli meats NONE boars head like their website advertised. When i asked the two teenage girls behind the counter they looked confused and annoyed that i had even bothered their in depth conversation about Black Leggings and Ugg boots. SO then I asked another worker about the wings and pepperoni bread, again they advertised BOTH on their website and neither was available.  What the heck?! They are the kings of false advertisement and child labor violations. The girl slicing deli meat couldnt have been any older than 14. I was really truly annoyed that i had been misled. Whats worse is the inventory they did in fact have was empty as well. The bakery counter had 2 freaking cookies in the case, and the rest of the food was in the cooler.  Again, I cant go off the taste of their product because everything i went there in search of, everything they bragged about on their website, NONE of it existed. SMH"}
{"text":"The first time I went to Tal's I fell in love. If you are into giant deli sandwiches, this is the place!  There is a plethora of meats and cheeses to choose from, but the shining star is the corned beef. Half the sandwich is a decent sized meal, but sometimes I feel brave and attempt to finish the whole thing.  The service is always great, and the really know how to boast about their corned beef. I was there waiting in a 20 person line for St. Patrick's Day a couple days ago. The line was out the door. These sandwiches rival that of a popular little \"Sly...\" Cleveland deli, but is much closer to me.   I addition, they have other deli essentials, olive bar, and a cooler filled with all kinds of alcoholic beverages. They used to have liquor, but I don't recall seeing the large sections anymore.  For an excellent deli/corned beef sandwich, you can't go wrong. HIGHLY RECOMMENDED!!"}
{"text":"Same location, same staff, face lift to interior the best hot cornbeef and potato salad. Wish they still had Boars head deli meats. Would give 4 stars if they did!"}
{"text":"Not a bad bakery, half convenience store almost. Cashier was nice, assistant at the bakery almost seemed annoyed that all we wanted was a small selection of pastries. No coffee was made, to wash down our dessert. Might return to try something else, assuming that maybe another day would be better. 2.5 stars specifically."}
{"text":"Best corned beef sandwich in ohio period it's well worth the money..... Alittle hidden gem in ohio"}
{"text":"Literally the perfect neighborhood bakery. My only issue is the outrageous prices! We're not in New York, this is Cleveland."}
{"text":"Got a corned beef sammich here for the first time in a while, Its still hand cut but thin enough so that its not blocky.  The bread is still the best around crunchy on the outside soft on the inside and still hand cut.  The place is under construction as they are expanding the deli and dinning area.  Four stars tho as their pastrami still isnt what it could and should be for a deli thats this old."}
{"text":"I saw a health/cleanliness violation today I'm pretty sure should've warranted an on-the-spot firing.  I ordered a cold cut sandwich and, while a lady was making my sandwich, I became aware of an older server guy slicing up hot CB for a sandwich, awkwardly and clumsily.  He had a plastic food service glove on one hand and a knife in the other - being careful to handle the meat with the gloved hand.  So far, so good.  On the other end of the counter was a customer - who either asked for, or was promised a taste of the CB.  So after the requisite amount of CB was weighed on the scale, server guy cuts one more piece of CB, and tries to walk it over to the customer - holding it (clumsily) between the two-prong fork and the wide slicing knife.  Slippery little devil...the meat fell to the floor before he got it delivered to the other end.  So he proceeds to bend over, scoop up the piece of meat with his gloved hand off the floor, and pitches it into the garbage can.  Still, so far, so good.  Now the disgusting part.  Without so much a thought to replacing the now-contaminated glove, he goes back to the bulk piece of CB, slices off another hunk, and walks it over to the customer - who either didn't see what happened; was afraid to say anything; or doesn't really care about food service standards either...because he scooped the meat from the wide knife surface (with his bare hand, mind you) and wolfed it down.  Server guy now goes BACK to the CB sandwich in progress and, with the still-contaminated glove hand, grabs the CB meat off the scale and stacks it on the rye sandwich bread.  Evidently it was a to-go order, because no one at the counter claimed the sandwich after he wrapped it, priced it, and set it aside - awaiting pickup.  Not sure I'll ever be back.  If they let a guy do that in full view, what the heck is going on behind the scenes?  Be forewarned, the five-second rule may be standard procedure here."}
{"text":"Had the worst corn beef sandwich I've ever had in my life there. It was filled with fatty meat. I will never return!"}
{"text":"Omgoshhhhh!!! I love this place!! The people are so nice and Angy is amazing!! I met the owner and even though the store was closing he made my sandwich!!! I'm never going anywhere else! This place is to live for!"}
{"text":"Family owned..i like that.  I have been going there for 20yrs or so.  The corned beef is good if ya want to wait forever to get it.  The main reason I used to go there was for the FULL liquor store they had.  They sold the liquor license to frickin Giant Eagle at Parmatown.  So now on a hot summer day..we have to get out pf the pool, dry off and drive even farther...all because they are chasing the allmight dollar and sold out.  Was good while it lasted..  ;)"}
{"text":"In Tal's defense, I only got broasted potatoes. This place might actually be at three or four stars if I had gotten more. The potato wedges were frozen. So as a result, some of the thicker wedges were not cooked all the way through. Yuck, raw potato.  I would be willing to try again. I don't think this reflects the entire business. At least, I hope not."}
{"text":"the only thing that keeps this from being a 5 star review is the service at the sandwich counter .. I have been treated like royalty at McDonald's when compared to the service I got here .. management should look into this b/4 they possibly lose customers .. no greeting .. no thank you .. no eye contact .. but the corned beef sandwich (I opted for the hot vs cold option + Swiss + yellow mustard) on fresh chewy rye + the obligatory pickle on the side is what was worth the 4 stars here"}
{"text":"What isn't immediately obvious about this little place is that they happen to have the best corned beef in town in a little deli section in the back.  Loads of amazing corned beef on soft yummy bread, topped with cheese if you like.  I haven't had it in about a year, but I'll be returning tomorrow and looking forward to it.  Cash only!"}
{"text":"I search for good corned beef sandwich near Independence, OH and came up Tal's.    Reviews were good so there I went.  I was sorely disappointed. Corned beef was tough, cut thick & chunky with little flavor."}
{"text":"Best corned beef sandwich in Parma! They give you a ridiculous amount of fresh sliced and home cooked beef on two pieces of bread.  It's like a New York deli sandwich right next to my house.  Tastes like heaven! I always make it into a couple sandwiches. This is a takeout only place right now, but they are in the middle of a remodel. So who knows what could happen."}
{"text":"Decided to update past reviews and add a star for one of THE most important things responsible for Tal's success: consistency. They've got it in spades.   Been going there at least 2x a month or so since rediscovering them, and their corned beef has been consistently good. Today I shared with Tiffany (a long-time stalwart in the deli) that the corned beef I took home two weeks ago was better than  I've had anywhere, period. Yes, even better than Mr Brisket (hold, on, I'm waiting to see if I get struck by lightning....no, I think we're good). Now, is it usually THAT great? No, but, then, perfection is elusive whatever side of the Cuyahoga you're on.  However, Tal's consistently cranks out CB I'd eat any day of the week.   While I don't get there often enough to try other things I can tell by the steady stream of customers ordering sandwiches just a tad smaller than a basketball that this place is popular for a reason. And now they've added prepared foods (haven't tried any yet), too. Their bakery cranks out good stuff, they offer pretty much anything you'd need to drink, and the people are nice. Seriously, if you're hungry and in the area, what are you waiting for? GO! If Tal's hasn't earned \"Legendary\" status yet, they're close."}
{"text":"Tal's recently began accepting debit cards (PIN only).  Yippee!  They also sell steaks now too.  +1 Star for being awesome, once again."}
{"text":"Tal's is a great little deli with good sandwiches-- I don't like corned beef, so cannot comment on that--- but have had some amazing deli creations from them. If you are hungry and in Parma...you cannot go wrong. They also have a great selection of adult beverages, FYI, so stop here if you are thirsty, too"}
{"text":"Outrageous prices.   $6 for a cheese sandwich, really?  $13 for a reuben, WTF?  Save your money and go to a nice sit down restaurant and for the same money or a couple $ more you can enjoy a nice meal in a nice establishment where you don't have to listen to an obnoxious fat Italian guy saying how good his sandwiches are.  They're not."}
{"text":"Tal's  First off, there were already many reviews that I have seen about the thick - rubber like corned beef. I truly did not want to believe it, as I remember going here with my father in the 80's (the old store). I have had many different offerings of corned beef from around Cleveland area, and today was the first time at Tal's. We ordered three sandwiches, one gyro sandwich, one hot corned beef, and on philly cheese steak. The total came to $25.  The gyro clearly was cut a day or so prior to sale, and not like your standard fresh cut gyro, the pita was even stale, I am not so sure we got a fresh sandwich here at all.  The Philly seemed all right, or at least the cheese that smothered it made it edible.  Last and certainly least - The corned beef was exactly like a lot of reviewers said THICK RUBBERY beef, totally un-edible. I personally enjoy cooking corned beef brisket, and the key is low and slow-no matter what method you use. And as rubbery as this was, I can say that the problem has to be that it was simply speed cooked. My dog did enjoy it, 11 bucks wasted."}
{"text":"Extremely underwhelmed.  They claim to have the best corned beef sandwich, but I beg to differ.  It was all fat with barely any edible bits and it was ridiculously expensive.  The quality of this place is going downhill for sure."}
{"text":"Kolaczkis are freakin awesome! Even at $9.99 a pound. Worth it! Fresh loaves of bread are great too! Always friendly. Love the Ratpack music that's always playing on the overhead. Lunch meat prices are a little high but still cheaper than the chain stores. Great sandwiches too!"}
{"text":"Got food poisoning here Super busy expensive and rude Super awesome experience I wish I could leave 0 stars"}
{"text":"I got the corned beef sandwich. Im not versed in the corned beef ways but I know good corned beef when I taste it. Tender, tasty and having it on rye with Swiss, horseradish, and mustard seems to go so well together. They have a great deli and bakery to boot along with other fresh made sandwiches to order. If you are in Parma you need to try it."}
