{"text":"Great tamales and mole enchiladas!  I highly recommend for anyone who enjoys authentic Mexican cuisine."}
{"text":"We bought some tamales for Christmas Eve. They weren't very good. We will have to find somewhere else to get our tamale fix from now on. We used to love them when they only sold them off the truck, now since they opened the restaurant, they aren't good at all. Too bad."}
{"text":"Best place to eat authentic Mexican food..I cycle all the way from university area to this place once in 2 months and enjoy their food. Everything tastes so authentic."}
{"text":"Everything here is great. I have had the Tamales, Gorditas and the Tortas. The Pork Tamale is the best! Also, the cubano torta is awesome."}
{"text":"So i love love love their tacos. The steak ones are amazing and the shrimp ones are the bomb as well. But the best thing is their queso dip OMG. It's so good. I've never eaten inside the restaurant I always order to go but the staff seems nice"}
{"text":"Hole in wall, but bright, airy and clean. 

They have mole tamales-- look no further."}
{"text":"This place is the truth price and taste! Can't beat it!
The steak tacos are amazing! I enjoy steak or chicken both are delicious. It's a small place but great for carry out orders."}
{"text":"Tight squeeze. It's the size of a NY eatery with 4 tables for a party of 4-5 each. Plan to take out or come early.

They have lots of photos so feel free to point to your dinner. Otherwise, learn a bit of Spanish...great way to practice your language skills too. 

Super friendly. You can tell they like what they do. 

There was a wait for my order. As I was waiting I was able to see other orders coming out of the kitchen. The Cuban sandwich looked big and awesome. Next time, I'm getting it. They also have carne asada, tortas, burritos, soup. But I came for the tamales! This is a solid, authentic tamale place. Now you know where to order your New Year's meal. Two tamales were under $4...that is a great price! The salsa (red/green) was very spicy hot. Sensitive to heat? This is not the sauce for you. The chicken was great, the pork was very tender, and they also have 2 dessert tamales made with sweet fruit juice (pineapple); they would be perfect with ice cream. I ordered the cheese tamales, but after eating the other two, I couldn't go on (the cheese is currently in my fridge waiting for me to have a midnight snack).

They take credit cards, but since everything is so affordable, bring cash. Feed the family, pick up for your next party, support this little place.

Way to go Charlotte Observer for highlighting this authentic Mexican cocina!"}
{"text":"I've searched and eaten all over Charlotte and these are the best tacos, sopes and burritos in town. I had 3 Carne's asada tacos and 2 al pastor sopes on this trip. Amazing. Reminds me of both my grandma's cooking and joints you'll find in Los Angeles or Phoenix."}
{"text":"The Pluses: 

Lots of Choices - Gorditas, Huaracha, Tamales, Burritos,Tacos and tons more

Big pictures of menu items that are actually an accurate representation of what you'll get!!
            
Very nice owners/workers running the counter and kitchen!

The food didn't really blow me away. The best thing I ate were the Pastor Tacos (the asada was a bit tough and dry). The homemade hot sauces do kick butt! The Burrito with ground beef was just okay. What I had hoped would be the star, the tamales, were way more corn than filling. I ordered a plate of three that included chicken, beef and vegetarian. I like that they remove the husks. The portion was very generous and if I remember correctly only cost about $4.85 (so you can't complain too much when your belly is full). Maybe I just haven't eaten enough tamales, so I can't really vouch for the authenticity. I'm guessing that hot and a lot at a reasonable cost is pretty authentic though. Check this place out for yourself but my taste buds prefer Masa Casa any day!"}
{"text":"The perfect example of world class food hiding in a Spanish speaking tiny strip in a weird part of town.  Down in starmount, at Arrowood and south blvd is Tamaleria Laurita.  The tamales are very good but the tacos are something to behold.  Starts with a perfectl tortilla, tastes homemade.  Then comes the huge amount of filling.  I usually go with campechana and Pollo.  The campechana is a mix of carne asada and crispy meaty bits of chorizo.  The Chorizo is my absolute favorite thing here, not too greasy, has a nice texture, flavor and a crispy edge that sets it apart.  The chicken tacos are also just top level.  Crispy marinated chicken bits from the flattop to the taco, all come with cilantro and onions, although they will ask you if that is ok.  So if the tacos are not enough they have 5 different types of tamales and I always get the tamale de Rosa and tamale de mole.  It is literally a chicken mole wrapped in a tamale and steamed, awesome, awesome flavor.  Tamale de Rosa is red sauce mixed with shredded chicken stuffed in mass and steamed, another really solid offering.  To top
It all off, everything is $2 here, so 8 things=$16.  I got lunch for my warehouse guys and it was less than $20 for the three of us.  If you don't speak Spanish, I really dont either but I can order for you and your crew. Just walk in and say
Dos tacos de campechana
Dos tacos de pollo
Uno tamale de mole
Uno tamale de Rosa

Thank me later!"}
{"text":"Don't get me wrong... Tamaleria Laurita makes amazing tamales. The mole are some of the best I've ever eaten. But those tacos. Oh! Those tasty, tasty tacos. They rival some of the best tacos I had while traveling in Mexico. You'd be seriously missing out if you eat here and don't order at least one taco. So, do what we did and order tamales AND tacos. I recommend the chorizo and pastor. My BF loved the asada. Honestly, I don't think you could go wrong with any option. Except the tongue (lengua on the menu). I don't think I'm brave enough to try tongue. 

We ordered enough food to feed a small army -- we wanted to try a little bit of everything, ok?! -- and our total bill was $20. So, tastes amazing and is kind on the wallet. Si, por favor! We'll be back often."}
{"text":"Excellent! We have been twice now and it's been great! Service is friendly and the food is so good! The tamales are absolutely perfect! I highly recommend the mole tamale. They are very tender and flavorful. My husband got the tacos and we also shared Empanadas (we were hungry)! The place is small, with just a few tables, but not a problem, we dined in and have also done take out. They also serve wings and I think hamburgers if someone doesn't want Mexican food. We haven't brought our kids yet, but will bring them next time. Just go, your stomach will thank you!"}
{"text":"Me gusta todo el menu! Siempre que llego siempre veo muy limpio y acogedor aparte de que es buena comida y no es caro. 
Sigan asi."}
{"text":"Dear Tamaleria, could you please open another location closer to me? Like say, in my garage. My roommate totally wouldn't mind.

I have been so excited to try Tamaleria ever since I read The Observer piece about it. This place is tucked in a strip mall on Arrowood Road, next to where the Salvation Army does its Christmas Center. It's not very big, just a handful of tables. Our group wanted to dine in, so we took Faith D's advice and went early at 11:30am on a Wednesday. If the tables are all full, just get your order to go. Super quick and easy. Probably a good thing I don't live near here, I would be stopping by every day to grab some tamales. 

We wanted to try a little bit of everything. Our order for three people: six tamales, four empanadas, two chorizo tacos, and a Mexican Coke. The grand total: $26. That's a lot of food, folks. We mixed it up with several different tamale preparations/variations: chicken, pork, mole, verde, red sauce... I thought they were all good. There are also some vegetarian and dessert tamale options. The chorizo tacos were delicious. They bring a few different sauces to the table. I recommend trying a small amount of each to experience the different flavors and heat levels. Want to make a meal of it? You can score two tamales, rice, and beans for about $7.

Everyone here was so nice. If you're a little shy about trying a tamaleria, don't worry. There are pictures everywhere to help guide you. They do take credit cards. I recommend bringing several friends so you can order a lot and try a little bit of everything."}
{"text":"Are you tired of the Americanized Mexican food? Then this is your place. I love this place due to it traditional food and homemade tamales. It is a bit hidden, but if you use your GPS you should have no problems finding it. It is located in the strip mall. It is a tiny place and has about 6 tables, but I have never had issues finding a spot to sit. 
The tamales are amazing and very inexpensive, which makes me come back often.
Sometimes I just get three tamales to go and eat them at home, but the way they smell I end up messing up my car and my clothes because I tend to eat them on my drive home.
The staff is very friendly and welcoming. It is clean and the menu is straight forward.
I highly recommend this place!!"}
{"text":"Tamales are the best in Charlotte. Tacos were good too. The tortas and sandwich style options looked amazing so that's on the must try list. Very humble storefront with delicious food. I wish they had healthier, compostable/waste-friendly containers but instead they use styrofoam for takeout orders."}
{"text":"I was headed to the little Chinese place next door for lunch yesterday when I had to park in front of Tamaleria Laurita.  I noticed quite a few people inside so I thought I would just go inside and see what they offered.

Wow, am I glad I did!  I ordered a pork tamale to try and it is the best I have had in Charlotte.  I can't wait to try their tacos and other great menu items.  

I am going back today to get a dozen to take home!"}
{"text":"This was my second time here THIS WEEK! Yes, and so worth going to the ends of the earth (or the other side of Charlotte) to get them! The chorizo tacos are unique with a hint of clove and the tamales are two thumbs up! 

The cheese and pepper tamales with the red sauce are my favorite! The sauces are nice and spicy! 

I got 4 tamales 4 tacos and an empanada for 18!"}
{"text":"I got the chicken and pork tamales and both were phenomenal. Be cautious when eating the sauce. Surprisingly the green sauce is the really spicy one. 

This is a joke in the wall spot in a trip mall, but it's worth it if you want a good tamale"}
