{"text":"Though a little overpriced for \"Kanda Class\" sushi the place was alright. Better decor and nice though very informal service. If you're looking for high end sushi this is not the place. passable sushi and bring you own wine? worth a try."}
{"text":"Simply the best!
Kinda expensive but never disapointed
You must dress up ! Great date place!
Amazing for group of 6 and you all must eat downstairs where you can sit at the low tables.

Decor is great!"}
{"text":"wonderful place with great food! unfortunately the place downstairs with the koi fishes abd traditional japanese tables was closed from monday to wednesday.

highly recommend this place to you!"}
{"text":"Ouf pourquoi ce resto est toujours plein, j'y suis allée à l'occasion sur invitation. Hier j'ai opté pour le saute de fruits de mer et poisson... On ma servi un bol de fruits de mer bouillis... Agrémenté d'un morceau de poisson \"deep fried\" deep n'est pas un mot assez puissant pour exprimer l'instance friture de ce poisson .... Le repas était sensé être accompagné de légumes... Ils étaient presque absents... Mon conjoint à opte pour le général tao... Poulet timide sous cette pâtes épaisse .... Ambiance bruyante service médiocre.... C'est sans doute la formule apportez votre vin qui fait le hit de ce resto! Je n'a pas essayé les sushis je ne peux donc commanter"}
{"text":"Food was good, bring you own wine helps. Service was sub par as the waiter didn't seem to understand English and therefore couldn't respond to our inquiries."}
{"text":"What beautiful restaurant! The decor is to die for!

But the service and food are ok. Actually the service was extremely long and as far as the food goes, 3 of my friends and I found that it eatable yet some dimensions missing in the mix of ingredients. I personally had a Pad Thai and described it as boring...the sauce that generally enhances the combination of shrimps, noodles and all involved was just flat. It as if they had left two colors in the spectrum of the rainbow.

But absolutely worth seeing!"}
{"text":"I was brought to Tamashi restaurant by some friends who are locals.  Whenever I have come to Montreal my friends have taken me to outstanding restaurants and this was no exception. 

As you walk up to the front door there is a huge statue of a horse raise up on its hind legs.  That's just the beginning. The Decour and ambience were amazing, and I loved all the detail. We were greeted and seated my friendly staff and promptly attended to by our server.

I ordered the ginger shrimp plate which is served with mixed vegetables and some rice.  The presentation was absolutely beautiful. The flavor was fresh and a delight.  The vegetables and everything were cooked to perfection. There is nothing I would've changed.  

Some people complained in their reviews about slow service.  They must have come on a bad day.  Our server was always prompt, courteous, engaging and professional. Or food was delivered hot and promptly.  Everyone at my table enjoyed their entrée.  I wish we had such a wonderful restaurant in my hometown. 

I did not notice background music, and did not miss it. I was accompanied by great friends and we enjoyed the conversation without any distractions.

I did not take pictures or bother to look at the restaurant up on Yelp while I was there because I wanted to give my attention fully to my hosts. However there is much that is photo worthy at this beautiful restaurant, and the food I had was amazing. 

A truly delightful place perfect for a date night with your wife or for gathering with family or friends.  Everything I saw was spotless and clean, immaculately decorated, the food and service top notch. 

I would definitely return anytime I had the chance."}
{"text":"If I can summarize my dining my experience at Tamashi is that you pay for the decor and not much else.

This establishment is gorgeous with quality Asian styled decor with a nice stairwell overlooking a large fish pond. Downstairs you can enjoy your dinner in company in a Asian styled setting on a low table while seated on seated on a pillow.

We ordered the Grillot plate which consisted of a mix of grilled meats in Asian styled sauces as well as the General Tao. These were expensive dishes that come with no extra thrills (soups, desserts or coffee) and I found it a hard sell to pay $25+ for a plate of General Tao.

 However, we were here on a special event and went with it.

These dishes were served in large plates and the portion was quite generous. The General Tao could have easily served 2 or 3 people. The General Tao was quite bland, lacking both zesty bite and flavour. The Grillot was decent but it wasn't memorable for me for the price of the dish.

I felt these plates could be smaller and better priced. Perhaps have it in a shared plate setting. With these smaller plates the chef could concentrate on the quality rather than the quality served. I'd much rather have half the portion if it actually tasted good as long as the pricing reflected this change.

What was memorable to me was how bad the service was, the dining experience lasting 3+ hours! We wait over an hour for our food! (table of 12). No water refills, had to ask for it after 2 hours. Unacceptably bad.

Overall, the plates were quite boring and unforgettable, which was sharp contrast of the pretty setting around us. The service was lamentably absent. As I paid, I asked myself the question if I came here to eat or look at the fish in the pond? Aesthetics should compliment quality food and service not surpass it like it did during my stay.

Not for me, will not be back."}
{"text":"Omg!! So goood! Loved it seriously! The general tao plate was just amazing i cant wait to go back!"}
{"text":"Pretty good place ... Service is not amazing but food is pretty good we had the table d'hôte and it was pretty decent .. The entree salad are good as well
 We had rainbow sushi pretty delicious as well!! 

Must try !"}
{"text":"hummmmmm excellent resto choix de suchi general tao super et tout les autres choix que j ai pris je me souviens pas du nom je devrais avoir le menu pour vous dire oui essaye ca  tu as du choix les serveur sont cool les assiettes copieuse cest la place je vous le recommande"}
{"text":"Not worth it, very bad service and mediocre food.

Last  night we went to this place for my sisters birthday. From my past knowledge of this area, I think that this location is cursed. Well this place actually had a great decor, there's an extra room to your right which is very similar to Japanese restaurants where you sit on a cushion on the floor. That part along with the rest of the restaurant is aesthetically very beautiful.

Well I didn't go here just to look around, we can here to eat. At first I did not know what to expect of an Asian Fusion restaurant as I had never been to one. Well there was no Asian Fusion here, we all chose the Sushi buffet which was an experience all on its own. 

Our first order we asked for fried calamari and tempura sweet potatoes. Somehow the brought us a mix of tempura vegetables, calamari and shrimp. Normally I would be happy with that but, I was worried as to how the rest of the meal would turn out. We also ordered sashimi (all fish no rice) and that never came. We also order couple different spring rolls (one shrimp & crab, the other salmon) these didn't end up coming until after our third, and final order where the shrimp & crab one was replaced with beef! 

We also had a random waiter come around and try to put things on our table, here's the dialogue:

Waiter: \"Spring Rolls\"

Me: \"Yes what kind are they?\"

Waiter: \"What kind did you order?\"

Me: \"What kind are those?\"

Waiter: \"I think pork.\"

Me: \"I didn't order those, I order shrimp & crab.\"

It was like they just wanted to fill us up with whatever the had extra. 

Now let's talk about the food. It was mediocre, not the best of anything everything was ok. The sushi was a little dry, the fish was passable. My favorite thing that I ate was probably the fried banana at the end of our meal, that was delicious.

 I will definitely NOT be going here, I definitely would NOT recommend this place."}
{"text":"Beaucoup de choix diversifiés. Je suis très capricieux en terme de bouf, Je n'aime pas grand chose mais ici, il y à du choix. Des grillades, soupes, général tao, sushi, teriyaki fumant à la table, etc...

Pour ma part, J'ai pris le général tao. Très grande assiette bien remplis. Seul chose, C'est supposé être sucré comme écrit dans le menu mais je l'ai trouvé plus salé avec un goût de soya. A cause de cela, Je l'ai trouvé fade et moins goûteux que mon préféré chez charmes cochinchine. Reste que ma compagne la trouvé excellent, donc ça reste une question de goût. Par contre, le poulet utilisé était de qualité, pas de poulet gras et une bonne portion accompagné d'un riz cuit parfaitement et d'une salade spécial (J'ai pas le nom).

Ma compagne à prit le teriyaki au crevette après avoir vu un serveur passé avec l'assiette. Très grande portion et elle dit que c'était vraiment excellent.

Le serveur était plus que courtois, gentil et aimable. Ma compagne ne savant pas quoi prendre, Elle voulait tout, il à servit d'autre table en nous présentant les plats. Il faut dire qu'on était directement devant les cuisines.

L'ambiance est parfaite sur deux étages. Au sous sol, il y à des tatamis et on peut manger en étant assis autour d'une table sur les tatamis adaptée pour avoir de l'espace pour les jambes."}
