{"text":"This is probably the worst Chinese food I ever had. The food is unreasonably expensive and the service is terrible. They even forgot the soup we ordered. Avoid!"}
{"text":"the delivery experience was horrible. I ordered lunch online and got a call asking me to tip more and order more dishes, because it is a long way from the restaurant to my place in Savoy. Even after I explicitly told them I am fine with the amount of food I ordered (over $30), the guy still tried to ask me to order more and threatened not to deliver until I agreed to pay the so called additional delivery charge. All I want to say is that I understand it is a relatively long drive to savoy, but all other restaurants in town does delivery to Savoy with a lower charge and will never bother to call customer threatening them to order more."}
{"text":"This place may well be the most underrated Chinese restaurant in town. Amazing food (the management has recently changed, but the food is still top notch). Try the hot pot or the sauteed Chinese greens. The Dandan noodles are pretty great too. For Urbana-dwellers, this is great and does not necessitate driving all the way to Golden Harbor. Go here and eat!"}
{"text":"This place was a little sad when we first went but I think they must of been coming out of some sort of hard times. We have returned four times since and it has been a wonderful experience every time. They have been very accommodating to our two year old as well. Food is very fresh and they have a great selection of tofu dishes when you ask them to substitute it. I feel as though I now have gone enough to warrant a positive to counter some of the negative opinions expressed about this place on here."}
{"text":"??????????????????????????????????????????????????????????????????????????????????????"}
{"text":"Tang Dynasty in LSQ is my Friday lunch place.Sue is a welcoming hostess, and I enjoy the stir fried green beans, house special eggplant, home style tofu & the Peking Duck as my faves. We bring our own green tea in a thermos for fun. Everyone is friendly and the service is fast. Haven't tried the buffet, but have checked it out, and there are some very delicious veggie egg rolls that Sue allowed me to try."}
{"text":"I was taken here recently for my going-away dinner, and I was BLOWN AWAY. The food is incredible! It is in the same price-range as Golden Harbor (which I love), but in my opinion the food here is even better.  We were a party of 13, and were seated comfortably in the large table in the side room. The owner of the place took our orders, and she was wonderfully fun/sassy about it. She gave great recommendations, and would tell us if she thought we were making an unsuitable selection.  Cuisine highlights: - GARLIC SAUCE, anything in garlic sauce was delicious (beef, eggplant, etc) - Beijing duck (wraps had good texture, duck was cooked well, good sauces) - Crispy tofu (crispier coating than from Golden Harbor) - Fish with pine nuts (fish was battered and fried, and drizzled with a sweet sauce) - Steamed tilapia (very tender) - Scallion pancakes (owner served us two orders for free) - Kung Pao Tofu (all-around delicious)  I had been skeptical of the place because of its location in the eerily-deserted Lincoln Square mall, but they renovated the place a few months back, and the ambience is great!  My only regret is, having left the area, I can no longer partake in this sumptuousness :(  NOTE: Older reviews (pre-2011) for this place are likely dated, as management has since changed and they've renovated the interior. This place is definitely worth a try."}
{"text":"I can't believe this place only has one review on Yelp so far!  I was taken here recently for my going-away dinner, and I was BLOWN AWAY. The food is incredible! It is in the same price-range as Golden Harbor (which I love), but in my opinion the food here is even better.  We were a party of 13, and were seated comfortably in the large table in the side room. The owner of the place took our orders, and she was wonderfully fun/sassy about it. She gave great recommendations, and would tell us if she thought we were making an unsuitable selection.  Cuisine highlights: - GARLIC SAUCE, anything in garlic sauce was delicious (beef, eggplant, etc) - Beijing duck (wraps had good texture, duck was cooked well, good sauces) - Crispy tofu (crispier coating than from Golden Harbor) - Fish with pine nuts (fish was battered and fried, and drizzled with a sweet sauce) - Steamed tilapia (very tender) - Scallion pancakes (owner served us two orders for free) - Kung Pao Tofu (all-around delicious)  I had been skeptical of the place because of its location in the eerily-deserted Lincoln Square mall, but they renovated the place a few months back, and the ambience is great!  My only regret is, having gone away, I can't partake in this sumptuousness anymore :("}
{"text":"I brought different friends to that restaurant several times recently. All my friends are very impressed by the food there. They have various kinds of food, and all are really good! Plus the owner of the restaurant is a super nice lady."}
{"text":"I like this place.  I have had lunches, dinners, and dinners for lunches from here.  I think the food is good and the portions are good sized.  When I carryout or have it delivered, I don't feel like I'm getting skimped.    My only complaint is the service.  The people are rude and slow.  I personally remember a middle aged angry woman and a surly teenager.  But one of the waitresses draws eyeliner on her eyes to deceive me into thinking she has almond-shaped eyes.  Tricky, tricky, lady..."}
{"text":"Pretty good for carryout, food is usually ready in 15-20 minutes.  The portions are OK and I find the food a bit oily, but very tasty though certainly not gourmet.  Prices a little on the high side but not horrible.  I have been here once to eat in and it was a nightmare.  We were there for over 2 hours when we finally left, having not yet been served our entrees.  Appetizers had been served about 45 minutes after ordering them, but they were cold and soggy.    You could not pay me to eat in again, but I'm content to get carry out from here every couple months when I have a craving for greasy Chinese food since it is right near where I work.  Admittedly though, Hot Wok is a better value and probably where I would go if there was one closer to my home or work.."}
{"text":"Favourite Chinese restaurant in Chambana.  I've tried hot pot and some other traditional Chinese food there. Sometime the food is not so impressive but definitely above average. Love the roasted duck here!"}
{"text":"Excellent Chinese food in the Champaign-Urbana area.  Of course, the \"standard\" American-Chinese food is  offered, but one should try the authentic Sichuan cuisine or even hot-pot.  Fair prices, excellent balance of flavor, consistently high standards.  It worth the trip to Lincoln Square mall to eat at this hidden gem."}
{"text":"Really poor service!!!Really poor!!! Never Go! Never Go! My Worst Experience in my LIFE!!! RUIN MY DAY!!!"}
{"text":"The Quick Review:  Tang Dynasty is the real deal. Come here for traditional chinese dishes with above average service and expect to shell out $20.00 - 25.00 on a meal (including tip).  A more Detailed Synopsis: Tang Dynasty is now under new management. I can't really comment on how the food used to be mainly because the last time I ate here was many years ago.   With that said the food I received today was very well prepared and the presentation was spot on. It's obvious that the soup stock is made in house and not from a can. You can expect to pay somewhere in the 12-18 dollar range for entrees (mostly depending on how exotic the meat portion is). But don't worry, you'll have plenty to take home for a second meal.  Yes, you will find some \"classic\" American Chinese staples on the menu here. However you have to dig through 3 pages of the more traditional menu items  first and search around on the back of the menu to find them.  I ordered a hot pot of braised lamb in the Sichuan style of cooking (food prepared in a hot chili sauce made of dried chiles in oil). The heat wasn't overwhelming and accented the individual flavors of the food.   A friend and I dined here on a Tuesday around 6 in the evening. The place quickly filled up but the service was still very good, the waitress made a few passes to check on our beverages, and to ask how we liked our food. And even the host came by and complemented us on our dining selections.  Things to Know: Bring a shirt with a collar as the dress code is business casual. Silverware by request only. Chopsticks are the standard. Don't be put off by some of the more \"traditional\" menu items. Tripe, Kidney, Intestine, Frog, and Eel are all available. But you can still find more familiar items like Beef, Pork, and Lamb."}
{"text":"Service was slow and inattentive. Potions were small. Prices are outrageous.  Pass."}
{"text":"I always have had great experience in this restaurant. The owner is very nice and friendly. Beyond that,she often offers discounts to customers. The tip is fair for the hard work of the waiters and waitresses. The food is the best Chinese food I think in this town."}
{"text":"They have pretty authentic Chinese food. The sauces are neither extremely salty nor overpoweringly sweet. The price is pretty reasonable too. I've been there late at night a few times and they will had run out of some stuff. The owner will sometimes come talk to us - she is extra friendly if you speak Chinese :)"}
{"text":"I went with a Chinese friend who ordered in Chinese.  When one of the dishes arrived and she didn't like the look of it she then shouted a lot at the waiter (in Chinese).  After that the food was exceptional.  Easily the best Chinese food I've had in Central Illinois.  (I admit, that's a low standard.)  However, I've never been able to recreate this experience.  And how I've tried!  I ended up asking my Chinese friend to write me a note in Chinese ordering these same dishes from the Chinese menu.  I show the crumpled and worn note to the waiter when I go by myself.  But the food is never as good.  I expect it was the shouting.  Now that my friend has moved away, I expect it will never be that good again.  Without my friend to help us, this is a mediocre place."}
{"text":"I love this restaurant - you can choose from the traditional menu or American menu, so just about anyone will find something they like.  The prices are also very reasonable for the amount of food you get. I keep coming back to the dry tofu hot pot (soo good) and I can get at least 2, usually 3 meals out of it.  The owner is also very friendly! Highly recommended!"}
{"text":"wanted a box lunch without rice from the truck, and look what i got~~ a box with bland cold beef, cucumber, cold fried potato, and lettuce. what is this???? where are my hot dishes??? who eats these things on their own?? i didn't ask for a salad, i wanted a box lunch with legit food!"}
{"text":"Champaign, Illinois is an oasis of Chinese food (that Chinese people eat) in a midwest desert of gut busting, strip mall buffets and grimy takeout joints. Tang Dynasty is a pretty decent Chinese restaurant stuffed in an otherwise unremarkable decaying urban mall.  First: the restaurant is small. There is a \"banquet\" dining section on the interior of the mall while the bulk of the restaurant faces the parking lot. This is a big deal if you're planning on bringing your entire kickball league to lunch but otherwise it shouldn't be a problem.  The food here is really good. I've never eaten off the generic takeout menu but their authentic stuff is delicious and quality is comparable to solid restaurants in other, bigger parts of the midwest. Their braised pork knuckle in particular is well done and contains the richness of the skin as well as the tender pork from the rest of the hock. Another good one is their spicy fried chicken bits, which are served showered in a sea of fried red chilies. Tang Dynasty is a good choice if you like affordable and reasonably authentic Chinese food."}
{"text":"There are better Chinese foods at lower price on the other side of the town. I do not know what gold medals taste like but it can't be far from their gold medal ribs. My mouth hurts whenever I think about their food."}
{"text":"They had two menu and the price is different !!! They gave you the cheaper menu, but they charged you for more expensive menu.??????? ??????? ???????? ????? ???????????? ?? ??????? ??"}
{"text":"This is my go-to Chinese restaurant. When I crave for something from my hometown (Beijing, china) I drive an hour from Decatur to champaign to eat here. The owner of the restaurant is super nice, and always grabs something from the buffet for my 2 yr old daughter. Highly recommend ordering something from the dim sum menu, and the Peking duck is to die for. Really authentic. I can see why some reviews say the price doesn't match up: it's because they automatically add the tip on there (18%). I've always got good service so I don't have any problem with that. And since I hate calculating tips, I actually like how they add it to the bill.   In all, this is a very good place!"}
{"text":"Not my favorite local Chinese restaurant. The interior looks so nice...but the atmosphere is slightly slovenly. The food I had was decent, but didn't have much pizazz. The menu is just a little boring. The service was also quite slow."}
{"text":"The price on the menu is cheated. When I argued about the misleading price on the menu during checkout, the owner became rude and personal. The owner of this restaurant doesn't take business honesty as a serious thing. The attitude of her is arrogant and impolite. My girlfriend and I had very bad experience there."}
{"text":"This is the worst Chinese food I have had in a long time.   I was in town at my Alma-mater for my little bro's graduation. This wasn't our choice, but a family friend insisted since they made a reservation already. Thinking everywhere is going to be packed, we agreed. We showed up around 12:30 and it was empty. Now this is graduation weekend in a campus town...AND it's Mother's Day. That should have been the first alarm. However, another two tables did come in around 1:30pm, and they were seated right next to us. When I say next to us, I mean our chairs are back to back (these are also big 8 to 12 people round tables) where I can turn around and breath on that other person's neck. There is no way I can get in or out.  The decor of the whole place is tacky. Bathroom had two stalls and one of them had no door. I don't mean broken door, the door is just NOT THERE. Only one do the sink is working.  Actually on decor, there is no such thing other than the gold dirty looking clothes on the table.   Now onto food. I dont even know where to start. I think we got like 8 dishes and nothing was good. This is not just my opinion but also the whole table's. It's not just the taste of the food. It doesn't even look right. Things colored is light looking, while light looking things are pitch black. For example, have you ever had shrimp fried rice that is dark brown to black? It had like 3 shrimp for display on top, the whole thing tasted like super hard rice drenched in soy sauce. And you can only taste the soy sauce. Most of the food are very oily or bland or too soy saucy. Not one item was good. Who can mess up green onion pancake? Well they can. It was hard and thick and had no green onions.   Do not go to this place if you are ever in town. I would stick to Mandarin Wok, where it has always been good since I've had it first in the year 2000. I heard Lao Si Chuan also opened a store now too, just a much longer wait.  Or if anything, Panda Express is much better than this place."}
{"text":"It was my WORST experience in my life. I wish I could gave zero star on it. I ordered a fish and it tasted really bitter. When I was complaining with my friend that the fish was bitter, the waiter heard it and said he would talk to chef and replace a new one. I was surprised about how kind he was. 5 minutes later the chef came to my table angrily and was YELLING at me in front of other customers \"are you lying ? I tasted the fish before it got served and it was not bitter.\" I was eating with 6 friends and it was just so sudden. I was so embarrassed and almost crying into tears. I was NOT lying and your fish is bitter! I'll never been this place ever ! The worst service I've ever had."}
{"text":"Never seen slower serving speed. Sat and waited there for one whole hour and no dish was served. Left swearing we would never return."}
{"text":"Food quality is way below the $10-15 price for each entree. The sauce I received was 1/4 of the container full and the food portions are much smaller than usual. The normal Chinese food take out containing but only 1/2 full. Delivery time was prompt(~30 mins) but the food definitely does not taste good."}
{"text":"Came for lunch, stayed for the amazing service! Came in expecting a regular Chinese dining experience (decent food, decent service) however, when I walked in, I was greeted by two very kind and polite waiters. They seated me, and my order was taken a couple minutes later after I was served an ice cold mango juice. The dishes are great. I had bao, fish, spicy mushroom combo (highly recommend) and Peking duck (highly recommend). service was great! My cup of juice was never empty, and waiters kept checking in on how j was doing every couple minutes. All in all, I will be coming back!"}
{"text":"I was suckered in with their smoothies, which were made with real fruit. I've tried their strawberry pineapple & mango flavors. So refreshing on hot days! As I was sipping a smoothie & feeling a little famished, their friendly staff member told me about the lunch buffet. Being a mediocre cook & lazy person, I acquiesced to their prompting. The buffet was decent. It wasn't overly salty as these things tend to be. A drink (iced tea, lemonade) is included. There was a nice variety of appetizers (e.g., egg rolls, crab rangoon), entrees (e.g., pad thai, lo mein, cashew chicken, chicken wings), a soup (egg drop), and fruit/desserts (e.g., watermelon, oranges, red bean sesame balls). For $6.59 per person, this was a pretty good deal. I left happy & satisfied until I wandered out into the sweltering heat & had a sweaty bike ride home."}
{"text":"food is okay but not impressive.  The price is high. Tip is enforced no matter how the service is . I do not think it at all"}
{"text":"Location, Location, Location.  This place suffers because its in the tomb known as Lincoln Square. If you are lucky enough to have a seat where you can see the mall \"activity\", it will be homeless men, mall-walkers, health insurance mega-corporation employees, and an occasional congressman. When you add to that the fact that the service is horrible, the decor dingy, and the food sub-par, you get two stars from me. This community hosts the nation's public university with the largest enrollment of Asian students, over 6,500 Chinese and Koreans.  So we know and respect good Asian food.  This is not good. Its oily, trite, and nothing unique about it. Getting a pair of chopsticks in this place is more difficult than asking for them in McDonalds. I am only refraining for one-starring them because the food improved the most recent time I was there and I have hope for the future. Avoid the Twice-Cooked Pork because it is white and steamed, instead of the dark sliced pork typical of the dish. Avoid the fried rice because it is just white steamed rice with soy sauce and grease poured on it."}
{"text":"Amazing food, and highly recommended, but only if you don't mind being asking over and over and over again if you are sure you want to order the dish you request, and to have other suggestions thrown at you.  My SO and I come here fairly frequently and the food never disappoints, but they never cease to question everything we order. We are frequenters of the Chinese hot pot, and every single time we order it, the server says they do not recommend it, and will suggest something else. Then once we finally get through that we are in fact capable of ordering what we want and do receive the hot pot they warn us no less 15-20 times that it is extremely spicy. Perhaps they have been burned by not warning folks in the past but it becomes over bearing almost to the point of it being a joke. In their defense I am a spicy food fanatic, but this hardly registers a 2 out of 5 for me so the warnings just seem silly on top of them suggesting constantly we order something else.  We will still frequent the place and recommend it to others, but if you aren't planning to order white rice with a glass of room temperature water, for whatever reason be prepared to have to convince your server that you are certain you know what you yourself would like to eat that day."}
{"text":"The pork buns from their food trucks are cheap, filling, and pretty good!"}
{"text":"I visited this place after a year. The quality has become much lower than what I experienced in the past. The whole plate was filled with white rice, with very little veggies and chicken (perhaps 2-3 spoons). I just had to eat dry rice, which were also overcooked. It seemed the management is trying to save costs by cutting the portion size, while charging the same price. Next time I will pay more at a different restaurant, which does not try to compromise with quality and portion size. I was so unhappy with their service that I did not pay tip. But later I saw that they added $1.00 to what I had signed on the receipt."}
{"text":"Dinner for three last night. We stuck to the authentic Chinese side of the menu, and on the waiter's recommendation ordered one dish for each of us: half duck no bones, potatoes/eggplant/peppers, and spinach in garlic sauce. The duck was good though the \"pancakes\" were cold. The spinach was acceptable (and looked like a popular dish, considering how many other tables were ordering it). But the best thing hands down was the eggplant dish, which had the best sauce I think I have ever tasted. You will like eggplant after trying this dish! There was plenty of food for all of us, and we even took some home afterward; the vegetable dishes are large portions. Price was totally reasonable. Only real complaints are that the \"hot\" tea was barely warm, and that we had to flag down our waiter to bring the check, even though we'd been sitting over empty plates for quite a while."}
{"text":"If this place were in Chicago, I'd give it a 3.5 star. But since it's in Champaign, it automatically gets a boost.  Ordered the peking duck. It was nice, but the duck needed more flavor. They don't give you enough of the white chives and cucumber, as well as the wraps and poison sauce in proportion to the duck. The duck was pretty fatty, but that is just the nature of ducks. However, they could have scraped off the fat and cut the meats more uniformly. You can't expect that level of detail in Champaign-Urbana though. Skim was crispy. The soup that came with my order of duck was pretty bad, basically could have done without the soup. Wish they'd serve a fried rice or something with the duck.   Also ordered the sauté beef. The beef was tender, but I expect nothing less, since most Chinese places do tenderize their meats. But they did not give enough rice. The rice came in this super small bowl. Once again, they did not think it through properly on how much rice needs to go with the dish.   Our server never came back to check on us and ask us how our food was. Never refilled our water. It was hard to get her attention when we needed something. She was accommodating and nice, but at the same time she was also the only one working there. This restaurant was pretty empty for a Sunday dinner.  They also have hot pots here. What I did not like was that their aquarium of live fish, some of the fish were already dead. This is pretty cruel. All of their food need an extra kick in flavor. Not bad, a bit better than average but could be better."}
{"text":"We went with someone who was a regular here and they pre-ordered a lobster for us.  We had a 7 pm reservation and arrived at 7:10 pm.  We sat down and the lobster came out right away.  Yay!  Unfortunately, it was cold and apparently was cooked earlier in anticipation of our 7 pm arrival.  Boo!  Who cooks a lobster before the guests arrive?  What if they don't show?  Then the owner blames us for being late!  And then we found a few pieces of pork in the lobster.  What?  The rest of the food was ok.  The braised duck was delicious but small portion.  The ma po tofu was good.  Stir-fried bok choy hearts were good.  The stir-fried beef was over tenderized and boring.  We ordered braised fish that came out steamed.  Again some pointless explanations and the fish was replaced with the proper braised fish.  Oh well, a wasted night out out for dinner except for my fortune cookie.  \"You will inherit some money or a piece of land.\"  Good for me, bad for someone else."}
{"text":"Terribly expansive, twice the price of other similar restaurants. The service was horrible----they forgot one of the entrees and was really rude. Finally, they put the tip onto the bill...KEEP OUT OF THIS PLACE!"}
{"text":"It's a great Chinese restaurant with good service. Menu is always updating and they just had a all new dec."}
{"text":"Ugh.  My fiance's grandma loves this place so we took her out for dinner one night.  It was freezing in there, she's 92 years old, we asked to be seated somewhere warm and they put us right under the AC vent.  The food is mediocre at best and very greasy.  The prices, however, can't be beat.  Its incredibly cheap, so if you're a college student this is the place to go - literally, get it to go because the atmosphere is terrible and the waitstaff are extremely apathetic,"}
{"text":"Hmmm maybe I came on an off time because my service was quite good, although I was also one of the few tables in here.   Before I came here for a visit, I was looking at a New York yelper's food blog. Strangely enough she was talking about where some of the best Chinese food and that it can be found in the strangest of places. She mentioned this place, I knew I had to stop by to try it.   I really liked this place. Prices were very fair and the portions were just enough to make me full but not stuff me. I came here for lunch and had their ginger chicken and asked them to make it extra spicy. I started off with their egg drop soup, which unlike many that I have had, didn't need me to add extra salt. My ginger chicken came out, for a lunch portion I was very happy with the portion I got, filled with veggies, a slightly sweet and spicy sauce paired with  the fried rice I chose which was just okay. For a filled tummy, cute although some what hokey decor, I left and I was a happy man."}
{"text":"Food is oversalted and over priced. The boba in the bubble tea are like little pebbles."}
{"text":"Great to have another solid and authentic Chinese restaurant in the area! Prior to eating here, I hadn't had traditional Chinese food in quite a while so it was very refreshing and much needed. We came to Tang Dynasty mainly for the Peking duck, although we ordered quite a few other dishes as well. The Peking duck was pretty good, definitely could have been a better skin-to-meat ratio. There were lots of pieces of meat, which is good, but Peking duck is all about the skin. I enjoyed the thin \"tortilla\" like pancakes served with the duck since it's been so long since I've had Peking duck with that as opposed to bao. Other dishes I really enjoyed were the spicy Szechuan crispy tofu and the steamed fish. The steamed fish was very traditional with the oily sauce and cilantro and hit close to home as I grew up eating that kind of fish in restaurants. Among the dishes that were just okay and pretty standard fare were the beef chao men and salt and pepper beef with bell peppers. At the end of the meal, the red bean fried sesame balls were a nice touch. Overall, I had a very solid meal at Tang Dynasty and would definitely return when I'm in the mood for traditional Chinese food in a nice setting."}
{"text":"Indigestion.  Took over an hour to get food delivered. All fried food was greasy and tasted like fish. The Orange chicken was gummy. The Moo Goo Gai Pan was gelatinous.  So disappointing.  Could have been so much better."}
{"text":"I went here with a Chinese friend upon his recommendation that this was the best authentic Chinese restaurant in the CU area. Authenticity with Chinese food was never a big concern to my Americanized palette. But anyway I decided to experiment in an attempt to tame my friend's fanatical adoration for this place, putting his claim to a test.  As soon as I stepped inside, I felt I was in China. Waiters speaking very broken \"engrish\". White skin seemed the rare exotic. The decor was nice, but could come off to some as being pretentious. So far so good, the authenticity cause was gaining pace. Food prices were moderate and the menu variety was ample. The wait for the food was long and trying for our hungry stomachs. It took a good 45 minutes, but I was told that this was as expected as the places was packed to the brim as it was a Friday night. My opinions about the food echo that of most other reviewers, fairly tasty yet very greasy. The food was so greasy that I had to ask for silverware, unable to grasp some vegetables with the chopsticks(also possibly due to my lacking skill at handling the eating utensils).  The waiter entirely forgot about my request for the silverware, tending to other customers. This didn't seem like a one off as I had to face the same asking for hot sauce and a water refill. Service to me is on the same playing field as the quality of food, hence the restaurant loses many points in my eyes on that front. Also given the fact that this place is tucked away near obscure Lincoln square Mall, I would probably never venture out there again. At least not in my soon to end student life."}
{"text":"worse than golden harbor, I think. Don't why my friends like it."}
{"text":"I love their food, but I strongly suggest getting it delivered. The service is horrible. The waiters are always very rude and pushy and try to rush you through your meal.  However, they have the best Chinese food I've had in Illinois."}
{"text":"Another one of the great choices for Chinese food in the Champaign-Urbana area. I think that many times this restaurant is skipped over because their cooking is a bit lighter and prices are a bit higher than other Chinese restaurants in the area. However, when they do cook well their food is just as good as Lai Lai or Golden Harbor. Like the other Chinese restaurants in the area, it seems you should come here when they are less busy in the day so the chef has more time to concentrate on perfecting your meal. That way you will get to experience all the great textures that great Chinese chefs can create."}
