{"text":"We usually go there on week days taste everything is good but we went back on Weeknd. It's taste different it was so so.I guess go there on week days better."}
{"text":"Ok after careful deliberation I am a fan of Tao's..   I like their Beef & Chinese Broccoli.. But my favorite is the Mongolian Beef and their BBQ Pork slices.."}
{"text":"Came here on a Friday night and we were the only ones there...  Oddly, once I told one we needed a few minutes to order another one popped up asking if we were ready to order.....ODD !  Hot tea is very basic !  Ordered the rainbow tofu dish ( mixed veggies with tofu and mushrooms ), singapore chow fun and some seafood dish my mom got. I ordered a veggie singapore with no egg and what comes out...eggs all scrambled with in it. I was disappointed because I stressed it to the several waitress' we had.   Once our food came, they all strarted to mop all around us....a weird pet peave of mine. Restaurant wasnt closing for at least another hour but felt so impelled to start cleaning as soon as our food came out ! Grrrrr  Plenty of seating, alcohol license, big family tables with the lazy suzy in the middle ( I loves those tables ), and typical asian decor."}
{"text":"I used to love this place but it really went downhill. It took an 15 minutes just to get the menus and another thirty for the first dish to arrive. We saw a waitress but she said she wasn't qualified to take our orders and left us. Took another half hour for the main dishes to arrive. The food was okay but not as good as it used to. We finished the food in 30 minutes but stayed for another half hour because nobody would give us the check."}
{"text":"I've been craving for roasted duck and thought I had to drive all the way to the Chinese Culture Center in Phoenix, Tao Garden was only a block from where I live lol. Thank God . So we ordered half and stir fry fish so I thought it was fried ( my fault I didn't confirm it with the cashier) anyways for 19 bucks can't beat that price I used to pay close to 20$ in Phoenix for a half duck. The only thing I was a little unhappy was customers service a waitress(old lady with short hair) she just never smile and just gave me this rude look like I I owe her money I didn't appreciate that even when I smile at her just a staring look. Very rude. And they really need to learn how to speak with customers in a professional manner. The employee need to take English class to help with their speaking skill. Smile to your  customers really make us welcome there with a pleasant warm welcoming. I hate walking to most of the Chinese restaurants and they all look at you like you owe them money."}
{"text":"Authentic chinese cooking. Family run place."}
{"text":"Beware of the drunken male owner with violent temper and a potty mouth!   The food,  female boss and staff are very good. Our favorite are house special tofu, dry sautéd green beans and beef ginger oyster sauce hotplate.  However, beware of the male boss when you are there with little ones.  I brought my kids there recently and totally regretted it.  The male boss cursed when we asked for the tapioca dessert.  The waitress said something to him and he went on a loud cursing rant,  calling her the B word and screaming the F and S words many times,  all the while customers with little kids were there... It was horrific.  I will not dine in there anymore when the male boss is present.  He seemed intoxicated and violent. Don't go there if he is around.  I would call ahead of time, to make sure he is not there."}
{"text":"While I agree the male owner is a bit of a problem, the rest of the staff are always good to me.  Food is great, free of msg.  Price is also reasonable and cheaper than Phoenix Palace."}
{"text":"I'm impressed! If the eggrolls were better it would be a 5 star! Eggrolls are more like spring rolls. Chicken Chow mein was AMAZING Pork fries Rice was very delicious Sweet and Sour Pok was very tender and not too much bread I LOVED it! Moo Goo Gai Pan was great tender and wonderful sauce. I asked for no celery and no water chestnuts and the followed that direction but they forgot the snow peas and the carrots so ut was only chicken and mushroom in sauce Still good though! Crab puffs were pretty good kind of hard but flavor was good. Sweet and sour sauce was good too. They are open pretty late for dine in or take out. Place was clean and staff was friendly! Great for Big parties too!"}
{"text":"Mmmmm, best Chinese food around.  My family has been going here for years; a diamond in the rough.  Super-delicious.  On my way there now to pick up food for my daughter's b-day.  She got to pick from any restaurant in town... what does that tell ya?"}
{"text":"Food was okay. All the dishes there are good. However, the owner is insane! When we walked in, my brother wanted to look at the fish, then the owner stopped and yelled at him cursing and completely ignoring my family like we weren't there while on the phone. Honestly I think if he keeps doing what he's doing, business is going to go out soon."}
{"text":"In this area, there are many good options for all kinds of Asian foods. Tao Garden is my favorite by far. I've been eating here for over a decade. My favorite is their Black Pepper Steak. They use filet for this dish and it's scrumptious. Not a cheap greasy Chinese joint. They take pride in their food."}
{"text":"So, I don't want to stay this place discriminates against non Asians. .but it seemed that way. My family and I went for dinner. It wasn't busy, and I was meaning to try this place. After placing our order 2 Asian families came in and placed orders.Bad idea! In a hour of placing our order we only received the Egg Drop Soup an 32 minutes into the waiting for entrees. We then got egg rolls 45 mins in. Then finally after seeing all the Asian families get served food and talked to we left after no food at the hour and 15 min mark. Horrible Service. Poor customer service. It truly made me sad that we got discriminated against."}
{"text":"Tao Garden is great.  It is one of the best family-style, Chinese restaurants in the East Valley (along with Best Hong Kong Dining in Mesa).  The quality is great and so are the portions and prices.  It reminds me of any of the authentic, decent Chinese food restaurants that I grew up with in the Bay Area.  I would highly recommend Tao Garden if you are looking for something other than Panda-Express like, American-style Chinese food.  (BTW, I had no idea what a crab puff was before I moved to AZ., and so I thank goodness that I found a place like Tao Garden before too long)."}
{"text":"This place is awesome. Great FRESH food without any MSG. Good prices and great service I will Definitely be going back"}
{"text":"Shocked, really.  We were regulars at Tao Garden until it received a health violation.  Believing things had been corrected, we returned after a few months.  Food was wonderful, as always, and we felt like all was well.  However, we soon felt threatened by the owner  who yelled the \"F\" word and \"B\" word at my cousin and me.  When this man kept interrupting us with comments that had nothing to do with the food or place, my cousin nicely said, \"Excuse me, we'd like to talk  privately.\"   He screamed obscenities at us and then threatened to turn down the a.c. \"so we would freeze.\"  We do have some pity for him, as he clearly doesn't seem mentally well, but we felt unsafe. He kept swearing about us as he returned to a table near the counter.  We told him and  his staff that we'll never  return.  We won't."}
{"text":"I would never come back to this restaurant again, the food is terrible and salty, especially their Thai Fried Rice it has raw egg smell and you have to pay extra if you want a to go cup."}
{"text":"The appetizers here are very good - both the crab puffs and the potstickers were solid.  The entrees are less so - the garlic chicken was okay but not great, the moo shu was meh. Huge chunks of veggies in the moo shu made it hard to eat, actually.  I also had the sizzling rice soup, which was pretty good though the broth could use a little more richness."}
{"text":"I've been here twice so far, and it is pretty good. Amazing service, and great atmosphere. I would have given them 5 stars, but the General Tso's chicken i was in search of was not that good."}
{"text":"I ate here a few years ago and did not care for the food at all. So many folks who know Chinese food raved about it we went back the other day. My opinion of the place soared. We had a shrimp vermicelli dish in a clay pot that was fantastic. The mixed veg was just ordinary. The service was fine and the atmosphere vintage Oriental."}
{"text":"This place has the best Chinese food, but the service is not very good. If the service was top notch, I would have given this place a 5 Star."}
{"text":"Dined here last Friday night.  I know this is considered one of the better Chinese restaurants, but I am struggling w/ a 2 vs 3 star rating.  The eggrolls, pot stickers were good.  Pot stickers are actually quite stuffed.  I got one of the chow mein dishes w/ the noodles done Hong Kong style, fried.  The dish itself was fine, but the noodles were weird.  Part of them looked like they had not been put in oil and fried adequately...they were dried and stiff.  I pulled that bit out onto my extra plate.    The daugher liked her Kung Pao chicken.  Hubbie's shrimp dish was good too, but the broccoli ringing the dish could have been cooked just a little bit longer...it was pretty much raw.  Table was a little sticky.   Ultimately, I felt I could go to another chinese restaurant and have a similar meal, maybe Tao would be slightly better?  Or Tao is slightly worse?  I can't get past those noodles.  Yuck.  I think ultimately if I'm in the mood for Asian, I'm not gonna go the Chinese route.  Go to asian for me right now is Anise."}
{"text":"Tao Garden is one of the gems of Phoenix, AZ. I am originally from San Diego but traveled different places trying different Chinese food in each city. The reason why I love this place is because of the low standards each Chinese restaurants raise in the Phoenix area. With that considered, Tao Garden is the best. There are some Chinese restaurants you go into and for a decent meal overpay by a large margin. However, there also really cheap Chinese places where the food smells like it has been in the fridge for a couple weeks. Tao Garden provides a decent meal while serving at a really low price. It is not the BEST Chinese food I have tasted but I am so appreciative of this place. That is why I am giving this place 5 stars! In the midst of horrendous Chinese food in the Phoenix area, Tao Garden has provided the two tier demand I want from every Chinese food-good meal at low price.   Try the sweet and sour pork, beef chow fun with black bean sauce, honey walnut shrimp, and duck. (I know I order like a gwai lo, but my goodness this stuff is like heaven!)"}
{"text":"A restaurant only needs one 5 star dish to get five stars (IMHO)- and at Tao Garden that dish is the Peking Duck with steamed buns, made to order. Hoisin sauce and green onions and crispy duck fat-- what could be better?"}
{"text":"not a fan. Ordered the lunch special and it was barely eatable.  I would've sent it back but I was being nice. Won't be back."}
{"text":"Food is excellent there.  I LOVE the beef chow fun.  One of the best in town.  Staffs are friendly and quite speedy when place an order.  Sometime I bring friends and families there for lunch or dinner.  I would recommend this place to Chinese Food lover."}
{"text":"I love this place, it is a bit gritty but wonderful. I am not Asian but lived with first generation Chinese for many years. This is how we ate at home. I order off the menu items all the time. They are very accommodating. This is not fancy and if your looking for great service this is not it.  It is however a great place to eat and enjoy a great meal. It reminds me of being at a family's house. It is warm and full of life. I have eaten everything here and do recommend all the food, try something new."}
{"text":"I decided to try out this place for dinner. I ordered the Peking style roasted duck and beef chow fun. Both dishes were good but the only thing I need to gripe about is the Peking duck or more like the lack of Peking duck. They only brought out the skin of the duck and there was no duck meat. The dish that we got only consist of the buns, duck skin, scallions and sauce. What??!   At other restaurants like Hong Kong Gourmet on Dobson they give you the skin and the meat. I asked the waitress and she said that's all it comes with. Needless to say this dish will not be receiving another review next time. Also the food took at least 45 minutes to come to our table, and I notice it was like that at the other tables as well. I'm not sure if I will be giving it a second chance next time around."}
{"text":"Always trying to find the ultimate Chinese restaurant in the Phoenix area so here I go again.  Good reviews on Yelp led me here so i was surprised that on a Saturday evening about 6PM, the restaurant was rather empty.  It's a clean restaurant with many tables and a few booths.    We ordered Chinese broccoli with garlic sauce which we like much better than American broccoli, salt and pepper shrimp (spicy), chicken fried rice, and orange chicken without breading.  The food took a long time so I knew this would not be recycled food, LOL.    The broccoli was crisp and nicely flavored, but a little on the salty side.  I noticed the garlic were little tiny pebbles so I knew the garlic was not fresh, but rather out of a jar.  The chicken fried rice was plentiful and had generous pieces of chicken in it.  Unfortunately, the pieces of chicken were unseasoned and had no flavor.  The salt and pepper shrimp was a generous dish, 14 shrimp in all and perfectly cooked.  But this dish also lacked seasoning.  Needed more spiciness and salt.  The server said it was spicy so I assumed the spiciness would be discernible. The orange chicken dish was also generously portioned, sweet and nicely spiced.   Of all the dishes, I enjoyed the chinese broccoli the best.  The pricing is very moderate here giving you a good bang for the buck.  However, we were not impressed enough with the food to return with so many choices available especially in the Chandler area."}
{"text":"Peking duck was crispy and delicious! It was served with soft, warm buns, hoisin sauce and fine green onion threads, only thing missing was the cucumbers.  Also wished they had the option of having it served 2 or 3 ways (ie. Soup and stir fried noodles)"}
{"text":"We love this place! Good food every time we go. Nice, attentive servers. The egg flower soup is awesome, as is the bbq pork fried rice. We always get soup, rice, and 2 entree plates and leave with leftovers. Yum!"}
{"text":"We love getting take-out from this gem, occasionally eat there. When we go there, the service is very attentive and quick.  The food never disappoints dine-in or take-out.  We have tried many items there, mostly vegetarian. Our favorites are sweet and sour fish, thai fried rice, eggplant in garlic sauce, and the sauce is amazing, if a little greasy, broccoli in garlic sauce. They give large take out orders on crates so its easy to care out and reduces spillage.  also to be mentioned are the cheap cocktail and beer prices. cant wait to go again soon."}
{"text":"The staff here is always friendly.  They're always on the ball with the drink refills.  You'll get good food for inexpensive prices here.  I've eaten here and ordered off of the lunch menu and dinner menu.  I really haven't had a bad meal at Tao Garden.  We've gone here a few times and had dinner for about 18 people and only spent $140, including tip.  You can't beat that."}
{"text":"Every year it is tradition in my family to go out to delicious Chinese food on Christmas Eve. A few years back our place of choice, \"The Shangra-La\" closed down. Since then we have been having a hard time finding a true replacement. Well...  Let me tell you, we found a replacement. Tao Garden is the new spot. The food was absolutely delicious, every single dish. Hands down the best Chinese food we've had in years. If you're looking for a new, relatively inexpensive Chinese restaurant in Chandler, this is the place.  Only one negative: they failed to refill our drinks too much, but it was not a big deal compared to the deliciousness of the food. We will be going here for years to come."}
{"text":"The food was good but the service and lack of manners by the staff is beyond horrible. They were rude and unkind and never apologized for getting the order wrong. Would never recommend Tao Garden to anyone. There are a lot of great Chinese restaurants that have good food and know a little about customer service!!!!!!!"}
{"text":"Good and dependable Cantonese food. Been around forever! Love the hot and sour soup, walnut shrimp, and Peking pork."}
{"text":"I have seen this place for years and I have always wanted to try it.  Today I stopped in with the kids and I am glad we did.  I had the teriyaki chicken with rice.  It has a lot of properly cooked vegetables and great flavor.  The kids had BBQ pork chow mein.  It had big soft noodles and the kids loved it and everyone commented on how great the rice was.  I have not been enjoying Chinese food lately so this was a great surprise.  The interior feels like a real restaurant too."}
{"text":"Excellent food. Teriyaki chichen is not what you expect it's  better. Sliced  pieces of chicken with vegetables in the teriyaki sauce. My favorite beef chow fun. Both excellent dishes and they have the best Hot and sour soup."}
{"text":"I ordered from here for the first time. I went in to look at the menu and place my take-out order. The staff was very friendly but you could tell they were overwhelmed by how busy they were. I placed my order and was told that the kitchen was backed up and that it would take about 40 mins for my order. I was ok with waiting,as it gave me an opportunity to go get my hair cut and come back. When I got back to the restaurant 40 mins later, it was like all hell broke loose. The people were running around like chickens with their heads cut off. There were customers in the dining room that looked just as hungry as they did when they I seen them 40 minutes ago and they still didn't have any food on the table. There were other takeout customers that called in and didn't seem happy that their orders were not ready. I knew that my order was probably also not ready and sure enough it wasn't.  The owner was in the dining room having dinner. He was a really nice guy and funny too. He went into the kitchen to check out what was going on and quickly came back out saying, \"it's all f$@ked up in there.\" I could only chuckle but I started to question if I made mistake ordering from here and began to worry that the food would not be good. 15 minutes later, my food was finally ready. I ordered general Tso chicken, Singapore rice noodle and egg rolls. They did mess up the Singapore rice noodles and gave me Singapore Chow mein but I didn't want to wait another hour for them to get it right, so I told them it was ok. I got my order an hour after i originally placed it. As I was walking out, I spoke with the owner. He said that he had surgery, so he can't help, he also said the best thing to do is call the order in and add 10 mins to the time they say it will be ready. I got home, again uncertain that the food would be good. To my surprise, the food was amazing. The best Chinese food I've found since moving to Arizona a few months ago. I'm giving this place a good rating, hoping that this was just a bad night for service; however, if it's business as usual, I'll take the owners advice and call ahead and add 10 mins to the pick up time. The food was worth the wait!"}
{"text":"my parents think this is the best chinese restaurant in town.  i'll give them that for the roast duck, which we order every single time.  clientele is mostly chinese, so read from that what you will. portions are big and good service."}
{"text":"I went here with a large group. The service was good, although they did have to \"auction off\" the food. The server didn't have any problem keeping track of the separate checks, which was nice.  The lunch specials are available on weekends, which is somewhat rare. It's an outstanding deal for $6.50. Mine included succulent sauteed shrimp with vegetables, an egg roll that was prepared perfectly, fried rice, and a cheese wonton.  The quality of the food was good. The price was right. The service was good. With 32 lunch specials from which to choose, I'm sure we'll be back for more."}
{"text":"We decided to try this place because of the good rating overall on yelp.  When we went in, we realized that we probably should have kept looking for another restaurant.  When you don't see any Asians in a Chinese restaurant on Saturday night, it gives you a pretty good idea as to what kinda food they serve.  Don't get me wrong though. We usually do like Americanized Chinese food.  But this place is not for us.  *Appetizer = mu shu pork with tortilla....the mu shu looked like pile of vegetable and meat scraps *Main dishes = oily.....too sweet....not a fan *Atmosphere = full of kids"}
{"text":"Service was poor. Many Asians seemed to receive good service while we waited over 15 minutes and never got our order taken despite mentioning our need to order to two wait staff. We left without ordering."}
{"text":"The food here is really good! The prices are really cheap and the portion size are enough to feed 3 people. The lady is SUPER nice, but she just needs to be more attentive..   I would come here once in awhile not all the time cause you can get really tired of eating the same type of foods.   In conclusion, the food was good, came out really fast. I would come here again."}
{"text":"I haven't had anything here that I didn't like.  It's a pretty standard Chinese restaurant."}
{"text":"I did not give them a 2 star for their food it was good i gave them 2 stars for their customer service. after ordering the waitresses stood behind my wife the whole meal making it very uncomfortable and after that i went to go pay the bill was going to tip with cash when they vocally and loudly called me out on not leaving one when i said i was leaving a tip to where the other patrons could hear. the customer service is bad and them trying to embarass me into leving a tip will be why i will not be going back."}
{"text":"Tao Garden had excellent service, it's great for a group, and I had no complaints about the food. When I had last visited, there weren't very busy. It was a Sunday afternoon. We had ordered fried tofu, Mongolian beef, some kind of garlic chicken, fried rice, eggplant, and some other dishes. Each dish was very flavorful, and also presented well.  Also, if you bring a large group there, and split the cost, you will get a lot of food for your  money. I believe that we had about 11 people, and possibly about 11 dishes."}
{"text":"I have been coming to this place periodically for over 12 years.  But I have not been here for about 2 years so I decided on getting some dinner and taking it back home for my family to enjoy.  When I arrived at about 5 pm yesterday, the same two waitresses who I recognize from my previous visits over the years were there and waiting tables.  But the cook and the manager/owner (??) looked different.....did the ownership change? --- I wonder.  I ordered five typical Cantonese dishes and take them home for dinner.  I guess I would give the food 3 stars.  Nothing exceptionally good; nothing bad.  The roast duck was a little dry and not well seasoned.  The beef bitter melon was tasty but the bitter melon was not sliced nicely, but was sort of chopped haphazardly.  I also ordered beef gailan (Chinese broccoli) and that was OK but the gravy was salty and heavy on the Haoyou (oyster sauce).  Deep fried tofu was good, but the char siu (sweet roasted pork) slices were pretty sad and not very tasty.  I also ordered some crab puffs for my wife who for some reasons likes that stuff -- they had no imitation crab in them, only cream cheese.  So at least I satisfied my curiosity without being totally disappointed with the food.  It was OK, but I will probably not be back.  There are other better Cantonese food places nearby that I can frequent."}
{"text":"I just moved to Chandler and was happy to see the many asian restaurant choices in the area :)  I guess being in the vicinity of Le Le's market is a good thing.  I've ordered take out from this place twice in the last week....LOVE their food!  It reminds me of SF style...more unusual menu options (plus the regulars) with a ton of flavor and spice.  I would definitely reorder everything including:  Shredded Pork w/ Garlic Sauce (delicious) Black Pepper Chicken w/ Scallions (fabulous) Black Pepper Beef Chow Mein (spicy!) Beef Chow Fun w/ Black Bean Sauce (big portion) Egg Rolls (perfectly crisp)  This will definitely be a regular spot.....the prices are extremely moderate with two entrees and four egg rolls at less than $20 :)  ***Update - I just increased this place to five stars as I absolutely LOVED what I ordered tonight***  Deep Fried Tofu Stuffed w/ Pork & Shrimp - a very unusual dish which I don't recall ever seeing on a chinese menu...FABULOUS!  Chicken Chow Mein - Perfect!  One of the best I've ever had...perfectly seasoned, not too greasy, delicious chunks of chicken breast, scallions, onions and cabbage.    Even their white rice is amazing...delicious, light & fluffy :)"}
{"text":"I came during rush hour for take out, was a 35 minute wait which I wasn't expecting with only one other couple waiting ahead of me, but the staff was friendly. The food was worth the wait!  incredibly fresh and delicious, great sauces. I got the mongolian beef and potstickers, and the portion was very generous for the price. The beef came with tons of onions which i love, and was surprisingly tender. I've been trying different places in the area and this is my favorite so far."}
{"text":"Love this place!  Best Chinese food in the area! I work in the area and love this place for lunch. They have great meal specials during the lunch hours and their food is made fresh and tastes great! They even make their crab puffs in house fresh!! A must try!! The owner is in often and very nice. This family owned restaurant is a hidden gem in Chandler!"}
{"text":"Since moving to Gilbert, we have tried so many take-out places and couldn't find a good one.  We had even started  trying buffets in the area.  We gave up in Gilbert and started looking in Chandler.  Our second try in Chandler was Tao Garden, and we felt like we hit a goldmine.    We finally found a place where everything is good.    Pros:  Affordable and pretty good quality.    Cons:  We did have a very long wait for carry-out, but well worth it.    It is a sit down restaurant, and they were very busy."}
{"text":"This is probably one of the better Chinese restaurants in the area. I live down the street, and given the myriad of quality Chinese places around me, this is still my choice most of the time. They've got some great authentic dishes, but still have your standard safe options for the less adventurous. They have fresh seafood and specials depending on the availability of ingredients. One thing I like about them is that the chow mein, fried rice, chow fun, and rice noodles here are priced reasonably compared to other places at around $5.50. I'm constantly surprised at how much consumers are gouged for rice or noodles that cost almost nothing. If I can buy a bag of rice for $10 and make rice for a small army, why do I get charged $8 for a small portion with some meat and veggies added. Thank you Tao Garden for not trying to screw us over.   In any case, the food here really is great and as authentic as you would want. I recommend the salt and pepper pork chop, the beef stew(not for the faint of heart beef eaters, i.e. tripe and tendon), singapore rice noodles, kung pao chicken, and curry chicken.   As I've said before, don't go to a Chinese restaurant expecting good service. You'll be disappointed almost anytime. Look for great food, and let the food speak for itself."}
{"text":"Tried this place for lunch today after reading that the lunch specials are large and cheap.  The woman that greeted us was rude, the decor was fine, actually kind of nice for a Chinese place.  It looks like a TGIF, where all the crap was taken off the walls and replaced with Chinese lanterns and dragons.  I had the spicy garlic shrimp.  It wasn't spicy, it was sweet, the flavor was decent, but there were only FOUR shrimp!  Not even four big ones, four little guys.  The plate was almost entirely onions and peppers.  The crab Rangoon was good, and the eggroll was good.  The fried rice was just plain rice with some egg in it.  My wife tried the Eggplant rice plate which was pretty good.  I'm not planning on going back."}
{"text":"It's become quite apparent that GREAT Chinese food is hard to find in Arizona... well... we've pretty much found it. This is one of two places we go and it's always been excellent. They have a huge menu and dinner specials for 2 or 4. The service is quick and the hot tea is quite tasty =)"}
{"text":"I had eaten here a few times and liked it. After today, I will NOT be returning.  First off the food was only ever \"ok\" but the lunch deals were great, so I wasn't too picky if I got eggrolls that tasted like they came premade and frozen...  Today, as my 5 yr old and I were eating, the place was empty except for a table of what seemed to be employees hanging out.  At that point I wasn't sure. two guys are talking loudly, having a conversation that seemed heated, when one of them gets up, starts aggressively and loudly spewing the N word and F bombs, repeatedly between other incomprehensible mumbling... He turns, *SPITS ON THE FLOOR* cusses some more and goes to the restroom. I was thinking, \"Are they going to kick this guy out, or is he a friend of the employees?\" I was actually afraid he was about to \"Start something.\" He comes out a few minutes later and continues with his N and F words, then disappears into the kitchen!  If the profanity wasn't enough,  his aggression was actually scary, and someone who WORKS IN THE KITCHEN, SPITTING on the floor in the dining area, has got to be the most repulsive thing I've seen as far as scary restaurant experiences go. What does he do in the back where no customers can see him???  I have worked in restaurants for years and have seen a few faux pas, but this was horrifying!  I really wish I had seen that before we ate! I still feel gross!"}
{"text":"Good Food. Good Prices.  We can't go too long without ordering from Tao Garden. They have authentic Chinese food that we like. They recently raised their prices, but still are quite reasonable.  Here are a list of the must have in no particular order: Steamed Chicken w/ Ginger & Scallions Mongolian Beef Peking Pork Chop (similar to Sweet & Sour Pork) Pork Chop w/ Salty Pepper Seafood & Sizzling Rice Sauteed Beef & Bitter Melon (a little bitter tast) Deep Fried Chicken Filet Steamed Fish"}
{"text":"By far the best Cantonese food I've had since we moved from NY. Good spare ribs, great service and family owned. Everyone should make an extra effort to come to this awesome place!"}
{"text":"I've eaten here many times in the past 10 years and they remain consistent and give good value.  The other evening we tried a \"new\" dish from them, something we have eaten in many other places - spicy eggplant with pork in black-bean sauce.  Lots of small narrow eggplant in a delicious sauce but the pork was difficult to find:(  We also ordered our favorite dish (from them)   Salt and pepper Squid!!!  No one makes it as good, no one.  Tons of deep fried breaded calamari with hot peppers and spices on a bed of shredded cabbage.  Tasty tasty tasty, tender tender tender, spicy spicy spicy!  Give them a try, you won't be sorry.  The place is clean, staff polite and efficient and have been there since I started eating there in 2006!"}
{"text":"Somewhere between 3-4 stars. I'd say this is one of the better Chinese restaurants in Phoenix. Decor/ambience is kind of old and unglamorous, but the food is pretty good and decently priced. We went on a weekday evening, so it was pretty empty and service was good. For a group of 6 plus a toddler, we ordered 1 soup and 6 dishes, which was the perfect amount of food:  * fish soup - not much fish meat, not really a fan of the chewy yellow stuff, but flavor was good * Mongolian beef - good, one of the best dishes we got, would order again (but you better like lots of onions) * honey walnut shrimp - yummy, big pieces of shrimp, not too much mayo * sautéed green beans - good, not too salty or overcooked * mapo tofu - just ok, not spicy enough, wouldn't order again * steamed whole fish - tender but slightly chewy tilapia, good sauce, would order again * fried salty pork chop - average/good  They also provide complimentary dessert besides fortune cookies: warm sweet soup with small tapioca pearls. It's tasty but very sweet and very thick. Looked like there was a red bean or two in there."}
{"text":"This is one of my favorite places to eat when I come to Phoenix.  I get weary of reading reviews taking shots at restaurants for not serving \"real Chinese food.\"  The standard is going to be different wherever anybody goes.  Chinese food here is not going to be the same in California and California Chinese food will not be the same as in any of the many cities in China.  They are all different among the various regions of that country as well.  I am a Chinese-American and my parents are from China.  We all enjoy Tao Garden.  The Peking Duck, Ma Po Tofu and Short Ribs in Black Pepper Sauce are my favorites.  The service is good, although it could be improved.  I've seen the waiters walk away before customers are finished with instructions for their orders several times there.    The restroom does smell bad as somebody else pointed out.  I think it's due to the floor drain in the middle of the restroom.  Sure, they could improve somethings but I go there for one reason and that is to enjoy a good meal.  I've never had a bad meal at this place and have always thoroughly enjoyed my Peking duck."}
{"text":"My family likes the food here, but it is definitely a hostile environment.  The Chinese male owner of the restaurant is a disrespectful person, not only is he rude, but he swears and make racist remarks loudly in the dining area where customers, families and kids can hear his every word. If he is around, this place definitely is not a kids friendly restaurant. I don't understand how such a person can run business with his attitude. But then again, he's not working or helping out there. He's only there to yell at his customers and staff.  He has major issues, very bitter individual.  No respect for others and definitely not for himself either. However, the lady owner and the staff are very respectful."}
{"text":"Really more like 3.5 stars... Here's why - All the food here is very good and very authentic and a good quantity for the price. The service has been bad 75% of the time I have been there/ The service and the bad decor is why it did not get a better rating."}
{"text":"All the food is amazing ! Our faves were chicken chow mein and spare ribs with black bean sauce !! Everything is delicious !!"}
{"text":"My family and I went. It smelled like pee. We waited 10 minutes for water. then decided to leave since the waiter kept walking by telling us just a minute. I'll never go there again."}
{"text":"Stephen took me to lunch here a couple weeks ago.  I thought it was gonna be nicer inside for some reason.  It was plain, kinda old looking.  The food was pretty good... nothing spectacular.  I had some spicy chicken thing.  I think Stephen had Cashew or Almond chicken.  It came with soup (it was ok, kind goopey), an eggroll (really gross) and a wonton thingy (good).   They give you quite a lot and its inexpensive for lunch.  I'm not dying to go back but its WAY better than chinese fast food, which I would rather die than eat.  Sorry but you suck ass Panda Express!  Can you say \"food poisoning\"?  Can you say \"been sitting there all effin day\"?  NEWAYS...  Oh, service wasn't great, but it hardly is at asian places - I'm not trying to be an asshole by saying that but I have experience with a few chinese/filipino grammas, know what I'm sayin?  Anyway... it was like whatever. HEHE..."}
{"text":"The food may not be bad but there's a guy with such a foul mouth there, which does not make it a kid friendly place.  That same guy was so rude to my kids; he even mumbled I don't like kids.  Our kids were not loud nor did they misbehave.  Now I remember why we did not patron this place for several years."}
{"text":"Nice staff. Okay food. Took forever to get my food. No reason to come back."}
{"text":"I just finished my lunch and thought I'd write a quick review on the place.  The food was really good.  The server was really nice...bit, she never once stopped by to see if I needwd anything.  That's unfortunate, because I thought the iced tea I ordered was awful and wanted to gwt something different to drink.  And then there is this old guy in here.  Owner? Manager? I dont know, but he definitely is part of this place.  Anyway, he was just sitting at a table and talking.  And, when he talks, he talks loud enough for the whole restaurant to hear.  That's not the problem.  The problem is that when he is speaking in English, every sentence is filled with profanity.  Could really do without that when I'm trying to eat."}
{"text":"Tables are so close You can sit at two at once. Cozy little place.  Menu not too large Just enough to have choices But not overwhelm  Server showed up quick Orders went in and out fast Good portion sizes.  Eggplant was divine Maybe too much fat on pork The beef was standard  MIA server Water's never on my mind Until it's all gone  Complimentary Dessert soup is fantastic Hot and sweet and warm  I have a feeling There are more menu items That I need to try"}
{"text":"I give this place 3.5. Definitely not as good as chinese food in CA.  Me and my friends came here yesterday for a Chinese New Year dinner at around 6pm. It was quite busy already, which was expected since it was CNY. However, they were still able to sit us down right when we got in. I was really excited because when you see so many Chinese/ Asians there, you know this place is pretty decent and non-Americanized.   We ordered: Wor Wonton Soup- it was good soup, but the meat in the Wontons didn't taste that fresh  Chinese broccoli with hoisin sauce- Very good. Didn't overcook it, but this is something kinda hard to mess up.  Peking duck- AMAZING. The flavor of the duck was very good and the skin was crispy. Loved the shrimp chips at the bottom. The bread was good. It was hot and fresh. Also, it wasn't too sticky either. It had a nice texture. (FYI: don't expect to get a whole duck as the point of this dish is to put the crispy duck skin in the bread)  Salted pepper fried fish- This dish wasn't as good as I expected. When I ate it, the fish was only lukewarm. The flavor was pretty good though.  Seafood and fried tofu hot pot- It had nice flavor and a lot of seafood and tofu. It would have been nice to have more vegetables though.  Peking Pork Chop: The sauce had a good flavor, but again the meat tasted old, not fresh, and lukewarm.   Overall, the best tasting dishes were the chinese broccoli and the peking duck. The service was slightly slow, but I gave them some slack because it was CNY and there were only 3 people working. I would have given this a 3, but since this was CNY and this is AZ, I lowered my standards a little and give them a 3.5."}
{"text":"This is one of my favorite restaurants. I've been here with my friends a few times and I've never been disappointed. I would recommend trying their seafood soup and beef chow fun."}
{"text":"I never gave this place a try, because the photos makes me think this is only for American Chinese food. Until a few days ago, I came to eat with my friends, and I realized they make authentic Cantonese food.  We ordered steam fish(????), chicken with green onions(???), beef with bitter melon(????), west lake beef soup(?????), etc. Everything was good, not 5 start good, but good compare to most of the Chinese restaurant around this area. It is now my top 5 Chinese restaurant to go around Chandler and Tempe area.  I cannot wait to try everything and forgot to take photos, only the steam fish."}
{"text":"Kung Pao, Teriyaki Chicken with veggies included in the dish, veggies (green beans) in garlic sauce. Sooooo yummy.   Free hot tea, unlike so many other Chinese places nowadays, too. Reasonable prices on the food, also.  AND they don't forget the forks, like some other places who I guess expect us gringos and mexicanos to know how to eat with chopsticks.  One negative. We are so glad they have sizzling rice soup, but it's seafood only; no chicken. My hubs doesn't like their version because he says the liquid has no flavor.  But, seriously.  Get the green beans in garlic sauce to share. So darn yummy."}
{"text":"I would give this place 4 stars as it is among the best in the valley.  Not saying much though as their are way too many mediocre chinese joints in the valley.   Since there is no Wanton Soup (huh?) I also had to take it down a notch.  The good parts are the Service is very good and for lunch it is very affordable.  Had the Chicken with spicy garlic sauce for $4.95 lunch special.  Huge plate.  Great Meal. Would go again."}
{"text":"Good food at reasonable prices.  They do not add MSG, but the food is still flavorful.  After being in China, if I want close to authentic, this is where I go.  I recommend the eggplant or string beans, plus the Kung Pao Shrimp is very good, perfectly spiced"}
{"text":"We've eaten here or gotten take out many times from here and I felt it was time to put my two cents in.  It is by far the best Chinese restaurant in Chandler area.  The food is very authentic and the menu huge.  Almost everything that we have tried is awesome.  Stray away from the Americanized dishes d try the unfamiliar like the dry sauteed green beans and stir fried snow pea shoots.  You won't be sorry. (unless you like the Panda- then you will not like it)"}
{"text":"It was okay nothing I would go out of my way for. I placed a pick up order and i must have been late picking it up because it was cold. The Chinese broccoli with garlic was really good but the wor won ton soup had a lot of dumplings but lacked meat and veggies."}
{"text":"The manager is being an ass. I was getting napkins and he started talking trash. He didn't talk politely."}
{"text":"Tao Garden is my go to for Chinese food, as I live fairly close to it and their prices are great. I've had a good amount of the food on the menu and there isn't really anything I don't like. A few of my favorites are their West Lake Soup, Hot and Sour Soup, Peking Pork Chops, Yu-Shan Eggplant, Black Bean Fish Fillet, Stir-fried Green Beans, and Curry Beef. They also have a great ginger, scallion chicken. Those are some of my recommendations. Not a fancy place or great service, but exactly what I'd expect from a Chinese restaurant, with the right tastes and gives me that \"home cooking\" feel."}
{"text":"Their website shows one price for the menu, but when i called to place an order for take out they said they cannot serve me for that price and I would have to dine in for that.  That is fine with me IF they would mention that anywhere on the website.    They wasted my time and tried to pull some sketchy maneuver to make an extra buck. I'll gladly eat at ANY of the dozens of other places in the area."}
{"text":"I'm a Chinese, American born, but I know real Chinese food because of my parents and grandparents who immigrated here and was able to grow their kids up on the real stuff.  Tao's food is great and for my Cantonese family we love the food here, which we give it a 5 star.  Now, does this compete well enough with the restaurants in San Francisco or Los Angeles, well, not quite, but it's as good as it gets here in the East Valley and it's reasonably priced, too, compared to the other Chinese Chinese restaurants.   And, no I do not consider Panda Express, Pei Wei, PF Chang's or the like real Chinese.  So, for Chinese taste buds, Tao is good and where you see where there are mainly Chinese people frequenting the place, it really caters towards the Chinese taste buds, rather than Americans.  Everything we get there is pretty good, which we get things like Honey Walnut Shrimp, various clay pots, pot stickers, Beef & Broccoli, steamed fish, Beijing Spare Ribs, Beef Chow Fun and then other dishes which I don't know the English names for (sorry).  However, the male owner of Tao sucks BIG TIME.  He is the rudest and most impolite owner I have ever met.  Whenever we come in and he's there, he is just an awful man and I don't know how his wife puts up with him.  I don't know if he's like that to all people or just to my family and I, but if there was another Cantonese restaurant nearby that served food just as well and the owners are good people, we'd stop going Tao ONLY because of how he treats us.  But, Tao has been in business for quite awhile and they have a good following.  It is the Chinese restaurant that my family and I go to the most often.    The owner has cussed at us before, using profanity and for no good reason.  Like, the last time, we asked where we can sit.  He yells at us and curses us.  Seriously, is that a way to treat paying customers who order a lot?    When my stepdad died, we held the luncheon there and spent a lot of money providing lunch to all our guests.  I cannot tell you how much money we've spent there over the years, but it's a lot.  And when I say my family, it means my siblings and their families, my parents and other friends.    The male owner can be overhead by other customers on the phone to other people and just being rude to them, too.  He really could use a slap in the face of how poorly he treats other people.  His wife, however, is a very nice woman, and so are the other staff.  Too bad they have to put up with his abusive behavior."}
{"text":"My wife and I have been coming here for years because we love the consistently good food and excellent prices. Their hot and sour soup is the best in the valley. I can't pass up their fish fillet with black bean sauce either. Also, the kung pao anything is great, along with bbq spare rips, pork fried rice, or any of the traditional Cantonese dishes. This is also our go to for to go Chinese orders. You can't beat their $5.50 to 5.95 lunch specials either."}
{"text":"This place has good food, it lost stars 1 for price and 2 because one of the ladies waiting on us knew no English....and pushed water on us (not physically) instead of just taking our order for drinks"}
{"text":"This is an update almost 10 years later. The owner hasn't changed, but the quality of service has gone down like free fall. Foods are tasty, but the attitude of the staff and owner are just not acceptable.   I would just take out instead of dine-in at the restaurant. I also don't want their white rice. They have history to put customer unfinished rice back to the rice cooker."}
{"text":"Ordered some delivery from Tao Garden today via Doordash, and I can honestly say that it's a goddamned shame I haven't been here in so long. The shredded roast duck noodle soup is an absolute treat, with a really pleasant oily broth and nice chunks of tasty duck. The XO beef with green beans was wonderful, with a perfect texture contrasting between the crisp green beans and the softer but flavorful beef. The seafood with XO sauce was a winner, with large pieces of fresh seafood (fat scallops, chunks of squid, etc) with a little bit of spice to it via some stir-fried chilis. The Singapore style noodles were also amazing, with a nice little amount of spice that made you want to just suck in a mouthful and fill your cheeks with 'em.  All in all, I'm really pleased with this place and I need to visit the actual restaurant again. I want to try some of that super-fresh fish!"}
{"text":"The food is good love the shrimp chow mein . nice inviorment and clean. Would recommend it to friends and family."}
{"text":"It's hard to find authentic Chinese food but this is close enough. Their seafood soup was good and the salt and pepper shrimp is awesome. Their beef chow fun is legit.   I'm not a fan of AZ Chinese food but it sure beats a 400 mile drive to California."}
{"text":"Amazing customer service.  I got the teriyaki chicken w/rice lunch special.  They had it ready for me to pickup in 15 minutes.  It was great and high quality.  I'll definitely be returning."}
{"text":"Let me start out by saying that the food here is probably the best in the south valley.  Service is very good also - the owners wife and other wait staff do a great job.  The reason I will never go again is the owner.  Twice we have been to the restaurant and he has been loud, obnoxious, and drunk.  The first time happened several years ago on Christmas Day.  He cursed loudly, dropped the f bomb many times however I thought well it's Christmas so maybe he was celebrating early.  The next time happened about two months ago.  I brought my three year old and my husband there for lunch.  The owner came into the restaurant and started cursing loudly.  I was so upset I walked up to him and asked him to stop.  The wait staff thanked me for saying something.  I will never go to Tao garden again."}
{"text":"Our family favorite restaurant in the Phoenix area  the restaurant itself is humble but has consistently delicious food and good portions! We love their fish & tofu dish and somehow managed to get it on every visit. My younger brothers favorite part Tao Garden is they provide a complementary sweet dessert soup at the end of the meal  it's a little too sweet for my taste but a nice addition nevertheless."}
{"text":"If you like Chinese food, you'll like Tao Garden.  It's standard, tasty Chinese food, and the menu is HUGE.  They have tons of different chow meins, lo meins, tofu dishes, seafood dishes and soups, so it makes it hard to choose.  The veggie spring rolls are delish and crispy, but it's kinda hard to screw those up if you ask me.  The sauce they come with is amazing too.    I didn't really have a problem with slow service as one of the other reviews noted either.  My server was pretty good, although he could have been a little more attentive.  All in all, I liked this place and would definitely come back for more.  Prices aren't bad and you can find coupons in the New Times every now and then."}
{"text":"For Arizona, a very good and reasonably priced Chinese cuisine restaurant. The beef dishes were tender and the pepper salted pork was tasty. I didn't try the vegetable dishes, but was told they were delicious."}
{"text":"Abusive, homophobic, sexist owner. Openly said homophobic slurs and cursed names at women employees. After hearing him say \"f*ggot\" several times in a hateful way, and him saying \"that's a b*tch and that's a b*tch, like all women\" and pointing to his employees, I asked him to stop. He then yelled at me so the whole restaurant could hear \"you can leave you f*cking b*tch this is a free country.\"   Shaking still from this interaction.   I feel bad for the women, most of them older women, who have to listen to him call them b*tches and yell at them all day. Not ok. Please don't support this homophobic and sexist business!!!!"}
{"text":"Far and away the best Chinese food in the valley. The Hot and Sour soup is the bar I judge all others by. Our favorite dishes are the Mongolian Beef, Spicy Garlic Chicken, and the Shrimp Lo Mein. The owner will talk your ear off but that is part of the charm."}
{"text":"45 minutes for a carry out order and they were still 15 late!  That's unacceptable regardless of how good the food is.  There are a ton of Asian restaurants and I can drive a long way in 45 min."}
{"text":"If this were closer to our home, it would be our go-to Chinese restaurant in the valley. My biggest quibble was the cheapo fork I was given, not substantial enough to cut the excellent eggplant in the excellent scallop and eggplant dish. The eggrolls while thinner than I like were nicely filled. The hot and sour soup was more to my taste than to my wife's but both of us thought it flavorful and full of interesting ingredients. This place isn't fancy, but for Chinese it fills the bill."}
{"text":"Returned to Tao Garden for the first time in a while. I was so bummed.  This used to be our go to Chinese dinner spot. As I mentioned my dad is from Canton, China & good Chinese food is an important thing in our world.  Was just underwhelmed on so many levels. We had a series of dishes (Chinese fried chicken, roast duck, salt & pepper pork, tofu/bak choy dish, greens, veggie chow fun, beef chow fun, seafood soup).   Didn't think anything was stellar and so many of the dishes paled in comparison to previous experiences.  I'm a big fan of chow fun. Just didn't really make an impression. We've also had great fried chicken & roast duck here in the past but they weren't executed well.   Could just be a bad night but didn't feel like it. Not sure that we will be racing back soon. : ("}
{"text":"3.75 STARS*  My family always seems to stop by this little restaurant every time we drive through Phoenix. This place used to be extremely busy but the last couple times it's been kind of slow :( On a positive note, the servers are more attentive and they seem to be paying attention to small details that were once overlooked.   The food here is consistently good, not California Chinese restaurant amazing but still pretty delicious. It reminds me of something my parents would make at home. Portion sizes vary from visit to visit, however it still within reason for their cheap prices.     Overall, I've had numerous good experiences with food and service at this restaurant and will continue to come here."}
{"text":"Great authentic Chinese food.  Very good price.  Very good portions. I would recommend this restaurant to friend and family over any other Chinese restaurant in Phoenix valley area."}
{"text":"I was there a couple of years ago, walked in , sat dawn, got up and left. The reason was the attitude we got from the female waitress, felt like the owner. She was very rude and unfriendly. I just asked if they had different menu for Chinese customers, the woman threw the menu on the table and very loudly answered \"What Chinese menu? This is the menu!\" I got up and told my husband \"Let's go!\"  This weekend, when my friend asked me to join them for dinner in this place, I firmly answered NO and asked her to reconsider. They went. She told me afterward that she really should have listened to me. They didn't get their water refilled and the owner complained about the 20 percent tip and said Chinese are cheap. Well. well. there are choices, don't spend money buying unpleasant experiences and bad attitude!"}
{"text":"Sorry, I had to subtract because I came in here for lunch with a coworker.. we ordered at the same time.. his meal came out quickly.. mine did not. My plate came out about 10 minutes after his.  Yesterday, I brought my roommate in for dinner. Again! his meal came out first, and mine was late! Only 5 minutes this time.. but still. Neither of our meals were anything special. I had the roasted duck. Menu say half duck.. I got part of a thigh, and more bones than meat on my plate. My buddy got a seared lamb dish which he said just did not taste good. Step Your Game Up Tao Garden.. I will be back to check on you for lunch someday-"}
{"text":"This place is a joke. I ordered eggplant and chicken but had to pay an up charge of a $1 for the chicken. I get it back to my office just to have 7 small minced pieces of chicken in my dish! I wish I had taken a picture because it was unbelievable. I returned to the restaurant to show them and the lady at the register understand my frustration but the owner was yelling at me like a red headed step child. She said \"what do you expect for a dollar?!?!? I said CHICKEN! I told her I would've gladly paid more money for chicken but at least inform your customers a $1 doesn't get you chicken but literally a piece of chicken. All I wanted was chicken in my dish, is that too much to ask for?!??? The owner kept yelling at me with her mouth full, disgusting!"}
{"text":"Came here for dinner with 11 in our party and everything was excellent.  Had Peking  pork chops; green beans;  whole steamed chicken with ginger and garlic chicken; sauté fish fillet;  shredded pork with spicy garlic sauce;  salted fish and chicken with tofu;  broccoli beef;  and seafood and fried tofu.  Food came out fairly quickly;  service was much better than average for a Chinese restaurant.  Decor is a bit dated."}
{"text":"Very disappointed ... Horrible service! If this was our first time here we would not ever be back. We will never come on a busy night again. The waitress actually actually told us to serve ourselves. Good thing the food is good."}
{"text":"I've been coming here for years.  It's always a treat to stop by Tao Garden for dinner.  The decor is that of all Chinese restaurants so don't expect to be wow'd.    While my family normally gets the \"set\" dinners but if I stop in with friends, we normally just choose a few items from the menu.  Some of my favorites are the walnut shrimp, the crab with ginger and onion, Peking pork chops, and the Peking duck [ although be warned, they only give you the skin with the buns and scallions --- no meat :( ].  The service here is pretty decent.  Some nights are better than others but I attribute it to how busy it can get during the dinner rush.  The waitresses are always nice and and attentive regardless of how busy it can get.  While their actual social skills do favor the Chinese, they're always polite."}
{"text":"Worst service ever.  Went in with my family at seven and the food never came.  We left at 7:57, the waitresses completely ignored us when we raised our hands.  Do not go here if you want to eat."}
{"text":"So on the good ratings here, we decided to give Tao Garden a try. We're not Asian and from the midwest but my step-dad is Chinese and their family owns several Cantonese restaurants so I grew up with Cantonese-American food. I've been searching for food like what I'm used to here in Arizona and I'm afraid Tao Garden is another fail. I have no idea how the other Chinese people on here can think this is good food. Yeah, the taste was ok but the quality of the meat is disgusting. The chicken is spongy and tasteless--what part of the chicken is that? The neck? I'm used to white meat chicken chunks that actually look like chicken and not something scrapped off the underside of someone's shoe. I also tried the Sauteed Beef with Chinese broccoli on recommendations here and the Chinese broccoli itself was outstanding but the beef was low quality and rubbery. I used to get tenderloin in my food back home. The price is fair and the food has a good overall taste but I can't eat meat that's so spongy and squishy. Gross. I'd rather pay more to get better quality meat."}
