{"text":"Excellent service, friendly staff, great food and a beautiful view!  They are not sticklers of the menu either, not only do they offer to make changes to your liking, they encourage it!"}
{"text":"Restaurant agréable au bord de l'eau. Petit Italien qui offre une carte de pâtes à prix honorable et aucune déception sur les 2 plats que nous avons choisit. La terrasse est superbe avec vue sur le St-Laurent. Endroit à découvrir !"}
{"text":"Tremendous experience. Great food, quiet and fun atmosphere. Thank you for a nice night in Montreal. Highly recommended."}
{"text":"New favorite!  Service was incredible! Elena and the rest of the staff were fabulous. Attentivd but left us to enjoy our meals. Explained the whole menu in detail. Elena was particularly fabulous and showed us their reservation area and answered all our questions...she was so incredibly amazing!   The food was good. Honestly i found the chicken plate i ordered a bit overcooked but the sauce and the perfectly cooked and seasoned array of vegetables i chose as a side dish made it perfectly forgivable. Boyfriend love his spagettini arrabiatta...spicy beyond belief and he enjoyed every bite.  The decor and the atmosphere is very chill and classy and comfortable. I loved showing up in a pretty dress but i wouldn't feel bad to show up in a nice pair of jeans and t shirt either.   Parking is available in the back off Notre Dame. We paid for parking right in front but not much as it was near then end of tariffed times.   Right along the river, we will be back to enjoy this place more!"}
{"text":"I can no longer say that there is no good restaurants in Lachine!  Been living in Lachine for 6 years and passed by the  restaurant numerous time but never tried it because I was disappointed in the ones I've tried.  They have a terrace during summer or you can sit inside as they have a two floors dinning room. My friend and I opted for the inside as the sun was going down and we were afraid that the mosquitos might come haunting us.  The dinning room is actually very nice and clean. Service was good and food was fresh and flavourful.  Took an entree of fried calamaris...it was decent but still can't beat the ones I had at La Verita! We also had the octopus entree and it was tender...the hot chili sauce on the side definitely enhanced the flavour.  As mains we shared a pasta Gigi which was excellent and their special Taormina pizza. The pizza was good but not mind blowing. All of that with a great bottle of wine that was reasonably priced.  In all, we had great food with excellent service. Would be a good option if you want to bring a date."}
