{"text":"OK they read my review and improved their salads! How can I not give them five stars? Every friend we bring there loves it. They rock and I'm so happy it's in my neighbourhood!"}
{"text":"Getting better with every visit. 

Right off the top, I'll admit that I'm biased because Taps is an ever-improving neighbourhood joint that also recognizes my face, but I'll try to be impartial. 

The good: the service, the beers, the patio, and the specials. 
The bad: 50% of the regular menu and the patio. 

The service is always fantastic, regardless of the server, even from my non-regular days. I find it's a good sign when the staff hang out at the bar after their shifts and that's certainly happening here. 

Plenty of beers on top and bottles as well. I really like a bar that serves Wellington brews. It's probably just me. 

Yes, I know, the patio is in both categories, but bear with me. In a stretch of the Danforth that's still rough around the edges, Taps is finally starting to hit its stride. The patio for very patio reasons, is great. Though small, it provides a great view of the sidewalk and street action, also the reason that the patio isn't the greatest. Let's just say that on my last visit, I watched a few deals go down as well as some solicitation action. Save for Mad Men and Treme, this is the best drama in my life right now. 

As for the menu, as I mentioned above, the specials are where it's at, though something can be said for the Caesar (with something that appears to be anchovy-ish) 

Definitely worth a whirl if you're in the east end already or looking to plant your first flag."}
{"text":"After a gruelling ass-kicking at fitness bootcamp (our instructor told us that they didn't complain in 'Nam, so neither should we), my fellow workout friends and I were really looking forward to an ice-cold beer, an air-conditioned pub and lots o' greasy food to calm our battered spirits. We managed to basically get 2 out of 3 at Taps & Tales.

I've been wanting to check out this pub for quite some time because it's a stone's throw away from me, and I really do like finding little gems in my hood. Also, some good friends rave about their beer selection and the fact that it's a little jewel of a space tucked away in a row of run down restaurants and ancient family businesses (which could all me amazing, mind you--I don't judge until I try!).

First impression: Free parking on Danforth after six! Nice--saves us a couple loonies. Pop that into the beer fund. The space is small and cute, but definitely not air conditioned. We were hoping for that environmentally hazardous chill you'd get at some restaurants, but we adjusted to the actual temp relatively quickly. Our server--who was really quite sweet and good at her job--was the only person on staff, so she was almost literally running her ass off (she was doing a waitress bootcamp workout). So the service reflected her overload. Do places staff their restaurant like that on purpose so the server will make lots of tips, or did someone call in sick and leave her in a bind? Hard to tell. p.s. I'm pretty sure my server wasn't Jazzmatazz, which kind of made me sad :( Maybe she was the one that called in sick.

Lucky for me Wednesdays at T&T mean half-price wings with a purchase of a pint! Sold. And sweet potato fries with chipotle mayo? Sold. My friends ordered basically the same things. We started with an underwhelming brushchetta. Kind of looked like something Napoleon Dynamite's grandma would whip up for a snack--submarine bun with diced tomatoes and sprinkled parmesan cheese from a box on top.

The wings were better. A bit too big for my taste. They reminded me of condor wings, but they were quite tasty (and cheap, for sure). The sweet potato fries were good. One of my friend who doesn't usually like sweet pot. fries said these were the best ones she ever tasted, \"because they didn't taste like sweet potato.\" After I heard her say that they tasted less and less like real food to me and more and more like deep fried hunks of starch.

All in all the value was quite amazing--my bill came out to $17. Would I go back? I'm not going to sprint there for an amazing meal (cause i'm not sure if that's what I'd get), but I would be inclined if I was craving some good beer. And it's always nice to support the locals!"}
{"text":"My husband and I absolutely LOVE this place! We live close by and when we are both tired and don't want to fend for ourselves we head down to this place. The food, service and atmosphere are always in tip top shape.  We are huge fans and will continue to support this place and their staff!"}
{"text":"Taps & Tales is a chic pub with a myriad of beers from around the world on their menu. I discovered this place through a work social a couple of months ago. Due to it's convenient location, I often come here with work friends after a long day.

The service is great! Staff are friendly and come around to your table a lot to ask if you're alright. The seating area is aesthetically pleasing. Menu items are your typical pub eats; however, I don't find any of the food to be too greasy or salty.

Only one suggestion that I could make is to play music. Besides that, Taps & Tales is a must go! It's right on the subway line."}
{"text":"This place has a decent selection of beers and always has friendly service. The booths are like your own little oasis with your own light switch and power outlet to recharge your laptop or cell phone. I usually get whatever the special of the day is and a local micro-brew beer - it's always super-yummy and served with a smile. I've gone here for brunch, lunch and dinner - it's that good ;)"}
{"text":"Jazzmatazz is awesome (yes, I gave you a nickname - I don't think your name is really Jazzmine. That's just TOO unique of a spelling. I would like to view it on your driver's license). If you have dined with me, you know that I always want my food my own way and may or may not know that I worry if the server doesn't record the nuances of my request on paper.  My concern is founded in statistical fact - it comes wrong 26% of the time if the server doesn't write it down, and only 8% if it is committed to carbon (I have a spreadsheet...)

I have been to Taps and Tales twice in the last two weeks, because the first time I wanted to like it, but I hated it.  Jazzmatazz was amazing but the food was not.  Kat F and I had a 3 course Winterdelicious menu - even though I KNEW I should order something from the bar menu... I got caught up in high fives and laughs and the genius of naming your prix-fixe menu Winterdelicious and Taps and Tales got the best of my 'what would this place cook well' judgment.  Anyways, they did have good taps and I was intrigued by their confused decor so I wanted to try it again; the buy a pint and get half off wings deal was just the right thing to get me back in the door... with a table of friends.  

The Best:
Jazzmatazz.  She is beautiful, good natured and has good taste in beer.  She got my order PERFECT without writing it down and didn't give me a hard time about making it a hard order (...both times).  She gave us all separate bills with no hassles and a side of water for J-Lo's whiskey (not a Teachers). 

The good:
- The booths have their own light dimmer which allows you to control the light over your table.
- They have good chicken wings.  They were crispy and saucy and came with veggies and bleu cheese.  They dip was particularly fantastic as it came in a big bowl suitable for dipping the entire wing.  Next time I would get hot, medium is pretty weak and has a ketchupy bent. 
- On Wednesdays wings are half price with a pint, and they have a good list of draught beers.  There is a special every night, but Wednesdays caught my attention for obvious reasons (chicken wings... beer... deal...)
- The ambiance is hilarious - I will take you on an imaginary 360 degree tour.  Imagine you walk in, and are impressed at first glance.  Then you sit down in a brown pleather booth and enjoy the novelty of having your own light switch... but then you notice that everything in here came from Winners and the liquor bottles are lit up like a gay bar on an aluminum background.  I don't know what's up with whoever decorated this place but it's...weird.  And I kinda like it.  I will like it more when everything gets a bit worn out and broken in.

The bad:
- Winterdelicious was bad.  The food was bad.  Order from the bar menu instead to avoid disappointment.  Specifically:
(a) my salad was wicked-lame, with dry, chewy sundried tomatoes (get the ones in oil, jesus) and bag salad leaves
(b) my steak was cooked nicely, but I always prefer a smaller better quality cut.  Taps and Tales does not. 
(c) crème brulee - this was interesting... Jazzmatazz warned us that we were getting one that had been completely set and another that was out of the oven.  If you have ever had crème brulee out of the oven... it sucks. That shit needs to set.  Anyways... we should have changed our order and got a different dessert when they told us the 2nd crème brulee was not ready (which they did when we ordered it and we took it anyways).  Kind of our bad, but also kind of theirs for not just saying they only had one left.  I will share this item of fail with them 50/50.
- When I asked for my wings saucy, they charged me and extra .75 for sauce.  You thought I didn't notice, didn't you... I did, and it's not a big deal, because it's 75 cents... but I was also kind of like, why are you charging me for making wings saucy, you should make them how I want them.  You took cheese OFF my salad from the Winterdelicious menu and didn't give me a refund, didn't you.  I am okay with paying an extra $1.50 for extra veggies (there were lots and they were cleaned nicely), but the .75 for the 'extra sauce' is nickel and diming.  To be clear, this comment is about the classiness of your establishment and not about $0.75.  I have 75 cents if you really need it for more Winners artwork.

I will definitely go here again.  I will eat so many chicken wings here over the course of so many Wednesdays that you will learn both my first and last name, Jazzmatazz.  I might even learn your real name."}
{"text":"They are CLOSED!!"}
{"text":"I've been here twice in two weeks. The first time, for their version of Winterlicious (called \"Winterdelicious\", $26) was unusual and not the greatest. 

The butternut squash soup with ginger that I had was DESPERATELY in need of salt as well as...ginger. Needs improvement for sure. The four cheese gnocchi was a zinger - I loved it but there was no way I could finish the portion because of the colossal volume of cream sauce topping the gnocchi - it made a nice snack the following day. For dessert, the crème brûlée was decent but it was my first time having it and I learned why I've never had the urge to order it again (no fault of Taps & Tales). Service was excellent.

On my second visit we had Jazzmine as our server again, and she once more wowed us with her sassy, friendly and accommodating nature. She handily drafted up separate bills for our group, let me order off menu (grilled cheese - it was terrific!!) and brought us various dipping sauces for our fries (also great). 

The decor is a bit too glamourous for this stretch of Danforth and judging from the outside you'll be very (pleasantly) surprised by it. There's a sort of makeshift lounge area in the back where I've seen groups carousing and watching the big screen.

I've warmed up to Taps & Tales - ll definitely be back for more food and drinks as it's a great addition to the neighbourhood and worth the trek east of Greektown."}
