{"text":"Fish tacos! ASU MADRE!!! TOO BOMB!!!"}
{"text":"I almost didn't write this.  I almost don't want anyone else to know about my favorite place to grab some authentic tacos when I'm in Peoria.  I fear one of these days I'll stop in for a quick bite, and the line will be out the door.  Because that's how good the food here is.  One of the best things about life in Phoenix is that if you do have to resort to \"fast food,\" you're not limited to the enormous over-advertised chains.  Taqueria Los Angeles is quick and inexpensive, so technically it probably is fast food, but the quality is so much better than anything you'll find at a traditional fast food burger place.  The salsas are fresh and flavorful.  The tacos come in different varieties of beef, pork, chicken, or fish.  (Looking for ground beef?  Go to Taco Bell.)  The burritos are enormous.  And it's all made to order.  There are a few clean tables inside and a TV tuned to a Spanish channel, but not much else in the way of décor.  If you go, don't forget to scan the walls for mention of specials and additional items; the menu behind the counter is not all-inclusive!"}
{"text":"I usually do not give bad ratings; I find that you can give grace to a place, and understand that not everything is perfect all the time. However, we show up at 6:40p, order the fish tacos - greasy, over-cooked in the way that caused them get really dry (and the addition of cheese was interesting) - we also order the Pollo Torta - are charged for the Torta and tacos, and gave a good tip. Then we are told that they ran out of Tortas, no bread (very unfortunate, if true, unless they restock on Sunday mornings?). We then order the Five Pollo Taco deal and are asked to pay the $0.45 difference. Okay, I understand that it is hard to make money in Phx sometimes, however, it would be nice if the tip could have covered their lack of bread. We sit down to wait, our food comes out, and we are told they are closing. ??? At 6:50, not 6:59 or 6:29. We are hurried out the door with our BAGGED food, door quickly locked behind us. We get five minutes down the road, and magically there are three, NOT, five tacos, and they have nothing on them. Maybe the microwave used to heat the tacos 'ate' the other TWO. (Who uses a microwave to cook 'Real' Mexican fare?) Great, exactly what I want from a local place that I just over-tipped. Anyway, I know to avoid this place now. Good luck finding your way in the Phx restaurant scene."}
{"text":"Unpretentious, ... nothing fancy at all,  Taco and Burritos , this place is just a neighborhood restaurant with great food. I have been waited on by the 12 year old kid behind the counter,  ... the decor' is nothing to write home about, but all of this is what adds to the charm of the hole in the wall treasure!"}
{"text":"Because of the good yelp reviews, my wife and I decided to try this joint out.  It is just a whole in the wall.  There was no one else inside when we showed up around 7 15 on Saturday night.  I ordered three tacos--chicken, fish, and steak.  My wife ordered chicken enchiladas.  We got it to go and it was ready in about ten minutes. We got home and were excited to try our food.  Unfortunately everything was under par except the chips and salsa.  The chicken and steak were a little over cooked. Flavors ok, but nothing amazing.  Enchiladas were just ok. The beans tasted like they were from a can.  My tacos were a little bland.  Really, nothing was great.   I really wanted this place to be great.  I'm always rooting for little places like this...but I cant tell people to go here over Carolina's.  Cheap food and cheap taste.  Maybe other items on the menu are good...but I don't think I'll be going back to see.  Good luck taqueria Los Angeles."}
{"text":"I was in the area, looking for a place to grab a quick bite on my way home. Figured I'd be adventurous and let Yelp decide for me. I saw Jerrod's review of this little Taqueria and decided to be brave and see if it was everything he said it would be.    It was! First, I was really tempted to pull into the much-nicer-looking Carolina's across the street. I've been meaning to try that place since I used to frequent Carolina's downtown, anyway, and when faced with the storefronts of Carolina's vs Taqueria Los Angeles, well, you'll see when you go. I'll leave it at that. While the Taqueria isn't much to look at (and what's with the front door sticking? I thought I was going to shatter the glass yanking it open!), I urge you to look PAST it and walk inside...check the main menu board up above...but Jerrod was right - there are specials galore...check the little stand over by the salsa bar (that's where I found my Bistek en Chile Colorado $5.50), check the wall on the right where they list seafood specials etc. Just take it all in. Both of the guys working there that day were super friendly and willing to answer questions. There's a little serve-yourself salsa stand that included the pickled carrots that everyone seems to love. (Not a fan, so I skipped those). And if you want to dress up your salsa, you'll find dried oregano and red pepper flakes at your table. I figured I'd get my food on a styrofoam plate - that they'd call out \"here's your food!\" and I'd have to go get it. No. This guy comes out and serves me with a full on REAL plate and silverware!  -and this plate looks GOOD! (see my photo) Big chunks of meat in a rich, colorful Chile Colorado sauce. Not too soupy, not too dry, just PERFECT. The rice? Fluffy, perfectly cooked and nicely seasoned... The beans? Just how I like 'em! Not pasty, not watery either. But the kicker was the little foil wrapper he laid down. I figured it'd be a flour tortilla, average at best. No...it was FOUR very fresh-tasting corn tortillas! FOUR! I was so in heaven. The entire dish was amazing, start to finish. and did I mention $5.50? Yes, $5.50. Sold!  Overall experience: delicious, friendly, awesome, yummy. I love places like this where the food isn't wow-ing me with unique flavors and wild menu items, but is instead just giving me good traditional solid recipes. I wouldn't drive my friends across town for (I'm sure there are hundreds of similar little places like this in Phoenix), but if you're in the area...don't be afraid! Go in...enjoy!  The not-so-great: Location and appearance are not the best. The Diet Pepsi out of the fountain was one of those \"ick-I-should-have-ordered-something-bottled\" tasting drinks.  Would I go again? Hell yeah...."}
{"text":"Honestly great food, I go there for my lunch as often as I can, no wait because they have fast service food is made to order and I'm always in and out within like 15 minutes max. Way better than any other food around here, I've tried allot of the Mexican restaurants out in this area and this is the best one."}
{"text":"LOVE the fish tacos for lunch. I walk in and they know what I want and she hands me a coke and right before I finish she hands me another coke and .... then I'm done. Last time i was in here the waiters across the street from another Mexican restaurant were in there ordering.... made me laugh Great service Great food"}
{"text":"You gotta try \"Tortas\". The staff is nice and professional. Clean, cheap and DELICIOUS place. Highly recommended."}
{"text":"Thanks to other Yelpers I found this little gem! My boyfriend and I both tried the pick two and our dinners were delicious! I had never had a flauta before and decided to try it. I am glad I did, it was excellent. The beans and rice came with the choose two entree, they were also good. Carolina's across the street doesn't compare to Taqueria Los Angeles. Not to mention the price was right!  If you're in Peoria, you must try this place! Oh yeah, the owner was pleasant too."}
{"text":"Place had decent reviews. I came with my daughters and all 3 meals were mediocre at best. Rice and beans didn't have much flavor. Flautas were not that good. Tostadas were not that good. Gorditas were ok. I will probably never come back here again."}
{"text":"We discovered this place bc. Carolina's was closed on Sunday!  This is noe my go to for carne asada! Its sooo tender and full of flavor! Their Gorditas are amazing! their beans are like the beans my abuelita made back in the day! Only draw back, their AC dont work well and their bottled drinks are kind of warm."}
{"text":"Good food, nothing fancy. Will go there again. Gotta try their\" fish filet Mexican style\", just awesome."}
{"text":"If you're debating whether to go here or Carolina's go here. Try the adobada tacos and the fish taco special, you will not be disappointed. The rice and beans are homemade so that's a definite plus right there. Kinda sucked that it was a dollar for a little bowl of chips but this place is worth the dollar for the little bowl of chips. The lady behind the counter is super sweet. You will not leave here unsatisfied!"}
{"text":"Good fish tacos. Food is a bit too spicy for my taste but others may like it that way. I wasn't a fan of the rice and beans- the rice was dry and crunchy and the beans were too salty. However, the taste of the tacos were good and flavorful."}
{"text":"Small, great spot to grab great food! Love getting their breakfast. Their breakfast burritos are delicious. This place is usually not packed. It's across from Carolinas and has much better food. I don't see the hype for Carolinas actually. Come stop by Taqueria Los Angeles instead!"}
{"text":"This place is authentic. Good Menudo and tacos, salsas are great. Compared to other places in the valley this place is amazing.  I'm grateful and I can't complain.  It's hard to find good Mexican food."}
{"text":"It's our every other Sunday morning burrito spot! Love the staff, love the food. Their green salsa is by far THE YUUMIEST THING AROUND! We'll definitely continue our burrito tradition with them."}
{"text":"Sooooo good. Went here because the line at Carolina's was too long. Glad it worked out that way because I found out that Taqueria Los Angeles is better than Carolina's."}
{"text":"My friends and I had takeout for dinner tonight. We all had the gorditas and they were very tasty. Our orders were freshly made and plenty of food to an order. I am sure we will return to try more!"}
{"text":"Food is authentic and very delicious. I had fish tacos and they tasted perfect, home cooked food. Husband & father in law had a variety of tacos, cabeza (head), tongue, & tripa tacos...they were all delicious, I tasted them all too and had plate envy. We want to try the sopas & shrimp cocktail next time. We also had the Jamica & Horchata waters and those were fantastic! I will recommend this place to everyone even if they don't ask LOL. Can't wait to go again! One more thing...nothing is over $6.95. Just go & see for urself....YUMMO"}
{"text":"Best tacos I've had in a while!! I was skeptical at first because it doesn't look really fancy- but the food is bomb! Definitely check it out if you're in the area."}
{"text":"We spent weeks trying to catch this place open. Tonight was the night. Come on folks....this was horrible. I cook Mexican better than this and wish I had and for those of you that think its better than Carolina's...I dont even know what to say. We ordered simple. The beans were tasteless and runny, not in a good way either. We will never go here again, ugh."}
{"text":"I stopped in here today and tried the 5 tacos for $5 special. I had the adobada tacos and I thought they were very good. The chips they gave me for free looked like standard out of the bag but the salsa was home made and I liked it. Gave me a little nostalgia of eating at a taco stand in downtown LA when I was a kid so I had a good time.  I'll definitely eat here again if I'm in the area."}
{"text":"Craving some tripas I figured I'd try this place out. I have driven by a couple times in the past but it was closed. As I'm walking thru the door my mind is telling me \"Turn around and walk away...no one has even seen you walk in...TURN AROUND AND WALK AWAY!\"   Heart: Give it a try. Whats the worst thing that could happen?  Mind: Look at those flies on the wall, the horrible interior, and filth on the walls, what do you think their kitchen looks like!!?  Heart: Ah come on...let's give it a try.  Mind: No tripas on the menu you fool. Get out now.   Finally a worker appears and asks to help me. I ordered a gordita with carne asada, asked for a adobada taco but was told they didn't have any. So I ordered a carnita taco and a generic Jose Ole horchata (Mind: BOOOO, Jose Ole sucks...). She rang me up. 8 bucks or so with a tip. I was handed some chips and there was a tiny salsa bar. The chips were stale and the salsa was in very poor form. Huge chunks of onions, no heat, not fresh tasting. I pushed it to the side and sipped on my drink. It's bad when you don't even want free chips and salsa. A few minutes later my food comes out. The carnitas were full of fat and not worth a second bite. The gordita was hot, and had some promise. Then I bit into it and had a rock like pebble that stopped my teeth from closing. Not sure what it was but that ended the meal immediately. I finished my drink. Threw out almost a full plate of disgusting food and made my way out of there much quicker than I made my way in.   Mind: You dummie Heart: At least we can yelp about it  Mind: No one cares"}
{"text":"I went to get some parts down the street and I saw this Mexican restaurant. We stopped in and order the fish tacos and they were great. small little place and they have good food. I haven't tried anything else. However the tacos were good"}
{"text":"So last Sunday I was hoping to get a quick bite to eat, & what ALWAYS sounds good? Tacos of course!  So in usual fashion, I resorted to yelp for suggestions...unfortunately in this case, I was *royally* disappointed.  And that's saying a lot for Mexican food because as far as that goes, I'm easy to please! But really, it's gotta be pretty bad to screw up enchiladas, am I right?!  From the chic with a serious attitude behind the counter, dirty tables (even though there were only two other people in the restaurant) stale, store-bought looking chips you have to pay $1 for...to waiting a good ten minutes for my order because apparently the 4 people who ordered after me were more of a priority...But I figured based on the reviews it would be worth waiting for.  Sadly, that was not under case either.  Since all the tables were dirty, I decided to take my food to go.  And being as hungry as I was, looking forward to my $7 \"enchilada special\" with rice and beans, it was a great let down unwrapping the plastic from the deformed Styrofoam box. What I found was watery 'beans,' enchilada slop smothered in sour cream, and something not even faintly resembling chicken (not sure if i want to know!) But really, they honestly think it's ok to *microwave* STYROFOAM??!  Well, all that to say, this place was so highly overrated, it made Taco Bell look like a five star!"}
{"text":"Love the food here!! I have to go atleast once a week  the Asada fries and fish tacos are delicious"}
{"text":"Really good flavor. The salsas were delicious. Would definitely go again. Oh and the horchata was perfect! Not too sweet or too watered down.  And their churros were finger licking too! Overall great experience!"}
{"text":"Came here for the first time, I've always wanted to try and I was not disappointed. The fish tacos my husband got were amazing the best I have had in the city. Don't miss the rolled tacos either, born like the other places these look handmade and have actual flavor. The guacamole is good but spicy so yummy."}
{"text":"Delish, quick and no lines like across the street at Carolina's.  Couldn't be better than Carolina's but it is.   Burritos are big. I found my new lunch spot where I don't have people standing over my shoulder and I don't hear any screaming children."}
{"text":"The carne asada burrito had so much flavor. This was my first time here. The cashier was friendly and very attentive. I will be back for the especial of tacos 5 tacos for $5.00  every day all days."}
{"text":"The gorditas are awesome :)  I've tried the asada ones and the carnitas both were amazing! The quesadillas are big and also very good.  I tried the hard shell tacos and honestly I wouldn't try them again... Only one side of each tacos was hard :( the other side was soggy.  The teenage girl that works there is always friendly and good with getting the orders right but the past 2 times I've gone she wasn't there and my orders were wrong :/   I love the menudo on the weekends!! The salsa I'll give that a 2 out of 5 stars.  You must try this place if you're looking for real Mexican food.  First place that has authentic Mexican food out of the 10+ places I've tried based off of yelp reviews.  Its a diamond in the rough. Ohhh and before you go be sure to check their hours! Some days they close super early. Btw the only thing carolinas has better then this place is the hard tacos..  Not many people are use to real Mexican food and for those people maybe Carolinas, taco bell and del taco might be better...  This place works with the flavors of the meats and ingredients ^_^ not fake or processed food."}
{"text":"Closes at 9pm on Saturdays   I've only eaten there once but was extremely impressed. I've been searching high and low for some delicious tacos and I have to say WOW. Don't be afraid to give it a try"}
{"text":"I found this restaurant on restaurant.com where they were prominently displayed as a new location to try.  Purchased the coupon and visited the location.  After ensuring that our order was over the required amount we were unequivocally told \"no coupons\".  We decided to dine here anyway.  The food was good.  Large portions for the price.  The soda fountain was broken and even though we tried to order 2 bottles of soda, we only got one.  Fairly sure but not positive we only paid for one. We paid for a bowl of chips as they are not gratis.  Chips were stale.  No labels for the different alsa options to enable an educated choice.  Will not be back as there are several better local spots that would be happy to have our business."}
{"text":"The adobada pork gorditas are a godsend. You cannot go wrong with them! My favorite has to be their bean and cheese burritos which is toasted and comes with a fried jalapeño."}
{"text":"My husband I stopped here on our back from Sedona to LA. The food was awesome. Freshly made. Large portions and prices were fabulous. I had the Posole and I ate the whole thing. Salsa was also yummy. A hidden gem."}
{"text":"Worth trying. Not again tho. Food was ok, not great. Too high priced for what you got. Even the fountain soda was high and 50 cents for a refill. Chips were a dollar for a tiny bowl. S mall place. Clean."}
{"text":"Tried the tacos they were ok slightly smaller and slightly over priced compared to other taco places . Very uncomfortable eating there was very hot. They didn't have the ac on. But had a couple of fans going. I come here once in a while it's a ok place ."}
{"text":"This place is minutes from my house and is my go to Mexican food place. Often on Sunday's for breakfast burritos for the family. Authentic and tasty Mexican food that is much better than Carolina's across the street. Every now and then it can take a bit of time to get the food if they are busy but that would be my only knock on the place.  This isn't one of those places you need to drive across town to experience, but if you are in the area and looking for some damn good Mexican food. Do yourself a favor and skip past the overhyped Carolina's and head across the street instead."}
{"text":"Nothing fancy... just a hole-in-the-wall place where one would expect some pretty good food.  There was just one guy working there, taking orders, cooking, and waiting tables.  There isn't much room to sit, just a few 'fast food' type booths.  I was ordering takeout so that didn't matter.  I ordered some tacos al carbon to go.  While I was waiting, a few others were served their food and it really looked yummy!  One of the customers got up, went behind the counter and got a soda refill... apparently accepted practice here and a hint of how low-key the place is.    My tacos were excellent!  My \"good food at hole-in-the-walls\" notion was preserved, and I'll be going back.    If you're looking for a chain restaurant, keep driving.  But the laid-back low-key atmosphere was just what I was looking for."}
{"text":"I am not only new to the area, but to the southwest. I'm so excited to try food from as many taquerias as possible to find my favorite. Taqueria Los Angeles is yummy and super inexpensive. $5 for \"your choice of two\" with rice and beans. I will certainly return."}
{"text":"I'm excited to try my food, however their 45 to 55 minute delivery time is not true. More like an hour and 20 minutes is what it is. Not happy with GrubHub at all."}
{"text":"Oh my god.. Thank you, yelpers. I've been looking for good Mexican food since moving here. One thing you should be advised about if coming here for the first time, do not order too much. I'm so used to small portions, I didn't realize. I had my boyfriend go and pick up some food. I got nachos and two beef hard tacos. I could barely finish the nachos that I found out was \"half size\". I saved the tacos that came with a large side of beans and cheese for lunch the next day. Really great food. Hope to come and eat inside next time."}
{"text":"Food 3/5 - I hade the tostatas de Camaron & steak street tacos. Tostatas were pretty good but the texture of the tostata itself was oily & left a taste in the back of the mouth. Steak was dry & hard to chew.  Service 5/5 They were very nice. Food was prepared freshly & quickly.  Ambiance 3/5 - No Bathroom. Small place. No distinctive decor.  Overall - 3.6/5 stars - Not as impressive as I was hoping. But not horrible!   Would I refer this place to a Friend? Doubtful."}
{"text":"I'm literally waiting for my meal right now, I hope it's good! --------------------------- MMMMmmmmmmmmm Mmmmmmmmmmmmm B*****!!!! Wow this is pretty damn good! I can't believe Ive literally worked across the street for almost two years and never checked this place out... Well, maybe I can... Carolina's is like 75 feet away lol   I'm not sure what that other reviewer was looking for/talking about but this place is definitely not as he described it. It's a little family owned place and it's a little warm inside but other than that, it's fantastic.   I ordered the 2 floutas dinner plate and was surprised by the portion size. These floutas are jumbo sized and taste great! Warm and crispy with some nice shredded beef. Beans are great! Rice is good, soft and moist. Salsa is chunkier than any other mexican place I've been to so I have no idea why the other reviewer said it's \"watery\"   Overall, if you're looking for a 5-Star Iron Chef Mexican Food Restaurant then you've came to the wrong place but if you want some quality Mexican food that doesnt end in \"'tos\" and has a \"homey\""}
{"text":"Hate that I didn't know about this place sooner! Really great tacos and the price point is great too. Considering the prices for tacos at other places, it makes me laugh that they overcharge and their tacos aren't even half as good as this place. I get tacos every time but my boyfriend and his sister try different items and they always love it. Don't sleep on this place! You're missing out!"}
{"text":"It looks like a hole in the wall. The only reason we stopped by was cause we really wanted some Mexican food and this was the closest thing. But the food was SO good! My wife had flautas and wouldn't stop talking about how amazing they were. I had a carne asada burrito. The food was great. The a/c must have been broken or something cause it was hot in there. But the food, totally worth it!"}
{"text":"Not the best seating but the food is amazing . Hands down best Mexican around the area"}
{"text":"All I have ever ordered here is the 2 Gorditas dinner (carne Asada ) . It's perfectly cooked and seasoned and mouth watering .  The Gorditas themselves are crisp on the outside and fluffy in the Inside"}
{"text":"Had the ceviche and fish tacos, both were really tasty and I would definitely eat here again, reasonable prices and its on the healthy side."}
{"text":"Okay we ALWAYS go to Carolinas across the street from here. Ummmm yeah that won't happen anymore! I had a ceviche tostada and camaron al mojo de ajo (garlic butter shrimp) my husband and Daughter had menudo and goditas de pollo...... I must say that was THEE best ceviche I have had in a while. Everything was good and I am very picky with spanish rice (cuz I make the best hehehe) but their rice passed the test! The beans were HOMEMADE not canned rosaritos lol.......since carolinas is closed on sundays guess where we'll be going for sunday hangover menudo??!...... P.S. while we were there an employ from carolinas came in for food hahahaha need I say more?!"}
{"text":"Always closing early and never got to try them yet. Today arrived at 7:41 and female employee turned the sign to close and locked front door. I had just turned my car off and was annoyed. Owner needs to know his staff are closing earlier than 8pm posted closing time-cardinal sin in food business"}
{"text":"Cheap prices and good food. Carnitas Burrito (enchilada style) was great. Shrimp cocktail pretty tasty. Single chili relleno I won't order again though; swimming in sauce and sour cream and salsa and a bit greasy.   Warning: currently shows up on restaurant.com but they won't take the coupon.  Fountain broken so bottled drinks only. No alcohol.  For what I paid, I'd say it's worth it."}
{"text":"The tacos we bought were small, but the meat was delicious. Very well seasoned. Better than the restaurant located across.  I will be going back."}
{"text":"Place sucked, go to carolinas. Meats taste like can and they can't follow simple orders"}
{"text":"Amazing Tacos and Gorditas....the red salsa is my 2nd best!  Affordable and Amazing!!!"}
{"text":"Wow finally some real and authentic Mexican food to eat in the Phoenix area family owned and operated with amazing staff super friendly and helpful. I ordered the shrimp a la carte and it came out fresh and piping hot by far the best Mexican food I've tried outside of my moms home cooked meals definitely will be coming back again and again."}
