{"text":"Incredible! We went there last night for Chinese New Years dinner and the food and service was just out of this world. Our table ordered a ton of dishes to share and I think my favorite was for sure the eggplant, the napa cabbage and mushrooms, the rice noodles and sour kraut, and the Beijing pork were my favorites! As an app, you must get the bacon wrapped mushrooms. The fish balls were amazing too! We will for sure be back again!"}
{"text":"If you like authentic Chinese BBQ, this is the right place for you. Their BBQ and sausage are delicious. This is a new must try for me in Vegas!"}
{"text":"I ordered lamb chops and they were chewy. Bad customer service. barely check on us and to see if we're ok. White rice doesn't taste right."}
{"text":"Lamb kabob is great and a must try item in the Menu. Reasonable prices. Each skewer were around $1-$2."}
{"text":"My favorite Chinese in Vegas. The Kabobs they serve taste just like the ones in Shanghai. Inexpensive and delicious. The Wonton soup is deceiving it says small wonton soup but it is a huge bowl for like $6. The owner told me the wontons are small. What a great deal."}
{"text":"Got a bunch of different skewers. All had the same BBQ sauce, tangy, sweet, salty, with a kick of spice. 
The lamb was super chewy and gamey, very hard to chew, I actually spit it out. 
My fave was the eggplant and shrimp. The fish was ok too. 
We also ordered the spicy hot tofu entree (8.95). Good flavor but does not come with rice ($1 extra).
Fun place for a snack, but didn't really fill us up. 
Cost about $40 for 3 people.
Probably won't be back, nothing special in flavor and too far of a drive for us."}
{"text":"The best Chinese northeast flavor I have! The pickle cabbage with pork slice is wonderful! Just like my mom made. 5 stars! 
I will come back and try something tomorrow!"}
{"text":"???????????????????????????????post........
Very good Dongbei Food, You would cry if you are from Dongbei"}
{"text":"I like this place for its skewers, and I really like the seasoning they put on them. However, the issue I have with this place is the atmosphere. When my friend and I first came in, we were not greeted. We were just taken to our seats without a word spoken. Then when we wanted to order the waitress was eating her late dinner (we came at 10pm), so she did not acknowledge us when we waved at her to order. 

After we ordered, we waited in silence since nobody was there and no music was playing. It was as if my friend's and my conversation was the only thing giving the place life. 

Besides that, the skewers are sweet and spicy, which is for some reason a realllly good combo. This is basically why I come back even though they have poor service."}
{"text":"My sister found this place through Yelp and we decided to try it out. A small little place but quite spacious. They mostly have booths along the two walls which can seat up to 4 people or 6 if you just squeeze in, and two separate tables that can be combined into 8-9 top. 

So funny!!! As soon as we walked in, the hostess/waitress told us \"We do not have American BBQ, we have no chicken or beef!\" :) I tried to hard not to laugh, I guess we look like we only eat chicken and beef. 

As soon as we sat she gave us water, they also have a variety of teas that I have not seen before. I tried the grapefruit tea and it was delicious! We tried a bunch of their skewers: croaker fish (just tasted like salted fish), beff tendon, beef honeycomb, chicken heart, chicken gizzards, baby octopus, pork kidney and fish ball with roe. All were very good, some more flavorful than others but were overall delicious! 

We also tried two of their main dishes, the Dongbei style egg plant which was absolutely delicious. Very creamy and soft eggplant, the sauce smelled of garlic and just simply delicious, amazing with a bowl of white rice. We also tried the Dongbei style sweet and sour pork, also delicious. The pork were cut into smaller pieces which made it easy to eat, tasted fresh and crispy, sauce was very garlicky and tasted like a plum sauce. Very yummy! We also tried the kimchi fried rice, this dish was average. Flavors were good, but pretty plain in the sense that it literally only came with rice, egg and kimchi, pretty plain for a fried rice. It was also very wet, I am not sure if that is their style or it was a fluke but the rice was very wet. I don't hate but also don't like it. 

Don't come here expecting service like you are on the strip or at other places. Service was great for us in a sense that the waitress quickly took our order, food came out as we ordered, drinks were re-filled and all that. But this is a very casual place, typical of most local Chinese places, they take your order, drop off our food and that is that. 

Overall I really enjoyed my first experience here, I will definitely come back to try more of their main dishes."}
{"text":"The waiter we had didn't speak a lick of English.  But not to sound Trump-ish, come on!!! So ordering was an ordeal.  We literally pointed and said the name.  He barely understood. The food took forever, but it was good.  The chicken hearts were seasoned with anise, which something I did not expect. We didn't get entrees, just a bunch of skewers. We got the lamb, which was delicious. The wonton soup was very rich in flavor. But it seemed like it wasn't enough for one person.    
Our poor waiter had a really mean boss that kept yelling at him, so...that was awkward.  
The bathroom was pretty bad too.  Even for my standards. I could go to the restroom pretty much anywhere, this place did not even make my number 1 list. I washed my hands and went back to my table. 
I'm sure this place is great.  But for me, I don't think we would come back."}
{"text":"We checked this place out for dinner on a Sunday evening. Not busy at all, so we were seated right away.

The ambiance is a little strange. The murals on the walls are odd. Best to just ignore them.

We ordered some Chinese Sausages, a bunch of skewers and some fried rice. Overall the food is okay. The prices are very reasonable for what they serve.

So, feels like a good place for a quick bite if you are nearby and want to eat things on sticks and are not feeling too picky. Probably not a good choice if you want to satisfy a craving for real kushiyaki-style food though."}
{"text":"Service is so slow!!!!!!!!!! Unbelievable!!!!!! Wait for an hour and didn't get anything from what we ordered. Never return. Waste time."}
{"text":"If I could give no stars to prove my point, I would! This is the third time I've been here, and although the food is good it certainly isn't good enough to be disrespected and patronized the whole time you're there! Each and every time we've gone, upon arrival we've been greeted with, \"Have you been here before? This is Chinese Barbecue.\" Yes, we figured that out by reading the sign outside that says \"Tasty BBQ Kitchen.\"

The first time, we came with my Mom (she's from out of town) and she didn't care much for the food because it wasn't Cantonese style, however, we thought it was good enough to return. The lady who served us was the same lady who greeted us each time we went. This time we went she seemed to be bothered we were even there. I almost felt like asking her if she even wanted our business. There were no other customers there aside from one man who appeared to be friends with the staff and they were speaking loudly amongst each other in their language (who knows, probably about us being there) as he went into the kitchen...and he didn't look like the cook. She sat us and immediately asked us what we wanted to drink. I asked what kind of hot tea they had and she said \"tea bag only.\" I then asked what type as in flavor, and she repeated \"tea bag.\" I asked if it came  in a pitcher and she looked at me with a blank look, so I asked again and she proceeded to say \"pot\" in a condescending tone. I felt like she cut me down, but I decided to blow it off. Bad idea! I do not know what her problem was, but she was extremely rude and behaved as she was superior to my daughter and I. She also undermined us when we asked specifics about the entrées and when we wanted to add Spam to the Kimchi Rice. She made it seem as if it was abomination to ask such questions! She even added, \"Don't complain if you don't like it.\" She also told me as I was using the Cumin shaker, that it was for the kabob. I replied that I knew and then I proceeded to shake cumin onto my rice...no one is going to tell me what I can and cannot add to my food, especially when I paid for it!

In light of the horrific United Airlines incident, I feel they were a couple of steps closer to dragging us out of there as well! As I said before, the food is good, but not THAT good! Plus, it's not so clean there and the bathroom is dirty and stinky! I refuse to be patronized and disrespected at any business. If it weren't for my experience as a server, I probably wouldn't have left a tip after such terrible service...but of course I gave the minimum amount.  
Never, ever again!"}
{"text":"Not what I expected. Traditional Chinese food.  It's great and I'm on my third return visit.  Great flavor and very friendly."}
{"text":"As a Northerneast of Chinese I have to say it's a such traditional Northerneast Chinese resturant.It located at China town so if you live at hotel of downtown you can take a uber there.My brother found this place and took me there,the bbq food is really good!Taste like our hometown's style.We have been there twice and will come again next year,what a pity is there's no any alcohols.
We tried pork skin,mushrooms,shrimps, fresh oyster..dried tofu with pepper, cucumber with peanuts,and Yangzhou fried rice all of above are so yum yum?I will miss this resturant a lot?"}
{"text":"Tried this place for the 1st time.  I loved the food it was really good.  It reminds me of my trips to Northern China.  The lamb skewers are very good the price is fair.  I would recommend this place to anyone that knows Northern Chinese cuisine."}
{"text":"the best chinese food in vegas, this is the really chinese food!! like the stick dishes and hot pot."}
{"text":"Just moved to the Southwest side of town and have been trying different restaurants. All have been excellent except for this one. This was by far the absolute worst service I've ever had my entire life! The young lady greeted us and said the place was under new owners. I was thinking ummm ok? Then went on to say they had no beef or shrimp only pork. We like pork so we sat down. The place is run down and the booth I sat in had holes in the wall? As I reviewed the menu I saw bbq beef and shrimp skewers? Hummmmm again I asked if those were available and the girl said yes. I'm totally confused they have beef and shrimp? The food was disgusting. The other couple that seemed to be friends of the server kept blowing they're nose and making sounds. The server was extremely unprofessional not to mention rude. We asked for water twice never got it?! Then the cooks and server all sat down to eat. We couldn't wait to get out of there! I wouldn't take my dog to eat at this dump! I would never recommend this restaurant. Horrible!"}
{"text":"Oh wow, great authentic Chinese skewers, taste great, price is on the point.
Chicken wings, shrimp, lamb, mushroom all taste superb, and don't forget to try Chinese sausage. No alcohol and drinks are self service."}
{"text":"We were expecting the kind of Chinese food we normally get, but this was from the northeast part of China, near Russia and No Korea.  The food was very fresh, and seemed like what you would eat in someone's home.  We had meat and veg kabobs, a veg dish of eggplant, potatoes and green pepper which was delicious.  The little wonton soup was very good.  We would go back again, this time knowing what to expect."}
{"text":"Great Chinese BBQ. Very well marinated. Lovely place to dine. I highly recommend the chicken wings and sweet sour pork."}
{"text":"This place is a true hidden GEM in Las Vegas and well worth the leaving the strip to go there. 
We actually went the day it opened and you'd think there would be chaos but it was so smooth, I didn't even know it was opening day until the hostess told us. 

This is like Tapas for Chinese food - Not, in my opinion, like dim sum. 
1st time: kabobs - lamb, beef and chicken.  All were grilled to perfection and had a really nice sauce that was just the right amount of spice. They are like $1.00-2.00 each
Short ribs: the meat was so tender it fell off the bone. 
Chicken wings: cooked over the charcoal so they were nicely browned 
Cucumber in garlic sauce: packs a punch but really good. 

2nd time:  In addition to the kabobs we had a wonton soup. i wanted a cup - it's like a cup for Andre the Giant. hearty, warming and delicious with nicely sized wontons. 

3rd time: Again the kabobs & short ribs - we added fried rice and the steamed green beans. Actually they catered to a Super bowl party we attended - which was a great and delicious surprise. 

Seating: Fatabulous - tables with sturdy chairs / no arms. 
Service: Fast and helpful with suggestions. 
Best part besides the food: Great alternative to fast food late at night. Kitchen stays open until 1am. 

Taxi/Uber/lyft from the strip - 15.00- 20.00 but worth it for the great food and cheap eats."}
{"text":"This has been the worst food I've ever tasted. The skewers was very sloppy. The corn tasted like from the freezer expired a year ago. The bread was like toasted with chili paste.  Just never thought it would be this bad!!
Sorry, I'm not returning! You just lost my business lol..."}
{"text":"Quiet place tonight. Service was slow even though there were only 4 other tables. We were told that there was only one chef working. The bbq grilled items were quick but entrées took quite awhile to get. The Dongbei style pork was crispy and tasty. While the Yangzhou style fried rice was just ham & shrimp, different than what my wife had in China. Grilled items like the lamb and beef were tasty with a dash of cumin. I would go back if someone wanted to try the place out otherwise I would stick to the grilled bbq over the entrées."}
{"text":"Very fatty meats used for skewers, and customer service was severely lacking.  Was told on the phone my pick up order total came to under 10 and was told when I arrived that only cash, and credit must be over 10, had to order another set of skewers just to have a grand total of 13.75 and was very displeased with flavor of lamb kabobs, beef kabobs were better but very dry and had very bad after taste."}
{"text":"The place has good cozy ambience and customer friendly staff. Above all, great food. I wish they were open during lunch time also for some time. They can build a good customer base if they cater to the corporate companies (IGT, SW Gas, Viad Corp. etc) around. Also, the Strip crowd should know that it's open late."}
{"text":"Fabulous Chinese BBQ!  I'm so happy that this style of BBQ is now available in Vegas!  Very friendly staff and unbeatable prices! Nice to go off strip for some comfort food! Can't wait to go back for sure!!!"}
{"text":"Not too bad. 

Each skewer was cheap. About $1-$2 each. 
Each skewer is brushed with some bbq sauce. The sauce wasn't too bad. Not too tangy nor empowering. Tad of spice.

I feel like we made the mistake on ordering all the skewers at once. So by the time we got to the 2nd or 3rd skewer, it was already room temperature. 

The Yangzhou fried rice was pretty good. Had shrimp, peas, carrots, and luncheon meat aka spam. lol. Yum yum. About $7-8.

The inside of the restaurant was simple. Drawing/painting on the wall. Sort of reminded me of a daycare type of painting, but it was still cute.

The service was alright. I had to keep getting the servers attention when we needed anything, but that's alright. There was only 3 tables out of like maybe 12? booths taken. It's a small place. 

I'd try the place again if given the chance. 
It was tasty! Get the lamb skewer, it was really good!"}
{"text":"Everywhere you see dirty dishes, like thats not good .. its a big place too they should hire more bussers other than talking to each other.. kids running around i mean its casual but it should be strict .. food was ok nothing exciting .."}
{"text":"The food here is SUPER ETHNIC.  You've been warned.

Outside of fried rice, which is not the same as Chines takeout fried rice or Panda express, the cooking and spices are not what you normally would expect.

A super rude waitress, when we got our bill we had a difficult time matching what she wrote to the prices and when we questioned her, she got irritated.  Then pointed out to us what was what with quite a tone.  Turns out she wrote everything lopsided so items were not aligned with the pricing.  Confusing without explanation but nevertheless small misunderstanding.

I politely tell her that I apologize for misread because of the alignment.  She replies to me \"that can't be helped\"  
I almost replied \"well it can't be read\"
Who's going to pay for a check they don't agree with? 

Anyhow, the food is decent because we're Chinese but it's much more ethnic than usual.  I really don't expect foreigners to accept it, which is why it's not more popular.  However the nasty refugee china atitude needs to change,  this is america biotch.  Try service with a smile."}
{"text":"Nice Mom and Pop restaurant. Food was solid and I don't have any complaints about the service. The lady running the shop gave translations of items that were not in English on the menu which was helpful. Got to try some foods that I've never had before. Price was very reasonable for these types of skewers! Come visit as soon as you get a chance!"}
{"text":"My girlfriend dragged me here at about 9 o'clock. It wasn't busy but it was well lit and inviting. Everything in the store was really clean and the menu, although simple, had everything you would ever need in a small Chinese bbq place. The prices are cheap and the food is delicious. We got the lamb and cabbage soup, fried rice, and a medley of skewers. Everything was great and served quickly."}
{"text":"1.50 for a single little dried chicken wing
1.00 for a tiny little dried shrimp

I leave with a little dried wallet and still an empty stomach 
just go to McDonalds, man"}
