{"text":"Taste of Vietnam is a nice clean little lunch spot in a small strip mall on Birchmount. They serve a mean pho, with a decent, hearty broth and lots of beef.

There are a few problems, the rare beef doesn't come out rare enough and the tendon is a little chewy, and they never give out enough sprouts, lime and basil. 

The portions are excellent, and the pho is super cheap, $5 for small, $6 for a large and I've never had the extra large. The large is truly enormous, more than enough for a solid lunch, and they have really good pork spring rolls.

Despite a few minor problems, it's the closest/best pho near my work, and for a delicious lunch it's hard to beat Taste of Vietnam's fast and tasty pho."}
{"text":"I really enjoyed this restaurant!!  Every time I've been here it's been great service and delicious food.  It's a nice casual dining environment (A nice family-run restaurant )and such a good price at the same time.  The service is very friendly.  

This place was pretty darn good!! I definitely recommend giving this place a try, if you haven't already. 

We usually has no wait for a table, but can have a wait to receive food. This is because it is family-run; therefore, they do not have a large staff on-hand."}
{"text":"Like the rating says, I've experienced better. 
I walked into this place today for a lunch with 6 other friends and it was packed. For such a tiny restaurant, wait time was 20 mins which isn't TOO bad I suppose. The servers put together three tables for us and we were given one pot of tea which was finished after the first round. I got the special (100, size small) which includes an assortment of meat. 
When my bowl arrived, there was only rare beef, and one cube (why is it in cube form?!) of mushed together tendon. There were no beef balls and the menu description said there would be. Well okay, I can deal with that but I think service was off as my friend's app came 20 mins within us digging into our pho. Also, for 7 people, we were given 2 dishes of sprouts... 
I had visited this place previously on a Wednesday night and there were few people though the soup was lukewarm but the service somewhat prompt. 
At the end of our meal, the server said to head to the cash to pay as we all wanted separate bills and she did not want to write the receipts by hand. 
I prefer Pho 88 on Spadina over this."}
{"text":"****CLOSED****

Taste of Vietnam is a small Chinese  family runned restaurant right at Birchmount and Huntingwood. They serves both Vietnamese and Thai dishes.

I did not drop by for lunch but on a Saturday night for dinner. Only 2 tables including myself... So sad to see empty restaurant on a Saturday night.

The services is nice and friendly. I decide on the Laksa Noodle ($7.00). Size wise it is like a large. The soup has a really heavy coconut taste with a strong fragances and it is not spicy  but yummy yummy good. The noodles are a mixture of 2 noodles vermcelli and yellow noodles.

I was happy and satisfied after eating the noodle!

I will definitely be back again to try out others dishes!"}
