{"text":"This place is pitiful.  Not sure if the people in the review have ever had good food, but this place isn't it. Got the sampler platter of perogie and they were clearly  made out of cheap and pre cooked materials. The meat was grey and I didn't risk trying it. Everything was over salted. We also got the kelbasa and the cabbage rolls. Also a huge mistake.  The only thing out of the wholemeal that was eatable were the fries. Totally disgusting.  Wish I could  give it a negative review."}
{"text":"Ate here for the first time tonight. Was excited that Polish food had finally come to Charlotte. I wasn't really sure what to expect before I got there since Charlotte doesn't have a huge Polish population, but the restaurant really delivered.  The food was great and the portions were pretty big (I had the Bigos). Prices are great too, especially considering the portion sizes.   Definitely recommend giving it a try. It'll definitely become a part of my normal rotation."}
{"text":"I had Golumpki. It's a cabbage roll common in Polish cuisine made from lightly soft boiled cabbage leaves wrapped around minced pork or beef, chopped onions, and rice or barley baked in a casserole dish in a tomato sauce.  Dish was absulutely delicious, just the way my mom used to make it. And mushroom soup was great too! Glad I found this place.  Staff is friendly. I was greeted when I walked and they wished me a wonderful day when i was leaving. Place is clean. Dining area is kinda small but cosy. Can be good for couples, for  small birthday parties (20 people). Thanks Folks!"}
{"text":"Great pierogi's and the stuffed cabbage is something everyone should try, its in a small strip mall but its worth stopping by the food is authentic and delicious."}
{"text":"This place is AMAZING!  This place is as authentic as it comes for polish food.  I literally felt the need to peak my head in the kitchen because I thought my deceased grandma was actually back there cooking!  I have been here twice and have tried almost everything on the menu.  It is all good!!! If you don't like this food, you literally know nothing about polish food! Plain and simple!!!  The people and even the beers are authentic as well.  Small, good, local feel to this place which is exactly what it needs to be.  We will be back.  And I will always order twice as much as I can eat because the pierogis are just as good for leftovers.  I do wish it was closer to Lake Norman as I travel quite a ways to eat here.  But obviously you don't hear me complaining to much!"}
{"text":"Wow, what else can you say.  A little place in a small strip mall, with HUGE flavor. Been here a few times now I believe it gets better every time. Have ordered a different things each time, last night  we went with a group and were sharing our plates.  I ordered the meatballs with mushrooms, waitress said it would take about 20 min to make, no big deal.  When they arrived I was glad we waited hell I would have waited 45 min for these bad boys.  A full plate 5 big meatballs 4 big scoops of them \"taters\" umm huh. The table demolished them in no time flat once the plate hit the table. Overall a great little place to grab great food relax and enjoy Poland in Matthews NC."}
{"text":"Wow!  Wow!  Wow!  The Mr. grew up in a very Polish town in central New Jersey, and the Mrs. had a Polish aunt (Uncle's wife).  Polish food was a great part of our young years in NJ. So when the Mr. took the Mrs. to Date Night at the local Polish restaurant, we had high expectations.  This was our first visit. Taste of Europe fully met and exceeded our expectations!  This family-operated family-friendly place offers authentic, delicious home-cooking. We both relished the pate, pickle, and bread appetizer.  The Mrs. loooooved the potato cheddar pierogies, stuffed cabbage, and grilled kielbasa.  The Mr. really enjoyed the pork cutlet and the mushroom-stuffed potato pancakes.  We ended with the apricot crepes.  Excellent dinner! Service was good, and the female owner was attentive. Mr. and Mrs. intend to add Taste of Europe to their list of favored eating places, out and about Charlotte. The Mrs. later recommended Taste of Europe to a colleague of Polish descent (originally from Buffalo), who took her Polish-born-and-raised grandmother there.  They raved about the food, too. We recommend this restaurant. ."}
{"text":"Meal was fabulous. Very authentic. The restaurant was very small, quaint, and the waitress was very charming. We both got the sampler platter, and it was sooooooo good. The sausage, pierogi, and stuffed cabbage were all very different, and very, very good."}
{"text":"We had lunch here today  Best way to describe is this place is a SOLID 10 Great service and the Polish menu quite authentic Blindfold my late Grandmother and she would think she was was in Poland This place is a must visit Again great restaurant I highly recommend  Patrick  Tega Cay,SC"}
{"text":"Great European style comfort food. Thoroughly enjoyed lunch.  Loved the sampler platter with sausage, stuffed cabbage, and choice of Pierogi. Quick service and a clean environment. Will be coming back often."}
{"text":"I have been waiting for months Togo to this place and now I wish I hadn't waited! The food was fantastic, making me nostalgic for all the amazing food I are growing up. We ordered some potato pancakes as an appetizer and then I had the hunter's stew- sauerkraut and several meats with small puffs of mashed potato on the side. Reminded me of waking up to the smell of cooking sauerkraut when I was growing up! My friend ordered the sampler platter and everything was delicious- some fried pierogi, stuffed cabbage, and kielbasa.  Everything was so good I even got an order to go so I could eat some the next day.  The ONLY reason I gave this four stars was the lack of attentiveness by the waitress. I'm not sure what that was about since she had plenty of conversation with another table and made sure they were filled on their beverages, but she wasn't mean by any account to is. It just would have been nice to get our waters filled and maybe a little chatter."}
{"text":"This is a Polish restaurant with very good food. ....better than the restaurant we used to frequent in Michigan.   The decor is totally different than the pic posted with gold walls and pictures and history of various Polish cities.   It is small and run by a husband and wife team.  He cooks and she waits tables. If you are Polish or like Polish food,  this is the restaurant we've been missing since we moved to Charlotte 18 years ago. We've already been back several times."}
{"text":"This was excellent - authentic Polish food and delicious! Great for a little unpretentious lunch spot. We would come back!"}
{"text":"Don't be fouled by its strip mall location, this place has some really good food. In addition to the solid dishes, the family atmosphere and friendly customer service will make you feel welcomed and comfortable.   My only suggestion, they need to do a better job decorating the interior."}
{"text":"There is something that appeals to me about authentic regional cuisine brought to us by locals that really care about what they are doing. A Taste of Europe is one of those places. No one told me as much, but it is obvious from first sitting down that I was in for something special.  I had the pierogi mix, which is a single pierogi of each of their many different kinds. They are available either fried or boiled. Although I was unable to figure out which was my favorite (mainly because they were all so good), I guess it doesn't matter. It's really hard to go wrong on these.   My wife had the Hunter's Stew. It came with some slices of crusty bread. As soon as it came to the table the aroma of this dish made me rethink my order. It just smelled delicious! I tasted some, and it was really good. If you are thinking that this is a stew that comes in a bowl, you are not picturing it correctly. I was surprised to see that this stew sat on a plate and was not what I was picturing as a stew. It was better than i was picturing.  The service was perfect, the decor was from people who obviously cared about what they were doing, the place wasn't too big so one gets lost. All in all, it was perfect for my tastes. I just love this place.  So stop what you are doing and just go have a meal there."}
{"text":"Best polish food I've ever had!!! My girlfriend is polish and she even said she's never had better polish food. Agatha was our server. She was very friendly and even sang happy birthday for my girlfriend. Service was great and food was delicious. Will definitely be back!"}
{"text":"It's a real treat to have Taste of Europe in Matthews. Everything we've had here has been perfectly delicious. Favorites include the pan-friend pierogies (any kind), potato pancakes with applesauce and sour cream, and the Hunter's Stew. I could eat here very day and never get tired of it!"}
{"text":"I had dinner at taste fo Europe last night and found it very enjoyable. I had the sampler platter (grilled kielbasa, mushroom pierogi, and stuffed cabbage). Very tasty. Service was friendly, dinner came out a little slow, but not more than ~5 minutes more than expected. They also offer Polish beer. I had a Karpackie Super, which was very good and stronger than it tasted (9%). I'll be back, since I'd like to try the stuffed pancake and the crepes."}
{"text":"We stopped in to check out a recently opened restaurant and were surprised to find delightfully authentic Polish cuisine. I highly recommend everything we ate: hot red borscht, meat pierogi, golabki and apple pie. We are definitely going back To sample the rest of the meals on the menu. The atmosphere was pleasant with polish music in the background. The owners are from Poland and were very nice and helpful. Ok, we returned today and this time we ate the Hunter's Stew and the variety pierogi plate. The Hunters Stew is simply AMAZING! ALL the pierogi were delicious...Russian, cheese, spinach & meat. Can't say enough about this place."}
{"text":"Very nice restaurant with homemade, fresh and delicious polish meals. This evening I felt like at home!"}
{"text":"Bardzo pyszne jedzenie, dobre piwo i najlepsze kelnerki!  Delicious food, good beer and the best wait staff! We love Taste of Europe! I am a first generation Polska Dziewczyna (Polish Girl!) born and raised in the heavily cultured state of New Jersey in the 80s. The only way I could possibly know more about Polish food is if I was born and raised in Poland and, believe me, my mom, grandmother and aunts are as good as it gets with Polish cuisine, so I know what's what. That said, this place is the real deal. The menu is the perfect variety of everything you could possibly hope for when it comes to Polish food and the sweet cheese dessert pierogi are authentic, remind me of my mom, and to die for. And for my one picky, non-adventurous eater child (I'm working on him. And my other one loves kielbasa and pierogi so it's not all bad) they have a great \"American food-friendly\" kids' meal. The only thing I would add is pickle soup (zupa ogorkowa). If this is already sometimes a soup of the day then I keep missing it and need to find out when I can get it, stat! Thank you Taste Of Europe for another great meal! Dzi?kujemy! Everyone else, eat here and smacznego!"}
{"text":"Yum - I can't wait to come back here. Cute little strip mall restaurant, intimate but casual feel. Husband and I visited on a Friday night and the customer traffic was steady but not packed. We didn't have to wait for a table for 2. We ordered the assorted pan-fried pierogies as an appetizer. The pierogies are perfectly stuffed with yummy goodness. Our entrees came quickly after: the hunter stew and pork cutlet platter and the stuffed potato pancakes. So good! The pork cutlet was butterflied and breaded, perfectly crisp and juicy. The potato pancakes were deliciously flavorful by themselves - but even better filled with thick cuts of pork and mushroom stew. And quite large portions for the price. Our waitress was very helpful and personable. We loved it and will definitely be back."}
{"text":"Totally unique restaurant for the Charlotte area.  I would challenge you to tell me where I can find homemade pierogis.  Reasonable prices, good service, but plain atmosphere.  Need some help on the wine and beer list, but overall, I would say it's a great addition to the restaurant scene!"}
{"text":"Very ordinary. I've traveled Poland and all over Europe twice and this was just a dissapointment. Food was nothing special, service was very mediocre. Had high hopes for it and love their story but it is just a B for effort. Could be so much better. Cheap feeling (and yet bad value for $) and poor choice of menu combinations. Way better places around."}
{"text":"The atmosphere is good and the service is top notch.  I had the pate appetizer and Karpacki beer.  A grwat start to a wonderful dinner.  The sampler plate is a generous portion.  You will leave full and happy you came!"}
{"text":"I just had the most amazing,authentic Polish meal ever. I'm from Ohio and visiting my daughter in Stallings. She says that she misses my moms pierogi and potato pancakes (placki) down south, well guess what, not no more. I could've bet my mom was in the kitchen cooking this meal. The Taste of Europe is a must. All the food that was brought out is exactly as I remember and still eat back home in Ohio. Bardzo  dzi?kuj?. ( Thank you so much)  Steve F.   A huge fan from Ohio"}
{"text":"Let me start by saying that Charlotte is a pretty weak food town.  Look, I ain't hatin' on Charlotte: just tellin' the truth.    You really have to get lucky to find a place that does anything authentic/ethnic.  There are a few decent Mexican places if you know where to look, and some good Vietnamese here and there.  Or you can go downtown and pay through the nose for one of the decent chef-driven joints.  But simply put, Charlotte just doesn't have the diversity that a city this size would have, were it found up North.  The food scene is just pretty lame.    But it is improving slowly.  And the way to help it improve is to support a restaurant like Taste of Europe.  They are turning out delicious Polish food here at reasonable prices.  I agree with everything said in the previous reviews.  The food is great, all around.  The place is clean.  The service is wonderful.  We rarely go out to eat because I can cook better food than most restaurants can around here.  My pizza is better.  My Chinese is better.  My Italian is better.  My steaks, hamburgers, BBQ--better, better, better.  My Polish?  Yeah, it's darn good, but Taste of Europe is better.  So we will be back!"}
{"text":"If you like polish food this is the place to go. If you have a gluten issue though, think twice.  Polish food is swimming in things that won't agree with you"}
{"text":"What an amazing little spot in Matthews, NC.  We happened to be staying at a local hotel for a conference and found Taste of Europe on Yelp.  We each had the Polish Sampler (Kielbasa, Stuffed Cabbage and Pierogis), and were blown away.  Service was also exceptional.  Would definitely return.  In fact, we pulled a Groundhog Day and returned the next day to order the same thing!  I went with Beef Pierogis the second time around, which were even better than the Cheese from the day before."}
{"text":"Since I'm Polish, I grew up on all this food. My grandmother and my father have passed. This restaurant takes me back to my childhood and youth."}
{"text":"The Taste of Europe has wonderfully home-cooked and VERY authentic Polish cuisine.  My wife had the sampler platter of pierogis (boiled as opposed to fried) and I enjoyed my Polish stew with a breaded pork cutlet and wonderful mashed potatoes.  Both of our luncheons were absolutely yummy.  There is nothing \"fancy\" about the decor and Taste of Europe is located in a nondescript strip of stores just off Prineville-Matthews Rd.  Our friends who were with us enjoyed their luncheons, too, plus he had a delicious cup of some very tasty polish beet soup.    You won't' be disappointed by Taste of Europe unless you want to spend a lot of money for lunch or dinner.  You can't go that at Taste of Europe!  Yup, 5 \"stars\" in the right rating for this un-discovered gem in Matthews."}
{"text":"We had lunch here last week and had a great experience. We ordered the meat pierogi, potato & chz pierogi, and gr. beef cutlet. Everything was delicious and tasted authentic. (My husband is from Poland, and I have visited a couple times.)  If you have picky children, they also offer menu items like chicken fingers & FF.  The menu prices were very reasonable."}
{"text":"If there were 100 stars, I would give this place the highest.   Having lived in Poland for two years, it is rare to find a polish restaurant with the quality and unique flavors you would find in Poland.   Taste of Europe was simply amazing.   It was like I was back in Poland eating my favorite polish dishes.  I ordered the sampler with pierogi ruskie, golabki, and polski kielbasa.   The flavors of each were spot on.    The best pierogi I have ever had.  They were sautéed to perfection.  The golabki was extremely moist and flavorful.  The kielbasa was so delicious as well.  The signature cross cut along the top of the kielbasa tells you the cook is definitely from Poland.   The restaurant is small, but very nice.  I would have liked to see more polish decorations, but they did have some pictures of popular polish destinations.    I can't say enough about how impressed I am with this Polish restaurant."}
{"text":"YES. This place is amazing. We came here for dinner after seeing the reviews on Yelp. As many others noted, the building is nothing special. We go to church next door and it's never crossed my mind to visit because of the appearance. That being said, I wish we would've come here sooner! It's a small shop with contemporary decor. We went on a Friday around 8 and there were few people there. Service was fast and attentive. Our waiter Yekaterina was delightful. We tried the potato pancakes which were good, but we didn't seem to enjoy them as much as other reviewers stated- I wish they had a different sauce. We then ordered two mixed pierogi plates. We enjoyed them all!! We ended the meal with a crepe that was perfectly soft, crispy, and definitely my favorite part of the meal. With all those dishes plus beer & wine, we got out for under $50, which I would say is a steal. We'll be back!"}
{"text":"Delicious pierogis.  Light, yummy crepe for dessert.  Lovely server, who is the owner as well.   Will go back to try the stuffed potato pancakes and the cabbage rolls."}
{"text":"This edition of Excited about Eating takes us to Matthews, NC, and to Taste of Europe, a small causal restaurant specializing in Polish cuisine.  Dora here. Squeezed in a strip mall, Taste of Europe is small, but not crowded. Intimate, but not like everybody is in your space. The two room restaurant was clean, bright and welcoming, and service was quick and friendly.  I'd already picked out an appetizer, the much-anticipated Potato Pancakes, but unfortunately, the tater pancakes were not available until after 3pm. So we opted for the Bread with Pate and Cucumbers in Brine. The bread was freshly sliced; the pate had a strong flavor and reminded me of potted meat, and the cucumbers were mild with the perfect crunch.  Dora here. Hmmm...not a fan. Should've opted for dessert instead. Why did we pass up crepes for pate?  For my lunch, I ordered the Polish Sampler Platter, which included stuffed cabbage, grilled polish sausage, and meat pierogis. The meat filling for the stuffed cabbage was firm and packed with flavor and doused with a tomato-based sauce. The sausage had some nice grill marks and just the right amount of char. I ordered the pierogi fried, and they were cooked perfectly. I enjoyed everything on my plate.  Dora here. I came for the pierogies, which are dumplings filled with either a sweet or savory component. Since I couldn't make up my mind, I opted for the Pierogi Mix, a combo of three different kinds: Potato & Cheddar, Russian and Meat. I asked for mine broiled.   Wow! Like plump ravioli, but every bite a surprise, a different flavor, smooth and creamy. My favorite was the Russian, a little pillow of Farmer's Cheese, which to me, tasted like Cream Cheese. YUM!  Have you tried Polish food? What's your favorite? Which of these dishes would you try?  We rate this restaurant 4 forks out of 5 for a family friendly restaurant serving great food. ~Ernie & Dora Hiers, Fiction Faith & Foodies Blog"}
{"text":"This was my first time coming here and it was a great experience! I was a little hesitant about polish cuisine but the food was delicious. The service was excellent and they explained the menu very well. Please give this place a try, its outstanding."}
{"text":"Wow!!! What a gem of a place. Great food and reasonable prices. We had the sampler plate and the beef stew. Both were fantastic. The golumbki were home made and as good as mom's. Beef stew also great comfort food. We're going back to try the potato pancakes and more of the pierogi. Yum."}
{"text":"My wife and I were tired of the same old cycle of dining choices, so we decided that we wanted to try something different.  My wife's friend as born in Poland, and she recommended this place.  Let me say, this place is a hidden gem. It's tucked away in a little strip mall on Monroe road.   The place is small, it seats about 30-40 tops.  The service is was excellent. However, if you are in a hurry, this is not the place for you. It's not incompetent slow, it's just a family style, cooked to order place.              The food was outstanding. We ordered the potato pancakes-Awesome I hade the Hunters Stew with Pork Cutlet. The Pork was pan fried and delicious. I was able to cut it with my fork.  I can not remember the last time I cleaned my plate at a restaurant. I was embarrassed because was eating so fast.  You beer lovers out there must try the Karpackie Super Beer, smooth and refreshing. Beware you light weights because it's 9% alcohol. My wife had the Pierogi; again very good.  This has now been added to our regular rotation of \"can't miss\" dining choices."}
{"text":"Meal was decent, VERY pricey for what you get though.  Pierogi's  were good. Kielbasa was really good. Stuffed cabbage was soso. Average for polish food. The waitress had a little attitude as well."}
{"text":"Having a Polish mother, I was very interested to try this new Polish restaurant.  We ordered a mixed Pierogi platter ( 9 of various styles) and a couple golobki ( Halupki we used to call them).  The pierogi were very nice, and quite a variety are available to suit different tastes.  The golobki ( stuffed cabbages) were large and filling, but I must take issue with the rosemary seasoning used in the filling.  I've not experienced that flavor used in traditional Polish cooking before, particularly golobki, and didn't care for it, and neither did my Chicago-born wife who grew up with polish foods also.  If I go again I will try some of the stew offerings, but wish they had more variety over-all on the menu."}
{"text":"Very delicious . Pan fried pierogi. Neat small place in Matthews town. Server was helpful."}
{"text":"Looks like I tried the same dish as most people - the sampler with perogies, stuffed cabbage, and kielbasa - and it was very good. The stuffed cabbage reminded me of my Hungarian aunt's stuffed cabbage. For dessert, I had the crepe with apricot preserves, very reminiscent of the Hungarian style crepes (palacinta) dad used to make. All in all, I enjoyed my taste of EASTERN Europe and will definitely be back to try some of the other dishes."}
{"text":"Love the sampler platter. I have eaten pierogi all my life and these are some of the best."}
{"text":"Perogies- Excellent!!! Potato cheese with onions on top and sour cream. Especially good if you want to go out for them! Best I've had other than Costco's: Peter and Pat's.   French fries- Fresh and delicious! Crisp outside with a moist potato inside.   Pleasant servers. Minimal decor, but good food!!"}
{"text":"I've never been to (or possibly even SEEN) a Polish restaurant before, so it was interesting to finally try one.  Although the restaurant is in a mini-strip mall, they've done a nice job of decorating the interior so it doesn't feel like a strip mall.  The decor is modern-looking (IKEA?) and it seems very clean.    The menu offers a variety of pierogi choices, and you can get them either boiled or pan-fried.  There are other Polish dishes as well, but we focused on the pierogies.  You get 9 pierogies per entree, a side of sour cream, and you can get a combination of flavors by paying just a little bit more (50 cents?).  I opted solely for the Russian pierogies, which was potato and farmer's cheese, I believe.  After ordering, I wished I had gotten half of them spinach, because I do love variety.  Nevertheless, the Russian ones were delicious and flavorful.  It filled me up and was \"just enough\" food, but may not be enough for a Hungry Man.  We also ordered the potato pancake appetizer and received four large potato pancakes (also delicious).    We'll definitely return and try some other items from their menu."}
{"text":"Great food. Miss polish food from New York. They have great stuffed Cabbiage and everything is good. I will keep coming back"}
{"text":"was wonderful I would give it a 5th start but service was very slow it was the young ladies first day so overall a great experience and i will return. food was spot on and very good flavor   I had the special  Ok went back for another visit service still a little slow but I'll give it the 5th star food was awesome sorry mom gompkies were better than yours"}
{"text":"Simple food well prepared, authenic (as far as I can tell), friendly service, very pretty restaurant. Pierogi, stuffed potato pancakes and stuffed cabbage rolls were all good. You have to be in the mood for a hearty, heavy meal, but it's great comfort food."}
{"text":"I have been to this place 3 times now.  I am working my way thru the menu.  Everything I have had here has been very good.   service is nice small place but the best polish food in charlotte."}
{"text":"The food was amazing!!  We ordered the potato pancakes, hot borscht drink, Bigos with pork cutlet, and the Polish sampler.  Everything was wonderful!  The pork cutlet was unbelievable!  Can't wait to go again"}
{"text":"Fan-freaking-tastic!!!!!! I knew Polish food is good being half Polish but I never knew how good authentic Polish food really is! I'd give it 10 stars if I could!!!"}
{"text":"My wife and I had a great dinner here. It took a little while to get seated for dinner, but it is a small place so we understood. Definitely worth checking out."}
{"text":"Finally! FINALLY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Do you hear the word that is coming out of my mouth?! Finally, a Polish restaurant in the QC! I thought I would never see such a thing here. OK let me compose myself and get on with it..   Because of time, we decided to do a take out order. We had the following:  Potato Pancakes which were HUGE and DELICIOUS! They are offered as an app and you get 3 but because of their size, I could easily have these as a meal. They were crispy on the outside and tender in the middle. The potato is pureed (as it should be) with a hint of onion. They are served with either apple sauce or sour cream. I opted for neither simply because I grew up eating these with only a pinch of salt and that's exactly what I gave them and they were perfect!  2 different types of Perogies which we ordered fried (because the fried potato pancakes were not enough). For the health conscious, you can have them boiled. The potato and cheddar was my favorite. They were very tasty. Plump little pillows of dough with a large amount of potato and cheddar in the middle? How can you not love that? We also had an order of the meat filled Perogies, which were fine, a little bland but still fine.   2 orders of Golabki or in the US they are Golumbki and in NEPA we call them Piggies. Aside from the potato pancakes, the Golabki was what I was really interested in tasting. I will have you know my Grandmother, made the BEST piggies on the planet. Just sayin. So Golabki is cooked cabbage leafs that are filled with meat and rice and then stewed in a tomato sauce. Is your mouth watering yet?These were very good, not better than my Grandma's but still very good. The cabbage was cooked to perfection and they were nicely filled but the meat to rice ratio was off. These were filled with mostly rice. I personally would have liked a little more meat BUT overall the piggies were DELISH. I would go back for these any day.   Overall our experience was a success and we can add a new restaurant to our list of places to go. For me personally, the food took me back to my youth and the great memories I have of growing up in and around our Polish community with their beautiful customs and fabulous cuisine."}
{"text":"Went there for lunch today with my wife and we loved it! The restaurant was clean and the server was attentive. We ordered the beef perogies (boiled) and the menu said that they contained seasoned beef were a little bland for my taste but still were good. The other dish we had was the beef cutlet which was absolutely devine and perfectly seasoned. The side dishes of mashed potatoes, red cabbage and sauerkraut were fresh and excellent! Dishes were reasonably priced and we will be going be back for sure to try the other items on the menu."}
{"text":"Expensive and uber-sterile restaurant with good food.  While I enjoyed the food, I don't have any desire to go back.  Perhaps if they improve the sterility of the place.  I've been to Europe several times and the restaurants/pubs I've been to either have a homey feel are outdoors, or are fancy.  This was none of the above and if I'm paying a fair bit on my food I want a nice place to eat it in.  Perhaps they'll spruce it up a bit."}
{"text":"The best place to get pierogis in Charlotte! After moving from the north where Polish restaurants are plentiful, I was so happy to come across this restaurant. My go-to are the potato and cheddar pierogis (boiled) which are to die for. The food is authentic and reasonably priced."}
{"text":"Wonderful place for authentic polish cuisine. The staff is friendly.  The food is excellent. Be prepared to take your time, don't be in a rush.  You will definitely enjoy."}
{"text":"First of all, Charlotte is not a \"pretty weak food town\" as JGP says. Charlotte has tons of restaurants, and lots of diversity. Taste of Europe adds to this, and it's wonderful.  We ordered the pierogi sampler and potato pancakes to start. They were delightful. Sauerkraut and mushroom was my favorite. My friend liked the spinach the best. Another friend fell in love with the cheddar and potato.   I ordered the sample plate with sausage, stuffed cabbage, and pierogi. It was delicious, and I am craving it now just typing about it!! My only critique was that my plate needed either sauerkraut or red cabbage.  We also got bigos, which is bacon and sauerkraut stewed together, and is delightful, the pork cutlet, which was perfect, and the chicken cutlet, which was seasoned and fried beautifully.  Five stars. This is definitely in our regular restaurant rotation from now on!!!"}
{"text":"It's a really small place. Very intimate and unassuming. Especially with a diner next door. But the food is fantastic. The pierogis come in several flavors and are delicious! The grilled kielbasa is great too. And for dessert, Nutella crepes! Enough said!"}
{"text":"The best cabbage rolls ever. Not heavy, spiced correctly. We also had the pierogi..which was equally as good. I will definitely be back"}
{"text":"Rock solid Five Stars*****! Three trips to Poland and a dozen visits to Polish restaurants in Chicago give me the confidence to say that it doesn't get much better than this when it comes to Polish food. The ingredients are well selected. The food is superbly and professionally prepared and presented in an appealing manner, and the restaurant is very comfortable inside, with a clean Eastern European decor.   If you haven't been here you owe yourself a visit!"}
{"text":"I really like the concept of having a Polish restaurant in Charlotte. I am half Polish and used to my grandmothers pierogies and meats. I've gotten the pirogi platter mostly. They were always very good. I also found it neat to get a Polish beer. I've never had a Polish beer in my time in Charlotte, Atlanta or Daytona Beach.their beers are quite tasty."}
{"text":"Sad news: Looks like this incredible restaurant is now closed. They had THE BEST Polish food! Where do we go now to get delicious pierogi?"}
{"text":"This place is always delicious! We make it a point to come here when we are on this side of town. I don't think it's possible to leave here hungry because there's so many good options. We went for lunch for the first time and the prices are slightly cheaper for still a lot of food."}
{"text":"The food is so good here! Everything I had was made perfectly, my only wish is that I lived closer, I would eat here every day."}
{"text":"Polish food.  All the regular items like stuffed cabbage, hunter stew, kielbasa, potato pancakes, borscht beet soup, pork cutlet like schnitzel and a variety of perogies.   I don't know the Polish names for these items, but the menu is clearly English descriptions to describe the items.  Lots of choices with \"plates\" of food.  For instance, I had two stuffed cabbage rolls served with mashed potato.  The rolls were a nice blend of meat and rice.  Flavorful and with a light tomato sauce on them.  Dad had perogies with kielbasa and mashed potato.  In that plate the perogies had to be of the same stuffing.  Would have liked a plate of perogies to sample all of those stuffed dough yummies.  Wife had port cutlet with hunter stew and mashed potato.  Cutlet was pretty straight forward, cooked nicely and flavorful.  Hunter's stew was the big loser for us.  It was like sauerkraut with some meat in it and very sweet.  Could not handle a bowl of this \"stew\" and would recommend that if you are considering the stew, get it on a plate or a small sample from the waitress.  Very authentic, clean, very nice server who is from the Soviet Georgia.  Portions were great and you will leave full.  Share amongst your group so you can experience a \"taste of Europe\".  I mentioned the borscht beet soup in a tip.  It is thin, just some herb flakes in this red liquid and is basically flavorless.  You can order it hot or cold, I went for hot.  And you could ask for sour cream which will turn it a bright pink.  Maybe that would make it more flavorful, but I doubt it."}
{"text":"I went there the first day they opened, a little unsure of what to expect. With a name like Taste of Europe, I expected a more expansive menu. Not really misleading, it says Polish cuisine on the sign, but with that name you got to deliver the goods!   They have alot of the staples of Polish food that I know with my limited experience. Polish sausage (obviously), pork cutlets, and pierogis, essentially all hearty comfort foods. I tried their stuffed potato pancakes that consist of a couple pancakes with beef stew sandwiched in the middle and topped with cheese. It was about as heavy as can be expected, but not as overwhelming or greasy as it could have been. It was a pleasant surprise, nothing groundbreaking but pretty tasty.  This place has potential, they need a more diverse menu and more drink options, but the food ain't bad, and the people are friendly."}
{"text":"I am so happy we found this place when we were in Charlotte for the weekend.    Currently live in the Charleston area but we are from Chicago where you can get some of the best Polish food in the states.   We had been dying for some European food and we found it!  The appetizer with the pate' is wonderful, so creamy and, well, yummy. We both got the combo with sausage,  cabbage roll and pierogi with different flavored pierogi - cabbage and potato and bacon. Really good.  A little polish grandma must be in the kitchen cooking, but its not, I bet they are her recipes though.   And the crepes for dessert are a little crispy on the ends, very tasty.  And they also have Polish beers, give them a try.   If you live in Charlotte anywhere and have not eaten here. ....get here!"}
{"text":"Taste of Europe is amazing.   From the smells to the tastes, everything.  We cannot get enough.  Don't be afraid to try everything, right down to a cup of hot red borscht!  I cannot pick a favorite item there.  The soups are beyond wonderful, entrees, appetizers as well.  My wife and I have been there going on 10 times and have taken plenty of friends who all would report the same thing.  Soak up all they have to offer, whether you have heard of it before or not.  You will be blown away. I promise!!"}
{"text":"Great Polish  Several restaurants in the area describe themselves as Eastern European. In all fairness, this one did so originallu but from a business standpoint, I can understand.  They have now come to the conclusion that they are Polish which they were all along.  Food is great and very authenic. My wife who is from Pittsburgh and loves Polish Cusine, even ordered another Cabbage Roll to go which means she loved it.  The food is great. Most cabbage rolls in the area are not worth ordering but not the case here.  The cusine is good and the cusine is authenic. A definate go to restaurant."}
{"text":"Wow! So impressed. The food is freshly made, hot and exceptional. The pork cutlets were the best I have ever had. We tried all different kinds of pirogies and loved every one. I think we may have ended up trying one of everything on the menu. They did not start serving potato pancakes until 3 PM. Since this is a small mom-and-pop restaurant, please give yourself plenty of time to eat. It takes a while to get food because everything is homemade.  We also enjoyed one of their Polish beers."}
{"text":"I had the stuffed cabbage platter with smoked polish sausage and fried farmers cheese pierogi which was a sweet twist. I ordered the sampler pierogi platter boiled  and it was wonderful.  Meat, spinach, sauerkraut mushroom (my fav) cheese and potato (second fav). The potato pancakes were the best loved the texture and would definitely get them with each visit. The sauerkraut is sweet and tangy. Would love to try the other menu options but it's hard when it's the only place to get authentic polish pierogi!  You'll never have another frozen one again. Had a glass of wine saw they had polish beer too and should have asked if the wine was polish. I agree with another review where I wish sauerkraut or cabbage came with the platters"}
{"text":"We live 3 minutes from this place and have been meaning to try it.  We shouldn't have waited so long!  We will be back.  There were 4 of us and we started with salads and potato pancakes (served with sour cream).  Very good.  Two of us had Karpackie brand beer.  Authentic, light, Polish beer.  The bottles are large.  Yum.  My bro-in-law had fried sausage with mashed potatoes -- he said it was delicious.  My sister had pierogi sampler with meat, potato cheese and Russian. She said the dough was just thin enough to be nice and crispy when fried and well filled!  A plate of nine pierogis was plenty--a full dinner, she said.  She was in pierogi heaven.  My husband got the sampler platter with kielbasa, stuffed cabbage and pierogi.  The sauce on the stuffed cabbage was different that he was used to--lighter in color and with dill, but he thoroughly enjoyed it.  I had a plate of spinach pierogis that were fried--very tasty.  We finished with blueberry and strawberry crepes.  Very nice!   The restaurant was clean inside, service was prompt and friendly.  Decor is modern and sparse, but we enjoyed the maps of Europe on the wall, helpful as my bro-in-law was explaining to us where his family was from.  The restaurant takes credit cards, but not AMEX."}
{"text":"Three and a half stars. We've eaten here now a number of times now, they expanded the menu somewhat and they have 5 Polish beers to chose from.  A word about the Pierogis - which is what you probably should order if you never tried them. They offer a mixed plate with meat, mushroom, cheese which you can have either \"boiled or fried\".    Boiled doesn't sound good but it actually is: think steamed dumplings, the flavors of the stuffing comes through better without the oil.   I tried them both ways a few times and personally preferred boiled to fried - which I found a little too oily."}
{"text":"Visited this newly opened restaurant for some authentic pierogies, a favorite European dish of mine.  The decor was quiet, ethnic, and simple- enjoyably authentic.  Only ordered 6 fried pierogies with sauerkraut to try the place out.  They weren't bad.  The female owner was there when I arrived. She was very pleasant. I'd return for a full dinner."}
{"text":"Nice place with very good food. I grew up with Polish cuisine and this is the real thing.  Pleasant people."}
{"text":"As an Eastern European, I can assure you that this food is genuine. I was so excited to see foods familiar to my culture."}
{"text":"I loved this place!!!! Talk about authentic and just feeling home. I haven't had stuffed cabbage in ages. I'm very particular about it too since I was raised on it and having it homemade from my grandma all the time. The were delicious. Cooked to perfection! Great portion as well and comes with a side of fries. Can't wait to go back again."}
{"text":"I ordered the Hunters stew with pork cutlet and mashed potatoes. The presentation was good and the value was on point. This is a nice little cozy restaurant with great pictures of Poland."}
{"text":"I called a day early to reserve a table at 1pm on a Saturday for 10 for my mom's 75th birthday.  When we arrived, they had given our table to another group, assuming it was ours, so we had to wait while they put together another table in the back, and locate chairs for us, too.  The place is tiny but they managed to fit us all together eventually.  We had a sampling of most of the foods between us, and the pierogi's were excellent, but I wasn't a huge fan of the tomato sauce on the golabki.  Full disclosure, my mom makes most of the food on the menu at home, so I'm a bit spoiled and used to great Polish foods. However, the pork cutlet was amazing and even their kids meal fried and chicken tenders were great.  The service was slow, with only 2 servers in the full restaurant, but they were very nice and accommodating. They even sang Happy Birthday in Polish, too! I may go again if we're in the Matthews area as the prices were also very reasonable, but probably won't make the drive from Charlotte too often."}
{"text":"I am so happy to have found this place so near home. I love pierogis! Even stuffed cabbage and the good-for-your-tummy sauerkraut. I visited on a Saturday afternoon. We sat down and was attended to promptly. I ordered mixed pierogis. The wait was about 10-15 minutes. When our food arrived we scarfed it down.   Absolutely delicious and 100% authentic polish pierogis.   I ordered stuffed cabbage and sauerkraut to go. Both were incredible when I ate it at home.  I have gone keto but I have no qualms going over my carb intake for these pierogis.  I will be back---allot."}
{"text":"3.5 stars for me.  I got the sampler platter.  Sausage was good but skin was a little too chewy - should've removed it.  Stuffed cabbage was good but too much meat for me.  I got the sauerkraut and mushroom pierogi's.  They were good but not enough filling.  But, then again, I'm not sure that I've ever eaten Polish food before.  So, wasn't sure what to expect.  I tried the hot borscht which wasn't bad.  But, kind of felt like it should be a soup / bisque more than a drink.  Probably just my taste buds weren't used to Polish food.  But, I would try it again. Service was fantastic,"}
{"text":"Im trying to think of reasons to not just give 5 stars out like that but cant think of any.  My wife and I used to live in Chicago where there is a HUGE Polish population and had many Polish friends.  The food here tastes just like their home cooking.  Even if you've never had Polish food before check this place out.  Food tasted crazy good and their beer hit the spot too.  Its a small place with a family vibe to it.  Prices are extremely reasonable for all the food they serve too."}
{"text":"I enjoyed my dinner here and can recommend this restaurant based on the quality and authenticity of the food. I started with borst and it was good. I very much liked the kielbasa and pierogi along with the wonderful bread. The stuffed cabbage was high quality but unlike the halupki I grew up with; they were good but not great or to my taste."}
{"text":"Definetly you have to try this place. Excellent food and charmin enviroment. Food is so fresh and the service is awesome!"}
{"text":"Love this place! The pierogi are very tasty, the sweet cheese ones are served with apple sauce and/or sour cream.   The cucumber soup is great for a cold day, we have also heard it referred to as pickle soup at a different polish restaurant.   So far our favorite dish is the pork cutlet, it comes with two scoops of mashed potatoes, a carrot/apple slaw that's light and tangy, and we chose the pickled purple cabbage as our third side. It all compliments each other very well. Great food, friendly service in a small unassuming location. Try it out."}
{"text":"Three months ago I bookmarked Taste of Europe; since then it's been a waiting game. Friday I finally got back to Matthews to eat some delicious Polish food! That's right, Polish!  Located in a small strip mall across the street from Pepero, the dining rooms are small but ample. Clean simple design with warm lighting. I was already hungry, but just reading the menu made it worse. So many types of pierogies, boiled or fried. Cutlets galore. At least 4 polish beers. With a large frosty Karpackie Premium Lager to start, I ordered the Polish Sampler Plate. My friend ordered the Pork Cutlet and Hunter's Stew. The food: the Sampler had stuffed cabbage, fried traditional Russian Pierogies and a grilled sausage. All of it was delicious and tasted just as I remembered. The Pierogies were a little tart from the Farmer's cheese and buttery with a hint of onion. Yum! The pork cutlet was so tender you didn't even need a knife. Last but not least, the Hunter's Stew was a nice blend of shredded pork, cabbage and sauerkraut - definitely not your typical stew! Great effort from this Polish restaurant. The beet soup and beef cutlet are next on my \"to eat list\". So if you're hungry and feeling adventurous, flip a coin - Heads = Taste of Europe, Tails=Pepero. Either way you can't lose!"}
{"text":"So between the husband and i we ate some of everything on the menu. can i tell you that the hunter's stew was great, the cabbage rolls were amazing and get the pierogi boiled, they are so light and fluffy. service was great, and i can't think of one downside to the meal. we did not get the dessert crepes, the table across from us did and loved them though ( i was not afraid to ask what she thought about them) a definite find!"}
{"text":"I wish I could rate 3.5 because it was just a bit better than a three. I had never heard of this place and it's only a few miles from my house.   It's 100% clearly owned by true europeans. (Polish/Russian)  The food was definitely authentic and only imported beer.  Huge plus for me- love the real thing and not the \"U.S\" version.   That being said my grandmother was 100% polish and I was putting this meal against her cooking and maybe that's why I couldn't fall in love. The polish sausage was on point. The pierogis were pretty much exactly what you want in a pierogi but needed a little salt. (They had six different kinds though) Lastly the stuffed cabbage. The dish my grandmother always made and has my heart. This just didn't make the cut for me. Sauce was just a little too bland for me and the rice and meat followed suit. I just need more flavor. Would I eat it again? Definitely, but it was just pretty good.  Overall, I really enjoyed the experience and will most likely be back!"}
{"text":"Awesome food! Great little Mom and Pop place with some amazing, authentic food! Service was great but there isn't much seating here so call ahead or get there before dinner rush. The Russian Pierogi is so so good and traditional! A friend of mine from Europe made them for me several years ago and being here and enjoying them, took me back! Save room for dessert because the crepes are awesome!"}
{"text":"My husband and I stopped in for a quick lunch after church. Very sweet lady waited on us and we had a great conversation with her about Europe. The food...so so good!! We will be back!"}
{"text":"Delicious authentic polish treats! The pierogi was perfectly chewy and crisp with flavorful fillings, the sausage was smoked well, and the cabbage roll was smothered in this tasty vodka sauce. Also, try the potato pancakes. I gave it 4 stars because I've had pierogi from Kraków and European ingredients are fresher. Still, come try!"}
{"text":"I grew up eating homemade Polish food all this time, and I think this place is great. Everything is good. Pierogi, stuffed cabbage, Bigos, all of it is is excellent and home made. I would very much recommend Taste of Europe!"}
{"text":"We were looking for Eastern European food in Charlotte and this is is best! The cabbage rolls are delicious so we eat some at the restaurant and take more home. The pierogi are tasty as well and there is such a variety that we usually order a mix of them. Their crepes are extremely thin so save room for dessert if you can. Staff is very friendly and decor is reminiscent of Poland and its traditions. They can hook you up with Polish lessons if you want, too!"}
{"text":"I don't know if I'd really go with \"Taste of Europe\" for the name here, but then I haven't really traveled extensively in Europe, so I don't know that I wouldn't either. I have had Polish food, but the only thing I remember was Duck Blood Soup (kinda hard to get that out of your mind), and I wasn't interested in having it again.  The pierogis here are pretty much what you expect - mostly potato-filled pasta pockets - though if you've had them elsewhere (out of the freezer, or the one or two places around town that serve them in Charlotte), they are worth trying here, because they are better. Also, you can get them boiled or fried, and has been mentioned, boiled is more like steamed than you probably would think. Still, they are ultimately potato-filled pasta pockets, and thus, not terribly exciting.  What was surprisingly tasty was the stuffed cabbage rolls (not sure if they were really rolls), but it's good, and goes down well - definitely worth a try, even if you don't like cabbage. The potato pancake was good too.  As a bonus, the staff is very friendly. Perhaps because they weren't busy, and I'm not sure if they are ever busy. Perhaps \"pierogi house\" would have been a better name."}
{"text":"tried this place last night. great food. not much atmosphere but nice people. Nice to have some ethnic choices that are true to their roots. My wife's family is polish and slovak. We will go back."}
{"text":"I'd been wanting to try Taste of Europe for awhile since it's one of the few Eastern European restaurants in the area and was finally able to today.  The building is very small with only 6-7 tables total, so I imagine it can get pretty crowded at peak times, but the restaurant is very nice and was exceptionally clean. The lone server at lunch time today seated me as soon as I walked in and was always quick to take my drink and food order and to check on me. I ordered the Polish sampler platter, which comes with 1 Polish sausage link, stuffed cabbage, and 3 pierogi of your choice. To start with, the Polish sausage was awesome! It was so smoky, flavorful, and seared perfectly. The stuffed cabbage was good but nothing special. It was cooked perfectly, but I personally wasn't a big fan of the tomato sauce. The pierogi were a little disappointing to me. Maybe it was because I went with boiled over pan fried since my waitress stated this was the more traditional but less popular way in the US to eat them, but they lacked much flavor. There was really no flavor from the farmer's cheese or onion, and they mostly tasted like plain mashed potatoes. They weren't awful but could've used just a little bit of some spices or flavor to be perfect, and I would expect a little more from a Polish place.  All in all, the food was pretty good and the service was excellent, but I was also a little disappointed in the amount of food in the sampler for $12. The three pierogi weren't that large and neither the sausage nor stuffed cabbage were all that big."}
{"text":"I came here a few weeks ago with a large party, the food came out fast and fairly all together, it was also very yummy, the service was pleasant. I expect to be back!"}
{"text":"Yum! Started out with the potato pancakes as an appetizer ( 3 full size) and polish beer-fantastic. Then main dishes: Russian filled pirogies-goat cheese filled-you can mix and match different types of filling. Stuffed cabbage with ground meat and rice wrapped in a cabbage leaf topped with red sauce and cheese-very tasty. The stuffed cabbage came with polish sausage and 4 cheddar cheese stuffed pierogi. I took other yelper's advise and feasted on Bigos-hunters stew-didn't disappoint and was delicious, served with homemade mashed potatoes.   This is a storefront on the edge of Matthews. An unassuming authentic place with great food. Parking lot is easy in/out off John Street.   The decor is European modern and the waitstaff are all pretty polish girls. Very spacious.   Cost: $$"}
{"text":"Mmmmm, pierogis! Sometimes, you just know what you want and this Matthews gem hit the spot for my Polish food fix. Be forewarned, it's quite small inside so you may want to call ahead to ask to reserve a table or to find out what the wait is. The waitstaff were incredibly nice even though they were so slammed!  I tried a variety of pierogis at my most recent visit. I think my favorite may have been the Russian pierogi. I liked the farmers market cheese in it a lot! My mister tried the hunter's stew, and I sneaked a few bites of his pork cutlet too. Delicious!"}
{"text":"This was my first time tasting Polish food.  It is basically a lot of hearty and filling items.  The service was good, the waitress was helpful in recommending the best options.  I went on a Saturday afternoon and there was no wait to be seated.  The food took awhile to come out, however.  I ordered the sampler platter with sausage, stuffed cabbage, and cheese pierogies.  I also ordered the potato pancakes for an appetizer.  Everything was delicious.  I did not like the potato pancakes as much as the other food, though.  I am used to a German style and a different breading, which I prefer.  This one was light, almost like a funnel cake.  It wasn't bad.   The crepes for dessert were decent, I've had better.  However, it was a very positive experience overall, and I would definitely go back again."}
{"text":"We loooooooove this place. Been here a few times and everything we've had has been excellent. Potato pancakes are a must try.  Service is good and the food is even better!"}
{"text":"Pierogis pierogis pierogis!!! This place has them. It's a cute little restaurant on Monroe Rd and it's worth a visit! I think I've tried almost all of the pierogis and I don't have a bad thing to say about any of them. The wife and I have also had the stuff cabbage. Very good! Try the Polish beer too. A nice, crisp pilsner pairs well with the pierogis. Ok, great...now I want pierogis!"}
{"text":"Stopped here awhile ago and the food was great.  I'm not a Polish food expert but all the food I had was really good.  The perogies were great and the stuffed cabbage was tasty as well.  If you are tired of eating the same old boring food every weekend (pizza/tacos/etc) give this place a try and expand taste options.  My only complaint was lack of seating inside and I think the sodas were in cans."}
{"text":"This is *the* place to go for authentic Polish cuisine! I've eaten here several times and have brought friends and family (all of whom have had a pleasant experience). The staff are indeed all Polish and even offer Polish language lessons on the side that you can sign up for at the restaurant.   The food is wonderful and if you haven't been before I would recommend their sampler platter which includes a hearty portion of perogies, cabbage roll, and meat. They offer varying specials at lunch. For their dinner menu they add their potato pancakes to the menu for an appetizer that is a must!   The staff is extremely friendly and helpful.  I also enjoy that they pay attention to their customers, and remember me each time I come in...even the beer that I like with my meal.  Speaking of which they also carry imported Polish beer that tastes light but is in fact quite strong for a very reasonable price!  The decor is low key, unassuming, and inviting.  It's the perfect place to relax and enjoy a great casual meal with friends."}
{"text":"I ordered the grilled sausage plate and it was delicious!  I also  got a meat pierogi on the side.  it was so good, I wish that was my main dish!  My only complaint was that although the server was very pleasant, there was no sense of urgency.  I went with my drink empty for the 2nd half of my meal and we had to go up and hand our cards to her before we received the check.  Additionally, we each asked for strawberry and nutella crepes for dessert, which were AWESOME by the way, and instead of combining the two ingredients or asking for clarifications, we were each given 2 desserts!  Don't get me wrong, I ate them both but was not prepared for it!"}
{"text":"I enjoy the simple Polish fare that I grew up on; everything is freshly prepared. Took a chance a brought our dinner club (of 10) tonight and they were able to accommodate us in their back room and we spent 3 enjoyable hours. Everyone walked away having enjoyed not only what they ordered, but also what we stole from each other's plates... I had the hunter stew and chop for the first time and enjoyed it immensely.  Highly recommended!"}
{"text":"Yes, this is a CLT must try. ( Ok I'm super biased because I'm Polish ) This restaurant reminds me of my family home cooking.   If you ever want to try a solid home cooked polsih meal please come here and be ready for a full belly and nap! Thank you for being in CLT , and giving me a taste of home."}
{"text":"A great hidden treasure with authentic Polish and Eastern European cuisine. The Perogis are exceptional and sausages cooked perfectly. If you have a sweet tooth the dessert crepes are delicious as well. Friendly service in a small but cozy dining area. A must try."}
{"text":"I ate here yesterday with my boyfriend and my family for my birthday and I was more than happy with the food. Growing up with a Polish background, I know Polish cuisine. And although this is a little different than I've grown up with, everything was DELICIOUS! The kielbasa was great and the pierogis were phenomenal. My favorite were the potato and farmer's cheese ones.   My dad loved his pork kotlet and my brother enjoyed his beef kotlet as well. The golumpki was the biggest surprise. It was tasty, but not what I'm used to. The sauce almost had a sour (but not in a bad way) taste and heavy on the dill! If you like dill, you'll enjoy it.   My family and I will return!"}
{"text":"Wow what a find, other then my best friends petrified, these are ready good.  Not much for atmosphere but the did is good and at a great price.  I would not go it if my way to get here.  But if passing by and you are hungry stop in.  Definitely worth it"}
{"text":"Im a huge fan for different cultures and this place is Just SPOT ON ! I had the sampler plater for lunch Just incredible and the Flavors ...well you can't get enough thats how good it was. Try everything when you go here but The big win is the Amazing Polish Sausage.........7 stars .........."}
