{"text":"This is one of the best sushi place I ve ever been so far in Calgary. Food was awesome and excellent service, I would definitely visit it again with family."}
{"text":"This is my first time in this Japanese sushi restaurant. I ordered sushi and katsu Don. Great sushi very fresh.katsu Don was tasty . Overall I enjoyed the food and I'll come back."}
{"text":"I took a miso soup (was ok), assorted tempura (was ok) and beef tataki as a starter (was soaked in soy dressing) and California and rainbow maki.  The rice was super dry on the sushi, they were falling in pieces, as if they have been waiting there for few hours (but they weren't). The whole thing cost me over 50$ +tax n tip, it was extremely expensive and very poor quality sushi.  Service was kind but definitely do no compensate for this very disappointing sushi meal."}
{"text":"I don't normally do reviews on yelp, however this restaurant is worth mentioning. Their service is implicable! I think this is the 6th time I've been here (I live closeby). The sashimi is fresh, and I can't get enough of their special scallop sushi! Pricing is a tad expensive, but they do have a 30% off coupon that you can get. I have not tried everything on their menu, but I can tell you that the gyoza is good, the California roll, sashimi and special scallop sushi are all very fresh! I've had their beef tataki, it was ok, not my favorite. Good sake though!!"}
{"text":"The staff here are super friendly and welcoming. Ambience is nice, decor is beautiful, and the restaurant is spacious. The food is alright, and the prices are okay for what you get. Some stuff are better than others, and I've noticed that the rolls are either bland or great - no inbetween. Would recommend the crab salad, as it seems to be the most flavourful thing on the menu."}
{"text":"I think this place is growing on me! I focus more on the sushi and sashimi because they are very fresh and sliced properly. Their special scallop nigiri is seriously one of the best ones I've had - I can't stop thinking about it hmmmmmm!  Also learned that the sushi chef is the owner.  Definitely family-owned restaurant!"}
{"text":"We go to this place a lot ! The food is alway super  fresh and tasty , the menu has options to place everyone . The pricing is reasonable . The service is great . They  have wonderful friendly staff , Go if you're in the area."}
{"text":"When this place first opened I went about three times with friends and family. The place was spacious and clean but service at that time was not great and food was so so. There are two other sushi restaurants around this area so they really needed to stand out.  My mom was in town so I took her out for lunch as other places were closed. The place was quiet but the service was fantastic. Our waitress kept on coming up to us topping off our tea and making sure everything was good.   My mom ordered salmon lunchbox. First thing she said was her sushi rice was cold. I ordered sushi combo. For the price you didn't get too many pieces. They do have lots of choices on their menu and I do like their salad dressing. If you have a large group of people this would be a good place to go out and eat. Definitely give it try and see for yourself."}
{"text":"Expensive yet sub par sushi. I go there on sunday with my family and no one is here. They all walk away to smash burger instead."}
{"text":"My little boy likes strawberry milkshake which is extremely good!"}
{"text":"Tried this place about a month after it opened for takeout. Service was fairly prompt and friendly. When we arrived home, I was disappointed with our meal. The sushi was not as high quality as  expected, the rice was OK but not better than what you'd find at Sobeys sushi bar. We had spicy tuna roll, California roll and assorted sashimi.  There are two other places in Royal Oak for sushi. My preference is next to the pet store and across from the florist."}
{"text":"Best sushi in town!!!! It is a great place to enjoy Japanese cuisines with friends and family. Food is awesome. Love the sashimi there so much. It is super fresh and tasty. Servers are nice and hospitable. Highly recommended restaurant in Calgary."}
{"text":"Excellent Japanese food as well as customer service in Royal Oak!  We ordered the beef soba and chicken soba - both were delicious.  I has a sample of the soba noodles and really liked the broth as it's not at all too salty or too sweet.  It was just right!  We also ordered the Tiger Roll - I like that the roll was made with a very thin layer of rice not like other places where the rice layer is too thick.  The prawns were so fresh and sweet tasting and the cucumber adds crunch to the roll.  Plenty of wasabi and ginger were supplied without asking.  The best part was the Assorted Sashimi Plate - very fresh sashimi 2 pcs salmon, 2 pcs tuna, 3 pieces mackeral, 2 pcs surf clam, 3 pcs of tender octopus, 2 pcs of crab - wolfed down in minutes!  The pieces were cut with precision and the sashimi was very fresh!  The salmon and tuna pieces were huge slabs.   Right now, they have a promo for dinner $5 off if total amount is over $35 and a promo for lunch $2 off if total amount is over $11.  Also, comped edamame beans was also brought to our table!   Will be back for sure!!"}
