{"text":"This is fairly straightforward food. The salad bar was pretty decent. The bad thing was that my husband ordered Chicken Ala King and the gravy was basically watered down milk. They (the owner) knew there was a problem with it, yet did NOT offer an alternative Or give us anything off theour bill. We were a little surprised at how the situation was handled, it was not what I had expected. I had a hamburger that was done perfectly and we had the potato soup which is pretty good but could have used a few more potatoes. The sweet potato tater tots were tasty.  I don't know if we'll go back."}
{"text":"I visited this restaurant on advice of a friend from work. I had Cream of Potato soup which I was told was homemade. It was out of this world and the consistency was as good as the first spoonful.  It was a Sunday after church and I brought five other people with me and we all agreed we definitely will be back. The server Laura was very attentive especially since we had a 9 month old with us.  We ordered breakfast as well as a open Face meatloaf with home made mashed potatoes  and lots of gravy. It took my friend Tony less than 10 minutes to eat it. It was too die for. Not a lump in the potatoes hence the name of the restaurant  (Taters).  I talked to the owner and he was actual visible walking around to each table asked if everything was good. Managers are barely visible anymore at restaurants.  The service was great Laura is an asset to the restaurant. She gave us our check said she would be back to check for desserts as they are all homemade. Most servers never come back and if they do never ask for dessert. The rest of my party asked if their were any Lenten Specials and we were told Taters is running a All You Can Eat Fish Special for $8.99 fried or baked on Ash Wednesday and every Friday during Lent. How awesome is that. I plan on telling all of my church friends about it. Our server also told us there is a Facebook Page on the restaurant and to tell our friends for a 10% off if you bring a church bulletin.  Then not 5 minutes later the server checked on us again removed dinner plates and said \"Save room for Dessert??\" We were all so full but I decided to take some home. I took home a piece of Apple Walnut Cake and Sweet Potato Pie.  It looked great and couldn't wait to eat it and let me say I ate the Apple Walnut Cake in the car, it never made it home.  We definitely will be back. 5 Stars to the restaurant, 5 Stars to the Service (Laura) and 5 Stars to cleanliness. I am going to ask for Laura upon our return which will be after Ash Wednesday services at St Gabes this Wednesday. I see this restaurant going far in my books and in Concord. I had a great time there yesterday as did my guests. With 4 people and a baby the check was under $24.00 and I gave the server a $15.00 tip she deserved it especially taking care of us as if we were the only table in the restaurant which we weren't.  Incidentally the decor was another plus and the restrooms were impeccably spotless. To all that don't know where this is its next to Spats and Beach Club."}
{"text":"I thought the food at Taters Country Restaurant was wonderful!!!! The service was excellent and it has become my favorite restaurant! I have had the Chicken Ala King and I thought it was fantastic. I thought the gravy tasted perfect, it is not watered down milk, it has a good bodied country flavor. They dont have a salad bar it is just basically a side salad that you serve yourself, which I like because you can put exactly what you want on your salad. I also LOVE the blueberry pancakes!!!! They put blueberries all through the pancake, they are to die for!!!!! All of the deserts are homemade, even the crusts on the pies!!!! All around great homemade food and great atmosphere. I have met the owners and they are great caring people. The servers are very kind and down to earth. Like I mentioned before Taters Country Restaurant has become my favorite restaurant for all these reasons and more."}
