{"text":"I work very nearby this place. It is in the building where Panini's used to be. They opened some time in January. It has been cleaned up and redone to some degree. It has new owners and the menu is completely different. You've got to appreciate a place where risotto shares menu space with chicken wings. 

We have always had really good food and service here.  There have, however, been a couple times when we waited a little longer than we would have liked but the owner or manager has always come out and apologized/explained.

As for Happy Hour, it wasn't very good but they recently made some much-needed changes. Their Happy Hour is AWESOME now! I think small drafts are $2, their tall drafts are $3 and well drinks are like $2.50. All appetizers are half off as well."}
{"text":"Good atmosphere here. It's really clean too. They had \"bar food AND comfort foods\" as well.. So there were many things to pick from on the menu to satisfy almost any cravings. The beer selection was impressive. I really enjoyed my food . Will be visiting more often.... :)"}
{"text":"I've seen this place pop up a few times so me and a couple of co-workers decided to check it out today.   The place is nicely redone on the inside with an upscale weathered look, like they picked it all up at a Pottery Barn.  The bar is in the center and is large, with a sort of abbreviated u-shape.

At 3:30 in the afternoon it wasn't very crowded.  Happy hour starts at 3:30 and I think is until 6:30.  $3 short domestic drafts, $5 well drinks, $5 wine.  Not the best specials around here. Being a functional alcoholic, I opted for a tall miller lite which ran me $5.  My co-worker got a short Rebel IPA, which despite being domestic was $6.   My other co-worker got a Yuengling ($5) and the chicken tenders and side of tater tots.  I didn't eat, but looking at the menu there are a wide variety of choices.

The chicken fingers came out much darker than expected.  So much so that we wondered if there was a special seasoning or flavor. No,just plain old chicken fingers, which isn't bad.  I believe the dark color (see pic) was from using older frying oil, but my co-worker reported that he did not taste any oily residue

The tater tots were another story.  Despite their relatively benign appearance, a taste of rancid oil waited our palates. with each bite.  These also had the unmistakable texture and taste of frozen nuggets. Like there are big empty bags of Ore-Ida in the back.  The side of tots is a pretty good deal though, at just $3.  

I know fried food can be hit or miss depending on when the oil is changed. But those, along with the high happy hour prices leads me to the 3 star rating.  I'd come here with friends at night, but probably not for a happy hour again.

Oh, Parking seems plentiful, though there is a cable with a sign that says no trucks around for the large side lot. Depending on how you feel about such blatant truck discrimination, this may or may not matter to you."}
{"text":"I'm not one to blame a server, but... I ordered lettuce wraps, they came out with brown and wilted romaine lettuce, while i would have just slipped the lettuce and eaten the filling, there was no sauce and was basically bag of coleslaw with a side of teriyaki chicken. French onion soup? Nope- not even close. We asked for these to be taken off our bill, when receiving the bill the server had NOT done so. We felt badly for her as she was the only staffer there besides the barmaid-they are super understaffed. BUT could have at least comped the $10 lettuce wraps that i didn't even touch-immediately sent back. The sever didn't even offer a replacement, nothing! 
Basically a beer joint. Don't bother."}
{"text":"Went there on a late Sunday afternoon for dinner.  Food and service was good.  The hummus and risotto is delicious.  They also offer nice portion sizes.  We'd go again!"}
{"text":"My wife and I stopped in to try this place. I can tell you it will be in our regular rotation from now on. I got the hot mess burger it was excellent! Do yourself a favor and try the French onion soup it's great. My recommendation is don't share you will want it all for yourself. My wife got the charred Cesar and she really liked it. Overall nice place, great service and killer food."}
{"text":"We started with the giant pretzel which was fantastic. The cheese sauce on the other hand was watered down and didn't stick to the pretzel but the mustard sauce was good. I had their fish dinner was was excellent! Good Cole slaw too."}
{"text":"Went there with a group on Saturday night. The food was awesome!  Definitely would return. The owner came to the table and was easy to talk to .  Our server was  very pleasant. The atmosphere is casual, but the menu has something for everyone!  I wish them good luck with their new restaurant!"}
{"text":"Awesome service. The food was plenty and very delicious. The server was on top of everything. To go boxes for sure. There was so much food.  Our new place to go. We even took the kids and they were very kid friendly."}
{"text":"I'm in the biz, I won't say too much for that reason.  Three times I gave it a shot & 3rd time was not a charm. Out of potatoes but offering 4 specials festuring them... huh? Bartenders are friendly but nothing more, food is mediocre at best on its best day. Was handed a \"discounted bill\" after not eating my $18 meal that was a full price bill...Don't assume I won't look at the receipt & tell me it's discounted when it's not, don't assume anyone will become a return customer. I tipped the bartender 25% bc she only had 1 other table besides the 2 in my group on a sunday & I felt bad for her. Never again."}
{"text":"What a great little place! Food is awesome, servers are friendly and cheerful. Ive been recommending it to all my friends  and co workers! Congratulations on a great new restaurant! Much success!"}
{"text":"Good food and service.  Beer is reasonably priced.  We went there Sunday afternoon and the restaurant was not busy at all.  Restaurant was clean and well maintained.  Hamburger and coleslaw was very good.  Salad was also very good.  Friendly environment."}
{"text":"Wednesday Blue Plate Special: very good roast pork loin, tasty crispy potato pancakes, and the best sauerkraut I've ever eaten by far.  They should package it for Whole Foods, Progressive Field, etc.. yes it's that great"}
{"text":"This is another restaurant I ventured to while on vacay! For those of you who don't know this used to be the old Panini's that had a whole lot of health violations. Since then, the place has been bought by a local resident of Independence. The place has been updated and the menu is completely different. Don't be fooled by the name this place has the makings of a sports bar. It wasn't very busy when we went, thus I waitress was very attentive and our food was piping HOT! My husbands chicken tenders were huge and made from scratch. None of those frozen tenders dropped in a fryer. I had the baby spinach salad with the salmon which was good. There are plenty of TVs for you sports fans to watch the Browns games!"}
{"text":"Food Coma will be happening after you eat here. Great food, wide range of draft beer, staff is attentive and friendly. Definitely a local hot spot."}
{"text":"First the positive: all the servers were very sweet and polite. GREAT beer selection. Didn't try any food but it looked good. It is probably the 3rd restaurant in that location over the last few years and I feel the best kept of them all. The others literally smelled bad. This place was clean. 

The negative: I know it is a new business and I hope that explains the horrible, horrible service. Literally 30 mins or more between seeing the waitress during most of our 3.5 hour stay. The owner  stopped by our group and asked how everything was several times. We said terrible and nothing changed. He never stepped up and made a change nor comped anything. Nothing. We spent 3.5 hours there bc we were having great conversations within the group but it just never got better."}
{"text":"Great place to catch a beer, watch the game, and eat quality food with great service! It's for sure a local place that is also owned locally. Hope to be a regular at this place. The decor is nice and clean; great sight and seating to watch a game. The menu is straight forward and amazing. Good prices for quality food. Service was great! She never forgot anything and was on it. Food was amazing; dessert was so good. The Chef even came out to our table and went around to everyone and asked how everything was, that was very impressive. Thankful to have a place like this around the corner from home. We will definitely be in there more often."}
{"text":"Visited Tavern of Independence for dinner on a Friday night. Their happy hour went until seven and they had a list of half off apps. We chose the loaded tots and the Reuben bites and were disappointed to find out that they didn't have any Reuben bites after ordering. Servers would do well to tell you what they are out of when they hand you the menus before you take the time to get excited about trying something. That being said our service was wonderful. It was very attentive and conversational when need be. The tots did not disappoint! They were delicious.

There is a vast draft beer list as well as bottled options. You will be able to find something unique here to try. They also have a good variety of liquor in different flavors. 

For dinner we tried the shrimp tacos and a burger with the fried Brussels sprouts. The tacos had a spicy Asian glaze with a significant kick and shredded cabbage for a nice crunch. The burger was cooked perfectly to order at medium and was a nice sized 1/2# patty. The flavor was good and it came on a soft fluffy brioche bun. The brussels sprouts were very good but needed to be salted. They lacked seasoning. Once salted, they were delicious. 

We also tried the soaked cherries for fun. They were strong for sure. They used jarred  maraschinos. They were fun to try but I don't know that I would order them again. Prices were quite good for what we got we felt. It's a great place to hang out, socialize and enjoy a few drinks and some decent bar grub!"}
{"text":"Met some friends for dinner, Parmesan crusted polluck was very good but could have charged a couple bucks more and given a bigger portion. Service very slow, had to leave table and go to bar to get drinks . Food was good enough to give one more chance"}
{"text":"This place is great!  Had the happy hour apps.  Wings, brussel sprouts, candied bacon...alongside the Hot Mess burger.  Everything was fantastic.  Beer selection is great - and Dan our bartender (sat at the outside bar) was busy, cheerful, and attentive - thanks!  We will be back."}
{"text":"Super friendly staff. Amazing beer & wine lists. Food is from scratch plus original daily specials. Stopping in here is a must !"}
{"text":"Located in the old Paninis in Independence, a very similar feel and look inside. Sports bar like, with daily blue plate specials that were decently priced and seemed desirable. Other than the specials nothing on the menu really jumped out at me. The draft list, on the other hand as well as the bottle list was pretty extensive! Could be a place to return to drink if your out that way. I ended up ordering a few side dishes in place of an entree. I ordered a pea risotto, cheddar mashed potatoes and spinach artichoke dip with fried pita. My girlfriend ordered the steak philly.  All of the food was tasty and prepared well, but I ordered way too many carbs to try the one thing on the menu I was most looking froward to which was the dessert pierogi. I may return for that as well as a good draft beer."}
{"text":"I was underwhelmed by my meal at the Tavern of Independence. While the service was prompt and very attentive, my food left a lot to be desired. My French onion soup and carnivore flatbread were both undercooked. The soup needed to be broiled. The cheese was hardly melted. The flatbread's crust was still doughy. Both items I consumed tasted as though they were prepackaged items and were simply heated in their kitchen. Both the server and manager were attentive and checked on us frequently. The food was definitely the issue though. I hope this established works to refine what they serve. This is a local restaurant you want to root for to be successful!"}
{"text":"I have been to this place a couple of times for lunch and its not too bad. The service is really good and I like how open the bar and dining area is (lots of windows). My reason for 3 stars is so far I haven't had anything that absolutely dazzled me. I liked the brussel sprout app and the french onion soup was pretty good too but nothing really stuck out. I have also had the greek salad and that was pretty good too. I have heard they have a great karaoke on Thursday and I know that DJ is pretty fun so i plan on checking that out soon."}
