{"text":"3.5 stars overall. 4 stars for the food taste and quality. I rounded up on the rating because its a \"hole in the wall\" restaurant, which is my type of food :). I would have never found this restaurant on my own. One of my Elite friends found this place on Yelp.   We met on a weekday and it was empty the 2 hours we were there. This place is owned by a husband and wife. I think the husband is the cook and the wife is everything else? She spoke primarily vietnamese. Be aware there is no other staff.   We ordered family style. We let our Vietnamese friend place the order ;) The tamarind shrimp soup was sweeter then I normally have had, but the ingredients were fresh! The pineapple was cut in small sticks, which I almost confused for ginger. Definitely recommend with some rice. The lemongrass chicken was simple, but flavorful. The vermicelli with beef on a stick, was also good, but nothing out of the normal. I prob will need to get an individual bowl for myself next time to get my noodle fix and to really enjoy the dish. Last, but not least, we had the beef cubes and they were very well seasoned. Nice combination to the bed of lettuce, cucumber and tomato it comes with. You don't even need the salt/pepper dip to appreciate the meat. Yum! Overall, the first experience was very enjoyable.   Now the second time on the same week, I came back with another group of friends. This time it was on a Saturday.   It was a party of 9. They had to combine two round tables to accommodate us. I think we may have startled the owner, because 15 minutes later she locked the door to the restaurant and would not allow anymore customers to enter. It was prob 7pm and the restaurant closed at 10pm? Rest assured she did reopen the door after our meals were served and she could handle new patrons! Lol.   The food the second time around had some disappointments. They ran out of summer rolls, so we ordered spring rolls. Tasty, but prob over cooked. They would not allow us to order crepe AGAIN bc there was no time to cook it! :( I had the beef cubes again and the taste was just as good the first time! I decided to get Pho at this visit. #29. The soup smelled like cinnamon and I thought it was good, but my BF thought the soup base was bland. The noodles could have been cooked a little longer. You can pick a small or large bowl, but she never asked what size I wanted. I think she automatically gave everyone at the table a large. The meatballs were cut in slices, which made it easy to eat. My BF tried the rice dish with pork and shrimp, which he said was much better then the pho and something he would order again. They seem to use good quality shrimp here, which is a big plus. The leftover rice dish even tasted good the next day!   I would definitely come back if I am around the area. Maybe not come on a weekend during busy hours? Lol. I might not be able to get in...  FYI: Call ahead and let the owners know you want Crepe. Apparently It takes 30min to make."}
{"text":"First time trying Vietnamese food. Trusted the.reviews and they were right. The food was very good, looking foward to going back."}
{"text":"The food is disgusting and tasteless... But the lady with the long hair is definitely something else. She's scary PERIOD. My dad was like, please don't bring me back here at night. I can barely understand her English... She just stands right next to you and stares at you when you order.  I will not have an appreciate for Vietnamese food for awhile... It's so disgusting... Yuck!! Still have a bad taste in my mouth"}
{"text":"Not the best Pho I have had, but the broth is top notch. Also the inside is divey but I like it. The couple that run the place are the salt of the earth."}
{"text":"I love this restaurant! It's better than superior pho, in my opinion. We come here once a week for pho. The potstickers and beef broccoli are delicious as well. The service is great, very friendly."}
{"text":"I love everything I end up ordering here. Some of my favorites (and I mean the best in Vietnamese food I've ever tasted - superfresh and authentic) are the #18 Banh Xeo (Crepes), #2 Guo Quon (spring rolls) w/pork, #5 Tofu Me, #9 Canh Chua Thai Tofu (spicy!), #20 Shrimps & Scallop, #37 Pho Ga (broth is incredible!), #63 Lemongrass Chicken, #66 Tofu Xao Gung, #72 Tofu Xao Dau Den (Black Beans), #78 Tofu Xao Ca Chua, #92 Bun Tofu Xao Cari, and #119 Orange Chicken. The Vietnamese coffee is quite good and strong!  If you are in a rush or have a large party call ahead, it does take some time but it's so worth it."}
{"text":"You must go here. Then get the pot stickers and some pho. It's the best little hole in the wall place."}
{"text":"I am in love with this place. Yes, the wait for the food is longer than most restaurants, but I'll take a slow mom and pop place with authentic food over a chain restaurant anyday.  I am a vegan and they had many options for me. My favorite? The #85. My yeastes buds danced with joy!"}
{"text":"Tried to visit just after opening hours but staff still had no arrived. Waited 30 minutes, very unhappy. May or may not try again another day."}
{"text":"First time getting some pho from here! Great food but on line menu is tough to read but they were so nice when I came in and order they told me sit down it will take a while maybe an hour and then they had me sit at one of there tables and served me jasmine tea! Everything was great ! Especially the squid pho!"}
{"text":"The food here is fantastic, it really is. But they need more staff, and staff that can understand English. If more than one member of your dinner party happens to order the same thing, you simply won't get it. Period. Ever. You'll get a check and a blank stare to match your blank stare, empty plate, and confusion as to where your meal went."}
{"text":"It is a hole in the wall place,but the food is pretty good. we have pho, crepes and spring roll. The pho and the crepes are very delicious and fresh, but the spring roll came out very dark color and I think they need to change the oil for deep fried.The service is Ok since we are the only one there and her English is not very good but she is nice to us. Will go back again."}
{"text":"This place is all about the food.  Interior isn't much to look at.  Owned and operated by older Vietnamese couple with limited English skills based on hand lettered signage and kitchen conversation.  Authentic good inexpensive food."}
{"text":"Don't eat here the people are not honest... They say they're open they're not open open close open close open close. Are they doing me a favor by opening the restaurant? I don't think so. I don't want to eat anything that this restaurant serves if they lie to you when they're open and not open. I made two trips to attempt to go to this restaurant only to find that they did not open their doors when they said they were open. I even called the restaurant 20 minutes before I got there and she said they were open but when my husband and I went to the door and knocked on the door and the lights were on they did not open the door so we left and I will never come back!"}
{"text":"The owners were a cute couple.  Welcomed me when I walked in.  There were no other patrons at the time (a Tuesday).  I was so excited to get my takeout home because the smells emanating from my bag was amazing.  Sadly, my entrée was a little on the skimpy side.  The flavor was delicious but the amount of meat and veggies was a little disappointing.  Maybe it's just me and my being used to big portions (I do love to eat haha) but it was very underwhelming.  I will try this place again to give it a fair chance and will update my review.  I hope my second experience goes a little better.  Again, great flavors, just underwhelming in the portion department."}
{"text":"Authentic...need I say more. So authentic that the lady waiting on us spoke little english and had the stereotypical gruff old asian lady attitude. But lets talk food. My Pho was perfectly prepared, tasty but lacked enough meat. The fresh spring rolls were fresh and the peanut sauce was perfect. The local is a little dingy, the digs were questionable but then that's what one may expect when dining traditional Vietnamese...minus the cats wandering by, Vietnamese families and deliveries on vespas and old asian gents playing mahjong while chain smoking. I'd go back."}
{"text":"Amazing pho even though place looks dirty. Defiantly your hole in the wall. Absolutely amazing"}
{"text":"I stopped in here after seeing what was close and cheap and absolutely did not expect what I got to be as good as it was. I got the pho with the beef in it, I think it was the #30, and it was absolutely delicious. I went to another place downtown and got pho before, it wasnt bad but Tay Do blows it out of the water. I will definitely be coming back here anytime I want pho and especially to try as much as I can from their menu which is loaded with all sorts of stuff."}
{"text":"SUCKS!! The owner is so RUDE!! Will never go back to that place! Worst decision of my life!"}
{"text":"DELICIOUS Vietnamese food and a total hole in the wall.  Definitely no MSG in their Pho which was great.  Lovely folks running the place.  Recommend."}
{"text":"What a gem! This out of the way Mom & Pop is the best Vietnamese restaurant I have ever patronized. The Pho is SO good. Fried tofu and dumpling appetizers are consistently great. YUM!  BTW... They do serve \"33\"...A Vietnamese beer that I like a lot. Also...  Try the Vietnamese iced coffee for dessert."}
{"text":"Now usually I would give less stars on service but my friends fore warned me that the service will be slow but the food will be outstanding! Both are true. Here comes the \"But\", it is a husband and wife duo that do everything. The wife runs front of house while the husband does all the cooking. That is why it can seem slow because it is just the 2 of them running the place.  I tried a little bit of everything from a bite of spring rolls, to a bite of #21 which is the most fantastic shrimp dish I have ever tasted! I even tried the shrimp with the shell on because it was THAT perfectly cooked! I ordered the Pork Fried Rice and the #30 Pho to go. The cinnamon broth in the the Pho is such a great flavor combination with the meat!   Everything is made to order and you can tell!"}
{"text":"Best Vietnamese in town. 61 beef stir fry is my all time favorite Asian dish anywhere !"}
{"text":"Took a group of co-workers here for my second visit to this establishment.  Pretty good selection of Vietnamese dishes.  Last time here I had a beef and noodle dish, this time I tried the Pho.  I ordered the fresh spring rolls (as an appetizer) and the #30 Pho Tai Chin...a combination of rare and cooked beef along with rice noodles.  The fresh spring rolls were just that...fresh!  Shrimp and veggies wrapped in a delicate roll and served with a tangy / zippy sauce.  Yum!  The soup came with a typical assortment of bean sprouts, basil leaves, lime, etc. and the table also got a complimentary pot of hot tea.  The regular sized bowl was quite large and the broth had a slightly sweet taste to it (due to the cinnamon).  It was fresh and hearty with plenty of flavor.  The others at my table ordered a variety of different soup, noodle and rice dishes and everyone seemed to enjoy their meal.  This mom-and-pop run shop was just the ticket, will definitely be back."}
{"text":"This isn't where I would take an out of towner to impress them, but it is a nice hole to meet up with a girlfriend to gossip.   It is definitely a family place and the one time I stopped in I could see they have regulars, so you know the food is good. It was!"}
{"text":"Glad to find a place closer to home for Vietnamese. Typically go to superior pho but it's a destination for me. Although not the same, it's great food in its own. Spring rolls are awesome, pot stickers are the size of perogies, and the pho is great. They don't have Banh Mi which is one of my favorites but wouldn't hold it against them.  Everything was well worth it. I'll be back for my pho fix."}
{"text":"We went here on July 4th and they were open.  I was craving pho and decided to give it a try.  The decor and throw you off, but pho was on point and the food was good.  The old couple that worked there are nice.  If you're used to the Asian mom personalities then you know what I mean.  She was nice and cool.  We meet a nice Caucasian couple and they've been coming here for 9 years, and says they love the food here. I would definitely recommend this place."}
{"text":"When my wife and I were dating at the turn of the century, we often ate at Tay-Do. Back in those days, the restaurant took up two or three of the store fronts in the slightly shabby little strip plaza it occupies on Snow Road at York Road. There used to be lots of lights, big screens, art, Asian Karaoke - a definitely party atmosphere accompanied by a fairly extensive menu that included many wonderful Vietnamese noodle, soup, and rice dishes, stir-frys and simmering clay pot dinners with whole fish. It was just exotic enough while also being welcoming. But times and circumstances change, and Tay-Do is now a much smaller operation, still run by a husband and wife team in a reduced form from those days in the late 1990s. They are older now (me too!), but the food is just as good even though the offerings are much scaled back.  As is my wintertime tradition, I came in for Pho. The traditional Vietnamese noodle soup is my go-to whenever I need a pick me up or a vaccination against whatever creeping crud is currently en vogue in the Parma Schools for my younger kids to anoint me with - and the Pho here is good, although not quite to the the level of my go-to Pho, which (against common wisdom in NE Ohio) is at Minh Anh on Detroit Avenue with Superior Pho, the popular choice, a very close second.  The broth is king in a good bowl of Pho and the broth was rich and cinnamon-y with a healthy amount of coarsely cracked pepper. The noodles were good (one difference - at Minh Anh they make the noodles from scratch, I didn't get that sense here). I chose meatballs and rare beef; the meatballs were good as was the beef but I would have liked more of the beef. The condiments served alongside were the usual; Thai basil sprouts, bean sprouts and lime but no slices of hot peppers as is often served. I am not sure if this may be a regional variation of the dish that the cook brings with them, but I like them. Of course there was Sriracha and Hoisin sauce.  All that said, I enjoyed the Pho. And I'm happy that these people, these two older people, are still making delicious food in Parma. When we used to eat there twenty years ago, it was a family business -  there were younger people waiting tables and even their younger children were bussing and setting tables - sadly, a family business that the now-grown children may not maintain.  I did have a brief chat with the older gentleman about the old days of the place; I wish I could come in and order the clay pot fish again! But there is enough on the current menu for me to make a few new memories with my now college-age daughter who coincidentally was born one night after we ate at Tay-Do. My wife went into labor in April, 1999 after eating a wonderful seafood stir-fry we knew only as G-6 on the menu. We don't think the food was the trigger, but you could definitely do worse...we ordered it so often but it's another casualty of the scaling back of the business. Sad but time does pass.   Try Tay-Do if you are seeking Vietnamese food in Parma. It's good, and sometimes driving downtown or to Gordon Square doesn't make much sense. I think of it as a local place to get the medicine I'll need to survive another NE Ohio winter and I hope the proprietors hang on for a good while."}
{"text":"I have so experience better service and clean environment then this location. I don't really where to start. The food is disgusting and tasteless... But the lady with the long hair is definitely something else.I can barely understand her English..     The food was ok not really what you would expect. The waiter/owner never brough the drink order only served tea The owner/waiter never greeted us. The establishment was so dirty like nothing was clean in the dining room,  Oh here the best thing they still have Christmas lights up on the wall not even lit up possible fire hazard its  plugged in. If the dining room is not clean I wonder what the kitchen looks like. Its pretty sad that waiter/owner has to look at the menu to make sure they serve it. The food was not what anyone expected on the other hands people loved this place but others so not so great.     ... It's so disgusting... Yuck!! Still have a bad taste in my mouth from Lunch... I would so not recommend this place to anyone..."}
{"text":"**********IMPORTANT INFORMATION********: The timings mentioned on Yelp and even on Google are misleading. We went for dinner at the restaurant at around 8.45pm on a Friday night and found it closed (Yelp and Google both mentions closing time 11 pm). The timings chart on the door of the restaurant indicates it gets closed at 8pm EVERYDAY. So please call the place as you plan to go there."}
{"text":"Definitely a fan of Taydo and the delicious Vietnamese cuisine offered here in this home-like environment. This restaurant is located in a corner plaza off of Snow Road, with an abundance of parking spaces available. It's about 8 minutes from the airport, so if you find yourself flying back into Believeland and in need of a hot cup of tea, a savory bowl of Pho or a steaming plate of stir-fried noodles, (or all of the above...), check out Taydo! If you do happen to arrive at a busy time, be prepared to wait since it's one person running the scene in the kitchen and one person taking orders in the dining area.  I always begin my evaluation of Pho starting with the broth. Here at Taydo, the broth is excellent - it's refreshing and savory, with a hint of cracked black pepper that gives a unique subtle flavor change to this popular noodle soup. The rice noodles are tasty and aplenty. The meat servings are in low proportion to the rest of this dish - I would recommend increasing the meat portion.  One of my favorite dishes on the menu is Pho Xao Ga, a stir-fried dish with flat wide rice noodles combined with an abundance of vegetables and chicken (you can also choose shrimp, beef, pork, or squid), in a sauce that I would describe as the Goldilocks marinade for Asian cuisine - a perfect balance of seasoning in every bite. No tastebud left behind.  Side note - I was so impressed to find out that the wife and husband team have been running this business for the past 19 years! So happy to be able to support a truly local community business out here in Parma, and look forward to perusing the large menu selection whenever I'm in the area!"}
{"text":"Wow! This place is a tiny hole in the wall that is the only store open in its strip mall. Their pho is so good that it makes Superior Pho and Min-Anh look like rookies! There is incredible depth of flavor, and it's not MSG. I don't even know how to describe it. The meat was good, the noodles were fresh, there was a generous helping of sprouts, basil, and lime... but seriously, the broth was unlike any I've had before in Cleveland, Houston, and LA.  It was just so flavorful! I also tried the spring rolls and the giant potstickers.  The spring rolls were MUCH fresher than Superior Pho's- the wrapping is soft and not stale, with generous portions on the inside. I love when spring rolls are soft on the outside and then crunchy from the veggies inside, and when the shrimp is fresh... so good! If you're not sold already, you HAVE to order the potstickers. They're like an amazing cross between Taiwanese soup dumplings and down-home homemade Chinese potstickers minus the grease. You don't even need the dipping sauce.   My boyfriend ordered the stir fried beef noodles, which were good given that this isn't really a Chinese restaurant. I mean, it says it is, but the owners are Vietnamese and barely speak any English.  My other friend ordered a vermicelli bowl, and that was great too. This place is definitely worth the trek (if it's a trek for you) and I will absolutely drive 30 min out to Parma just to eat here. Can't wait to go back!"}
{"text":"Overall: I had a craving for my mom's Vietnamese cooking, so I decided to make the 40-minute trek to check this place out. It met expectations and I will definitely be coming back if I am in the area. It is the best Vietnamese restaurant I've eaten at since moving from the Virginia/Maryland/DC area to Ohio.  Food: We had the goi cuon (spring rolls), bun cha gio thit nuong (vermicelli noodle bowl with eggrolls and skewered pork), and pho tai bo vien (beef noodle soup with beef and meatballs).  I highly recommend the thit nuong (skewered pork) that came with the bun dish -- it was perfectly seasoned.  Overall, the dishes were all carefully prepared and the ingredients stayed true to traditional Vietnamese recipes. There was no MSG added.  While the food was a touch underseasoned, it was certainly preferable to the heavy-handed seasoning often used at other Asian-themed restaurants in Cleveland.    Service: The owner lady is extremely nice. She was very concerned that every customer was enjoying their meals and so frequently paused at each table to talk to the customer.  Some patience is required as she is the only host and server. Additionally, there is a language barrier if you do not know Vietnamese.  So, if you have never eaten Vietnamese food before, you may want to do your homework before coming.  But, as someone who speaks Vietnamese, it was evident from her communication with the customer and her chef-husband that she wants you to enjoy the food and experience.  Happy eating!"}
{"text":"We loved Taydo Vietnamese restaurant. There was an adorable older Vietnamese lady waited on us he didn't speak much English but she was very kind and make sure that we understood everything that we ordered on the menu. The food took a little long however it was well worth it. Everything was very tasty and moderately priced. I would definitely eat there again and suggest others to do so as well."}
{"text":"Great family restaurant. Montauk shop very nice people only problem takes a while here food but worth the wait"}
{"text":"We were looking for somewhere in Parma to eat and we saw this place on Yelp. We read one of the first reviews saying that \"it makes Superior Pho look like a rookie\" so we thought we'd try it, since we love Superior Pho.  We ordered the same thing we always get from Superior Pho, a Pho and a Vermicelli Bun (SP: 3 and 3B, TD: 30 and 82), to make an honesty comparison. Pretty quickly we both came to the conclusion that Superior Pho is, well...superior. Superior has a bit more flavor and definitely better flavor. This is NOT to say that Tay-do was bad, because it wasn't. The food was fine. The 3 stars means \"A-OK,\" and Tay-do was just that. If we weren't both from California, it might even have been upgraded to 4 stars (I know, that makes me sound like a d-bag).  Overall: NOT better than Superior Pho, but still a decent place, especially if you live in Parma."}
{"text":"I am not a fan. I stopped by here while helping a friend run an errand. With the reviews I had seen, I figured it must be pretty good. It was not.  I was very disappointed with the food. I ordered Hu Tieu Mi which is one of my favorite Vietnamese soups. The broth tasted like instant soup. The noodles were few and undercooked and the seafood did not look appetizing. I left the food after only a couple of bites. The restaurant was also sort of drab looking which would not likely bother me if the food was good but did not help things.   I have eaten Vietnamese at a lot of restaurants before and would not recommend this place to anyone. I honestly left this restaurant and immediately went to another Vietnamese restaurant for a much better meal."}
{"text":"It was OK.  Superior Pho was closed on July 4th so I yelped this place.  Feels really mom and pop.  Feels like you walked into an 80's Chinese restaurant.  Owner was like a typical Asian grandma type- no nonsense.  We asked her to cut the spring rolls in half so we could share.  She said no.  Fresh spring rolls were forgettable.  Fried spring rolls were thin and crunchy.  Seems like an authentic selection of Vietnamese dishes.  Pho broth wasn't bad- but there wasn't a ton of noodles or meat in our large bowel and the bean sprouts had seen better days.  Our rice noodle dishes were ok- not mind blowing but I could imagine someone's grandma making them.  It was ok- I probably won't go back because it is kind of out of the way."}
{"text":"I took my family here for their first Vietnamese food experience.  Even though they hadn't eaten anything like it before, they enjoyed the pho, especially on a cold Cleveland day.  Service was a bit slow but the woman was kind.  I'd dine here again when I'm in the area."}
{"text":"I love this place. Tay Do has the best Vietnamese food in Cleveland.   It's a little Mom and Pop shop, literally. She manages the floor and he's in the kitchen.  Wait time for food and service can be slow, but be patient. It is worth the wait.   The food is always fresh and delicious. The vegetable dishes are bursting with fresh cuts of vegetables. You get  Broccoli tops, not broccoli stems, pea pods, mushrooms, carrots, sprouts, celery, etc The tofu is always crisp, I don't know how they do it.  One of my favorite dishes is the lemongrass tamarind soup. It's sweet and spicy with bean sprouts, tofu, tomatoes, and celery. It's a meal of a soup. Everyone loves the Tofu Me appetizer, fried tofu with sesame glaze.  I'm also a big fan of the black bean and tofu dish,the curry tofu with flat rice noodles, and the bun dishes (OMG! I always eat the whole thing!). My step-father loves 91 and 95 chicken. The chinese dishes are excellent as well. Some of the best Lo Mein. I have never been disappointed. The portions are generous. You get enough for lunch the next day..if you can stop eating.   I hate to fault the place because they work so hard. The decor is minimalist.  Basic tables, chairs, and a fake plant by the door. But I've been to fancier places the food was more expensive and not as good. Since the food is made to order and they have minimal staffing there is a bit of a wait, like I said. But just go and enjoy your company. Or bring a book while you wait.   They take credit cards, but for a minimum of $10.   I've been going to Tay Do for over five years and everyone I introduce it to loves it. The maintenance guys at my work even have their favorite numbers."}
{"text":"Thanks for the tip, Yelpers! We never would have found Tay Do without you.   We had some amazing dumplings (#4), one of the vietnamese crepe dishes listed at the beginning of the menu and a chicken stir-fry from the back of the menu (maybe #91).  Everything was really great!  As food went in, superlatives kept coming out. Between bites my fiance couldn't stop saying how fantastic and delicious everything we ordered was.  I believe there might have even been a declaration of \"sensational\" in there somewhere.   We probably would've fought over the leftovers so, ever on the offensive with leftovers in our fridge, I ate them while he was out.  (Timing: The restaurant was empty when we got there at 1pm on Friday and we had eaten and paid our check by 1:45)"}
{"text":"I've eaten here a number of times.  I just got back from lunch and felt like I should post a review.  This place is great.  It's a mom and pop shop, and it's a bit of a hole in the wall, but seating is adequate and the food the pop cooks is phenomenal.  I just had the most delicious ginger & scallion w/ chicken dish, served with rice.  It was so flavorful!"}
{"text":"Very good Pho. Portion-wise, I'd say on par with Superior Pho, maybe a bit better.  The broth was awesome but maybe I mixed my hoisen and srir racha sauce better :D  Wish they had combination meals though. Pho, Sandwich, Drink."}
{"text":"my friend and i stumbled on this place nearly a decade ago when we failed finding an indian restaurant.  the moment we walked in tay do's doors was the most serendipitous culinary moment of my life.  every trip to the greater cleveland area HAS to include dinner at tay do; it's without question.  their honey garlic tofu is among the most delicious appetizers.  ever.  you get just enough to share with two-three other people (if one friend doesn't gobble it all up first), and the excess sauce tastes lovely on white rice.  the pho broth is spiced perfectly, and if you get the  #1 pho (i think), you get LOADS of tripe and tendon.  this may dissuade some diners, but they don't know what they're missing.  the rice and non-pho noodle dishes are awesome, too.  when i decide to eat something other than pho (doesn't happen often), i get the peppered steak and tomatoes.  the meat is tender and the tomatoes give a slightly sweet tang to the dish.  if only i was in cleveland right now..."}
{"text":"This place reminds me of a little Chinese restaurant in Sacramento that we used to go to after church most Sundays.  The couple that runs the restaurant remind me of most Asian grandparents -- kind of gruff, but well-meaning.  When we arrived on a Monday afternoon, the place was empty, but two more groups entered not long after, one of which was a rather awkward couple whose conversation was all too audible in the room, since there was no background music.  I had the pho tai which at $6.50 was a much better deal than #1 Pho's $8 bowl.  The pho was presented with pepper sprinkled over the top, which I had never seen done before.  The meat and rice noodles were good, but not exceptional.  The broth was a tad bit too oily, and seemed to be lacking a certain punch in the flavour.  Still, the weather was cold and rainy, and the soup was hot and plentiful.  All in all, for the price and location, it was a pretty decent bowl of pho."}
{"text":"Sure, they do things differently than other places with their pho, but it doesn't make it any less delicious.  Instead of basil you get parsley.  Big deal.  The broth is what counts in my opinion, and they make a quality product.    The service is really nice, but the decor is certainly wanting for some sort of an update.  You wouldn't pick this place as a \"date spot\" to impress somebody, but for a mid-week pho pick-me-up Tay Do does what it does, and it does it quite well.  There's plenty of other options available as they have a menu that ranges from Vietnamese to Chinese, so most anyone should be able to find something for their tastes."}
{"text":"I really love Taydo. It's owned by an adorable Vietnamese couple that seem to be the only people that work here. The wife is the server and she is really sweet and kind though she doesn't speak much English. Their pho is delicious, one of the best in the Cleveland area. The broth is flavorful and cinnamony without being too sweet or salty. It has a rich aroma and is very satisfying. I think the quantity for the price is a little less than I've seen at other restaurants in Cleveland but I'm happy to spend a little more to support a small family business like this one. The place is usually empty but I really enjoy the food! I feel like the lack of business is mostly due to the small and unassuming storefront. We actually were only able to find this place because of Yelp. Check it out if you're looking for Vietnamese in the area :)"}
{"text":"The only reason this place gets two stars is because I'm nice.  Really bad pho.  I got the basic beef pho.  The broth was really bland.  I had to doctor it up, which I normally don't do.  The crispy roll just tasted like the oil they fried it in.  Gross.  Disclaimer- I've had pho all over the west coast... never before in OH.  I'm not sure if this is just the BEST in OH, or what... but it just wasn't that good.  The lady running the place (I'm assuming she's the owner) was really sweet... she's the reason they're getting two stars."}
{"text":"Taydo is like a hidden gem in Parma, very easy to miss if you're not paying attention but wow, it has the absolute best Vietnamese pho in Cleveland and maybe the US.  Always made fresh to order, with a plate of basil, bean sprouts, sriracha, and lime.  Very small family restaurant atmosphere which makes it that much better.  The waitress and I presume owner is always very friendly and accommodating, and the prices are fantastic!"}
{"text":"This place is awesome!  I heard Bernie Kosar gets the #9."}
{"text":"The hostess is a delight. She is running around refilling water, taking orders, delivering food and making small talk. This a small Vietnamese place in a strip on Snow rd. Not terribly impressive looking, except for the little Buddha shrine complete with fake incense just outside of the kitchen. The menu is very daunting. I mean huge. Once you realize that it is just thirty different variations on five themes you can make better choices. They have a bunch of Different Pho. A bunch of different noodle dishes, rice dishes and crepe dishes. I got a pork chop with two fried eggs over rice. It was very good, but afterwards looking at the yelp pics, I wish I had ordered the tamarind soup or the crepes or both. You need to be patient here. The food takes awhile to come out of the kitchen. Hopefully I'll be near Parma again and will get a chance at another meal here."}
{"text":"I'm right in the middle after having had a decent but not amazing lunch here. The restaurant is a bit of dive in a neighborhood that lacks charm. This doesn't turn me off, as some of the best ethnic restaurants I've been to everywhere in the country fit that description, although I'd be happy to see the sad carpeting go. It's been noted by other Yelpers that this is a mom and pop operation...I reiterate it here to make a point, which is that there is one person waiting on people (mom) and one person cooking (pop). This can make for some long waits for your food, even if you call ahead, as I did. To be fair, I was quoted a half hour between my call and pick up, and that's about what it was. However, there was only one table occupied when I arrived, and they had one to go order ahead of mine, so when it's busy...? The woman who waited on me was very nice, although we went back and forth a bit as to what I ordered, partly because of the language issue and partly because  #81 on the menu is listed as pork meatballs, when I had ordered pork on the stick. They got it right, but it was confusing for me.   I skipped the pho, as I like to eat that while dining in, and had the bun, aka rice vermicelli noodles, which I ordered with pork on a stick (lovely description...kabob style) and the spring rolls. The pork was nicely marinated and flavorful, although the crowding on the wooden stick had created pieces that seemed not fully cooked. Plus, it was just not enough meat. The spring rolls were tasty, the noodles were done perfectly, with no clumping, and the veggies that traditionally accompany this dish were present and fresh. Again, a decent offering but not the best I've had. I will update this review after trying their pho."}
{"text":"I have been coming here since they opened almost 20 years ago. While I have read the reviews I have had to laugh. If you go here you will immediately see how hard these owners work. They are a family-from time to time their kids help out as well. Yes, the food takes time. Yes, the tables aren't promptly bussed. But it's because they both cook and serve the food (and work their butts off). To criticize their poor English is tasteless-not their food.   Their food is amazing. Try #2, #5, 9, #11, #56, 88, 92. Really-we have eaten almost everything on the menu and it's all worth trying!"}
{"text":"This is a true mom and pop shop. The atmosphere is divey but the food is great and well priced. The service is a bit slow, but we were in no rush and found it to be relaxing. We had the #29 Pho and #85 fried tofu veggie noodle magic sauce deliciousness. Highly recommend!"}
{"text":"One of the best pho places in cleveland. Owned by a husband and wife (there is a language barrier), its definitely a hole in the wall, but appearance isn't everything!! I drive from north ridgeville to come out here I love it so much. I've never had a bad meal here. I always get a number 4 and number 30."}
{"text":"This is some of the best food in Parma. Don't be put off by the run-down decor. This husband and wife duo serve up delicious Vietnamese food and fast. Spring rolls & #85 with tofu are my faves. I do wish they would take the crumbling artwork off the walls and invest in a couple gallons of paint though."}
{"text":"Good food, good service - always pleased when a Vietnamese restaurant has more than Pho and sandwiches and this place did not disappoint. Yes it's a hole in the wall but who cares right?"}
{"text":"Love the chicken with rice noodles. Fresh and made to order. HUGE portion and had to box the rest to take home.  I have a hard time understanding the lady that runs the restaurant, but she is very nice.  I point to the picture and just say NO PORK NO BEEF! and my order comes out correct. If you do not have time, save the visit for when you do. It might take a while to get your order.  So nice to have a place with Vietnamese food in Parma, and GOOD too! Will have to try this Pfo everyone is talking about."}
{"text":"oh man, i'm so conflicted. first this is a hole in the wall for sure. there is no ambiance or decor. the old lady pointed with one finger without speaking, just signalling for us to sit down. a little eerie...we get some noodle soups and we start eating and it's pretty tasty. and then i happen to notice some floating black things. must be pepper or something.... i happen to look closer.... looks like there's legs on it.... i look closer on purpose now.... multiple floating black things with legs... omg so many... ahhhhhhh well that's it for my meal. i'm so disgusted. we examine my partners soup. no floating black things. i got the veggie noodle soup if that matters. maybe there were things in the vegetables that they didn't wash out. sigh. this happened the second time i came here and sadly i cannot bring myself to go back again."}
{"text":"I have only been here once ordered take out from this restaurant. I called ahead and was told it would be about 20 minutes and it was ready when I got there. Service was very good, woman behind the counter was very nice. I enjoyed the Chicken Pho that I ordered. I would go here again but when I do, I would eat there so I can get an idea of how their food is right out of the kitchen.  Based on other people's comments, it seems as though this place may be hit or miss."}
{"text":"Couldn't even try this place out. Went in and went to go to the bathroom before we sat down (we were on driving to the airport from Madison and had specially come early to try this out because my sister had already eaten their and said it was delicious) but before we got there we were stopped by the owner told the wait for food was to long and we should just go. There was only 2 tables  and one had already had food. Also a man who came in after us sat down and she preceded to take his order as we were walking out and said nothing to him about being to be busy...All and all a super uncomfortable situation and have no idea why it happened...and still need to pee...."}
{"text":"loved the food here  , very nice aged couples running this place . They made really awesome friend rice and stir fried noodles . And the price is cheap .. will definitely go there again"}
{"text":"Tay Do is a tiny little run-down Vietnamese joint on the corner of Stumph and Snow. It is likely that if you aren't looking for it then you'll probably miss it. The shopping center is also quite dingy and when I walked in Tay Do I began to get a bit scared by the lack of customers patronizing the joint. It also left a lot to be desired from first sight.   But, fortunately this is one of those \"don't judge a book by its cover\" type of restaurants. Although it certainly isn't the best Pho I've had, I can vouch for the fact that it is still quite good. A good hot bowl of Pho is like medicine for your soul and this place filled that gap for me.  I personally am a fan of the Pho Ga, but many things on the menu are good. Most of them need some additional cilantro, lime or sarachi, but all of those things are available, so you'll be more than happy with the meal.   The only thing I was not overly impressed with were the Spring Rolls. Although I am a huge fan of mound and mounds of cilantro in my food, these over did it by a bit.   However, spring rolls aside, the food is great and the staff are very friendly. Take a gamble and go visit.  NOTE: they only accept credit cards on orders over $10 so if you get nothing but a bowl of Pho, you better bring cash."}
{"text":"Had an awesome new years day dinner there.  Ordered the Pho Xao Chay and instantly fell in love with it.  It was slightly sweet with plenty of fresh crunchy veggies. I highly recommend.  The older woman working, even though she didn't speak english very well, was helpful in helping our table order since we had a lot of Vietnamese first timers with us. Will definitely go back."}
{"text":"This is a seriously impressive hole-in-the-wall mom-and-pop Vietnamese restaurant.  The menu is very extensive (which I found exciting, after Long Phung on Detroit closed--which was the only other Vietnamese restaurant in town with a similarly large menu), and the menu has a number of dishes that you won't find at any other place in town.  The food here also has its own unique flair.  It is not in-your-face in terms of how it is spiced: I found it to be more subtle and balanced, almost in the way Cantonese food is subtle compared to say, Szechuan or Hunan food.  But it's really, really good.  The ingredients are fresh.  The atmosphere is minimal.  It feels very 70's/80's and the interior is a bit bleak and looks like it hasn't been fixed up in a while.  But the prices are very low and the food is outstanding, so what can I say?  Absolutely 5 stars."}
{"text":"We are not from Cleveland, Ohio just here for work.  We've been looking for a good place to have some good Pho, soo glad we found this Gem!  First of all, keep in mind that this place isn't a fancy restaurant. There are a lot of parking lot around this area. Then again, we came during lunch. I have to say lf you are looking for a good Vietnamese food you can't go wrong with this one!  Highly recommend this place to satisfied your Viet food cravings. We ordered Beef Pho, Vermicelli beef Shrimps & fried rice. They are all yummy! Pho wasn't all that special but has that homemade taste to it.  Customer service...Please don't misunderstand it! The old lady might seem mad/upset/rude but that's just how they are. Lol. She's honestly such a sweetheart! But barely speak english so it's a little difficult to communicate. Great prices for good food."}
{"text":"Pho to go was good but next time I will eat in, I had to reheat the broth which was not a problem but I still think eat in next time should be the norm. Also had ginger chicken, it was okay...I thot it would come with some spicy wild type rice but it was just plain white rice, chicken an onions were good. Nothing notable...  Again...I think eating in would be a better idea and also having an idea of what I REALLY wanted to order would be a good idea so next time I do a little research on the menu and maybe even learn a little Vietnamese so as not to get the quizzical looks of confusion!!!!  HA!!!!"}
{"text":"Please please please do yourself a favor and do not judge this book by its cover. While a Tay-Do may not look like much, the food makes up for it.  The Pho here is fantastic and the broth is very flavorful.  Go and check them out, you won't be disappointed."}
{"text":"My husband and I stopped here because no other restaurant was open on a Sunday in the area. We have never tried Vietnamese but after reading all the great reviews on yelp we gave it a try! The reviews were spot on with this place, it was so good! We had the fried tofu first and it was awesome. We both ordered the #88 mine with beef my husband had chicken. We also had tofu fried rice. All the food was delicious and very home made tasting. We loved our meal and the owner was so sweet! We don't live in the area but hope to come back and try different menu items!"}
{"text":"I rarely review but I felt that I had to here.  We do not have much Vietnamese places in the area and I was in the mood for pho.  I had called ahead and was told it would be a 40 minute wait.  I got there in about 20 minutes.  I saw a couple that said they were a walk in and had been waiting for over an hour.  They proceeded to walk out.    The woman who greated me did not speak much English at all and seemed scattered.  She offered me a water and I told her no.  She gave one to me anyhow and the was black particles drifting around in the water.  I'll try and post a pic."}
{"text":"Excellent food. Very nice owners that even taught me a little about how to eat Vietnamese. ie. Bahn Xia Pancake (sp)"}
{"text":"Definitely a hole in the wall, mom and pop type place that has a nice homely feeling to it.  These types of places usually have the best food and at a reasonable price, and Tay Do fits the bill.  I would say this is the second best Viet restaurant in Cleveland, coming up just behind Superior Pho.  The service was okay.  The lady that owns the place usually is the one waiting tables, and if it gets busy, she takes a while to get to you.  It is worth the wait though. Once you put in your order, it doesn't take long for the food to come.  No, the lady doesn't have the most outgoing personality in the world, but that's just her demeanor. She is actually very kind.  Her English just isn't that great. It also helps if you have a Vietnamese person in your party.  Onto the food... I'm not that big of a pho fan *gasp*, but it was pretty good when I tried it. I usually get the Bun Thit Nuong Cha Gio (bowl of vermicelli noodles with beef, spring rolls, veggies) at any Vietnamese restaurant, and this one did not disappoint.  Portions were standard fare. The grilled pork however was amazing, as were the spring rolls (cha gio).   Also try their special fried rice.  It has a bunch of different kinds of meat, and the seasoning is AMAZING.  Not exaggerating when I say it's the best fried rice I've ever had.  One thing I would advise against is the dumpling appetizer. They tasted like the precooked frozen ones you buy at the Asian store.  Meals were cheap. $8-$10 per dish."}
{"text":"This place is awesome.  Forget about the cry babies.  If u are looking for authentic this is the real deal. Soups are great.  Bowls are great. The owner is great.  The service was fine.  She doesn't speak English well but good enough.  This place rocks.  It's not pretty it's not fancy. It's just great food."}
{"text":"I stopped in not intending to eat, just wanting to look at the menu as a potential for dinner that night, but instead I was met with a lovely elderly woman who was too kind. Due to language barriers she thought I was ordering to go, but really I just wanted to see the menu. She was so sweet and kind I decided to stay and eat. I ordered \"beef soup\" which I now know is called pho. It was an amazingly clean beef broth with rice noodles and slices of thinly cut beef. It is served with both hot garlic red chili sauce and a sweet sauce, along with what I assume were mung bean sprouts and some Thai basil. It was delicious. And for a Cold rainy day it was just the right kind of heart warming meal I needed. Next time desire overpowers my judgement, I'll save all the pretty ladies of Instagram a pointless DM and hit up tay do for some pho, because it's flavor is more satisfying than any Instagram girl can offer. Speaking of girls, I wouldn't take your date here, unless she likes to hear the sound of slurping noodles and callous disregard to anything she says, because deep down we both know, the soup's tantalizing flavors has more interesting complexity than that story about the one time her boss said thank you in a condescending manner ever would."}
{"text":"Place is very friendly. Outdated and grungy  but that never deters me. Some of the best places are dives. I had high hopes for this place because of the yelp reviews. I was very disappointed. I was the only customer yet The rolls were all over cooked, very very dark brown. I was given the wrong order. Ordered general tsaos and got sweet and sour, then tried to convince me it was tsao. They used a microwave for everything. And the single serve mustard and duck sauce packets were tasteless and bland. Got beef broccoli for a friend, and the inside of the broccoli was still frozen. Won't be returning. But 2 stars for reasonable price and friendly lady."}
{"text":"We've eaten at just about every Vietnamese restaurant in the greater Cleveland area, and Tay Do in Parma might be our favorite. It's everything a hole-in-the-wall Vietnamese place should be, a true mom-and-pop (she works the front, he the back) establishment. The bun thit nuong, my standard order, is fantastic, as are the banh xeo, spring rolls, vietnamese chicken salad, and spicy beef with tomatoes. It won't win any awards for decor or location (in a truly hideous strip mall) but for anyone in the area looking to experience some real Vietnamese cuisine, this is well worth the trip."}
{"text":"Stumbled upon this on yelp (4 star Vietnamese restaurant in CLE??) and gathered a few friends to try it out on  a weekday.  This place is a total hole in the wall, middle of nowhere, run by a husband and wife.  I would never have found this place without yelp! It was a weekday so we were the only ones there for dinner.  We were greeted immediately when we got there.  The first thing the wife asks us \"Any of you Vietnamese?\" I say yes and she immediately starts chatting me up.  The rest of my friends were not Vietnamese so they just watched amusingly as we talked (and I struggled through my Vietnamese).  The woman was so excited to chat with me, she was super sweet and friendly!  After about 5-10 min of chatting, she asks what we want to order and I ask her what she recommends.  There were a few things I already was eyeing on the menu but it also sounds like she can make anything you could want (if you know what to ask for).   They have a pretty extensive menu with lots of traditional vietnamese dishes.  We originally were going to order Banh Xeo (Vietnamese crepe) but she said it would take about 30 min to make--so maybe next time!  We decided to order Canh Chua Tom (Tamarind soup with shrimp), Bun Cha Gio Thit Nuong (Vermicelli with egg rolls and grilled pork), Bo Luc Lac (Shaking Beef), and lemongrass chicken with vegetables (forgot what she called it on the menu).  All the dishes were tasty and flavorful.  I'd recommend them all but I think the Canh Chua and Bo Luc Lac were probably my favorite.  The Canh Chua is a bit on the sweeter side because of the tamarind but comes with a nice assortment of veggies in it.  The beef was super tender.    I hope that people come try this place out! It's a nice find for Vietnamese food in CLE.  It's your typical no nonsense Vietnamese restaurant that reminds me of places back home.  And next time my mom's in town I'll take her here so the owners can have a proper Vietnamese conversation haha"}
{"text":"If I could give it more stars I would. Everything tastes amazing. We have tried almost the whole menu, and while we have our favorites, literally almost everything is amazing. Don't go when you are in a hurry... its a husband/wife deal and you get the food one dish at a time when its hot and fresh. Best food ever."}
{"text":"The best food I've ever had in my life! The pho is pho-nominal and I also highly recommend the gingered beef. I go here as often as I can."}
{"text":"Awesome place! My girlfriend and I stumbled onto this gem when me moved to the area and we're glad we did. The  employees, a little woman who works the front and a man in the kitchen who cooks everything up, are the nicest people and the food is amazing! You would never think so by the looks of the place but I assure you that this place is a diamond in the rough. We come here once a week now and always get the same thing. The Pho is always spot on and the chicken fried rice #14 is the best we have ever had! Definitely recommend trying this place out at least once and I bet you'll keep coming back again and again."}
{"text":"This place is really ordinary, def not great. The only thing that bugged me is that their cup and spoon smells like chlorine and the pho will have some chlorine in it too. Seriously, not coming back."}
{"text":"Came here for lunch and tried a vegetable pho with the # 60 which is lemon grass based dish.  It was delicious.  Only advice I can give, is to be patient if you get an older lady helping, since she speaks very little English."}
{"text":"Tay Do was my destination one evening after flying into Cleveland-Hopkins International Airport. Was Halloween night!  There were 3-4 other tables of diners when I arrived. Not seeing a host/hostess to seat me - I grabbed a table and waited. About five minutes later a little lady came over to greet me and give me a menu.  I ordered the Pho Ga - their menu lists it as being a \"cinnamon broth.\"  35 minutes later my Pho finally came out. By far the longest I've ever waited for Pho. I was close to getting up and leaving and finding something, anything to eat - when the Pho finally came out.  The plate of veggies/aromatics had no Jalapeños and no Basil. Instead there was fresh Cilantro on the plate - I've eaten Pho at a lot of places - I've never seen that. I asked for Jalapeños and Basil - apparently they serve neither. The lady who was serving me seemed confused, I told her that the vast majority of Pho places I go to serve/offer both of those items with Pho. About 5 minutes later she comes out with a small bowl with some sliced chilies - they looked like they were some sort of Thai or Serrano chile pepper. Whatever they were - they were very spicy! Just the way I like it! She seemed surprised that I took the entire amount she brought and dumped it into the broth.  The broth was very different than most of the Pho I am used to eating. I could characterize it as being somewhat \"rustic.\" Not bad - just different. Chicken was tender. Noodles were not clumped. Cilantro, Bean Sprouts, and Lime - all appeared fresh.  Cons: - No Jalapeños and no Basil - The bottle of Sriracha sauce was obviously stored in a refrigerator. I prefer my Sriracha to be room temperature. There really isn't any reason to refrigerate Sriracha IMHO. - I hope 35 minutes is not the average to get a bowl of Pho here. That's a long wait for a bowl of Pho!"}
{"text":"Simply put this is the best Vietnamese food I've ever eaten - and to top it off it's also very reasonably priced.  I've been here four times now, my girlfriend and I go out of our way to visit whenever we are in Cleveland. It's a mom and pop shop in an otherwise vacant strip mall.  The place is pretty small as you can see from the pictures, but is very clean. The menu is in slightly broken english, but that just adds to the charm in my opinion.  Whenever we go the place is either completely empty or has only one or two other patrons.  I felt so sorry for the owners the last time I was there because we came at 6pm (dinner rush) and there wasn't a single other person in the restaurant.  Clevelanders, please go out and support this fantastic hidden gem!  Favorite dish: Ginger and onion tofu"}
{"text":"I admit to being a little hesitant when we pulled up to Tay Do but as soon as we got our menus, I was excited to eat.  We got the fried tofu appetizer, fried noodles with veggies and noodle soup with chicken, pork and seafood.  Everything was outstanding!    Our food was fresh (not greasy or heavy), had great flavor and was very well made.  Really one of the best \"finds\" in Cleveland.  The lady running the front was adorable and I wanted to put  her in my pocket and carry her around with me.  It's not the fanciest of restaurants, but it IS well-maintained and clean so I'm not sure I'd call this a \"hole-in-the-wall\"... I prefer to call it quaint."}
{"text":"Very good Pho. Family owned business. The owner's English may be a bit rough... I think they're specialized in Vietnamese food!"}
{"text":"Well, that was... okay.  With all of the excellent Vietnamese restaurants in the Cleveland area, it took me awhile to come down to give Taydo a try.  But with four stars on yelp, we couldn't pass it up.  We came on a Saturday night and we were the only ones in the restaurant.  Don't know if this is the bad part of Parma or what, but other reviewers are right that nobody seems to come here. The whole place felt sort of like a run-down hole-in-the-wall mom and pop restaurant.  The experience was kind of surreal, actually.   We had a pho and a vietnamese noodle salad.  The noodle salad was pretty typical and tasted decent.  The pho broth was decent, not particularly flavorful, but the meat was overcooked and there was not enough of it.  Overall, my experience was very much okay.  If there weren't better pho options in town, I guess I might come back.  They don't really have Chinese food on their menu."}
{"text":"You want quick service, I suggest you call in ahead of time.  Even if you're eating in, they will still take your order ahead so that when you get there, you do not wait super long.  It is a MOM & POP restaurant (literally, husband cooks, wife waits the tables)...be patient.  I have been coming here since fall of 2001 and can say that throughout the years, Tay Do has always been about great food.  Don't judge based on the outdated interior.   My favorites include their fried rice, spring rolls (fresh and fried), potstickers and #21 (my 14 year old son mentions that if he had a last meal, #21 would be his request).  When it comes to their Pho, I recommend those that have cinnamon broth and rice noodles.  Finish off with some Vietnamese Ice Coffee before heading into a Carb Coma"}
{"text":"This place is owned by a nice elderly couple. I ate here last Spring with a friend who grew up eating here and it was pretty nice. We both had a regular pho, it was nice and warm :) I'm surprised there is a pho place in Parma and would like to stop here more often ~ Trying new things next time :D"}
{"text":"middle of the road review here .. food was delicious .. but it take a long time to arrive .. the service is horrible .. granted this a mom + pop place & there is literally a mom + a pop running the joint but that does not mean you should expect rude service .. granted there is also a bit of a language barrier but the woman who runs the front of house certainly does not make you feel very welcome until she warms up to your presence nor does she seem very approachable .. I was literally too scared to ask for a 2nd glass of water (the glasses are TINY) & she nearly scolded me for asking for a fork since (gasp!) I am not coordinated enough to use chop sticks .. I may go back for the food but this time I know what to expect in terms of service .. also, be prepared .. I went to lunch w/a co-worker so we asked for separate checks .. despite calling ahead to be assured they were not a cash only establishment & told they accept debit/credit cards my co-worker was scolded for not ordering a meal of a min 10 dollar check so the front of house woman refused to allow her to put it on her debit card .. so fair warning .. to use a credit/debit card you must spend 10 dollars minimum"}
{"text":"We were in th mood for pho but we really didn't want to drive the distance to Superior Pho so we decided it was time to try something new. Yelp showed me a place closer to home which happens to be this place.  As soon as we walked in, it was empty and we got service quickly. Once we got our food, people started piling in! The owner is the only one providing service so as more people come in, the service becomes slow but definitely worth it.  This place is definitely a hidden gem!  The place looks pretty run down and you will sink in the booth when you sit down.  And if someone is sitting behind you and moving around.. you will definitely feel it and get pushed around if you aren't as big as the person sitting behind you.  Now let's be honest..  I didn't come here to critique the area.. but to critique the food and boy oh boy! My palate is definitely satisfied!!  We ordered the number 1 appetizer which was the fried egg rolls and you can tell it was homemade.  You could actually see the meat and vegetables inside the wrap.  The iced coffee is definitely better here compared to what we are used to. Not too sweet and you can actually taste the coffee.  Now for the main course!!! I had the number 30 pho! When I had my first taste of the broth I was in love!!! It was clear unlike the broths I was used to and it tasted so absolutely amazing!! It's basically the cat's meow! The broth really didn't need anything to it since the broth was already full of flavor!  Basically I was already full but kept drinking the broth because it is that good!! There was a generous portion of noodles but not that much meat.  The cost of the meals were very reasonable and delicious!  I will definitely come back here with others to try more stuff.  I'm really happy I finally found a place with good pho that is close by to my house.  I honestly feel like this place will now be my go to for pho when I'm not in the Chinatown area."}
{"text":"The beef dishes are good at Tay-Do.  I had the tender beef cubes from the house specials section.  The beef cubes were extremely tender and perfectly cooked.  Served on an assortment of salad vegetables, don't forget to dip the beef cubes into the sauce.  The vermicelli dishes are on par with other Vietnamese restaurants I've been to in Cleveland.  I ordered the beef lemongrass vermicelli and again, the beef was cooked and seasoned well.  Again, a good mix of vegetables and fried onions to give the noodles more flavor.  The pork spring rolls were average, perhaps fried a little bit too long.  The server was a little panicked during the dinner rush and it took a while to get our food.  But it's worthwhile to be patient.  The server was very nice and accommodating after she was less overwhelmed with customers.  Apparently if you want to order a Vietnamese crepe, it will take 30 minutes to make."}
{"text":"It's my favorite vietnamese restaurant I've been to in Cleveland.  The wife who owns the restaurant's name is Hi, and her husband does the cooking and runs teh credit card machine.  She's very nice, not very talkative but that's probably the language barrier.  Stops by frequently when we've been there to check if food is good and if we'd like more to drink.  We always start with the potstickers.  They're homemade, thicker dough outside, very good.  Comes with a typical potsticker sauce for dipping.  Wife got the number 30? bowl of pho.  The bowl was roughly the size of Superior Pho and as you know, that's a good size.  Flavor is very similar, wife thinks there is slightly less soy, and will add a splash if she feels in the mood.  I get a vermicelli noodle dish with whatever meat I feel for the day.  By the end of the meal my wife usually has half a bowl of soup to bring home and I'm full, which is a good thing as I like to eat."}
{"text":"Expect long delays.   Waiter is an old lady who doesn't speak much English.  Chef is probably her husband.  We made a reservation and went as a group of 11.  Arrived at 6:30.  Earliest dish came at 7:45.  Latest dish came at 8:15...which is due to her forgetting about the orders. I want a small bowl of pho and she told me to order a large since small is too small.  I believed her and ended up not finishing the large one. She complained about my son making a mess on the floor when I handed her my credit card.  I wish I have picture this show this \"mess\".  My son dropped  few pieces of rice (since that is all he ate..white rice).  I went down to the floor to pick the rice up and cleaned up the \"mess\". I wrote down a total with tips included.  She wasn't happy and told me to write the tip number out.   Back to the food...like another review, it does not taste like other Vietnamese soup base.  The meat they throw in there is minimal.  No basil.  Sauce is from the fridge.  No spoon.  I will not go there again."}
{"text":"Quiet strip mall location restaurant with extensive Vietnamese menu.  Courteous service.   Vietnamese coffee was tasty, and the vermicelli noodle bowl w/ pork rolls (Bun Cha Gio Thit Nuong) was delicious, as good as any I've had in Vietnamese restaurants in the West (I lived in Denver and Phoenix previously).   Recommended."}
{"text":"Best little family owned place. I defiantly recommend you try number 92! My favorite !"}
{"text":"First large bowl of pho I have ever been able to finish - simply because it has to be one of the best broths I've tasted in a pho in cleveland.  Other places have more meat, some better condiments, but this one was just a solid broth, very good.  Service was good - the lady was attentive and kind.    Its a little whole in the wall in a strip - easy to miss, but give it a shot.  I'm going back to try one of the other multitudes of Vietnamese specialties soon."}
{"text":"I highly recommend calling the place first before coming. Perhaps it was because the icy road condtions at the time of our visit, since it took us 3 tries to coordinate with their service. If you call & if their mailbox is full, dont try your luck to come because most likely no one is there at all. I love phò regardless of the season. But i like it most in the winter. Luckily theres a healthy competition of phò restaurants in our area back home in north-central Texas. & Tay-Do was just ok, a non revelational experience, in my humble opinion. The place is a little hidden from the main intersection. It's situated midway in a nondescript multi-use building which was easy to spot once inside the parking lot. The door signs/notices is enough to start a deep intellectual conversation once you enter the restaurant. We waited quite a while for our food to arrive as mentioned by the fellow yelpers. The appetizers (potstickers & eggroll) were good portions. Greens for the soup were a little wilted or dehydrated. Most of all, the soup didnt taste authentic for me. Almost tasted like it was rendered from a powdered soup base. Ultimately the dishes we ordered satisfied our hunger for phò & enjoyed the company of the litle old lady. BTW when paying, if you flip out a credit card, she'll say \"no cash, no cash?\". & then she'll signals the cook to handle the card transaction for her. I think this little old lady runs this joint."}
{"text":"Tay Do I do love you and your awesome iced coffee,and have been going here for years.Sadly your skimpy portions on entrees make it difficult to return more than once in a while.You would also do well to clean the place up some,the bathroom and dining room are kind of gross.Paint and some new carpet along with a little more attention to the cleaning would go a long way towards keeping more customers coming. I haven't given up on you guys and the food is always great,but the last time I came you literally served me a half a cup of five dollar coffee and such a skimpy plate of food that I left hungry and our bill was 50 bucks."}
{"text":"This honestly is the best Vietnamese in Cleveland. It is a complete mom and pop place with no frills but the food is worth it. The menu is huge and you definitely order by number. The husband makes everything to order so if the restaurant is crowded you may wait a while but it's worth it. I ordered Tom Rim for a long time because it is a fave. The tamarind soup is to die for. The hubby only orders bo luc lac and it never disappoints. I've told others about this place and they've converted as well. Best place in Cleveland."}
{"text":"I love hole-in-the-wall places, and I have a soft spot a mile wide for kooky older Asian ladies, mostly because they remind me of my mom.   As such, this place can do no wrong. It's run by a husband (chef) - wife (everything else, said kooky Asian lady) team. We went with a couple who used to come here when they lived in Parma. Though that was years ago, she still remembered them!   The food was delicious - I ordered tofu vermicelli, and the tofu came out in delightfully crispy little strips. My order sadly didn't come with fish sauce, but the sweet soy sauce was just as good! Service was slow, but the wife apologized for it profusely, and like I said - this place can do no wrong."}
{"text":"So long story short, I am here for an internship over the summer and I am looking for a great pho place while in Cleveland. So, I went to Taydo and they charged me $2 more for pho.  They were rude. The lady was telling me how to eat the pho (I eat pho every week, so I guess she thought I did not know how to because I am African American) and telling me to eat it quickly.  The lady stared at me the WHOLE TIME while I was eating. That made me feel uncomfortable and made me feel even more hurried to get out of there. She cleaned up , collected the bill, looked to see what I tipped her etc, while I was still sitting down. They asked where I lived and worked and when I told them where, they thought I was lying. I asked for chop sticks, for whatever reason, they did not give me any which was weird.  When I asked for the chop sticks, she looked at me surprisingly like she could not believe I knew what a chop stick was.   Overall, what I am saying, is that they seemed very racists.  YES, African Americans love to eat pho too. I will not be spending my money here anymore."}
{"text":"To be honest, Pho (beef noodle soup) doesn't have the correct taste of what it is supposed to be. The stir-fried beef with white rice is only as good as anyone can cook. If you are looking for something simple to fill stomach, this place is ok. I wouldn't come back unless there is nothing else or nowhere else closed by that offers vietnamese food."}
{"text":"The food was tasty. I ordered pho, an order of egg roles, and an order of fried rice. Here's how I would rate these items: Pho: 4/5 very clean and authentic taste. Egg roles: 3/5 too fried, but overall good. Fried rice: 3.5/5. The fried rice was on the sweet side, odd for my taste."}
{"text":"Since falling in love with Tay Do, their food has been on my mind a lot lately.  My wife said she was going to Chipotle for lunch and I asked if she would go to Tay Do instead.  She agreed!  Woohoo!  This time, we ordered #14 Com Chien Tom with chicken,, #17 Banh Xeo, and #90 Pho Xao Dac Biet.  The #14 and #90 were delicious once again!  The new dish was the #17.  It was 6 crepes filled with chicken, carrots, beansprouts, and other veggies.  The flavor was delicious and the portion was gigantic.  Six crepes is enough for three people!    We ordered takeout and were told 40 minutes for preparation.  When my wife arrived, there were four tables being served and the lady was asking people to leave.  Hey, the services isn't stellar, but the food is.  It's just a husband and wife.  The wife is not afraid to tell you what to do.  There are no other servers or cooks at Tay Do, to my knowledge.  In addition to the 40 minute prep-time, my wife waited an additional 15 minutes in the restaurant, so they threw in a salad and a couple more crepes, which is probably why I received 6 of them.  The husband and wife both apologized for the long wait, but also asked my wife to sit at a table where they served her tea.  Their amazing flavors must come from the oil that they cook with.  I want to know what is in the secret sauce because it is very tasty.  I love the food."}
{"text":"I ordered the #29 pho yesterday to go based on the reviews and it was great! I have had Pho at many places in Cleveland and this is definitely the best that I have had so far and it is cheaper. Not to mention it is in Parma so it is even closer. The restaurant is very authentic and the woman running the store was very sweet."}
{"text":"Finally tried this place after hearing so much about it!  A few friends invited me to eat with them at Tay-Do. When I heard they were going, I instantly gave a resounding \"yes yes! I want to eat there!\"  This place is located in the middle of a plaza....with a flashing Christmas wreath in the front. Hrmmmmm I thought. We entered...and were the only people in the restaurant. Ummm... and we hesitantly walked in.  An older Vietnamese lady came out right away to take our order. Seeing that only one of us were Vietnamese, she proceeded to talk to her..while the rest of us decided on our order.  We ordered the tamarind soup with shrimp, the grilled pork vermecilli.... a beef dish, and the lemongrass chicken. I loved the tamarind soup (mmmmm), and the vermicelli was good too. Overall, everything was good- very flavorful and cooked well.   The menu was super extensive (not sure why they call themselves a \"Vietnamese-Chinese\" restaurant..when there's only like 5 Chinese items on the menu), so I want to come back and try some of the other items on the menu.   Perhaps people just don't know about this place yet? Is that why it's empty? Cuz... it's pretty good! I would go back, fo sho."}
{"text":"I went here for pho  , and it was supposed to come with steak, beef balls, and other meat. It only came with flank steak and nothing else. The broth was also very greasy. Not the best. Okay, but will not be back."}
{"text":"The lady who runs this is a real trip. The girl in the booth behind us wanted to take her pho to-go which is a dumb idea and a waste. The little lady said \"No, you eat now!\". We tried to order the fresh rolls which is number 2 and she said \"No, number 1\". My companion insisted on 2 but she kept saying \"No, number 1!\" but did a gesture which looked like rolling a blunt. I figured out that she meant they were out of the clear rice wraps and I cleared that whole misunderstanding up. There is a $10 credit card minimum. The girl behind us wanted to settle up on her bill and was informed of this. She ordered a number 1 to bring her past the $10 threshold. She asked if it will be ready in a few minutes and the lady replied \"You will wait a long time!\" I thought that was the funniest thing ever. I thought the girl's head might explode. I wish the lady who worked here was about 30 years younger and single because I would like to marry her. It is a breath of fresh air to have honesty and frankness in the service industry. The pho was alright. I still think Minh Anh has the best in Cleveland. Even though the salt spike screws up my circulatory system for a few hours. I recommend that everybody should come check out Tay-Do for a fun experience. The food is pretty good but the service is even better! Enjoy the show."}
{"text":"My coworkers and I love this place. #39 with chicken has turned into one of my favorite dishes. If you are looking for a warm, fresh tasting soup look no further. Their pot stickers are good but the dipping sauce is amazing.  Tay Do is becoming a weekly staple in the office."}
{"text":"Food was average at best. Very rude old lady working that day. Maybe I didn't get the right dish. Was kind of pricey for what you get."}
{"text":"This place is so great. We only get pho here now. It's made fresh by the husband and his wife takes our order. The spring rolls are perfect. It's on the list of the best places to get pho, but we always get here and never need to wait. The prices are ridiculous for the quality and amount of food you get."}
{"text":"Service: sub par First I waited about 10 minutes to place my order when I was the only customer. They were busy preparing a pick up order. Then, when I did order, they did not have the spring rolls anymore. So, I ordered the Pho Dac Biet and Cafe Sua Da and ordered in their Vietnamese name. The lady kept shaking her head and asked \"what number?\" As if didn't speak any Vietnamese. I've ordered these far too many times in Vietnamese to not have pronounced them incorrectly. The lady goes back in the kitchen and started busting out in Vietnamese.   Food: sub par First, they did not have the spring rolls on the menu. When the pho Dac Biet came, it was lacking a lot of meat, although the broth was very delicious. Cafe Sua da didn't take like any of the Vietnamese coffee I've tasted in my life.   Price: average"}
{"text":"Ok, their pho is really good. I like most of their broths and their other food items are good as well like the shrimp fried rice. Friendly customer service also. The manager is really funny my friend and I couldn't stop laughing at one point. My friend was putting a lot of the special sauce on his fried rice that was meant for the soup and the manager came over to stop him and said \"this sauce is very expensive don't use too much\" in her thick Viet accent. She was being serious but it was hard to take her seriously but my friend did calm down his sauce usage. The inside is kind of whatever as is its location but that's Parma, Ohio for you."}
{"text":"I was really really expecting more from all the reviews.  I made it there, dining solo since I was out of town, around 815p and there was NOBODY IN THE PLACE at this time (Tues nite).  I asked if they were still open and realized the woman running the place doesn't really speak English. So I made it through the menu but then asked for suggestion and she suggested the fried noodle with beef, chicken and shrimp and the fried spring roll. It was out and delivered together, which I found strange.  The spring roll was nasty.  Possibly slightly over fried and a dark brown.  I ate just one of the two.  The pan-fried noodle was decent, not anything I'd write home about.  Not much meat, plenty of vegetables and not much flavor to inspire me to eat more.  So if that was her suggestion since I told her I might only be able to make it once to eat there, I'm a bit disappointed. Good value, but not really great food.  I have enjoyed better in my travels."}
{"text":"Mom n pop type shop. Glad to find it in Parma. I recommend the Lemongrass Shrimp & fried rice. Yummy, cheap Viet food."}
{"text":"Lovely old married couple running a traditional Vietnamese restaurant.   Really welcoming and cute. Asked us if we minded a wait time and we didnt't. I appreciated the courtesy and the food was great!  Perfect home style, traditional vibe and would recommend to anybody not in a rush."}
{"text":"First the good. This is a hole in the wall I would have never stopped at if it wasn't for Yelp. I'm giving it 3 stars because of the food. I had the fresh shrimp spring rolls. Delicious. I followed that up with an order of pot stickers the biggest and most doughy I ever had but never-the-less? excellent?. My wife had some sort of ginger chicken dish which she enjoyed very much.  Now the downside?. This is a mom and pop operation. When it came time to pay the bill I handed her my Visa card. She says to me in broken Vietnamese English? \"What...you no have cash!\" She seemed rather indignant? about it. I thought to myself this must be a cash-only? joint. I turned around to look at the front door and they accept the full array of credit cards. She picks up my card and waives it around taking it to her husband cooking in the kitchen. A speedy? Vietnamese? chatter soon ensued?. He comes out and gives me a dirty look as he ran the card. I have? never been in a restaurant? advertising? they accept credits and then get pi$$ed off because I used one! These people are so f------cheap they squeak when they walk. We left the fortune cookies behind because we didn't want them to file Chapter 11."}
{"text":"Food tasted burned. Had fried rice with pork, it was more like plain burned rice with few pork bits . The waitress was rude. Rolls were thin and didn't taste fresh at all. Never again."}
{"text":"They are very nice and welcoming. The food is awesome as well. I always try something new when I go and I have never been disappointed. I highly recommend this place!!!"}
{"text":"As other reviewers have pointed out, Tay Do is a total dive, but aren't the dive always the best? For those not familiar with Pho, it is a traditional Vietnamese rice noodle soup and Tay Do serves up my favorite bowl of it."}
{"text":"Definitely a solid bowl of ph, it stands up against the places on Argyle here in Chicago. More beef and rice noodles would be welcome, but condiments were fresh and the broth was rich and aromatic. The place was absolutely empty for the early saturday lunch I had there, and service was provided by a most pleasant and attentive woman. The decor is clean but weathered, like a good greasy spoon diner; there's been no fussing wasted on the walls that could have gone into the food. I wouldn't hesitate to bring ph newbies or addicts alike to this little gem you'd never expect in Parma."}
{"text":"After seeing the solid 4 star rating for Taydo, my coworker and I were excited to check it out. We ordered carry out and were a bit disappointed.   The flavors were ok - slightly bland nothing that I'm going to crave or dream about.  I ordered the #4 potstickers ($6) and the #88 pho xao tom with chicken. ($9.95)  For the price, the food is very lacking in substance - tons of noodles or rice and very little meat and veggies. In the #88 I could count maybe 6-8 small pieces of chicken. The minimal veggies that were there were well cooked and crisp.   The potstickers had ok flavor and a good ratio of meat filling to dumpling skin, but the pork was very gristly and I found myself needing to 'classily' spit out several inedible pieces per potsticker. The sauce cup was filled half full (which is sad as sauce was tasty and a little extra may have given me something to rescue my #88 with).   I will probably not be trying this place again as there are too many options that are far better in flavor, quality and value within driving distance of my work."}
