{"text":"We really want this place to be successful but it needs help.  Inconsistent experience everytime we try to go there.  As a family that typically eats out 5-6 times per week, we want a place we can rely upon for a good meal.  Sometimes food and service are excellent - sometimes it is not.  They also cannot handle busy nights.  Every good meal and service experience has been when there are 3 tables occupied - unfortunately they cannot survive that way.  Food quality is fantastic when you get your meal hot. Pricing is fine if they improve the service level being provided. Fingers crossed they continue to improve."}
{"text":"Nice decor, friendly and helpful wait staff (young and somewhat inexperienced but learning) and good food!  Really enjoyed talking with the owners and see a bright future for another great place to eat on Main Street in Verrado."}
{"text":"All I can say is wow! Living in Verrado limits your dining unless you want to drive to Goodyear. Tempo however offers a variety of menu items offered at a fair price. The atmosphere is very relaxed Art Deco and the customer service is off the charts! Angie and Mike normally help me and my group but everyone we have interacted with have been over the top! It's nice to see the owners are in almost daily if not daily making sure each guest has a great experience! Thank you for being a great hang out and amazing restaurant right in our own backyard!"}
{"text":"I have been a regular in the past.   I tried lunch today.  First, the online menu isn't up to date.  That said,  I  ordered the soup of the day which was a creme mushroom jalapeno bacon which really was lacking in ingredients and a puree.  The online Boratta Caprese salad said it had a specific heirloom tomato with a balsamic demi...The best part...the balsamic demi.  The salad came with sliced grape tomatoes and cold golden roasted beets with a clump of chopped wilted parsley green (supposed to be pesto). I don't mind pricey even when your options are limited, but I do mind pricey inedible. #noexcuses #eatmorehealthy #eatathomemore #growyourowngroceries"}
{"text":"Great Place to come in and have a cup of coffee while returning emails! I love the fact that i can come in early in the day and enjoy a delicious Vanilla Latte. Some complaints I do hope you take into consideration is getting better seats. Its not very comfortable to be sitting on metal chairs and would love to have some sort of lounge area to enjoy. I have also experienced a couple of times coming in the morning that the WiFi won't connect properly and there is nothing the Baristas can do about it. Its a huge disappointment when i get ready and come in just to find out i have to go back home to do my work. Mind you, i have heard people complain to the workers about WiFi plentiful times.  On a side note, the Baristas are very nice and welcoming. There is one barista who stands out to me every time i come in she is ALWAYS so bubbly and happy. She brings in a energy that seems to make a lot of your costumers happy. I love the fact that she takes the time to genuinely keep good conversations with what seems like her \"Regulars.\" Its awesome to come in having my coffee made before i can even get to the counter to pay for it. You definitely need more baristas like her."}
{"text":"Tempo Urban Bistro is nestled in an expanding community between the only two other restaurants in the area. Having recently moved into the neighborhood, I thought should give it a go. Tempo doesn't have to try hard to get the business in the door (location), but the effort they put in to keeping you coming back is clear. The wait staff is attentive and pleasantly helpful. The food, although a little pricey, is by far the best culinary experience of the three restaurants available. It's a little bit of mom's home cookin' mixed with date night in Manhattan. They have a pork chop entree that has a beautiful balance of sweet and savory. I have been several times now and the chef has wowed me from the apps to the entrees. Starting with the shrimp and grits, to the lettuce wraps and the beef short ribs with a bordelaise sauce.  But if you are like me, a meal tastes sooooo much better with good customer service. The owners, Steve and Karen, make a point to step out of the kitchen and greet their guests. After a second visit at Tempo they make you feel like regulars. As someone with severe food allergies, this husband and wife team go out of their way to not only remember which allergens are a concern, but they personally double check that the waitstaff has my order is correct going into the kitchen and when it comes out. I've dined on the patio, inside with live music, and at the bar. I can easily attest that from the hostess to the bartender with the amazing smile, Tempo Urban Bistro is top notch! Whether I am riding solo, on a date, having dinner with family or entertaining guest this is my go to spot."}
{"text":"Oh my gosh, we just got back from eating at Tempo and we can't say enough good things about the entire experience.  Our waiter was wonderful, chatty and attentive. We asked questions and he provided answers and suggestions. One of us had the lobster mac & cheese, one the meatloaf and one the ribbon noodles. We all tried each others dish and each one was beyond belief. The waiter said he could hear us out back saying mmmmmm over and over. The restaurant is very well arranged with front windows/doors open so you can enjoy the beautiful AZ weather. We had a difficult time deciding which dishes we wanted to order and have already decided we will return to try others. The drive from the Surprise area was done in the dark and we were sure we had taken a wrong turn to nowhere but continued on.  Lo and behold, around a bend was this quaint little village. We know when we return we are coming in the daylight to do some exploring in the area. Don't miss stopping at Tempo, it is worth every penny."}
{"text":"We've been here several times. Service is usually ok at best even when not busy. We stopped in Friday at about five. Waited several minutes to have someone take our drink order. Twenty-two minutes later someone else came by to take out drink order.   The remodel is okay but it seems the food prices have increased quite a bit.   They were busier than usual, we learned someone decided to have a meeting with the servers to explain specials, etc. at 5pm with a full house. Not a single table served or greater for over 20 minutes. Nobody told us the specials. Nobody apologized for the wait.   Hoping they will do better as this is one of very few places in the far west valley that isn't fast food. Of course there are always options."}
{"text":"This place is AMAZING!!! Great food nice selection of beer, me and my wife love this place! Everyone here is extremely friendly especially the owners! I highly recommend Tempo for coffee in the morning also!"}
{"text":"We've visited Tempo several times in the past and had great food.  Today we decided to take the whole family in for the Mother's Day Brunch.  The food was out of this world and the service was fantastic.  What an amazing and memorable Mother's Day.  Thanks to everyone at Tempo, we'll see you all again soon."}
{"text":"This was our first time dining in Verrado. The atmosphere was great. They have live entertainment on Saturday nights. The service was ok. We did get there super late and just before closing so I won't hold it against them. My husband ordered the Kobe burger. It was overlooked (I told him he should have went with medium!) He says the burger was \"good\". I ordered the penne vodka sauce w/ shrimp. It was an additional $4 for 3 shrimp. I really enjoyed the pasta and probably good have gone without the shrimp. I was not a fan of the chocolate ganache pyramid for dessert. I'll probably try the chocolate cake next time."}
{"text":"Let me just start out with O.M.G this restaurant is tits. I just had the best food dinning experience in my life. The atmosphere is very modern and sightful. The staff is very friendly the only annoying part I experienced was the table next to me. Something about verrado and the snobs living there haha. I heard blabbing on about how the stay at home mom's are sleeping around while there husbands are at work and a bunch of drama . However bottom line food was great I recommend this place to anyone!"}
{"text":"Very limited lunch selection so I'm quite disappointed. My husband had fish and chips and I ended up with a side salad. Vinaigrette dressing had too little vinegar and lots of olive oil. Maybe the dinner is better here."}
{"text":"We went on a weekday night, and the restaurant was busy but no wait for a table. We sat outside in the patio. It was very comfortable.  We split an order of poutine, and it was incredible! Can't wait to go back and order it again. I wasn't very hungry after eating the huge appetizer, so I just ordered the onion soup. I was not impressed. It was very spicy, which I've never tasted in previous onion soups.  We will be going again. Can't stop thinking about that poutine."}
{"text":"Just read my initial review when the \"TUB\" first opened. Man what a 180. This place has proven to me time and time again that they love what they are doing. The food, service, ambiance and variety is phenomenal!  Every time I go in or stop off in the area, I see a good crowd enjoying life there. I have never had a bad meal each time I go and the mixed drink menu is delicious!  My favorite dish is the deep fried brussel sprouts!  I can't get enough of them. Pair that with a melt in your mouth steak, and I'm DONE!  Bravo TUB!  I'm so happy your here and thriving!  Love it, love it , love it!"}
{"text":"Recently we had a bad experience at another local restaurant, \"The Verrado Grille\", and had left. Our party of 15, which happened to be a Birthday Party, had proceeded over to Tempo Urban Bistro, where we were greeted warmly by Karen. I told her what had happened and she immediately apologized for our bad experience at the other establishment and immediately accommodated us. But she went even a step further and gave us the Royal treatment!  She took our birthday girls' cake into the kitchen to store it and even offered to cut the cake for us, as well. The birthday girl then received a free glass of champagne!  It was a lovely and wonderful experience for all. The food there is fabulous and we will be patronizing Tempo Bistro from now on!"}
{"text":"Was down at tempo Friday night with my girlfriend. Nothing bad to say it was absolutely amazing from the great food to the atmosphere and decor. If your not from  the west valley it is defiantly worth the drive."}
{"text":"Overall, the taste and quality of the food was great, however one of the four of us ordered the salmon, and found it to be overcooked and the portion slight. Another concern is that none of the main dishes we ordered came with a green vegetable, only potatoes, and the server never suggested a salad or side dish of veggies. Opportunity lost on both sides.  Will give it another try for sure though as we are rooting for them to succeed."}
{"text":"I love this place!  The atmosphere is great, the service is great and the food is amazing.  Many many kinds of beer and wine.  If you want an amazing dinner, upscale place to take a date in Buckeye, or have some drinks and listen to live music, there is only one other place in all of Verrado that even comes close and frankly the food and service is better at Tempo by far.  I do not give 5 stars anywhere, four stars tops, but the chef is world class and I make the 40 minute drive to Verrado from North Phoenix for his dishes.  Always great!   Rebuttal to the 1-2 star posts here... * Saw the post about the noodles being rubbery, yes good pasta is not supposed to be overcooked.  Go open a can of Spaghettios if you want watery soft noodles you Philistine.   * About iced coffee and iced tea being bad.  I wouldn't know because I don't drink that crap so I don't really care. Their coffee and espressos are perfect. If you want a tall iced crappachino chocolate frappe latte with pumpkin sprinkles go to Starbucks and pay $6 there for the extra ton of sugar and flavoring they stick in it.  If you want amazing food and drink and atmosphere, this is the place to go."}
{"text":"Great food and service. Had happy hour tapas my favorite was the short rib nachos and flat bread with onions and sausage. Staff very attentive and professional. Looking forward to my next visit!"}
{"text":"Tempo is a great restaurant. The owners Karen and chef Steve go out of their way to make you feel at home. The food is great, always something new to try, I haven't ordered anything there that wasn't delicious. The atmosphere is upbeat and inviting. Great local hang out for verrado. Always our pick for just drinks at the bar, dinner or lunch. Also love the coffee shop has great coffee and yummy very reasonably priced breakfast. The staff is friendly, helpful and welcoming. LOVE THIS PLACE. Verrado wouldn't be verrado without it."}
{"text":"Went for a quick lunch today and was pleasantly surprised at how quickly we were greeted by a server and how quick the food was brought to table. My husband ordered the soup of the day, not a favorite with him and I took a spoonful,  I concur. We both ordered the pork carnitas street tacos, which were good. A tad bit more marinating time on meat might have made it a bit more flavorful. Servers both were attentive and got our beers from bar before the soup arrived. Coffee and Baristas still need work but We will be back to try lunch again !! BTW chips that were served with entree Excellent!! Keep it up and we will continue to come back   I'm happy owners are caring what the masses think good or not so good"}
{"text":"Probably one of the best burgers I've had in this metropolitan area thus far. Great service and friendly staff. Love this place"}
{"text":"Went Thurs night. No wait, nice decor, fast & friendly service, great food!We will be back often. Keep it up."}
{"text":"As a community resident we were excited to have a new restaurant. We showed the nice waitress prior to ordering the Groupon and ordered 2 burgers @$14/each. Very expensive for a burger, but with the offer, we could afford it. After we ate the manager refused the Groupon stating we could use for dinner only. What's the difference? We're still getting $30+ dollars in food!  The price for what we ordered is exactly the same at dinner. Yes, the burger was good, but will choose this establishment NEVER in the future just because it's overpriced and the managements unwillingness to accommodate the customer is probably why it's always empty in there. We will take our business in the future to Verrado Grille a couple blocks away where they have delicious food and accommodating staff."}
{"text":"Thank you to the managers over at Tempo for welcoming our party on Friday night after we experienced such horrible customer service elsewhere.  We felt welcomed at and appreciated, the food was excellent, service great!  We will all be back over and over again!"}
{"text":"From greeting, to staff, to food and drinks, you will feel at home at Tempo. It is honest and great food, great service, and great looking restaurant (clean). Give them a chance to impress. You will not be disappointed. Ask to meet Chef Maynard and he will be enthused to come out and talk to you. He and his wife treat you like family. The entire staff works as a team to ensure you are impressed and you will bring your friends in to show off your find."}
{"text":"Had an amazing risotto here for dinner! Highly recommend it to anyone who goes here. They also serve omission beer by the bottle here which was a nice change to drink for someone allergic to gluten. As for the coffee side, I enjoy their coffee when it is an iced mocha! Haven't tried other coffee here yet so I will be back again to try more."}
{"text":"We loved Verado so much last week we went back and tried Tempo last night.  We arrived about sunset chose to sit outside with the view of the lighted palm trees and the park.  The view is great.  Not having been her before I asked about the menu.  Our waitress seemed a little distracted while she answered.  We settled on pasta and the hamburger.  The hamburger was wonderful, I do recommend it.  However the pasta was noodles a couple of tomatoes and olive oil (and lots of it at that).  My salad had more ingredients in it than the pasta.  We added my salad of mixed greens, onions and tomatoes, the butter for the bread and salt/pepper.  Which improved the taste a lot.  I do make something very similar to this at home.  I think if they were to cut back on the olive oil along with seasoning it this would be a good dish  Should you go keep in mind what is listed on the menu is what is in the dish."}
{"text":"Terrible Terrible Terrible.  Service, Food, Untrained staff. All just terrible.  Way over priced for ever menu item.  I had $14 ala cart Kobe Burger.  It made me ill.  Do not waste your time or money.  My wife got sick from her meal as well."}
{"text":"My husband reserved a table here on Open Table. When we arrived we were greeted by a friendly gentleman who seated us promptly.  The restaurant is being renovated so the only entrance is thru one of their 3 huge roll up doors,  which had to remain open so the customers can come and go. It also allows the flies to come in and land all over EVERYTHING! We were constantly batting the flies off our food,  drinks and ourselves, it was disgusting! Gag,  so gross! I couldn't not eat my not warm or hot meatloaf because I was so grossed out!  I complained to our waitress who just agreed with me about how gross it is. I must have looked pissed because the guy who seated us came and asked if everything was Ok? I complained to him and told him how disgusting it is to have to battle flies while eating,  he agreed and apologized, telling me that because of the remodel they have to leave the roll up door open. He did not offer to comp our meal. We paid the  $60 something dollar tab and as we were leaving he told us to come back on a Tues, Wed, or Friday night when he was working and he would take good care of us. Seriously?? You had an opportunity to make it right and didn't! The thought of returning there to eat turns my stomach!  I can't even imagine how many flies were in the kitchen! Barf!!"}
{"text":"Best place to eat in Verrado.  Great selection of drinks, great food and friendly staff.  Like I said best place by far in Verrado."}
{"text":"We were not pleased. Service was great but the food disappointed. Flank Steak was very tough. Short Ribs were not tender. Calamari was chewy. Meatloaf was just alright. For as strongly as Tempo was recommended to us, we cannot do the same."}
{"text":"Bummer.  $6 for a cappuccino.  Had hoped if this place was going to charge such prices that they could deliver something that would make you want to return.  Paying Italian prices for a cafe drink, it would at least taste as good as the cafés of Italy... boy was I disappointed.  The baristas didn't know what they were doing.    If a place is going to charge high prices for a product- they should know what they are doing. Definitely, won't be coming back."}
{"text":"Great Food, Great Service and Great Atmosphere. We had the pork belly grilled cheese with tomato soup, the crab cakes, and the caesar salad.  All very yummy.  They have full bar, great wine list and draft beer and even their own house brewed beer.  Excited Verrado finally has another place to go for dinner. Great variety of food."}
{"text":"My wife and I really enjoyed a lunch date here. The food was great, with innovative twists on classics, like the Cubano hamburger, it was fantastic!"}
{"text":"Fantastic meal!! The only downside was there was a lot of flies in the dining room because hello, it's AZ and it's hot. But that absolutely did not diminish the fact the food was sensational and the service was top notch!! Cannot wait to come here again for a date night with my husband!"}
{"text":"Fine dining in the far west valley..... Great food and owners.  Again you might have a server running like crazy but they know the menu and great personalities. The price per place isn't cheap which is around $15.00 per adult plate but I wouldn't hesitate to visit this place as the cost is worth expense."}
{"text":"Went for dinner Saturday - probably not a good idea as there's live music and it's so loud you can't hear anyone, let alone talk.  Food was good and interesting. But there were several disappointments:  1 - they brought our food out after we'd barely started salads. We felt very rushed.  2 - the wine and liquor pours were unbelievably stingy - perhaps 3 oz of wine?  But we wound up paying $90 for two bowls of pasta, a shared salad, and four wines. Not worth it."}
{"text":"Great but smells like alcohol and has a long ass name But otherwise it's very enjoyable"}
{"text":"We have been going to Tempo for over a year and I am finally sitting down and writing a review!  Breakfast - By far the best breakfast sandwich I have had and an incredible deal @ $4.  It is a fluffy egg and cheese omelette with your choice of bacon, ham, or sausage on a sourdough muffin. I always order it with  house-made sausage!  Brianna works in the morning and always remembers  how my Fiance takes his tea with 2% steamed milk.  Its the little attention to details like this that make Tempo fantastic.  Lunch - The menu looks delicious but I have not tried it.  Happy Hour/Dinner - They have a great Happy Hour with discounts on some of their appetizers and drink specials.  The Flatbread with pesto, pancetta and a fried egg is one of my favorites - crispy crust and not too thick how flatbread should be.  A few of my favorite dinner entrees would be the beef short rib and the scallops.  Both dishes are always cooked perfectly and not over seasoned.    Tempo has become my go-to restaurant when I have out-of-town guests in town and want to show them a delicious meal in the West Valley.  The owners, Steve & Karen, truly care about this business and it shows.  It is a fantastic addition not only to Verrado but all of the West Valley."}
{"text":"?Two weeks ago today Tempo Urban Bistro catered a wedding reception for our family. Steve's cooking was exceptional and Karen's presentation was over the top. I highly recommend Tempo Urban Bistro as a restaurant and also for their outstanding catering services."}
{"text":"Food was very good, excellent service, kudos to the chefs.. The Friday night fish special was so fresh and the oysters with the 2 sauces delicious. And I had the ceviche yum yum yum. Great food!!!!"}
{"text":"cutest coffee shop ever, the place is so unique and welcoming. plus the breakfast sandwiches are the absolute best! super cool family owned business doubtlessly."}
{"text":"Great atmosphere.  The chicken and waffles are to die for.  Was disappointed with the lobster beignets.  They didn't really have any lobster in them.  My husband tried the meatloaf and that was outstanding."}
{"text":"First let me say, it's awesome that a coffee place opened up where the service is at least decent.  Nice folks behind the counter.   However, I got a frozen coffee and quite frankly, it wasn't any different than if I had made it myself ... with the brewed coffee I keep in my fridge for the week.  In fact, I make it even better because I make sure there are no ice chunks in my frozen beverage.  Nothing special about their iced tea either.  As my husband said, \"it was nothing like drinking polar bear\" which is what he describes as really awesome iced tea.  (I know strange but that's his thing)  I will give this place a couple more tries: 1) B'C they said they make homemade muffins and well, I love muffins and 2) when they open up the restaurant portion b'c I'm really hoping to have an awesome place nearby to get a meal.  If you want me to keep coming back, go talk to the folks at Sugar N Spice down on Indian School RD.  We literally crave that place.  They have an awesome staff and an awesome bakery with awesome beverages.  I'd love to be able to have a hang out place like that closer to home!  With all that said, I realize they are just starting out and to support local businesses I'd like to give this place another try but I don't want to just \"settle\" coming here because it's close by.  I want to love going there!"}
{"text":"Yesterday was our second visit.  I rushed home and picked up my beautiful wife to try Happy Hour at Tempo.  We had been here once before and it was above average.  This time we walked in and the place was EMPTY....  It was about 5:30 and we sat at the bar.    The bartender(female blond) had ZERO personality.  Seriously, I would have rather watched paint dry then strike up a conversation with her.  Anyhow, I ordered a draft beer and it was somewhat flat and unimpressive.  My wife ordered a margarita and she seemed to like it.    We decided to order some food.  My wife ordered Street Tacos and a side salad.  I ordered Flatbread with sausage and cheese in addition to a side salad.  My wife liked the tacos and my flatbread was so so.  The salads had to much olive oil on them and tasted slimy, oh and they both had tons of fresh sliced onion.    The place remained very quiet for happy hour maybe its because it is overpriced for what you get.    Our little stop for happy hour ran us a cool $43.00 with the tip.  Okay, I get it.  Its a trendy place with a non conventional menu but its not worth it.  In addition, I found the menu very limited unless I was interested in new age metro sheik(I just made that up), save the rainforests, reduce carbon footprint, type stuff.    I suggest that if this place is going to survive, menu and price change.  Trust me, even the regulars that \"love\" this place will quickly get tired of it."}
{"text":"We ate at Tempo this evening, what a great menu change!!  Grilled Octopus was amazing as an appetizer.  I ordered the Pork Chop which was cooked perfectly as tasted great with the bacon apple butter. . My partner ordered the Pumpkin Ristò and it was very good.  We were very impressed with the new menu and will definitely be back.  Thank you for the nice evening"}
{"text":"Great beer and entree selections. They serve bread and butter thankfully because I'm almost always starving by the time I get there. A variety of food and all sizes of plates in case you just need a snack."}
{"text":"My wife and I walked in tonight at 4:30pm on a recommendation, we stood at the hostess desk for 3-4 minutes in an empty restaurant with 1 bartender and 3 customers at the bar. The bartender finally noticed us \"oh hey, come on in and have a seat\" while never leaving the bar and went back to being focused on the patrons at the bar. We felt flat out disrespected. We walked out and left. We were there for restaurant week and we were going to order the prefix menu with drinks. We would have easily spent $100 plus not including tip. When service is above average we will tip between 30 and 50 percent. Yours and your staffs loss. We will never waste our time driving out from Goodyear to your establishment again. You are not that far, but the service at Saddle Mountain Brewery is always well above average and the wait staff know us when we arrive and only a couple of blocks away. No stars would be my choice for being ignored for the short time we were there."}
{"text":"I am on the fence about this place.  The first time we went, it knocked my socks off.  The osso bucco was to die for.  We went a second time, got a lovely table by the open doors and had a great time, food was excellent.  We talked to the chef and his wife and they were super nice and personable.  Then, however, the menu changed and it all went downhill from there.  We went for Mother's day brunch and the salmon I ordered was burnt.  The buffet was so-so, not fresh at all.  My husband ordered the sea bass and it was swimming in oil, gross.  We complained to the kitchen and the owner came out and blamed it all on a new gal he had hired for the kitchen.  Okay, fine, another try.  We went for father's day dinner.  I ordered the steak, medium well. It came out with no pink middle.  My husband ordered the scallop rissotto, which was bland and blah.  My daughter ordered the chicken fingers, which came out burned to  a crisp (I couldn't even believe they sent it out to the table).  We had them remake the chicken and I told them I wasn't happy with my steak.  So the owner's wife came out and told me (pointing to a tiny strip of not-really-pink in the middle) that this is how they cook the medium well.  Really, you want to argue with a customer on how their food should be prepared?! Poor management decisions at best.  I was so starving at this point I just told her, fine, I'll eat it, whatever.  It soured the whole experience for me. NOT a fine dining experience.  They sent out a second order of chicken strips for my daughter, just as burnt at the first one, with not even an aplogy or visit from the chef/owner.  Sorely disappointed.  They seemed to have a good fine dining experience going at first, but we won't be back unless they get heir act together.  And , for a family of five, blowing  $150 on dinner in a single dining visit, the experience should be top notch.  It isn't."}
{"text":"Love the atmosphere here. Live music at night on the weekends. Food is great and so is the service. You can dine inside or on the patio and it's very cozy."}
{"text":"Amazing food, friendly staff, I go often and always leave satisfied. Every dish they have is amazing I never really like meat loaf until my wife got the kne here and tried it and I love it, lobster Mac and cheese is delicious, steaks are delicious"}
{"text":"The first time I ate at Tempo was with a few friends that share car enthusiasm with me. We enjoyed the service, facility, food, and hospitality given to us by the staff members. I am grateful that this restaurant is so close to home. I am a fan."}
{"text":"Waited about a month from opening to try Tempo, in hopes that they'd have worked out any kinks in the service and/or menu.  Looking at earlier reviews, it's apparent there was some working-out to do.  Yelp! shows review trends, which is useful, and in Tempo's case you can see that the trend is headed in the right direction.   First impressions, based on the new atmosphere and menu are great.  Walking in, you get the feel of a trendy, Brooklyn new-American restaurant, which is appealing to me.  The menu has significant range, which should be helpful for supporting a wide variety of tastes; an ambitious menu also means the restaurant will have to be well-supported, or the menu will eventually need to be dumbed-down.  For the sake of variety, let's hope Tempo gets that support.    Our particular server, whose name I can't recall, unfortunately, was very, very good.  Food was somewhat slow out of the kitchen, which made a quality server that much more important.  It's tough to rate an entire waitstaff on one server, but the gentlemen who served us was excellent.    I ordered the Chicken & Waffles, which probably isn't the first thing you should try at a new restaurant, but I had a craving.  The waffles were good, the chicken was very, very good.  Everybody at the table was happy with their food, as well.   Pricing and portions are that of a nice, but not exceedingly nice, restaurant.  The menu isn't cheap, but it's not overpriced.  The portions aren't huge; I like overeating as much as the next guy, but in this type of setting I'd rather have quality than quantity, so Tempo does fine in this context.    This is a strong start for a restaurant that replaces another that had struggled mightily.  Learning from the failures of their predecessors will help:  menu consistency, focus on the quality of the waitstaff and service in general, and participation of the ownership are things that matter significantly for any restaurant, especially a new one.  Those boxes are all checked for Tempo right now, and hopefully they'll remain that way."}
{"text":"Sorry to report we will not return. We were overwhelmed with flies and the service was below average. It has a nice appearance with the outside seating but I don't want to be swatting flies throughout my entire meal."}
{"text":"Casual restaurant with upscale menu. Tempo is located on Main street in the beautiful Verrado. The food and the service seem pretty good."}
{"text":"Cute little place in the heart of Verrado. The place is quiet inside and somehow hip and fun in the patio with nice music playing in the background. The hostess was a sweet lady that welcomed us in with a big smile on her face. Later our waitress (I am so sorry I forgot her name) was just wonderful! Great service at this gem in Buckeye. Reason for the 4 stars is their menu. As a vegetarian it's tough to go anywhere new because there aren't many options to choose from. I feel that can be improved here. Think less salads- we are vegetarian and not grass fed cows! Lol the waitress was totally sweet and was able to take a dish they offered and minus the animal flesh. It was ok, not the greatest. One quick tip-- try the burros, it's their version of a Mexican mule. Overall will most definitely go back."}
{"text":"Love Love Love this place! Great food and fantastic staff! They make us feel like family when we're there! Everything on their menu is excellent...my favorite happy hour dish is their short rib nachos. OMG. YUMMMM!"}
{"text":"I had the pumpkin sauce pasta with salmon. It was delish! I had never thought of this ingredients before and that's what you pay the big bucks for! I hate when I order something I could've made better myself. It was the perfect blend of pumpkin seeds,  salt,  thick perfectly cooked noodles and the right seasoning on the salmon. If I could have this meal once a week I would!"}
{"text":"Tempo has it's ups and downs, however it is the most interesting restaurant in the area.  The menu changes often, the service overall is pretty good, and the food is above average.  The price is above average, but is in line with other restaurants of this kind in the Phoenix area.   It is our current favorite place for a date night."}
{"text":"We love this place, right in the heart of Verrado. Steve and Karen do a terrific job with a menu that changes on occasion, which adds to the variety. We love to sit outside (when the weather is nice).   It's a great neighborhood place that caters to Verrado with an upscale menu in a casual setting. See you there!"}
{"text":"Tempo is hit or miss. Ordered the meatloaf and it came out ice cold in the center. Service is usually ok"}
{"text":"If you're looking for a night out in Verrado, skip this place.   At first glance, I thought the energy would be really cool. However, the vibe is very confusing... not sure if it's supposed to be industrial, farmhouse, or hipster.  The food was mediocre at best. It was far overpriced and incredibly underwhelming.  The avg age of the crowd was 50. It was an old crowd full of middle class people living in Verrado trying to be pretentious.  Maybe my experience would've been better if the table I reserved wasn't directly under the speaker of the live musician, but I'll never be back to find out..."}
{"text":"In search for a date night restaurant that also had the football game on Saturday night, we hit a gold mine! The ambiance is new and urban. There is a coffee bar at the entrance and a full bar in the dining area (with two tvs). Lighting is great and they have live music every Saturday night.  Our server was very knowledgeable of all of the menu items including drinks.  We ordered the meatloaf and the ribs. So delicious!!! The ribs were tender and full of flavor. The dishes were served with mashed potatoes and fresh vegetables.  We have definitely found our date night spot! We can't wait to try the rest of the menu :)"}
{"text":"Super disappointed in my second visit to T.U.B. Started with the calamari w/dipping sauce- it had zero taste, the dipping sauce was so bland we weren't even sure what it was. Ordered the Kobe Burger, again so bland and zero taste. Second order of beers tasted watered down or not the beer we originally ordered. They did replace those and they tasted fine. Korean ribs were luke warm and seemed to be crock pot cooked and then grilled.  They did have music and it was great."}
{"text":"My husband and I went here for date night. It had amazing atmosphere and the food was delicious!!! We live in the area and will definitely be back soon!!!"}
{"text":"LOVE Tempo! Only place in Verrado that offers the whole package...great food, creative and delicious drinks, live music AND a pretty decent Happy Hour!!!!!  Awesome and friendly staff, nice ambiance and clean restrooms!...Verrado's competition pales in comparison!"}
{"text":"This was my first dining experience in Verrado on a recent visit back to AZ. There are some very cool shops and places to eat in this area.   As I still am a total virgin to most everything in this state, I read a lot of restaurant reviews on Yelp. Tempo Urban Bistro caught my eye when I checked out their food and bar menu and pics online.    You enter through the coffee bar which is attached to the restaurant.  The ambiance of the restaurant is unique and inviting.  There is a nice bar at the back and an open dining area and large garage-type doors at the other end that open up to their patio seating.  Very cool.  There were many cocktail, beer and wine offerings as there is a full bar here.  We decided on a couple glasses of wine and a mojito which were all very good.  The dinner food menu offered a nice variety of many starters, small plates, salad and sides as well as full entrees.  As I am a fan of all things french fry, even more so when they are topped with gravy and cheese, I ordered a starter of Poutine.  This had a light dose of gravy and cheese curds on the ample amount of fries and was very tasty.  Our entrees consisted of the Pan-Seared Salmon, Sirloin Steak and Seared Scallops.  I ordered the scallops.  These were on a bed of white bean cassoulet and topped with bacon and bacon butter, yes, you heard that right, double bacon flavoring.  It sounds like it would be a bit of overkill, but it was really good.  My only wish for this dish were that the scallops were seared a bit more.  I had bites of the other entrees at the table, the salmon and the sirloin, which were both very good.   Service was friendly and attentive.  The restaurant has a separate lunch menu and happy hour deals M-F 4-7 p.m.  Online on their website at www.tempourbanbistro.com it says a brunch menu is coming soon, also.  Tempo Urban Bistro is a place with great atmosphere to meet for drinks, tapas or lunch or dinner in Verrado."}
{"text":"Great food, great atmosphere, AMAZING SERVICE! We can say enough good things about this place. Definitely one of our regulars in our weekly lineup of great places to eat! Highly recommend!"}
{"text":"So authentic. So good. Steve Maynard is the chef and a super good one! I love, love this place! Nothing I don't like. bruschetta is great. Kobe burger is great. Truffle fries are great. Crab cakes. You name it!!"}
{"text":"I don't review often, but after I craved one of their dishes (grilled cheese) all day, I owed a review to Tempo. It's fantastic to have a little more upscale option in Verrado. Set up and decor that is the right amount of upscale, but still comfortable and casual. Neat decor and love open doors bringing in fresh air. The menu isn't trying too hard, but offering unique options. We went on opening day and several times since, and the service has always been friendly and continues to improve. The owners are incredibly friendly and hard working. We will sure to be doing our part to make this a mainstay in Verrado."}
{"text":"We were really excited to try the joint out as we're big time Verrado fans, We love Grazie, the blue Daisy, and I'm in the barber shop every two and a half weeks like clockwork.   The issue we had here was first and foremost the service, and secondly the quality of some of the dishes we had that night.   We asked my litter sister to grab a table for us, when we showed up about five minutes after her, she had not yet been sat and the hostess let her know it would be about 10 minutes. There was about 80% open tables at the time I was immediately not pleased. She's 18 treat her the same as you would treat me. After that we ordered and the appetizers, it took about 45 minutes for us to receive ANYTHING at our table, which i thought was WAY too long, i mean not even bread? C'mon man. Our waiter came by after he finally brought us some bread and then informed us that the appetizers would be coming out the same time as the food, which should be out soon. There was empty tables everywhere and you would have thought the place was booked solid. Just not pleased with our service at all.  My better half ordered the lobster mac and added bacon (because what isn't better with a little bacon?), and my little sister ordered the Veggie risotto, While I went with a testosterone filled Steak and Mashed potato.  There are some really good things going on here. I had a steak that was a perfect medium rare, topped with wild mushrooms and what may have been some sort of balsamic glaze that was ridicu-licious we're talking ridiculously delicious.   The lobster mac was one dimensional at best. It was a lot of butter flavor with small chunks of what you could barely tell was once (most likely delicious) lobster. Almost none of that cheesy gooey home-style feel that you get from a good Mac and Cheese.  Now on to the veggie Risotto, which by my standards was... I guess ok? I felt like i could taste that the mushrooms had extra sponge-like texture, As if they may had been frozen or previously dehydrated. Other than that the rest of the veggie mix was NOT cooked to baby food like consistency (which we appreciated) and the proper technique was evident in the final product.  Overall for the price we payed I expected better quality and a better experience, I'll have to possibly come by and try it out another time to see if this was an isolated incident."}
{"text":"I had high hopes, anything had to better than the previous establishment. Guess I was wrong. From sub par service to high prices I am not impressed. Have been twice. First time I was there my 12oz chai tea was only about half full and cost me $5. Gave it another try. Coffee was again expensive but was so weak it was like drinking vanilla water. For that much I could make it myself and make it far better. I doubt I'll try their food, if they can't get a vanilla latte right, what are the odds they will actually be able to cook scallops correctly."}
{"text":"We love Tempo and sad we moved out of Verrado as we will no longer be near this great place! Amazing food selections and the chef is great!  We have had everything from the chicken sandwich, flatbread, rib eye nachos (love), salad, pasta, burger!  All great and we will miss the food !"}
{"text":"Such a cool place with amazingly talented and nice owners/staff. I'm glad I live near here and get to enjoy regularly now, but I would travel to do the same. Everything I've tried has been great. The menu seems to change enough during the year that there is always something new to satisfy. But whether it be a creative dish or a comforting classic, this is a place to dine, have a drink, and enjoy."}
{"text":"We went to the Tempo Urban Bistro for their Friday Fish Fry. It was the best we have had in AZ. Atmosphere is lively and a bit loud but we enjoyed it. We also had their crab cakes which were delicious. We will definitely be back. Wish we had something similar in Estrella Mountain."}
{"text":"I was there the second night they opened and it was busy.  We knew there were going to be some hiccups but the food was great. I had the chicken wings and it was a great appetizer. For dinner, I had the street tacos and the meat was so tender and flavorful. The tortillas tasted homemade and were delicious.  My wife had a salad (can't speak for her but she loved it).  The meal did take some time to come out but we didn't mind as we were not in any hurry.  We will go there again soon and try some of the other dishes."}
{"text":"I love eating at this place cannot go wrong with any meal. I think the spare ribs have crack in them because I must have it all the time. The Korean ribs are amazing also! Actually I can't think of a meal I couldn't recommend. Prices are well worth it and the potions and succulent flavors justify it."}
{"text":"I have been here a couple times for coffee and dessert, the desserts are great but the coffee drinks are terrible. Lattes that were cold by the time we got our drinks, and not very good flavor. I don't recommend this place for coffee at all."}
{"text":"This Verrado location has been through several restaurant concepts in the past 10 years we have lived here.  I must say we don't frequent here enough. The drinks, food, and service are top notch.  Local residents own it I believe."}
{"text":"Thank you Tempo for offering a meatless and dairy-free option on your lunch menu! I had the quinoa thai wrap which was wonderful and my boyfriend had the fish tacos, which he also enjoyed. Amount of french fries that came with the lunch was a bit enormous, but they were delicious so i can't complain. :o) I would give this place 5 stars if they also offered something I could eat at dinner-time, but last i checked there is still nothing on the dinner menu that is vegan, which is a major bummer.  I will say that service here was fantastic -- actual trained waitstaff as opposed to amateur high school kids that the previous establishment employed. We are happy you are here Tempo!"}
{"text":"Very nice for the West Valley. We drove out there from  central Phoenix to hear our musician friend play."}
{"text":"Beware they add dairy to things you wouldn't expect!Would really like to see some vegan options. I was extremely disappointed to find out the guacamole has sour cream added to it and topped with cheese. Most people are lactose intolerant so it might behoove the restaurant to remove the sour cream from the guacamole."}
{"text":"Almost hit the mark-- ALMOST.   The atmosphere is nice, but there is a picture of books that had been left unhung for months- one example.  The bar itself is lacking structurally.  The food is mediocre.  The presentations are weak, and food flavor is okay.  My spicy bloody mary was weak.  Very disappointing, but at the same time there is little competition in the area.  Sad."}
{"text":"Every time I eat here it never seems to disappoint me. The menu is well thought out with a complex fusion of flavors. The service is always on point with servers who remember your name to your favorite drink. It's a small town feel with an upscale uptown vibe. The owners Steve and Karen really put in there heart and souls into pleasing there guests and take there opinions and input seriously.  The food is fresh when I mean fresh it's not frozen it's made to order. For example I love there fish fry Friday I highly dislike coleslaw let alone tarter sauce, until I ordered it and tried it, it was like fireworks in my mouth, will only eat it Here. The coleslaw has a twist it's a little sweet but the perfect balance of salt with a crunch, the fish is not even remotely fishy with the best batter. I COULD Go On and on but take me seriously when I say you must try for your self.  The drinks are reasonable prices and they have a great happy hr Monday thru Friday.  I Enjoy fresh ingredients and Enjoy Being greeted By People who Remember MY Family and ask How We are doing AND honestly care. Give this place a chance and you will won't be sorry."}
{"text":"Love this place. We are huge fans of the dinner menu (especially the meatloaf) and love the holiday brunch"}
{"text":"We just visited the coffee/tea bar.  Got our order taken and the staff even bought out our drinks with all the goodies we might need:  milk, sugars, etc.  Very sweet of her!  The coffee and teas were good!"}
{"text":"Waitstaff friendly and knowledgable. Menu had a good variety, not too many things to choose from. Food was excellent, can't wait to go back and try something new."}
{"text":"Great place ! Good food , friendly ambience  ! Family friendly , yet adult needs meant as well.   Great mixed drinks , wine n Assorted Beers . Music , friendly considerate staff , definitely Worth the visit for lunch or dinner. Will be on my go to list ! If u need a changing table use bathroom in coffee shop , which is adjacent to dinning room. Tempo is an excellent place to go, always very willing to go that extra - to meet ur needs!"}
{"text":"The food was great and the service friendly.   I would definitely go back!   I had the Quinoa Salad with Sautéed Chicken.   The flat bread was lacking some, but the sautéed chicken and the freshness, flavors, and perfect quantities of each salad ingredient more than made up for the refrigerated taste of the bread.  I loved the salad!   My friend enjoyed the Turkey Ciabatta Club.      I would have given 5 stars if the non-busy server would have brought us refills or even cared to check on us once in a while.   Also, a restaurant should clean their front doors.  We almost didn't go inside.  That's the first thing a customer notices.     I would have rated 4.5 if it were possible.  I would return for the mostly yummy food."}
{"text":"So as new Verrado residents we obviously want to support the local eateries, that said, I am not sure we will do dinner there again anytime soon.  The coffee bar is fine, good ice cream as well, lunch during our prior 2 visits was alright at best, but dinner last Saturday was just a letdown.  The menu I think is way too pretentious and poorly executed, seasoning was very bland on all three of our dishes, the server had no personality, and what is with the weird guitar guy with a synthesizer box???  I think perhaps time to get back to the basics and work towards doing those very well.  Anyway, very small portions and not much value with the pricing as it is.  On a positive note, nicely appointed interior and very clean."}
{"text":"I used to go all the time with my children when they first opened it was great. Last two times i as treated like i was a bother and our waiter had no time for us. And waited 15 min just to get Water. So i haven't been back in over a year"}
{"text":"I love everything about this place! The HH is very enjoyable and I can't say enough about the staff and food! Two thumbs up!"}
{"text":"The food was very good and the staff was helpful. I had a Ruben sandwich with home made chips and it very tasteful and filling. Would recommend it"}
{"text":"Went for happy hour today with a group of people. 1st time here. Service was excellent. Has a cool vibe. Loved the decor-modern yet chic. We had almost everything on the tapas menu and everything was delish. Great for hanging with friends or having a family night out! The only thing that might make someone umcomfortable is that the restroom is unisex-which means there is a urinal and a toilet. It was very clean, so to me it's all good lol."}
{"text":"Fantastic food & even better customer service.  Our party tried the Kobe burger The flat bread The buttermilk fried chicken  The poutine And even the kids meals. Everything was delicious!!!! We are not from the area but will return our next time we're in Buckeye and highly recommend everyone local give this gem a try."}
{"text":"Still love this place. A nice place for happy hour and lunch. The fish tacos are different now and I didn't like them as much as before, but there's a pesto turkey sandwich that we really enjoyed. Will still go back and try a few new sandwiches and salads and the fried chicken."}
{"text":"Chicken Marsala was the perfect plate to end our Friday night! The warm interior atmosphere was comforting and was complimented by the genuine hospitality."}
{"text":"I love this restaurant. While I don't get to Verrado very often, when I do I hit this place up every time. Great atmosphere, wonderful food, and the most amazing staff. The owners put their heart and soul into this place and it shows."}
{"text":"Ok, this is a hard review to write.  I hope the owners take notice.  I am only speaking for the coffee bar.  The atmosphere is great.  However, I have been here twice and I'm not impressed.  First time ordered the Iced Mocha.... it was blah.  My first thought was why did I order that I can make better at home.  Second time ordered the hot chocolate... Once again, horrible.  Did not taste like chocolate.  It was bland and disappointing.  I really want to like this place.  I love the location and the environment... Just hate the drinks.  I will just have to drive down to the Verrado Coffee shop down the road.  Please add flavoring to your drinks."}
{"text":"Food prices are too high for what you get. If you want to spend over $20 for a piece of fish or steak go to Capital Grille or flemings much better quality. Happy hour wine prices are ok and they have half price happy hour food but really it's not even worth half price. It's a cute place for a drink and snack"}
{"text":"Wonderful restaurant. Always great service from Edgar. I had the best fresh sea bass the other day. I highly recommend eating here. Their menu is simple, yet has something for everyone. We are so happy to have them in Verrado. You won't be disappointed."}
{"text":"Great food but the server had the most awful breath I've ever smelled. Nobody wants to gag when their server is taking their order."}
{"text":"Food is awesome and the drinks are well poured.  Awesome live music on weekends and the desserts are great, according to the wife.  Gets pretty busy and service seems to stall out from time to time but they do their best and we've left happy every time."}
{"text":"One of my favorite places to dine. I have tried the entire menu and I am never dissatisfied. my favorite is the Kobe burger but literally everything is amazing. the decor, staff and chef make me so happy that this is walking distance from my home."}
{"text":"Sadly, this is not a very impressive coffee place. If you order regular coffee with plenty of room for cream you get a lukewarm cup of coffee filled to the top. They do not have coconut milk for people with allergies and it's petty well established that soy milk is not as good for you as once thought. The staff is lukewarm as is the coffee. Verrado is a pretty pretentious place and I would've expected better."}
{"text":"When we first moved to Verrado two years ago we were instantly hooked on Tempo.  Unfortunately both the food and service continued to decline.  Service more than food, to the extent that in March of this year we had had enough...prior to this we were regulars, more than weekly visitors.  We returned tonight for the first time in a long time hoping that the recent remodel notification had changed things...unfortunately things have not changed.  My food was fine, but the service was horrible.  Perhaps the cook should oversee the dining room.  Probably won't return as my wife can't stand the service flaws."}
{"text":"Locally owned & operated. One of the owners is the chef while his wife runs the front of the restaurant. The food is always delicious!  The menu changes frequently. They use a lot of locally grown produce to give that farm to table feel. We know we will always have a great meal here. Kyle, the bartender is great too."}
{"text":"I'll keep this brief. The food really tasted great (kudos to the chef), but the service was very, very slow. Also, a bit pricey considering comparable restaurants."}
{"text":"Great restaurant -Awesome food & a coffee smoothie stop !!! I can ask for anymore right near my house !!!"}
{"text":"One of my all time favorite restaurants!!  The location in Verrado is quaint and peaceful, staff are warm, friendly and helpful and the food is delicious.  A nice, interesting menu with some unique choices.  I go here every chance I get!!"}
{"text":"Ok... Read all the reviews & still decided to eat here. Glad I did. Don't drink the water, it's tap. Service was friendly & on spot! I love eating at nice places, usually downtown... This place had a great atmosphere the food is above par. I ordered  the scallops & my husband ordered the ribs. He was not a fan of the sauce... It's not traditional BBQ sauce & he is more a meat guy. The scallops had great flavor but order a side salad, there are no greens serviced with dish. We will be back."}
{"text":"I ordered the sea scallops in a sweet potato and bacon hash.. It was excellent! 5 large scallops seared beautifully."}
{"text":"This place is so hit or miss for me. We started going to Tempo about a year and a half ago after moving into the neighborhood. I've had some amazing scallops there with risotto, and during Restaurant Week had an awesome beef wellington that was cooked perfectly. They also once had a pumpkin pasta that sounded odd, but was delicious.   Tonight we went and I ordered the lobster mac and cheese. The noodles were way too over cooked and the dish tasted generally bland. The waitress took the dish back to the kitchen and shortly after I received the same dish. The pasta was still over cooked. I then ordered the scallops just to get something faster and different (thinking maybe it's not this chef's night to cook pasta). The scallops no longer come with risotto, but instead come with a sweet potato mash, chorizo, and brussel sprouts. The first scallop I cut into was cold in the middle and not fully cooked. Three of the scallops were fully cooked, and they were good. I honestly don't think the sweet potato mash and chorizo go well with scallops, but maybe that's just me. I miss the scallops with risotto. So, that's three of my dishes that were not successful.   The owner did come over and speak with me. I wasn't charged for any of the meals, and she tried to make the situation right. I do appreciate that she took time out of her very busy night to speak with me. She offered me another meal, but I declined as we had already been there awhile and wanted to get home. We did go home with a free dessert, which was kind.   So, it's sometimes very good at Tempo, and sometimes bad. I also don't care for their lunch food. I'm not sure if they have a new chef, or new kitchen staff, but it would be nice to have some consistency.   It's a good location and it's nice to see familiar faces there.  The service can sometimes be slow, but it's never been crazy. I hate to be so critical of a place we often frequent, but perhaps this can be taken as constructive criticism."}
{"text":"Drove 40 min to come here and try the restaurant week menu as they had beef Wellington as an option. We (my hubby and I) were sat quickly... The restaurant had about 3 other groups of patrons. It did take a little bit for our server to come and for our food to arrive, but all in all, not as bad as some have reported. The only real issue I had was that the food was not hot .. it wasn't cold, but it wasn't \"out of the oven\" hot. Also a couple of items could have used a little bit more flavor. However, all in all an enjoyable experience. Will we come back? Probably not... A bit of a drive..  and not having the \"wow\" factor, not worth the drive..."}
{"text":"Food was good. I was the only person in the restaurant at lunchtime. It was an early lunchtime, but the waiter was slow. He was pleasant, but not very attentive. Food was good. My tacos were on such tiny tortillas and were so soft they fell apart as I was trying to eat them. The order of fries is massive! Enough for three people!"}
{"text":"Really wanted to like this place. It was busy and service was good. However, I ate an ammonia tasting scallop and everything tasted like it hadn't been seasoned at all. Will stick to the place next door."}
{"text":"Stopped in for lunch thanks to a good Yelp review. Had the steak Cobb salad which was delicious. The steak was cooked medium rare and just the right size for lunch. We sat on the patio outside which provides the perfect ambience with the Verrado shops all around. Service was friendly and attentive. Will definitely come back the next time we are in the area."}
{"text":"I love this place. Service is second to none and I love the seasonal menus. Very fresh ingredients and the owners (Karen and Steve) are always there to greet you and make you feel special."}
{"text":"Service is extremely slow at the coffee bar. The barista was inattentive, it was more important to flirt with other patrons than to fill orders."}
{"text":"This restaurant is easily one of the worst places in the area to eat. Coffee is bland, dishes are overpriced and the service sucks. Avoid this place like the plague"}
{"text":"What a beautiful place to have lunch! Friendly and quick service and great food! I had a wonderful salad and my friend had the soup of the day which looked nice and creamy (roasted chipotle, I think) with half a sandwich. Our bill was $24."}
{"text":"Nice to find a cool spot in the area that isn't a franchise norm food choices. We went for lunch  enjoy it can't wait to try the dinner menu"}
{"text":"Great little bar and restaurant in Verrado and one of the many features that makes Verrado a great community! The service is great, the atmosphere is relaxing and the food is awesome. I love my new local bar and restaurant!"}
{"text":"Omg where do I start! The food was exquisite and the service and the waiter were wonderful! This place is so cute and very clean ! They give you delicious bread and butter while you wait. I got the meat loaf with whipped potatoes and my hubby got the lobster mac n cheese both dishes were amazing and served so beautifully! I definitely will recommend this place to my family and friends."}
{"text":"We were headed out of town and stopped by this part of town to check out the neighborhood and grab breakfast. A local recommended we have breakfast here, and he certainly let us in on a local secret.   We had the steak breakfast burrito and it was delicious. Huge, lots of steak, and tasty as can be. The iced coffee was also delicious and you have to appreciate free refills on iced coffee as well! If I lived in the neighborhood, I'd be there several times a week. Great, great place!"}
{"text":"This is a review for the coffee bar only. The worst latte I have ever had in my life, several times I have gone here and im always sad for expecting it to get better."}
