{"text":"Went twice last weekend, and I'll be back next weekend!  Great grub, great drinks, great service, great atmosphere!  What can I say, GVG, you've done it again! With Tennessee Tavern, in addition to Raval, Isabel, and Harry's, why don't you just take all my money?! My new favorite place!"}
{"text":"To start off with, I was initially looking for a spot to have a beer and some chicken wings, however, this place isn't offering chicken wings, they offer cevapi. 

Growing up with numerous Eastern European friends, the word cevapi is synonymous with a great time. That being said, I was pleasantly delighted to know they are a pub that offers up some truly local beers and some very delicious Eastern European foods. I was in heaven. 

Moreover, ownership and employees really serve well. They are attentive, courteous and easy going.   

Overall experience has made this spot a go to for good food and a nice time out. 

Great choice."}
{"text":"I love this place.  Seriously.  Great food, great service, great vibes/interior/music.  Did I mention the patio?  Phenomenal wine and beer selection...not your everyday.   I've been looking for the perfect hangout, and I've found it.  So happy this place is in my 'hood."}
{"text":"It smells awful in there. It smells like dirty old furniture. It smells like the place needs to be painted. It smells like the toilets downstairs haven't been cleaned in ages. 

I couldn't imagine eating in there. We had a beer and left. It was so dusty that it was hard to breathe."}
{"text":"You seat yourself type of place - we found a table on the patio and the service was excellent.  Food was great, but I wish the schnitzel wasn't soggy - the texture wasn't enjoyable but the sauce/topping was delicious.  I have yet to find a really good restaurant that serves schnitzel like they do in Europe."}
{"text":"This place has easily become more fave local hangout. Great selection of beer and the food is amazing. Especially during this last cold winter. Comfort Food!"}
{"text":"Amazing Eastern-European inspired restaurant and bar. So glad this opened in our hood! 

Great drink and beer list, including a selection of funky sours, which we love and don't see a lot. Service was friendly and fast. They also have a great patio. 

I'm vegetarian and was thrilled that they have a veggie option for the pierogies (which were SO good...definitely something I'll be craving) - pillowy and filled with cheese and potatoes. The menu is definitely meat-heavy (I mean, it is Eastern European) but there were a few other veggie options to try next time including a big pretzel with mustard, garlic mushrooms, and salad. 

My husband had the dinner for one plate, which included soup, sausage, pierogies, cabbage roll, and some other sides. He loved it and was totally stuffed. 

UPDATE: I can't get enough of the pierogies so we've been back a few times. They just added dessert to the menu and it's perfect - apricot cake with salty walnut brittle and sour cream"}
{"text":"Excellent service and amazing food. Highly recommend this place whether you live in the area or not. Definitely worth the trek west!"}
{"text":"We had a great time here - cool quirky vibe, delicious Eastern European food (classic and more reinvented) and a great booze list. 

Portions are big and my stomach hurts. Lot of fun, would return!"}
{"text":"Great vibe, cool staff, and interesting decor! The food was good and service was kind of slow but the atmosphere definitely made up for it and that is why I'm giving this place a 4 star. This is definitely a place where you can come with friends and hang over drinks. Wide selection of drinks, music was appropriate for everyone of all ages, and the place was packed with a ton of locals. Sunday is AYCE pierogies as well!"}
{"text":"Ate at Tennessee for the first time last night. The food was amazing! When we walked in it was a lot bigger inside then I was expecting, and the music was a bit to loud for a dinner crowd so made chatting difficult but the menu intrigued us so we decided to stay. There were two servers and they both were fantastic. The guy took our order but told us it would be too much food and meat, he made some recommendations to adjust it and we took his advice. So glad we did! The woman who served us drinks recommended a beer not on the menu based on what I said I prefer and it was so good my bf ended up ordering one too after he finished what he had ordered. We will definitely be back again!"}
{"text":"I LOVE THIS PLACE. I came a couple months ago and really liked it, and decided to bring a bunch of people there on my birthday which was on a Tuesday night. It was busier than expected but they let us switch tables to the front \"party table\" when it was available which was nice of them! There were about 20 people, and the service was amazing during the entire meal and everyone was so friendly. Also - THE FOOD. Just like, yes to everything. Had perogies, blood sausage, Tennessee platter, cucumber salad (sharing lol). Everything is cooked very well and had great flavour and texture. Drinks/wine/beers all excellent. Damn you GVG you've done it again. Thanks for helping make the night great, Tennessee!"}
{"text":"Having lived and traveled in the former Eastern Bloc countries and sampled their many cuisines, I was eager to see how The Van Gameren empire would translate this regional grub. Verdict: terrific!

The tables are wooden and immense and the place is spacious. Great for big and small groups. This is a place that encourages food sampling and lots of drinking. It has the feel of a Czech beer pub, an Estonian keller bar, a Hungarian or Polish family restaurant, and a cool Toronto eatery.

Lots of food variety, mostly for sharing - perogy, schnitzel, ?evapi, borscht, steak, goulash, wurst - and lots of nibbles - sausage, cheese, smoked fish, fried mushrooms, cucumber salad. One combo meal plate.

The perogys are the best I've tasted in forever. I love that there's no bother of choosing fillings and especially no fuss with wacky toppings. Tennessee gets the dough thickness and texture perfect and the filling (cheddar cheese potato) is excellently fluffy. Tossed in butter, some bacon crumbles and fried onion bits, a spoonful of smetana and you're good to go.

The pepperette cup was a nice surprise - so many types hiding in this glass of yum! The button mushrooms were hot, garlicky, buttery, and I loved the generous portion here because the joy of eating these is popping just one more. (Will be interesting to see if the mushrooms change with the seasons - as it might if this were a Russian resto.)

The only thing lacking an East European influence here are the drink sizes (beer pours are 12 oz, shots are 30 mL). I was a bit surprised to notice no Eastern European beers here except for Pilsner Urquell, though the beer list is enormous with lots of local craft pours and larger sharing bottles from near and far.

The shot glasses are darling and a pleasure to sip from. We had the classic, the Slivovitz (always on special at $4), and there are lots of vodkas and other boozes to choose from. 

Looking forward to trying more of the menu here, especially the cabbage rolls!"}
{"text":"Half priced pirogies before 6pm is what attracted me to this place! It tasted as it should! 

The ambiance is pretty great. Lots of details and things to look at. 
The staff was also very nice and the washrooms were pretty clean! 

I'd love to come back for a late night of drinks."}
{"text":"I was excited to see what Grant Van Gameran would do with this old watering hole. Like his revamp of Harry's, he was able to keep the dingy vibe of the old Tennessee while still making it a place you would actually want to eat. It's always nice to see restaurateurs who understand the neighbourhood they are in and the Van Gameran gets Parkdale. 

I had the perogies (half priced from 4pm-6pm!) and cevapi and everything I tasted was delicious. Seriously, even the pita that came with the cevapi dish was the best pita I've ever had. I don't even know how that works. 

Decor in general was cool and not overdone. The heavy, ornate silverware and the way they present your bill were both nice touches as well. 

As a local, I look forward to coming back here a lot. They have a back patio that looks beautiful and a large, semi-private table in a raised area for bigger groups that looks very inviting!"}
{"text":"The food is absolutely outstanding.  The smoked trout appetizer is a dream.  The pierogis and the schnitzel are some of the best I've had in the city.  The cocktails are delicious too.  Service was great, the patio is also really nice.  I look forward to coming back here again and again."}
{"text":"I dig this place, and I'm glad to see something good open up in this space after the last few iterations have failed and didn't offer anything unique.

I'll start by saying there is a great beer selection between the taps and various bottles and cans to choose from. 
On the food front, the pierogies were really good, as were the spatzle pasta and the various sausages we ordered. The schnitzel sandwich I'd skip next time. Although it looks large in size at first glance, its rather thin cut and wasn't worth the price or of the quality compared to the other things we ate.

Patio is quaint but lovely. Inside seems a bit dark unless you're sitting up front by the windows. 
Service was a hit and miss, luckily we weren't in a rush and things got better as the night went on, but waiting 15 minutes just to get food menus or take drink orders wasn't a great start to our experience."}
{"text":"Amazing Eastern European treats: perogies, spaetzel and the schnitzel are so good. The decor is hilarious and quirky with faux furs everywhere and a baby in a tv. Servers are all super nice and attentive. My only complaint is that the food is a touch on the salty side. The photo features the perogies and the Tennessee platter."}
{"text":"Eastern European food done to perfection in my opinion. Many dishes such as the cabbage rolls hit the right authentic tones, as well as the sausages. The cucumber salad is unique and delicious. Pirogies were excellent as well.  We also ordered their 24oz T-Bone steak. It was a little disappointing on it's value side since the bone was about 8oz itself."}
{"text":"Great vibe, fantastic staff. Warm and dark!! Prob pretty good for a casual date night.

Everything was solid. The standouts were the cabbage rolls (I sometimes dream about these), cevapi, perogies, smoked fish platter. All reasonbly priced and portioned. 

They also have a great beer list and usually Peche Mortel or Aphrodite on nitro!! Sometimes the only reason I need to go there."}
{"text":"It's a 3.5 stars. 

they've definitely revamped the space that was here. Thank goodness!

The decor I have no idea what it has to do with the name but it threw me as Tennessee makes me think country. But no.... think signs of the all mighty Jesus and Mary. Most of us thought we were going to burn up right there.

The whole menu is a nod to Eastern Europe. I gave it a shot. This place is definitely a comfort food place: sausages, schnitzel, pretZel bread, potato salad, corn dog etc. It's a heavy meal.

The best thing I had I want to say was this macaroni and cheese thing (which it wasn't called that but it's my best description) and a refreshing cucumber dish.

Perogies were pretty good. Tasted very fresh.

The rest of what I tried was good but I can't say I'd have it again. 

The only thing I wanted and I would say, probably what could make this a 4 star spot  is the cabbage rolls. That's the problem when someone else chooses for you. 

Customer service was awesome especially the female server. She was very helpful and pleasant. However, The other fellow was okay. He didn't smile at all (I suppose everyone has a bad day but I wasn't very excited to see him when ever he came back to our table).

If you're a vegetarian there are options but not as much as she would have liked.  Definitely the highlights are a carnivore's delight."}
{"text":"I sat on the patio a few days ago and really enjoyed my time at Tennessee. It was a recommendation from a good friend of mine and it didn't disappoint.

We caught happy hour, which was $4 glasses of Pilsner Urquell and half price perogies. The perogies were perfect, and we also got some schnitzel, sauerkraut and sausage on top of it. Pretty friggen cool getting this type of Eastern European home cooking in a pub. It was all delicious and the price was nice."}
{"text":"Tennessee serves food from countries like Germany, Poland, the Balkans in a friendly atmosphere. Came here on a Friday night for a birthday dinner, 6 people. The front room part of the restaurant was reserved for us which was nice, it felt like we had a private room. The mood is dark and relaxed -- almost a tad too dark, at least in the front room part we were in. Nevertheless it was really comfortable.

We got the big pretzel with mustard ($7.95) which was fluffy, buttery, salty goodness. The assorted pickle plate ($11.95) provided a great assortment of vinegary snacks. The pierogies ($11.95 for 6) were done right. Then for the motherload: the Tennessee Platter ($42.95). Basically meat/sausage heaven. The cevapi (a Balkan grilled meat) was delicious and there were a variety of different tasty sausages for everyone to sample. It was fun trying items off the menu, and we were all stuffed afterward.

Beer prices are standard, about $7-8 for a tall can, or they have super fancy tall cans if you're a beer aficionado. They had a Halo brew on tap which was a pleasant surprise. The service was friendly, knowledgeable, and he was patient with our questions. I'd definitely come back again if I want tasty European food."}
{"text":"A good time all-around. Loved the neon signs and red lights. Atmosphere is on the raucous side, but it never reached the point where I couldn't hear the other people at my table. Service was friendly. 

Now let's get down to the food. Standout items would have to be the broccoli and cheese fondu, pierogies, and herring with dill sauce (which also came with an addictive pita bread). Schnitzel was also hearty and generously portioned. Debracyna sausage left me slightly underwhelmed, or maybe it just got lost in the crowd of other eats. Romanian salad was fresh and tasty in an appealingly pungent way but could've used less dressing. Cocktail list is slim but spans a good range of different tastes. Whiskey selection, on the other hand, is very, very generous.

Definitely wouldn't mind coming back here!"}
{"text":"Went here on Sat Oct 22, 2017 around 11:30pm, for a DJ night. Took forever to be served, and when the bartender finally came over told me \"don't give me attitude, we're slammed tonight!\" I did not give any attitude, I was simply trying to give money in exchange for drinks (otherwise known as being a paying customer). Not my problem that they were understaffed, couldn't handle an event like that, and were stressed out because of that. I saw several other customers treated rudely as well. They should hire more bartenders, with better manners!"}
{"text":"Great little spot with some delicious food in Parkdale. The beer prices are a bit high to stay and make a night of drinking out of it, but the food was fantastic. I had the Dinner For One and never would order Cabbage Rolls but they were really tasty there.

Oddly enough my favourite thing though was the soup included in the dinner for one. I believe they said it was a white borscht but tasted like a cucumber soup. So tasty!"}
{"text":"Wow...all you can eat Pierogies ?! Sign me up any day ! The food was fantastic and the atmosphere was even better. Quite an interesting bar that I can imagine is a big hit on the weekends."}
{"text":"Service was absolutely great! Good beer list, and the vibe of the place is awesome. Who knew how massive this place is!? 
The pierogies, debrecyna sausage & beet salad were delicious. The cabbage rolls are a bit too smokey flavoured for my liking, and although the schnitzel itself was fine I just personally prefer the way Hungarian schnitzel is done.

Will be back to try out some different items, or just to hang out and grab a few drinks!"}
{"text":"I have been waiting to check out Grant van Gameren's nod to Eastern European fare since it opened. I didn't know what to expect as I had only ever been to Bar Raval and El Rey's Mezcal Bar. To start myself off, I decided brunch would likely be the best starting point.

The place was super lively and busy, odd for the Sunday right after a huge ice storm in Toronto. But every single seat was packed for the entire 2 hours that my brunch ran. The best part of the brunch service this day: they had live music!

The brunch menu is actually pretty expansive with a lot of approachable dishes. There is are your basics (yogurt & granola with preserved apricots) but then there are some classics like the Soho Platter (with pickled things, smoked trout, and mackerel) served with toast. But likely two of the standouts in my brunch here was the French Toast (made with sourdough bread with apricots, smoked maple syrup & macadamia nuts) and the Huevos Stroganos (a huge pretzel with two fried eggs, beef stroganoff and potato salad). There were so many choices and each of them was totally shareable (if that is your thing). I was actually pretty surprised by all the choices and just how good everything was. 

One of their infamous brunch drinks is a Tang Mimosa, which my pals at the table decided to order. I just stuck with coffee this time around and bless the staff there who just kept filling up my coffee without even asking. Seriously, the service here is ON POINT.

If you're looking for a fun place for brunch and are down to try some unconventional brunch items, this is the place. I am seriously planning the next time I can visit here currently."}
{"text":"Great atmosphere, cool décor, great service and good food. This place doesn't leave much to be desired. It's taken a while, but someone finally figured out they could elevate Eastern European classics into a trendy, social Toronto food.

Stumbled in on a cold day after work for some drinks and ended up putting a good dent in the menu. Pickle plate, perogies, pepperettes, and a pretzel with cheese sauce all made their way across the table and did not disappoint. Unfortunately we sat down a little too early and were limited to any more selections. But menu items like pickled herring, cevapi, and smoked fish platter are making me itch for my next visit. My limited first experience gave me the impression that a lot of these traditional Slavic dishes were more contemporary renditions to appeal to the trendy Toronto crowd, but still nothing to scoff at."}
{"text":"The venue is nice, spacious and there's even a patio out back. However service was terribly unfriendly. I ordered the cabbage rolls - and regretted so. It was \"sour cabbage\", which tasted awful. I was expecting Ossington Stop style cabbage rolls but were sadly disappointed. I did try the perogies and they are indeed above average. A one time experience."}
{"text":"A beautifully curated cocktail list and half price pierogis before 6pm. There is no way to go wrong with this recipe, so clearly Tennessee knocks it out of the park.

After some sips and potato pouches, we decided to stick around and dig into heavier fare. We gobbled their schnitzel, cabbage rolls, spaetzle and sides of pickled vegetables. They got it all right, and for a large dinner for 2.5 people it was incredibly reasonably priced. 

This huge restaurant with large wooden tables is good early in the night if you're a little family, and gets louder and rowdier as the evening progresses. I'll be back both with my family and my drinking buddies."}
{"text":"The overall experience was quite good. I would probably give it 3 and 3/4 stars overall really. 

The restaurant won point with me for its menu (very Eastern European, comfort food), the decor (antiquey, hipster, casual), and the great staff (our waitress was wonderful, she was very attentive and on top of everything). 

The restaurant lost points with me for the really loud music and the non existent lighting. First, the music was so loud it was quite hard to carry a conversation across the table, you really had to focus. Second, it was dark! I know the vibe they are going for us dark, but I really even struggled to read the menu or see my food, let alone the person across from me! 

I heard they do have a great patio so I could definitely love to come back in the summer and see that. As I said, the food was good, so I would definitely come back :)"}
{"text":"Tennessee Tavern is located near Queen St W. and Lansdowne. I dropped by for brunch on a Saturday morning where I made reservations ahead of time (recommended as the place gets busy!). Upon entry to the eatery, you sense that the ambiance and environment is quite relaxed and low-key. 

Brunch plates we ordered included the perogies, the mixed sausage plate, and the cevapi and eggs. All the dishes were delicious! Perogies had great texture and the bacon added great flavour to the dish. The cevapi had delicious herbs/spices mixed into the sausage and the ajvar (a pepper paste condiment) and kajmak that came with the dish worked beautifully with the other components. The sausage plate had a wide variety of cooked sausages which will fill you up.

Service was attentive and friendly. Definitely would love to come back to try their dinner menu as well!"}
