{"text":"This is a great place to taste authentic Japanese Izakaya or Teppanyaki styple cuisine. Not your typical mainstream Japanese restaurant here in Toronto.  Amazing service and the food is just awesome."}
{"text":"FOOD  above average  - Really enjoyed the seaweed omelette, broccoli shrimp, and octopus wasabi starter.  SERVICE below average - they had enough staff just need better training on speed and attentiveness. AMBIANCE average - great noise level perfect for a date or equally a large group  VALUE above average - like similar restos in this category good value.  $40 or less for food and drink per person.  OVERALL - an average restaurant in the city.  If you are looking for something new, give it a try.  But we are on the fence on whether to give it a second go."}
{"text":"A big disappointment. I was a huge fan of nejibee here and I hoped the food would be at least as good. The steak was chewy and got cold thirty seconds after arrival. The takowasabi had no more than five little pieces of octopus and the pancake was a bit burnt. Don't think I'm coming back"}
{"text":"Hidden gem .  Good food, cheap beer and an attentive staff.  Don't get the guacamole though. It's a stupid dish on the menu.  Notable hits: Roasted chicken, okonamiyaki, and the creamy rice dish"}
{"text":"I would come back.  If you like Guu without the noise, then come here. I should note that Guu has a lot more food selection and more consistent food quality."}
{"text":"This place was a bit hard to find because it's behind the building. Customer service here was great. But not enough selection on the menu and portion size is small. My friends and I ordered a whole bunch of different items to share. Everything was just okay, nothing stood out to me. I don't think I will be coming back here."}
{"text":"I still can't believe that I'm writing my first yelp review for the resto that was on the top of my must-visit list.  This place has definitely seen better days. Since it opened with a big hype, I, a big fan of izakaya, was dying to try this place. All reviews were great except my friends' one and now I think I should've listened to them.  Guess something must have happened to this place like a main chef or owner has been changed or so.  Ok, firstly, I booked the table and showed up at the right time. When I said my name to one of waitresses, she brought my name stand from another table and guided us to the one right next to the window which was super f*** cold. Surely I asked her to move us to the warmer table where my name stand was originally located, but she just cut it simply saying NO. The place was not even half full on Friday night!  And we waited to order, which also took nearly 20mins.  There's a slight language barrier between Japanese waitress and us.   Ok, yummy food could cover this. One of my friends got beef okonomiyaki, today's special, and she kept spitting it out because it was full of beef fat! We called our waitress and explained why we wanted to return that dish. Tada! She brought it back after talking to one of chefs saying it's beef TENDONS, not fat! C'mom! I also cook, with being asian rooted, and had tons of Japanese food in my life. I can easily tell the difference btw tendons and fat! She was still hesitating not to take that dish back, so we had to make our point more clear. It also was served on a normal plate, not on a hot plate like other okonomiyakis. That's probably the reason it's cheaper than other ones on the menu. To be fair, I ordered pork okonomiyaki myself which was served on a hot plate and looked ok. And after finishing a quarter of it, it turned out pork in that dish meant only two thin slices of BACON - mostly fat too! Sure you can say bacon is a basically part of pork but it felt scammy to me not to have any real pork in that dish. 3 chefs look Japanese to me and I'm pretty sure they also knew that's not a proper pork okonomiyaki. Believe me, i'm a okonomiyaki killer, and it was the worst one I've ever had in my life.   We also ordered grilled chicken which was just simply PAN fried, not grilled. And we saw some photos of this dish on yelp with sauce on the side but ours just came simply as it is -  a big chunk of pan fried chicken.  Our waitress seemed to keep forgetting about the serving process. The knife for a grilled chicken and cutter for okonomiyaki never came with dishes at the same time, we had to wait about 10mins to get it.  Four of us ordered 7-8 dishes all together and each dish came nearly every 30mins. There were 3 chefs working in the open kitchen and the resto was not super busy. It seemed like there's no communication in the kitchen or just bad multitasking techniques.  Bad/mediocre food, freezing seats, inattentive service... my husband even had to put on a jacket while having food but none of waitresses seemed to care.   Ok, let's leave then.  Right! We asked water once sitting down and had to keep asking again and again since our waitress never brought some to us while filling up the next table's glasses- surely they're a big group. Yes, we finally had water when we paid the bill - thru another waitress.  When we tried to get the bill, our waitress just disappeared so had to ask another one who's bringing the wrong bill. The dish we returned was still sitting on the bill, and she seemed not understand what we're saying and kept coming back and forth to figure out what's happening.   Snail-beating slow food service, ridiculously inattentive waitress, bad food, freezer-like dining area - I would give 0 star if I could.  Maybe we're unlucky or,,, chefs and our server were not in good mood or so, but guys, you better go to other izakayas if you can. Most of izakayas in toronto are way better than this so-called hidden gem.  Unbelievably disappointing."}
{"text":"Having been to Japan less than a year ago, I high expectations for this restaurant.  I came here with a large group, and had really slow service. We ordered 4 or 5 different items of the menu, and each took 20 - 25 minutes to come to our table. I only had okonomiyaki in Osaka, and expected the same type of dish, but it wasn't - it was pretty flavourless, full of vegetables and no meat.  I didn't find anything special about this place, and would prefer not to come back."}
{"text":"Bad Experience.Come in and no one serve us, Wait until 30 minutes to get first dish. Another 15min to get the other dish. No air conditioner inside, very cold in winter. Bad  and service. Normal food quality"}
{"text":"Tucked away behind the Rabba at Yonge and Wellsley, I would never have found this gem had I not stumbled across a flyer.  But what a find it is!  I had never visited a Japanese Isakaya before, but I have become a huge fan.  Let's start with the ambience.  I generally eat at Teppan Kenta once or twice a week because it always feel as if I've \"come home\".  The team is incredible.  They welcome you and I always feel as if they are as happy to see me as I am to see them.  The place lends itself to friendly chatter with other guests, particularly if you sit at the grill.    Sitting at the grill is a whole experience in itself.  Both Kenta and Yutaka are warm and talented chefs.  I've probably tried most things on the menu.  Others have mentioned small portions, but that is one of the reasons I like this place.  I never feel over-stuffed, but I always leave feeling satisfied.  The beer is icy cold and one is brought to me almost as soon as I sit at the grill.  I like to go early before the place fills up too much - and if it isn't too busy, just let the Chef surprise me with my dinner.  That leads to amazing things that aren't even on the menu!  I would not say the service is slow - I think it is \"paced\".  By this I mean I have never felt rushed to vacate my seat because the place is filling up.  And fill up it does.  The chatter in this small restaurant is animated and happy - and it just lends itself to a friendly exchange with others.    If I can't make it early, it is great to be able to call and reserve a spot.  If you don't, you may find yourself waiting until a space opens.  I think the price is reasonable, particularly if you are sitting at the grill because you are treated to a \"show\" as you watch the chefs preparing the dishes.  I am still amazed at how they flip an okonomiyaki and keep it together - or roll up an omelette.  The marinated chicken, the tuna steak and the steak are delicious.  And the steak tartar is absolutely amazing.  On a cold day, you can't beat the hotpot!  Because I am usually by myself, I'll ask them to make a small hotpot for me and they have always delivered.  You can watch their Facebook page for specials and features.    I have yet to encounter an unpleasant team member.  They are very helpful in describing the menu and making suggestions.    I will continue to enjoy Teppan Kenta as my \"go to\" restaurant.  It is always fun to try new places and I've enjoyed many in Toronto, but you can't beat finding that one jewel that pulls you back again and again.  For me, that jewel is definitely Teppan Kenta!"}
{"text":"It is my first time Teppan Kenta's experience with my wife for our Anniversary this past Friday night .  It is a very pleasant and uplifting experience both with the chefs, waitress and the food.  Although the location is not seem to be easily, but thanks to another Yelper so I have no problem to find it out.  We have made a reservation (6:30pm, really early) to the Chef Table.  But a lot of table is reversed (especially Chef Table).   After 7:30pm, there is no way you get in there without a reservation.  As I know, you can only get in there around 10pm because it is so busy.  I leave around 9:00pm but the place is still packed with people.  I can see 4 to 5 people try to get there but just can't get in.  I sit right in front of Chef Kenta.  It is not busy at that time, so we got a few chat with Chef Kenta.  Although it is very busy afterward but he something still chat a little bit with us.  First of all, I have to point out it is a Izakaya Restaurant (Japanese style pub as you can say), so the waitress has let me know the dish will not be very big.  They mostly order a sake or beef to go with the dishes, and certainly have a good time (chat) with your friends.   So, Chef Table is good for 2 to 3 people together unless you got that the corner.  They have table I think hold 10 to 12 people.  But sitting in the chef table (especially I can sit in front of Chef Kenta) is a really enjoyable experience for me and my wife.  Especially we are discussing about his skill on doing the dishes.  With the food, we have order the following: 1.)  Appetizer:  Takowasa - chopped octopus with wasabi -- my favorite appetizer, flesh octopus with a very uplifting taste of wasabi and rice vinegar that give you will find it is not enough to eat.  2.)  Seared Salmon with ponzu jelly -- use a really flesh salmon to wrap with the ponzu jelly and green onion.  3.)  Gyu Steak - Angus steak  4.)  Okonomiyaki DX-Japanese Pancake with seafood -- it is chief signature and this is my favorite for the whole night.  5.)  Takojaki - Octupus ball -- Fried ball with Octupus and flour paste inside.  The flour paste inside the are so smooth that I thought it use milk to make a paste, but the staff told me it is a flour that stirs so quick to make that kind of smoothness.    6.)  Unagi - daily special, Japanese style omelet -- this one really show how skillful the chief is.  The omelet is so mellow with cooked eel fish to enhance its fresh taste.  7.)  Horumon - daily special, deep fried pork intestine -- Well, this one will be my favor dish if I can drink Sake that night.  But make you love the taste of pork guts in order to eat it.  It is so tender inside with a small crunchy texture with a wild animal taste.  And this make it perfect for beef or sake (too bad I can't drink sake that night).   One of the staff specially talk to me about this dish because not a lot of people will order this.  8.)  Teppan French Toast - French Toast with Vanilla Ice creamDessert  Most of the dish are really special with its unique taste (good taste).  The presentation is really go to make you feel really pleasant to eat.  But food in here is not only thing.  It is the atmosphere, the vibe in there makes you feel so good that you want to welcome.  You feel that you and your friend are kind of in a big house of party together.  The chef and all the staff tries to make feel like they have a big celebration there together.  They will enthusiastically greet you, serve you,  and try to make you feel so enjoyable the whole night in here.  My wife already think of coming back next time."}
{"text":"My family and I visited Teppan Kenta just to eat their Hiroshima-style okonomiyaki,but ended up loving else on their menu as well!  Some menu highlights: - Hiroshima style okonomiyaki.  I don't think you can find this anywhere else in Toronto - the fried chicken was a pleasant surprise.  The chicken was so moist and tender inside the crunchy batter! - steak.  Grilled to perfection. - hot pot!  This is part of their daily special, but I hope it will stay for the whole winter.  Try to grab a table by the bar to see how the chef cooks on the grill.  He is very precise with the cooking and we were very impressed with how delicately he treats the ingredients.  Great skills!    This is not to slight Guu (which I really like!) but I think I would prefer to make Teppan Kenta my new go-to izakaya pick given the quality of food and service.  Overall, we had a fantastic dining experience."}
{"text":"To start, I have to state that I'm a big fan of Japanese food but not so much for izakaya per say. This is because I like sashimi so much but there normally aren't any good ones in izakaya. But still, I've tried plenty, and have to say that Teppan Kenta is only mediocre. In a city where you can find izakaya almost everywhere, one really want to be super special to stand out. Honestly, I'm not sure whether Teppan Kenta will make it. The location is a big challenge first of all. Neither a street spot that everyone can see everyday nor so easy to find since 24 wellsley is a condo. Service was good, tentative and professional.  1. Drink, tried fairy tale. Very sweet and no alcohol taste at all. I guess at izakayas we need to stick to sake and soju. 2. Mini ribeye steak. Fresh and juicy, but a bit over cooked. The wasabi+soy dipping sauce I liked. 3. Grilled oyster mushroom. Liked it, original flavor well preserved, not overcooked like most places. Together with a touch of lime juice, very healthy and tasty. 4. Ankimo steak. Fresh and good, I like that they are making it themselves rather than just ordering it from the supplier. Although it did bother me that they don't have ponzu or other sauce for it, it was too plain for me until I dipped them into the sauce for ribeye steak, but my friend says he's okay with it was. 5. Seared salmon with ponzu jelly. Salmon was definitely fresh and tasty, but it was still a bit plain for me since there were just a bit of ponzu jelly. 6. Mashed avocado salad with nacho ( oooops, forgot its real name). It was special and pretty, because the waitress made it right at your table. The taste was good as well, a very nice dish for drinking place. Although it was a rather easy dish once you have seen it, I suggest Teppan Kenta to change the \"make it at your table\" thing to prevent its customer from stealing the recipe lol. 7. Shrimp and potato melt. Recommended by the waitress. The sauce was okay, the bread and potato were yum. But it looked too much like a Chinese dish to me, kinda weird feeling. 8. Grilled yellow tail collar. Nicely cooked, well preserved its original flavor, but small portion comparing to price and other places. Also, what's happening to this place and its sauce? To me, just serving it with mashed radish is not good enough.  My friend asked me whether I would come back to the place, prob not. Not saying that things weren't good, there was just not a single dish that was good/special enough to draw me back in again. Like Koyoi's salad, Dondon's soy tofu thingy, Bushi's udon, or Zakkushi's skewers and green tea ice-cream sandwich thingy."}
{"text":"I came here with a friend on a Saturday night during Nuit Blanche and had made reservations for 8 pm. We were a little late (due to traffic) but they kindly held our table for us. However, had my friend not told me that it was tucked deep behind an alleyway, I don't think I'd be able to find it without some help. The atmosphere alone would have me coming back, as the waitresses and chefs were very upbeat and welcoming.  The food was absolutely fantastic! It was flavourful and sized well, so no regret about leaving anything on the plate. We ordered the French toast for dessert and it was wonderful! Enough to come back for exclusively!  Overall it was a great  experience which would be great for a girls night out or a date."}
{"text":"When I read there was a placed that served okonomiyaki Hiroshima style, my heart jumped with joy! Last year we visit Japan and had some pork okonomiyaki near the peace museum and it was amazing.   So we went to Teppan Kenta full of expectations hoping the taste would bring us back. We started with the combo of karaage + beer and that was great, then the pork okonomiyaki reached the table and that's when things turned sad.   It had waaaay too many fish flakes that overpower the smell and taste, after trying to take most of the off, we decided to skip the top layer and eat the rest instead but we couldn't because it was so tasteless. The noodles, the pancake, everything was meh. We didn't even finish 1/4 of it and left."}
{"text":"Teppan Kenta is a really cozy Izakaya hidden away on a small street just behind Rabba; 1 block West of Yonge x Wellesley.   I've become a regular customer for the following reasons: *The chefs and staff are very welcoming and friendly. *Lunch, Dinner & Dessert are served (They have daily specials) *Variety of drinks: Beer, Wine, Sake, Cocktails (Non-Alcoholic as well) *No Lineups / Convenient location / Reservations accepted. *The noise level is reasonable. You can have a nice conversation without yelling :) It only gets really crowded on Fridays & Saturdays, so you can have a peaceful conversation during the weekdays. *Pricing is also quite reasonable compared to other izakayas.  I have tried almost everything on the menu.. and everything is delicious! My recommendations are:  *Appetizer: Guacamole, Takowasa, Maguro/Salmon, Buta shabu *Main: Karaage, Grilled chicken, Gyu steak, Dashimaki, Okonomiyaki  *Dessert: Crème Brûlée, Teppan French toast  *Special combos (e.g. Sapporo pitcher + Wings/Karaage for $20)  I've yet to try their homemade gelato and their recent Monday Only Italian menu!"}
{"text":"Ordered Oknomiyaki and a few other things. Not as good as I expected. They used too much vinegar in the oknomiyaki which makes it tastes weird. The food are pretty expensive, not worth the price in my opinion. Don't think i would go back."}
{"text":"I am not able to say much about the food because I didn't receive my food.   We made reservations for 12 for a birthday for a Sunday night. (They  were not busy when we came in and ordered)   We ordered several plates and some drinks.   Only 1/10 orders came out  We couldn't find our waitress all night to re-order what was missing, she wasn't there to check on us. After some complaining to another waitress (only 2 on floor) we got 3 more orders to arrive. The rest was still missing.   Diners that came in after us, had their food and left.   No explanation on why, we managed to get the mandatory 15% tips waved."}
{"text":"This place is really good to just chill and drink. The food is awesome. I always have tbone steak and the takoyaki. I really enjoy eating here. The server are nice and friendly. Service and food is 10/10"}
{"text":"Authentic Japanese grill. Always have daily special. It's a good place for a group as well but do remember to make reservation ahead of time."}
{"text":"This place was very cool.  Not really any other way to describe it.   Our staff was very nice and answered all our questions. It was the first shift for one of waitresses but she was great. She'd always check to make sure she gave us the correct information instead of trying to make it up,  which we all appreciated.   The food choices were great too,  it's a tapas place,  so you'll definetly get to try a few things off the menu.  They had chicken and pitcher specials for $20-$25 (depending on the beer you get) which is a terrific deal. And pretty killer sangrias (made from white or red wine)   My only complaint is that it was pretty nill on the vegetarian options, there was maybe one or two things that you can get if you don't eat meat or seafood.   All in all,  a great experience"}
{"text":"Owned by former manager of Guu Izakaya. This place is a hidden gem behind RABBA supermarket on Wellesley street. The place is well decorated and the food was fresh. Waitress and chef were very friendly, you can sit at the counter to see the chef make your food. As a former Vancouverite, I would say this place is up to Van standards.  For appetizers, we ordered the Kurage (Marinated Jellyfish) and it was delicious! We also ordered the Takowasa (Chopped Octopus marinated in Wasabi), it was good but a bit too much wasabi flavour. I'm usually not a big fan of Chicken Karaage but this one was AMAZING! The meat was moist and the dish was not oily like some other restaurants. The Okonomiyaki was packed with perfect flavour and not too oily either.   If you follow the restaurant on Facebook, they upload a \"special menu\" an hour or two before they open at 5pm each day for dishes that are not on their regular menu. We ordered 6 dishes + 2 desserts between two people and the bill came to $61 excluding tip. A great alternative to Guu. Will come back again to try their other dishes!"}
{"text":"Would you like a Guu food experience, but with the ability to actually have a conversation at your table? Teppan Kenta is the place. It feels like a nice break from izakayas that feature hollering staff, drum-pounding, and deafening music. Now, I'm not saying that this place is sedated; it has a simple, cheerful vibe, and in this pared-back atmosphere, you can really focus on what's important: the food.  The hallmark of a great restaurant is not one where diners take pictures of their meals, but when they are in awe of their food, and they savour every bite. At Teppan Kenta, your tastebuds are rewarded not by overloaded portions, but by well-crafted food.  We watched the chef (reportedly a Guu alumni) and that was a highlight in itself. His movements are deft, precise, and cheerful. For those of you who are complaining about the wait time for your food, try sitting at the teppanyaki. You'll see that the chef is working as fast as he can, but that his main goal is to serve dishes of great food. Isn't that what matters more?   We ordered the okonomiyaki, the karaage, the Angus steak, and the tuna avocado. It was all mouth-watering, memorable, and reasonably-priced.   Kenta, we'll be back! Best of luck on your Hashigo project; collaborating with the city's great Japanese restaurateurs is a great initiative!"}
{"text":"High quality, authentic food all the way. Even though I didn't try that much (just the Okonomiyaki), the food is stellar. Only downside is that it's extremely cold near the windows and the insulation is quite subpar. Price-wise is also on the high end but the quality of the food balances that out."}
{"text":"Who would have thought that you could wander down a small alley behind a Rabba's for izakaya!  The show is run by a former manager of Guu and the place has a similar vibe. Heavy wood doors and tables along with upbeat and modern decor. I liked how this restaurant wasn't overwhelmingly loud and the staff was still energetic and friendly.   Teppan Kenta is a  small place and they still take reservations. The \"Chef's Table\" is basically sushi bar seating but near the grill. You can request a corner if you have 3 or 4 people, but I found a table was better to talk.  They have a cocktail list and a small selection of beers and sake. I ordered their version of a collins which was light and refreshing. My friend didn't finish her wine lemonade and passed it along to me. It had loads and loads of undissolved sugar at the bottom. It was way too sweet.  The beer was served in a nice frosty glass, but they didn't serve giant mugs of  Sapporo!  Booo.  We ordered a few items to share.  The seared salmon was okay, but I wasn't a fan of the pea shoots used for garnish.  They weren't trimmed enough and were difficult to chew and swallow.  The takoyako was crispy and chewy and and better than expected. I really liked them.  I've had octopus balls at other places, but I really liked the texture of the ones here.  The Gyu Steak was a popular item.  I found it a bit bland and slightly overcooked.  It does come with wasabi and soya sauce, but I still expected some more flavours.  The Hiroshima styled okonomiyaki was one of the better items we ordered. The bonito flakes danced around and the cabbage added some wonderful texture.  We ordered the pancake with shrimp and pork.  They shrimp were plump and fresh.  I ordered the karaage, it's one of my favourite snack foods.  The chicken was juicy but nothing super special.  Actually it could have used more salt...  As we were finishing up, it took awhile to get the bill.  The restaurant started getting busy and the service was noticably slow.  Overall, I liked eating here, but there was nothing that would make me want to return."}
{"text":"We found the service very friendly and accommodating. But they forgot a salad and served an entree about 45 min after the others. We didn't mind as we were sharing most dishes but there wasn't much in the way of check-in by the staff. Especially when the bill came. One star off for that.  That said the food was really good and reasonably priced.  Tried all the Yelp recommendations. Gyu steak, avocado salad, okonomiyaki (ordered pork got fish),  and fried chicken. As well the yellow tail and guacamole. All tasty and in good portions. The french toast and caramel pudding were also excellent.   Loved the decor and atmosphere. Will go again for sure and highly recommend for a unique dinner. Would be extra clear about our order next time. Fried chicken is the best there is and we had ours with a pitcher of beer as a special!"}
{"text":"We recently welcomed home a traveling friend with a dinner at Teppan Kenta. Teppanyaki is a style of Japanese cuisine that uses an iron griddle to cook food (thanks Wiki). We were quite a large party (15) but they cosied up tables for us. It was a 5.30 reservation on a Thursday night and the place was empty for the first hour-ish. The stylish décor is lovely, with a huge chalkboard wall, dark wood everywhere and those retro bulbs that are popping up around the city. The owner is a former manager of Guu, which explains the shouted greetings and goodbyes, but the overall atmosphere of this place is more quiet and relaxed. The small number of tables adds to the snug living room feel.  First impressions were all good, which is why I feel bad about giving such a poor review. I tried 6 items and all were okay. I was sharing with someone and we had to order that many in order to be full. It really adds up! We had Seared Salmon with Ponzu, Ebi Mayo, special-of-the-day Lobster, Takoyaki, Dorayaki, and Teppan French Toast. Nothing really impressed me, which is sad because I enjoy these dishes at other places. My dining partner liked the desserts, saying he enjoyed the crispness of the Dorayaki buns, and the fact the Teppan Toast wasn't dry. I feel like the food wasn't the best in the category, but was expensive. If you can't make me happy with your food, you still have a chance to make me happy with my wallet! This alone was not enough to pull down the rating so low, but unfortunately the service was. Our dinner lasted about 3 hours, and this was mostly because there was only one person in the kitchen! That and the server made a few mistakes with our orders, including a forgotten order-replacement order-debacle, also completely forgetting who ordered what. It was pretty frustrating! Thank goodness they allowed us to linger. They also don't do split bills, so asked our party to write out their own orders on pieces of paper and tallied it up separately. Actually, that was nice of them. Maybe they felt bad for the way the evening had gone."}
{"text":"Oh man their fried chicken is awesome. I highly recommend it.  Also highly recommend the okonomoyaki. As close to the real deal as you can get. Takoyaki is also solid.  This place is pretty well located as its in the back of the building really giving it a cozy feeling.  Also relatively cheap!"}
{"text":"I was truly disappointed by the food and service. The dishes are cheap - $6.50 for most but they are small. The quality of the sauces and meat isn't good. For the beef tongue, wow, was that tough. For the prawns, oh my, there was a fishy seafood taste to it. Guu is way better. Service is slow here. I was truly disappointed. No need to reserve since only half the restaurant was full on a Thursday at 7 pm.  Price for 2 people after tax and tip (no alcohol): $75."}
{"text":"I have been to many izakayas in Montreal and Toronto and this has been the worst one.  The food was ok, but every time I was thinking I have had better.  Guu Izakaya, Kinka Izakaya, Imadake, and Kinoya are all better choices."}
{"text":"I was really looking forward to having a new little secret spot tucked behind a Rabba, but unfortunately I'll sooner return to Rabba for supper than to Teppan Kenta. Let's start with what went wrong:  - While a slow pace is the norm with izakayas, the up-to-20 minutes between dishes was pushing it. Especially when our cocktails ($5.5-6.5; some of them watery enough to satisfy a teetotaller) were long gone. We would eat for 30 seconds, then wait. And wait. And wait...  - This may be more of an issue with the word \"asparagus\" lacking singular/plural differentiation, but the grilled asparagus ($4) had between 1-2 spears and no discernable excitement. It was ludicrous (but sadly, not mystical).  - Ordered the chef-recommended Okonomiyaki DX (Japanese pancake with pork, squid and shrimp, $15), asking if we could substitute cheese for the meat since the toppings were priced the same. Server said yes - seemed easy enough. When it showed up over an hour later, cheese was a solo act. Another server came by, quickly said they were \"so focused on the cheese that they forgot the rest\" (?!?!) and before we could say anything, she dumped a few seafood pieces on top of the already-served pancake. Despite the fact that the ingredients are supposed to be, you know...inside.  - They charged us $16.50 for the above hot mess. Yes, extra for the cheese when the stuff it was actually supposed to come with didn't even make it into the dish.  - Our server, suddenly ready to wrap up, asked if we wanted any dessert. We informed her that we were still waiting for 3 dishes. She seemed unfazed.  - Our first orders finally came last, over an hour and a half after we requested them. The seared salmon with ponzu jelly ($6.5) was slightly tough with some tiny flecks of jelly on the side that we couldn't pick up. Along with a simple bowl of agedashi tofu in broth ($5), it wasn't worth the time it took.  - My friend finally cancelled the karaage he was waiting on. Server said yes, and then came back twice more to push if he still wanted it. He didn't.  - Asked for the bill. Server said yes and vanished. I mean, we literally never saw her again. 15 more minutes passed. We eventually asked for the bill from someone else.  - There was no acknowledgement of any of the above. In fact, when they finally brought the bill, she promoted some other dining event they were having and gave us a menu. Yeah...probably no.  Still reading? I guess you really don't want to invite your date to Rabba. Here's the good stuff:  - Ebi Mayo (grilled shrimp & broccoli with mayo, $8) was our first dish of the night and, despite the small-even-for-small-plates portion, its flavour got my hopes up for the rest. - Hot Pot ($20) was probably the evening's only plate of real interest, with its creamy sweet soy milk broth, enoki shrooms and a couple crab legs. Tasty? Yes. Worth the Vimy? Not at all.  For the record, this petite 50-seat restaurant was only about half-full over the course of the evening (we were there on a Saturday from 7:30-9:45).  The food wasn't bad, but along with the service, it wasn't up to par. After 2 hours and $115 at a Certain Other Local Izakaya, I'm invariably happy and stuffed, albeit deaf - I just can't say the same for Teppan Kenta. We came ready to love the place. We were disappointed. We left hungry. We went home and made fish sticks."}
{"text":"Food is very fresh and packed with flavor.  lots of healthy options, not just processed and fried foods like a lot of isakayas. Enjoyed all the dishes i tried. Gyu steak is moist and buttery. Seared salad and tuna with ponzu is topped with a bed of fresh greens.  hokke grilled mackerel is my favorite and good size portion.  definately coming again. Its hard to find behind the alley at rabbas."}
{"text":"This is one of the worst restaurants I have ever been to.  They have a huge problem with the heating system and it was freezing.  We were seated by the door and in addition to getting the cold wind from patrons coming in, there was an actual hole in the wall under our table.  This is ridiculous.  We complained to the waitress who said it's also bad for them but that the owner refuses to fix this.  The food was bland at best and that is being generous.  The menu was very cryptic with not enough detail.  For instance, a pumpkin soup...turned out to have bacon bits... who wouldn't expect that right?  The deep fried tofu was fried in virgin oil...probably ten days ago as there was a rancid taste to the oil.  Awful place overall"}
{"text":"Sadly, Teppan Kenta closed for good on February 12.  A shame that an authentic Japanese place couldn't survive in downtown Toronto.    Notice posted on Facebook by the owner:     Dear Valued Customers.  Today, I would like to take a moment to inform you something important.  We regret to inform you that Teppan Kenta has been closed for good effective February 12, 2016. It has been two years and half since we have opened this business. We would like to sincerely thank you for your support to date.  Now that I look back, there have been so many great memories with you all and I cannot thank you enough. I have started this business from scratch, not knowing much about how things work. Fortunately, I have had tremendous support from everyone. I truly think that I wouldn't be able to be where I'm at now without your support and love for Teppan Kenta.  To show our appreciation, we have decided to have a private party at Teppan Kenta on Saturday and Sunday (Feb 20 & 21). The party will start at 7pm on both days.  Please note that good food will be served and there is no cost. However we would like to ask you to please bring your own drinks.  If you could be generous enough to leave some tips for our hard working staff, it would be much appreciated.  Please accept my apologies for not being able to thank all of you in person before I left Toronto. I am very blessed to have you all in my life.  Thank you,  Sincerely,  Kenta Taniguchi @ Teppan Kenta"}
{"text":"It still surprises me to see Teppan Kenta filled with diners despite it's super hideaway spot. It's literally in an alley, beside a dead Tattoo parlor and a Rabbas. If you did not live around the area, and even if you did, you wouldn't look twice to see if a restaurant lived deep inside the gulley of the towering condo buildings around.  Teppan Kenta is almost identical to all Izakaya places in Toronto. The set up is straight forward, trendy in style with wooden benches and tables. A large teppan/cooking area (where seating is also available), stainless steel accents and shouting to greet you in/out of the restaurant.   The food is also similar in style but delicious nonetheless. The best thing I ate was the seared tuna, which was sliced thin and topped with seaweed, scallions and soya sauce jelly cube things. Textually interesting and the flavors come together nicely eaten in one bite. I was unimpressed with the Unagi omelette which was just an egg omelette with a tiny bit of eel tucked inside. Chicken wings were meaty and seemed baked, pleasantly surprised. The Okonomiyaki DX was done Hiroshima style, so youtube it and watch how painstakingly long it takes to make. It takes a while to get to the table but its mostly cabbage with spikes of octopus and shrimp. Didn't blow my mine, but the ramen noodles were a unique twist.  Overall, the atmosphere was more tame than other Izakayas which promotes conversation. I liked the service and how small the place was. It felt cozy and intimate, while still trendy and modern. The food was unique-ish and the prices are very reasonable for the type of experience you get."}
{"text":"GUU HAS MET ITS MATCH.  There. I said it.  Having been to both locations at Guu for far too many times than I can care to remember.  The times they have changed since Guu was the only game in town in terms of Izakayas.  Now we have Don Don, Kingyo, Zakkushi, etc etc. For all the Guu zealots out there, this comes from the heart, so here me out.  I recall dropping by here for the first time, confused about where to go, having to stumble upon a back alley behind Wellesley street to find this nook of a restaurant only to be greeted by a high pitched greeting, similar to that at Guu, but easier on the ears.  I'm going to focus on the points that are different and better than Guu.  There's hardly a line up.  Actually, the first time I went, there was a 5 minute wait. That it's it. On other nights, I casually strolled right in and was seated immediately.  The food is delicious and the menu is varied every single day.  There's something about the intimacy and vibe of the place that really resonates with me.  So does having a a conversation at an audible tone, without having to yell is quite nice.    The fact that the food isn't made in huge batches and served at irregular intervals is kind of nice as well.  If you ever want to get the best seats, it's right at the bar across from the chef (in my humble opinion) where you can see the chefs doing their thing and get a good view of the entire restaurant.  If there is one dish you must order, it is the steak! Melt in your mouth goodness..."}
{"text":"2.5 stars from me.  I think it's authentic but because of that it means super greasy and fatty as I've heard that's what Japanese cuisine is know for; marbling of the meats.  It was good but sure if I will return.  I came here with a friend of mine during a cold night and the condensation welcomed us in.   Food: 2.5/5, we got the okonomiyaki DX with the hotspot sukiyaki.  The oknomiyaki was a bit too \"falling off\" everywhere and the soup was too oily for my taste. It wasn't bad.  Service: 3/5, the server was nice but a bit hard to understand.  She was attentive but water service could have been better as the food was salty and we needed it.  Ambience: 1/5, the condensation, the super small wooden seats and loud izakaya style is not great for dinner.  It's an acquired taste.  I think they were being too authentic and not fitting North American needs.  Price: 2/5, I think it was about $20 per person; overpriced for what you get.  It's ok but I think there are better Japanese joints nearby."}
{"text":"My boyfriend and I stopped by for a date night and both enjoyed the experience immensely. Firstly, we arrived at 6:30pm on a Friday night and were seated immediately. We sat at the Chef's Table and had a great view of the grill. We had to wait ~10 minute between each course, but we were entertained with watching the chefs at work, so we didn't mind. The food was delicious! We started with the Japanese omelette, which was cooked perfectly and melted in your mouth. We also had the okonomiyaki-DX, which everyone raves about, and it definitely did not disappoint. The portion size was also very generous. The boyfriend and I shared and we were both pretty full afterwards. The Gyu steak was also good, but not our favourite. It arrived lukewarm. My favourite dish of the night was the French toast for dessert! It was perfectly toasted and complemented with vanilla ice cream. We gobbled it right up. Overall, I would definitely recommend Teppan Kenta! Great food, atmosphere and reasonably priced!"}
{"text":"Went there for the first time last week and couldn't check in or find it on yelp-mobile but I'm going to write my review here.    I was in a little bit of a rush, so I ordered the carpaccio (salmon with salad) and the steak.  The carpaccio was pre-made and kind of slapped on to the plate. It was still nicely plated and I was seated right in front of the chef cooking on his grill stove, so I saw everything he did with the food. It was beautifully made and it tasted amazing. I can't quite put into words what I felt about it. But moving on, I had the steak as well prepared medium rare and it was a melt-in-your-mouth taste. It truly had steak flavor and nothing else! The outside of the steak was almost crispy and the inside was made just right. There was no premaking and no extra seasoning on it.  Absolutely delicious. I would come back and try a different dish and see if my stars were given correctly. Their service was impeccable!"}
{"text":"In winter, they served soy milk and kimchi hot pot! They were very delicious and I always crave for that. In summer, the best dishes are dashimaki tamago(egg), okonomiyaki, and takowasabi (wasabi octopus). The staff is nice."}
{"text":"My third visit:   We ordered chicken karaage with beer, hot pot, takoyaki and grilled octopus.   Grilled octopus was amazing! I don't know how but it was a perfect dish, the only imperfection was it made me want more!  The hot pot was superb! The pork belly, soup and vege all went well together. Again, the portion was small. I could eat 3 of the hot pot! Okay I should stop now, my mouth is watering now."}
{"text":"Our visit to Teppan Kenta was rather disappointing as we saw many 4+ stars reviews on Yelp. The hype was too high :( Service was great though!  DASHIMAKI (4/5)  (Fresh Seaweed Omelette with Japanese Broth) This was the best pick out of all the dishes we ordered for the night. The broth that they cooked the omelette in, was delicious! The egg was so smooth, eat it while it's sizzling hot! :)   AGEDASHI (1/5) (Deep Fried Tofu in Seaweed Broth) I'm a big fan of agedashi tofus but this dish just wasn't good. The broth was not hot enough (it was room temperature - lukewarm :S). The tofus weren't yummy either.  EBI CHEESE (1/5) (Shrimp and Potato Cheese Melt) This was probably the worst dish we ordered all night lol. It's more like a stir-fry of shrimp and potato without any taste of cheese.  Both the shrimp and potato did not taste marinated. Very flat dish. Will not order this again.  GRILLED T-BONE STEAK (1/5) We asked for medium rare but it was way over cooked. Beef was hard to chew on and had no taste to it. On the bright side, they made it look pretty.  DX OKONOMIYAKI (1/5) (Japanese Pancake with Pork, Squid and Shrimp) There are way too much veggies in this! There're two thin (very thin) slices of pancake and not enough pork, squid nor shrimp. I would prefer this if they added more sauce. Didn't enjoy this dish - but on the plus side, it was very hot (unlike the agedashi)."}
{"text":"The food tastes really great, and you can watch the chef cook on the griddle right in front of you! The Hiroshima-style okonomiyaki is the specialty here. Karaage is a fine choice too.  The restaurant is run by Japanese people; the waiters speak fluent Japanese but sometimes have trouble with English - so do state your orders in simple terms. Expect $20 to $30 for a meal, and more for drinks. I would have given 5 stars because of the awesome taste, but the cooking takes rather long; taking 30 minutes from ordering to getting the food is not uncommon. It's a place to sit down and chat with people for 2 hours or more.  Teppan Kenta is exceedingly busy on some days (such as Friday nights, and random private parties renting the whole place), so you might want to call ahead to get a reservation or at least check for drop-in availability (and remember to speak in simple English, or better yet practice your Japanese)."}
{"text":"I disagree with the negative reviews, this is a great place to eat. The food looks as good as it tastes, just look at the pics. Yummmm.   Watching the chef at work is amazing, really looks like he enjoys his work.   The complaints about food prep time is overblown. The waitress told us when we sat down it would be 30 mins for the Dx okonomiyaki. The other dishes came out within that 30 mins.   The service is decent just need to flag down one of the two waitstaff. But they were polite and helpful.  I would give it a 4 but because some of the other reviews were just brutal I will give it a 5 to offset those negatives."}
{"text":"I like the mystery with restaurants that are found tucked away on small streets and unfrequented squares. Teppan Kenta has that feel. As you enter, you find yourself in an unassuming place. The chairs are wooden rectangular blocks arranged around rectangular tables. The walls are chalked with the day's specials and drinks. The teppan area is a wide open bar, and I'm pretty sure I'm sitting beside a regular whenever I've been.  The dishes that come out smell great, and taste great, but doesn't look like they're trying to be something they're not. The chicken Karaage is probably my favourite of their offerings. It's honestly the best Japanese fried chicken I've found in town. Their teppanyaki dishes have an excellent grill flavour to them, and they're stuffed with a good helping of ingredients.  If it were closer, I'd definitely make this my local joint!"}
{"text":"This is a really cute Izakaya tucked away on Wellesley, at first we couldn't find it because it's behind a building but there are a few parking spots available if you're driving.  We were greeted with a warm welcome right when we walked in.  There's one large teppan (which is a hibachi grill) with two chefs manning the station with seating right in front of it if you like watching food being prepared.  We ordered the salmon w/ ponzu which was grilled just to the right temperature so it was very tender and juicy.  The mentai mayo tofu salad which is a spicy cod roe mixed with mayo, yum!  And finished off with the Okonomiyaki DX since that was the one that came with pork, squid and shrimp...which was also really good."}
{"text":"Although the quality of food and service has gone down over the years, my friends and I still went for the cheap wine and super friendly customers who sat at the bar. Thanks for everything Kenta San and Yutaka San."}
{"text":"I went to Teppan kenta with high expectations since I love Japanese food and especially izakaya. First off, the restaurant is rather difficult to find. It is located behind the building and I had to ask the people in the stores in the area to find it.  After about 10-15 mins of walking around, we finally sat down. I actually had a hard time deciding what to eat - no because of the price or anything but it is because of the selection. There are not many special options. The dishes are pretty standard meaning you can get them almost anywhere else.  We had the crab risotto which was the most special dish they have to offer. The taste is decent. Certainly, doesn't have the WOW factor in it.  I am not sure why they would put pancake (like the ones you can get at Mcd's) in their menu. I thought they could be more creative than that..Don't you think?  Overall, it is quite a disappointment for my friends and myself. I probably won't go back there again. There are many more better options in Toronto"}
{"text":"There are so many izakayas downtown now, but I quite like this one for several reasons: - No lineups (unlike places like Guu) - Takes reservations  - Attentive service (maybe they have improved this since previous reviews mentioned service being slow?) - Noise is at a level that you can have a conversations without yelling - Pricing is very reasonable compared to other places (dinner for two including drinks and dessert came to ~$65)  - Great location, close to Wellesley station  The place has a casual, laid-back vibe and feels authentic. Lots of Japanese-speaking diners which is a good sign. You can sit at a table or at the bar. I definitely would recommend sitting at the bar that overlooks the grill. You can then appreciate the detail involved in making the okonomiyaki and other dishes. The menu is a mix of standard izakaya fare (karaage, takoyaki), plus some less traditional items (guacamole, caesar salad). Don't forget to check out their daily food and drink specials.   Cocktails are cheap at $6-8. My melon-chan (juice, calpico, soda) was sweet and tasty. As for the food, highlights for me were: -Maguro - seared tuna sashimi with ponzu jelly and some radish on the side. Melts in your mouth... - Okonomiyaki - lots of stuff and magically it holds together! I love that they do it Hiroshima style (with noodles on the bottom). Very flavourful and filling.  - Grilled rosemary marinated chicken - simple, but well-executed and juicy - French toast - seems like an odd choice, but this was absolutely delicious!! It's 3 small pieces with honey and vanilla ice cream.   I hope this place does well! I will definitely be back to try other menu items. One downside mentioned by someone else, the place is chilly... Not sure if they are having a problem with their heating because they had some space heaters around and it was still cold!"}
{"text":"I recently attended a dinner Event at the venue with a dining out social Group.  I ordered boiled pork salad and Seafood Yakisoba (also w/fried egg noodles); I found both quite delicious and great values considering the portions. The venue was at once very similar to Guu in layout and 'visual ambiance' and far removed from that venue in lacking it's boisterous atmosphere. Due to the sentiments during and after the Event from others who attended regarding their menu choices, I'd likely either stick to my same choices or try to have similar offerings if I made a return visit."}
{"text":"My old roommate has a Japanese friend that used to live in the neighbourhood, and I asked him if he had had any good Japanese food since he's lived in Canada.  He said that Teppan Kenta had the best, authentic that he had tried, so I kept it in mind for my next visit to Toronto.  Instantly loved the hip decor, and attentive, friendly service.  I'm accustomed to the all-you-can-eat sushi joints, so I was looking forward to having new types of Japanese food.  As my old roomie lived in Japan for year, I put my complete trust in her to order for us.  We had the Ebi Cheese to start (shrimp, potato and melba toast tossed in a cheese sauce), followed by the Karaage (fried chicken) and DX Okonomiyaki (pancake with cabbage and seafood).  All delicious and unique.    Few tips for you: The entrance of the restaurant is actually behind Wellesley, towards Phipps Street.  While the food was very good, I was jonesing for a more savoury or spicy flavour, but it's not actually a trait of Japanese cuisine, so if you've never explored Japanese food beyond spicy tuna roll, just a heads up.    Oh, and make sure you sit at the bar to watch your food being prepared!"}
{"text":"A quieter izakaya in town tucked away in an even quieter corner in the city! Great place to chat over good food.  Would highly recommend their okononiyaki--it's loaded with what you'd expect PLUS noodles on top. I would order this dish again when I get the chance to come back!  1 pint of beer + karaage combo was a great option as well! Though this could be a promotional offering.  The service was good--as expected. Made some mistakes on our final bill but that was no biggie.  Would def. come back."}
{"text":"I am very pleased to see the lunch menu is expanding. Now, some of my favourite items such as Karaage don, Katsudon, Karaage chicken, Takoyaki (octopus balls), deep fried Chicken wings, Chicken Doria (rice gratin with chicken) are on the regular menu.   The chef will always surprise you with the \"Today's Don\". Just ask when you get there.   Now Teppan Kenta becomes my regular lunch spot every week. That's clear enough how I love this place!"}
{"text":"4.5*  It's seldom that I am encouraged to write a review within a week of visiting an establishment, but Teppan Kenta has done enough to inspire this rare event.   Ever since trying my first okonomiyaki in NYC some 6 years ago, I have been on a quest to replicate the complex, delicious taste. The hastily prepared Osaka style Okono is readily found in several of the well known Toronto Izakayas, but Teppan Kenta is the only spot that serves the Hiroshima style (to my knowledge). The process of making this dish is quite long and somewhat laborious, but you are invited to watch exactly what goes into your meal if you take a seat by the bar. The layers of cabbage, egg, crepe, scallion, fish flake, noodles, Okonomiyaki sauce,.... are expertly and patiently assembled only to be devoured in a matter of minutes. The only question that remains is whether you will try to micro-disect the layers/flavours or get as many ingredients as possible in one bite.  The restaurant did feel a bit cold, but this was somewhat made up for by the fact that my cup of tea was never left empty during our entire visit. Outside of the okonomiyaki, the ricotta/plum tart was also delicious and worth a try.   Overall, credit to a good friend who pointed me to this spot. I have a new go-to place in an area that is otherwise somewhat of a culinary vacuum."}
{"text":"Oh man this place was really hard to find! Turns out that it was tucked at the end of an alley, at the back of the building that also houses Rabba and Ali Baba's... Who decided that it was a good idea to open a restaurant here...?  As for the actual restaurant, the food seemed pretty authentic (there were a lot of Japanese patrons -  I take that to be a good sign). I enjoyed the tako wasabi, okonomiyaki and French toast dessert (which was very popular that night). Just a warning that the tako wasabi has a fair bit of wasabi in it. I also ordered the ramen salad which was a little too bland since the sesame dressing really didn't add much flavour.   All in all a pretty solid Japanese joint. I recommend sitting by the bar area if you want to watch the chefs cook teppanyaki-style."}
{"text":"Service is very good although a little slow (but I am not complaining since its reasonable for such a crowded place). Their french toast with ice cream dessert is both pretty to look at and yummy to devour :)."}
{"text":"I'm glad some real Japanese places are getting in the game now hopefully displacing the Ayce \"Japanese food\" imposters and like.  The food was a bit on the pricey side and I would say a touch heavy handed with the salt. Otherwise though I thought it was excellent in terms of authenticity, variety, and service. I think the salty is supposed to compliment/encourage drinking more as this looks to be izakaya-style.  I loved the beef yukke tartare."}
{"text":"I really wanted to like Teppan Kenta, but there were too many problems to make it enjoyable. Compared to other izakayas, this is above average. But when you put it next to other Japanese restaurants, the cooking is not good enough.  On the bright side: + Staff are nice. + You can sit at the counter and watch the cooking. + Quieter (yet still lively) atmosphere.  However: - The food was mediocre (more details below). - Hostess got our order wrong. Then chef misunderstood another part of the order.   My friend and I went on a Sunday afternoon, and ordered:  1. Two okonomiyaki DX, one for each of us. When we realized the chef only prepared a single one on the griddle, we had to ask if they were making 1 or 2. The hostess knew we ordered 2, but the chef thought it was only 1. As for the taste, there isn't any. There is a total lack of flavour. Yes, the chef did squeeze some okonomi sauce on it, but it tasted like unseasoned stewed cabbage and boiled pasta.   (Side note: the Osaka-style okonomiyaki at Ramen Isshin is a lot more flavourful.)  2. Takoyaki. Very below average, and over-priced. They just re-fry frozen takoyaki, in the same frier as all the other food. If you thought they would use a takoyaki grill and cook it, you'd be disappointed.  3. Chicken Karaage. Not bad. At least for this, they bread the raw chicken on the spot, so this is freshly cooked. Comes served with a small portion of salad and squirt of mayo.  So overall, the food was below expectation.   As for the mistakes in ordering:  1. Beer that I didn't order. Only my friend ordered an Asahi, but the hostess thought I also wanted one. After I explained to her I didn't order any beer, she took it back with no problem.   2. Water. I thought the hostess would bring me a glass of water after I told her I didn't order beer, but no. I had to ask her for some water before I got any.  (Ironically, after we paid and were ready to leave, another hostess came around the filled both our glasses just as we were about to get up...)  3. One instead of two okonomiyaki, as mentioned above.  4. Asking for the bill. When we finished eating, we told the hostess \"We're finished.\" She smiled and nodded, but didn't bring us the bill. So I rephrased, \"We are ready for the bill.\" This time, she said, \"Ahh yes.\" But still didn't bring us the bill. We tried another few times, until the Chef actually helped tell the hostess to bring us the bill.   The staff was super nice, but just keep in mind there may be language barriers. So if you go to Teppan Kenta, you should learn some basic Japanese to help it along.  At a price of $22.60 after tax for me, and $28.30 for my friend, this was not worth the money when I consider the food quality and ordering mistakes.   I will not be returning, but that being said, this can still be a great spot for those who value the izakaya atmosphere more than the quality of the food. (and definitely, this is still much better than Guu.)"}
