{"text":"I liked this place but didn't love it. The decor felt exactly like a typical restaurant anywhere in Mexico. It was pretty empty on a weekday night and there was only one server working but she was great. Friendly, efficient, and she pronounced all the dishes properly which impressed me. 

The food was good but lacked a bit of flavour and I didn't like that you had to pay extra for salsas. My wife had pozole which tasted pretty authentic however we would have preferred tostadas instead of totopos to have with it, and it was missing the standard garnishes of shredded lettuce, radish, and chopped onion. We even had to ask for a slice of lime (which the server graciously provided but one shouldn't have to ASK for lime when ordering pozole). I had the taquitos which were fine but bland. I would have liked to have had some fresh salsa to put on them. 

Perhaps I would go back if I were in the neighbourhood and Ravi Soups was closed but it wouldn't be my first choice."}
{"text":"Went over with my friends for lunch and honestly they can improve the service a little. We were 3 guys ordered our drinks immediately.My friend ordered a 'Michelata' - our server did not know what that is so my friend explained it, I just went with water.

My friend got his drink promptly but my water did not come till food was served to us. Another thing which I did not enjoy was that the dish named 'warm chips with salsa' were not warm. I cannot comment on the food much because I'm not well versed with how mex food should taste like so I'll give my pork archiote a ok ok dish.

I think there was just one server there and the place was buzzing with people. Maybe adding another server will help everyone - customers, servers and the restaurant."}
{"text":"I can't believe, in this yelp crowd, no one has reviewed this place. It's a place for drinking, getting rowdy, and I'm not sure one would try the food - I haven't. 
I hear it actually isn't that bad food, but that's not really why you go here. It's mainly because it's a personable place, with generally good staff, who will serve you reasonable priced beers, and you can have fun. It's not a bad place to meet people too, because it's small and people end up talking table to table."}
{"text":"I have to stop giving this place another chance. 

If Burrito Boyz had a liquor licence, I'd never stop here, but I was craving both a beer and some Mexican chow, so a group of us popped in here post-Bills game. 

As everyone has noted, the decor is great, but that's a very, very small part of what I want out of restaurant when I'm thirsty and very hungry. 

Sure, the sign outside said buckets of Coronas, but what it didn't say was that the beer was still $5 a bottle. And, sure, you get to keep the bucket, but how many of these f'n things do I need? Shame on me. 

The place was packed and there was only a single woman working (her butt off, I might add) the bar and the tables. She did a great job for the amount of people in the restaurant, don't get me wrong, but they should have staffed up. Shame on you, Tequila Sunrise. 

The food, once again, was a disappointment. My nacho soup tasted like a bowl of warmed up salsa and nothing else. My friend's burrito plate was really bland - they same experience I had last time. Shame on you again, Tequila Sunrise. 

Tequila Sunrise == Tequila Hangover. 

Next time, I'm packing a flask and having that halibut burrito I should have had in the first place."}
{"text":"So here goes, my first Yelp review and I'm doing it  for Tequila Sunrise. 

I'm here at least once a week, sometimes twice. I'm not really gonna comment on the food, I've had the food here several times and it's mediocre at best. It's definitely not a place you would come to eat. if you do, I would keep things simple, like a plate of nachos. 

That being said, you may ask why I keep coming back. Usually I'm here on Tuesday or Thursday nights after 10pm. It's Karaoke night in the joint and Jason Rolland is the host. He has pretty much the best and largest selection of songs in the city. Simply amazing. 

As for the venue I also suggest getting a drink or two. The bar staff is super friendly, and you can get extra large bottles of beer or personal pitchers of mixed drinks (bar rail) for $10. 

If you love karaoke like I do, this is the place to be."}
{"text":"I was very skeptical to give this place a try. I'm from California  so I have pretty high expectations when it comes to Mexican food. Regardless, a coworker and I decided to give it a try.

The first thing I noticed was that this place was empty. Not a good sign for  a restaurant in my opinion. No matter, it was early in the evening anyway. 

I decided to order a steak burrito and some margaritas. The margaritas were pretty decent. The waitress, while nice, seemed stressed even though the place was empty. 

One thing that irks is when Mexican restaurants don't give chips and salsa as an appetizer. Maybe it's just me but I feel like it's a necessity at any Mexican place. It would've really helped at this place because it took FOREVER for the food to come out. With no one else to serve, I expected my food to come out relatively quickly but we ended up waiting about 20 minutes for our food.

BUT WAIT. Before you pass judgment there is an explanation for why the food took so long. You see, it takes some time to successfully burn the crap out of beef. The rice and beans that were served with it were tasteless and there was virtually no salsa on the plate. 

So to sum it up, this place sucked. However, if overpaying for gross mexican food is your thing, this is the place for you!"}
{"text":"It was 5 degrees outside. We were cold, hungry, and thirsty. Wandering around the city we found this place randomly. It was pretty empty that night. The food was ok, little cold, but anything at that point tasted good.

The real winner were the drinks. They were cold (like everything else really) and cheap. In this city, I was happy to find something that wasn't ridiculously overpriced.

Probably a good place for happy hour."}
{"text":"I'm reviewing on the food....not on the karaoke, which after reading these reviews I will most certainly go back for!

I had the combination plate with the potato and cheese taquito and the chicken enchiladas with green sauce.  I will say the enchiladas were not bad, but they were actually more like tacos covered in green sauce, because they were just folder over not rolled.  The taquitos were disguisting-  They were mostly potato and the shell was thick and there was no flavor.

So if you are looking for Mexican food in Toronto-  do not go here!"}
{"text":"First of all, I have never written a review on Yelp or any other restaurant and went through the trouble to sign up here just to share my thoughts about Tequila Sunrise. My friends and I were looking for some good mexican food in the area where we work and decided to try this place out. The outside and interior looked cool enough. But alas, you can't judge a book by its cover.

Our table of three was the only customers in the place, but for some reason, our food took over 40 minutes to get to us. The poor waitress (who was the only good thing about the place) felt terrible and at least brought us some chips and salsa after waiting 30 minutes. Of course having been to MANY mexican restaurants in my days, there are a few things I expect:

1. Chips and salsa first thing, and of course, complimentary

2. the food to come out INSANELY fast.... how long can it really take to make a salad? 

3. there would be at least a few mexican employees in the place

If you are the owner of this place, you should consider what your staff is doing at all times. Judging from the other reviews here, I take it that most of your business comes from karaoke late-night party people and not necessarily diners. If you took more care into these other aspects.... or at least a decent margherita (the worst one i have ever had, by the way), you might gain more customer flow and actually have a better business that makes more profit. I would know. My family owns many many restaurants."}
{"text":"I have been to this bar many many times, including this past new years eve... which was an awesome party.

However it's not the bar that keeps brining me back it's the karaoke DJ on Tuesday and Thursday nights, Jason Rolland.

Although this bar is small, this is a fantastic place to do karaoke.  Jason is extremely funny and entertaining, and it has a nice set-up for singers to interact with the audience.

As for the food, I'm a huge fan of Mexican and Tex-Mex cuisine, and this place is average to below average... 

The $10 lil-pitcher of basic bar mixers (rum-coke, gin-tonic), but I find the pitchers of beer a little more pricey than they should be, but that's probably dictated by the fact this place is located on the border of the club district in Toronto.

Regardless, it's a definite stop for me on Tuesday and.or Thursday nights."}
{"text":"The decor of the place is really the only reason I might come back here. The menu's are wooden and they use those hand-made carpets as table covers, it all looks very 'I-just-stepped-into-a-Mexican-Ranch' like. 

The food was blase. My mother ordered the \"vegetarian\" quesidilla and there was beef in it...? I ordered the taco salad and felt my insides churning as they tried to work through the gallons of sour cream they had drenched it in. 

The server was alright. I think she thought she was a lot more efficient than she actually was, which bothered me. When someone orders 'vegetarian' you might want to inquire whether or not they can eat beef... 

Ordered a coffee at the end, you know, to try and wash down the mistakenly biten beef bit and the incessant flavour of sour cream, and it was very hot, and very tasteless. 

It's a convienient location, so if you are down town and are under some form of influence that diminishes your sense of taste, than you are good to go! Drop by!"}
{"text":"It's very fitting that I'm reviewing this place as my first. I LOVE this place! For two reasons, really -- the karaoke and the employees.

Tequila Sunrise is lucky to have the king of Toronto karaoke, Jason Rolland, DJ every Tuesday and Thursday. It's a really fun party and everyone who goes really tries to interact with everyone there and make sure a good time is had by all.

The staff is incredible. I always try to learn the names of the employees at restaurants and bars I go to, but this is probably the first place where the staff learned my name first. I lost my wallet and they stopped what they were doing to help me out. They dance with you and one of the employees added me as a friend on Facebook. I super feel like a member of the Tequila Sunrise family : )

Drinks are pretty cheap. Ten beans for giant bottles of ol' Mozzer's favourite beer (Corona) or big, individual-sized pitchers of bar rails.

Not the best Mexican food I've ever had, but if you're in for a fun night with food, drinks, ridiculous dancing and singing, the combo is the best."}
