{"text":"I Loooove this place.  I am there pretty much every week-day for lunch.  Lunch specials are good.  Soup of the day is always good. I have had pretty much everything on the menu and not one bad meal!  I love the owner Nancy.  She has an extremely nice and outgoing personality yet you know she cares very much about the quality of service and food.  The waitress/bartenders that are there on a normal basis are all friendly. 5 out of 5 for sure!"}
{"text":"Total hidden gem here, people. Cheap drinks. Good bar food. And weekly live music. We've had a group of four eat and drink there all night for under $50. All night. And there's no skimping on the drinks. Ignore what you think you know about the area and give it a try (especially if Todd Jones or the Good Guys are playing there on a Friday night)."}
{"text":"Portions are large, prices are low. I had to wait a bit before being seated but it was a slow time.
Try the \"chicken and peppers\" appetizer, great!"}
{"text":"Had to take my previous rating down a notch after dinning here this evening. Had the the Thursday night special, the NY Strip Dinner. For $10.95 it's a steal if you like your steak medium rare. It comes with a baked potato, canned green beans and a side salad. 

Unfortunately I like my steak well done with no pink in the middle. Pink in the middle, to me, just seems like chomping on uncooked flesh and it just grosses me out. I thought that's why it took so long to come out of the kitchen but after 40 minutes from placing the order, the steak was mostly red in the middle. I tried to be kind and eat as much as I could but half way through I just couldn't do it any more. 

Memo to self: grill your steaks at home and get the chicken when ordering out."}
{"text":"Deep in the heart of nowhere there sits a small restaurant known as Terrace Gardens. For most in the area, this place is a daily visit, why you ask? Let me tell you.

Due to work related events I found myself at this Restaurant everyday for a week. By day 3 the waitress asked me for my order by name and no I never mentioned it, she spotted it on previous receipts. That's what I like to call...awesome. 

The foot portion sizes were truly American and by that I mean if you wanted to kill someone by throwing their body into a river and needed a weight to tie to their feet...you could use these portions...they were homicidal big.

The service was quick and the food was oh so inexpensive. If you wanted to make sure most of the American iconic forefathers didn't pull a muscle you could bring them here because it's sure to make your money stretch a long way. 

There is an attached bar but I was never able to check it out since well...I wanted to keep my job. All in all, it's a great place to check out if you are ever in the area. If Terrace Gardens was an actual garden, the only thing it could really grow is customer satisfaction...and maybe...split peas."}
