{"text":"Awesome burgers. But no high chairs? Why would you have booster seats and not high chairs? Get some and families will come at your slow times!"}
{"text":"I thought that the food was fair however the waitress was very slow or had to many table.  it was a Monday I didn't think it was that busy."}
{"text":"Very good.  I got the barbecue burger with mild sauce.  Would probably go for hot sauce next time since mild was not spicy at all.  The toppings are nothing special, but the meat itself was cooked well and, for lack of a better term, meaty.  I was hungry and this really hit the spot.  I don't normally go for potato salad, but ordered it based off another review.  It was great!  I even could've eaten a little more than was on the plate.  I also liked the decor/environment -- very homey."}
{"text":"The only reason to give this place 5 stars us because I could not add a 6th. Quite simply if God created a perfect hamburger it would be almost as good as tessaro's. For starters I loved the charm of this place and my date did as well. Just a side note she is never pleased. The decor is comfortable and eclectic. The smells are heavenly. The service fantastic. Now for the good stuff. We started with the saute mushrooms and all I can say is wow. These might be one of the top 10 appetizers I ever at with no exaggeration. You must try them. Now for the huge succulent slice of heaven called a burger. I can say without reservation there is no way it could be bested. This perfectly charred hunk of meaty goodness should be on everyone's bucket list. Try this place or you have missed a great experience."}
{"text":"Despite the onslaught of gourmet burger places popping up everywhere, I still rank Tessaro's as the best burger in Pittsburgh. They are always busy but the friendly staff will get those in line a seat as rapidly as possible and I rarely wait for a seat for more than 5-10 minutes. Their outdoor patio is also a fairly new addition that is very nice in the summer months."}
{"text":"Delicious burgers- freshly ground beef and hand-shaped and cooked on a wood-fired grill- amazing. The burgers arrive and look enormous, but are so good, before you know it, your plate is empty. Only downside is it can get very busy and you'll have a long wait outdoors."}
{"text":"Ate here  for a late lunch.  Thought it was a restaurant, but it was more of a Bar/Grill.  The ribs (offered only on Thursday) were \"out of this world\" and potato salad was one of the best I have ever eaten.  A little disappointed that they didn't offer any type of desserts, but I guess that is because of the bar scene and not a restaurant thing. A little difficult to see their sign from the road, I am guessing, due to the full tree in front of it.  Prices were about standard for the amount of food served, and  the atmosphere was OK , would definitely eat there again."}
{"text":"4 of us came here for dinner and ordered burgers and drinks. The pino Grigio tasted bitter and when we complained the waitress acted like we were bothering her by saying anything and kept trying to walk away. She only came to our table 2 times when we were there over two hours.   Bad customer service and to be honest we had bad service all around."}
{"text":"This was my first and last time at this restaurant. I thought Tessaro's was some sort of Pittsburgh landmark and I've heard rave reviews of their burgers. The burger I got was undercooked. I ordered it well done and it was definitely pink in the middle. But I didn't send it back because I never send anything back. I just ate it and it was a sloppy, greasy mess. The bread was cheap and tasteless. The home fries were just diced potatoes. That burger sat clogged in my stomach for 3 or 4 hours. And I had to make a few runs to the bathroom because I thought I was going to make a mess in my pants. Burger king is a lot better than this place and at a fraction of the cost. What else you got Pittsburgh? This better not be the best you got."}
{"text":"I've had better burgers at several other Pittsburgh restaurants. I have never eaten anything else on the Tessaro menu--and since it doesn't look very appealing, it's not likely that I will--but the burgers are just OK. The service, in my opinion, is often quite rude. The \"ambiance\" is loud, dark, dingy and depressing. Sorry, but I just don't get it. For a better hamburger, try the Sharp Edge Beer Emporium, Murray Avenue Grill, or even Five Guys Burgers and Fries."}
{"text":"Was really excited to try this out.   Came at lunch in a Tuesday. Didn't wait long to be seated. But waited over 45 minutes for them to take our order. Including Drinks!!!!  Waitresses were overwhelmed and avoided us. Owner was apologetic but didn't offer to do anything for us We had 5 kids with us and my youngest at one point asked for some chips she was so hungry (hadn't placed orders yet) and she didn't even do that.  Food was good but not at all worth the wait.  lack concern makes me wonder if we will be back."}
{"text":"So everyone always raves about this place infamous burger joint in bloomfield, so I had to try it...and I should just have listened to my capricorn perfectionist gf because she was right when she said it is overrated. We both got burgers...I got the bbq and she got the bleu. The burgers tasted like one part oxygen and 1 part hydrogen. At least the soup was good...and our waitress didnt know how to properly place the salt n pepper shakers....salt on the right(for the blind).... Another negative about this place is that people sit so close to you, just like mad mex. It takes away your privacy, I wanted to talk about baby fetuses but couldnt"}
{"text":"Excellent burgers in a no frills classic Pittsburgh atmosphere. The burgers are a great mix of fat and lean beef, with a nice variety of toppings. I've never had a bad burger from here. They have home fries instead of French fries which is kind of a departure from the standard but that's ok.  This is a great place to spot second rate local celebrities."}
{"text":"Amazing burgers!  Just moved to Pittsburgh and thought I had \"the best burger in town\"  ---  I was wrong!  Just had the plain ole cheeseburger w homefries and it was delish!  I will be back very soon!    Also had a decent draft selection :-)"}
{"text":"You can't go to Bloomfield without going to Tessaro's. Consistently good food here. I love their chicken sandwiches!"}
{"text":"Would be a great place to bring the kids if they had ANYTHING on the menu for them! I'm not talking about an entirely separate menu, but a burger smaller than my head would make this a much more viable option for feeding the family."}
{"text":"Yum! If you want a great burger, this is the place to go. Burgers were huge and delicious plus the service was great. Only downside was ordering a tequila sunrise and getting what tasted like a full glass of tequila with a drop of grenadine. Great food though!"}
{"text":"We were in Pittsburgh for a wedding and saw this place had amazing reviews so we decided to give it a try. The tables are very close together so having a conversation feels awkward because you are sitting right next to strangers. We both ordered a cheeseburger, medium and medium well. Mine come out medium rare and my partner's came out well done. The burgers were not seasoned. I got roasted red potatoes and my partner got rice. The potatoes were not seasoned and came with melted butter, which tasted and looked like oil. The rice was soggy and also unseasoned. The decor surprised me because it is very casual and cheap looking (denim tablecloths) but the way the restaurant is described makes it sound more like a fun pub/ grill joint. They do have a full bar, but no drink menu. So if you are seated in the back like we were, you have to ask your server if they have this or that and you do not know what the price of anything will be. Our waitress was wonderful--helpful and friendly. Overall, I would not recommend this place, and encourage guests/ visitors to eat elsewhere."}
{"text":"Their burgers may not be the fanciest or trendiest in town, but they are consistently big and delicious. Their portions are enormous. Their soup , steak salad and rice are all excellent as well. They have a surcharge for takeout which is annoying. And the staff are usually run so ragged because they're always slammed with a full house that you don't always get the happiest attention, but they're generally friendly enough and get the job down."}
{"text":"Putting lamb in your burger is not my idea of 'gourmet' burger. Sure it tastes unique, but there are better ways to skin the cat. Good, but after a couple of times I got VERY tired of the 'unique flavor' of their meat."}
{"text":"This place is pretty amazing when it comes to having a perfectly made to order burger. I enjoy a classic cheeseburger with their home fries & would have typically rated this a solid 4, but the slight inconsistency on our second visit opted out for a 3 instead. The home fries served were way over cooked with half of its serving being burnt & drinks were a little flat. On a plus side- the meats are cooked exactly how you request it to be. Great selections of drinks for their \"small town laid back bar\" ambiance & the workers are very friendly."}
{"text":"Over-rated when it comes to the burgers. I've had way better. Staff was friendly and drinks were reasonable but nothing to rave about."}
{"text":"Love it here.  The best burger anywhere.  Great people from top to bottom.  If you haven't been here, go tonight.  Old School Cool"}
{"text":"Tessaro's is a wonderful, warm restaurant with great burgers, and a nice ambiance.  The bartenders were friendly and the waitstaff was prompt and attentive.  Recommended for a nice date night or just stopping in for a nice meal!"}
{"text":"Not bad, not bad.  My fiancee and I went here to try out their well-known burgers, and I must say, it was delicious. Yes, I am one of \"those people\" who orders my burger well done, and my burger was almost well done, but not quite. So maybe if you also like your burger well done, emphasize or say \"extra well done\" or something. It wasn't mooing enough to the point that I wouldn't eat it. Also, our food came out literally 5 minutes after we ordered. I don't know how they did it, it was packed inside, but they did!  The people were so friendly. We were greeted and seated promptly, and our server was very sincere and nice. As we left, we were thanked for choosing their restaurant  Defiantly would come back."}
{"text":"Tessaro's definitely lives up to its outstanding reputation.  The burgers and beer were as outstanding as the service.  Great atmosphere.  Hard to go wrong eating here.  It is one of those places you will enjoy working through the menu to try the various dishes."}
{"text":"We were met by the co-owner at the door and were welcomed!  We ordered two orders of 1/2 and 1/2 bed and pork ribs.  One order came properly and one all ports.  The problem was rectified quickly with 2 additional ribs.    Boy, were they great!  We were given the wrong check when ready to depart.  The food was worthy of 4 stars, but I choose to ding them 1/2 star each for the order gaffs."}
{"text":"Tessaro's is one thing: Pittsburgh.  In what I consider to be the most classic of Pittsburgh neighborhoods at the current time, Bloomfield, this is a landmark.  The staff oozes old-school Pittsburgh.  The decorations are nothing special.  The clientele ranges from high-class businessman to the stoner down the street to mom and pop out for Friday dinner.  And all those people are typically there for one thing: the burgers.  I agree with the other reviews that tout this place as having the best burgers in Pittsburgh.  The only complaint that I have is that I reek of garlic and spices for the next 2 days after eating there- the food is that intense.  Also- it isn't necessarily worth it to get one of their more specialty burgers (cheese, bacon, etc)- the meat itself should get the job done.  If you want a good microcosm of Pittsburgh and a great burger- this is your place."}
{"text":"A friend of mine took me here claiming they had the best hamburgers he had ever eaten. The burger I had was really good, but what caught my eye was everything else (especially the filet mignon) that was coming out of the kitchen. Every dish looked better than the last. The bar has a good selection of beers and the bartender knew how to make mixed drinks above the level of rum and coke. If you haven't been here yet than you're missing out."}
{"text":"Lived up to its reputation. Burger great. Home fries tasty.  Plus great local chit chat at nearby tables!"}
{"text":"Easily one of the most over-rated restaurants in the city. Am I the only one who thinks the burgers taste vaguely of kerosene instead of mesquite? All salads and side dishes a disappointment. On the plus side, a very cute place with warm, friendly service."}
{"text":"Best burger I have ever had in my life.  Ok, so people say that any diner burger, bar burger, or in general restaurant style fat burger is the same.  But this is just different.  I can't come here too often otherwise it will ruin the experience for me.  I come here about once a month to relive the experience of my first time ever eating this burger.  One of THE places to take your friends out to eat if they are new to Pittsburgh.  Service is spotty but I'll still give it 5 stars.  Sometimes when they're really busy waitresses seem irritated, but I've been there enough times to know that they are very friendly in general.  When I say busy I mean the place is packed and the bar is full and people are standing up at the bar waiting for a seat.  This was during the NFL playoffs so it was understandable."}
{"text":"Ordered my usual Roberta salad. It's that hidden item on the menu that you have to know about.   It's a salad with rotini pasta that has been grilled. Broccoli and cauliflower and grilled onions and mushrooms. All topped with a steak or chicken. I usually go for a med rare steak.   You can get a small or large. My only complaint was that the veggies were too oily. I'll have to make sure to ask for steamed veggies with no oil.   Other than that my wife had the exact same meal.   Service is always good and friendly. And the new deck is going to be my regular spot!!"}
{"text":"Tessaro's is my favorite burger spot in the city.  The bacon blue burger is my normal choice, but I have been known to spring for the bbq burger; both are fantastic.  I order my burger cooked med well at most places, but at Tessaro's I order it medium (oh it's so good to be bad). All of the ingredients used at Tessaro's are fresh and of superior quality.  My favorite thing about the burgers here are that they arent soaked in grease, which is more than I can say for some other places in the city.   Do I think that Tessaro's has reinvented the burger? No.  Do I think that if you go to Tessaro's you'll have a fantastic burger and want to come back? Yes."}
{"text":"My first Pittsburgh review!  Believe the hype about Tessaro's; I can't recall eating a better burger than the one I had there last night.  A half-pound of quality beef, crisp bacon, bleu cheese, grilled mushrooms and onions, all served on a fresh-baked bun....well worth $9.50 and the month that mother probably took off my life.  I was also impressed that they actually cooked it to my specification; when I order a rare burger at most places, I usually get medium at best.  Good beers on tap, too.  Tessaro's figures to be a regular destination for me while I'm in the 'burgh."}
{"text":"Great burrger, but ask for rare if you like it bloody service was excellent .  Only downfall was the small menu."}
{"text":"We have friends who moved to California from Pittsburgh, and when they come to visit, they always want to go to Tessaros. We're happy to oblige. I'd say to stick with one of the burger or meat entrees, which are pretty dang good. When we went for lunch av few weeks ago, I had a  chicken salad, which was surprisingly boring,  and our sides of fries (which were really just homefries) were cold. No prob because it was early, so the kitchen probably wasn't fully fired up yet. My friends got burgers, and they raved about them.  The wait staff members are awesome! Tough parking. Pretty great otherwise."}
{"text":"I have to agree with all the other yelpers, this is a GREAT burger. After reading all the great  yelp reviews,  I took my family, including my out of town mom, for lunch on a Saturday and was not disappointed. I knew from the smell outside of the building that it was gonna be fantastic eats. We were happy with the service also. We had a party of six and did not have to wait. We will go back again and again and again..."}
{"text":"Fast service and excellent food. I had the kelly burger. It was awesome. It was busy, but only waited 5 mins for a table."}
{"text":"Just crushed another Bacon Bleu Burger. Md Rare with sautéed mushrooms. OMG this place is firing on all cylinders. I've been coming here for 20 years,  And They Are Still THE Best."}
{"text":"High marks for location and ambiance, Tessaro's is a staple of Liberty Ave for several decades. They have expanded the interior to accommodate increasing popularity over the years and every room has a different old world Italian feel. The service was fantastic and friendly.  However, the burgers, which were advertised as one of the best in town, were overly disappointing. Not only were they without juice, but devoid of flavor. Bleu cheese and BBQ couldn't make up for the lackluster meat.   I want to give Tessaro's another chance so we will be back, but first experience wasn't up to snuff."}
{"text":"A Pittsburgh classic. Short and sweet here. Steal Sandwich is delicious, have a couple of great memories here with some people I really care about from this city. That's what makes the experience that much better on another level. Going backwards, the chili may be my favorite beating anywhere in AMERICA I can remember. By no means am I a world traveler, but boy I have had many bowls of chili and I always aspire places to match Tessaro's, but I haven't seen it yet."}
{"text":"Best steak burgers and ribs this is one of my favorite places to eat in bloomfield.I am very lucky to live with in walking distance,but people come from all over to eat here.Everyone always agrees that it was worth the trip."}
{"text":"Pretty righteous burgers, but they are their own thing.  There are burgers and then there are Tessaro's burgers.  Sometimes I want a burger and fries.  But other times a Tessaro's burger that's big and a little pink in the middle is right on.  Bacon & Bleu all the way."}
{"text":"After hearing all of the hype about how great Tessaro's burgers were, I must say I was really disappointed. I ordered a burger done medium well, and not only was it unevenly cooked (the pink center was not in the center- it was as if my burger had been half cooked), but the outside of my medium well burger was charred. Yuck. My boyfriend and I left pretty underwhelmed- next time, we'll make burgers at home."}
{"text":"Facts: I am not a big meat eater.  I am not a vegan, vegetarian or any combo.  I like good food that is somewhat healthy and sustainable.    All that being said, I have searching a place that serves great burgers.  I hardly ever order an entree that focuses on meat and it is even more rare that I order a burger.  So I read lots of reviews about Tessaro's.  I expected a dive with somewhat gruff service.  Uh, no, Tessaro's is a tin ceiling, hardwood walled, hand painted mural delight.  And the service was tremendous.  Yes it was a Thursday and no the place was overflowing with hungry people but there was a steady flow of diners.  I must mention that many complained in their reviews about not being seated until all of party was there...uh, yeah! That makes sense to me.  No use taking up a table with a partial party who is \"faffing.\" (Google term if confused)    I had a medium rare burger with lettuce, tomato, pickles and relish and Dijon on the side with steamed broccoli and cauliflower.  My handsome dinner partner had a medium creamy bleu cheese burger and home fries.  The beef was good!!  This means a lot coming from me a non-meat eater.  The wood fire grill gave a super flavor and both burgers were cooked perfectly to temperature.  My veggies were freshly steamed and looked like veggies, not a mush of frozen overcooked goop.  Mr. Handsome devoured his burger and home fries. Evidence of more satisfaction.  Oh we split a small spinach salad to start.  Our waitress-who I should mention again was great-had the kitchen divide it on two plates.  Will be recommending Tessaro's to others and I have found my once-maybe twice-a-year burger joint!  PS there are options for non-meat eaters:)"}
{"text":"Amazeballs. Seated in less than ten minutes at prime time on a Saturday night. Burgers are the best I've had by far. It also happened to be our waitress's 70 th BIRTHDAY!!! Not only was she a great waitress, but she ran circles around the younger wait staff... Thank you, and happy birthday Angie, you're AWESOME."}
{"text":"Never been treated so poorly  I went with three friends to eat at Tessaro's on a rainy Saturday evening.  I dropped them off while I parked the car.  The hostess  sat them and when she found out I was parking the car, she told them literally to \"GET UP.\"  She said they wouldn't seat them because I wasn't there.  By that time I had arrived at the table  my friends were still in shock by the utter rudeness.  Tessaro's was a Pittsburgh institution that my family had frequented for years.  Our treatment is a disgrace to its reputation"}
{"text":"I came here on a Friday night and was seated in the back. The service was good and the waitress was really friendly. I had a cheese burger with their home fries. Best burger in the Burgh? I don't know. For me, it's good but it cannot beat the one I had  at Umi burger in Palo Alto."}
{"text":"stopped in on a Saturday for lunch . We were greeted and seated right away , not to busy they had just opened. Sat out in the bar room  but it looks like other dining areas in the next room . the place was very well maintained and clean. waitress was friendly and prompt. we both had burgers and potato salad and I must say that was the best burgher I have ever had and I have tried a lot of them . Cooked to perfection fresh and juicy meat. everything was great will be going back soon."}
{"text":"I just don't understand the appeal.  I've tried this place twice thinking that I somehow had a \"lemon\" of a burger the first time.  And then returned a few months later.  Nope.  The smoked flavor is okay and the meat seems fresh, but where the hell is the flavor?  I can go as far as saying that I don't believe that they even season the burger with salt and pepper.  If I closed my eyes, it is possible that I wouldn't even know that it was a hamburger.  That is embarrassing.  Maybe if you're used to eating 99 cent burgers, Sysco \"meat,\" or at chain restaurants, then you would find this to be \"amazing.\"  I've had some of the best burgers at many cities in the US and this is an embarrassment to Pittsburgh.  Go to BRGR if you want a tasty burger near Bloomfield.  On the other end of the spectrum were the sides. The sides were classics, but definitely above average, especially the home fries.  I would consider a 1 star rating if it weren't for them.  Additionally, the place is overly crowded and had a long wait during the weekend. The decor is old school and seems satisfied in it's current state.  Just like the food itself.  File this one under Legacy restaurant still living on it's past accolades."}
{"text":"My boyfriend and I went here for burgers because there are so many good reviews and we heard that they're the best in the 'burgh.  I was disappointed.  I had a bacon cheeseburger and it was okay.  Maybe my expectations are too high, but I don't want a burger that's purely a slab of ground beef with no seasoning or other flavoring in it.  I've had more flavorful burgers at chain restaurants.  I did like the home fries, very yummy!  And an interesting side dish."}
{"text":"Crowded but definitely worth the wait!  The hamburgers were huge and the service was very good.  I would have given Tessaro's 5 stars but I asked for a medium rare burger and I received medium well but I must say, the burger was still juicy!  I plan to go back for a second try on a weeknight when the kitchen is not as busy!"}
{"text":"Good hamburger, though nothing that was so spectacular as to not be missed. They serve the burger with home fries which were very good but not my first choice for potatoes with a burger.     I did not love the bun.  The menu was very deep with more substantial food and I could not help but wonder if that would be a better place to get the best from Tessero's.   The service was great."}
{"text":"I felt very honored to have been taken to this Pittsburgh Cornerstone as it was referred to. The place reminded me of the basement of an Elk's club complete with the paper placemats, uniformed waitresses, no-frills liquor bar, mirrors and of course the loud bunch of dudes at the bar joking about the good ol' days Immediately walking in, felt comfortable and knew that the food was going to be fantastic. It definitely was, had the BBQ chicken with a side of steamed veggies, salad and bread rolls  very simple but also the best kind of meal there is. Meat and carbs done right, lots of butter, lots of potatoes and plenty of salt. The waitress didn't hold her tongue on her opinion of various dishes and upon returning, will definitely try one of these supposed world-famous burgers."}
{"text":"The hostess who claimed to be the owners daughter was rude. They are not family friendly. I think the food was good but over-rated.  The service was disgusting!! Our server held our drinks by the top of the glass and nestled in her arms. The wine glass had a lipstick stain. The table was dirty. We wiped it down with 4 wipes and it was still dirty.  The only good thing was the beer ( why it got 2 stars instead of 1)"}
{"text":"Had to stop by for the \"best burger in the 'Burgh\". Burger was okay but unmemorable and not cracking my top ten list of best burger joints. Good ambiance, service and potato salad. Overall it seemed like over priced okay food. Barbecue sauce was kinda nasty (disappointingly was just jazzed up ketchup)"}
{"text":"The secret in their having one of the best burgers you will ever eat, is in the meat!  They add ground steak including filet mignon!  Another reason why the burger seals in all of those juices plus adds flavor is they are cooked over a 500 degree hardwood grill.  Tessaro's was not hard to find, but in a run down area.  They have a parking lot on the side of the building, connected with a grocery store's lot..  The place is small, with a huge bar in the middle.  It was crowded, but we were lucky enough to get a booth.    I was a bit disappointed in their not having french fries, but I tend to fill up on them, so in a way it allowed me to finish that delicious huge burger!  I hear they are known for their ribs, as well. The murals are hand painted of the owners and workers and an Irishman and his sister own the restaurant and do the cooking.  The soups are homemade as well.  Servers were older and ours was friendly and helpful!  Go and have yourself one of the best burgers you will ever have in your life and add a hot homemade bowl of soup to your check, outstanding!"}
{"text":"Not a better burger anywhere - Galaxy wide.  Long time customer - when I am in the burgh - I quickly head towards Tessaro's!  RIP Kelly."}
{"text":"Best burger anywhere.  A Pittsburgh landmark.  The best hostess -- charming, firendly, makes everyone feel at home and as if you are her only concern.  The burgers are the highest quality meat, cooked to perfection."}
{"text":"I should preface this by saying this wasn't my pick, and not really my kind of place.  That being said, it's a decent conventional style restaurant and not bad for what it is.   I had the kelly burger and it was just extremely massive and greasy.  The boiled red skinned potatoes were pretty much what you'd expect boiled red skinned potatoes to be, and they come with melted butter on the side in case you'd really like to pack an artery.  This is definitely not a meal for anyone worried about TMAO.  I don't want to be too hard on the place because, you know, it is what it is, and for what it is, it's not that bad, not that good, just ok; something like that.    Now, I just wonder how long that burger is going to remain in my gut.  I think I can feel the bacteria burping away in there right about now... Ugh."}
{"text":"First and foremost, I eat beef about once a month if that--so I hope I can critique this place fairly!    When you walk into this place you can smell the smoky, wood-burning smell of the grill, I loved that!  The dining room is dark and definitely original interior, loved that too!  The wait staff was extremely friendly, as well!  Now for the burger:  It was absolutely huge!  When I bit into it I tasted the smokiness of the grill and it was nice and juicy.  The toppings, though, were your standard lettuce, tomato, onion and pickle.  I would have loved to have this burger and the Burgatory toppings!  My 16 year old son finished his burger in no time flat, along with his hashbrowns, that he loved.  My father could not finish the burger, nor his coleslaw side.  I got a nice healthy side of steamed cauliflower and broccoli (like it mattered at this point), and was able to eat 3/4 of the burger and all my veggies!!  My only disappointment regarding the place was that they did not have dessert on the menu!!  My son and I had to walk up to Paddy Cake Bakery so that he could then satisfy his sweet tooth!"}
{"text":"This is going to be short and sweet. It's the best burger in the 'Burgh, hands down! The in-house ground beef is so much better than what those trendy burger bars are offering right now. Tessaro's doesn't need to top their burgers with a bunch of ridiculous toppings as their beef is just that damn good. I don't even want to try anything else there as the burger was the first thing I ever had and I keep getting it every time I go there. The BBQ burger cooked medium is perfection!"}
{"text":"I really want to straddle the line between the \"BEST BURGER OF ALL TIME\" and \"I CAN'T BELIEVE THIS PLACE IS SO OVERRATED\" reviews.  i'm not going to hate on Tessaro's, but it was not the best burger i've ever eaten.  i actually like that this place doesn't offer french fries.  your side options include home fries, slaw, potato salad and a few others.  my burger was good, and they are HUGE.  some places claim to have a half pound burger, but this is the real deal.  but the problem with the size is that the bun doesn't hold up.  i cut my burger down the middle, and but the time i started on the second half, but bottom bun was basically soaked/melted to nothing.  i also was disappointed that my \"cheddar\" was a slice of yellow/white marbled artificialness, but that may not bother some people.  craft beer options were EE Big Hop, SN Pale Ale and Sam Seasonal.  the bill for 6 people including tip came out to $25 per person for a burger and 2 drinks each."}
{"text":"This place is definitely one of the best burger stops in the Pittsburgh area.  The half pound burgers are massive and delicious.     \"When you bite into your first Tessaro's burger it's a fantastic experience.  You can taste the grill history (the proteins of the grilled past.)\""}
{"text":"This review only encompasses my 2-3 experiences with burgers - THE thing Tessaro's is known for. All I can say is - I don't get the hype. If it weren't for the blue cheese and bacon it would have been borderline inedible. There didn't seem to be any seasoning of the meat whatsoever. Bland would be an understatement.   Points for using fresh hand formed beef and consistently preparing it at the requested level of done-ness, but I don't know how the burger here even enter any debate regarding the best burger in the 'Burgh. I'd even say Lot 17 a few doors up has more flavorful burgers - saying nothing of places like Wingharts and Burgatory.  Service is always friendly and prompt - but the food is just...OK. I think this place is just more of a Pittsburgh tradition like the similarly overrated Primanti's."}
{"text":"Cozy, cool place with the best burger in the city. I always stop in when in bloomfield."}
{"text":"I take my former review back, went back several times and the burger meat was excellent when properly cooked, I was wrong.  It is very high quality."}
{"text":"What can I say? Excellent burgers, good prices. Though never, under any circumstances order the chef's salad. However, the steak salad is great.   You will most likely have to wait to get a table. And sometimes they will decide to close randomly. We called ahead and they said they seat the last table at 11:00. We got there with 10 minutes to spare and they refused us saying they had shut down the grill. That was kind of annoying considering we did phone ahead and they don't really take reservations."}
{"text":"Food here is ok but they have huge portions and decent prices.  Service was a little slow Saturday Morning but they were nice.  They also made sure that you burgers were to your liking and didn't assume that I wanted Mayo.  The home fries however weren't as good and tasted like boiled potatoes that were greasy.  But you do have the option of getting Cole slaw,  potato salad or even rice or veggies instead of the home fries.  Overall I would come back if I were in the area and had a big appetite."}
{"text":"Been going here for over 20 years, Bacon blue, dry blue and full dressed.  Hands down. If you know your meats, you will understand this place"}
{"text":"Out of 5: 3.5 - Burger: The first several times I came here, it was terribly overcooked and dry.  Then, all of a sudden, their quality and consistency of cooking went up significantly.  While it lacks in seasoning, getting them to sprinkle on some salt and pepper while they cook it works wonders.   3.0 - Cajun Burger: Now that's some seasoning.  A bit strong and salty but good every once in a while. 1.5 - Home Fries 2.5 - Red Skin Potatoes: glad to see some slightly healthier yet not too healthy side dishes here.  Though with the melted butter... 3.0 - Beef Ribs 0.5 - swordfish: dry and tough 2.5 - tuna  1.5 - Service: Can be quite bad a lot of the times, probably because of how busy they are. 2.0 - Value"}
{"text":"I've been in a burger craze and been trying burgers in a few different States where I see they have won contests.  Tessaro's hands down has the best by far, the gourmet burger is amazing.  One week in August I drove the hour and 15 minutes twice just to eat there"}
{"text":"Huh. Not being from Pittsburgh (just living there for six years), maybe I'm missing what makes it \"a classic.\" I ate here for a bunch of business lunches / dinners (oooh! Let's go to Tessaro's! It's a Pittsburgh Classic!) and was consistently confused. Food = fine. Atmosphere = fine. It's a solid three stars, yo."}
{"text":"What a great find! This is the best burger in Pittsburgh! I had the blue cheese, bacon and cheddar. The service was great, we were seated within a couple minutes at prime dinner time  on Friday night. Food arrived quickly and done as we asked...perfection- good bun, good blue cheese crumbles, tasty bacon and home fries. Great experience and a definite keeper on the \"go to\" list."}
{"text":"I've been going to Tessaro's for years. Every trip back to the 'Burgh wouldn't be complete without a lunch or dinner there. It's my go-to place for meeting friends for a meal when we want something tried and true with no froufrou. And I am never disappointed.   I have heard grumblings for the past couple of years that Tessaro's partially cooks their burgers throughout the day and then finishes cooking them \"to order\" so I asked the waitress if I could have a fresh patty, not pre-cooked. She didn't seem bothered by my request. And honestly, I don't know if I would be able to tell the difference. That being said, it still was the best tasting perfectly cooked burger I have had in a long, long time. With all the new specialty burger joints popping up across the country, I still dare any one of them to stand off side by side with Tessaro's. Our usual picks are the Deli and the Bacon-Blue Cheeseburger, but you can pick any burger on the menu and be satisfied, and then some. I also love their home fries. Yummy! The marinated gourmet chicken sandwich is also a winner if you aren't into red meat!   One of my other favorites at Tessaro's which I have to admit I haven't had in eons since we haven't made it there for lunch recently is the tuna melt on rye. It has been on the menu forever. If you want one, you have to go for lunch as even though its on the lunch menu, they refuse to make it at dinner :(   The atmosphere here is strictly neighborhood bar/restaurant. Nothing fancy. I am sometimes put off by the way they offer seating (first-come, first-serve) and they will try to cram four people at a table that is meant for only three. If they are not scrambling for tables to seat people waiting, I'd ask for another less cramped table and wait; but on a crowded night, take the first thing available or you could be waiting a long, long time."}
{"text":"I've been coming here for the past 10 years and have always enjoyed the food and  the atmosphere, so I'm sad to have to write a review that speaks poorly about the place.  Having said that, my last experience at Tessaro's was ruined before we were even seated.  While waiting with my girlfriend to be seated for 25 minutes, a party of 3 walks in and is immediately seated.  When I ask why a party of 3 would be seated before the many parties of 2 waiting I was told that the seating was laid out specifically to accommodate a specific number of people: absurd!  We proceed to wait another 15 minutes until a 2 top opened up.    I would gladly recommend this place on the food, but given how inefficient the seating system is I'd only go when you can be seated right away."}
{"text":"I haven't been to Tessaro's for over five years, but I was in Bloomfield with my kids and thought it was a good place to stop. My 15 and 10 year old have never been there.  I was very happy we tried Tessaro's.  We were seated right away, the kids and I had great food  and the service was fast.  I won't wait five years to go back."}
{"text":"I used to think Tessaro's had great burgers but I went recently and was disappointed. I got the regular cheese burger without mayo and even though the texture was good, I could barely taste the flavor of beef. Not sure what they are doing differently, but personally I would rather them charge higher prices and use better quality beef, than serve cheap, previously frozen patties.  The service was great! Our waitress was super sweet and friendly. However, I won't be back.   I want to give Tessaro's 2.5 stars because they have a cute ambiance."}
{"text":"It's an entire perfectly cooked and seasoned steak on a bun! Just the right tenderness to remind you it's not a burger. The gourmet steak sandwich may be the best sandwich ever. The potato salad was amazing too. Think the creaminess of deviled eggs with perfectly tender (but not mushy) potatoes. As an added bonus the ambience, service and prices were great too. If you like a great wood fired steak you owe it to yourself to hit Tessaros up."}
{"text":"Tessaros has a full menu, but if you go there you need, no you must order a burger.   They have the very best restaurant burgers I have ever eaten.   Not greasy, great taste, and they grill them right there in the bar.  Don't miss out on the best burger of your life."}
{"text":"Hands down THE BEST burger in Pittsburgh...puts burgatory, brgr, etc to shame.  Great local spot with friendly service that won't break the bank.  One of my favorites!"}
{"text":"Had the 10oz filet, rare.  It was cooked perfectly for my liking, definitely rare. Tender and tasted great. Came with a sizable salad and a side, I chose home fries which were good. Steak prices were very reasonable, i usually see filets costing that much for only 6 or 8 oz. Decent draft selection too."}
{"text":"The food was delicious. I ordered the steak salad and it was prepared exactly as I asked (steak done medium well and dressing on the side). It looked crowded when we arrived but we only had to wait 10-15 minutes to be seated. The server did a great job of being attentive & keeping things moving without making us feel rushed. The only downside was having other tables so close on either side--tough to have a private conversation and/or not to eavesdrop. That said, it's a bar-like atmosphere, so you know going in it's not going to be a quiet dinner for two. I would definitely go back. Home fries were DELICIOUS."}
{"text":"After hearing about how great their burgers are by word of mouth from a few different people, my girl and I happened to be in the Bloomfield area and decided to check the place out. First off, its very old school vibe. I kinda felt like this bar should have been in a scene from the Deer Hunter movie. Dark paneling on the walls, dark ceiling, very low lighting, waiters and waitress's wearing white aprons, that sort of feeling. A nice lil old lady waited on us. We went about dinner time, though there was a snow storm that afternoon the place was pretty much empty so we were served quickly.  Of course we both ordered different burgers with home fries. The burgers were of a nice portion. I got the Cajun burger with some greasy home fries. It was good but honestly, why I gave it a 3 stars was that there is really nothing spectacular about the burger or place in my opinion. It was good but not great. I don't think I'd drive from miles around to quench my burger needs here. I can see this place being a nice lil place to visit from time to time if you live in the neighborhood though. I definitely would go and check the place out if you've never been there before just to say you where there.  Happy eatings my fellow Yelpers! Your's Truely, The Shaw..."}
{"text":"Arrived late into Pittsburgh and this was a quaint little neighborhood joint.   The burgers weren't bad - I ordered the steak burger that the waitress recommended, but unless your teeth are like steak knives, it wasn't the easiest thing to eat.  Flavors were good, but it did the job late at night when I just needed to find something.   Nice people, too!"}
{"text":"Absolutely horrible over all experience. My girlfriend and I went on a date she claimed when she went that their burgers were delicious and I've seen them on tv so I wanted to try it myself. Whenever we were seated we waited for 15 minutes before we got acknowledged we only ordered coffee and water for the both of us, whenever I put my cream in my coffee It curdled and ruined the fact that I wanted coffee. My girlfriend ordered a chicken sandwich and I had ordered a bacon burger and we were going to cut down the middle to have a half of each it took 20 minutes after the coffee incident for her to come back to take our order. Another 45 minutes to get our food and once the food came out my burger didn't have a bottom bun nor BACON!!!! My girlfriends sandwich was beyond dry and wasn't the actual chicken sandwich she ordered. Overall after reading reviews and seeing them in tv and experiencing it myself I WILL NEVER COME BACK TO THIS RESTAURANT. Such a disappointment"}
{"text":"Being a native of Pittsburgh I havea always heard tales of the best burger in Pittsburgh. Most of those tales had Tessaro's as the destination in question. The first time and every subsequent time I have been there has held up to it's legend. Don't get me wrong, there may be better burgers in Pittsburgh, but I have yet to find them.  Tessaro's has not only great burgers but also other foods that are delicious. Their menu is similar to what you would find in a steak house. They serve a lot of fish and steak aside from their burgers. After eating several different meals at Tessaro's I can say with no doubt that my favorite thing there is the \"Bacon-Bleu\" burger with crumbled blue cheese (rather than creamy because they give you the opion). The bacon is amazing, the blue cheese melts to the bun within a coulple of minutes and the burger mean is so fresh that you can distinctly taste its freshness.  The ambiance of the place is really nice too. It is an older place which has kept that old Bloomfield feel still to this day. Everyone is extremely nice there. The owner is usually there at the door to greet you and is always willing to have a nice conversation with you in the time when she is not flying around trying to get people in their seats.   The only downfall with Tessaro's and this is not their fault is that they are alway's almost too busy. Because this place way a neighborhood bar at one point it doesn't exactly have a lobby for you to wait in while you wait to be seated so that part of your dinner may be a bit uncofortable but all in all Tessaro's will be a great experience, espescially for those who are a fan of the old fashion hamburger and beer."}
{"text":"Fantastic burgers made fresh every day.  Pleasant atmosphere and fast service.  Good prices for great food."}
{"text":"I love Tessaro's for its lack of pretension. If you want weird ingredients you can't pronounce and cooking techniques from Bon Appetit, look elsewhere. If, like me, you think simple and homemade are compliments then this is the place for you. The food is no frills, just good. And consistently good. I live down the street, so I visit Tessaro's often. It isn't a hit or miss place. I always know the food and service will be excellent. I introduced my parents to Tessaro's when they visited awhile back and now my mom asks to go every time they're in town. I worked for a long time in the service industry and I know what I'm talking about when I say Tessaro's is the epitome of well-run and well staffed. There's often a wait, but it's worth it. I recommend it to all my friends."}
{"text":"This place is hyped as the be all end all of burgers.  It may or may not be, and some of the food is actually quite decent- I've had burgers and seafood and chicken and salads over the years.  The reason why I rate this place low is the atmosphere is abysmal.  I've always felt like an outsider here, even when we were going once or twice a week for months.  (We live right down the street.)    The hosts are terrible - it's like they look right past you if you're not one of their Special Friends and they shoehorn you into tiny and uncomfortable booths while putting smaller parties into comfortable and spacious booths.  I'll go down the street to Lot 17, where the food is better and no one makes you show your \"Member's Card\" to get seated."}
{"text":"If authenticity is an ingredient, consider Tessaro's perfectly seasoned. A Bloomfield landmark, the ambiance of this corner spot  is warm and dark. The service is provided by a very competent crew who seems to have been around for quite some time. The food came out in good time and was just delicious. Portions were generous. I especially appreciated the heavy wine pour. Meats were exactly as requested and cooked over an open flame in site. Tessaro's is not cheap but it is highly recommended."}
{"text":"Meh!   I tried this place with high hopes (too high, maybe?) after reading all the reviews on this place.   Got the special burger with bacon and home fries.  All I can say is meh.   I wonder if people equate large portions with good food.  This seems to be a prevailing sentiment here in Pittsburgh."}
{"text":"I went on a first date here Friday evening.  It's such a strange mix of upscale and casual diner - that works perfectly. I had the regular cheeseburger and it was absolutely amazing (although messy - so probably not the best first date food). My date had the steak sandwich - he said it was delicious, but it's literally a steak on a bun, so it's hard to eat gracefully (maybe cut it up first?). We had home fries as our sides - I don't even really like home fries, but these were so yummy. Great food all around.  Our food came out lightning fast. We didn't even think it was ours because it was literally five minutes after we ordered. And the service was amazing: so friendly, attentive and efficient. The hostess is the cutest little woman as well. So helpful and sweet. Not to mention, it's so affordable. I was very happy we came across this place.  My only complaint is that the dining tables in the back are very, very, very close together when they are all split into two-person tables. We were having awkward first date conversations and the couples around us may as well have been at our table. I did not enjoy that. Aside from that, I  had a great experience and I will definitely be back again."}
{"text":"Good atmosphere on a Saturday night , pens game on thru out the bar. Burgers were delicious and as advertised. Good selection of beers . The neighborhood itself is a hidden gem , would definitely eat there again. Prices were right."}
{"text":"In my vegetarian life, this is the only burger that I've ever thought looked good.   Tessaro's makes simple, American food well. Their variety of specialty burgers is large and is accompanied by other typical American fare, sch as ribs, meatloaf, and other sandwich varieties outside of the burger. While the dress is casual, the lady who is always there to greet and seat you (I would assume an owner or manager?) along with the dark wood and long bar give the space an air of elegance. While this is a great spot for a longer work lunch, I wouldn't necessarily suggest it for parties larger than 4-6. The space is small and there might be difficulty with seating for a bigger group.  Vegetarians, for the main dish you should expect grilled cheese. It is a really good, really calorie-packed sandwich and like everything else comes with a choice out of many side dishes."}
{"text":"I'm assuming something has changed with Tessaro's. These burgers came so highly recommended that I immediately came here very excited when I had a burger craving. After my experience, I really don't understand what all the hype is about.  The atmosphere is potentially claustrophobic if you're seated in certain areas. There's very little space between some tables (near Liberty/the entrance) and it's a very loud place, so be prepared to listen to everyone else's conversations. I'm aware that it's not by any means a romantic spot, but yelling over the people next to you isn't ideal no matter what. If you've been to Nicky's Thai Kitchen downtown and been against the wall, the tables are even closer than that.  The wait for someone to take our drink order was rather long. The wait to get our drinks (two draft beers) was also unreasonably long. When it comes to food, I don't really mind if food takes a little longer because it's freshly prepared (as they claim on their menu). However, when we finally got our burgers, they were okay. I'd say adequate. Nothing like what was hyped to me at all, and I'm told that it's just not the same as it used to be. The home fries are a nice touch, but not incredible either.  One thing I'll commend: burgers were cooked pretty much perfectly. I ordered my burger cooked medium, my girlfriend ordered medium rare, and it was dead on. I'm used to ordering medium and getting medium well at least.  Over all, I might try Tessaro's again on the chance that this was just an off night, but I might aim for takeout instead and see how that goes."}
{"text":"I've been coming here for many years. I live in Charlotte NC now but still make Tessaro's a priority spot during my visits home. Hands down best burgers in Pittsburgh! The service is fantastic as well!"}
{"text":"Tessaro's is really good! I especially loved the laid back and retro atmosphere and I thought the service was great. I ordered the bleu cheese burger with house fries and while I thought the burger was good but a little on the bland side, the house fries were absolutely delicious! My only vice about Tessaro's was that the beer list wasn't that great and didn't have a lot of good beers on draft. Otherwise, Tessaro's is a cool place and you should totally check it out!"}
{"text":"Tessaro's is famous for its burgers and that is why I go there!  This is old Pittsburgh at its finest.  It doesn't try to be hip or trendy - it just is!  Excellent service and great food is what this place offers.  It doesn't disappoint!"}
{"text":"This is a classic Pittsburgh restaurant. The inside has a lot of history and character to it. The burgers are considered one the best in the area and I'd highly recommend ordering one. They are cooked true to temp so I get a medium well and it comes out with just a hint of pink the way I like it. The burgers come with home fries which are okay but not one of my personal favorites. The staff is always great. It does get busy though so make sure you keep that in mind before heading down. I want to go back this summer to try the gazpacho - I've heard it's legendary.   Cons - no French fries and only street parking"}
{"text":"lI would love to say my first experience with this place was great, but I can't even give it a grade of bad. I actually fought with my boyfriend because I thought he deliberately brought me home someone's food they threw out cuz it was RAW! Not pink not medium, not even close. I'm not one of \" those\" ppl that have to have everything cooked to death but e coli was not on my menu.    What a shame. For the $ and build up of reviews I feel scammed and almost broke up with my boyfriend because you tried to poison me."}
{"text":"We went to Tessaro's on a Saturday late afternoon for an early dinner. We knew we wanted to get the famous hamburgers from their storied grill, and it was, indeed, worth the trip. I ordered the Bacon and Blue burger with half home fries half potato salad. (pictured) My husband ordered a Swiss Cheese hamburger with potato salad. The Bacon and Blue burger had blue cheese crumbles and crispy bacon on top - all ingredients were very high quality, but it wasn't my favorite flavor combination. Absolutely nothing wrong with the cooking or creation of the burger, just too high end of a burger for me. I ordered a very plain one to go and the next day enjoyed a delicious burger that reminded me of the great burgers from the cookouts of my childhood. The restaurant became packed by the time we left and I would recommend going when there's a break in the crowd, either late afternoon or after the dinner rush."}
{"text":"Best burger I've had in the city.  The sides, soup and veggies are all yummy too.  Wish I didn't have to wait so long to get in, but when everyone knows how awesome it is, they can't really help it.  It is so good!"}
{"text":"What can I say about Tessaro's that hasn't already been said? The place us amazing. I live around the corner and I moved there just so I could walk to the best burgers in the Burgh.  To start with the decor all I can say is it feels like home. Exposed brick. Crammed in tables. Murals on the walls. Antique lighting. Lots of family mementos. I love each and every piece of it.   As far as the service goes I don't think they have hired a large portion of new staff since... ever. And that's ok with me. I love long time servers and bartenders who know everyone and treat you like family. When they get busy it may get a little slow but the service is always so pleasant I don't care.   Tessaro's does gave a full bar but don't go expecting new age hipster inspired mixology. It's definitely a simple bar from a simple time. Drink your manhattans, vodka martinis, wine and draft beer and be happy.   The big claim to Tessaro's fame is their burger. The burgers are fresh ground juicy and delicious. Also the Tuesday ribs are killer. It all comes down to the wood grill. It makes the whole neighborhood smell heavenly.   To finish up Tessaro's is a perfect example of old school. Everything about them just reeks of tradition. With all the new gourmet burger joints popping up around Pittsburgh it warms my salty red neat engorged heart to see that the original isn't just alive and kicking, but thriving."}
{"text":"Tessaro's is about as good as it gets in the city. I would very gladly eat here every day if that were an option (unfortunately, it's not). Last time I was here, I had the Bacon Bleu Burger, with the dry crumbled blue cheese. I like my burgers cooked medium, and it was done just as I liked it. Juicy but not so greasy that it made the bread soggy. With that, I had some sauteed mushrooms, which were absolutely fantastic. Tessaro's also sells some great pork and beef ribs which I've had a time or two. Definitely among the best places to eat in the Burgh."}
{"text":"Best burger in Pittsburgh. Full stop. What else do you need to know? They have other food too, and it's good, but see above."}
{"text":"This is a must stop if you are in Bloomfield as people claim it has the best burgers in the burgh! While we were there last night for a birthday celebration we ran into a friend who drove an hour to come for dinner. The restaurant often looks closed from the outside but don't let that fool. They do not take reservations and it often gets quite busy so be prepared to grab a drink at the bar ( seats turnover pretty quickly). They have a decent selection of drafts including a number of local brews. The menu has many other options besides burgers including salads and ribs. I always stick with a burger and my favorite is the blue cheese and bacon. You have your choice of creamy or crumbled blue cheese and lettuce, tomatoe, onion and pickle. I got the works which has that home cooked taste! You also have many sides to choose from including veggies, home fries, rice or potato salad. I highly recommend the potato salad!  You won't leave hungry as the portions are large."}
{"text":"On a busy Friday night we were seated after a 15 minute wait. The burgers are really quite good, especially the quality of the buns! I hate soggy buns! I chose one of their specialty burgers (creamy blue cheese + bacon), but sadly, they screwed up my order giving me just a plain ol' burger instead much rarer than I cared for and they forgot my chips. By then, I was too hungry to care or make a fuss, so I just ate it and it was still delicious! Hypoglycemia does strange things to the mind. Summary, the food is as good as advertised, but service was subpar and most definitely not five-star."}
{"text":"This is the only burger place I have ever been to that doesn't serve french fries. WTF? Went once, only due to bad weather, and would never go again."}
{"text":"My name is Hitt, I'm from Pittsburgh PA.  I do many things but one of the things I like to do is experience everything I humanly can from foods to places plus people and things.  Rather than write a long review and clutter the reviews with anymore long reviews (no knock, you guys are great) I'm just gonna get right to the point...  This place?   Go here. Get a burger. Or get the filet. Sit by the fireplace. Admire the tiny ass kitchen.   Feel like you work there while going to the bathroom.   Good luck."}
{"text":"Tessaro's gets a lot of press about having great burgers.  They are certainly solid and worthy of praise.    We've had ribs and steak there - both were also very good.  But there is something about the place, that doesn't make my short list of favorites.  It's usually pretty crowded, and the bar/waiting area is limited.  Leads to alot of shuffling around and awkwardness.  Also I'm always underwhelmed by their sides.  I end up ordering potato salad or something else that I'm underwhelmed by.  They have home fries, but I may just be too much of a traditionalist and want a decent french fry.  As someone that lives in the neighborhood - they do provide a lovely aroma of grilled meat almost every day of the week.  As a result - I am hungry all of the time.  But...if I want a burger and a beer - I head down the block to Lot 17 and get some options, better atmosphere and sweet potato fries."}
{"text":"I think they have the best steak in Pittsburgh including the expensive places downtown! Burgers are the best!  Used to get great fish but no so much anymore.  Soups are awesome!  Debbie is about the best bartender in the burgh!"}
{"text":"I have heard a good amount of positive reviews of this place from lots of different people. That being said, I was expecting to be wowed by their burgers, which is the reason people told me to go.   However, when I arrived with my guest, 8:00 PM on Thursday night, I was kind of disappointed. Not only did the waitress take a good 10 minutes before she brought us water, but she was not very attentive and never checked back with us until she brought the bill. The burger was so-so with little flavor, which was very disappointing. I could also tell that a few other tables in my section were looking around waiting for their server.  All in all, I was disappointed by the quality of food as well as the service."}
{"text":"Now That's a Burger!  Great beef and grill flavor.  Its not complicated, but I thought it was great."}
{"text":"The burger was pretty good but, I've had much better. Tables are really close to each other like others have said. What I really didn't like about this place was the service. We had to flag down our waitress just to get refills. We were rushed through our meals like we weren't wanted! I mean they weren't crowded or anything. There was one other table of people besides us on the dining side and maybe 10 people at the bar.   I should have went to Five Guy's! I would have been much happier!"}
{"text":"No joke, best burger I've had this side of the Mississippi.  The background here was that this establishment used to be a deli and they retained their butcher. Knowing the meat as he did, the secrets of the best burgers were passed down to the most delicious recipes in the most competent hands.  Regardless of whether this is true or not, they do know meat and they do serve up quality grade. Don't be afraid to order yours medium-rare or Pittsburgh rare."}
{"text":"This place is so cool and I recommend that everyone should go at least once and try a burger. The staff is friendly and professional. Not to mention the atmosphere inside you can get the feeling of being in a diner, but unlike any other diner. I'll be back for my burger fix!"}
{"text":"They have a new private function room that is simply amazing, air conditioned, just very well put together. Food is great and since this is a Pittsburghs staple, you have to come and try at least once."}
{"text":"There are a lot of trendy, high priced hamburger joints popping-up all over the city.  Forget about that mess.  THIS is the best hamburger in Pittsburgh. Period. Don't forget to order the potato salad, too. Bloomfield is a great neighborhood, maybe the safest in the city. There are a fair amount of eateries here.  Pass them up. Go here."}
{"text":"Came on a Monday night in October and sat at the bar. This is a dive joint in a quintessential Pittsburgh blue collar neighborhood. Had the cheeseburger with potato salad and it was great. Will defer to others on the \"best burger\" argument. Only complaint is the lack of appetizers on the menu (e.g., no wings). And why don't they offer fries? I mean the potato salad was ok, but we like fries with our burgers.  btw...knew I was in Pittsburgh when they turned off the NFL MNF game for a regular season Colorado-Toronto hockey game (ie., not even for the Penguins). Let's just say they like their hockey in this town. Very weird!!!"}
{"text":"Steak sandwich was very good. Potato salad was very good. Home fries were very good. Kelly's gourmet burger was just good. Service very good! Will definitely come back especially for the friendliness of the owners. This is a Pittsburgh icon."}
{"text":"I don't care how \"good\" you think the meal is. The service was the worst in Pittsburgh and no server was halfway nice. When we said things weren't to our liking they tried to convince us otherwise because we were eating the \"best meal in town\""}
{"text":"The food was delicious and our server Mikaela (sp?) was so accommodating and friendly. The outdoor seating was open, so we sat in the back and it was nicely decorated with potted trees and felt welcoming."}
{"text":"Eh,  So much hype, but the burgers are over ground and too big for the bun.  Maybe it was just over hype, but I want all the wonderful burger things to occur when I'm munching a burger, not just tons o' ground beef in a bun.  Try BRGR just up the road."}
{"text":"Word on the street is that Tessaro's has the best burger in Pittsburgh so I had to go all out and get their Gourmet Cheeseburger. No doubt that a Tessaro's burger is HUGE. It also has great grilled flavor. However, it kind of tastes like something you can grill at home. The seven burgers they offer on their menu are also quite simple with average toppings, making these burgers more like your cookout burger made at home. So they taste pretty good, nothing too special aside from the fact that they're really big. My gripe with the size of the burger is that it is so large, it completely smashes the bottom bun thinner than a pancake. By the time the burger gets to you, your bottom bun has basically vanished into a soggy layer of mush. If bigger is better, these burgers are up your alley."}
{"text":"Great place for hamburgers, actually my favorite place for burgers. Always thick and juicy. Take my family here often. Great service and cool drawings on the walls!"}
{"text":"If I were to rate just the burgers, I would give it 5 stars! The service is the worst! We waited 20 minutes to be waited on, and it was not busy at all.  4 different servers walk by us, and just looked away. Finally a 2nd glance, by a server, who it was obvious it was not her area, by the eye roll, when she asked had we been waited on. This is always the case when I dine here!. If not for the best burgers I've ever had, I would have never gone back.  Also, I like to dine out, and would probably dine here more, if not for the poor service!!  They give you a feeling here, that they are too good for you, as they did this visit.  Don't like that feeling, so after this last experience, I will go find another place to get a burger."}
{"text":"It seems as if this place is now more hit or miss. I've gone there and had amazing service, other times terrible service.  The food went from amazing to mediocre without missing a beat. The burgers are huge, no doubt about that. No matter how I order it, I receive a burnt and charred burger that tastes of the grill. I tried a steak instead thr next time we went. Even worse, no seasoning whatsoever.   It's close to where I live and work so I stop in from time to time if everything else is closed. The newly remolded area is nice and quiet so that's a plus.  Would I recommend it? Probably not. Will I return? Inevitably."}
{"text":"Best burgers in the city, sorry BRGR and Burgatory.  This place is always consistent and reasonable.  Great location to everything else in town."}
{"text":"As an update, if you get the veggies as your side don't get them cooked on the grill. Sometimes they will do this and char them a bit which is delicious but if your burger is cooked in the same spot the residual plant matter sullies the flavor of the meat."}
{"text":"Horrible Food, Horrendous Customer Service, #overrated  So I already wasted 2 hours of my life eating at this place, so I am not going to write a thesis as to why someone should not be a patron of this restaurant.  In summation, when we arrived we were harassed by the owner (acting as the hostess) for wanting to sit in the corner, served flat beer, and then interrogated by her after sending an order back for not meeting the clear specifications given to the waitress.  Living in Latin America and traveling in Asia for some time, I have been to a lot of hellholes, but this is hands down the worst place I have ever been.  Not only was the food lousy and way overpriced, but we were hassled by the belligerent, sarcastic, and condescending owner almost the entire time. Clearly, customer service nor quality of food are valued.  Honestly, I would rather starve than eat here again."}
{"text":"A classic old-school joint. The bar dates back I don't know how long. And the service has that old-school quality. I wanted for nothing. I was stuffed by the burger they served me. It was tasty and delicious. I can't wait to go back and enjoy another."}
{"text":"Sure, the burgers are supposed to be out of this world. I find them kinda meh. But that's because I'm not a fan of burgers. The smell of the grill draws you in from blocks away.   What I am a fan of is a place that can actually cook your meat to the requested temperature. By golly, Tessaro's never fails. I ask for a rare steak on the spinach salad, rare it is. Ask for a medium rare burger, done! I overheard a lady praising the kitchen on her well done steak, is that even possible?  I've eaten here MANY times, not that difficult since I've lived in the neighborhood over a decade, and I've heard just about every conversation you could expect. What I've never heard is anyone complaining about the meat temp.   That is amazing.   So is the potato salad, though I wish it had egg chunks in it."}
{"text":"Tessaro's is a true Pittsburgh establishment.  You will always get a top notch burger with no nonsense service.  To appreciate Tessaro's you have to accept that you wont get fries with your hamburger (but the home fries are delicious).  And you have to accept that reservations are not accepted, and you will sit uncomfortably close to the party next to you. I love Tessaro's because like most Pittsburghers, I appreciate when an establishment keeps its traditions. And I always know what to expect."}
{"text":"Tessaro's is so old school it hurts. They're known for their burgers and on this occasion the hype suits the reality.  The inside becomes somewhat cramped during their busy hours but I always seem to get seated quickly. The meny is traditional and I've only had their burger. Yes, their burger is incredible. It's huge, cooked well, and on a good, sturdy bun. Like all good burgers, the meat steals the show but the veggies keep the burger's pace. I hate a burger that's all meat, Tessaro's is very balanced. I wish they had french fries as a side but, like I said, it's an old school joint and they serve old school sides.  Either way, I can't complain, their homefried potatoes are good.  The service is impeccable and I haven't had anyone who wasn't over 40 and looked like they'ved worked there their whole life. They know what they're doing and they do it quickly. Tessaro's can handle a crowd, they've been doing it for years."}
{"text":"Not sure was the rage is about this place? Ive had better burgers at Red Robin! And no fries? Only lame home fries. I'm not stopping here for breakfast. For that matter, not stopping here again."}
{"text":"Incredible, fresh, flavorful burgers every single time! I get medium rare breakfast burger often and it's never disappointed. They have big portions at reasonable prices. As for sides - forget the fries, they have AMAZING POTATO SALAD that's the stuff of dreams."}
{"text":"WORST service and seating EVER! We were standing in the little doorway for an hour to be seated.  And the old seating lady who wore tons of bracelet messed up with the seating list (basically she seated whoever she wanted to seat). Food is ok but the service is a thumb down.  I would never come back."}
{"text":"Last night I diverged from the \"usual\" and ordered the chicken kabob instead of the 1/2 pound Goliath of meaty goodness.   My girlfriend suffered copious \"meal envy\" when our spiky haired 21-year Tessaro's veteran waitress handed me an overflowing plate of charred (in a good way) chicken & huge chunks of red & yellow pepper, onion, zucchini, yellow squash, & mushroom. The only flavoring was the grill - no sauce or spices - which at first came off as bland but soon became enjoyable as my normally over-salted palate adjusted to the simple delights of unadorned food.  GF had a cheeseburger & boiled potatoes and she enjoyed it a lot. Their boiled red skin potatoes are another simple treat reminiscent of my Mom's Sunday dinners culled from her Germanic roots that often included new potatoes with vinegar, onions, and butter. Truly delightful!   Our waitress was really a gem - old school dame with some sass and a family tale of a sister-in-law with black & silver locks that turned heads. She made no fuss and profusely mea culped when we pointed out an extra drink on our receipt.  We ventured into the Ladies Room before leaving and found it to be clean and well maintained; adorned with antique mirrors.  Tessaro's is a longtime neighborhood meeting place that has survived on good service and two-fisted burgers."}
{"text":"Huge burger and good service, but the burger's more than a little bland.  It's cooked over a wood-heated griddle, which sounds cute, but the griddle means that it doesn't pick up much, if any, flavor from the wood fire.  (Might as well be cooked over gas or an electric griddle.)  Throw in some chuck or pork fat or spices or garlic or something with some flavor and it would be much better, too.  That they butcher it in the back and the nice service takes them up from 3 to 4 stars."}
{"text":"This place rules!  Family owned and run, it's a great neighborhood place to eat. The burgers, hand made and made to order are superlatively good.  I love that they don't have fries! Don't get me wrong, I love fries BUT who needs fry oil, old oil, more stuff? The burger is good enough. They're known too for great fish and steaks though I had burger after burger every time I went. I went with friends, another time with my kids, occasionally by myself and sat at the bar. Always good. The wait can be crazy long and they don't do reservations.  It was pretty yucky when they allowed smoking, thankfully, that's history. CLOSED Sunday!"}
{"text":"My friend brought me here right when my plane landed in Pittsburgh, PA.  It looked as if was located deep in the heart of Pittsburgh.  We walked through a dark alley (skurry), where we parked, into this nice little restaurant.  The building itself looked old but cozy.  Maybe a little too cozy as our seats were rather cramped.  Although known to be the best burger in the 'burgh (alliteration ftw), I went with the steak sandwich because I was on company money.  But it was just a piece of steak on a piece of rye bread.  The steak nor the fries were that memorable, but were filling.  The service was good and homely."}
{"text":"I'd been hearing about these burgers for a while, so when I finally got a chance to eat here while visiting pittsburgh for thanksgiving... i got to eat one :D Delicious! So meaty and juicy and omfgherkajhg. very very tasty. Unfortunately I had chips instead of homefries, and now I wish I'd gotten those homefries. They looked a lot tastier than I thought they would. Sigh, someday!  It's was cold out and there was a line, but we all crammed inside to wait, and everyone was very nice, and we got a good table. I think we waited maybe 20 minutes. Very nice atmosphere inside too, I like the lighting."}
{"text":"I went back with my parents, and this time I ordered a burger.  It was an exceptionally good burger (I had the bacon bleu burger), and priced really well (all the burgers are under $10, I believe).  As the side dish, I took my mother's advice and got the red skinned potatoes with a side of butter.  So bad for you, but oh so so so so so good.  The waitress was very nice and on top of her game.  When we arrived, we were told 30-35 minutes, but we were seated in 15 minutes.  Score."}
{"text":"Love this place. Always great food, service and atmosphere. Fantastic value. A favorite when I'm in the Bloomfield area."}
{"text":"This is my all time favorite restaurant in Bloomfield. I have never had a bad meal here and have been going here since I was a kid. My favorites are the steak salad with their awesome homemade ranch dressing, chili, gourmet chicken sandwich, and tier homefries and potato salad are the best sides they offer! Sometimes depending on the wait staff they will give you half homefries and half potato salad to enjoy both! You can never go wrong with the bbq burger - I get it with mild BBQ sauce and add cheddar cheese and bacon. I am dying to try the deli burger but have yet to do so."}
{"text":"Ok...so goggled Italian restaurants...walked in all ready for some Italian food and nada.  BUT...the host which was the sister was FANTASTIC. She told me the history of the place and suggested I still stay and try their food even though I was a craving a pizza.  The BEST home fries EVER. And the cheesesteak...EVEN better.  She made the whole trip amazing and after consuming the food- I had forgotten wanting pizza at all.  A true GEM for both food and hospitality."}
{"text":"The burger was undercooked for how I ordered and home fries were burnt. Waited for 10 minutes before someone came to the table. But after that service was good."}
{"text":"In the 'burgh on business and looking for a cool place to eat.   Knew I found it as soon as I walked in.   Old school look and feel with great food to back up any drink from the bar.   Sat at the bar and ordered a wood fire burger that was fantastic.  Truly best burger in the 'burgh and the home fries were a bonus.  One thing is certain, I will return every time I am in town.   Thanks!"}
{"text":"I went at lunch, so it was a little crowded for my liking, but that's to be expected. Despite how crowded it was the service was excellent and I very much enjoyed my HUGE breakfast burger. Reasonable prices, cute, local place. Would definitely go again."}
{"text":"Best burger and potato salad ive had in a bar, was frequent visitor when Kelly was alive-he was a class act"}
{"text":"Start out by saying I worked there almost 20 years ago and the place and the employees are the same. In the restaurant business or any business constancy is key. The food is very good and the place is clean. It looks old because it is but that's part of fun. The family who owns it is a great family. If you go through Bloomfield stop in but make sure your hungry."}
{"text":"I tried to come to Tessaro's the last time I was in Pittsburgh a year ago but didn't realize they were closed on Sundays.  This time around I was successful but was kinda concerned since almost all Yelp reviews since April were pretty negative.  Well I'm glad I finally came!  The burger is definitely as good as others have said.  I believe the menu claims it's a half pounder, but it feels bigger than that to me.  It came on a delicious and soft roll and was cooked perfectly.  They don't have french fries, but I did get a side of homefries which was kinda strange to be eating with a burger.  Still, they were pretty good.  Overall the burger was really really satisfying.  Other food I saw or tried wasn't really as impressive.  Maybe there are a few other gems, but from my limited experience the burger is undeniably the star.  I'd definitely go out of my way to come back and if you live in the area Tessaro's is a no brainer."}
{"text":"THE BEST BURGER IN THE 'BURGH - HANDS DOWN!! Great flavor - always perfectly seasoned and cooked to your preference.  We have been enjoying Tessaro's for years and we have never had a burger that was cooked incorrectly.  The home fries and the potato salad are my favorite side dishes. The salads are also amazing - the strawberry vinaigrette is mind blowing!! BONUS: They have ICE COLD Rolling Rock pony bottles to enjoy with your burger!!"}
{"text":"If I could give no stars I would.  The service was horrible.  We had a decent wait time and once seated seemed very rushed. Our waitress took our order and our food came pretty quickly including the bill.  Right after we received our meals we also received our bill and the waitress told us if we needed anything else she'd be behind the bar. We needed refills and had to flag down another waitress to ask for them and when our waitress returned she seemed annoyed.  Won't be going back because I'm in the service industry myself and that's not how you treat paying customers."}
{"text":"Tessaro's is a pittsburgh legend in my eyes as I've been going there consistantly since I was 13-14.  I see some of the reviews here of people not getting burgers and complaining, that should be enough for any perspective diners to obviously only get burgers at Tessaro's.  Everything else is hit or miss but the burgers are amazing, woof fire grille, filet on the inside of the ground meat and this burger is heaven.  The service can be a little shaky at times and the woman who seats you can be a litttle grumpy, but its all worth it for the burgers.  My fav is the bleu cheese burger with creamy bleu cheese."}
{"text":"You'll never find a better filet for the price anywhere and I mean not just in Pittsburgh....  Always cooked to perfection and the iced tea is almost as refreshing as the steak..."}
{"text":"I gave up meat for lent. I literally went forty, 24 hour days without a single bite of meat. So whenever Lent ended, I had one thought on my mind, and that thought was a Gourmet Burger cooked at a delightful medium-rare from Tessaro's.  Not having meat for forty days and then having a Tessaro's Gourmet Burger is like dying and going to a meaty paradise, where one can eat burgers all day and all night and never ever feel full.  My first bite into my burger led me to consuming the whole burger in no less than 2 or 3 minutes. I couldn't help myself, I kept eating and eating and eating as fast as I could, because my body was deprived of meaty protein for so long.  The Gourmet Burger came with lettuce, tomato, bacon, and my choice of provolone cheese. You also have the choice of yellow mustard, dijon mustard, or spicy brown mustard. I went with Yellow mustard, and mayonnaise, of course. I lathered the bun up perfectly with mayo and mustard and licked my fingers after my burger disappeared into my belly.Their potato salad and cole slaw are top-notch as well, and go amazingly with your burger.  Tessaro's burgers are AMAZING. No doubt about it, the best burger I have ever had in my life is the Gourmet Burger from Tessaro's."}
{"text":"The staff here are pretty awful, unrepentant, nasty homophobes. Every level of steak doneness here means \"burnt\". If you you like either of those things, be sure to visit Tessaro's, because I will not be doing so."}
{"text":"I tried the Bacon and Bleu burger with potatoes on the side. The burger was nice, juicy and overall very filling. The bun seemed just a tad dated so I left on the side.   Good ambiance, neighborhood-type restaurant well-known for years, with friendly service and fun atmosphere."}
{"text":"my burger was really dry and tasteless, and I ordered it to be cooked medium. I was disappointed in this place because everyone says its the best burger in town...I must be missing something. I thought the atmosphere kinda sucks and the way seating is done leaves much to be desired...overall might go back to see if it was just a fluke, but wont be rushing there."}
{"text":"Blah blah, Pittsburgh institution, yeah, I know the whole deal.  I've been here for burgers before, sometimes for something simple, sometimes for something a bit more adventurous.  Most recently I enjoyed the Deli Burger with a side of potato salad while my friend enjoyed the Breakfast Burger with home fries.  The Deli Burger was good, but I was definitely jealous of that amazing looking Breakfast Burger.  As I've matured, I've gotten over the fact that they do not offer fries as a side and appreciate the potato salad, cole slaw or home fries.  I've never had a bad burger  (though sometimes they can be overcooked when I order medium) or experience here (service has always been top notch).  I respect that they continue to do what has always made them successful and hope that they can keep up with all the burger competition."}
{"text":"Tessaro's is one of the first places I ate in Pittsburgh after a full day of stressful interviews and it really made it right! Of course, I have visited the place several times since I moved in Pittsburgh, since the burgers here are phenomenal.  Are they the best in Pittsburgh? I am not sure since there is a lot of competition that appeared since I came, but for sure it is a unique experience.  The place itself has a nice old-style atmosphere that I am a fan of, and this plays its role as well.  Service is also nice and fast every time I have been there.  All in all I highly recommend Tessaro's and be sure I will be going back!"}
{"text":"Great place first time there food was delicious while there we saw steeler player Britt kiesel wow!!! Sorry posted wrong pic for food"}
{"text":"One of the best burgers I've ever eaten.  The atmosphere in Tessaro's is like that of a thousand bars I've been to, but the burger served here is better than just about anything served at more upscale places.  My burger (ordered rare) was served right around medium well, which would typically ruin it.  Somehow, it worked.  Whatever blend these guys use (we could see them grinding it right behind the window adjacent to our booth) is exceptionally good - it tasted great, overcooking and all.  The exterior had a great sear from the grill, the inside wasn't dried out at all, and it had a perfect bun-to-beef ratio.  If anything, the bacon and cheese were superfluous; this burger was good enough to stand on its own.  I ordered a 50/50 split of potato salad and home fries, each of which was superior to most fries served at burger joints (no fries served here).  Good complement to the burger.  To top off the Tessaro's experience, the four of us wandered out into daylight and realized we were covered with a light dusting of soot, evidently from the wood-fired grill we'd been sitting next to.  Ordinarily, that'd be disgusting.  After that great burger, I'll call it a unique stamp of authenticity."}
{"text":"For the juiciest, tastiest, big-time burger in Steeltown, Tessaro's is second to none. When home I always go there with my pops and bros.  Tessaro's fires everything up on an aged hardwood grill you can smell two blocks away.  The place is a Pittsburgh classic, serving great food for as long as anyone remembers. Go with your family and you're bound to run into at least three people you know and ACTUALLY want to see. Running into friends is inevitable...that's Tessaro's old school charm.   The waitresses are awesome and have been there forever. The daily specials are a go to: fresh Fish, Salads, Sandwiches, Barbecue, Mexican, etc. Honestly, you can't go wrong!   There's typically a wait at the entrance, never more than 15 minutes. Head to the bar, enjoy a drink and start schmoozing. Good conversation starters are the Steelers kicking ass or the Pirates being shitty."}
{"text":"Tessaro's is one of those quaint timeless neighborhood pubs/restaurants that so many soulless national chains spend millions of dollars trying to recreate.  It's one of my favorite weekday after-work places to visit and I come here often.  The restaurant has a real hardwood grill that is is located in full view of the main dining room and baths the neighborhood with the smokey sweet smell of grilled meats that makes you salivate and your stomach ache for food.  It's one of those things that makes you feel that this place is going to be great - you cannot wait to get inside and order.  The interior always has a great vibe.  High tin-covered ceilings, old-school wood bar, exposed red brick, and denim tablecloths cover tables that are closely-spaced and nearly always full with patrons happily eating and drinking.  Arrive at a peak time, any weekday or weekend evening, and you'll likely be getting a drink at that nice bar while you wait for a table.  That's OK - the bar is fully stocked, with local Penn Pilsner on tap (along with other good beers), and service is attentive and efficient.  Don't forget to take a look at the chalkboard on the wall to see today's specials.  What to order:  You must try a burger here - I virtually guarantee that it will be one of the best you've ever had.  Tessaro's grinds their beef for their burgers fresh daily, and they rely on their own recipe for their ground beef that mixes different cuts of beef in a predetermined proportion to achieve a balance of taste and the right amount of succulent fat - both for taste and for the right amount of drippings onto that hardwood fire which flares and sears the outside of the burger with tasty good stuff.  The burger is nicely-sized, with a great selection of cheeses and toppings, and grilled to your desired level of doneness.  This is the only restaurant where I frequently order a burger without any trimmings - just so I can taste the beef in all of its smokey goodness.  A wish:  I wish they made better side dishes to accompany their burgers.  They offer some good side dishes: potato salad, steamed fresh vegetables; and some side dishes that could be better, especially the home fries, which tend to be soggy, greasy, and/or burnt.  They don't offer french fries.  I think offering a proper french fry - made with freshly-cut potatoes, first par-fried at a lower temperature and then flash-fried at a very high temperature to order would go a very long way toward perfection.  Their soups are OK, and, strangely, a good portion of their menu is listed as \"Mexican\" fare.  They don't need it, and would be better off limiting that fantastic hardwood grill to burgers, steaks, and fish specials.  If you haven't visited yet, you will not be disappointed.  I highly recommend checking it out."}
{"text":"Another great experience at Tessaro's! I came here on my birthday two weeks ago, and my entire group had a lovely time. We had a party of eight, but four of us arrived early. The staff kindly let us hold the table while we waited for everyone else. There were several first-timers at our table, and everyone said the food lived up to its glorious reputation. (Frequently perpetuated by myself) Our waitress did a wonderful job handling the various food and drink orders/customizations, and the owner/manager even came over and chatted with us. She was a sweetie. I'm a fan for life."}
{"text":"The best burger in the United States!!!!! Having a Tessaro's burger is an experience. One that I have weekly. The owners are very friendly and if you become a regular as my husband and I have they know what you want when you wake through the door. The burgers are made not just with ground beef but also trimmings of the best cuts of steak. If you live in Pittsburgh or are just visiting this is a must for food while in town. Top 5 favorite restaurants ever!!!"}
{"text":"Really good burgers.  Old school.  The unique thing about the burgers is the wood smoked taste.  I ordered the home fries as a side and they were excellent.  My son ordered the potato salad, and that was also very good."}
{"text":"This place was highly recommended by the book \"Hamburger America\".  The idea sounded great... wood fired burgers.  We were really excited and it was closed the last time we drove through Pittsburgh.  We made a trip back with Tessaro's being the big plan.  After all the hype, it was somewhat disappointing.  The place is really cute and the service was great.  The burger looked great and the texture was great, but unfortunately the flavor was not there."}
{"text":"I've been around the block with burgers. This remains to be the best burger in the world to me. Get a burger with american cheese, some mushrooms, and onions at Medium Rare and you'll love it.   Its a \"good ol' place\" and definitely brings a pang of nostalgia into my side (especially after eating so much!)."}
{"text":"Good place to have a reasonable meal. Cool that everything is made out of an extremely small kitchen that you can see but the food didnt live up to the local hype for me.  Burger tasted alittle bland, and extremely large.   The restaurant is also very \"packed\" tables are very close together. Home fries option but no 'french fries.\""}
{"text":"Stopped in after the Pitt football game on Saturday pm. Called ahead to let them know our party of 10 was headed their way. They were very accommodating . Had our table ready in no time in the back room. We all had a very nice meal and also able to have a nice group visit.       Now the food.... The Gourmet Burger and hash browns did not disappoint! Juicy, a hint of smoke and large.        Price had to be wrong right? I picked up the table bill and found that 10 people were fed and happy for $116 before tip?    The people that we encountered during our visit were all friendly and top notch in customer service which is never a given.     Will definitely return!"}
{"text":"I came here for lunch with a few coworkers on a Thursday afternoon. It was a little crowded, but we were seated right away. This place is simple. No frills, which I enjoy. I decided to order something simple and heard wonders about their burgers. I went with a cheeseburger, medium well, with pepper jack and all of the toppings (lettuce, tomato, onion, pickle) with a side of home fries. I wasn't super impressed with the burger for the hype that surrounded them, but it was decent. It seemed a little dry to me, like the juices had been pressed out of it. The home fries weren't anything crazy tasty, but they were good. I was stuffed when I left, and I wasn't even able to eat the entire burger. The service was great and I loved looking around the restaurant at their decor. I want to give this place more than 3 stars due to it's history in the burgh, but I really wasn't impressed by the burger. I would definitely love to return and try something else on the menu next time."}
{"text":"In Pittsburgh for my girlfriend's birthday and heard good things about their burgers so we checked it out... The server we had ended up being terrible. She was very rude and even made us uncomfortable at times. The home fries weren't bad but I was overall disappointed in my burger. Would not return again.."}
{"text":"Tessaro's grinds their burger beef fresh, so you can order yours rare and not worry too much about dying from e. coli (though I suppose the threat remains). I get my burger, rare, with caramelized onions and dijon mustard. It is euphoria-inducing.   This place is run by the most gracious and lovely women. I feel so at ease here, I wish I could move in. There is a sort of serene-yet-clubby atmosphere, like a men's cigar club that has been suffused throughout with a wizened womanly vibe. Whenever I come here I never want to leave.  The only downside is that if you go with your veggie friends, they won't have many options. So don't bring them."}
{"text":"I'm always trying to hit up places that are listed in the fantastic book \"Hamburger America.\" Tessaro's is one of two places to be listed for Pennsylvania. I visited while in Pittsburgh a few weeks ago with high expectations. I like the joint, it seems like a family run business, and there's a lot of people coming and going. We didn't have to wait long for a table, and the service was fine. I do like the atmosphere, but I just had so many better burgers that I just can't rave about this place.   They don't have a frier, so your burger comes with home fries or potato salad. This wasn't bad, but I really love the classic combination of burgers and fries. Maybe it was an off day. I know they have their own butcher who works in house, and that is exciting. But the burger wasn't memorable at all.   Bottom Line: I've had better."}
{"text":"Tessaro's is like you plunked a Cheers-style bar in the middle of an already crowded restaurant.  Even with the bump-out they did about 10 years ago, it gets crowded during peak mealtimes.  That said, if the possibility of the waiting in line and maybe getting jostled or shoehorned into your chair to eat isn't off-putting, the food is great.  While the place is known for its burgers (they are some of the best I've ever had) they also have ribs on Thursday and a Mexican night as well.  Every night they have grilled seafood which is good.    The service is efficient--they get the orders right, they are pleasant, but not overly so.  I've also found them to be attentive, even when the place is crawling with customers.  As other reviewers pointed out, they don't have a deep fryer so you can't get fries with your burger.  But their home fries are really, really good.  So much so that you really will not miss the absence of fries.  Their potato salad is also good, a close second.    It's a bit sad going there these days since Kelly, the restaurant patriarch, passed away.  But the restaurant goes on!  A final note:  they do not have a dessert menu and send everyone over to Crazy Mocha next door (their desserts are only OK)."}
{"text":"This place is all that - food awesome, atmosphere awesome.  I hadn't been here in years and I have had dinner here twice in the past month.  Definitely need to put this place on regular rotation.  I even think this would be a good place to come for a drink.  And I just learned that Mondays are Mexican night - I had a burrito for $5. But as my fellow guests pointed out, why order mexican when you can order a burger."}
{"text":"I would consider myself the burger connoisseur.  I would say the rare burger with mushrooms and raw onions at Tessaro's was definitely one of my best burger experiences.  The meat had a nice flavor and the bun was not \"bready\".  Two signs of a great burger and  the rest is just fluff.   The only reason I won't give this placet 5 stars is the bartender was not friendly...AT ALL!  Our waitress on the other hand made up for it."}
{"text":"Nothing extraordinary to write about. Don't see what the fuss is about their burgers. Had the gourmet kelly burger, which was only ok. Its often tough to cook medium but would've expected they got that right. Would much prefer a burger from many other Pittsburgh joints including Butterjoint, BRGR, and Burgatory.   Daughter liked her kids' burger a lot with the potatoes, which was a plus. Wife thought her gourmet chicken sandwich was pretty good as well.   Service was good, very friendly. Overall I'd rate the food slightly under 3 stars (average - which my book means good, not bad). and service above average. So rates out to a 3."}
{"text":"Eh. I was recommended this place buh one of my clients. I figured a 'gourmet' burger meant a good quality burger... Which, it was, in all respects of meat quality and unique toppers, but it was so greasy. I'm not a fan of overly greasy anything...   Just my opinion thought. I am judging a burger on greasy content, so I'm a bit of a hypocrite."}
{"text":"Tessaro's, I kept hearing, was the best burger joint in the burgh. The award, in my opinion, is still up in the air. I have quite a few more places to check out!  A huge plus to Tessaro's for their kitchen! Wow is that thing small. And the two guys working were rolling the burger patties right through the window. AHHH MAZING! I also heard Tessaro's butchers their own meat on site. I love hearing this.   Tessaro's is definitely worth checking out. The lunch crowd gets a bit tight as their tables are close. Perhaps try a bit before or after the average lunch hour. Oh, and they aren't open on Sundays so steer clear of that day."}
{"text":"I've never had a cheeseburger as good as the ones served up at Tessaro's and I've eaten a lot of burgers.  It's a small and crowded place, but it is worth any wait.  It looks a little dark from the outside, but during the day it's a restaurant for everyone.   The owner, Kelly, is usually around and sometimes chats with the patrons.  The servers are attentive and friendly like most Pittsburghers.  It's a great neighborhood restaurant and a place I'd actually go so far as to recommend to out of towners it's that good."}
{"text":"Loved this place.  Wasn't sure what to expect.  My cousin told me that they had the best burger in Pittsburgh.  Well, Ria, you were right!   Done to perfection, exactly the way I asked for it.  Not only was the burger great, the potato salad with came with it was just wonderful.  I think  Tessaro's will be on our list of go to places from now on!"}
{"text":"I came here for the hamburger. I was under whelmed. It was really noisy inside. The people next to me tried to take over my table and I moved to another table. I went for the famous hamburger and it was cooked ok, but nothing remotely special or memorable about it."}
{"text":"I haven't been here for several years.  Prior to that, I'd eat there about four times a year.  I guess I was worried about what the new management would do to a Pittsburgh tradition.    My fears were relatively unfounded.  Tessaro's is still  the same warm, local and friendly place it's been for decades.  The new ownership retained everything that mattered -- and a few things that are problematic.  I need to say that I'm a steak fan.  Good steak.  So I'm always just a BIT disappointed because the steaks at Tessaro's have too much gristle.  My friends, however, always order the burgers and they swear by them.    What continues to disappoint me are the little things.  The bread is NEVER fresh.  It always feels and tastes a few days old.  The salads also taste packaged.  The vegetable side dishes are limp.  I once commented about this to my server at Tessaro's.  Her reply?  \"Oh, honey, this is a bar-and-grill, not a fine dinin' establishment!\"  I laughed and had to agree.  So go for the burgers.  Get the potato sides.  Have a good cold beer to go with it and you won't be disappointed.    I see others say that the tables are too tightly packed and you overhear others' conversations.  That's one of the features of a place like this.  It's like one big family meal where you're always meeting new family members.    One rule I've come to live by, though:  \"Never order fish/seafood in a steak place and never order steak in a fish/seafood restaurant.\"  That applies to Tessaro's too.  My wife has NEVER had a decent fish entree at Tessaro's.  Not a slam, but an acknowledgment that you can't be everything to everybody.    A nod of thanks to the \"new\" ownership for keeping the place comfortable and friendly."}
{"text":"Overrated. No seating until all members if party have arrived...so we awkwardly hovered over empty tables.  The second bummer here was the lack of french fries  - which is borderline criminal when you offer a burger.  The bun was dry, the burger was ok, generous portion of meat though.  Nothing special here.  the crowd here is about as un-diverse as you can get. not sure what all the hype is about."}
{"text":"best burger in pittsburgh**.    ________ ** based on taste, price, service and comfortable atmosphere perfect for a casual lunch, or proper dinner."}
{"text":"Best burger in the burgh, and I've tried them all. Also a great place to go for thick cuts of steak, fish, chicken, etc. They have an in-house butcher, source the best stuff they can, and of course the wood-fire grill.  One thing to note is that they really sear the meats, so if you're ordering red meat done medium-well or more, they'll occasionally be slightly on the drier side. Most of the time they nail the char/tenderness ratio but you can't expect anywhere to get it right 100% of the time. I recommend ordering meats with a sauce on top (e.g. bbq burger, chicken sandwich w/mayo, etc) to add some moisture for the perfect combo, but that's all personal preference.   Try the ribs on Thursdays!"}
{"text":"Tessaro's has a great atmosphere - I just wish they really focused on slightly improving their burgers.  Despite the wood grill, burgers don't arrive at the table with that \"maillard reaction\" browned exterior or with enough seasoning to make them as flavorful as they should be.  Tessaros could be a 5 star burger heaven if their grill line cooks had a solid lesson on meat flavoring and on how to get the right exterior char.  Still - it's a favorite of mine as long as you go in with not too high expectations."}
{"text":"A ton of people told me to try this place, so I went.  It's very different than most restaurants. The place is old school, but so friendly. My pal and I had a great time! We got burgers of course. We are used to bold flavors and crazy combinations; but you will not find any of that here. They are simple burgers that have amazing taste. I repeat, do not have your hopes up for something that will dazzle you, but the quality is great. The meat was awesome, cooked to perfection. There was nothing gross about the meat, no crunchy or fatty bites.   Get the home fries.... Old school Heinz bottles where you have to hit the 57.   This place is worth trying. It seemed like a type of clientele that have been going there for years. Time for the younger hipsters to revive it?  Try it."}
{"text":"You when you hear about a place for years and you finally get the chance to try it out but it's bound to not live up to your expectations? That was my experience of Tessaro's. Had I never heard of it before, it may have gotten an extra star. But, this restaurant was on the Pittsburgh's top 25 a few years back. This is supposed to be the best burgers in the 'burgh. If that were the case, I'd stick to making my own.  Hubs and I stopped at T's on a recent Friday night after conducting some business in the area. Baby on board, we walked in and waited to be greeted. The inside looked a bit old and run down. Tip: they do not have highchairs only booster seats which is impossible to get a squirmy baby to stay in. I would not suggest bringing a baby here. The tables are also very small and close together. We actually had to move the table out to get in and out of the corner booth. I decided on the basic cheeseburger and ordered the boiled red skin potatoes for the baby and a side of chips for me fully expecting homemade chips. Not the case. I got a handful of what seemed to be a ruffles knock off. The potatoes were very bland despite being served with warm butter on the side. Great for a picky baby. Bad for an adult who is looking for something tasty. Now to the burger. Huge, yes. Juicy, not even close. Despite ordering my burgers well done, I expect them to still be tender and juicy. This was not the case. My burger was as dry as a burnt piece of chicken. I ate half of it. We were in a bit of a hurry so I didn't mention it to my server, though I'm not sure it would have made a difference seeing hubs medium burger was also dry. Overall, Tessaro's fell flat and left me hung out to dry."}
{"text":"I'd heard of Tessaro's for a while and finally had a chance to sample them over MLK day. I started out at the bar while waiting for my friend to arrive. They were just hitting the lunch hour but when my friend arrived, we were seated right away.  The restaurant has an old-world feel without being musty or worn out. Service was prompt and friendly. The space is a bit crowded but not oppressively so.  On to the main point - burger, burger, burger. A 1/2 lb burger topped with any variety of fixings on a nice soft bun. Expertly cooked to order (I usually prefer medium to medium-well). It's true they only have home fries on offer but I felt they were a better complement than regular french fries.  All in all, a very pleasant experience. I would happily go back again... once my cholesterol recovers."}
{"text":"We ate here last weekend on the recommendation of my son's professors.  They told him to 'look for the smoke\" and we would be there.  We did follow the smoke and it smelled wonderful.  We were able to find a parking lot about two blocks away but the walk was nice.  We only had to wait about 20 minutes which is good considering the size of the place and all the people waiting.  The place is small with a large bar, dimly lit, you can watch the cooks make your food through a large window at the back of the dining room.  We couldn't get past the burger menu. There are other things on the menu but we came for burgers.  I has the blue cheese/bacon burger and it was fantastic.  The home fries were so good but they contain bacon in case your a vegetarian and don't expect it.  They are great.  My husband had a cheddar burger and it too was great.  Full bar service.  Can't wait to go back!"}
{"text":"I'd heard that Tessaro's had the Best Burger in Pittsburgh and went to check that out. So far, I confirm that reputation. I have a couple more places to try in the 'Burg, but it will be hard to beat Tessaro's.   We were welcomed in a friendly way and shown to a table where we  received great service throughout the meal. The burgers were excellent. And be sure to order the Home Fries - amazingly great taste."}
{"text":"My family has been going to Tessaro's since the 80's and it's a staple in Pittsburgh for a reason. All the food is really great, the service impeccable, and the ambience top notch. Burgers are their forte but the other options are just as good.  Check the fish specials on the big board to the left as you walk in. My personal favorite, the Chicken Kebab with blackened chicken and potatoe salad.   PRO TIP: Also get the broccoli grilled. Phenomenal."}
{"text":"In theory, Tessaro's is exactly what you want -- a casual neighborhood joint in a great location with an acclaimed product. In practice, it's not very pleasant to go there. I don't think they want us there. Every interaction seems designed to make people feel awkward.  The burger itself  -- the actual cooked meat -- is indeed good, but they have no interest in all the other stuff that turns cooked meat into a hamburger experience.  The buns are poor quality; they absorb juices and toppings so they get sloppy and disgusting after a few bites. The burger just falls apart in your hands (or onto your lap). You have to finish it with a fork.    They don't serve French fries, and they seem affronted when you ask for some.  This is a bizarre, given that everything else about the place screams \"we have fries here!\" Why withhold fries from customers who surely have been asking for them every day for years? This hints at either a weird purist dogmatic sensibility, or deliberate sabotage.  Why not serve fries *and* homefries?  Are they afraid the fries will win, exposing the hollow sham that the homefries have been all along?  I've come to believe that everyone at Tessaro's is under a spell where they must cook and serve excellent hamburgers, but they hate cooking and serving hamburgers. Everything about the restaurant that is not an actual meat patty is cleverly designed to keep you away. But you  keep going back.   Have some pity for the poor cursed Tessaro workers, and just go up the street to BRGR, or downtown to Winghart's."}
{"text":"Fantastic dinner.  I had a chicken kabob grilled with veggies.  It was very tasty.  The best.  Highly recommended.  Their burgers looked really good too! Service was excellent."}
{"text":"A great Pittsburgh Restaurant.  If you want to get a taste of some great local food here, this is one of those places.   I would recommend that Fillet Mignon. I got a 16oz special cut medium rare.  One of the best Steak's I've had in a while.   I've had the burgers here, and probably Pittsburgh's closest equivalent of RJ Grunts in terms of good burgers."}
{"text":"\"You're in the hot seat tonight. That's where Christian Bale sat on Thursday!\" said our sweet waitress to my husband. \"He had the bluest eyes. I was going to ask him if they were contacts, until I realized who it was.\"  Perhaps needless to say, I proceeded to spend most of the rest of dinner imagining what it would be like to have dinner with Christian Bale, but each time I was brought back to reality by a bite of my tasty burger. I went with a traditional American cheeseburger, while Christian, I mean, my husband, got the Gourmet burger. Both were cooked to our specifications (medium and rare, respectively), and were juicy and flavorful. No french fries here as sides, which is an interesting decision, and makes the experience more unique. Though we could have gotten something healthy, like steamed broccoli, we both went with the home fries. They were great: tender on the inside, crispy on the outside & flavorful. Because so many of the review focused on the burgers, we were surprised to see they have lots of other menu items, including fish & ribs. So, I plan to return and give some other menu items a try. Prices are very reasonable, and I'd say easily the best burger I've had in Pittsburgh (though it's no Vortex burger!!).   And, by the way, Mr. Bale is an excellent tipper."}
{"text":"Best Burger In The Universe. I am a burger lover.  People ask me, \"Alli, where can I get the best burger in DC?\" I tell them that they need to take 270 to Frederick, get on 70 west, get on the PA turnpike, and get off when they're near Pittsburgh.  Ask anyone how to get to Tessaro's - I'm sure they know.  Your burger will be huge, dripping, and will be so juicy that the bottom bun will be a disgusting soggy sponge.  None of that will matter, because you will be in burger heaven, delighting in the freshly ground beef that makes Tessaro's what it is.  The restaurant itself is barely more than a bar, with mean waitresses and tiny, crammed tables.  No one would probably ever go there (besides the old, crotchety regulars) were it not for the world-famous burgers.  All testament to why you must go. Now."}
{"text":"Pretty good mushroom appetizer. I got the salad and the saltine didn't really go with it. It was very fishy and would have been better if it was not with the salad in my personal opinion. But I would definitely go there again!"}
{"text":"A steakhouse in Bloomfield.  Went there on a Saturday night looking for a good burger.  It was a little crowded.  The burger was large and very tasty.  The buns need a lot of work.  There was no bread or anything beforehand and no appetizers on the menu.   No drink list either, though there is a bar.  AND no dessert menu.  I just felt like they were missing so much and don't quite agree with the high ratings on this site.  The home fries were great though."}
{"text":"I know, it's a Pittsburgh institution and we're supposed to rave about it and declare it the \"best in the burgh\". It's not. Not even close. I've eaten there many times in the hopes that maybe I missed something. Maybe it was me. Oh but it's not. It's not me. It's just not that good. Over hyped, underperformed. Burgers are adequate - nothing special. Order something other than a burger and you don't get much better.   Years ago it might have been worthy of its reputation since there weren't a lot of competitors. Now, forget it. Burgers are ubiquitous and great ones are everywhere. Best burger in the city is at Kaya - the Kaya burger. Tessaro's - a fading icon of days gone by.  Enjoy the crowds, convince yourself your getting the best, that you're in the know. You're  not."}
{"text":"I am going to let yinz know that it isn't the best burger in the burgh....  it's actually the best hamburger in the world! And i don't use superlatives lightly. Not the bun, mind you, the bun is kinda weird, but the meat is insanely good. I don't quite get it, you get a burger anywhere else, it tastes like a burger, the meat roughly the same. What do they do to this meat? It totally transcends burger meat! And it is enormous.   I was on Atkins for a while when I lived in the burgh. Funny, i couldn't be paid now to live without carbs but maybe that's cos I ain't near Tessaro's no more!   Be aware this place is kinda small, cramped, loud, dark, smoky....you might wait a while if you go during prime time dining....and i think they break hearts on sundays (e.g. closed)"}
{"text":"Even though it's been almost two years since I moved from Pittsburgh, I still think about the burgers here... tastiest burgers in the world. I plan to make Tessaro's my #1 restaurant stop when I return to visit to PGH. Restaurant itself can be a little noisy, but I frankly don't blame them in the least because the food is SO good here and I'm glad they're so popular and busy!"}
{"text":"While this place isn't a lot to look at (we were sat by the bar), the hamburgers at Tessaro's live up to the hype. They are thick and juicy with a little bit of char on the outside. You can get whatever you want on one and I got mine with a side of potato salad.   Perhaps I was seeking comfort from the previous day's Steeler Super Bowl defeat, but I ate my burger so fast that I bit my lip at least twice in the process. Damn Tasty!   Would go back, especially since it's just down the street from my sister's place in da 'Burgh."}
{"text":"Everytime I've been there the food has been bad, the burgers are alway burnt and raw in the middle. Once time porkchop were great next week they were horrible. Almost everything that isn't burnt has no taste, salt & pepper do wonders to food. Service was bad we got out salads 45 minutes before the entree then given another sald for wich the waitress tried to take as my mother was eating it.   I would not reccomend it I would tell everyone to keep on walking."}
{"text":"Not expensive at all for what you get. Burgers beat burgatory, fat heads, just about another other place. Would definitely recommend."}
{"text":"This is NOT the best burger you will eat in Pittsburgh.  People only like these burgers bc they are huge.  They serve you an entire ground up cow on a mini van sized bun.  The best burgers are at Tavern 247.  Its a secret but its truth.  However, I love all of their entrees, and I love the cozy atmosphere of this restaurant.  This place gets very crowded, but its worth the wait.  The food is really good.  Its not great but its really good.  Def worth checking out."}
{"text":"Kudos to Tessaro's for cooking my burger the way I ordered it.  Most places won't give you a \"medium\" burger; it usually leans toward medium well, at best.  Tessaro's took a liberal approach to medium and it fared more toward medium-rare to my surprise and delight.  So for that, hooray!  And it definitely was the plumpest, juiciest burger I've had in a looonnngg time.   That said, I really wasn't as impressed as I thought I'd be.  I thought I liked my burgers pure and untainted, but here I found myself wanting a little more flavor.  I guess it just tasted a little bland.  The homefries, also a little bland.   I don't know...maybe my expectations were too high.  Despite being underwhelmed by the food (by no means dissapointed), I loved the atmosphere.  It was cozy and bustling and unpretentious, and the service was spot-on.  Once seated, we didn't have to wait for a thing.  Our orders were taken immediately, our drinks arrived at our table within a minute of ordering, and our food arrived in a reasonable amount of time.   Good to know: They won't seat you unless your entire party is there.  In this case, it was just my husband I was waiting on.  That was a little annoying...but understandable considering how busy they are.  Definitely a solid burger worth the praise and the totally reasonable price!  I probably won't go out of my way to go back, but I'd definitely take an out-of-town visitor for a meal there and it's a definite stop if I'm in or near the neighborhood."}
{"text":"Tessaro's is a Pittsburgh classic, and it feels like a classic, old school place when you walk in.  First, the whole \"this is not the best burger in Pittsburgh\" comments... it's also a lot less expensive than a lot of the burger places in Pittsburgh.  This is not the kind of place you come for a million toppings.  This is a straight up, non-fancy, large burger.  It's not trendy, and it probably never will be.  Otherwise, I came here and personally ordered a whiskey sour and a cheesesteak with coleslaw.  The whiskey sour was spot on, and the alcohol content was spot on as well.  The cheesesteak was great, not particularly traditional, but great nonetheless.  The steak was tender and there was plenty of it.  Lots of cheese.  No complaints!  My parents' meals were great too!  If you need some meat and friendly service in your life, Tessaro's is a great place to stop."}
{"text":"Good, not quite the top though.  I liked sitting at the bar.  I liked my burger a lot (a good bar burger is a meaningful thing).  And the other food coming out of the kitchen looked really good.  Good range of crafty tap beers.  I think that the reason I'm withholding a fifth star is a little bit because of expectations; the Pittsburgh city mag has this on their top 50 restaurants and that brought me here, and I got done with my meal and said to myself...really?  I mean good and all that but one of the best in Pittsburgh?  Not sure.  I'd go back but I'd also keep exploring.  Maybe if they had had fries...hard to really fall in love with a burger without some fries on the side...a bar burger is crying for fries on the side!"}
{"text":"Well... the same thing happens again.  I had not been here since 12/2011 so it had been awhile and my hubby and I were looking to grab a late lunch yesterday since the weather had been so awful (we decided to go closer to home).    My MEDIUM (AKA pink in the center) burger was still alive.  It was mushy, bleeding and not medium for sure.  I am not a complainer, rather I just will not be back for a burger.  Chips were good.  The last time I must have had the home fries and something told me to not order them this time.  I am glad I opted for the chips as there was no way that they would have been able to ruin my meal more.    I am going to have to stick with other burgers for now.  I am utterly disappointed in the \"best burger in the 'Burgh\" according to some people.    On a positive note, the service was good... unfortunately, if you cannot get what you are famous for right, it is going to be hard to keep people coming back."}
{"text":"People who know me...know me as a food fanatic.  Tessaro's is one of my favorite restaurants in Pittsburgh, hands down.  It is not pricey.  It is not pretentious.  It is all-American and good food.  Everything about it is so...customer-centric that recalls the essence of Pittsburgh.  The host (normally the owner - check out his fantastic Heinz bottle tie that he wears every Friday) takes the number in your party and actually remembers your face.  People come here normally for the burgers.  The patty is incredibly juicy (they ground it in the restaurant, not delivered, very fresh and you can taste it).  The lettuce crisp.  Tomatoes no exception.  I can't comment on cheeseburgers since I don't like cheese in them.  I have been here for Thursday Ribs night and it's absolutely fantastic, particularly the chicken ribs.  Gets very crowded during the dinner rush hour so expect to wait between 6-8 pm."}
{"text":"Delicious.  A bit crowded, especially on weekends, expect at least a 20 minute wait.  But, you can curb your appetite while you wait with a draft Magic Hat #9 at the bar.  Can't get much better for burghers who like burgers :)"}
{"text":"I have been to Tessaro's twice now after hearing about their famous burgers.  I had very high expectations based on everything I had heard.  And while it is certainly a good burger, I expected a little more.  The feel and menu in Tessaro's is very old school.  I do like this to an extent.  This traditional style is reflective in their menu.  There are very few options in terms of burger customization.  This is an area where I think they could innovate a little.  Some onion straws or an aioli of some sort would make the burgers here even better.  The burger itself has been cooked perfectly both times I have been here.  The burgers taste seems to have a higher lean ratio than other burger places.  Despite this, the freshness and unique meat blend still makes for a delicious taste.  Overall, Tessaro's without a doubt has a great burger.  However I cannot put it on par with the best burgers in the city."}
{"text":"I had the black and bleu  burger and it was fantastic.  Juicy, cooked to perfection with crispy bacon and just enough bleu cheese, to make it tasty, but not overpowering.  I shy away from ordering potato salad at restaurants, but the large portion they provided was delicious.  My son's burger me the same standard.  Professional wait staff was attentive and prompt.  The burgers were huge.  Come hungry, leave full"}
{"text":"The old school vibe and hospitality of Tessaro's keeps me coming back nearly each week for a gourmet burger or the rib combo on Thursdays. I'm not sure that there are more welcoming managers or servers anywhere in Pittsburgh. The beef and pork rib combo on Thursdays is awesome and hard to drive past after a long days work. Beef ribs are pretty rare and getting to enjoy both in one meal even more so. The burgers are nearly always cooked perfectly. It's a few more dollars than the burger next door but u can guarantee that they didn't grind the meat and pack the patty by hand before it went on the grill."}
{"text":"I cannot believe i waited 4 years to finally try out Tessaro's. I've thought about stopping by a few times not to mention by boss' eat here atleast twice a month, but for whatver reason i just never made the trip to bloomfield to try it out. We couldn't decide where to eat last night and finally decided to drive over to Bloomfield & stop in.  The building itself is old-school looking. I feel like i took a step back in time. We were originally seated upstairs near the patio and asked the hostess to actually eat on the patio last minute. It was cloudy and chilly but it was still great to sit outside.  I couldn't decide between the Barbeque Burger (& add bacon) or the Breakfast Burger. I ultimately decided on the breakfast one with home fries. I couldn't decide between those or their infamous potato salad. Our server mentioned i could do half & half, but i love home fries Bobby went with the Gourmet Steak Sandwich and went with the potato salad as a side (score) He also enjoyed a Hoegaarden while we waited. We were completely satisfied with our meal. It had to be the largest burger i've ever had. I took a picture of it as plated but should have assembled my burger for a pic to show the true size. Next time!  Our server was Briana and she was a great server! Actually, every person i ran into (I got lost on the way to the restroom) was very friendly and kind.  I dont know why it took so long to try out Tessaro's, but it will NOT be another 4 years til we go back ;)"}
{"text":"They say there are the 3 \"C's\" that make up the very best restaurants: consistency, consistency, and consistency. That's what makes Tessaro's the best burger in the city, simply put."}
{"text":"Went here for lunch the other day.  I have been here many times and do like it a lot.  For many years this place has been voted Pittsburgh's best burger.  It also has been voted the longest wait for a table.   This place is known a lot.  When I tell  people that I am from the area, people often go \"what is that place with those huge burgers\".   As they are using their hands, and before they finish, I say Tessaro's.  Then they go \"that's it!!!\"  I am a very very picky eater.   I generally eat my sandwiches with no bun or open faced.  (it is a calorie thing with me.).   Granted the burgers are delicious.   Granted their burgers and other sandwiches do have tons of what you ordered to be on them.  Plus the bun itself is huge.  You do need two hands to enjoy your sandwich with.  I love the way they cook their burgers on the hardwood grill.  As soon as you open the door you know that you are in the right place."}
{"text":"My family and I are visiting pittsburgh for a week and we went here because the reviews were very good. I ordered my burger well done. Half way through eating it, it started getting very pink so I just stopped eating it. My son's burger was well done and his was fine. I didn't say anything because I had eaten half of it already and we were kind of in a hurry. My husband got a steak sandwich. He said it was Ok nothing special. The food came out fast and it was a nice atmosphere. Like I said the food was okay and got the job done but nothing to get excited about and be like omg yes I need to go to this place every time I come to pittsburgh."}
{"text":"I am not from around this area and I was in the city for an event, I came on yelp to help me find a place to grab something to eat because when I travel I like to try different places rather than chain restaurants. I was not sure what I was looking for food wise but I seen the photos posted from customers and figures I would give it a try, and I am very glad I did.. Food was awesome!! Large portions and a variety on the menu I could hardly decide what I wanted because everything looked so good! The service there was great our waitress took the time and actually had personal conversations with my mother and I. I would def come again when I am in the area!"}
{"text":"For such a famous place, it was much more low-key than I would've expected. Maybe we came in late on a quiet night, although many of the tables were still occupied with a few at the bar counter. Servers generally took their time and conversations took place at a calmer pace, which was actually nice for a change from the usual bar scene.  The burger was indeed good. It was less juicy than some others I've tried, and the outside of the patty might have been a bit too burnt for my taste, but overall it was a good meal. The size was just right, and the price at less than $10 can't be beat, since it comes with a side as well. I think some other places have burgers that are fancier or juicier (Fatneads, Wingharts, and Butterjoint come to mind), but this is definitely the place for an inexpensive and simple option."}
{"text":"For me, eating at Tessaro's is like eating a Costco hotdog. When it's happening you're lovin' it. It's tasting good and you're feeling like a red blooded American. When it's over you can't stop asking yourself \"Why did I put that inside me?\" This place makes my GI system do cartwheels 100% of the time. Now, I realize this place has a reputation as a Bloomfield staple, but something they're doing doesn't agree with me. Maybe I should cut down on the Costco dogs?"}
{"text":"Tessaro's is an amazing institution and everytime we have come here the food and service has been perfect. The wood fired grill makes the burgers the best I have had in town (and perhaps in the country). The bar is classic and the wait staff are attentive and know their stuff. This is the kind of place you take visitors when they come to see you up in Bloomfield. Go in, get a burger, get a beer, bask in the joys of life."}
{"text":"I felt very honored to have been taken to this \"Pittsburgh Cornerstone\" as it was referred to. The place reminded me of the basement of an Elk's club complete with the paper placemats, uniformed waitresses, no-frills liquor bar, mirrors and of course the loud bunch of dudes at the bar joking about the \"good ol' days\" Immediately walking in, felt comfortable and knew that the food was going to be fantastic.  It definitely was, had the BBQ chicken with a side of steamed veggies, salad and bread rolls - very simple but also the best kind of meal there is. Meat and carbs done right, lots of butter, lots of potatoes and plenty of salt. The waitress didn't hold her tongue on her opinion of various dishes and upon returning, will definitely try one of these supposed world-famous burgers."}
{"text":"It had been many years since I've been to Tessaro's and it's still just as great as I remember. We went on  Monday night and there was a really decent sized crowd, which is always a good sign. They had great sized wine pours and terrific service. The pork chop my son had was excellent done on their wood fired grill, as was the burger I had. We didn't venture to try their Mexican menu, which they were featuring that night, but I can only speculate that it was good, also. We will definitely be back."}
{"text":"Great atmosphere. Love the food. I will recommend this place to everyone. Very impressed with the quality of my food. This is important to me. Good job Tessaros!"}
{"text":"This is one of the better places to get good food at a great price in Pittsburgh. I have been eating here for 12 years and almost always order a burger. They are the best burgers around; hands down. The Rachel (sandwich) is excellent as well. Make plans to dine here for lunch and try a burger. You won't regret it."}
{"text":"I have eaten here before and I was very Impressed with the Gourmet Cheeseburger.   The Burgers here are \" special \" You have to try one to understand \"Special \" ( that means GREAT for you bone heads out there )  This time I had the BEEF Ribs. They were cooked perfectly .The Flame from the wood fired ovens made these ribs so tender and delicious.....  The smell of the wood fire will make a vegetarian beg for a beef fix. The staff was very friendly and very accommodating.   have  to give you guys a 5 star here !    This place will go back to being one of my favorite Pittsburgh treasures."}
{"text":"This is a great place! Great Cajun burger, one of the juiciest burgers I have had and I have had a lot of them. I grew up in cattle country and live in KC. Also, great red skin potatoes. A must. And all for a great price. Lisa was our server at lunch and she is excellent. This is 5-star food for a great price."}
{"text":"Solid burger and some good beers on tap.  I was worried it would be packed from what I'd read elsewhere but there was plenty of available seating at 830pm on a weeknight."}
{"text":"This is one of our favorite places to go to! The burgers are to die for and the service is always great. I love the old diner feel to this place. I always get the breakfast burger and redskin potatoes. It never disappoints!"}
{"text":"Tessaro's is a-ok, since they're famous for the burgers that's exactly what I had there - a classic cheeseburger with cheddar, medium-rare. The burger was soft and juicy but otherwise rather plain, the cheddar cheese didn't add enough flavor to it. The decor is a little interesting - denim tablecloth, wood and vinyl booths, and red christmas bows on the lamps? My big gripe with the place was the lack of space between tables. When we were seated, the hostess had to literally pull the table out, let me and my friend sit and then push it in, so we were nice and tight between the benches and the table. When a couple next to us had to leave, we had to pull the table out again..."}
{"text":"Unlike my boyfriend Darren W, I'm not much of a burger fanatic, so when we came here last night, I tried their bbq chicken, and thought it was very good. Very moist and sweet. Also, as a side, I had the broccoli which was perfectly steamed. The service was awesome, and the place has an old-time charm to it. It worked for me. They have no desserts, but I guess that's what Oh! Yogurt's for. :)"}
{"text":"Reviewed as one of the best burgers in Pitt and a popular spot among many CMU students, if you have a car of course. Parking is horrendous around here, so it might be better to take the bus anyways and do a bit of walking.  After hearing so much about it, my friends and I came here to celebrate a birthday. Did it meet all the hype? Not so sure. The burgers good, but it wasn't anything spectacular as I thought it would be. Honestly, I like Burgatory a lot better. I ordered the Bacon Bleu Cheeseburger with dry bleu cheese. Probably mistake on my part. I thought the dry bleu cheese would be more crumbly and less creamy, but the heat of the burger melted it and it became creamy anyways (I dislike creamy things in general). Didn't enjoy the burger half as much because of that, but again mistake on my part. The home fries that came with it could have used some more seasoning, but with lots of ketchup it was tasty enough.  The service was up to par. I came with a huge party and they seated us and took our orders with no problem. They even stuck a candle into my friend's burger for her birthday. Overall, I'd give this place a 3.5 stars."}
{"text":"I went here with my fiance and his sister. We each got a different burger with different sides. Each of us was extremely happy. Our burgers were cooked to the correct temperature which doesn't happen very often. The fries were really tasty and the portion size was great. The only complaint I have is that it was very crowded and it felt like we were almost sharing a table with the group next to us because we were seated so close. Other than that, I would absolutely go back and eat here."}
{"text":"I also left here scratching my head after all of the lofty reviews of the place.  Yes, maybe it is a local institution, but it is not worthy of one of the highest yelp ratings for a restaurant in Pittsburgh.  The burger was mildly admirable.  I'll trust their word that they use high quality ground beef, but it's still ground \"beef\", not ground sirloin or anything.  It was also huge, cumbersome, greasy, expensive and flavorless.  The amount of blue cheese they gave me for 50c was almost a joke, as well.  Wish I would have gotten the steamed broccoli, my \"potato salad\" was a sea of mayonnaise.  Even given my limited experience of the burger options in Pittsburgh, I would put double-wide grill's burger above these.  Not much for atmosphere.  Don't get me wrong, I don't mind dirty, dark and dingy if it has character."}
{"text":"This is not only the best burger in Pittsburgh. It's also the best burger in the USA. Cooked to perfection.   The home fires are off the hook too.   There is other stuff on the menu but stick with the burgers.   Great eats. When in Pittsburgh I will make time for a stop at Tessaro's."}
{"text":"After striking out at Pleasure bar for my meatball fix I decided to go burger! From the reviews I have read from my fellow yelpers I have been excited to try \"the best burgers in the burgh\"   Alas my anticipation for stop number 2 was snubbed out because they were closed too. I called and was informed that the hours of operation are Monday-Saturday 11am-11pm. Three other patrons were also going burger and sadly I had to break the news to them too. Oh Dang! Maybe a dog would do the trick? After seeing the Oscar Meyer Weiner Mobile and a quick photo opp Frankie's Extra Long was next on my list."}
{"text":"Tessaro's is definitely the best burger you'll find in Pittsburgh. Their sides are also delicious. If you have vegetarian friends that protest, they have vegetable kabobs that are actually really good as well. If you love burgers and you're in Pittsburgh, you'll have to try it out. If you've been but haven't gone back in a while, what are you waiting for?  During peak meal hours, the wait can be about 15-30 minutes. The staff is friendly and helpful - they know that they serve a mean burger, and they are happy to be part of it all.   One warning, be prepared to be stuffed."}
{"text":"The burgers are amazing!!!! I could eat them once a week. I would love to know how they get such an amazing grill taste on the meat. I bet the steaks are also awesome. I am definitely trying one the next time. I was disappointed they didn't have fries bit then I ordered the home fries and I can say I'm glad fries were not an option. They are excellent!!! Will definitely be back."}
{"text":"Never understood all the hype about this place. The burgers are rather bland and burnt.  No fries, only their potato things which are NOT as good as any fry I have ever had.  And the wait was always ridiculous to boot.  I admittedly haven't been here in a few years, but it doesn't seem like this is the type of place that would have changed."}
{"text":"3.5 stars. Had dinner at Tessaro's recently on a random Wednesday night and it was super busy.  Luckily we didn't have to wait long and were seated soon as they could clean off a table.    I ordered the Cajun burger (medium well) with American cheese and all the fixins.  I got the potato salad as a side after reading the rave reviews about it.  While I wasn't too fond of the potato salad (I rarely am) I did enjoy the burger.  Although I was disappointed that it didn't have more of a Cajun flavor to it.  There were some bites that snapped back with spiciness but for the most part I couldn't get much Cajun flavor.  I really enjoyed the charred bites of the burger...some folks may not really appreciate this and it wasn't overwhelming, if it was I probably wouldn't have liked it.  But overall it reminded me of a great burger cooked at a BBQ!     One thing I didn't realize is all the fixins come on the side for you to put on it such as the pickles, mustard, ketchup, mayo...it worked out though since I wanted a little of each."}
{"text":"I love hamburgers so I've been to quite a few burger places in Pittsburgh and this place is probably one of the best. Service was great, the burger (I had the BBQ burger) was awesome, and the price was decent too. My only complaint is that my burger was a little overcooked but it wasn't a big deal..."}
{"text":"The first time I walked into Tessaro's, I felt at home. It might be the inciting smell of meat wafting from the grill (home is where the meat is), or it's the way you feel welcome the second you walk through the door.   Tessaro's is a Pittsburgh legend, but I hadn't been there for the first time until about 6 month ago. The wood interior is cozy, and I've never seen the place anything but packed. That being said, it's never taken more than 10 minutes to be seated.   I can't tell you about anything on the menu but the burgers. I can tell you though, the burgers are amazing. They come on massive buns with all the fixings, and a cup or mayo or mustard. While I dabble in the breakfast burger, I almost always get a standard cheese burger. It's consistently delicious.   I think the one thing that ticks people off is that Tessaro's serves home fries instead of french fries. DO NOT BE DISCOURAGED--those sliced up potatoes are delicious, and in no way do I miss a plate full of freedom fries.    Judging by their lunch menu, Tessaro's has a decent sandwich game at lunch. I'll be the judge of that at a later time."}
{"text":"Came here to try their famed burgers.  I ordered the gourmet burger, and not bad.  However, it was absolutely nothing special. I felt like I could easily make it on the grill at home.  Also, the home fries were just mediocre.    I don't understand all the rave reviews for this place.  As for me, I don't think I'll be back."}
{"text":"This is the one place I miss the most. I went to school in Pittsburgh and discovered this gem of a place in my junior year.  My friends and I have differing opinions. I think this is the best burger spot in Pittsburgh hands down. I love their breakfast burger with Bree cheese. SOOO Juicy, Soooo Goood.  They do medium rare burgers right. Every time, I go to a gourmet burger place they always over cook the burger. I have lots of love for this place and I try to go every time I visit the Burgh again."}
{"text":"I have been here twice....and both times I have been very impressed.   I would say if you are looking for a BURGER...simple, regular, no frills then this is your best option.   While places like Burgatory offer a wide selection of culinary choices in meats, sauces, breads, and toppings....Tessaro's says take the freaking giant tasty burger and enjoy the finest piece of ground cow you will stick in your mouth."}
{"text":"Me and Lady Friend of Joe (or lesbian friend) saunter into Tessaro's and I chose her to accompany me since her love of animal protein is well known in the south hills. This girl grills meat outdoors in sub zero weather.   I orders the bacon cheese burger with grilled onions and potato salad (no fryer, hence, no fries) LFOJ orders the same, exceptin' she gets the home fries.  I orders an iPA since I find that's the best tasting beer for wood fired grilled meat. LFOJ orders a bottle of Coors light  Our burgers are brought out and when it was put in front of me, the smell was truly a religious experience. Like a hundred and forty three angels were singing the Ava Maria.  My burger was grilled a perfect medium rare, LFOJ ordered her burger medium, the first bite was an incredible burst of grilled beef flavor, so much so, the bacon was completely overpowered. This was a burger that deserved national attention. Okay potato salad, nothing spectacular, but it was only a side, the burger was the star of this meal!"}
{"text":"Bland, tasteless, forgettable  Because this is what you want to know:  They boasted a hefty patty and nice toppings and the house potatoes smelled great. They unfortunately forgot what seasoning is. The worst  let down was that they squished out all of the juices from that poor burger, leaving it hard and dry.  The only flavor left in my mouth after a few moments was of the pickle.   Pittsburghs restaurant scene is definitely on the rise, and when a place can boast, \"the best burgers in the burg\" I definitely had to try it!  I've had Burgatory's \"meat your maker\" Kobe burger, and BRGRs steak burger and even bargain burgers like hello bistros e'mp burger. This was the most forgettable burger and, at the higher price point, truly disappointing.  With so many better options out there, save your money for a place that's worth it.   Just in case you are wondering what I got, I went with the Gourmet Kelly Burger: hardwood grilled, pepper jack, bacon, grilled onions, and the typical accoutrements of lettuce, tomato, pickle, mayo, ketchup and mustard."}
{"text":"Another Burgh outstanding establishment.  The burgers are Da Bomb but if you like fries, you'll have to go across the bridge to the \"O\" because they have NONE!  Don't worry, the burger will more than make-up for no fries.  The grilled veggie Kabob was also outstanding (no stick to get in the way either).  Enjoy...I sure did!!!"}
{"text":"I ate here last week with a dining companion as I have many times before.  The decor of the restaurant was what I would consider homely with brick walls and a fireplace upstairs.  For dinner both myself and my dining companion decided on the  bacon-bleu burger.  I ordered my burger medium and it came to me at medium rare but still tasted pretty good.  It was also nice to have the option of wet or dry blue cheese.  For sides I had the cole slaw and my dining companion had the home fires. Neither was terribly inspiring although not too bad either.  The bottom line for me that this is a decent place for a burger although it is far from the best burger in Pittsburgh as many claim.  I am sure that I will be back in the future as their wait staff is always good and the food worth the price."}
{"text":"I haven't been here in a couple of years but have been there numerous times in the past. Absolutely the best burger in pittsburgh."}
{"text":"The burger is great. Staff is a bit overexcited but still nice and prompt. The potato salad is absolutely amazing. The restaurant is very clean and beautiful on the inside. The drinks are a bit pricey. Overall, I would say this place is worth checking out."}
{"text":"Love tessaros. I always get a burger or steak salad bc they are amazing. I know people who love the ribs. Home fries are great so is the potato salad. Food is priced cheap. Workers are very friendly. Smells delicious bc they cook everything right off the bar."}
{"text":"This is one of my favorite places for burgers. I love the history and the atmosphere. They grind their own mean and it's cooked over actual wood fired grill. With the popularity of the burger themed spots tessaro's is still a stand out for me. Cooked perfect every time, great flavor. I really like the potatoes instead of fries to change up the commons burger and fry pairing. Ive honestly never had anything else here but when we do go others in our group do and they have been quite happy. If you are going to be near Bloomfield this should be on the must stop list."}
{"text":"Went for a late lunch, off hours and sat in the bar. Our waitress was kind and attentive. The burger we ordered was inedible. Raw (pink) in the middle, burnt on the outside, and with the only perceptible flavor of \"burnt\". Pork ribs were ok, but somewhat fatty and not particularly notable."}
{"text":"When I imagine the perfect burger, I see a meat monster, oozing with juice, and toppings falling out the back when I pick it up. I love my burgers, and when someone tells me they've had the best burger ever, I have to find out for myself. Tessaro's in Bloomfield is almost the best in the Burgh, but I thought it didn't quite live up to the hype.  I went for all the fix-ins with the Gourmet Burger- a 1/2 pound patty with bacon, mushrooms, onions, and cheese. I had mine medium rare with mayo, and it was big and juicy, but something missed the mark. Maybe it was the flavor of the meat or the so-so bun. Don't get me wrong- the burger was amazing, but not the best in my opinion. I had it with a side of potato salad, which was also good, but the portion size was dissappointing. Again- great food, but not the best.   Also, I was surprised by the wait- sure, they have the \"best burger in town,\" but I didn't appreciate waiting over an hour while smashed up against other patrons in the doorway. Once we were sat, we were in a tight, cramped corner and the waitress was so-so on service. The decor has a great eclectic Pittsburgh feel, which was cool, but I didn't get to enjoy it as I felt rushed by the waitress.  Over all, the food was great and Tessaro's is a Pittsburgh fixture. Go for the burger and see if it's the best you've ever had."}
{"text":"Gourmet burger with provolone was perfectly cooked and deliciously messy. The home fries are very tasty, but I could have gone for regular fries with the burger and didn't see them on the menu. Huge and oddly diverse menu. I believe I prefer burgatory..."}
{"text":"I've never been disappointed by the food, and this place has one of the best burgers in town.  It's a good size patty, maybe 1/3 of a pound, with a signature blend of meat cuts that amounts to a juicy, flavorful burger.    Many places ask you how you'd like your burger cooked, and then no matter what you say it ends up medium or well-done. I've started ordering burgers rare just to ensure *some* pinkness to the meat. At Tessaro's, if you order your burger medium-rare, that's how you get it.  The no-frills cheeseburger is delicious, but I'd also recommend the Bacon Bleu Burger.  All the sides are good. The potato salad is a fine example of the form. The servers are unfailingly up beat and the dining areas are cozy and warm (one room has a fireplace that's always going during the winter).   This place isn't getting a Michelin star any time soon, but this is a quintessential traditional neighborhood casual dining establishment and won't let you down."}
{"text":"The tables were very close together...we had to cram ourselves into our table, which is less than favorable (In fact, upon exiting, my husband managed to slide the tablecloth and silverware off the table with his butt).  I ordered a half rack of pork ribs, which  seemed at bit expensive to me at $14 until they arrived at the table. The half rack is HUGE compared to some other places where I've tried ribs. The meat was tender and falling off the bone, and their barbecue sauce (I got the mild) was quite tasty...if they sell bottles I'm going to buy one. For the side dish I got the boiled redskin potatoes, which unfortunately are literally nothing more than boiled redskin potatoes -- no salt, pepper, butter, or seasoning of any sort. I'll remember that next time.  Husband got the black and bleu burger, which he reported was good except the bun was too small. The service was fine, nothing special. The atmosphere was friendly and the place was busy but not crowded, which is a good sign in my book. The closeness of the tables to each other is a bit bothersome to me though. We could hear the conversation of the couple next to us much more than I would have liked...I felt like we were all up in their business.  We'll definitely be back."}
{"text":"I can understand why some people give this place 5 stars and some shrug their shoulders and say nothing special.  The burgers here are ground fresh by an in house butcher and the meat is good, not greasy and very juicy. IMHO, if you added some ground chuck you would get even better flavor but overall they have some of the best tasting burger meat out there.  They cook on a griddle that is heated by burning hard woods, an interesting concept but to be honest I could not taste any smokiness to the meat. Also, IMHO, grilled meat tastes better, but griddled meat is juicer.  The burgers are served on what appears to be a Portuguese style bun, rather plain tasting they add very little to the burger itself. Toppings are simple lettuce, tomato, onions, etc. Their goal is to highlight the meat and not cover it up with lots of toppings or sauces.  On the side I had the home-fries, which they suggested, and to be honest they were disgustingly gross. Overcooked lumps of potato and onions saturated in grease that not only looked bad but didn't taste very good either.  I like the ambience of the local burger joint, but thought a burger for $ 9.00 was pretty spendy. Service was good.  Bottom Line:  Some of the best meat that I've had in a burger, it was cooked perfectly and very juicy - skip those home fires (yuck).   If you are burger purist, enjoying a plain all American hamburger with nothing fancy you will love Tessaro's, if however, you like a more complicated burger with lots of dressings / sauces and complex toppings you will find Tessaro's lacking.  So why three stars? 1 off for the home fires and 1 off for not grilling the burger over that hardwood."}
{"text":"What a wonderful place to have a burger! From the ambiance, to the friendly staff, to the monstrous half pound burgers made from ground sirloin on site; Tessaro's really has it going on.   Now I've only ate the burgers here so I can't comment on any of the other food, but without a doubt the burgers are what Tessaro's is known for. The BBQ burger is my favorite, but all of their selections are outstanding. The toasted bun and great super fresh toppings really top it off.   Keep in mind these things are huge. For 8 dollars you will be absolutely stuffed. Pittsburgh really has it great, a burger like this in San Francisco would cost close to 15 dollars.   I must also mention the bar. Great selection of beers and they even support local East End Brewery with two of their wonderful selections on tap.   The setting is a real old school type of vibe. It almost feels like stepping foot in a time machine and going back to the Bloomfield of the 1950's. Wonderful lighting and a great place for a date or a night out with friends. Every time I stop back in Pittsburgh I grab a burger here!"}
{"text":"I can't figure out the hype surrounding the burgers here.  It's at or near the top of more \"Best Burger in Pittsburgh\" lists than not, and some people have gone so far as to name it the best burger in the state.  I've had burgers at well over 100 places in this state, and let me tell you, Tessaro's isn't even average.  The ingredients were of good quality, but both creativity in design and skill in preparation were sorely lacking.  I went with a group of five, and not one of us enjoyed the burger.  Also, not one of us got ours cooked as ordered.  I'm willing to accept a variety of interpretations of \"medium rare\" but no pink and dry throughout is not one of them.  Though shamefully mistreated, the meat's natural flavor, along with non-burger items, rescued Tessaro's from one star territory, but it was pretty obvious the clueless kitchen couldn't hold up to real competition.  (If you want a decent burger, try Burgatory.)"}
{"text":"A cute neighborhood spot with solid burgers. I love the fireplace touches. The waitstaff has always been friendly too."}
{"text":"This place could be great but the service was less than desirable. I ordered a burger \"medium rare\" and it was so raw inside that it was practically falling apart. The consistency was definitely raw hamburger meat. It happens. What shouldn't happen however, was the server's reaction when I informed her. She questioned how I ordered my burger (I don't care what temp I ordered it at, I didn't ask for raw), and then she offered to have them cook my burger more. I pointed to my plate which at this point consisted of ground meat mush, laughed a little, and said \"that might be hard since it fell apart\"... her response... wait for it... \"we can take it back and re-patty it for you and then cook it more\"... RE-PATTY?!? I passed on the idea of them taking food that I had already started eating back to the kitchen and putting it back on the grill. Needless to say, I won't be eating their burgers anytime soon. Disappointing because I had high hopes for this place."}
{"text":"This place has great food and a rich history. I've seen it on the food network for best burgers in the U.S. In addition to their famous burger, they have delicious salads, a variety of seafood entrees including swordfish and scallops, and my favorite - ribs. Ribs are only served Thursday, and I recommend getting the pork and beef rib combination. The atomic sauce is fire! Full bar too with TVs. They have a lunch special til 4pm which includes delicious sandwiches not on the regular menu like the tuna melt and beef club with bacon."}
{"text":"This place is SUPER crowded.  It was, at least, when I went with Amy, Josh, and Unu for dinner around 6:30 on a Saturday. There are no seats at the bar, and there is no lounge area.  We stood in the corner very close to another table, and waited for about twenty minutes before being seated.  Even when we were seated, the four of us got a tiny two-person table... and people kept coming in, crowding the entrance area without proper sitting or waiting room.  Food was good -- it's keeping me from giving this place two stars.  I got the cheeseburger with medium rare meat and home fries.  The burger was aiight, I think I've had better.  It was good and had a wooden-smoke flavor to it, but I thought the meat was too oily.    Homefries on the other hand: so good. These also had buttery and wooden flavors and I loved it."}
{"text":"Stick with things off of the grill.  Also the Pittsburgh style chili is top notch.  I nice place for lunch."}
{"text":"The burger was decent. Not the best in Pittsburgh like a lot of people say. The steak salad is really big, and the steak is cooked perfectly, so no complaints there. The tables are kinda small, so you feel a little cramped in there... wait that's a common thing here in Pittsburgh that I'm slowly discovering. Overall not bad. No real complaints."}
{"text":"still my favorite place to get a burger in the city of Pittsburgh, it's the atmosphere the bar the servers or bartenders everybody inside who works here makes it worth going out for food and a few drinks, even w/ changes over the last few years Tessaro's won my business a long time ago and has kept it.  Bacon blue burger, medium, w/a Guinness and the steamed veggies - my usual"}
{"text":"Had the Italian sandwich with a side of potato salad. I was amazed at the flavors in the sandwich. The meats were grilled as was the bread and the salsa-type topping on the sandwich made all the difference. So so so delish!  Will definitely go back when I'm in the area. Oh, and the potato salad was super too!!  Went for lunch at noon and it wasn't too busy. In/out under an hour."}
{"text":"I went to this restaurant for the first a couple of months ago and have already been back 3-4 times. The staff is quick and courteous. The place itself is really nice. I wouldn't change anything.  Their burgers are probably the best in the entire city (and a lot of other cities' too,) but absolutely all of their food that I've had was amazing.   Bonus points for being near easy parking AND being within walking distance to some of my favorite places in PGH. Definitely one of my favorite places to each in Pittsburgh. Will most definitely be back, clearly."}
{"text":"These burgers are good.  The bread they use on said burgers sucks.  Dark and not very clean.  Bacon blue burger though was worth the trip.  I don't see myself going back very often."}
{"text":"Always a great burger !! Fun exciting atmosphere  Ate at the bar this time. Service wasn't as good this time"}
{"text":"Best burger in town.   While Burgatory offers a trendy atmosphere and crazy flavor combos (and does it very well), Tessaro's gets back to the basics and makes just a solid burger.   I recommend the BBQ burger with the Hot sauce, but can vouch for the Gourmet Kelley and the Cajun. Both delicious.   And even if you hate potato salad, I urge you to sample theirs. It's made with mustard as well as mayo, so a totally different flavor experience."}
{"text":"Simple. No fuss. Delicious.    Went here on a busy Saturday night.  The restaurant was packed, but we only waited about 20 minutes for a table. As first timers, we were originally confused because the hostess won't take your name, but someone quickly helped and said she remembers everyone and she did!  Got to our table, again no fuss.  Ordered and quickly received our burgers.  I got the BBQ burger with American cheese, medium.  Partner got the bacon blue, medium as well.  Both were cooked perfectly! Definitely messy, but who can knock the juiciness :). I went with simple this time, next time I will get the BBQ burger with the creamy blue cheese instead of American because I could not stop eating my partners.  For sides we got the potato salad and home fries.  Potato salad was delish as others have said and we got the home fries extra crispy which made them perfect!  I can't wait to go back!!"}
{"text":"After getting one of their \"famous\" burgers, I really don't understand the hype. Mediocre food and mediocre service."}
{"text":"Arrived on a Saturday night around 6 p.m. and were seated immediately! Love the atmosphere - it has a warm, homey feel to it. Our server was great - especially since she had a whole room to herself.  I ordered 1/2 bbq chicken with the home fries and my boyfriend got the gourmet steak sandwich. I was really happy with my chicken - it was tender, moist, and the breakfast potatoes were really good. The sauce was okay - there could've been more but I didn't want to bother the server since she was swamped.  My boyfriends steak sandwich was average. He liked the amount of beef on the sandwich but was disappointed with the texture. He said that it was a little tough for his liking.  Overall, a decent experience and I would return if someone else wanted to go. But it's not a place that I'll be dying to go back to."}
{"text":"As good as they say. 5 star burger, and not just by Pittsburgh standards. Dry bleu cheese.  Steak salad, spinach salad with steak are also good.    I used to say this is the only restaurant in Pittsburgh. Good food, professional service, a nice ambiance (a bar with a tin ceiling) and even a bit of view of the street and hills. And alcohol."}
{"text":"Great food and service every time I'm here, I would definitely suggest the burgers or the spinach salad for a lighter option."}
{"text":"Visited this burger joint after a colleague mentioned it during a conversation about the Pgh burger scene.  Food(8.5/10) = ordered the breakfast burger, which involves half a pound of beef, an egg, and strips of bacon.  Think about that.  A chicken, a cow, and a pig in between bread.  A new holy trinity?  Lovely indeed.  The burger was definitely juicy, and the egg yolk added a velvety texture.  You have a choice of sides, and opted for the standard home fries.  Paired with beer...you've got an American meal.  Ambiance (8.0/10) = definitely a neighborhood joint.  Seemed like a lot of the customers were regulars.  Couple of TVs at the bar for sports.    Service (8.5/10) = can't remember the name of our bartender/waitress, but very sweet lady.    Overall opinion = I've heard that this place has received awards for best burger in Pgh.  Not sure if I can share that opinion yet since I'm new to the city, however, there is no question that this place serves high quality classic juicy burgers.  If you want a no-BS burger, take a trip to Tessaro's."}
{"text":"When a place is famous for something (ie having the best burgers in Pittsburgh) thats what you should order.  Theres a reason it has that distinction.     But in an effort to keep my waistline from increasing, i decided NOT to get a burger at Tessaros.  Instead i got the chili and the side grilled veggie kabob.   To this day i can not tell you why the side of grilled vegetables cost me $5 but it did.   It wasn't bad, it just was not a lot and nothing special.  And the chili... there was something weird about it that i couldn't put my finger on.  Until i realized what it was.... KETChUP!  There was a distinct ketchup taste to it.  Which was actually good!  I actually did enjoy the chili because it was very unique... and i also love ketchup.   Overall it wasn't bad.. prices were decent, staff friendly and the table cloths made of jeans!  But definitely next time i will forget about my waistline and go ahead and get the darn burger!"}
{"text":"This is my second time and I'm only writing now because I didn't really use yelp back when I went the first time.. hahah anyways,  The burgers here are really good! I got the gourmet cheeseburger - bacon, mushrooms, onions, and your choice of cheese. delicious! also you can add lettuce, tomatoes, pickles, and more onions. The meat is good and cooked just right! My only tiny complaint is that it was a little bit dry and had a bit too much charred taste.   Choice of side: home fries. My friend was RAVING about the home fries and how all the other yelp-ers love them so of course I had to get them and they WERE really good! Very wonderful, recommended!"}
{"text":"Tessaro's is without a doubt the best burger in Pittsburgh. Everytime they are perfectly seasoned  and cooked to order. They are also huge, to the point I am full but have to finish anyways. One complaint is you can't get French fries, but the home fries are a great and different substitute.   The decor is rustic with plenty of wood booths and denim tablecloths. The staff is also very friendly and seems like they have been here as long as I have been coming here. The most amazing thing about this place is the kitchen. It us a tiny, and I mean tiny, open kitchen just behind the bar area. How they get such tremendous flavors from this kitchen is amazing but I can't complain. Also for as busy as they get, especially on weekends, they still get food out pretty quickly.   I highly recommend coming here to anyone who enjoys a good burger."}
{"text":"Best burger in the city...classic venue in Bloomfield (Pittsburgh little Italy ). This restaurant is authentic and classic enough for a date and also perfect for a family Sunday post Steelers game victory meal.  You have to go here if you've been living under a rock in Pittsburgh or new to town!"}
{"text":"Tessaro's is getting a subsidy from the butter industry, I'm pretty certain. Everything they serve comes with a glistening sheen of butter, which makes everything delicious and rich, and makes for a bit of heartburn later. Not the worst thing ever.  They make an extremely good steak, perfectly cooked. Their ingredients are excellent. Admittedly I tend to be there just about closing time, but I always get the impression that they can't decide if they are a fine dining establishment or a sports bar where the waitstaff would rather go home than deal with me.   Their steak salad with home fries and grilled onions means the potatoes, onions and sliced steak are on top of the salad. With butter. So all these delicious components don't quite work as a protein on a salad. I know Pittsburgh is famous for potatoes on sandwiches, but it's just an odd layer to work though.  Their steak sandwich and open faced steak sandwich are exactly what it says: a steak sitting on top of a slice of bread. Absolutely delicious, but not something I would pick up with my hands and eat.   Having said all that, the food is well made and they close late. The servers are nice enough without being solicitous, and they haven't turned me away yet."}
{"text":"Our first time here as visitors to Pittsburgh. We had two separate Uber drivers recommend this spot and it didn't disappoint!    We had the Kelly burger which was cooked to perfection.   The we also had ribs both beef and pork.  Burger was the Best I've ever had!   Honestly! The beer was ice cold.    Excellent service.   Great food.  Cold beer.    What more could you ask for?!  Oh, the atmosphere is fun and classic old Pittsburg."}
{"text":"Usually when I think of a burger, I think of mediocre meat and lots of toppings to mask the crappy meat. Fits the craving sometimes, but just not a spectacular meal.   Tessaro's has defined for me a burger eating experience unlike any other. The meat they use here is awesome, both in texture and taste. I always order medium-rare.  If there's one place I'd take my out-of-town friends to eat, it would be here."}
{"text":"Food was great! Had the opportunity to talk to the owner, what a lovely lady. Food was fresh, portions were ample and the food temperature was perfect. When I am back in Pittsburgh I will definitely go back. 5 stars all day long!!!"}
{"text":"The best place for a good burger in Pittsburgh. Pork chops are outstanding as well. Good beer selection. Friendly people. A must visit"}
{"text":"Wood grilled, fresh fish and meats, best dry blue cheese and bacon burger ever! Cozy, quaint, nice social mixture. One of my all-time favorites. Worth waiting if you have to."}
{"text":"One of the best burgers I've had in a very long time!  It's a  cozy and friendly family restaurant and staff is exceptional.  I'll be back for sure!!!!"}
{"text":"I went here after reading all the great reviews here on yelp. I was not disappointed and I don't believe my companion was either. It was a Friday night around 9 and the place was packed. We got right in and was seated in less than a minute.Our server came right to us for our drink order. We both ended up ordering burgers, I had the BBQ and it was bomb, delicious. O, and they came so fast, I mean  I was expecting a long wait considering I ordered mine Medium Well. Very good all around and the bill was round $40 for 2 burgers and 4 drinks."}
{"text":"Good food but way too loud.  Also the hostess is rather rude.   Pittsburgh has a lot of nice places.  Skip this one."}
{"text":"First time dining here.....read that their burgers are incredible but I am not sure what the hype is about. I ordered a cheeseburger with Cheddar cheese medium rare, and home fries since French fries are not an option (????? i can appreciate trying to offer different sides but French fries should be an option!) Burger was dry and home fries had no flavor."}
{"text":"This place is good. The style from the outside doesn't really portray what is on the inside. Our waitress was great! Burgers were good. The atmosphere Is a little dated. Menu was limited. Over all it was a good burger and great staff."}
{"text":"Tessaro's definitely provides a solid burger to their patrons, and their side options are also delicious.  I got the gourmet burger, medium rare, with broccoli and cauliflower.  The veggies were excellent.  The burger was tasty as well, but it was extremely under cooked.  I know I ordered it medium rare, but I doubt it spent more than 30 seconds on the grill.  Next time I will go with Medium."}
{"text":"We were between Lot 17 and Tessaro's... I'm not sure if you've ever smelled the wonderful smells that eminate from Tessaro's as your walk past, but this is what made the decision for us!  I obviously had to order a burger.  I went with the bacon and bleu cheese burger.  I ordred it medium, and it was a bit overcooked, but I can't complain.  It was one of the best burger's I've ever eaten.  The flavors were awesome and the toppings were fresh.  I got cole slaw on the side, which was equally as delightful.   Now I know exactly where I'll want to go when I'm craving a big juicy burger!"}
{"text":"That may have been one of the best burgers I've ever had! Made perfectly to order and worth every penny. I went in summer and it was a full house but not too full that I needed to wait."}
{"text":"All the locals recommended this place to me for burgers and I've tried them twice to just make sure the first time wasn't a goof. But both times, the food was so blah. It should take more then just a massive piece of meat to get good ratings. I've tried both a burger and a steak, and they were both so bland. There's no flavor what's so ever. I was highly disappointed."}
{"text":"Best burger in Pittsburgh.  I went for the gourmet Kelly burger with a creamy blue cheese spread.  Do yourself a favor and get some home fries on the side!   As soon as you walk inside, it's as \"classic Pittsburgh\" as you're going to get: from the hustle and bustle inside, to the warm & friendly décor, to the kind-hearted staff.   In a city marked with NEW & TRENDY, sometimes it's nice to find yourself in a place marked with CLASSIC & CONSISTENT."}
{"text":"To hear Pittsburghers speak of Tessaro's in Bloomfield or to read most Pittsburgh Best-Of lists one would expect to find the worlds best burger here. What you find instead is a decent, run of the mill, average burger. The meat is pretty good and certainly juicy but rather lacking in seasoning and the toppings don't do much for the overall experience. I've had burgers that are 4 or 5 star burgers, just not here.  I was famished the last time I ate at Tessaro's and so was my husband. I'd just spent the entire day at Shadyside Hospital having a minor procedure and hadn't been able to eat since the night before. We didn't get to Tessaro's until 3pm and both of us would have literally eaten anything at that point. While I spent the day waiting, I'd read one of those infamous Best Burger in the Burgh lists online and had been daydreaming about a big juicy burger literally for hours & Tessaro's was right down the street.  The bacon bleu cheese burger was on special that day so we both jumped. Peculiar that they offer the bleu cheese wet or dry. Guessing the wet is bleu cheese dressing and I like my bleu cheese straight up, so easy decision. Side of coleslaw for me, fries for hubby.   We both remarked that we expected it to taste better than it did. The bleu cheese had no flavor, the bacon was barely noticeable and I had to add ketchup to it to get anything going on. At one point, I even put coleslaw on it to try and wake it up.   As mentioned, the meat itself was good but I'm sorry even the best burger needs seasoning and flavorful toppings. If the bacon and bleu cheese had been 1st rate, this would have been a completely different rating and experience."}
{"text":"best steak salad in Pittsburgh.  Service varies at times, sometimes great sometimes poor."}
{"text":"had a burger made medium rare. It was pretty good, cooked just right, and afterwards I felt very full. I would never say  this is the best burger in town, but I would definetly say this is a top 5 burger in town.   I brought my gf here and she thought it was a good burger, but didn't see why everyone said its supposed to be best burger in town. Good service, though I have been here before when I had a very rude server... guess its hit or miss."}
{"text":"Had the best burger of my life at Tessaro's over the weekend. I ordered the Guacamole Burger (on the specials menu) and was not disappointed. The burger was large and packed with flavor. The guacamole was tasty and creamy and topped my burger off perfectly. I liked that they had so many options for sides with their meals. I opted for the cole-slaw and it was very good as well.  Our waitress was extremely personable and our food came quick.  I don't give a lot of 5-star ratings but this place deserves one.  My burger was cooked to perfection. Great quality food, service and good atmosphere!"}
{"text":"I ate here this past weekend with my husband and a large group of friends. Although they don't take reservations (at least not this weekend, maybe because of the holiday) our party of 11 was sat together rather quickly at 8:30. Most of us got the Gourmet Cheeseburger and it was delicious! The burger was huge! It was juicy and full of flavor. I had mine topped with blue cheese, along with the onions and mushrooms. I chose to get the chips as my side and they were not homemade, something I was hoping for since all the other food was of such high quality. Our waitress was a bit scatterbrained and when she brought our food out, had no idea who got what and kept insisting the plates were right even though we each remembered what we got. Other than that, it was a great experience and I would definitly go back."}
{"text":"Favorite restaurant in the neighborhood.  I literally go multiple times a week.  Beef ribs are great (Thursdays) but otherwise burgers, fish, chicken...all good.  A little old school type vibe.  No they don't serve fries but the grillled vegetable is a favorite.  Everything is very much homemade and you really can tell.  Love this place."}
{"text":"I am only giving this two stars because I believed the hype. The burger I had was good, but it wasn't the best I've ever had, and the menu--even for a carnivore like me---was too meat heavy. And we had to wait to be seated and it was not super cheap, so all these things combined make me less than thrilled with the experience. Perhaps if I had the burger cooked medium rare, things would be different, but I still crown Industry reigning king of all (Pitts) burgers. However, things are not bad by any means, they just aren't the absolute best, as I was hoping for. And there wasn't enough bread to hold the burger, causing me to do the unthinkable and use a knife! The highlight of the night though, was hearing a man refer to his wife as \"my darling\" when she wasn't even within earshot."}
{"text":"Wait... what an Italian bar is really a sweet fricking Burger Spot!! I've had better Burger experiences (Kuma's Burger, Chicago, IL). The servers  were all very kind and helpful, even helped me find a spot to get desert since they don't serve desert.   They also split our order in half to share with my partner at no charge. Thanks!"}
{"text":"With how Pittsburghers talk about Tessaro's, you'd think it's the epitome of excellent all-American food.  But after having been here four times, all I can really say is that it's very meh and very Pittsburgh.  I apologize for the bland, boring, generic tone of the rest of the review, but I'm not sure how else to describe the food here...  The portion is 'American' and the burger was really thick and as juicy as I expected done medium.  As with any BIG burgers I like to cut it in half so it's manageable...and so I can still seem somewhat ladylike.  The first half of the burger was OK/good/no complaints.  The second half just seemed to lack flavor...  I guess during the first half I was just hungry, but when you calm down and taste the order, it was so bland.  I mean of course I could taste the mayo/ketchup/mustard, but the actual meat part was just flavorless.  I was really disappointed by that...  I ordered potato salad as my side and it was good/OK too...nothing to call home about.  In all honesty I would've rather had Five Guys or In-n-Out burgers."}
{"text":"Top contender for best burger in the 'Burgh. I understand there are a lot of new boutique burger joints popping up in and around the Steel City, but remember before Burgatory, Wingharts, BRGR, etc there was a lone champion (save maybe Piper's) in the category of best burger and that belonged to Tessaro's.  As a former resident of the small friendly neighborhood of Friendship I visited Tessaro's many times and always wondered why I ever ate a burger outside my own house anywhere else.  They are fantastic, the meat  mixture is juicy, fresh, and has tons of good beef flavor.  The buns are warm and don't mess with the top billing.  The toppings compliment, but never overpower and the side of home fries is perfect in a sublime sort of way.  By far my favorite combo for a Tessaro's burger is one with grilled onions, grilled mushrooms, bacon, provolone, and mayo.  Cliches be damned this is a God send for a mouth.  Smack that sucker on a plate next to grilled home fries and pour me an imperial ale because it's go time.  If you're new to the Burgh or new to the boutique burger scene do yourself a favor and get over to Bloomfield for the reigning champ, Tessaro's."}
{"text":"The burger was very good can't say anything bad about it. You will not be disappointed, unless you like fries with your burger. If that is the case you better look elsewhere. Not a fry to be found I find home fries a poor substitute with a burger. Just my two cents."}
{"text":"Amazing atmosphere and people. You walk in and Tessaros is like a time capsule. There's a great old-fashioned atmosphere, speakeasy style music playing, and in general you can tell it's a friendly and laid back crowd. It really has to be experienced to be understood.   The waiters and waitresses are extremely friendly and attentive.   Getting past the atmosphere, the drinks selection is very good and the prices are very reasonable compared to a lot of city bars. It's why you'll see so many regulars hanging out at the bar.   I got the burger with bleu cheese. It was pretty good. Not phenomenal, but very good. The portions are generous and the prices are low as well for what you get.   This is a great place to go for drinks and a hearty dinner. Will be returning frequently. This is a place I really hope stays open for another 50 years."}
{"text":"Everyone's commentrs about this unpretentious pub style restaurant are understated.  When you approach the corner location your iniotial reaction is that this must be the wrong address.  Keep the faith !! Once inside the people are friendly, whth all sorts and ages of people.   The service is supurb and the food is incredible.  The hamburger is the best one I have had in my 50+  years of being a hamburger lover.  The dry blue cheese bacon burger has no peer.  The Chicken salad is the best my daughter has ever had.  The mushrooms in garlic butter are habit forming. We cannot believe what a jewel this is and the pleasure you get eating their fine food !!!  You must not miss it !!"}
{"text":"The Godburger has been stewing over his 3rd loss in a row from 3 years back. It still wanted a piece of me.   It taunted me via online forums, calling me \"The Workin' Stiff,\" threatening to get me \"bound up for a week\" due to its prodigious size.   \"I wanna try you one more time,\" it said. \"Come back, kid. I need to show you why I'm still on top, why I still kill Flathead's, Glurgatory, and Wingfart's. They ain't a drop of burger juice to me. Bring yer old lady too. I want her to see me beat you. Then, I'm gonna run off wit her!\"   Last night, after a bastard of a week, I decided to take out my frustrations on The Godburger once more, ignoring Kay's pleas.  \"Baby, you don't need to do this again.\"  So for the 4th time, I met The Godburger. Instead of running at me like a bull, on this occasion, it tried to psych me out with theme music, casually strolling out of the chamber and onto the darkened chessboard floor as the crowd jeered it...  http://www.youtube.com/watch?v=i-6jntlAWJs  Steaming, it spat a mixture of jus and blood in my face, causing me to lose control and attack, but with first bite, I was covered with....egg yolk?  \"Ha-ha! Breakfast boy-yo!\"  Spinning out of hand quickly, I discovered that jack cheese, a sunny side up egg, and bacon were added to its arsenal. I also learned that beef doesn't always need seasoning to be tasty, the natural flavors of the chopped chuck (still done on the premises) shining through with no embellishment needed to draw them out.   Before long, all that was left of the colossus were stains of hot, yellow liquid and pieces of that chewy sourdough bun that is prepared fresh every morn by a neighboring bakery.   The sweet cream of the tender potato salad acted as a quiet epilogue, and like the burger, it sits at the highest echelon.   I needed to go back in the wake of the recent lynching of Tessaro's (anti-'Burgh bias, hatred of the venerable and traditional?), and after my latest experience, have chosen to deem those petty, negative reviews clueless and irrelevant. Tessaro's doesn't need to be hip or rely on gimmickry. They just do what they do, and they do it smashingly well.   Also, for the very first time, I tried an entree from Tessaro's expansive menu that was not a burger, their Barbeque Chicken being a tender, moist, sticky, honeybun of a clucker that thankfully for me, Kay couldn't finish.   I've beaten the Godburger in enough matches to know once and for all that it is as supreme as it has ever been. Now, to explore the remainder of the menu when next I eat there.  P.S. The service was just fine."}
{"text":"Tessaro's - The Legend - Is it still one of the best burgers in town?  It now has lot's of competition.    Burgers and steaks are cooked on a wood grill.  The burger definitely has that wood grill flavor.  Ordered a medium burger, it was cooked a tad to long and not as juicy as I would expect.   If you like BBQ or wood flavored meat, this is a good option.  The home fries were lacking any real flavor, needing salt and pepper, and could have used some onions or peppers when cooked.    We sat at the bar and the Bartender was on top of everything, including seating people at times."}
{"text":"We came for steaks. Mistake. Probably great burgers (if you read the reviews), but that's it. They don't know how to cook steaks unless you like hockey pucks. They also have a wind problem every time the front door is open. Finally, a supposed owner that works as hostess needs to concentrate on her job and learn how a restaurant is run. We won't go back."}
{"text":"My wife and I went to Tessera's last night for dinner. I had the special which was the trout with a salad and home fries. The trout was really good and the home fries probably the best i have ever had. As far as the food I give Tessera's 5 stars. The waitress was really nice and moved as fast as she could, But unfortunately the place was mobbed and there were only 2 on duty and she was probably doing twice the normal amount of tables. It was also rib special night so they were very apologetic and said they were short staffed and that it was crazy busy besides. I would definitely go there again just not on rib night. I would also recommend Tessera's as the food was delicious."}
{"text":"I would like to consider myself somewhat of a burger snob. I could go anywhere and if I see a burger on the menu that peeks my interest, you best believe I am ordering it.   The atmosphere is honestly one of my favorites because it is honestly just so chill. The wait staff is always on their game and always willing to help when needed. Plus they always tend to be upbeat, which i absolutely love.  I would like to say that I have tried all but the Kelly burger (I have an aversion to things with onions and mushrooms). The burgers are always cooked just perfectly (medium, which makes me extremely happy). But my favorite burger would honestly have to be the bacon and bleu. Literally all my favorite things put together. Definitely can't go wrong! The salads are really good to! I can honestly say these people are #1 on my list when it comes to burgers!"}
{"text":"Place is legit. Delish burgers, enough to induce an immediate food coma, post-meal. I ended up taking half my burger home because it was just too damn big.  Was happy they had Magic Hat #9 on draft too! It tastes so much better on draft!  Burgers were cooked nicely, I alllmost wish mine was a tad more pink on the inside. The mayo was soooo excellent. I didn't used to like mayo on anything until I tried it on burgers, specifically theirs, and maybe one other place.  Place has been around forever, and my parents used to walk here with me for dinner when I was a kid. The kind of place where you walk in and you might see someone you knew from 10 years ago or more... but even if you don't know anyone, they're friendly and will treat you like family or at least a good friend! One of the things I miss most about living in Pittsburgh and this neighborhood in general."}
{"text":"If you have a vegetarian friend who only eats meat once a year, the burger here is worth a shot.  Easily the best hamburger in the city, as other restaurants claim \"second best burger in town\" in deference."}
{"text":"Walking into this place it has a homey and welcoming environment. They don't have many tables so I can safely assume it gets pretty crowded later on in the day. I went around 4-5pm so there were only a few other tables taken up.  My friend and I both ordered burgers and I was pleasantly surprised with the size of my burger. I hate going to places where they serve you small burgers with an eensy weensy piece of meat in the middle. No, Tessaro's gives a really satisfying sized burger. I ordered mine well done and it did seem a little overcooked. My friend ordered hers medium rare and she also said it was cooked too much. The burgers were pretty good though not the taste I was expecting. It almost tasted like one of the burgers you make at your own barbecue. It was still good, but just not my kind of burger. I ordered the potato salad as a side and it was not bad. I would prefer french fries with my order, but what can ya do? Overall it was a pretty good restaurant and I think most people would really enjoy it."}
{"text":"Tessaro's is one of those Bloomfield institutions that certain generations of Pittsburghers always rave about. It's a place that's (apparently) been around forever and just has a cool, old school vibe to it. The decor is totally out of date, just like the uniforms the servers wear. Who thinks that the white button down shirt with the little black tie works in 2012? The owners of Tessaro's do, which is part of the charm.  If you're in the mood for a tasty burger when you're in Bloomfield, you can't go wrong with Tessaro's. For my most recent lunch visit, I decided to change it up a bit and went for the cheesesteak with a side of boiled red potatoes.  I chuckled when my food arrived. The cheesesteak was ridiculously large, overflowing with meat. The red potatoes came with a cup of melted butter for dipping. If you don't think potatoes should come with a cup of melted butter, honestly, you should go somewhere else... somewhere else where you can enjoy hating flavor. Personally, I assaulted those potatoes and didn't look back.  The cheesesteak was average. With some salt added, it was slightly above average. My advice to the kitchen would be to add some more salt and pepper while cooking to make it tastier out of the gate.  Tessaro's provides a classic Pittsburgh experience. While the food may only be worth three out of five stars, I'm going to add on another star because I like the fact that the dining room is dark, the menu is filled with meat, and the staff is friendly and efficient. Bottom line,  Tessaro's is a solid choice if you're in the mood for meat and you want to minimize your chance of running into Bloomfield hipsters."}
{"text":"Give me burgers or give me death!  I think I got that quote right, didn't I?  As far as I am concerned, they make the best freakin' burgers in the burgh.  I'm sure there are people that would disagree.  Heck, I have friends who would disagree.  But I don't care, I know I'm right.    We moved to Pittsburgh from North Carolina and Tessaro's was the first place we encountered that would cook a burger to order at anything other than well done.  And I like my beef pink.  This place serves up HUGE, tasty burgers with great toppings, and very yummy home fries-style potatoes to go with them.  You could probably substitute the side, but why would you want to?  If you're hungry when you arrive and can't wait for a burger (or if you are Catholic and grace this place on a Friday during Lent), I enjoy the Seafood Chowder -- rich and creamy with chunks of seafood and just the right combination of seasonings.    I've never had anything else here, but a friend ordered the steak salad once and I was almost tempted to trade in my burger, it looked so good."}
{"text":"They make some of the best burgers in Pittsburgh!  They have great potatoes also!  The service was good with a friendly staff.  I also had a steak salad there once which was really good a lot of steak on it with potatoes!"}
{"text":"I have to preface this review with two factors. One, I moved here from South Florida, where the best burgers in town came from your average diners.  They were the last bastion of American food in South Florida, so they served up REAL American food.  If you wanted a real burger, you went to a diner.  After returning to Pittsburgh, I found that every diner here has turned to serving up those frozen gray hockey puck patties and passing them off as burgers.  Second, (until the recent explosion of good burger joints in da burgh), I actually HAD been a fan of Tessaro's, until their hostess/manager flat out offended the hell out of me and my party of three.  The result is that I have never, and WILL never return to Tessaro's.  My best friend is a 62 y/o blind woman that I met doing theater in the 90's in Pittsburgh.  She lives with her 91 year old mother, and her father (the driver) passed away several years ago.  I don't drive, and rely on the bus system that Steve Bland is intentionally systematically destroying, so any outing that we make must be carefully planned.  She and I had met once at Tessaro's.  It was her first time being there.  She took the Access van for the disabled, and I met her there after work via bus.  I walked in, she was seated, having a drink, waiting for me to join her. No problem.  We had a great meal, with an awesome burger.  I can't say enough...they really do have mouthwatering burgers.  Months later, we decided to go again, and the plan was pretty much the same.  She took the Access van to the restaurant, and I was going to meet her by bus, and this time a new friend was going to join us, coming by bus from Oakland, and new to Pittsburgh.  My best friend called me at 4:30 (we were supposed to meet at 5) and said that her van had come early, and that she was already at the restaurant.  I told her I would get there as soon as I could.  I left work a few minutes before 5 pm, and arrived at the restaurant 5:15.  They were busy, but I was surprised to find my friend still standing in the doorway.  The blind woman had been standing there for 45 minutes.    I made my presence known, and the hostess/manager acknowledged, asked about our other friend. I explained that he was ten minutes away and coming by bus, new to the city, but WAS on his way.  She walked away from us.  We stood in the doorway fro another twenty minutes.  Finally, the manager came back, and I caught her attention, and motioned my head toward my blind friend, and asked if we really had to keep waiting?  She'd been standing there in the doorway for over an hour.  The next statement sealed the deal on us never returning to Tessaro's.  The manager slapped her hands on her hips, and started barking:  \"LOOK!  We don't have many rules around here!  In fact, we only have ONE, that you don't get seated until your whole party is here!\"  And THIS is what really sealed it:  The woman thrust her thumb in my BLIND friend's direction, who had only been to Tessaro's ONCE before in her life, with me, and said:  \"And SHE oughta KNOW that!\"  She oughta know that?  Exactly HOW should she 'know that'? The only other time she'd been there, she arrived before me, was seated, waited, and I joined her.  Additionally, the 'rule' was posted...on a piece of 8 1/2 by 11 copy paper, taped to the wall at the end of the counter, behind several rows of water pitchers.  I couldn't see the 'rule'...a blind woman certainly wasn't going to 'see' it!  Finally, after another ten minutes standing there, the manager 'allowed' us to take a table and wait for our friend, who came five minutes later.  We ate our meal, paid our bill, and we left.  And we will NOT return.  You can treat me badly, and if there's something I really love about your business, I might come back.  But do NOT badmouth a blind woman, or anyone else for that matter, who is disabled, and in need of a slight amount of extra consideration.  Tessaro's, you might make good burgers, and you'll continue making a fortune off them.  And I'm sure you really don't give a crap about how your manager treated this lady.  But we will NOT drop one dime more in your restaurant.  We'll take our business to Burgatory."}
{"text":"Tessera's added an open air back patio, so now it's even roomier.  You can choose between the bar, the barroom, the back room, the casual front room, and the patio.  All are active and comfortable.  The menu extends beyond basic bar food.  The hamburgers are special.  The bar is full and the drinks are good.  Although it's hard to park in front, the quieter end of the Bloomfield strip does have parking, and Liberty Avenue is a pleasant walk, level with sidewalks."}
{"text":"Went for a second time on a busy Friday night and had a 45 minute wait for a table.    The wait was not unexpected, so we expected to order drinks and pass the time.  However, the bar tenders were very unenthusiastic about serving drinks to us.  The two bar tenders made us feel like we were putting them out.  While waiting, we were told to stand in the rear coat rack area.  There are about ten wooden posts for coats and above those posts is a rail with an inch thick line of dust.  The dust doesn't end there.  We were sat at a booth at the front of the place under a ceiling fan and under an old phone.  The phone above us on the wall is covered in cobwebs and dust.  Each of the ceiling fan blades is covered in dust and that dust and dirt is so thick it is dripping off the sides just waiting to fall in our plates.    The food:  average.   Most of us had burgers.  One of us had the open face steak sandwich.  The steak was over charred and under seasoned.  One of us felt the same about one of the burgers.  6 of us plus drinks was $160.00.   This place needs to be closed for a few days of deep cleaning.  If they don't care about the cleanliness of the dining room, they surely don't care about safe food prep."}
{"text":"My favorite burger in the burgh. Once I ordered a salad and while watching my husband eat a burger, I regretted it. So the next time I ordered a burger- simple cheeseburger, and my goodness it was phenomenal. The meat is hearty and it's very juicy, so you will definitely use your napkins. They have a nice patio out back when it's warm, but the inside is cozy. The service that I've had has always been excellent. The waitress that I had last taught me the \"correct\" way to tap the glass ketchup bottle. Craving a burger? Come here. Also, the potato salad is fantastic. It's also a nice switch up from traditional fries."}
{"text":"The burgers are HUGE and they taste great. I would defiently recommend this place. My friend from Pittsburgh recommended it to me and I was very impressed. The restaurant is a little small so I would suggest calling ahead. Parking can be hard to find."}
{"text":"Tessaro's serves a mean burger, and I think that is the only thing you should order when you go there though I have seen people eat other things. Totally a laid back atmosphere where you can relax and bring kids. The tables are covered in a denim cloth, enough said. My favorite is the bacon bleu burger (dry bleu cheese) with potato salad. Burger is cooked to perfection and so juicy that I have to cut the burger in half to tackle and not make such a mess. You will find yourself eating every bite.   If you come during peak dinner hours you will most likely be waiting, and I would make sure NOT to come on a Sunday since they are not opened (whoops)."}
{"text":"This was my third time eating here.  Burgers are great.  Potato salad is also really good and a nice change of pace from the typical burger side of fries.  My wife got the steak salad.  It came with home fries instead of the traditional french fries.  She loved it.  The steak was very tender and cooked perfectly.  Staff was really nice and attentive."}
{"text":"Not big on burgers but my boyfriend loves them so we had to stop by! He loved his breakfast burger and said it's in his top favorite burgers of all time. I got the chicken sandwich and it was very smokey and unique tasting I really liked that.. Now I'm not a huge fan of the big sandwiches you can barely fit in your mouth but this place was pretty good! Sandwiches are also pretty messy which I'm not a fan of but hey for being the \"messy, can't for in your mouth\" kinda place it was good!"}
{"text":"Best burgers in town. Hands down. Oh, and the service is super-friendly. 648408883 new burger places open up every 10 seconds in Pittsburgh... and Tessaro's still holds it down."}
{"text":"I stopped over here for lunch since I wanted to try something new. There was no wait and was seated immediately. They do have a special lunch menu and as I was pursuing a cheesesteak sandwich my waitress came and told me they were best known for their hamburgers.  She told me that they have butcher who comes in daily and grinds fresh meat for the burgers. The staff then fire the meat on a wood burned grill. I saw that each burger was 1/2 pound and felt that would be too much to eat. She told me I could order the kid's portion for $1.00 less and would get 1/4 pound. It would come with the same sides they offer. Basic additions such as lettuce tomato, onion, and mustard come at no additional charge but if you want to prepare your burger to represent one of the ones on the menu then there is a slight upcharge.  I was in a room surrounded by pretty artwork and overlooking an outdoor eating area for better and warmer days. I had my food in no time at the sound of the \"bell\" which alerts the waitress  that the food is prepared. I ordered mine medium well and it came out as such. She brought me ketchup and the attended to my needs. I had cole slaw as my side. The burger was very good and very messy so I'm glad I ordered extra napkins.   I got to chatting with folks at the next table. The lady there told me this restaurant gets their bread from the Allegro Hearth bakery in Squirrel Hill where I had previously been. Her friend ordered what they call the breakfast burger. It comes with bacon and a fried egg on top. He told me he loves the sandwich that way. He had never eaten here so I politely asked him what he thought of his sandwich. He told me it was to die for!  I did observe the larger portion and realized there would be no way I could finish it so I'm glad I had the option of ordering the smaller burger. It was just enough for me. I was in and out within the hour. They do have a full bar. Bike parking is available and around the corner is a metered lot. Next time I'm craving a burger I'll be sure to come here!"}
{"text":"I have been going to Tessaro's for decades, but it's been a long time since we've been there.  It was so good to be back home for a few days, on business and visiting family a couple of weeks ago. After a bad night at a trendy place in the Strip, we headed to Tessaro's the next night  for great food, cozy atmosphere and the very heart of Pittsburgh.  My parents, my teenage sons and my husband and I happily squeezed into a booth together.  If you are a first time or occasional visitor to Pgh and want a sure bet on a good meal, and local atmosphere, this is your place.    I think my brother is right - this is a place that has only gotten better over the years.  Blowing you a kiss, Tessaro's.  Thanks for not changing!   See you again soon (especially if our 16 year old decides he loves Pitt!)"}
{"text":"Nice Pittsburgh atmosphere - decent beer selection.  Burgers are the speciality and they are good - nothing over the top, but a good burger.  Sides were very good - but I need fries with my burger and you won't find that here.  Overall good choice but a bit below what I was expecting."}
{"text":"eh. Everything was fine. The burger and fish sandwiches were both good but nothing I would put on a 'Best of' list. Yes it has that time capsule feel to it if that's what you are looking for. The staff was very nice and everything was just... fine. I just don't understand the hype."}
{"text":"If you want a good burger in the heart of Bloomfield, Tessaro's is where it's at. We ate here for lunch and it was a great pick! Our burgers were steamin' hot, made perfectly to order, and our drinks were always full. 5 stars for great food and great service!"}
{"text":"I think I was a victim of over-hyped burgers. There was nothing bad about \"the burger,\" and it was good, but there wasn't nothing particularly mind-blowing, either.   The quality of the meat was very good, and my burger was cooked fine; however, I appreciate a well-seasoned burger with a lot of flavor more than just good meat.  I actually had to put a tiny dash of salt on the burger to help it out.    The side salad I got instead of homefries was small but good, with excellent dressing.  My date ordered a grilled chicken sandwich that was good, but, again, no seasoning.    I recommend you try Tessaro's at least once, but don't go in with lofty expectations."}
{"text":"I've never been blown away by Tessaro's and I would never call it the \"best\" burger in Pittsburgh, but it's definitely a \"good\" burger in Pittsburgh. The burger themselves are huge, and were all cooked to the requested degree (on the most recent visit, there were four of us). My breakfast burger was decent--the runny egg was great and everything a runny egg should be, but the bacon was limp, soggy with its own fat, and just blended into the sandwich without a distinct flavor. The homefries were okay, but a little under-seasoned. I will say the service was excellent. If I were reviewing the service alone, I would give it 4-5 stars. A very nice and accommodating staff made me feel welcomed."}
{"text":"The burgers are so big and delicious that I can actually get three meals out of them. Sometimes take for granted living just down the street but so glad I do. Something kinda weird happened there a couple of years ago: waitress was taking us back to our table and she accidentally knocked over a small trash can at front of restaurant. She used our menus to scoop the trash back in. This was the first time my friend had been there. Needless to say he was a little skeptical eating after seeing that. No worries though because he's been back a ton of times."}
{"text":"Love the tomato soup and gourmet burger! Service is pittsburgh at its finest. Love the taste of the wood fire grill."}
{"text":"I agree with all the previous reviews and there's not much I can add that hasn't already been said. Get there early to avoid the crowds. I arrived at 6:05pm tonight and managed to get in just ahead of a TON customers. When I left 30 minutes later, line was out the door with at least 25 other folks milling around outside.  With that many people lined up, you know it's got to be good.  Parking kinda sucks but if you circle the block a few times, you can find something.  I ordered the gourmet burger (1/2 pounder, medium rare, grilled onions and mushrooms, bacon & blue cheese).  Make sure to get the home fries - they're worth the extra Lipitor you'll probably need after the dinner."}
{"text":"No question, even years later, still a fantastic burger! Meat is always quality and it honestly makes my mouth water just thinking about one of their burgers.   Still a MUST is that side of potosi salad. Honestly, it might be some of the best I've ever had. Doesn't matter that service can be a little spotty, I'll take it for a delicious burger!"}
{"text":"The best burger in Pittsburgh, no question.  A lot of burger/chain places have been popping up in the city lately, none of them can compare to Tessaro's.  Price is also reasonable for the burger and the service is always good.  Went with a large group and they had no issue in writing individual checks.  I'd like to try the steaks or Ribs (only one night a week) some day but it is so hard to order anything else but the burger!"}
{"text":"I wouldn't say it's the best burger I've had, but still very good.  I had a cheeseburger with mushrooms and bacon.  The bun was unfortunately too small for the patty and the top portion of the bun was rock hard.  The burger was extremely large and cooked very well.  The wait staff was very friendly and the food was out immediately."}
{"text":"The Harringtons have been running this place for more years than we have been in Pittsburgh (24 and counting).  They have consistently served the best burgers in the 'Burgh, but the grilled fish is great too.  Try a grilled tuna sandwich prepared like a \"gourmet burger\"...bacon, dry bleu cheese, lettuce, tomato, onion. Yum!"}
{"text":"Wow greatest tasting burger I've had yet in the burg. I had the BBQ burger and boyfriend had Cajun. Done perfectly ( I like mine well which is a sin I know) but the flavor of the meet is top choice  and the price very reasonable . Plan on going back to try other dishes . Great service as well !"}
{"text":"I must say that I didn't get to eat the food because the hostess was so rude we didn't even get past the front door. This restaurant must not know that things have changed and they have competition and they need to step into the new millennium ,if they expect to maintain customers. The last time I was there I had a similar situation rude hostess ,rude waitress ,but I thought possibly that was just a bad day ,so I would give it another chance to see what happened. Walking in the door found a paper cup on the ground in front of the store, rather than can contribute to the litter already filling liberty Avenue ,thought it would be a good idea to pick it up and have it placed in the garbage. Walk in ,not greeted stood by the front door saw a menu sitting on the counter ,picked it up starting reading the menu. Before I knew it a woman approached and said \"who said you could just take a menu like that, and don't think you're bringing your garbage into our restaurant\". I found this garbage in your restaurant was trying to be nice. It was very obvious that they do not appreciate their customers we turned around and left and will never return again. Went to a restaurant on Butler Street in Lawrensville and they appreciate their customers the food was great and I suspect they know how the service business needs to be done now. Good Luck Tasarros your days are numbered."}
{"text":"It's hard to say anything that hasn't already been said about this place.  But, I feel the need to re-iterate just how great these burgers are.  After a very long night I woke up in my hotel room feeling the effects of the previous night.  Had a friend in from Delaware and he actually suggested we go after seeing it featured on the food network.  We were there before they opened and actually waited for them to unlock the doors.  I had a gourmet burger cooked perfectly.  The meat had a ton of flavor and it was grilled perfectly.  The  hash browns were a nice change than fries and the coleslaw actually tasted great and wasn't just a \"throw away\" side.  My friend chose a burger with no cheese or condiments just to savor the burger in it's pure form.  True to the hype my friend declared what I'm sure has been spoken many times that this is the \"best burger he's ever had\"."}
{"text":"I haven't been here in ages because I only recently moved back to Pittsburgh and was looking forward to a burger, but when my service dog and I arrived, the hostess that turned out to be the owner/manager wanted to seat me in a dark, dreary, dingy inner room - and when I saw an open table next to the window in the back and asked to sit there instead, she flat out refused to seat me there.    There was no one waiting for a table, several were empty, the table was not marked reserved, and there was no one at it.  She just said \"That table is not available; this is the one I have for you\", indicating the dark, dreary one.  So of course I asked why the better one was not available, and she just said \"Because it isn't\", and repeated pointing to the dark one, repeating that that was the one she had for me.  This happened a couple of times. I asked if the other table was reserved, and she just repeated that it was not available - *for me*.  Not not available period, but clearly not available *for me*.  I then asked her if she wanted me to sit at the bad table and wouldn't give me the other one because of my dog, and she said, no, I love dogs, and told me I could take the dreary table or leave it, but she was not going to seat me at the other one, period, *or* explain why not.    But even when people love dogs, they have been known to treat people with service dogs in restaurants poorly, *very* often trying to stick us in the most undesirable locations.  I wish I had a nickel for every time this has happened both to me and other SD handlers.   An open good table for 2 (not even a bigger table) that was not reserved, with no one waiting, and she won't seat me at it *or* give me an explanation as to why not?  It was already set, so it wasn't as if there was something obviously wrong with it that it couldn't be used, either.    That, my friends, is clear evidence of discrimination against disabled people with service dogs.  Why else would she refuse to seat me there?  And it is illegal as hell to try to make us sit in undesirable locations when better ones are available, and especially when we ask for them.  Because when restaurants have reserved the table you want, there is often a placard on the table, or at the very least, they will just say so!  Why wouldn't they?  I mean, duh!  I fully understand reserved tables, and if it *had* been reserved, or if maybe people already seated at it had, say, just gone to the restroom, and no other better table had been available, I would have certainly accepted the other table. But why in hell should I accept a really dismal table otherwise??  Needless to say, I left without eating - and will not be back.    And I'd bet anything that the next solo diner or couple to go in there got the better table.   I have a lot of friends and family who eat here often; they will all be told about this, and I know that many of them will never return as a result."}
{"text":"By far the BEST Italian hoagy I have ever consumed! I have been going here since I was a kid, completely unaware of the gold mine I was sitting in I would order a burger and some fries. Don't get me wrong, the burgers are fantastic, but the real star of the show is the hoagy so please oh please. DO NOT LEAVE WITHOUT EATING ONE OF THESE! If your friends and family love you they will take you here and force one of these spectacular sandwiches of the gods upon you. Any human should be so Lucky to indulge in the toasted, warm, filled to the brim with toppings and dripping with Italian dressing sandwiches of love. Ok, well, now I'm craving one. See you there."}
{"text":"Still the best burger in Pittsburgh. Seriously, don't even tell about the other burgers until you tried them here.   The hamburger is ground fresh and it's grilled over wood chips to give it that smoky taste.  And it's served up with a smile. Everybody that works here is friendly and welcoming. I'm loyal to Tessaro's and for good reason."}
{"text":"Tessaro's was both a passing point and my final destination on my hamburger road trip across America.  I've had famous burgers such as the ones at Mr. Bartley's up in MA or the french bread burgers down at Rotier's in Nashville as well as regional burgers like the green chili cheeseburgers of the southwest.  After it all, I still see Tessaro's as one of the best burgers I've had ever (my other top burger joints are scattered throughout the midwest where the beef is as fresh as fresh gets).  I started out with medium rare burgers when I first started going there, but eventually I toned down the knob to rare.  My cheese choice is always a slice of American.  I typically like my burgers griddled with only burger bun and cheese, but since Tessaro's serves up \"Pub Burgers\", I find it okay to eat with rabbit food (lettuce, tomato, onion).  Ketchup on a burger is blasphemy.  There is never a reason to add ketchup on a burger unless the burger is of poor quality.  Ketchup on a good burger is like heading to a prime steakhouse and asking for A1.  Save it for when you overcook your burgers at home or when you're at McDonald's.  Mustard is okay in reasonable quantities since its texture and taste complements the burger as opposed to covering it up.  My first thought was wow. These buns are huge. The top bun was awkwardly round and I had squish it a little to get a first bite that consisted of both burger and bun. It worked out in the end, as the buns were able to sop up all the excess beef juice without getting excessively soggy and difficult to hold. The patty itself was perfectly cooked. A full half pound of loosely packed coarse ground beef. I'm not sure what blend they use (definitely more than just chuck), but I want to guess around 75-80% lean, which is perfect in my book. The beef itself had an amazing texture and wasn't heavily seasoned. The beef itself tasted remarkably fresh and just the right amount of \"beefy\". I usually order cheeseburgers over hamburgers as the slice of cheese makes the burger more forgiving to being overcooked and dry; however, at Tessaro's, this was not the case. The slice of American cheese was perfectly melted and added the textural difference between the soft buns, the crisp lettuce, and the beefy patty. The lettuce and onions added additional contrast with their crunchy attributes, and the acidity from the two tomato slices balanced out the cheese. The soggy pickles were overshadowed by the red onion slices which offered not only a crunch but also a spicy kick, and I did not notice them at all.  My side choice is always home fries.  They come slightly charred and taste of delicious butter.  I had half my portion \"naked\" and paired the half with the traditional Heinz ketchup. Honestly they didn't need the extra boost of flavor from the ketchup as they were amazing beforehand already. With the addition of the Heinz, the subtle tones of the char and butter were covered up, which was a pity.  When you go to a steakhouse you order a steak.  When you go to a coffeehouse you order a coffee.  When you go to Tessaro's you order a burger."}
{"text":"Shame! Shame! Shame!  Have you ever eaten so much you just felt ashamed? That's what happened with that 1/2# burger.  Good Lawd(Lord)!  It was not only huge, it was seared and cooked nicely...medium. It was a 3-napkin burger. AND, I have never had broccoli with a side of clarified butter. Crazy man, but I dipped them little flowers in that like crab legs. The legend of this place met my expectations. Thanks."}
{"text":"A classic! Perfect burger to compliment my visit to Pittsburgh. Can't wait to come back."}
{"text":"I want to go back to give it a better review, but here is my experience. I called ahead and asked if they had highchairs. When we showed up they only had booster seats. 3 years ago I wouldn't have known the difference, but after spending 2 minutes watching my 1.5 year old thrash around I can tell you their is a big difference. The waitress made it seem as though it was my fault for bringing him. Yelp says good for kids they said we have a high chair. The waitress was about as warm and friendly as a night in spent sleeping in the snow naked. The potato salad was awesome everything else was super sub par. The burgers are big and if you looking for a giant patty of cheap meat then this is your place. I feel bad because unlike most places I give two stars I really want to like this place."}
{"text":"I was here in January for my department's holiday dinner. We wanted to go in January when all of the Christmas chaos had settled down. But Tessaro's was surprisingly crowded for a Tuesday evening right after the holidays. However, the place was still fairly quiet and low key, and we only waited 5-10 mins for a table.   The 6 of us were seated in the booth in front of the kitchen, and it was pretty cozy. Most of us had burgers, and we all enjoyed our meals. I had some kind of bacon cheeseburger and it was rather delicious. The home fries were just ok, but only because I'm not crazy about home fries. Tessaro's doesn't have french fries on the menu, so home fries were my best bet. I think they also serve potato salad as a side, which I don't eat, so I didn't try any. But those who do like potato salad rave about Tessaro's.   Service was great, especially considering there were 6 of us and the place was crowded. Prices were moderate, from what I remember.   Overall, it was a great experience and I'll be back."}
{"text":"I've been a few times. It can be way too busy, drafty in winter and hot in summer, and very loud, but I've always had a great experience.  The waitresses tickle me. The first time I went I was feeling vegetarian, so I asked the server if the the veggie kabob is good. She put her hands on her hips and sighed loudly. \"You want to get a burger,\" she said sternly. \"You don't come here to get VEG-E-TAB-LES!\" I got them anyways, and liked them, but based on other visits I can say she's right, you get the burger.  As to the burger, you'll like it. If you manage to be disappointed in this burger, you're simply expecting too much. Its a burger for Pete's sake, not world peace! It's a piece of ground meat between two buns. If you like burgers, you'll like this one. It's good.  If you're not in that kind of mood, there are many other carniverous options, all good, a lot of fish specials (mostly expensive), and a few vegetarian friendly ideas."}
{"text":"The best burger in Pittsburgh by far. Everything is always perfect. Don't sleep on the grilled broccoli either. It's absolutely amazing. All these people crying about French fries...come on."}
{"text":"Wow the wait staff was great! My burger was good but really really rare. Really. Like bloody. Just be ready for that."}
{"text":"We dined here in January with friends and had a really good time. The burgers are huge and flavorful. I had the barbecue bacon burger which was fantastic. My wife had the reuben burger and was disappointed with the quality and flavor. Drinks are pricey here, beware. Also, it gets crowded here quick! Get there before 6 for sure if you want to avoid waiting."}
{"text":"This is a place that I can really get behind. You can't beat a $9 burger that is freshly ground and cooked on a 600 degree wood burning stove.   The local butcher shop in Bloomfield closed its doors, so Tessaro's brought him on board and now they have their own butcher to handle all their meat preparation.   I'm a big fan of this place you have to check it out."}
{"text":"I heard great things about Tessaro's.  I ordered a medium cooked hamburger.  The 3 stars is because the burger was cooked extra well done.  The outsides were burned.  I couldn't send it back because I didn't  have the time to.  While this place gets great review the burgers themselves are not really that great.  The reason for the extra star was because their service was good."}
