{"text":"I have now been here twice, the food here is delicious and flavourful. 

It is a small outlet in a business park area along Dufferin St. and it is usually busy during the weekdays when I have been there with workers from the area. 

The chicken kafta and platter are heaping portions, come served warm with a salad and hummus, and are of the authentic Lebanese kind with a hole in the corner. 

From what I know, the hole is there to hang the bread to dry.

Wonderful place, of course I will be back."}
{"text":"Teta's is one of the best food experiences that I've had in a while. 

Since it was our first time, the owner, Sami, really made us feel at home.  He first offered us a sample of the zaatar manakeesh which was piping hot and packed with flavour. 

After pondering on the menu for a while (since we wanted to try so many things) - we settled on the hummus and the kaak sandwich. It doesn't sound like alot, but we were stuffed by the end of the meal.  The kaak bread was crunchy and and generously packed with a labneh, zaatar and olive filling.  The hummus comes with a large pita that is made fresh to order along with a platter of assorted vegetables which include tomatoes, mint, pickled chilis, pickled radishes and olives.   Sami even introduced us to his miniature kaaks which were wonderful for dipping due to their bite-sized nature.   Basically one word, all the dishes and every bite was AMAZING.  

Despite being one man at the front of the house simultaneously juggling between the sit-in and takeout customers, Sami really made the effort to ensure we enjoyed our meal throughout.  After raving about how much we enjoyed our Lebanese food experience, Sami further surprised us with a bag of mini kaaks on the house!   I highly recommend Teta's since the place and food is clearly prepared and served with heart.   I will definitely be returning soon :)"}
{"text":"Came here because of the Yelp reviews. Wasn't disappointed. The owner, Sami greeted us when we came in and had recommendations as it was our first time. We went along with them and everything that was brought out was fresh and delicious. You can tell Sami takes pride in his food.  

Highly recommend if you are up for excellent Lebanese food. More a bakery from the interior than a restaurant."}
{"text":"I came here after I started working in a clinic nearby for lunch. OMG, this is the authentic shawerma I have been searching for. 

This is the BEST shawerma I've ever had in Canada so far. The place is super clean and fresh (I am a clean freak person). I am talking about food, tables, floors, and overall ambiance. 

I felt home. Definitely home made food. Their home made hot sauce is a MUST-try. They offer it in a mild or hot spicy levels.

Come here should you crave middle-eastern food, lebanese specifically. 

My tummy is happy :) after trying the kaak shawerma (sandwich). It cones with a side of hummus and a salad. Salad is a but oily, but that's how we like it middle easterners.

In brief, you gotta try this home made food no jokes."}
{"text":"Food and service was spectacular!!!!

Being that it was my first time, it was suggested that I try the Lahmaajeen pizza due to it's popularity. And the food did not disappoint.

The owners were very hospitable! I will definitely come back here again when in the area!"}
{"text":"The food is great and the owner is incredibly friendly. I had the shawarma which was not only delicious, but also unique compared to what's available in Toronto. I would definitely recommend stopping by! I will certainly be returning."}
{"text":"This place reminds me of my grandma's home : a smell of a clean and warm place with delicious and fresh homemade food and goodies.
Sami and Maral are so welcoming and give you the feeling as if you entered a home and not a restaurant...
I will definitely come again with my kids, friends and family.
Would recommend anyone to give this place a chance to show you that when something is made with love and passion - it can be nothing but the best !!!"}
{"text":"I have never visited this location however I have ordered from this restaurant a couple of times via ubereats. I must say that the food is really good and I can confirm that it is authentic. People who've never tried  lebanese food MUST give this place a try!"}
{"text":"Super fresh, nicely balanced flavones, well priced. 

Owners are moving the restaurant out of the light industrial strip mall and into a more standard restaurant space at 2 Champagne Drive called \"SUQ Mediterranean Kitchen\".  So that will be a place to try soon."}
{"text":"Tasty and authentic Middle Eastern food! Always enjoy coming to eat here."}
{"text":"Just back home after a fantastic lunch here. The food is mouthgasmic. My quest for the holy grail of Mediterranean style food ended today. The ingredients were very fresh and top quality. The service was fantastic. And the owner takes pride in their offerings.

As soon as we sat down, we were served a complementary platter of 4 different breads. Zaatar (lebanese flat bread topped with thyme and sesame seeds), second one filled with spinach/spring onion, third one filled with a mixture of onion/tomato/pressed yogurt, fourth one stuffed with olives. All of them were fantastic. Their zaatar was the best we ever had.

I ordered a Chicken shawarma sandwich. It was lebanese style chicken shawarma stuffed in a kaak bread with diced pickles, nothing else. It was served with a side of salad and hummus. The owner prefers serving the chicken shawarma without the salad inside and it tasted great.

We wanted to order Rudy's dessert to finish but unfortunately they were out of chocolate. But fret not, will be back soon for that and everything else.

I also took a zaatar to go. All in all I paid less that 20$ for the food and takeout including taxes and tip. Can't get any better. Highly recommended."}
{"text":"This place is excellent! I found it on Yelp but have worked in the area for years. It is tucked away on the side in an industrial / retail plaza. The owner was extremely gracious and welcoming. My colleague and I both really enjoyed our dishes. She had a shawarma salad and had a sandwich on fresh warm kaak bread. The sandwich had ground beef, pine nuts and spices. It was fantastic. I will definitely be going back to try some of the other delicious sounding things on the menu. Looks like there are lots of great vegetarian choices as well. Highly recommended as a great spot for an authentic Lebanese lunch!"}
{"text":"I would definitely recommend this restaurant (more like a cafeteria)  for anyone that is looking for a home cook type meal in a casual atmosphere.  The beauty of this place is that it is also a bakery so the different breads that come with your food are so fresh which makes the meal extra special.  Everyone loves the smell and taste of fresh bread. Couple that with some great menu items and you get a satisfying meal at very fair prices.  

Enjoy!"}
{"text":"Went to this place after I found it on Yelp.  The owner is very proud to present his business as an authentic Lebanese bakery.  

Me and a friend visited and ordered a falafel plate, a chicken Shawarma Kaak (sandwich) and a Beef Shawarma Kaak.

He makes his shawarma sandwiches in these small crunchy breads called Kaak (kind of like a bagel without the hole in the middle) with only pickles and hummus.  On the side they will put Hummus and Tabouli (a salad made of onions, cucumbers, tomatoes, olive oil and lemon juice).  The crunchy sandwich is really phenomenal.  

The owner is extremely nice and brought us free appetizers and gave us pastry at the end on the house.

It is insane that not many people seem to eat here.  The only thing I could think of is because of its location (it is a hole in the wall in the back of an industrial plaza)."}
{"text":"Excellent service and fantastic food.
A real gem having this place so close to our work. Authentic middle eastern food and one of the best hummous I have tasted in Toronto. The fact that they have Kebbeh makes me a very happy person."}
{"text":"The manakeesh is fantastic here but the real star are the kaak sandwiches. The super simple labneh, olives, mint and tomato on kaak is to die for.

We recently used Teta's to cater a party. Not only was the food phenomenal, perfectly portioned, and fresh, it was a great value. The price was significantly cheaper than the same items elsewhere. We ordered a variety of fatayer, kibbeh, and shawarma kaak sandwiches to feed 30 people. It was more than enough food and we even had leftovers. 

Lastly, the service here is very friendly and accommodating. Highly recommended for a delicious and different offering for your next party or event. And of course, always a great place to stop in for a bite if you're in the area."}
{"text":"Great little middle-eastern bakery & corner store hidden in the industrial complexes by Dufferin & Finch. The shawarma was made with freshly baked seasame bread that was crispy to the bite. Both the salad and hummus were great, although I wish they offered some pitas or bread on the side. The service was a bit slow during lunch and plan your schedules accordingly!"}
{"text":"Teta's is the best!  This is a small bakery with tables located at the edge of an industrial park.  We had the ful medames with yogurt as well as the tabouleh salad - delicious, fresh and huge portions.  Service was prompt even though it was just the owner that worked the front and very personable, he took the time to explain the cuisine and make sure that we were satisfied.  This is a fantastic business and I really want to see it succeed, my only regret that this place is going to take off once people get in the know about how great it is!"}
{"text":"I grabbed lunch at Teta's a few months ago and my review for this cozy cafe has been long overdue. The owner Sami brings a pleasantry to the restaurant that is unmatched ! Being of Turkish descent, I was very interested to try the Lebanese take on many of my favourites from back home. I ordered the Lahmacun, which is a Middle Eastern pizza made of minced beef and spices on a thin pita crust, and the Beef Shawarma which was served to me in the form of a sandwich, between two pieces of traditional Lebanese bread.

The portions are great and can be shared. The Lahmacun was pretty tasty, definitely different than any Turkish Lahmacun I've had before. The Shawarma was also simple and tasty, with a hummus spread base and a good serving of meat. All in all the meal was definitely worthwhile, and although it was not the best Middle Eastern food I've eaten, it deserves it's due praise."}
{"text":"Authentic lebanese food great quality and friendly service . Will be back and recommend this restaurant to family and friends."}
{"text":"Its been sometime since I left my original review for Tetas restaurant and I feel like I know it much better now as I became a regular here and had tried almost every item in the menu.
There are many reasons why I keep coming back here but really at the end it all boils down to great food and great service.
Sami and his crew are hard at work making sure that the food is authentic , is fresh and clean.
I come here again and again and I keep asking for Sami to surprise me with new things, new Lebanese food that I never tried. 
I encourage you to do the same. Ask for their advice and recommendations.
Bottom line if you like Mediterranean food then you got to check it out. You are going to love it"}
{"text":"I have been to this place for dine and takeout atleast 30 times before. Quality And taste are always consistent. Their manakeesh atleast most of them are delecious. Their beef shawarma is one of a kind too. Prices are cheap and service is good."}
{"text":"The best Lebanese bakery! Best stuff this side of the Atlantic trust me I've tried them all. Their manaeesh and kaak is the best."}
{"text":"So reading some great reviews and very interested in the Kaak, I arrived here this past weekend (Saturday - not really open on Sunday (for pickups only)).

First off, the owner Sami is really friendly and welcoming.  Recognizing this was our first time, he sat us down and brought us a platter of different foods on the house.  Some of the pies (spinach), the lahmajeen, some manakeesh with zatar, jebneh.  It was very generous, and filling! :)

We settled on the Kaak Chicken Shawarma and Sami made up a vegetarian wrap with labaneh (pressed yogurt) cheese and veggies for my dear wife.  They had sides of the Fattouch salad and humus.  Very delicious meal.  The Shawarma was moist and delicious.  We came out stuffed.

Saw some of the other tables with a mix of different dips, breads and salads.  I actually think that's the best way to eat here, but being new to Lebanese food and the way of eating, did not know better.  Not to say the Kaak sandwiches were not delish.  Just next time, I think I would order a few of the dips, fuls, and salads, and get some Kaaks and make a meal out of that.  Everything looked fresh and tasty.  I'll be back."}
{"text":"Great food ! Great people.
Sometimes when I want to get some Mediterranean food, I'm going to Tetas... 
Remind me back home with the smells.
I lovvvve their zaatar pizza and the fluffy pita they have.
Almost everyday there.
My only concern when I'm there is not gaining so much... Lol"}
{"text":"If you love Lebanese food, you MUST check this place out. Totally authentic food and very friendly service. Very reasonably priced. 

The food comes out piping hot and is totally delicious!!!

They will be moving nearby in October. 

Can't wait to return ASAP."}
{"text":"eternal longing
for their chicken shawarma
since i first tried it

sandwiched in kaak bread
which is topped with sesame
and is freshly baked

lettuce, tomatoes
unexpectedly absent
but for the better!

flavourful poultry,
pickles, hummus, garlic sauce
shine bright as a group

try their falafel
it's one of the most unique
i've ever eaten

faint from Dufferin,
and not the prettiest place,
but you must eat here"}
{"text":"Best Lebanese food in the city, period. A secret treat to those in the know. It actually tastes like you are eating in one of Beirut's grand Cafes but for a fraction of the cost and you can save the flight.

The kaak is fantastic, nowhere in the city makes it this authentic. Foodies if you haven't discovered this yet, you don't know Lebanese food."}
{"text":"Lebanese Cuisine in a home style environment. 

Need a true Lebanese experience in the area you can't find a better place. 
In the industrial building tucked away this Pita factory once called Haddad bakery is now serving home made Lebanese food. 

From the Ful Medames to the Kebbeh your getting an old school experience. 

This place is very casual serving the local industrial area and businesses. 

The pita and laffa are made fresh in the back and could not come out any hotter. 

Price is very reasonable and your coming out full on any item on the menu. 

Service is great. The owner is running around meeting you and making sure your the happiest customer every time. 
There is no wait staff here. Just the owners. 

Love this place. I can't wait for them to upgrade the space a bit."}
{"text":"Delicious amazing hummus, fava bean spread and salad options. Super nice owner. A relaxing atmosphere and lots of room for small groups. No reservations required. Prices are very reasonable. They offer samples if you are interested. The menu is simple. They also have a little selection of Arabic groceries."}
{"text":"Man....This place is amazing. The owner is such a frendly and caring man, you would think you were investing in the company. He is so on top of making sure his customers are taken care of. The food is so fresh and well made. Flavors I've never tasted before. I would reccomend this to anybody not looking for a nice interior/exterior, but instead, damn good food that speaks for itself."}
{"text":"This place is a hidden gem! It is truly delicious and unique for Lebanese food. The location is hidden in an industrial plaza. Which almost makes it more of a special find and experience.

The owner knows exactly what ingredients go into the food. Which really helped with my food allergy. Because we were first timers, he gave us a wonderful sample platter. My gawd it was so tasty! The Chicken shawarma, as well beef shawarma is mouth watering.

The most unique part is their sesame pocket. LOVE THIS PLACE!!!"}
{"text":"This is the real deal Lebanese bakery style. 

I'm thankful to have been introduced to this place. Hidden in the back of an industrial plaza, you find a cafeteria style service area, a delicatessen style produce shelf, and a warm fuzzy doughy smell from the bakery - it's got all the ingredients to define comfort food in a hidden gem.

As a p.s the kibbeh is baked instead of deep fried. Thankyou Teta's!"}
{"text":"Went here for lunch. Had the chicken salad shawarma which I found to be good. Not the best I've had but most definitely not the worst. Would recommend a try"}
{"text":"Hands down the best maneesh and kaak.   The dough is thin and light and doesn't leave you weighed down like maneesh from others, most important of all, and this was the cherry on top for me, the right mix of chewiness and crispiness.  The zaater  and cheese where spread perfectly on top of the dough, not too much nor too little.   Try the kaak which they will lovingly stuff with such goodness as labneh with fresh, crisp veggies or the halloumi topped with tomatoes

And if all that was still not enough for you, then you are in for a treat with the halaweh, honey, nutella and banana kaak, banana being optional.  By the way, if you are interested in knowing, we chose with banana."}
{"text":"Stumbled upon teta's when searching for a Mediterranean place near my husband's office for us to grab a quick lunch - luckiest stumble it was! Food was so fresh and delicious, the owner was beyond friendly and helpful with suggestions; we both ordered beef shawarma in a kaak and thought it was perfect! The complimentary breads that were placed before us were still steaming when he brought them out and just typing about it makes me want to go back to devour them again! 
So happy we found this place, we shall definitely be back!"}
{"text":"Known about Teta's for a while now. Always fresh, always filling and always authentic! On the plus side, it's very healthy! 

What I love love love about Teta'a is the Chicken Shawarma/Beef Shawarma. Not a lot of places have beef shawarma, so when you do order from here, I highly recommend the beef shawarma. The shawarma is served inside kaak, which is almost like a light bagel bread with a handle looking grip attached to it. YUM! All shawarma wraps are served with a mixed salad (tomato, onions, mixed peppers etc) and hummus! I ordered also Greek fries on the side with Garlic spread! 

My friend ordered their vegetable wrap. If you're not looking to eat any meat, I highly recommend this as well. It's served with yogurt spread and a vegetable blend. Everything is amazing and tasty! 

I love coming here for lunch! It can get quite busy as there are not a lot of seats, but it's also a great place to grab and go. Excellent service as well. Always willing To go over the menu if you have any questions and checks up about what we thought about the food. 

Bonus: There's also a little shop inside to buy other food packages from Lebanon like pastries and sweets. Halawa with almonds is a great buy for you sweet tooth lovers out there! 

I would highly recommend this place to all my friends for a quick bite for lunch. Highly highly recommend this place for everyone to try out! Authentic Lebanese food! Yum!"}
{"text":"The food was great and very authentic and the owners were very friendly. Its tough to find but the food is worth the experience."}
{"text":"Great prices and even better food and customer service. Always satisfied when I come here for lunch. Sami and his wife are super nice and always take care of their customers by personally making sure everything was done to your liking."}
