{"text":"Haven't been here for a year.  But always order a steak.  The steak always is cooked perfectly and reasonably priced!"}
{"text":"A group of 5 of us went here last evening at the recommendation of another friend who could not make it.  I checked numerous reviews of this place and had high hopes the food and service would live up to what I read.  NOT SO MUCH.    Sticky tables which took us 3 times to get them cleaned off correctly.  Poor seating directly beside the bar.  I am not a fan of listening to bar patrons swearing and trying egg on a fight.  We ordered our food and waited.  One of my friends ordered brisket and here goes the issues after that.  After 20 minutes the server returned to our table advising that the brisket was no longer available.  Really?  It took 20 minutes to figure that out?  I know it wasn't the server but the kitchen not relaying information to the front-line workers.  He ended up ordering something else.  At this point the server should have told him that his meal would be free or at the very least discounted.  We honestly thought that our meals would come out before his which would have happened in other restaurants I suspect.  Instead we continued to wait 50 minutes for everything to be brought to our table.  Finally everything came but ... the fajitas were cold, chicken wings cold, rib eye steak warmish.  It appears that the food was placed under a heat lamp. Gross and unacceptable.  The only happy person was the guy brisket-less who's order was hot.    After a whole mess of complaining we walked out with gift cards covering the cost of our meals.  Needless to say we will never visit this restaurant again but if anyone wants the gift card let me know."}
{"text":"My boyfriend and I are avid chicken wing eaters. We dined in for their Monday wing deal, that also pops back up on Wednesdays. We ordered three rounds of a pound, in flavours of honey garlic, lemon peppersauce, sweet chilli sauce and peppercorn Brandy. All the wings were coated just right. The honey garlic flavour was a surprise. Compared to other places we've tried, it was deliciously saucy. In addition, the waitress was really friendly! Great place!"}
{"text":"There are a couple of things to remember about Texas:  1) It's always dead 2) The service is quick 3) Steak & chicken nachos are to DIE for, wings are large and delicious. Love their wing deals on Monday/Wednesday  The chips they give you to start aren't amazingly flavorful, but they're free so I can't really complain. I wish the place was more lively but other than that, I love it."}
{"text":"It's not another cookie cutter restaurant and that was what I was looking for. I ordered the carne steak, it's tender, with a pint and thoroughly enjoyed it. Nice little place. I also had to seat myself."}
{"text":"AVOID!!!!!! I would give this place a big fat zero if I could. My compost taste better than the items on the menu here. The kitchen really screwed up on every single order we made. The beef fajitas were old and green (and smelled super sour). The rice was uncooked! The guacamole was DARK brown and was easily mistaken for mole sauce (mashed up beans). I do understand that avocados brown when exposed to oxygen but this wasn't right at all. The salsa was watered down and tasteless. The steak was over cooked and when brought back to the kitchen-- the replacement steak was undercooked! The chicken had no seasoning at all! Just plain and dry chicken. An awful meal is an understatement. I paid 90 bucks for garbage food. However, the server was very pleasant and understanding."}
{"text":"I've been going to the Texas Longhorn for 30 years. Yes, it was at the old location until very recently. I never had a bad experience at the old location. Mainly I would eat the chicken fajitas however sometimes I enjoyed the Carne Asada. I even enjoyed their chips and salsa even though it was a bit different from the salsa I was used to. All in all, I was satisfied with the old location, even when the service was less than stellar. I considered the Longhorn to be the place to go in Mississauga for great fajitas.  Things have changed since they've moved to the new location between Cawthra and Dixie on N. Service Rd. I have no complaints about the location, the staff, or the restaurant itself. I have even gone to the new location on two separate occasions just in case the food quality was inconsistent or the kitchen was having a bad day. After the second visit a few days ago, I felt I had to convey my disappointment in the chicken fajitas.   The chicken fajitas are now dry and chewy. I don't know if they're using sub quality chicken now, or if the chef isn't making it right. It's disconcerting since I've always loved their fajitas. The onions are not cooked well enough and seem to be covered in some kind of an orange (colour, not flavour) spice. This type of poor quality happened on two separate occasions, several months apart. This is no fluke. Sadly, this will no longer be my fajita place. I will have to find a new one to go to until I get some indication that the Longhorn has gotten a new cook or cleaned up their quality control.  Great staff, great locations and atmosphere. Bad fajitas."}
{"text":"My boyfriend and I decided to try this place last night. The decor was kinda rustic and fun. Thought it was a little strange that we were seated at a table right beside the bar, in front of the entrance to the washrooms. But at least the bar wasn't too crowded or noisy.  I ordered the NY Striploin with veggies and an extra side of mushrooms. Instead, I received the Ribeye and no mushrooms. The server apologized and voided my entrée. My boyfriend on the other hand had a miserable night. He was perfectly alright until he polished off the Friday Surf 'n Turf special. He threw up at the restaurant 3 times before we went home. At some point, I asked the bar tender to speak with the manager. After about 15 mins the manager came to see us and to our surprise,  our server WAS the manager. She strongly defended the kitchen and mentioned that it can't be food poisoning (words we never used) because it takes upto 12-15 hours to feel the effects. She further went on to say that she herself experienced food poisoning last week after having lunch at Moxie's Grill and that she was in bed for 3 days. I mentioned to her that he was perfectly alright until after the entrée. He has no allergies, and if a customer throws up 3 times after having a meal at her restaurant, something is off and it needs to be investigated. Everybody reacts differently to bad food. She then disappeared into the kitchen for 5 minutes and \"guessed\" that it could've been the tomato based sauce that came with the shrimp.  We're definitely never going back."}
{"text":"Not too sure how this place is still in business. The food was overcooked, bland, cheap. Service was terrible, it took too long. Their was not alot of people for a friday night. None of us finished our food or took it home. Worst restaurant/meal ive had in the GTA"}
{"text":"It was fine. The chicken in the fajitas was very bland, the steak was better but I could probably make better at home.  The highlight of the meal was the soft flour tortillas. They are made in house and very good. But, that was the only good thing about the meal.  I don't think I would come back..."}
{"text":"The food has really gone downhill, they try to insult the consumer with  flat beer and hope the consumer doesn't have a mature palate. Ordering food is downsized to an appetizer... but the prices are proposed as a full meal."}
{"text":"I absoluely LOVE this place. I have been there 3 times and every time I have gone, I have always ordered the Chili con Queso. It is without a doubt my most favourite appetizer there. It is sooooooooo good seriously. If you ever go there for the first time and don't know what to order for an appetizer, I highly recommend that dish! Their quesadillas are very good as well. I went there yesterday to meet up with a friend for lunch and I ordered the bacon and cheddar burger. I normally don't order burgers from restaurants but yesterday I was just in the mood I guess. Burger was very good, but filling lol. I absolutely love texan and mexican food!"}
{"text":"New Texas Longhorn has poor service and terrible food. I loved the Texas Longhorn on Dundas. Always my first pick when it was my birthday. Have had many wonderful meals with excellent service.   Tonight was my second visit to the new location and unfortunately my last.  My first visit I ordered the house steak med well. Came out with the thicker parts raw I ate the thin parts that seemed cooked. The baked potato did not taste fresh. The manager took the dinner off the bill seeing how raw parts of the steak were. Found out the steaks are not cooked the same way as on Dundas street.  Tonight I was hungry so I gave them a second try. I arrived around 9 pm. Not busy. About 20 % at most. Four people at the bar and one table in the bar section. I sat at a table in the bar section. Bartender seemed to be serving the whole place. Took too long to get a drink. Then after sitting 20 minutes waiting to order she takes the dinner order from the table behind me that arrived five minutes after me. Next she asked for my order and I asked to just settle the bill for the ginger ale. She asked if I didn't like anything on the menu. I said I didn't like the service.  Her response was she was helping regulars. I left $5 for the pop.  It's so sad as this was hands down my favourite place to eat when it was on Dundas street.     It's not the same place,not the same great food,not the same excellent service and I will never be back. Better to remember it as it was!!"}
{"text":"If you are going for the food.. Don't. Actually don't go at all. We ordered the chimichanga, which ended up being a soggy envelope of dough, cheese with a hint of meat that might have been premade a few days ago, as it did not taste fresh. The chips and salsa had a hint of cleaning solution and stale taste of being left out unwrapped for too long. I had the \"three amigos\", consisting of an enchilada, beef, and vegetable burrito. My plate arrived with a crust of charred sauce around the edges and couldn't be touched because it had been left in the broiler for way too long. The vegetable burrito tasted like a poorly made pizza, with very few pieces of vegetables slathered in way too much cheese. As I was looking for something edible on my plate I was reminded of staring at someone else's regurgitated meal served to me - very off putting. What's most disappointing is that the only thing that could have been done right - a crisp refreshing beer, was served out of the tap at too warm a temperature to be warranted as satisfying. All in all, if you're going out for date night and want to spend $80, hit the grocery store and stay home instead. Even a Kraft dinner and Campbell's soup prepped at home makes a better meal than what we experienced last night."}
{"text":"After driving by this place a number of times, I decided it looked decent enough to give it a try.  When my friend and I walked into the restaurant, there was no hostess at the door and only one person working (this was a Tuesday night at dinner time).  Since the bartender wasn't addressing us, we decided to seat ourselves at a booth.  Despite the fact that there were only 2 other people in the place (who were both sitting at the bar), it took about 3 minutes for the bartender to address us.  When she finally did approach us, her first words to us were, \"just give me a minute.\"  While the server did make a bad first impression, she was pleasant enough for the rest of the meal, if not a little clueless (but hey, I wasn't expecting much from a rundown tex-mex restaurant in a plaza). We decided to try the fajitas as well as the beef rib.  The fajitas were OK, but lacked flavour and didn't include enough side toppings (I would have asked for more if our server had been more present).  The beef rib was dry and didn't have much flavour to it either.  All in all, I would not return to this place.  Everything was average at best.  If you want fajitas, make the trip to Lone Star."}
{"text":"I have been here a few times each time I leave thinking meh! It's ok but there's room for improvement.  I like it because it reminds me of the old Cali's, it's close to my house and I like the patio, they did do a good job on the patio furniture but should throw out dead planter baskets or water them so they look nice. sometimes they have live entertainment on the patio too. The food quality is not great they use a lot of low end and processed ingredients (iceberg lettuce and what looked like bagged shredded dried out cheese) yet the price is on the high end given the quality. There's not a lot of flavour or creativity in their dishes either."}
{"text":"I wish I read the reviews before coming. Stale chips to start followed by a not so generous protein on top of a mound of onions. If that was not bad enough, the tortilla shells were rock hard. On a positive note, staff were friendly. Definately a very poor cousin to the Texas Lonestar."}
{"text":"My family and I decided to go to Texas Longhorn in Mississauga, I had the worse experience ever.  The restaurant needs a major update, our rave was dirty and I had to ask the waitress to wipe it clean.   Even though all of this we decided to give the food a try, the food was horrible so we left without eating it.  I would never recommend this restaurant to anyone."}
{"text":"I love this place. There steaks are always great! Even though there carne asada are skirt steaks, it's perfectly marinaded and cooked on mesquite wood grill for an amazing flavour. The customer service is amazing.  Eric is the best. I usually go every month for breakfast."}
{"text":"Ok so I haven't been to the longhorn in ...oh...4 + years or so . So i came here on a Friday night with a buddy of mine for the first time in a long while ... Well to my surprise. ..I enjoyed it . I love Tex mex and country bars so for whatever reason I haven't been here in so long shocked me . Why haven't i come ? I have no idea .. This place is pretty good . WHY ? You ask .. Well for a Friday night it was pretty dead lol  Why is that good ? Cause if u just wanna chill and get some decent food then this is your place .  1-- You get Free yes Free Nachos and Salsa to start and yes there pretty good !   2-- Wings - Steaks -burgers and fajitas are great !  3 -- pretty good selection of Beers !  4-- since it's not busy ..service is quick !   So all in all ....go for food and a few drinks with your friends but don't be expecting a huge party unless you guys are the life of the party and don't expect bull riding or picking up the other sex .  But worth a try !  Cheers !"}
{"text":"This place has no real personality. Food is overpriced, especially for the quality, more of a place for the regulars ie trashy drunks who,drink and drive daily, from the old location, I doubt many newbies would come back twice."}
{"text":"I don't think I've been to the Texas Longhorn since the early 1990s. It's about the only decent tex-mex place in the whole of the GTA. The notion that it was a rip-off of Lonestar Cafe is mistaken. This place existed a couple years before Lonestars started to open in Toronto. The Texas Longhorn had an amazing winning formula back in the early 1990s but the owners refused to franchise it. Lonestar saw an opportunity and turned out a highly inferior product.   I was a bit afraid after so many years the Longhorn had changed but I was happy to discover the Longhorn still remains the best tex-mex experience in the GTA.  Short story: You come for the fajitas. The beef fajitas. Don't waste your time with anything else. The beef is amazing. The mesquite wood imparts a great flavor, the center is just pink enough, and the strips of beef are tender and melt in your mouth.   Lots of great fajitas deals through the week. Keep an eye on their web page. Mondays are all you can eat. Tuesdays are 25% off 1 lbs (which will feed about 2 hungry males).  You get chip basket refills and pop refills too."}
{"text":"Me: flatbread and beef rib - ok, that's solid for a place having a beefrib as a side, the rib was frenched nicely to hold but tasted like it had been sitting around all day and they just sauces it a bit to make it not look like it.  Flatbread was really great-tasting (so +1 star to the 1* rating this should be).. Longhorn club was ordered by my dining companion and it seemed ok. Next time [if] I may try the philly cheese steak Tabasco is their hot sauce - pfft, sad..  such a 'chain' cop-out..  With the name of the restaurant I expected much more..  Also, only staff was one bartender on when we got there just before 4pm and service was spread thin.. chips & salsa asked at start but no check on salsa after we finished it instantly. checked the bill after we left and noticed that the half-price apps were just denoted on the bill as a 25% discount for staff, of $3.32 on a $9.97 'half-price app' Also, nice 18% default tip..  f-that.  This place really was disappointing..  too bad it'll prolly tank like everything else that has taken that location..."}
{"text":"meh. booth smelled like puke enchiladas ok hotsauce = Melinda's and Tabasco.. meh surf&turf = 10oz. steak and some shrimp in a bowl.. music got ok after a bit... I bet it gets better at night"}
{"text":"HORRIFIC- me and my husband  both ordered carne ASADA which we have come to love from the previous location of Texas Longhorn  .  Today the side  veg were raw and steak cooked to well done when ordered to rare. My husband  had to send his back  I decided to keep my steak and  had to wait for both my raw sides to come back from kitchen.  I got to eat a cold very tough steak by myself by the time my sides arrived and then my husband got wings as we no longer trusting the steak.  After all of this we were charged full price for such a cr@p experience- all I can say is stay far far  away from this location it is NOTHING like the original."}
{"text":"Pretty decent steakhouse. Nothing really jumped off the plate at me, but it was decent for the price. Excellent service. I like the fact they give the option of giving you as large a cut a steak as you'd like. It seems to be more of a sports bar than anything else, the food isn't the highlight of the place as it's pretty average."}
{"text":"Finally got a chance to check out the new Texas Longhorn, after being a long time patron of the original location on Dundas near Cawthra. What used to be the \"best fajitas this side of Texas\", are now nowhere near that.   To begin with, gone is the southwestern charm of squeaky wood floors and huge wooden booths. That design is replaced by your typical mall design with clean tiles, sterile tables and small booths. The outdoor patio is adjacent to the parking lot and some trees or shrubs would have been nice to black out the site of people parking.   The service is slow, the food is not good and the portions are about half of what they used to be at the original location. I counted about 6 small strips of steak in the chicken and steak fajitas. After fidgeting with our food, due to the less-than-stellar-taste, the waitress comes over and I asked, \"is this the same TLH that was on Dundas?\", to which she replied, \"yes....you didn't enjoy your dining experience at TLH?\", with a grin.  I long for the old days of hot tortilla chips from the bin and fajitas that make your mouth water. Nice try on the re-design, but it's time for me to find a substitute."}
{"text":"Best food experience no doubt. Only 2 of us celebrating a Birthday. Quality and quantity of the food is expected high, delivered 100%. Anna, our Waitress was friendly, efficient and knowledgeable. While waiting for the food we got the Nachos with salsa sauce. The Best of all is: all homemade fresh cooked food, also sauces. The room and facilities are very clean. As a surprise we got Ice cream Birthday cake - no charge."}
{"text":"Always my go to place for cheap but flavorful steak. I always order the carne asada because I find it the most tender piece of meat they serve. They got rid of their lunch specials so be prepared to have a heavy lunch since you'll be ordering off the same menu as dinner. The servers are friendly but sometimes you'll have to wait several minutes when you first walk in - not sure why but its happened to my boyfriend & I before & it wasn't even busy. Their free salsa & chips is a hit or miss. Sometimes it tastes fresh sometimes the salsa tastes like soap, like they didn't rinse the bowl or pot the salsa has been in thoroughly. Iced tea always tastes like the cheap kind from a carton. Always check your steak if you're not in the habit of, sometimes the steak is a little over cooked."}
{"text":"Love the Texas Longhorn. Food is excellent and always made from scratch.    Servers are friendly.   Certainly not a chain restro  .... food is made fresh on location!"}
{"text":"Very unimpressive as far as a Tex-Mex joint. The décor is fun and thematic but the food was pretty uninspiring. I order a burrito with rice, refried beans and nachos with guac. Everything gave me the impression that it was frozen at one point, and was either bland or salty. Better off going to Lone Star."}
{"text":"This place is terrible. It's a cheap rip-off of Lonestar Cafe, actually it looks like it used to be one of them and just changed the name to go independent. Last time I drove by it was out of business and rightfully so.  I reccomend Lonestar or Sneaky Dees if you really want some decent Tex-Mex in T.O."}
{"text":"This place had incredible nachos...it's quality over quantity. I also had the chimichanga and it was incredible! I really enjoy this place."}
{"text":"Went for 55c Wings on Wednesday, and they were absolutely terrible. Even wings in the garbage don't taste a week old.  Other than that, the fajitas, etc are average. Not remarkable, not terrible."}
{"text":"I do not understand the bad reviews. I have dined at 803 Dundas Street E a couple of times  over the years  and had excellent experiences  with my groups for sports events. My usual meal was  a steak meal followed by desserts. Always ordered a  medium done steak and it came as asked. Customer Service  was great . The lighting is great which  is great for foodies to take food pictures . My recommendation is to try the steak meals. I recommend the Carne Asada,  the Belt Bulger Steak, RIbeye, TBone, Bacon Wrapped Filet. I plan to return once I can   get people to  come for some tasty steaks.  Never faced problems booking a table for outings and it was always easy to make a reservation by phone ."}
{"text":"Loyal patron of the Dundas street location for many years. Gave the new spot three tries to be fair because there's always a settling in period but reluctantly must walk away. Food was not prepared to order. I asked for tacos el carbon with beef to be cooked rare. All three times it was well done and the tortillas were greasy and hard. I am posting this only so hopefully the owners can address the kitchen issues and get back to the standards I used to enjoy in the old location."}
