{"text":"best thai  food in york region, great flavors , service and atmosphere  prices are reasonable"}
{"text":"Food was fast and great. Little family restaurant. Had the green curry for lunch was lots of food. For 8$ what more could you want."}
{"text":"Even though we moveed 10 years ago, we still go back here for Thai food. It's a very small place, but service is prompt and food is fresh. They always have customers lining up for takeout. The pad thai is the best I've found in York region."}
{"text":"Guys...this is quite literally the worst Thai food I have ever had in my life. Please save yourself and order from orchid Thai. There is zero flavor in this food.  We ordered red curry, pad Thai and spring rolls. Spring rolls are pretty delicious but other than that...just don't do it!  If your giving this place a good review, you need to try other Thai places to understand what real Thai food should taste like."}
{"text":"Decor needs update, but if you are there just for taste and value, and you enjoy your food spicy. 5 stars!"}
{"text":"I have ordered from here a few times and found the food good. But on a recent delivery order, I had placed an order for about $50 worth of items telling them that it was for delivery. I had not received my order for about an extra 30 mins past when they had promised it would be delivered for. So I called and the woman I placed my order with, confirmed that my order was siting there for pick up instead, and it was her misunderstanding. I am wondering why no one called when an order of theirs was sitting there for an extra 30 mins - probably now lukewarm. She first asked if I can come pick it up because it would take long to delivery it. I had no words for that.  When I asked about having the price reduced, she first said it was a communication error , then offered free spring rolls. Which I assumed was coming anyways with my order because it was over $25 and that's what the website says. I was SO disappointed with their customer service in this incident and couldn't believe they wouldn't even offer a 10% discount.  I waited an extra 30 mins plus however long it was going to take me now to get it, and I had to pay full price. If I wasn't so hungry I would have cancelled my order.  A restaurant's review is not strictly based on whether their food is good, customer service goes a long way as well."}
{"text":"My wife and I eat at Golden Bell almost weekly. This is the best Thai food around. From curry to chili chicken it's awesome. Portions are large, and price is reasonable. The shrimp chips and peanut sauce at no charge when you sit down is a very nice touch. It's not very big, so get there early to get a seat."}
{"text":"This restaurant REALLY doesn't look like much from the outside, but the food is surprisingly good!  I got the cashew chicken lunch special - which for $8.50 is a great deal considering how much food you get (it comes with a spring roll - it's yummy but nothing overly special) - and was pleasantly surprised at how good it was.  I'm used to getting like a couple cashews and minimal chicken at most restaurants, which pad their food with a lot of cheaper veggies, but I was SHOCKED at how much chicken and cashews were in the dish.  Definitely bang for your buck.

Overall, it was well prepared and delicious.  I definitely plan to come back - it's a hidden gem."}
{"text":"We used to be a big fan of Golden Bell, the food is outstanding.  We fell out of habit a few months ago because the phone/delivery service had declined and there are other options.  The quality of the food never decreased and I would recommend people try it for themselves, it was pretty delicious Thai food."}
{"text":"This place is amazing! We go almost once a week, addicted to say the least. We really enjoy the coconut rice, cashew chicken, crispy thai chicken, and of course the pad thai!"}
{"text":"Was visiting area and found this place on yelp.  Don't let the small strip mall location fool you.  The decor inside makes it feel warm and authentic, but not pretentious or gaudy.  Food was fabulous and I could barely finish my $9.99 lunch special of Pad Thai, hot & sour soup and spring roll.  I can't believe the value.  The whole lunch menu was $9.99 for a dozen choices.  Service was fast, friendly and the food was wonderful. I'd recommend it to anyone.  Funny thing is they seem to have a drive through... it was not looking like it was in use as the ice and snow were still blocking the laneway, but what a concept.  Anyway, it was the best $10 lunch I'd had in months!"}
{"text":"Not bad, but far from great. 

Came here for lunch and it was quite busy. It was mostly the business crowd here. The lunch special seems to be reasonably priced. For lunch, I ordered the Chicken Pad Thai with spring rolls for appetizers. In my opinion, for any Thai restaurant to be good, they must at least make a tasty Pad Thai. Unfortunately, this pad thai was doused with too much fish sauce. That was the only flavour that came through. The spring rolls are definitely not fresh, and are from frozen. They're very bland in taste. Service here is average. Nothing special. Nonetheless, I did not expect anything spectacular here. 

Food: 5/10
Service: 5/10
Atmosphere: 6:10"}
{"text":"The service is excellent no complaints there. I really like how they bring the crisps and dipping sauce; nice touch, very classy. The owner also came up and asked us and everything was OK
We tried the pad thai, tom yum soup and chicken curry. Unfortunately I just wasn't a fan of food. Overall the soup was too sweet? come on this is tom yum! needs to be sour and spicy! the rest was too bland and lacking spice. Some people like it but just not for me."}
{"text":"PLEASE, PLEASE, PLEASE bring back the spring rolls that had shaved carrot in them. This was a signature app. We actually stopped coming so often because of the disappointment."}
{"text":"I've been here three time over the past ten years. The first two times I ordered the chili chicken and hated it. I love Hakka chili chicken and thought it might be similar but I was very wrong. I decided to visit here tonight with a friend. I ordered the green curry chicken with rice and it was perfect! Well presented and very tasty. I love the prawn crackers with peanut sauce as well. This was my first restaurant experience trying green curry and I loved it. Prior to tonight I only had green curry from a frozen dinner and it was pretty good which made me want to try authentic green curry. Very please. Will visit again and definitely recommend!"}
{"text":"I love the family owned small little restaurants tucked away indiscreetly in the small strip malls. These are the true meals not the processed factory food served by chains.

I hunkered down for a lunch special at 3pm and the restaurant was busy ( a good sign)

I enjoyed a satisfying Red Curry Lunch special with Thai soup for under $10

Unobtrusive service and fresh quality ingredients from the grocery store next door makes for a winner

When you enjoy Thai, it is best served with background music from the home country.

recommeneded!"}
{"text":"Amazing Thai ... Never had a disappointing dish.  When I'm in Newmarket THIS is one of my favorite Thai restaurants I HAVE to come to .. (Come to think of it .. If not 'thee' only one ;) ). 

Cozy hidden gem .. It is on the small casual side of dining .. Nothing fancy."}
{"text":"We drive up from Brampton just to get the \"crispy chicken\" (which I think may be the chili chicken, and the chicken fried rice. Incredible. The spring rolls are also good as is the pad thai. Lisa also loves the chicken satay with peanut sauce but I'm not a fan of peanuts. Amazing little place!"}
{"text":"Good food. Good service. Decent prices. Small and cozy place. Will definitely go again."}
{"text":"A tiny hole in the wall restaurant with a totally under rated menu. Extremely easy on the wallet and very satisfying for the belly. I love the peanut sauce, the pad thai and especially their cashew chicken. 

If you're hungry, check 'em out. If you're lazy, they also deliver :)"}
{"text":"My family eats at Golden Bell at least once a month.  We order it delivered to our house weekly.  The food is made with fresh ingredients and always served quickly.  I have the mango salad for my dinner every time.  It is so good.  The grilled chicken is excellent.  The portions are large, which we love because we get leftovers to have for lunch the next day.  It is a small restaurant so sometimes you have to wait for a table at lunchtime, but that is my only complaint."}
{"text":"Food here is great, none of that MSG B.S. like other places.  all items on the lunch menu are perfect size portions.  Staff is friendly."}
{"text":"Wow.. The reviews are not lying! This place is a hidden Gem! Very flavorful and fresh, which is a BIG deal. The red curry chicken is Amazing. The Mango Pineapple and chicken fried rice is Amazing. Spicy beef salad is Amazing. Crispy rolls and the veggie rice paper rolls are Good! I like the peanut sauce they make. Everything was cooked to perfection, the only reason for the 4 stars is because she forgot forks and spoons. When I'm really hungry and all of that is not ready, really is just not a good idea. But realistically I would easily give this a 4 out 5 or 5 out of 5. Highly recommend. It's a must try if you are in the Newmarket area. Thank you :)"}
{"text":"We ordered delivery here as not too many places in Newmarket that will deliver.  I was disappointed with it however have read their dining at restaurant is better.  We were missing one of our dishes that we ordered and the green curry didn't even come with white rice.  Their pineapple rice was amazing!!  Pad Thai was mediocre and also ordered some meat dishes that were just ok."}
{"text":"They have a terrific lunch special menu. Inexpensive, lots of food, great quality, and delicious. We often come for take out. It's fairly tiny inside.

It's one of our go to places for work. If you are eating in, the food comes quickly and tastes soo good. I have only every eaten there at lunch times so that's what I'm talking about.

Location: 
It's located off of Yonge street in a plaza with plenty of free parking.

Decor:
It's a tiny, comfortable restaurant. Its been there the 14 years I have been working in the area. A few tables inside, very limited seating. If you are coming at lunch try and get there early or you will miss out. 

Lunch menu:
The lunch specials are 8.50 and are made up of either 2 spring rolls or soup and a main. I have never had the soup, I love the spring rolls and their dipping sauce.

Favorites:
My favourites are the basil beef, green curry chicken, cashew chicken (change to beef for a dollar), and the pad Thai.

It is worth the visit. Honestly some of the best Thai food I've had."}
