{"text":"I went to Thai Angels by myself for lunch on a drive-by whim.  The interior is nicely laid out, with some sweet  Thai decorations, it's a nice space with ample seating (was empty when I got there).  The specials are cheap and quick... and not good.  I had the Basil Chicken special, which came with a fantastic pumpkin/coconut soup and a really good spring roll for starters, which got me all excited for the Basil Chicken.    However, when the entree arrived, it was rather lackluster.  The rice was, quite surprisingly, instant. The scant basil in the dish was limp, had a dirty taste to it, and the sauce was tepid, watery and not spicy at all.  It was made almost completely of disappointment.  I think I'll stick with other options when looking for a Thai lunch at work."}
{"text":"This place was good when it opened. It's disgusting now! I ordered spicy tofu...what did I get? Uncooked tofu with a sauce that tasted like pasta sauce mixed with ketchup. It was to come with green beans and basil leaves in it. They were nowhere to be seen. Instead there were 3 carrot slices and some chunks of green shrivelled pepper. The plate was hot but the food was not! I was with two friends. I grabbed my plate from the table and took it to where the waiter was placed it on the counter and told him I am not eating this garbage, explained why. He had one of the other womens meal in his hands. He just stood there with his mouth open. And we left.   I wish I had taken a photo of the shit he served me! We drove back, closer to the office and went to Linda's which is located at the Shops at Don Mills. The Thai food there is ALWAYS perfection. Do not go to Thai Angels.   Oh, and after I was there I remembered going with another pair of coworkers over a year ago when one was served almost raw chicken. It was the same daft waiter. He never even thought to ask what was wrong with the meal.   It seems to be different people who run it from when it originally opened.   I now know why we never see anyone going there. Belch!  We wondered if it was a money laundering place. That is the only thing that makes sense.  I didn't mean to give this shit hole any stars but I cannot unselect the one I clicked on.  I forgot to mention they served the 'food' with instant rice!!!"}
{"text":"I am impressed with this little shop.  I recommend this place to anyone who wants a good experience at a Thai place. We've walked by many times and thought to avoid it.  Decor is typical, and the other restaurants next to it are very good and my wife and I frequent.   Today, we ordered take-out and we are super impressed with their \"Duck Curry\". It was wonderful.  The flavours were diverse, enough heat and the Thai curry was perfect.  I look forward to tasting other items on their menu.   I am going to avoid the \"Garlic Shrimp\".  Not very good at all.  If the sauce is weak the dish sucks.  And this was a perfect example.  Running, nearly tasteless and not worth the money.  I would have rather ordered two \"Duck Curry\" dishes."}
{"text":"Real thai place with fresh and authentic thai food so hard to find in toronto given whatever is available  is sweetened to suit the pallete, Nice place to have dinner in ellesmere and pharmacy , reasonable price and good lunch deals,. Best thing about the place is the food that is real thai and run by real thai people, That makes a difference.!! I tired all items and all are great , red/green curries,larb gai,pad ke pow, pad thai panang curry all are great. Only other comaparable place would be Naka Thai at Kingston but without ambience or decor of Thai Angels."}
{"text":"Lunch Specials from $6.95 till 3:30 pm and free WIFI are the only reasons for me not giving Thai Angels a lower rating.   This place is a lot more run down than the photos in their website, maybe because I went in the afternoon..... without the dim lighting, Thai Angels looked more like a Thai Grandma.   Pad Ker Mao with Mango Salad ($6.95)  - I requested extra spicy I lucky I did..  - Mango salad was disappointed.. over use of dried shallots and lack of fish sauce and cilantro..  - Noodles has this burnt tastelessly of the noodle stuck to the wok... and lack any spiciness.. (imagine if I didn't order extra spicy??)  - portion was smallish.. maybe it was a blessing?? Too much of something bad would not make it good....   I really doubt how Authentic Thai Thai Angels is... for sure it is a toned down versions of both spice and herbs...   The search of authentic Thai food in Scarborough continues..."}
