{"text":"The food is amazing.  It's made with love.  I have tried almost all veggie and sea food dishes, and all absolutely amazing.  Caveat:  This is a family business.  The waiter, who's also the part owner and son of the cook, is a little weird - but he's actually a very nice guy - even though he may not seem like that at first brush.  You will always get good service and good food.  Ignore bad reviews based on service.  Enjoy :)"}
{"text":"LOVE THE PAD THAI!! the food is authentic, delicious, quick and the service is fantastic. It's a bit of a hole in the wall but you will not regret going in - I have had many of the dishes here including curry but my favourite is Pad Thai. It's pretty busy over the lunch hour but with the quick service you can generally get in and out in about 30-45 min."}
{"text":"Zero stars if I could.  This place is a waste of space.    I went here on a random Tuesday evening with my wife as we live in the area and craved some Thai style Hot and Sour soup.  The place is small and family managed, which would normally mean good service, or at least attempted good service.  However, this place is far from normal, in fact, its as abnormal as it gets for a restaurant.    It has it's own communist set of rules as soon as you walk in, starting with \"No strollers allowed\", which doesn't really apply to me, but just found the tone of the note rude and unwelcoming.  The man who works there, has asshole splashed all over his face, greets us with \"ya? what?\" instead of...shit, anything else that doesn't imply \"what do you want?\".   Anyway, got past that and was seated.  The restaurant was totally empty, except for 1 other person finishing up in the table ahead of us.  We get the menu and order 2 thai soups as that's what we came for, and the man says, \"you need to order more\", and points aggressively to the menu's fine print which says, and get this... \"Minimum $10 per person before taxes\"......wtf?  I told him nicely, \"we just want to try your thai soup, its not dinner time, and plus your place is empty :)\".  He replies, \"I dont care, you need to order more or leave\".  Totally f'in shocked by this experience, I have nothing to say but, \"you know, your service is really lousy\", to which he replies, \"my service no lousy, your service lousy\" and walks away.  wtf?  My wife and I left.    I never experienced such nonsense at a restaurant in my life.  Judging by some of the other comments (minus the fake 5 star ones, which they clearly put up lol), seems this asshole owner has an attitude problem and makes every ones experience horrible.  AVOID THIS PLACE AT ALL COST.  We walked few steps over to Owl of Minerva.  Great restaurant with awesome food and service.  Actually, anything is better service than thai bistro.  I give them 1 more year till they go out of business if they continue to treat customers like this.  0 STARS."}
{"text":"I  addicted to the red curry. Delivery is fast and so friendly.  After the first bite I always think it's not spicy enough.  Then I slow down a bit and realize the flavour is building and building and oh soo good.  Then I wish I had made two orders!    If you dine in, they allow bring your own wine!"}
{"text":"Fantastic! Tucked away in Chinatown, Thai Bistro was a great find. This little known gem features simple decor, excellent service and great food. For dinner, my fiancé and I started with the Fresh Spring Rolls (soft rice paper rolls stuffed with fresh vegetables (choice of chicken or shrimp) served with peanut sauce). They were bigger than expected, filled with chicken and you could taste the fresh basil & mint. Next, we shared a #64 Gratiam Prig Thai with beef (stir-fried garlic and pepper sauce with vegetables (choice of chicken, beef, pork, tofu or shrimp/seafood)) and a #52 Red Curry with chicken (bamboo shoots, peppers, green beans, basil and coconut milk (choice of chicken, beef, pork, tofu or shrimp/seafood)). We rounded out the meal with a bowl of Coconut Rice (great!) and a pair of Thai Iced Coffees. While the beef Gratiam Prig Thai was good (the beef was a little too chewy though), the Red Curry chicken was superb! It's the kind of dish I could order every time! It was spicy (but not too spicy) with all white-meat chicken and came in a large bowl. There was more than enough food for the two of us. We'll definitely go there again!"}
{"text":"I loved the food, service, and staff. they only lost a star because the dishes took to long to prepare.   I recommend it"}
{"text":"Found this little gem after going to Dick Blick for art supplies next door. The restaurant is laid back and definitely has some character. The employees had League of Legends gameplay streaming on their flat screen, which is more interesting to me than sports. My sister and I ordered their potstickers, chicken teriyaki, and chicken pad thai. Everything was really good and pretty cheap. Both of the entrees were only $7.45 and the potstickers were only about $4. I would definitely come here agin!"}
{"text":"Great little family run Thai restaurant came highly recommend by a local. Its small but has the feel of going to someone's home for a meal.  I loved walking into the place with the wonderful aroma coming out of the kitchen thats right in the middle of the place.   We  got the chicken Pad Thai  first which the BF liked the best. I'm usually not a fan of pad thai but this one didn't have any ketchup which vastly improved the taste. The Basil Beef was fragrant with a hint of sweetness. My favourite was the  the vegetarian green curry which was light on the coconut cream/milk, mildly spicy and very flavourful. Overall, everything was freshly prepared with the most basic of ingredients but very delicious.  Total for two people (including two steamed rice)was $35.   Will definitely be back to try some of the other dishes.  PS: Not sure what everyone is talking about  'soup nazi'! The guy who served us was very sweet even though we walked in 30 minutes before closing time on a friday night before a long weekend. Thought it was cute how he drawled out names of every dish he placed in front of us."}
{"text":"the food is great and the workers are  friendly. I definitely recommend their noodles, the best in the gta!"}
{"text":"We get the chicken pad thai and penang chicken about once a week, every week. Combine the two for best results. Best thai good in north York. Service is always perfect."}
{"text":"Been a customer here for many years with some breaks in between when I moved away from the area or was living in another country. I lived in Thailand for many years and eating the food from Thai Bistro brings all those good memories back. Last order was the green curry chicken and chicken pad thai which were both really good. I don't know why people complain about the waiter/cashier, he has always been very friendly to me. I will be a frequent customer here as long as they stay open."}
{"text":"My wife and I ordered out from here over the weekend.  Had the Tom Yum chicken soup, veggie green curry, and ginger tofu. I thought the soup was pretty tasty and the portion size was generous. My wife and I both enjoyed the curry quite a bit. It was flavourful and creamy. The ginger tofu dish had a good sauce and was tasty too but they cut up large slivers of ginger into it and we both felt that was a bit much.   Will definitely order from them again but I wouldn't order the ginger tofu again."}
{"text":"Chicken pad thai was good in portion and flavour. Shrimp pad thai/basil chicken fried rice are supposedly just as good there.  My first visit there today and although the place seems a bit hidden from outdoor, it's a nice cozy place on uptown Yonge street.  The only flaw would be tight seating space and it's good for 1-4 people/party.  Will visit again."}
{"text":"If you are like me, who can enjoy going to quick in and out restaurants with awesome food, but not so much in presentation, then this is the place for you.  On the other side, if you are a galaxy prince or princess who needs linen on your table, square dishes, detailed ingredient descriptions on every dish, repeat special of the day 5 times, disrespectful to the restaurant rules, please do your self a favour, stay away!"}
{"text":"While it's true that I'll try almost anything once (food wise, anyways), I'm don'tg usually go for Thai food, mainly because I'm not into spicy food that much.  Therefore, I have never been to Thai Bistro except for tonight, and I have to say that it was a great meal.  I got the chicken stir fry with cashews and it was delightful. Not spicy at all and all the flavours were subtle and not overpowering.  The service was excellent and very attentive.  My only complaint was that there wasn't enough chicken to offset the side bowl of rice that I ordered. But the cashews were plentiful and crisp, not soggy.  Definitely will go back and maybe get the same thing, although I'll probably skip the rice next time.  5/30"}
{"text":"Pad Thai Chicken: Not very good. Sort of tasted acidic, like there was ketchup in it? Very little chicken.  Papaya Salad(Som Tum): Pretty standard. Would have liked more flavour to it.   Meh, have had better."}
{"text":"This is easily the best Thai restaurant in Toronto.   If customer service is something you really care about, you should probably go somewhere more pretentious. But if it's good food you care about, this is the spot. Anyone complaining about the owner, simply is just a stiff that expects people to bend over backwards for them.  The pad Thai is off the chains. The curry is off the chains and I don't even like curry. The calamari is perfect.   Two words: beef salad.   Wouldn't recommend fish cakes, not that there's anything wrong with it. Just not my cup of tea."}
{"text":"This place is really good. I got the coconut soup and some noodles which were both stellar. Their Thai Iced Tea is really good as well and they put condensed milk in it just like they do in Southeast Asia. Our waitress was very attentive and sweet. If I'm ever in Calgary again I will be returning!"}
{"text":"The only place I order Thai food from in the area!!!  You won't be disappointed.  There was only once that the food order wasn't spot on (pineapple chicken curry wasn't that at all and forgot a whole order of rice), but they're humble, fast and will accommodate you every time.  Love this spot!"}
{"text":"Was looking something different to try in North York Yonge Sheppard area, and quickly notice this little small Thai places. Nice small family run restaurant with about less than 20 seating capacity.  We were served by the son of the owner who seems to have a very strict sense of customer appeasing attitude. Anyway on with the food...  Started with the chicken spring roll...Pretty fresh and tasty with the fish sauce... Vermicelli Soup: Nice light soup with nice cut chicken pieces, tofu, carrots, lettuce and of course vermicelli...  Mains: Basil Noodles with Seafood...Very tasty, colourful dish, packed with flavours! Green curry with chicken: Curry is smooth tasting and was not spicy which is nice. Red curry with shrimp: A little more spicy with nice veggies in there as well. Enough curry with goodies to have 2 bowls of rice...  The steam rice orders are separate from the a la carte food menu.  Overall good representation of Thai food in the area, and will definitely come back to try something else too.."}
{"text":"Not a place for Authentic Thai Food aficionados. Due to its location, the place gets allot of non Asians who need to have the flavors adjusted towards the bland side, which is entirely understandable. An analogous comparison can be made with real Chinese food and Panda Express. I like Panda's orange chicken, but I don't think I'm eating real Chinese food while I'm eating it. This place is similar. I would recommend coming here for some tasty food that is cheap (I had the spicy drunken noodles with chicken lunch special for $6.95). I would return if I'm in the area and in need of a tasty reasonably priced lunch."}
{"text":"A little on the greasy side but super yummy and legit. You'll like the pad thai if you don't like the dish smothered in ketchup. The rice dishes are also delicious!"}
{"text":"This is a fantastic little hole in the wall.  Run by bonafide Thai folks, this establishment is friendly, quick service and always great to go to.  It has a very \"small community\" feel, as the main server knows many of the patrons by name.  The food is fantastic!  No dish disappoints.  They don't necessarily make it the traditional \"north american thai\" way.  Many establishments who serve \"Thai\" food don't have it right at all.  These guys have it down proper.  It feels like a street vendor straight out of Thailand.  Highly recommended by me.  You wouldn't think twice about it walking by, as it's a little spot in a converted garage.  But wow, the food is definitely a standout.  It's great to have found a place like this."}
{"text":"Pineapple chicken curry. GET IT. Every time I go, my friends get something else and I try theirs, then they try my pineapple chicken curry, and they always regret, and I'm always rewarded. This dish is honestly the best curry dish I've had anywhere, ever, and I get it all the time. I crave it non stop, every day. I moved downtown but if I'm ever in north york I always come here for the pcc.   restaurant itself is a dive, owner is for sure a bit moody. whatever. PCC TO GO!"}
{"text":"I am shocked why no one is commenting on the service provided by their server.  What is wrong with their demeanor???  I have eaten Thai food from different continents and at home past 20 years, came to Calgary for a visit from Los Angeles and I feel I have the right to say this place sucks in every way. Their food is less than mediocre!  What they cook is not Thai for sure.The eggplant chicken was so dry, eggplant is in big pieces and basically raw, fried rice is fried to a crisp (2 times), the duck had an awful smell to it, again dry.  Best bet to get the red curry, panang or the papaya salad. I will never return here ever again.  The place is very depressing even though Thai food is supposed to be \"comfort food\"."}
{"text":"This owner is a nut job. I could read madness in his eyes. After ordering my food, he told me in a agitated way I could not eat in. He kicked me out.  Please, don't go there. On of these days, this psycho will go postal on his customers."}
{"text":"I tried to place a to go order for delivery and it was almost 50 minutes to closing. Because I didn't have my room number yet (told him to just place the order now and I could call back in 10 minutes to give him the room number since I was close to arriving at my hotel) he kept complaining about how it will be last call soon and was not friendly at all! I told him why can't I just place the order now and I will have the hotel number before you are even done making the food? He seemed unhelpful and that he didn't need my business. So why give them the business?"}
{"text":"Went for lunch today which was affordable and delicious.  I haven't been to the other location, but was impressed with the food here. Service was quick & good, but it is hard to tell how good it will be in the future as they were pretty empty. Plenty of tables, so I think it will become a popular lunch spot."}
{"text":"I really wanted some Thai fried rice and knew where to go .. I have been here before and it was amazing and even better this time. I read really good reviews about KEVIN and yes, he is as amazing and nice, polite, and funny as they all say  .. I recommend this place just for him !"}
{"text":"Would not honour a Groupon purchased even though the Groupon states Monday -Thursday. If they will not honour it on holidays, then they should state this on the Groupon.  If this is the way Thai Bistro conducts themselves, then I will gladly not go to either location."}
{"text":"They start serving lunch at 11:30. Be the first in the door to beat the crowd. Service slows quite a bit once a couple of tables are filled. Food was delish and quickly served"}
{"text":"Came in on a Tuesday night for take out -- the restaurant was quiet. A small-medium space, but it was clean and neat. I walked in and ordered and was out in less than 15 minutes. The food was a great value and tasted excellent! The red curry had a nice spice level and there was definitely enough to save for lunch tomorrow. I would have liked a little more flavour rather than heat but no complaints. The food is solid and the menu has a great selection of choices.   Would definitely recommend for lunch or dinner!"}
{"text":"Not worth writing a review really. Sauce was watered down and tasteless. Food was bland. Any good restaurant is usually busy and every time we drive by the might be only 3 -4 busy tables if not empty."}
{"text":"The reviews stating that the owner is a crazy person are definitely accurate.   My friend and I went in an hour before closing.  The owner rudely told us that they were closing soon so we would have to order immediately, he gave us the menus and 10 seconds later asked us if we were ready to order.  Of course we weren't, but then he came back about 30 seconds later and asked again if we were ready to order.    I wasn't hungry so only my friend was going to order.  He said that for dine in service each person must order at least $10 worth of food (to be fair it does state this on the menu) but I pointed out politely that the the place was three quarters empty and it would be pretty unlikely that there'd be a rush of customers clamouring for our coveted table in the last hour before closing.  He just said \"If you want to dine in you have to order\" then stormed away. Then he came back less than a minute later and said \"So are you ordering or what?\" Yikes!  Anyway we were annoyed so we left and as we were leaving I \"accidentally\" brushed against the counter and sent his calculator crashing to the floor. OOPS.  He came racing around the counter but by then we were outside so I did not get the opportunity to apologize profusely as I so sincerely wished I could have done."}
{"text":"The King and I is probably still the best Thai in Calgary, but Thai Bistro is #2 and for value it is #1. Great lunch menu too."}
{"text":"Small little place up in North York that I have been a couple of times with friends. I hit the place up solo on Saturday night at dinner time just before heading over to meet friends at a movie. Note alot of people were doing take-out while I was there. A few people sat for dinner. Service was quick, friendly, and attentive. I ordered the Chicken Pad Thai which was definately tasty and a ginger ale. In total the meal came to 15 dollars. Alittle pricey but a two dollar soft drink does bump up the cost.  Definately a great place to get food fast."}
{"text":"This place is a hidden gem. Between myself and my friends we have tried many of their dishes. We have tried the whole fried fish, Pad Tai and various curry stews and they are all oh-so-heavenly. I think what makes their dishes stand out so much is the sauces they add to the dishes which are out of this world.   Don't forget to try their exotic salads. The papaya salad and lemon grass salads are two of my favorites here. I usually ask the dry shrimp to be replaced by fresh shrimp in their salads - just because I am not so used to the flavor of the dried ones.   The service is very friendly and casual. The owner is Thai and seems to be the only staff on the floor. To those who complain about the service, there might be some cultural differences on what is considered a good service. Here they tend to \"leave you alone\" out of respect, which can be considered inattentive to some that are used to fake-smile-how's-every-thing service. But on the other hand, if you express an interest by starting a conversation, he would stay at your table to talk about the food and answer your questions for as long as you want- and all that with e genuine smile. Same for the bill. It is considered respectful not to be in your face for the bill. So you have to flag him down for it.   The place and ambiance needs touch up. I would not go here for a first date, but I would definitely go there every time I need good Thai food and service with genuine smile!"}
{"text":"This place is awesome. Not \"classy\" but its good for the casual outing. The place is small so seating is a bit limited during the rush times like lunch and dinner. Good luck getting a table for Friday lunches but its well worth it if/when you do. Their menu isn't that big but they're good at what they do. Pad Thai FTW!"}
{"text":"Quality & Freshness! I'm always skeptical about ordering delivery, but this was by far the best experience in doing so. Veggies, beef and chicken were cooked perfectly! Everything was so fresh and well cooked! Delivery was fast & friendly. Taste great! Yum, I will be ordering from here in the future :) especially for my soup, veggie & spring roll fix ;)"}
{"text":"This restaruant is re-opened since the floods.  It's hands down the best Thai in Calgary.  Never been disappointed!  Friendly owner and staff, clean modern cozy setting.  The curries are incredible, The salad rolls are out of this world. You thought you had the best until eat these, they will spoil you for anything else out there.  Great selection of import beers, gluten free options Bring your own wine, they have a corkage fee of $12.00 that's fantastic.  Free parking after 5!"}
{"text":"Probably the best Thai food you can get within 10 km radius.  I have only had their pad thai and they're really really dang good.  I haven't tried their curries yet so I can't comment on those.  Both times I have been there, the services has been quite friendly.  It's a family run restaurant and the son does most of the serving.  I'd have to agree with many of the reviewers below, the son is a little weird but most of the time he's very outgoing.  My friend complained about the place being too hot and asked him to turn on the a/c; at that point I saw my life flash before my eyes but surprisingly he told her it's already on and started laughing.  Then things were good again lol  There's some pay street parking but you can probably get away with the parking in the back or inside the small plaza beside it if you manage to find a space.  Cheers."}
{"text":"I planned on writing a review to warn people about the owner guy, but it seems I am not the only one to be subjected to his craziness.  Wanting to try something new, I headed out there with one of my coworkers who has been there a few times and vouched for the food.  We decide to do take out since it was really stuffy in there and there was only one table available.  The owner guy was not friendly and was on the phone when we first went in (which is fine), so we take a look at the menus and after he is done on the phone, we place our orders.   Due to a peanut allergy, I ask that they not use peanuts and he says \"we don't use peanuts\".  That's great, but I want to also double check they don't use peanut oil and mention I have an allergy.  He then makes a comment about how if they used peanut oil they would be out of business and seems really annoyed that I even mentioned my allergy; his tone was very condescending. I was pretty surprised by his attitude at this point, because most people in the restaurant business take allergies quite seriously and are understanding about people's obvious concerns.   I probably should have left him alone, but I saw them preparing a take out order (me and my coworker were the only ones there waiting for food), and it wasn't what either of us had ordered, so I asked to confirm while there was still time for them to fix it (chicken pad thai could sound like chicken fried rice...).  He glare/scowled at me and looked around waving his arms saying \"where do you see your food?  what are you looking at?  we are busy.\".   At that point I just wanted to get the heck out of there and turned my back to him and had a conversation with my coworker until our order was ready.  During our wait, I heard him barking at people and he had a very unpleasant expression on his face the entire time.   Okay, so how was the food?  It was very tasty although there was hardly any chicken in the dish and the portion was small (apparently 1/3 less than what my coworker would have normally received) and I still felt hungry after finishing.  I won't go back because the value just isn't there, but moreso because even if the owner was having a bad day, he cannot treat people like he does.. (plus after reading some of the other reviews, it doesn't seem like he even cares if someone calls him out on his poor attitude)."}
{"text":"First time at Thai Bistro...food was fantastic! The chicken pineapple curry was amazing. The coconut milk in the curry and pieces of pineapple went so well together...like my friend commented, it reminded us of a piña colada! The chicken was very tender. The pad thai was also delicious. The noodles were chewy as opposed to soggy and it was just sweet enough. The only reason I took off one star in my rating was because the portions were a little bit small for the price. But considering how good the food was I'd say it was all worth it.   In terms of the service, I found it completely fine and the waiter/cashier was really nice. I was rather worried after reading the other reviews on yelp before going there tonight, but I guess I got lucky. I read that he won't seat ppl unless the whole party is there but when I arrived alone he seated me right away even though I was waiting for my friend. He must have heard me talking on the phone when my friend called to say she'd be another 10 min but he still brought me some water while I waited. And when my friend asked if she could get the chicken in the pad thai changed to beef, I thought the soup nazi was going to finally make an appearance...but he was perfectly accommodating. He kept coming by to refill our glasses of water without us asking and seemed happy when we said we were really enjoying our food. After he brought the bill, he told my friend and I to take our time so we continued to chat. It wasn't until we left that I realized we had passed their closing time but the waiter hadn't rushed us at all. It's true that he seemed very intense at times, such as when he was talking to my friend and I about traveling to Japan as we were leaving. So I don't doubt the other reviewers' experiences. Hopefully he will always be as courteous as he was during my first time here. Will definitely be back for more scrumptious Thai food! :)"}
{"text":"Great taste(the best Tom Yum soup I have ever tasted!) and attentive service. Clean environment too"}
{"text":"Update March 24, 2014: Restaurant has now reopened - same owner, same delicious food and good value. Service tonight was also excellent. They now plan to open until 2am on Friday and Saturday nights and they'll validate parking after 5pm (subject to a minimum purchase)."}
{"text":"Impressed. I came here and used the Groupon voucher last month on a cold snowy day. I didn't know what to expect but trying out someplace new with a voucher in hand, what could go wrong and honestly how much risk was I really taking? :)  After reading the last 3 reviews (all one stars), I can see they had a bad experience, but I think their experience was isolated to say the least. There's give and take with Groupon deals; always read the fine print.  We entered the restaurant, was greeted by the waitress and seated right away. Oh, we called ahead and made a reservation because if I remember correctly, you had to do that. Nonetheless, we were seated promptly and were excited to taste more thai food Calgary has to offer!  The restaurant is clean, has plants and the table settings were nice.  One of the first things I noticed was they had quite a few more items on their menu compared to most thai restaurants I've been to. Period; not just in Calgary. One of the things that stood out was the Tilapia - a very healthy white fish you'll find at other restaurants and also popping up in north american cuisine restaurants too in the last couple of years I've found. The best thing was, it wasn't very expensive and from how the menu described it, it was definitely going to be ordered that night!  We ordered the Penang curry with chicken, 2 jasmine rice and the fried tilapia. All I can say is that I the food is delicious! I ordered a penang curry to go for lunch and except for the rice, only fish bones remained... there's only so much rice one can have especially when you're on a diet! The tilapia had an asian-style salsa which I love and is very popular to have on fish in south east asian dishes, it just compliments the fish so well I found. You must try this if you love fish. Keep in mind that there's a lot of bones, so be prepared to spit or pick out the bones while you're eating away.  The waitress was always around and checked on us consistently without fail. The owner/manager was very kind; genuine.  It was a cold night when we went there, so the restaurant wasn't exactly full when we got there; I think about 6:30 abouts? The food took no more than expected and all in all I was satisfied and left with a smile :)  Thanks Thai Bistro!"}
{"text":"No fancy review here...authentic thai food, nice decor, friendly people, yummy food.  Give the Pad Thai a try, if you like sweet!"}
{"text":"We wanted a bistro atmosphere on an evening prior to some theatre so chose Thai Bistro. What we got instead was great Thai food and all the ambiance of a bus depot. Lighting is so vital in a restaurant and it simply doesn't work here. But on to the highlight, the food. We began with a small Tom Yum soup which is a Thai hot lemon chicken soup. It was completely and utterly delicious. Next came Stuffed Chicken Wings which were a first for both of us. Imagine a whole large wing whose drumstick end has been deboned and filled with the most wonderful veg and ground meat combo then breaded and quickly fried. So different, so good. For our main course we ordered a Pad Thai and a plate of Pad Med Mamuamg with seafood along with steamed rice. The Pad Med Mamuang arrived with beef instead of seafood and our server was most apologetic. No problem we thought as we dug in. The Pad Thai was mildly spiced and almost sweet and yet sooo delicious. The beef dish too was mild unlike the hot curries one often sees in Thai food. Now we can handle heat in our spices but this was a gentle and happy surprise to have such flavour without the burn. The dinner was under $50 with one wine and one beer. A very reasonable price considering we took home enough for the next morning's breakfast. Pretty great place...but don't forget your sunglasses."}
{"text":"Incredibly attentive service, and a tremendous meal. We had Vegi Spring rolls and the Chicken Pad Thai, which seemed to be house favourites based on the constant stream of phone calls ordering it for takeout. Which leads to my only reason for removing a star: ambience. The subway regularly runs by below, the overhead lights are cranked to an unflattering brightness, and you get to listen to your waiter taking constant phone calls ordering takeout. This is not a date place, unless you truly believe in the passion-arousing powers of delicious food."}
{"text":"Comedian Bobbie Lee once asked regarding Thai food \"when did fire become a flavor?\" Well I am happy that the answer to this is since the last time I went to Thai Bistro. The atmosphere is calm and almost zen. The green pork curry with coconut rice was spicy, delicious, quality and hardy. All this and a green tea only set me back a resonble $18.10. Perfect for a cold fall night.   Just want to thank TB for making fire a flavor again. You are now my favourite Thai restaurant. And thanks Angelo T. for organizing the UYE ... glad you could make it! 6/30"}
{"text":"I placed a delivery order last night. It arrived promptly & the driver was nice. Only reason I'm giving it 2 stars is bc my chicken pad Thai tasted sour & smelled like my dogs breath, which doesn't smell great. I couldn't eat it. The smell was too overwhelming & it tasted off. I'll stick to the King & I for my pad Thai I guess. I don't enjoy wasting money."}
{"text":"Great spot for great thai food and fun with friends. They have board games you can play at your table like jenga or monopoly or connect four...really cool. Food is amazing, service is good..the people are laid back."}
{"text":"It has been a long time. I am well over-due for some tom yum soup! they have awesome tom yum soup! The best I have had.  It has a kick to it but the flavours are well balance and so delicious. I recall having other menu items as well and everything was yummy! Thai Bistro is a safe bet for a great Thai meal - lunch or dinner. The décor is very nice and the service has been consistently good each time. Parking can be tricky in this area so going off peak hours would be ideal if you are driving."}
{"text":"Food is good but don't expect too much on decor and customer service as they totally don't apply on this Thai joint. This place does a lot of take-out and unless you are as moody as the guy cashier i wouldn't really suggest eating in. Food is made fresh and authenticity is spot on. 3 stars for the great food only, otherwise no stars at all."}
{"text":"Had dinner at six on a Thursday night. Had several other couples dinning during the meal. Small dinning area, well kept.  I had springer rolls with chicken. Very tasty, used their hot sauce. It had a vinegar taste with spices. Very nice add. Used it on the entire meal.  For the main meal, it was a stir fry, garlic, peppers, broccoli and onion with beef. It too was very good. Very light on the sauce but the over all flavor was good. I added white rice, it does not come with the meal.   Overall, good serving sizes and very good food. A little on the expensive side for Thai food, $23.00, but I felt worth the price for the quality of food."}
{"text":"Went to this place for my birthday. At first, we were skeptical, minimum charge of $10 per person for dine in threw us off. But if you look at the menu, any main you order should hit that.  The place is like a family restaurant so it was a little slow at first but the server is super nice and knows the authentic Thai cuisine well. When asked if they have saucy pad thai, he explained that the authentic dish is not meant to be saucy and should have a sweet tangy flavour. Coming from a Thai background and having traveled to Thailand, I definitely vouch for that.  The server is actually super nice as well! Funny guy. When he announces for food, he uses an epic voice like a game show host.   The food was AMAZING! Not just authentic, but full of flavour! I must say it's better than some other well know Thai restaurants around town.  They've been around for over 20 years and there's a good reason why!"}
{"text":"Definitely recommend the Thai fried rice, Mongolian Beef & Tom Yum soup. This place has a pretty authentic taste!"}
{"text":"We have eaten here two times now. The service has been great and the food was delicious! We will definitely be back again."}
{"text":"One of the best Thai food I've ever had. We did take out for pad Thai and red curry chicken and it was amazing. We went after the fun comments around service and didn't know what to expect. Was glad we went!"}
{"text":"Unfortunately, I don't have a good review, but this is based on service alone.  My husband and I went in after realizing our favourite Vietnamese place was closed for the night.  We were seated (or directed to a table I should say) and then forgot about.  We were both starving, and there was only one waitress.  The restaurant itself wasn't too busy (Sunday night) but the phone was ringing off the hook.  The waitress didn't even have a chance to get us a drink, so we left after 15 minutes."}
{"text":"Expensive. Food quality is below expectation. I had stir-fried noodles and they were hard and chewy. It's my first time and probably my last."}
{"text":"Love this place the food is great and the price is great! I only give 4.5 stars because they don't offer regular soft drink beverages in the restaurant but they do offer canned sodas next door in the pvp place but it smelled like gym socks in there so I'd rather not lol other then that love it!"}
{"text":"I don't understand why this spot has a separate business listing: there is one counter inside of Jackie Bee Boba Tea. I guess the signage implies that the food and the tea are provided by separate businesses, but it's one space with one counter and staff provide service for both menus. Shrug.  The location is across the street from a community college and next door to a computer gaming store, which helps to understand the target audience. I would compare the food quality to a step above a food court, with more variety than that description suggests. I've grabbed a few apps here and a $7 lunch combo before- it's Chinese/Thai fast food, with dishes like pad thai and orange chicken, and sides/apps like spam musubi, spring rolls, egg rolls, and of course, the boba.  Service is quick and generally friendly. The shared dining area is clean with new furniture and games available. The parking lot is very small, so you may want to utilize the adjacent Dennys lot and walk over."}
{"text":"The curry was delicious with the coconut rice. The staff was very friendly to our entire family - including our kids. We definitely recommend this!"}
{"text":"Good delicious food here. Authentic Thai food.  Its operated by family I believe, mother and son perhaps.  Not a good place for a date or to enjoy atmosphere, it is best for take out or a quick lunch.  It is a rather small place but the food is good, their curry, padthai, basil beef are all really delicious. It is a bit on the greasier side though."}
{"text":"Service is great. I like the coconut milk soup! Also tried the papaya salad. If you don't mid spicy, that's a good choice."}
{"text":"Service is extremely horrible been waiting 10 minutes with no one in line to get a smoothie and a thai tea made. The 2 people working behind thr counter have been laughing and joking around instead of making the drinks. They just started to make our drinks after i complained"}
{"text":"Best pad Thai Ever!!!  My Hubbie and I were regulars there until we moved out of area.  I miss it sooo much!"}
{"text":"Went for take out based on reviews here. Ordered green curry chicken and was about to pay when I was asked if I wanted rice??!  Huh??  I've never been to an Asian or Thai restaurant which did not provide rice for its entrees, especially curry!  How do they expect someone to eat curry without rice?  I understand charging me if I wanted more rice but for the first bowl of rice?!  Ridiculous way to make more $$ from customers. So, note to newbies like me - THIS PLACE CHARGES YOU FOR RICE at dinner time.  Apparently it comes std during lunch but guess I will never find out."}
{"text":"I heard many good reviews from friends who live in the neighbourhood, so finally decided to try it. What I heard is all true - greasy decoration - you can see it on the wall and feel it in the air. Most importantly, the food is soooo tasty and flavourful. Ordered Mango Chicken and Pad Thai, both dishes were mouth watering. I haven't had anything so tasty for awhile.  Would highly recommend this place for all Thai food lovers. The service is very efficient and I suppose some would see it as \"rude\", but all in all, fantastic food supersedes all the minus points.  I do wish they had Thai Ice Tea...mmm...Oh yeah, just to add....the place is actually built out of a garage???"}
{"text":"It's been a while since I've had Thai food (other than the take out stuff at the office food court) so I was pretty excited to head out with a group of friends this past weekend. We had a large group, i think about 12 or 13 of us. The restaurant isn't that big but there was certainly room enough for us. The table was all set with plates, water glasses, and cloth napkins awaiting our arrival. The server was attentive and had no problems keeping up with our drink and food orders.  Our food arrived in good time especially considering our large group. The presentation was really nice, something you don't always see unless you're at some fancy schmancy restaurant. Everyone commented on the pretty carrot roses. I thought it was much too pretty to eat. However, several of my dining mates ate theirs. My choice tonight was the pad thai. Fantastic! The portion was large and it was filled with noodles, vegetables and a generous amount of chicken. I'd certainly order it again. Jan L. ordered a spicy curry that was very tasty but a little too hot for my liking. I would consider ordering it as a one and not a three. From what I heard around the table, everyone loved their food. There were lots of smiles and I'm sure happy full tummies at our table. This is one place I'd come back to again. Gonna try a curry next time for sure."}
{"text":"This place opens at noon for lunch.  I stepped in at 12:05 to an empty restaurant with only one gentleman seated at a 4-person table.  The waiter asked whether I was with that gentleman, I said no, and then proceeded to sit down at a table.  The waiter then told me: \"Don't sit, wait here please\" at the cashier.  I first thought he wanted to wipe down the table and prepare the cutlery for my table of 3.  However, after the table wiping, he proceeded to fiddle with cutlery at the kitchen, fold napkins, talk to the cooks and at some point even count cash at the cash register.  At around the 5 minute waiting mark I asked: \"Excuse me, are the tables taken? What am I waiting for?\"  to which he sternly replied: \"No we don't take reservations and none of the tables are taken but you cannot sit down until your friends have arrived.\"  I almost couldn't believe my ears.  The waiter just asked me 5 minutes ago whether I was with that gentleman that was seated at a table by himself, which means clearly he was allowed to sit and wait for his party.  Honestly, the \"no seating allowed until the whole party is here\" policy is fine - but only if it is applied consistently to everybody and stated right when customers arrive.  Needless to say, I was flabbergasted. If standing around in an empty line in an empty restaurant being unable to sit down because of borderline discriminatory seating practices wasn't humiliating enough, just remembering how average the food tastes at this place from the several times I have been there was enough to deter me from leaving the restaurant - and NEVER coming back again."}
{"text":"Absolutely amazing food and a Comfortable atmosphere. They are constantly adding and changing there food. I am always happy to eat here! The drinkin noodles are my favorite!"}
{"text":"I came here with 2 friends for dinner. The food was very good and worth five stars, but everything else about the experience was just okay. We came here because one of my friends had heard good things about the Thai food here, and I'm always up for trying new restaurants! This restaurant is a hole in the wall kind of place, and I realized that it's one of the places I've walked by so many times and never really noticed. The restaurant is very small, there are two tables for groups of 4, and around four other tables for groups of 2. And the place looks like the owners probably haven't renovated since they first opened it many years ago. It seemed like there were only two people working in the restaurant, one person taking orders and working the cashier, and one person that was cooking all the food, which was done right behind the counters.  The first thing I noticed when I got the menu was that it stated for dine-ins, each person had to order a minimum of $10 (before tax), something that I rarely in restaurants, and kind of unreasonable as most of their main dishes were actually only $9.99. Once my friend and I sat down, we received a text from our other friend saying that it would probably be another 15-20 mins before she arrived. Since we were both really hungry, we decided to order an appetizer first. However, we were told that we can't order just the appetizer, because each table could only place one order, so we have to order all the food at the same time. I've definitely never heard this at any restaurant before! I mean it's very normal for people to order appetizers first! Especially considering the restaurant wasn't even that busy, I don't understand why they couldn't just take our appetizer order first. I thought this was a very strange rule. Since basically they were implying that if I ordered something I really liked, I wouldn't have been allowed to place a second order. Weird!  Anyways, we waited until our friend arrived and then placed our order. We ordered 1 appetizer and 3 mains. The portions for all the mains were pretty small, so we definitely needed that appetizer. Maybe that's why they have the $10 minimum, because they know customers wouldn't be full with just one dish. The food came pretty fast. I have to say everything tasted very good! Definitely one of the better Thai food I've had. However, if I ever want food from here again, I would get take out."}
{"text":"Again, a wonderful meal! Thanks Sam, for being the most gracious host! We had not been here since the flood, glad to see they are up and running and doing well. A few updates: 10% off if you are a Yelper if you mention it. This is a way to make up for the free parking that they had at one time and had to stop. People were running in to get the free parking validation to leave on their dash, and were getting a ticket within that 2 minute time frame! So, understandably they had to quit offering that as it kind of wrecks a meal when you get a parking ticket before you even eat n'est pas? They will now deliver all over the city - was limited before. They have closed down their 17 Ave location. Open for lunch but try and get in before it is a packed house, before 1145am I was told on weekdays. The food is just as yummy, I recommend the Shrimp Pad Thai, Panang Curry and the Green Curry with Chicken. Prices are lower than average in my opinion for downtown Thai food. I have a sensitive tummy so I always know I have had a good meal here as I feel like a million bucks after eating!"}
{"text":"Tried coming here for a late dinner.  My date and I arrived there at 8.30pm.  Right when we arrived, a guy gave us a little dirty look.  My date picked a table near the window, and the table was dirty.  The server insist we moved to the table behind us because it's cleaner and they were closing in half an hour.  My date really wanted to sit with the window view, so we asked the server to clean the table.  Our server kicked us out saying we're closed.    Seriously ... WTF!  We got out there so heated up.    We picked this place because of the review that we saw from Yelp.  We were so stoked about going there, after that kind of service, it gave me a bitter taste about our vacation in Toronto."}
{"text":"Great Thai food! We are staying in China Town and thought we'd try out a few of the local establishments. This place did not disappoint and the price was right."}
{"text":"Always great, love the lunch specials. Really can't find a better Thai restaurant in the area for the price! Great food great service great people"}
{"text":"A nice little Thai restaurant off Centre Street and worth venturing into.  Dropped by for lunch and so far so good...  Fried Vegetable Spring Rolls...4 stars.  Just your typical cabbage-filled spring rolls but cooked perfectly.  Crispy and golden brown...can't argue with that.  My only gripe is that the filling is under seasoned...I've had cabbage rolls elsewhere that were better tasting by itself, without the use of a dipping sauce.  Tom Yum soup w/ chicken...4 stars.  A nice clean and flavorful broth that's absent of all herbs, with the exception of some chopped scallions...as much as I like to see the Kaffir lime leaves and lemongrass floating around, some places chop them up so finely that it's difficult to remove or avoid them and they become part of the meal (not a pleasant experience).  Fortunately, Thai Bistro strains their broth.  The broth also has just the right amount of spiciness and lime for a tum yum soup, though it may be too spicy for others.  The only issue with this soup is the chicken...there's plenty of it (and mushrooms) but the chef needs to remove the tendon from the breast cause it's present in nearly every bite, despite the chicken being chopped.    Pad Kra Prow w/ chicken...4 stars.  A chicken stir fry dish with chili, basil, bell peppers, onions and mushrooms on top a bed of rice.  This dish is very light for a stir fry but flavorful and with just the right amount of heat.  The only issue is the tendons being present in some of the chopped chicken breast pieces.  Pad Thai w/ chicken...5 stars.   A well balanced dish.  The sauce has just the right amount of peanut and tamarind flavor and not overly greasy.  This is one of the better tasting and prepared pad thai's in town!"}
{"text":"The yellow chicken curry was very good... tastes like home cooked food.  I wish the portion was larger, but good for lunch.  The shrimp spring rolls were hot and crunchy... very good also.  Will have to go back sometime to try other dishes."}
{"text":"I loved the popcorn chicken in spicy good size for the price. I highly recommend this place.  I liked their musibi. The food was tooo hot. Haha had to wait a bit to eat it. But i mean thats not a bad thing. I will definitely come in again."}
{"text":"3.5-4 stars rating  After reading reviews for this place, I was wary of the \"moody\", \"crazy\" guy that a lot of people keep mentioning. So I knew immediately who he was when we entered. He wasn't like the most friendliest person but he was nice enough to not go cray cray on us.  The menu is small and offers your typical curries and noodles amongst other dishes. We ordered the Tom yum goong soup, shrimp pad Thai and chicken red curry. Curry and other dishes does not come with rice so you have to order that separately. The Tom yum goong came first and was served in a very small bowl..which I don't think it's worth the price. It was a bit too sour and spicy for me. The curry and the pad Thai arrived at the same time and I noticed it came in the same small sized bowl as the soup. I mean, we're paying roughly about $10 each dish so we were expecting it to be a little bit more. But nonetheless the food was actually really tasty and it did fill us up, the pad Thai had just the right amount of sweetness to it and it isn't saucy. The chicken red curry was great as well.  Service was actually ok, the guy would come by occasionally asking us if everything's okay and refilling our water. This is a nice Thai place in the area..and it's authentic (the people who work there are Thai), not the nicest restaurant I've been to but sometimes you're just coming for the food!"}
{"text":"Nothing overly fancy, but four of us had a very satisfactory supper, which involved: - Chicken Salad Rolls: One plate with the standard peanut sauce and one with sweet chilli sauce (allergy considerations). I preferred the chilli sauce, but in general I'm a spring roll guy. - Steamed Rice: Good red curry sauce delivery device.  - #56 Red Curry BBQ Duck: The duck was super tasty. The peppers were good, I was able to eat around the pineapple and the curry sauce melded well with the steamed rice we ordered. - #46 Kuay Teaw Nua Sub - Replaced the beef with chicken (religious considerations). The curry smacks you in the nose but tasted great. I think this was my favourite. - #65 Pad Ped Pork - The spiciest, but not too spicy of the dishes. Think this was the favourite of a couple of the people at the table. - #45 Chicken Pad See-Ew - Least spicy of the dishes and the one that I would be least likely to order again. Nothing wrong with it, just found the others more interesting.   Server was good, specially when dealing with the changes we needed, but I would have preferred the different items to appear with less delay between each.   I will happily return, when again in Calgary."}
{"text":"I'd heard of this small Thai restaurant in Chinatown and finally went there after failing to find City Plaza and Han's. But no loss, as the meal at this bistro was very good.  As has been my experience, a new white face often equates into them pointing to their version of 'pad thai,' much as Indian establishments often think 'butter chicken' is the go-to white favourite.  So I asked the kind waitress to guide me to one of their house favourites aside from pad thai and the usual red, green and yellow curries. Hence trying Pad Bai Gra Prow with a coconut rice side. Very tasty with fresh chicken, tender slices of crispy onion, red and orange peppers, and in a light but delicious medium-hot sauce.  Location isn't the greatest and no parking but then all of Chinatown for some strange reason just doesn't seem to care. But most metered parking areas aren't too far away. While eating as the only customer, a number of women came in to either do take-out or eat-in, and so perhaps it is busier as the evening matures.  The after-lingering spice tastes were most agreeable, and surely encourage me to return there some day.   Check it out."}
{"text":"They have amazing food. And there drinks are delicious as well. I could eat there everyday! I love the Mongolian beef!!! It's very flavorful and full of spice. I will be coming back very soon!"}
{"text":"Thai Bistro is a hidden gem in China Town. At least hidden in the sense I've never been there until last night!  I randomly picked this place for our Thai UYE based on reviewer popularity on Yelp (maybe other food review sites *cough*) and everyone was really happy with their dinner experience here. They were very friendly from the get-go and were excited to host a huge group of people on a Saturday night.  Everyone seemed to enjoy their orders. I had stuffed chicken wings to start. How does one stuff a chicken wing with ground beef, noodles, and mushroom? I dunno but I guess MAGIC and MUAY THAI was involved. Either way it was delisciousoness-to-the-max. I didn't know what to order for dinner so I went with the Curry BBQ Duck, which Reginald randomly pointed out. Boy, what a gamble! It was made with yellow curry and had pinneaple and fatty bbq duck pieces. I had it with a bowl of steamed rice and loved the contrast of hot, sweet, and salty. Not one drop of curry sauce was left behind. Also, it went REALLY REALLY REALLY well with the Signha beer I had, the sweetness of the beer was really brought out.  The prices were quite good compared to a previous thai restaurant I frequented in the south (which has now closed down :S). But I'm glad to have found Thai Bistro and would be back soon!  6/30"}
{"text":"From 12/3/15   Came this way for some lunch around the boyfriend's job, and decided on Thai Bistro. Now, I was confused when we went in because there were two names \"Thai Bistro,\" and \"Jackie Bee!\" I guess Jackie Bee is a smoothie/Boba tea place, either way they are combined into Thai Bistro.   After my confusion, I looked through the menu and ordered the shrimp egg rolls, and Tom Yum Vegetable Soup! It was the bomb.com! Everything was tasty; the soup wasn't as spicy but still flavorful. The Shrimp Egg Rolls were not what I expected but still delish, I thought they would have cabbage in them, but either way I was satisfied.   This is a good place to eat; I shall return!"}
{"text":"Wished my experience was better because I love Thai food and was excited to Try this place. If I could I'd give no stars rating for the waste of limited time and lack of customer service. I went in to eat dinner before my class started ordered my food when I was told it take 10-15min cool! Well after waiting 30min and noticed everyone that ordered after me was getting Their orders before I started to question It. I went to the cashier guy and asked him why is It taking So long? He gave me a blank stare and said sorry! I'm sorry! And got stuck! I kindly told him if he didn't place the order to just refund me because I'm No longer interested or have time to eat! He called I believe the \"manager \" which was even worse didn't apologize was more interested in just doing the refund and disappeared.  No sincerity and Very disappointing. I will take my business elsewhere."}
{"text":"There are a few Thai places in Calgary due to a decent sized Asian population here, and this one's decent! The Pad see ew was light and colorful, and the chicken is made just right - soft, not chewy, but still firm and juicy white breast meat. The Shrimp fresh spring rolls are slightly smaller than I expected with less shrimp than I expected. The noodles at the end of my take-out meal had a small pool of oil on the bottom of the box, kind of gross/overkill. Lastly they do not do take out for thai iced tea, unfortunately for me :(  A great little find with easy parking (paid lot next door, hopped in/out for free for takeout), decent food, and what seemed like a cozy ambiance. Would definitely recommend."}
{"text":"Great thai food. Love #26 on the menu with chicken noodles and another one i dont' remember the number now but one is noodles and one is rice two diff dishes with chicken. Best spicy food with best thai sauce."}
{"text":"very authentic flavour, very delicious and generous serving amount. The price is also affordable. this is one of my top list thai restaurant in town."}
{"text":"Not sure what just happened. I ordered a Pad Kee Mao and got some kind of vegetable stir fry dish. Wife got jungle curry that she liked a lot. Overhyped."}
{"text":"Amazing in every category: Great food. Great drinks. Fantastic prices for the large portions. Cool atmosphere. Employees are friendly and the food came out quickly. Will definitely be coming back!"}
{"text":"Takeout Experience:  Phone order process was brief but efficient (Don't ask too many questions!). Food was ready exactly when I was told it would be. Guy behind the counter was very nice to me. Asked if I lived nearby and thanked me for phoning in the order.   Green chicken curry might be the best I've ever had. Very spicy but nice balance of sweet as well. Wife's Mango chicken was excellent and the Chicken Basil fried rice was AMAZING. Also chicken spring rolls were excellent and freshly made.  100% recommend the food here!"}
{"text":"Only rating this based on food *** please try their CRAB FRIED RICE!!!! Mmmmm and ask for the 'red' spicy sauce!! i can't get enough of that combo!! its delish!! I add that sauce to the pad thai as well!  But let me talk about their crab fried rice ( I always order this must-have dish Here) . I've tried places with their crab fried rice and its always good but I did notice that this restaurant doesn't get stingy when it comes to putting the crab in your rice!! ITS definitely there!! and lots of it!!! So each spoonful I taste -- i get lots of crab meat in there ** real crab, not crab meat*!!"}
{"text":"Kob kun kap.  Very yummy food"}
{"text":"When my husband goes to CSN we are here almost every week for lunch.   They do have delicious food and for 1.50 lunch special bobas that's pretty good too! I can't beat it and it's pretty good!   We usually order the pad Thai but lately we had been ordering their curry because it is really good, there is one curry that isn't on their lunch special but it is definitely worth it!"}
{"text":"Would have given it a five star if the restaurant was nice. But food never disappoints!"}
{"text":"We sent back raw pork and they just sent out the same dish.. Pork was still raw. Will never go back!"}
{"text":"Place is very cozy and comfortable. Got seated quickly during lunch time. It was not that busy though. Food came on the table pretty quick too. I have ordered their fried rice and shrimp spring roll. I thought food was ok. Fried rice needed salt and beef seemed to be very dry ( it almost seemed like they used leftover old beef ) for their rice.  Shrimp spring roll is nothing fancy . Basically a shrimp wrapped into a spring roll wrap with no other taste included in it. Service was very disappointing. A girl who served me had no smile, did not want to waste her time talking or come by the table to see if water  or anything needed . She just took the order and asked me at the end if i wanted my receipt for the bill.  Overall it was an alright experience for me."}
{"text":"I used to go here religiously but after discovering Khao San I've barley been back.  It's definitely above-par Thai food however as many other's have mentioned don't mess with the guy at the counter lol, you better abide by his rules meaning don't bug him when he's busy or try to seat yourself.   I do recommend the pad thai or golden curry."}
{"text":"Living off Centre St in Tuxedo means that I take the Centre Street bridge quite a lot in my travels south. I had always wondered about Thai Bistro. It seemed a little out of place in what seems to be a relatively run down block of shops just below U & Me restaurant at the bottom of Centre Bridge. I must say that I was pleasantly surprised by the quality of food at this little place. We went on a Thursday evening around 6:30 and the place was almost deserted except for one other table. We ordered the stuffed chicken wings to start and  Mango Salad, Pad Thai with Shrimp, Paneang Curry with Chicken and Steamed rice to share. The stuffed chicken wings were nice and crisp on the outside but the stuffing could have done with a bit more flavouring. The Mango Salad had a very good blend of dressing, a little bit salty, sweet, sour and spicy. The mango was a little under ripened but overall the flavours were wonderful. I was a little disappointed with the Pad Thai, tasty but a little too ketchupy for my liking. The tomato flavour overpowered the rest of the flavours so it was like having spaghetti having an identity crisis. The Paneang Curry was full of slices of chicken breast with a nice blend of lemon grass and thai curry flavours. For those used to spicy food the food was very mild even though both the salad and curry were marked as being spicy. Service was good, Not the best Thai food I've had but for being downtown and probably making most of their money with the lunch crowd I'd go again. Nice ambience for a quiet dinner with friends where you can linger and not feel rushed to finish and leave. Prices were average $12-$15 for main dishes."}
{"text":"Review is only for their Pad Thai.  I used to get take-out all the time from Thai Bistro and was extremely sad when I found out they closed.  Now the space is occupied by another Chinese noodle place \" Hey Noodle\".  Willowdale does not need another Chinese Noodle joint.  For under $13.00 for a Beef Pad Thai WITH Tofu, it was of great value for authentic Pad Thai, made by a Thai family.  It filled up the entire take-out container.  In my opinion, it was the best Pad Thai in Toronto for taste and value and I miss it so much.  Jack (the guy that runs the show at the front), his sister, and mother (the chef) were always nice and pleasant with me.  I hope they are doing well with whatever they're doing now.    Jack - if you see this, please let me know if you have opened a new restaurant somewhere else!"}
{"text":"This restaurant was a pleasant surprise!  A hole in the wall, it appears to be a family-run restaurant.  My family of 4 had the Chicken Tom Kha Soup (hot and sour soup w/coconut milk) and Pla Sam Sot (deep fried whole tilapia) and was perfect.  The soup was a little bit salty (not sure if this is how it is every day) but with some steamed rice it was the perfect meal!!  It had great flavors (fresh galangal - hard to find where i am from!).  The fish was delicious - make sure to dip the meat in the hot sauce.  Service can be a little slow because there are very few people running the restaurant so if you're in a rush, I wouldn't go here.  But if you are looking for a nice sit down place, good atmosphere to chat with friends, and good food, I strongly recommend this place!"}
{"text":"Outstanding!  I always get Tod Mun if they have it. It's fried fishcakes and it has a really distinctive flavor. The fish cakes were good, but the sauce that came with them was over the top. It was the sweet-spicy-cucumber-penuts sauce that normally comes with many of the Thai starters, but this sauce was anything but normal - thick and sweet, and with a real kick of spice dampened by the cucumbers was more like a chutney actually?...I digress.  For my main I had the stir fry with chicken, peppers, carrots, onions and cashews (I love cashews and almonds in cuisine). This was superb as well. I liked the fact that they didn't thicken it with cornstarch. I really think that cheapens the dish and blends the flavors too much.  Anyway, I really liked Thai Bistro. Lots of locals enjoying dinner or getting take out.   I would have never found this place if it wasn't for Yelp - in fact, I drove by it twice today and didn't even know it - thanks Yelp."}
{"text":"I love the drunken noodles with crispy tofu, only thing I've gotten. With a Thai tea of course, portion size us good too. Staff is friendly, place is clean."}
{"text":"Good authentic restaurant right on a busy stretch of other restaurants and shopping. I think it was in Chinatown but not positive. It was within walking distance of the hotel I was staying at.  I was there on a Sunday evening donut wasn't crowded. We were seated quickly and our food was out in no time.  Decent sized dining area with about a dozen tables or so.  I had the Tom Yum Gum soup and the Thai Fried rice. Both were very good. Authentic for sure."}
{"text":"Overall my favorite Thai place in Vegas!!! HIGHLY recommend to everyone - in particular CSN students. We get a discount, and it's the perfect place to hang before/after/in between classes.   The food is top notch quality - I just ate at Lotus of Siam (one of the highest rated Thai restaurants in town) and this place is giving them a run for their money. Especially being less than half the price over all.   Can't say enough good things about this joint. Thank you Thai Bistro!!"}
{"text":"This is my fav Thai Restaurant in Calgary , reasonable price , awesome service, great food with original taste, clean and big space for a small group . The owner is always smile and friendly even when we order some food which isnt exist in their menu , they can cook all for us."}
{"text":"Waited for 30 minutes for my food, turns it they didn't even place it.  30 minutes of my life wasted. I know it happens but at least come up to me to apologize instead of trying to low-key act like it didn't happen even as i came up to ask about my food."}
{"text":"Introduced to this place by my sis - I don't spend a lot of time in this part of town...  We had pad thai and pineapple fried rice - I'm told it's super authentic (I've never been to Thailand, so I can't say for sure...)  But it was really tasty.  I'm coming here again, when I'm in the part of town...  Worth the visit - we had take out also, so I can't comment on the nazi server..."}
{"text":"Delicious! I very rarely eat Thai food. After the experience that I had at this restaurant I'll definitely return again soon!  For some strange reason I've always associated the word, \"bistro\" with, \"expensive\". Probably because I work near a bistro that serves fairly fancy food at a high price tag. For those of you like me that didn't know the definition of bistro, it is a small restaurant.  Thai Bistro is that. A small restaurant tucked into the lower level of a building on Centre Street which serves very tasty ethnic cuisine at a low price tag.  I ordered a noodle dish called Pad Woon Sen. The dish had lots of fresh vegetables like peas, cauliflower, corn and peppers mixed with egg over some vermicelli noodles.The noodles were quite glossy and had a wonderful texture, not at all soggy! The sauce was flavorful but did not overpower the flavors of the combined ingredients! That being said I added heaps of hot sauce provided to the table which had a fantastic garlic flavor and aroma!  It should be noted that I went to this venue because of a UYE (Unofficial Yelp Event) which seated approximately 12 Yelpers. I arrived an hour after the event started and was served immediately. My food arrived at the table very quickly after ordering. A few other Yelpers arrived around the same time as me and were served just as quickly. There were other occupied tables that ordered and they had food on their table shortly after. I asked our very friendly server how many kitchen staff they had. Just two! Feeling very positive about the service, the food and the overall impression of this venue.  When it came time to pay the server offered to split the bill without being asked to do so. I was surprised that there was no added gratuity given the size of the group. I tipped handsomely.  In discussing our meals as a group I realized that every dish served here is unique in look, ingredients and flavor. Big plus points for a reason to return again and try something new!  Thank you Thai Bistro for the wonderful experience (and thanks again for not having any distracting televisions)! A great place to keep company and let the days events roll off your back while enjoying a truly excellent meal. Like traveling to another country for an hour or so!"}
{"text":"This place get a 5* for value all day long. Where in this city -beside MacDonalds-can two people have lunch for $20. Like seriously. My friend had chicken pad thai. I ordered the green curry with chicken- it is so delish I can't seem to order something else for fear that it wont match this delish. And totally was $20. We just had water to be fair but what a deal.   The salad rolls are great. All the dishes are great and served with elegance as if you are in a higher priced thai restaurant with little details and dishes. The atmosphere is nice as well. Nicer than you would expect or of other Vietnamese or Thai restaurants that tend to look a little diner-ish. If you like Thai or lovely stir frys with fresh food and rice/coconut or plain-try it out."}
{"text":"Don't let the dingy decor fool you. The food is amazing!!!  A friend of mine took me here a couple of years ago and this is my favourite Thai restaurant so far. They have the best Thai food in Toronto. It's pretty authentic from what I've been told.  I'm not usually a fan of Thai food only because most places that I've been to can't make a decent Pad Thai sauce without using ketchup.  My personal favourites are the Curries (red and green), Pad Thai and this other stir fry clear noodle dish.  I've never had problems with their service. The gentleman is very nice and quite attentive if he isn't running around serving other guests. When I'm in the mood for Thai, I usually come here when I'm in the area."}
{"text":"my very first favorite restaurant in calgary since i moved here last year. ive been to thailand before and tried their fancy expensive pad thai, street pad thai they sell out of the motorcycle and the ones they sell off a boat too. i still love thai bistros pad thai. sooo good!  thai bistro's pad thai are delicious. and the green coconut curry. and tom yum soup. and tom kha soup. their tom kha soup is soooooo much like the ones ive tried in thailand. and their fried rice blows other fried rice ive ever tried out of the water."}
{"text":"Service was horrible. Food was okay. Presentation was good. The problem I had with the service was that the waitress took a while to take our order, was no where to be found when we were eating (ie no checkup) and brought out the food immediately after the soup/appies. Curry could have used more veggies other than huge chunks of potatoes, and shrimp, but that's not as important as the horrible service. She was also was very difficult to track down when it was time to get the bill. When I had to pay for the bill I tried to get her attention but after 5 min I just walked up to the front and paid there."}
{"text":"Good food, authentic, good portion size and the guy behind the counter is always welcoming when we visit on business trips to the area.   All in all good value for your money and the food is delicious.   If you're looking for fine dining, this is not it. But it doesn't attempt to be."}
{"text":"This place is amazing. I don't understand why everyone seems to be giving the waiter (there's only one waiter who works there) a hard time. He's fantastic- passionate, friendly and outgoing. I lived in Bangkok for 6 months and can say that the food here is almost comparable to what you would get in Thailand (would be comparable if Thai Bistro was able to get the same fresh ingredients as you get in Thailand)."}
{"text":"This is our go-to Thai place. Only downsides is that it's closed on Sundays and doesn't deliver (as far as I'm aware).  Delicious food, quick, friendly service; I haven't had any bad experiences with the staff as mentioned in other reviews.  I'm also a fan of their recent addition - a framed picture of Justin Trudeau enjoying some Thai food at the restaurant."}
{"text":"I don't like giving one star reviews to establishments as I always give the place a benefit if the doubt, but for this place I wouldn't think twice.  This review is based solely on my experience for takeout/pick up.   Our boss (a doctor)  asked if we can order takeout from Thai Bistro for a party of 5. One of the girls at work called and she was trying to place an order.  The man on the other end of the line was abrupt and borderline rude to her,  when she asked how many pieces of spring rolls in each order.  He hang up the phone on her.  So I called,  and again introduced myself,  saying that I'm calling from a doctors office and would like to order for pick up.  He then asked me,` were you the one who called earlier'?   I said, ' it was my office mate and apparently you hung up on her.' he said 'she doesn't know what she's talking about.'  so I let it pass and proceeded to order,  then he interrupted me by saying,  'you know I'm just taking this order because he's a doctor (referring to my boss).  I though I misheard him,  or must be difficulty with the language.  So I asked him to repeat what he said. He said' I'm taking this order only because he's a doctor. ' to which I replied, ' so if I call to order,  and I'm not a doctor,  just a regular person,  wouldn't you take my order?  His reply was a flat ' No.' so I told him,  ' that's blatant discrimination,  and I refuse to give you business from now on.  I'd rather give the business to someone who knows the meaning of customer service', and I hang up on him this time."}
{"text":"My friend and I came here for a late dinner last night post-CIFF.   Note that I have a very low tolerance for spicy food, so typically, I leave the Thai/Korean/Mexican and sometimes Indian restaurants for very special occasions (read - if I absolutely have to). I didn't \"absolutely have to\" last night, I suppose; but it was 10PM on a Saturday night up 17th and everywhere else seemed busy. Also, we wanted to try it out since it's fairly new (in the area, although I understand there is another location in Chinatown).  My friend ordered a large #10 Tom Yum (chicken) - a hot and sour chicken soup with mushrooms and lemongrass while I ordered the #42 Ka Nom Jean - steamed rice noodles with green curry chicken. I found the portions pretty small for both (the curry and soup came in small bowls), but I'd say they were still filling.   The green curry was really good even though I thought it was quite hot. It was spicier than the Tom Yum actually, but I managed through it (with just one glass of water - which is really impressive for me!). Service was also very friendly and the food was fast - but that might be because we were the only customers there.   I'd come back, though, definitely. Maybe something a little less spicy next time."}
{"text":"Stopped by for lunch. Excellent place. Lunch portions so big I have dinner now. Great prices and very friendly staff. It's worth a try! I'll definitely be back."}
{"text":"Highly enjoyed their food .  The yellow curry is amazing and their bobas!!! Would totally recommend to anyone who wants to eat something quick . It's really not a sit down restaurant in my opinion . But I highly enjoyed it !"}
{"text":"Convenient to walk to from the hotel where I stayed and the food came quickly after we ordered. The tom yum chicken soup was tasty and so was the chicken pad Thai."}
{"text":"Fast service. A little overpriced. I ordered the pad thai but it wasn't very flavorful. I was only in town for a business trip so I won't be going back."}
{"text":"I ordered a pad thai with tofu and vegetables for pickup and it was delicious, with generous egg, chopped peanuts, and silken tofu. There probably could have been more vegetables but I'm satisfied overall!"}
{"text":"As a Thai food lover I must say this place is most excellent! I had the Tom Ka Kai soup and Pad See Ew and they both were very good. This place made me happy I had the chance to visit Calgary."}
{"text":"Where to eat late on a Friday? I keep trying to make it out to White Elephant Thai Cuisine but it hasn't aligned with the heavens yet. Curse their ridiculous hours! One of these days, I'll make it. We decided to head to Chinatown and try Soban Korean. B.B.Q. Luck was not on our side that night as Soban decided to close early for the night. Hate when restaurants do that! It's not like we got there last second either. We were there an hour before their closing time. Alright, enough complaints. We were starved by then so we walked around for a bit before spotting Thai Bistro. Open till 12am. Boom, done.  The interior isn't fancy but has a very quaint, relaxing ambiance to it. There was a massive table of 20 people wrapping up their dinner when we arrived. I bet they were taking advantage of the BYOW (corkage fee is $12.00 for a bottle). We perused the menu quickly and decided on three entrees. Interestingly enough, the waitress thought three dishes would be too much food for two people, which was nice of her to say to us. But clearly she doesn't know Asians can eat. We devoured everything except for a tiny box of leftovers.  - Thai iced tea ($3.95) - my friend ordered the Thai style iced tea, which was actually quite good. I'll have to start ordering these from now on. Refreshingly light. - Sticky rice ($2.45 - beautifully presented, the sticky rice comes in a light weaved basket. The sticky rice was fluffy, fragrant and perfect to go with dishes. YUM.  - Kuay teaw nua sub (#46) ($10.95) - stir fried rice noodle with beef, vegetables and curry powder gravy. This was my favourite dish of the night. The noodles had an excellent bite to them. - Gaeng pah (#54) ($12.95) - water base curry with pork, herbs, spices and vegetables. Also known as \"jungle\" curry, we decided to try this dish out as it was new to both of our palates. This was our least favourite of the night as it lacked any real depth, spiciness and flavour that you normally associate with Thai curries. The sour curry sounded much more promising. As well, the pork added to the dish wasn't very good either. We ended up leaving the curry as it was more like a watered down soup base than anything curry related. - Pad ma kua yao (#63) ($10.95) - stir fry eggplant with soya bean paste and basil. We were originally going to get #64 (stir fry garlic, pepper and vegetables) but the waitress suggested we try the eggplant instead. I love eggplant so I was very much in agreement. The eggplant was perfectly cooked, there was just NOT enough! Seriously, if the main ingredient is eggplant, I want there to be an eggplant overload of it on the plate. The rest of your vegetables were pretty standard.  Thai Bistro is probably not the best Thai place in town but if you need a place to satisfy your midnight cravings, this is your spot. They are open till midnight Friday and Saturday! The staff are also very sweet and humble. If you crave something order than Chinese in Chinatown, check them out."}
{"text":"Friendly and quick service. I ordered one of their 4 lunch specials for $6.95. You have the option of adding a Thai tea for a $1.00. Food was ok taste wise. I've had better Thai food. Space is clean and there is free wifi. As mentioned before, it is both a Thai and boba spot. I did not try the boba so can't speak about that. This place is a great spot for students which makes sense with the price point and location. It's not a place I would make a special trip to visit unless I needed wifi and a cheap lunch spot."}
{"text":"Normal Thai food restaurant in north york area. Minimum ten dollars food purchase to dine in. That's disappointing because some dishes are around nine ish. Food is okay though not a large restaurant but if u are looking for a small lunch or dinner Thai bistro can be a choice"}
{"text":"This gets 4 stars for the food ONLY, i want ot make that clear. The food is authentic, tasteful, though I think just slightly on the expensive side for what you get. They are REAL thai people owning and working this family joint.  HOWEVER, as some other reviews have mentioned the male who works the cashier is  moody at times. Sometimes he's really nice and sometimes he's cold. You just need to be patient and calm. But I stress the food is GOOD!  some people call this place totally ghetto in the decorations and atmosphere. its just your regular breakfast diner type setup with about 5 or 6 tables. I don't mind it at all but its the complete opposite of say, the Keg, in terms of decor and atmosphere.  NOT a good place to take a date! (btw that's not from personal experience)"}
{"text":"Tried their CURRY for the first time. It had lots of SOYBEAN OIL  in it & a TINY sprinkle of coconut milk on top. A few positive notes - The flavor was ok, quantity of vegetables & meat were generous. Waiter & Staff were very kind. Have tried many thai curries  in Vegas & never seen this. Soybean is the cheapest & worst oil to use in cooking. Oily Curry?  Really? The price was cheaper than others but the huge amount of oil used was very excessive. - Caused stomach upset same day & next day!  If your looking for good curry this is NOT the place. In the future I may patron this place for some of their drinks just not the food."}
{"text":"This is a pretty decent Thai place in the city, and it's in down town which makes it extremely convenient to pick food up after work on the way home. I've only ever picked up food and had it delivered to my home so I can't comment on the actual restaurant. My food has always been very good and healthy portion sizes which was great for our household (leftovers are always welcome). The price of the food was pretty standard as far as Thai food goes and I've always had a good experience with the staff. My issue with this place arises when I tried to get food delivered to my house. I don't live that far from downtown, maybe 10 minutes by car, yet when I ordered food at 7pm on a Tuesday I was  quoted 1.5 hours for delivery which I personally think is a bit ridiculous. When the driver arrived he asked if I had been waiting long and I mentioned it was over an hour. He said he literally just picked up my order and came here which leads me to believe that they are grossly understaffed.  I will order from here again but only on days where I can go and pick up my food."}
{"text":"Yowzah! That curry's spicy! Thankfully, it wasn't mine. Just a nibble from Jan L's dish. Good thing humans can't actually breath fire.  Instead, I had myself some Pad Ped with chicken (stir fry w/ red curry paste, galanga, onion, bamboo shoot, pepper, basil, chili). I ordered it because I wanted to try some bamboo. I had no idea what it tasted like. I still couldn't tell you what it tastes like, but it's probably pretty tasty, because my entire dish was delicious.  I think next time, I'd prefer to order a bunch of dishes to share. The portion was generous, and I ate the whole thing, but I'm not like Joey from friends. I like to share food.  Next time? Take out!  Yelp's 30 Day Challenge: 9/30"}
{"text":"Definitely my go-to thai place in the area. The core dishes I always get (pad thai and panang curry) are great, and my standards for these are high. Parking kind of sucks and seating is essentially non-existent, so don't come here for the ambience -- but come for the food! Seriously wish this place delivered, but then again I'd be ordering it every other night if it did. I don't know of many other thai places close by but that's because I never looked again after my friend brought me Thai bistro takeout the first week I moved in!"}
{"text":"It's been awhile since I''ve enjoyed a good Thai meal... To be honest, a lot of times I'm just disappointed. Thai Bistro did not disappoint.  I was caught downtown with traffic every which way so I decided to have a little dinner before going home.  I ordered the Pad Thai and it was good. Other tables ordered curry and it looked soooo good. I would definitely be back to try their curry.  Inside is very clean with Thai accents, but not cheesy... nice! Chef is Thai. Service was good.  2nd location on 17th ave and 14th street (by Chianti's and chocolate bar area).  Bonus stars for having Thai Iced tea! FTW!!  =)"}
{"text":"A good lunch spot with good sized portions and tasty food. Friendly service as you walk in and the atmosphere is very relaxed. I have tried pad Thai, curry chicken and a shrimp dish. All yummy. Solid place to visit for a business lunch!"}
{"text":"This is a second outpost of Thai Bistro in Chinatown, opened in what had been the O Shima space for the last three years. Though I've become partial to the newly-opened Khao San Thai Kitchen a block or so east, and also though my experiences with Thai Bistro in Chinatown have been mixed, I still decided to give this new location a try yesterday. I got an order of the fish cakes (which Khao San doesn't have on the menu, so it didn't feel quite like cheating) and their spin on chicken with basil (#62 on the menu, listed by its Thai name which I don't have in front of me right now) for take-out.  Food was ready in minutes and as I live steps away, so was I. After a nice brief chat with the Thai owner, I paid my $17 and took my repast home. First noticing: This is a lot of food, easily enough, with rice (I made this myself but it's $1.95 on the menu), for two people- for $17. Try that at any other Thai place in town. The fish cakes have always been great at the Chinatown location and were here too, with that oddly rubbery but addictive texture and a really nice dipping sauce of sweet chili and cucumbers. Two big cakes are just $4, a steal. The basil chicken was fine, but needed both salt and heat- needed more fish sauce and way more chili but I'd hope this can be rectified on ordering. The PORTION was big- as I say, with rice (and you need rice with basil chicken, it's not made for eating by itself anymore than would you eat bolognese sauce without pasta), it could easily feed two. In a city with consistently overpriced Thai, this is really refreshing.  All in all, I'm thrilled. Yes, we lost two of my favourite restos, O Shima and Jaro Blue, but we got two good new Thai places in a neighbourhood that had had zero (and no, Thai Tai is not Thai but rather a Vietnamese sandwich shop). That's a trade up, I'd say."}
{"text":"It's a weird environment, and the kids working the front rather play on there phones then tend to the costumer. The food was not that great either . I won't be coming back here"}
{"text":"Yah, things just got really weird here fast. The food quality has been declining and it's not what it used to be.  And soup nazi himself is going crazier over the years. It's gotten to the uncomfortable point of literally fearing for my wellbeing when i walk into that place now.   There's no love left in the food and there's no life left in the soup nazi.    I'm done with this place."}
{"text":"We've finally found a good Thai place! Good service, tasty food and reasonably priced!  We ordered tom yum w/ shrimp, shrimp pad thai and chicken red curry and we paid the same amount with a lot less food in Thai Nong Khai. The shrimp in the tom yum tastes very fresh and the broth is has that right amount of tang that will wake up your taste buds for the feast to come. The curry had the right amount of curry and spice but I think they should add more chicken meat to the dish. And finally the shrimp pad thai is very very flavorful with very fresh shrimp! The noodles I thought were a little overcooked but it didn't ruin the dish for me.   Before leaving we found out that they deliver so yay! They're probably gonna get a call from me soon."}
{"text":"Based on the reviews, I was very excited to try this place. I had just gotten back from Thailand and have been craving more Thai food. I came in yesterday shortly after 5:00pm. I placed an order for take out, took a seat with my number, and waited in the not busy restaurant. I watched as a few people came in after me, placed their orders, received their food and left. 40 minutes later, I finally went back up to the counter and told them I just needed a refund as I couldn't wait any longer at this point. The man at the counter looked at my receipt and seemed surprised that I hadn't received my food yet (I had ordered 2 vegetarian dishes). After grabbing someone else, they explained that they couldn't refund my credit card (or refund me in any way) because they didn't have a manager present. After a little debate, they finally just gave me my money back in cash. I would love to be able to comment on the food, but I unfortunately never got to that point."}
{"text":"Great friendly service. I got take out for the veggie spring rolls and green curry with coconut rice.   Spring rolls were delicious, but the coconut rice needed more flavour. The green curry was on the spicy side, but still delicious. Friendly staff and quick service for takeout."}
{"text":"Oh I love Thai food, I really do. I love anything that resembles Thai food, and the closer the approximation the happier I am. This place made me pretty happy. I came here for a long lunch one day and it didn't disappoint. The menu was diverse and had a variety of the staples (pad thai, tom yum kung, etc).   I got the pad see ew, my husband got pad thai, and we split the fish cakes as an appetizer. The fish cakes were delicious. They had a perfect flavor and consistency and I wish more than 2 had arrived. The main dishes were quite delicious as well. Although I must say that my husband's choice of the pad thai was a better once than mine.   All-in-all, I really liked this place. I don't have high standards of thai food outside of Thailand (in terms of authenticity), I am generally just looking for good flavor, fast service, and a good price and this place does all three well."}
{"text":"Decided to stop in here with my brother for lunch. They had a very small lunch menu with only 4 items priced at 6.95. I ordered the pad see ew and my brother ordered the green curry chicken. You can upgrade your drink to a boba tea for only $1.00 or $1.50 more depending on the size. The lunch specials didn't include anything except I received one egg roll.   The food was very underwhelming for a Thai restaurant. The pad see we was meh. It didn't have much flavor and the chicken was cut way too large for this dish. I have ate this dish at several other establishments in town and this probably ranked the lowest out of all of them. I didn't even finish it. The egg roll was soggy and full of oil. I had to ask for a sauce for it because they don't automatically give you any dipping sauce.  The green chicken curry was decent but the curry was a little on the watery side. There were more vegetables then chicken it it. The portions are not as big as other places. For the lunch special price being closer to a higher end most places at least give you soup or salad and sometimes a drink.   The service was good. They were friendly and smiled. But at the end of the day, the food was generic and I could have probably bought a prefrozen package in the grocery store and had the same meal for less.  I wouldn't recommend and I wouldn't go back"}
{"text":"We got take out here. My friend who lives in the area said the guy working the front to take your order is the most unhelpful person, but the food is worth the lack of care in service. We tried about 6 dishes but i don't remember all the names. Definitely a ginger chicken, pineapple chicken curry, golden beef, some vegetables and another curry and all of it was really good."}
{"text":"Pad thai here is incredible delicious!!... And the portion was big enough to eat lunch and have the half for dinner.. I didn't eat at the place. It was just to take out, but I really want to go back there to try something else, because the chicken pad Thai was really good!!.. And the prices are not bad.. I am counting the days to go back there!!..."}
{"text":"Our go to Thai take out spot.  Food is authentic and flavorful.  We first started to dine in but the seating is not that comfortable being a small greasy spoon.  Also the sit in portion is smaller.  So we call for take out a few times per month.  Pad Thai, pineapple fried rice, curry (red or green), spring roll and Tom yum soup are our regular go to dish.  Very yummy.  I know the gentlemen there can be quite a bit of a character but he loves my hubby, so for us it always been great service"}
{"text":"One of the most authentic Thai restaurants in Calgary.  The food has a great contrast of sweet and spicy, and reminded me of my travels to Thailand.  The restaurant staff were incredibly nice.  We came in 2 minutes before they were supposed to close and they still served us.  The food is very reasonably priced, especially for the quality.  I will definitely be back."}
{"text":"Too bad I can't give ZERO stars to this place becasue that's what they deserve!!! I've never experienced such bad service in my life! I went there on one of the evenings around 7:00pm and the place was half empty.. I looking at their \"take out \"menu and was debating whether I should order Tom Yum soup as a take out or stay in.. I asked the server something about the soup and decided the stay in. As soon as I said that I will be staying in, I was told by the server/cashier that I can not stay in if I am ordering only a soup, When I asked why? I was told that they will not serve me unless I ordering a main course, \"Soup is not enough\" the server added.. I left the place immediately..   It's not the first time that I am going to a place where there is a minimum ordering fee.This place looks like a small shop, nothing fancy and no where in the menu it says \"Minimum order $10\" or something like that.     From there I drove to another Thai restaurant where I was \"allowed\" to order only soup (I will be posting that review soon)"}
{"text":"Pad Thai has ketchup / tomato sauce in it, which is a bit off putting, but common in the cheaper thai places in vancouver anyway."}
{"text":"Satay was marginal. Left my entire meal behind after. Pepper shrimp smelled weird and didn't taste right. Mongolian beef, according to my partner, was not worth finishing after the first bite. Save yourself from the experience. Ps, we have never left food behind like that."}
{"text":"Omg this place is delicious, clean and quick!! Staff is very friendly!! Chill atmosphere with great music!! Being right across from campus I am sure this would be a great place to eat between classes."}
{"text":"Amazing  food, don't judge by the decor. Trust the owner for suggestions and enjoy.  Best to eat in."}
{"text":"The food here is inconsistently prepared but it's almost always still quite good - we order the curry frequently and the amount of spice varies significantly, but I've never been disappointed with it because I like spice, and I just add hot sauce if it happens to be on the less spicy side.  One weird thing was when they chopped up the bay leaf in the curry for some strange reason (since bay leaves are inedible I as picking them out of the dish as I ate - but this only happened a couple times).  I would suggest ordering takeout, because every time we've been in the restaurant it's had a smell like there's something wrong with the pipes... stale toilet water is the best way I can describe it. Not sure if they have an issue with their plumbing. The food is quite good though, overall."}
{"text":"Home-cooked Goodness.  I ordered a classic chicken pad thai.  From the moment I took that first bite I was in Thailand.  I had to ask the cashier where they were from and they are originally from Thailand, the cooks were the cashier's mom and aunt.  It was great.  The only thing I would improve would to be open on Sundays.  I enjoyed it."}
{"text":"Wandered in here by chance today with my family for my little sisters birthday. She insisted we order a bunch of stuff and share which is not typically how I roll when out for Thai...but anyway,  I personally ate the mixed vegetables, coconut rice and green curry with vegetables.   It took a while for the food to get there, but to be fair it was Canada Day and we were warned. The service was snappy and friendly.  Green Curry was delicious! right amount of kick and creaminess. Mixed veg...exactly how it should be: stir fried veggies.   The only disappointing bit was the coconut rice, which had a fairly bland mushy taste. Sad.  Overall a decent meal, good service and fair prices!"}
{"text":"Went there for lunch today with a friend.  I ordered the Pad Thai Noodles.  It was all right with all the seasonings of the pad thai but I found it a little on the sweet side.  I asked for hot sauce and the waitress went away and I waited and waited and had to flag down the waiter finally to get my hot sauce.  The hot sauce is handmade with vinegar and finely chopped pieces of red chilli and garlic.  That was the zip I needed on my noodles.    I may come back and try their dinner dishes.  But for me lunch was just all right.  Price is reasonably cheap at lunch time.  Paid only $7.95 for my meal."}
{"text":"It was after seven when I arrived. They close at eight, but the space was about a quarter filled. There's quite a number of tables and they have several large tables, which makes this a good place to consider if you have a large group.   I ordered takeout instead of dining at the restaurant. I chose the pad woon sen and a fresh spring roll with chicken appetizer. They didn't have to go containers for drinks, so I was unable to get a drink to go. The food came out super quick. It was less than ten minutes from order to product.   There are two spring rolls, which they cut in half, so there's a total of four pieces. The spring rolls were not bad. I really like the pad woon sen however. The chicken was flavorful and the noodles were delicious. They give you a pretty good portion size as well."}
{"text":"Went out here for lunch with some friends. The menu will give you a bit of sticker shock considering the decor and the amount.   Ignoring the price and decor the food I had which is the chicken cashew. I was impressed. The flavour was pretty complex to sum it up. It had some sweet from the sauce and citrus fruit, some bulk from the chicken and cashew. Just the right amount of savoury flavour  from the sauce. There's some bitter zest from the citrus skins.   The meal at the end was well balanced and I was satisfied at the end. Not too full though because it is a bit oily.   Overall the food was over a four star rating  but the decor and price sort of dragged it down. But I am feeling generous and giving it a four star rating."}
{"text":"Food is great! It's casual and price is RIGHT!! One of the BEST TOM YUM soup recipes in Las Vegas. I have had the Larb, Tom Yum, and Yellow curry. This is my go-to when I am craving Thai. Nice staff, and quick. Low prices are a PLUS!"}
{"text":"The service was prompt and polite.  The prices were reasonable, and the flavours of the food were very on point, so tasty!   I'd love to go back and try more menu items, as I had such a challenging time deciding what to eat.    A friend and I shared the chicken salad rolls, and they were very crisp and tasty, with mint inside.   The peanut sauce was typical. For dinner, I had the pad thai with chicken, and my friend had the green curry with coconut rice - we shared both.   So tasty!"}
{"text":"Amazing food and Boba. The portion sizes are huge, I usually get 3 meals out of one. The lunch special has a nice selection that rotates. Best Thai tea I've had in Vegas..."}
{"text":"We ordered in from Thai Bistro today for a co-workers last day at the office.  The order and pickup went smoothly and the gentlemen (assume the owner) was very nice.  But like some of the other people have mentioned below, all my co-workers have mentioned that sometimes the gentleman behind the counter gets mad.... well, he seemed okay today.  Price was reasonable.   I had a variety of items... the Shrimp Pad Thai was pretty good, but I personally like mine a little bit more spicy.  But it was pretty good.   The sticky rice was a little too sticky for me as I had to use a knife to literally cut through it (my plastic fork broke trying to unstick the rice enough so that I didn't put the entire bowl of rice in my mouth at once).  So, yes, that was the first time I needed a knife and fork for rice... but hey, I'm open to new things.   My main dish was the Ginger chicken.  It was okay... nothing great.  I'm not sure if this was the norm or not, but there was a massive amount of julien style cut ginger... in mine.  I know it's Ginger chicken, but there just seemed to be lots of the actual peices of ginger, vs. just the flavour.  The vegetables were fairly bland.  Overall, I ate my lunch and it was okay.  I probably wouldn't order from this place again, as I will be on the lookout for more \"Blow my tastbuds away\" kind of places.   Cheers!"}
{"text":"The environment is super chill, the first time I went in they were playing 50 First Dates in the background (yess). Now for the food, they are not playing with the spice level. I made the mistake of getting level 8 for my Shrimp pad Thai. It was sooooo good but so spicy. Was visiting Vegas for 1 week and I went to Thai Bistro a total of 3 times, no shame."}
{"text":"This is a cute little place next to the community college on Charleston. My friends and I came here on our lunch break and we're not disappointed by the amount of food that was given. The cashier was also very nice and helpful as it was our first time coming to eat here.   We were told that the lunch specials change on a weekly basis which is different. The portions were really big. We choose to share crunchy lemon chicken, stands dumplings, and two of their lunch specials which I forget what they were, but the portions were so big that we had a lot of left overs. My favorite was the rice dish. Also, this place is connected with a jobs place so if you order an entree you can add Thai tea for $1 which we all got one of our own.   Overall, the restaurant was clean and the workers were very friendly and knowledgeable about their menu. I would come here again for their lunch time to see what is on their menu on a different day!"}
