{"text":"Discovered this place when my best friend and I were craving Thai food and were just scrolling through the yelps.

I definitely agree with the good reviews this place gets, the food is great and for a great price!
We were the only ones there on a weekend at dinner time, so this place definitely doesn't get the traffic it deserves, but its definitely one of the city's hidden gems. The

I even went back and brought a group of my co-workers here. We all had the lunch special that comes with a spring roll and bowl of soup, all for about ~$8 and they loved it too.

The only negative thing I have to say is that the waitress that served us (both times I went) was not very courteous with us. She just takes our order and leaves, no smile. Once there was a piece of plastic wrap in my friend's cup; we told the waitress and she just took her cup and exchanged it with no apology. But this is sort of expected and common in a lot of asian restaurants, so I wasn't too surprised. Just a thing to keep in mind."}
{"text":"Lines too long at Pai? Settle for Thai on Yonge!

No but seriously though this little gem above Yonge has become my go-to \"want good Thai food but can't get into pai or it's like 10:45 pm right now\" restaurant to order take out! 
Can't say much about the sit in service but if anyone lives around the area and wants Thai food that isn't salad king I would give them a try! Food is pretty good and their menu is extensive as well! The owners are really nice and it's really a chill family-run place. 

Been eating out here since they opened and I really don't have a single compliant."}
{"text":"It's OK. I ordered a wide noodle dish. The taste was just OK. Service was good though. I ordered take-out but did take a look inside of the restaurant. Felt like that place is good for take-out, not very good dinning in place."}
{"text":"Came here to meet a friend based on reviews on yelp and we were not disappointed! We split the golden chicken curry and the curry beef which both come with rice. The portions are average size, and the quality and value for money is amazing. (A meal for two for $22 + tip!) I liked the golden chicken curry best, but the beef was also tasty. I recommend sharing the first time you go so you can try more things!

The decor is nothing fancy, but it was clean and simple. I really hope this place stays open because it is hard to find a reasonably priced meal in that area of town, especially one that is so delicious. Unfortunately it wasn't very busy on a Monday night around dinner time but maybe weekends are busier... They offer a student discount of 10% and have lunch specials. I'd say don't hesitate to give it a try if you want authentic Thai food for a great price."}
{"text":"Clean and bright atmosphere. The food was excellent. Hubby got the golden chicken curry and I had the Khao Soi. Both were delicious and we were full when we finished. The prices were incredibly reasonable, and you can't beat the location. Sadly, we were the only two in there at dinner hour on a Saturday. Here's hoping this place lasts as we would definitely go back!"}
{"text":"Been here a few times already.. my favorite dishes are the green mango salad, pad Thai and the very delicious mango sticky rice! Huge portions, delicious, fresh, good price. Thumb up"}
{"text":"Having lived in Thailand I missed having access to authentic Thai food. After trying several restaurants like Khao San and Pai I found the food here to be way more authentic than the rest. The service was also good--we had a very polite server!"}
{"text":"It's my fifth time here. Love it! The food is great as always. The chicken, shimps and fried rice are tasty. Just hope they can change the music - it's too \"Classic\" for me."}
{"text":"Tried this restaurant for the first time and it is fantastic.  It is very authentic Thai food.  The quality is as good as anyplace I have tried in the city.  The portions are very generous for a very reasonable price and the service is very friendly.  Highly recommend this restaurant and can't wait to go again and try some more dishes from their menu."}
{"text":"Came in for Thai Sunday brunch, with a huge craving for Tom Yam. 
The lady serving us was very friendly, quick and efficient.
They offered us warm water instead of the usual ice cold glass, which was very thoughtful since it is -30 outside. 
We got a complimentary spring roll which was great. We ordered Tom Yam, dumpling soup and Street Pad Tai and was definitely satisfied with everything.
Will definitely be back for more Thai food cravings."}
{"text":"Authentic Thai + closed to my place + cheap = 5-star quick meal place. 
The flavor might not be as impressive as KSR, but if you add some chili sauce in it, you can pretty much get a similar meal that you had in KSR. 
Student 10% off discount, another bonus lol"}
{"text":"The food was good. I had the Street Pad Thai and my husband had the Basil Fried rice. I requested the crazy spicy, but it wasn't even mildly spicy. We came about 30 minutes before they closed. We asked if they were open to which the lady said yes. But she seemed very annoyed we were there; which made the meal awkward. We definitely would rather she  had told us they were closed or no longer serving food. Although I did see she let another  couple come in after us, but denied a third. They got the same annoyed reaction as us."}
{"text":"I just had dinner with my best friend in this new Thai restaurant, opened only for two months. Both the service and food are great! We ordered coconut soup, special appetizers, street pad thai, and golden curry chicken. As the food is cooked by Thai chef, we really enjoyed the real thai taste, even they make their own satay sauce. Very reasonable price and we will definitely go back again! HIGHLY RECOMMENDED"}
{"text":"Been here several times. We ordered coconut soup every time.if you are into creamy coconut flavor , this soup is a must-have! The street pad Thai is also the best I have ever had!"}
{"text":"I have very mixed reviews about this place. The first time I came here I had the red curry with chicken. That was fantastic for its price. The next time I ordered the fried rice with chicken. That was absolutely awful. No flavour. It was just rice with boiled chicken. Absolutely bland. Do not order the fried rice with chicken. The green curry and ready curry is decent but Thai on the yonge is no match to the more famous Thai places in Toronto"}
{"text":"I don't know why this place has such high reviews on yelp...I went there on a Saturday night. There was a homeless guy drinking beer and barking like a dog to the waitress. The whole place was just dirty. The portion is small. The service is slow. They even got my order wrong. We were the only people there on a Saturday night. Won't return again."}
{"text":"Very authentic Thai food. Price is on the lower end. I highly recommend seafood noodle, super good.  If you like spicy food, try the glass noodle salad and papaya salad with sticky rice, they are delicious."}
{"text":"Authentic Thai food is here!! The owner is very nice and friendly. They can pretty much make any Thai dishes that is not on the menu for you. Pair with Singha beer to get full Thai experience."}
{"text":"Best authentic Thai food in downtown. Their food reminds me of my Asian root I used to eat lots of Thai food back home. Their Pad Woon Sen is my first choice. It is not as heavy Pad Thai and it is healthier too. The best part is it has black fungus (Wood Ears) in it and it helps lower bad cholesterol and promote blood circulation. I normally go there for their $10 special. It comes with a hot and fresh veggie spring roll and a small bowl of delicious tom-yum soup to increase your appetite. I go there at least once a week. It is really spacious and the staffs there are extremely friendly. Definitely a must-try restaurant if you are a Thai food lover."}
{"text":"I have travelled around the world, and know my food - this place is one of the most AUTHENTIC Thai restaurants I have ever found!  It is by far my favourite in Toronto (much better than the very popular, but more expensive and less authentic Khao San Road, and just as good, but cheaper than, Sukho Thai).  Besides the delightful little setting (huge upstairs space, overlooking Yonge street), and the wonderfully friendly staff, the food is AMAZING and very reasonably priced!  I absolutely love their Pad Thai, Glass Noodle salad, Coconut soup, and Mango sticky rice dessert!  This place is a real gem in downtown Toronto - unpretentious, delicious, and authentic.  HIGHLY recommended."}
{"text":"Attention ladies and gentlemen...Thai on Yonge now DELIVERS! YES! I almost couldn't believe my eyes when I saw their name on justeat but sure enough, it was categorized under 'new' places on justeat. NO delivery fee although the minimum order is $20 which is not so bad. I ordered Red Curry, Pad Kee Mao and Spring Rolls and it came to a little over $23. I was happy.

They delivered within 20 mins (I live super close by so maybe that had something to do with it) but I was ecstatic! Food was fresh and piping hot. Actually had to let the spring rolls..breathe as you would say for them to be cold enough to eat. 

All in all. One of the best thai take out places around. Try it. You won't be disappointed."}
{"text":"Came here after Christmas shopping for this holiday. We arrived at 5pm and it was extremely empty except for four other tables. Don't let that fool you though. My friends and I were all satisfied with the food. Myself, I loved the Thai tea, which I have difficulty finding in Toronto."}
{"text":"Here for a late lunch and place is quiet. Ordered green curry chicken and curry noodles (Islamic). Green curry appeared and tasted water down but not bad. Noodles were the very thin/small type, I like but fiancé not so much. Dish was okay and could use more flavor. Overall, dishes were mediocre and I would return for the lunch special $7.95 (includes soup and spring roll)"}
{"text":"Prices are reasonable. Cheaper than most spots. I got the sticky rice with peanut butter sauce and papaya salad. Both were good. Papaya salad was a little sweet for me. 

Service was super slow. Only one waitress. Order took over 30 minutes to get out. The orders were getting switched up too. I probably came on a bad day. Maybe it's better when there are more folks working."}
{"text":"I had the lunch combo which included sweet and sour soup, spring rolls, and Green curry with rice. It was very tasty at a reasonable price. I think it is one of the best Thai foods in the neighbourhood. Hope to try the coconut soup and the Pad Thai another time."}
{"text":"Given the excellent reviews from other Yelpers, we decided to go to Thai On Yonge for dinner last weekend to see what the fuss was about.

We walked in to find a number of patrons at the bar who had obviously been drinking for quite a while. As we sat at our table, a few of these patrons paced back and forwards between the bar and the window overlooking Yonge Street for some reason, which made for a very awkward dining experience.

My friend and I both ordered Khao Soi and we shared the spring rolls. The rolls were pretty good, but the Khao Soi lacked flavour and the sauce was not hot enough. Definitely not the quality and freshness I expected from a $30 meal for two.

The service was fast and the waitress was very friendly, Overall three stars, not helped by the \"interesting\" clientele."}
{"text":"Excellent food, great service!
A simple place with great food.
We ordered Tom Kai, Thai Fresh rolls, Pad Thai and Panang Kai. Delicious!"}
{"text":"My friend and I went one day for lunch. We were just passing by and it looked really cool. Its on the second floor and a very large space. The lunch special was a great deal of a spring roll, soup, and choices from the noodle and rice dishes. The food is incredible and the lunch prices are amazing. Our server was very helpful and enthusiastic about the food. It was nice to see.

The only thing I would have to say negatively is that the ambiance could use a little work. They have this huge beautiful window looking out onto Yonge St but nothing to dress it. The tables and chairs are perfect for a traditional Thai restaurant but there is hardly any wall art. The lighting wasn't bad, but I feel like if they put a little effort into the atmosphere then they would have a great chance of turning the place into an after work hours hot spot. Because they are on the second floor they need a little more embellishments on the outside of the building or through the windows. 

The food is amazing. This place has a lot of potential."}
{"text":"Been here twice, and both times the food was great. The wait time isn't bad, I think people are exaggerating. I especially like the Street Pad Thai, very scrumptious. Overall this place is great if you are in the area and want some authentic Thai food. I will definitely come back."}
{"text":"Clean, quiet dining located on the top floor. There's also a massage parlor on the same level. How convenient is that. The Kao Soi is not too spicy and if you want to customize your spice level condiments are available. Overall a solid tasty meal."}
{"text":"The dishes are delicious, I had curry fish (extra hot) and the first soup on the menu, those are good. The price was about $20, do not have much traditional tai food, more like those express food style but with nice dining environment. Good for a express, but so good as a dinner restaurant."}
{"text":"Mom and pop restaurant. Polite service.  I would pick this place over salad King anyway. Khao soi is good.  Pad Thai is good. Service is a bit slow.  It's funny because every time I go it's dead. Their food is very flavourful and prices are decent. My go to for cheap Thai food that is non fast food."}
{"text":"Around the College area and wanted to try something new. Although Salad King is literally half a minute walk from Thai on Yonge, this place is another good Thai option.

Friend and I went there late on a weekday around 9pm, so it was super quiet. We were pretty much the only table until some girl came into the restaurant to eat while reading. The atmosphere is authentic. They have all the Thai decor and ornaments near the entrance and bar area. Service was decent too.

I ordered Khao Soi with chicken while my friend got the Street Pad Thai. Hers was not the usual pad thai with ketchup but cooked with a different sauce. My khao soi was quite good indeed. For those who don't know what this dish is, it's like crispy egg noodles in curry sauce. Their soup base was well cooked with the right amount of coconut milk, herbs, and other ingredients. The crispy noodles on top were dipped deliciously into the soup/sauce. Just beware that this dish is a little bit spicy if you can't eat spice. Also, I personally think its on par with Khao San Road's khao soi!"}
{"text":"A Thai place with amazing food and great service. For me it is five stars because: 1. I adore thai food 2. Prices are more than OK!! 3. Staff is supernice 4. Place is quiet and comfortable 5. The Lemongrass Soup was INCREDIBLE!! 

I will come back for sure :)"}
{"text":"Just ok. I had the street padthai. It looks totally different from the picture. Giving it a three star considering the price."}
{"text":"Rather than going to salad king, I decided to come here. You know, try something different.
The restaurant is on the second floor, but it has visible signage and decor so you shouldn't miss it.

My first impression when I stepped in was a large near-empty restaurant with outdated furniture and decor, and worst of all, no AC. It was really humid in here, and I was not being subtle about it. There was even a fruit fly buzzing around when I sat down. Shortly, however, I felt some AC coming our way, so the people managing the place must have heard my verbal complaints and did something about it I guess.

Washrooms are also just as humid, and you can see a handful of fruit flies all over the place.
It is quite disgusting for the most part, but I suppose if you were to take this as an authentic thai experience where you're dining in a restaurant in the middle of a humid tropical environment, then the flies might be normal? Try to be optimistic about it.

There are only two people working outside of the kitchen. They might be the owners, but there's definitely not a lot of staff. We placed our orders, and then waited for 20-25 minutes before the food finally arrived. Another table that was there before us also waited awhile before they received their items.

We had the Golden Chicken Curry along with Street Pad Thai. You can customize how spicy you want it, from 1-chili to 6-chilis. You could probably have more, but I didn't try.

It was a long wait, so automatically I'm expecting the food to be that much better since they're taking that much more time to prepare it. And it was quite tasty. The size of the pad thai is not bad, and came with both shrimp and chicken. The curry also had a lot of flavour, and the texture was not too watery.

Service here is generally very slow. They only have one lady taking orders, serving food, and taking the bill. You'd be better off just walking up to the front where the bar is because the guy is just standing around not doing much when no one's at the bar.

I would recommend just calling in and ordering your food to go, and picking it up half an hour later."}
{"text":"The food was pretty bland I had the street pad Thai service was a bit slow as previous  posters have already mentioned  . The Thai green tea was ok but the shrimp rolls and the pad Thai was nothing to rave  about. 
There was no flavor and adding lots of hot sauce didn't help
With the flavor at all."}
{"text":"Cheap food, lots of space and they have quite a big menu. This place is definitely better value than Salad King. It's located in a convenient area and are opened pretty late. We had the chicken fried rice, pineapple salad and veg soup with tofu and noodles. The veg soup was a little pricy, and the food was a bit oily, but it's a lot better than eating Thai express, and definitely a better option than other restaurants in the area."}
{"text":"Ugh.  I was in Toronto for work and wanted to try something other than my usual spots.  I looked on Yelp at the nearby restaurants, and this one looked great - the reviews were good, and the photos looked awesome.  But after my own experience there, I seriously wondered if I even had the right place!!  The restaurant was nearly empty.  The server was very nice and attentive - but when he brought my food (I got two dishes) they were grey and looked totally unappealing.  The taste was not much better, and in fact I didn't eat much from either of the two dishes and wound up going back to my hotel still vaguely hungry.  Annnnd within a few hours, my stomach was in rough shape and I spent much of the night in the bathroom.  *Not* a good experience at all."}
{"text":"It might just be a personal preference but I don't like their street phad thai. Of all the other dishes I tried, I liked them all. I tried the curries and eggplant. 

Prices are very reasonable. This place delivers great quality at reasonable prices. 

It's located very close to Salad King which is a tough competitor. Salad King is owned by Chinese. Thai On Yonge is owned by Thai. In terms of value, Salad King wins since they have the stamp card system. But if you want a nicer place to sit, it has to be Thai On Yonge. I can't stand the cafeteria setting on Salad King."}
{"text":"Nothing special about it. The food is ok but even if you request spicy it really isn't spicy at all. I would probably rather try another place than go back. Service was good though."}
{"text":"Loved the Lemongrass Soup. Asked for extra spicy and man... did they deliver! It was piping hot and had a good portion of shrimp in there - which a lot of places cheap out on. Went at 3:30 and it was really quiet with one waitress."}
{"text":"Very flavourful and very affordable, pretty much as good as it gets for a Thai place. Portions are large and there is a liberal use of spices. Service is a little sterile but nothing out of the ordinary for a Thai restaurant.  Have to recommend the green curry chicken and pad si ew. Their spring rolls are also really good."}
{"text":"Picked up a lunch special #9 from ToY to go. 

See the picture of Tofu Fried rice. It was dry and lacked any flavour. 

Most disappointing thing was the quality of rice. If you see the rice in the picture none of the grains were full grain. Most if not all were broken rice pieces - probably the cheapest kind. 

Totally sympathetic to the situation that costs of produce and things have gone up, but this in addition to lack of flavour. 

Not sure if I am coming back"}
{"text":"Great food awesome shrimp spring rolls, the food and the soups were great. Definitely recommend it, their location is on the second floor keep an eye out for it"}
{"text":"Whenever I am in Toronto visiting friends, I always end up at Salad King, since it's such a fast, convenient, and tasty option. But, in Toronto recently for the St. Patrick's Day Parade, I decided to try a new Thai place. Thai on Yonge was passable, but I think I'll be sticking with Salad King or trying a different place next time. 

The restaurant is on the second floor, and we walked right by it at one point (we needed to look up to see the sign!). Once inside we waited a moment to be greeted by the only waitress, an older woman who did not smile once during our dinner. She seated us quickly and came back for our entire order in about five minutes. It was a Sunday night so the restaurant was not crowded, but service was spotty since the waitress was the only one working the floor. And, instead of using a tray to carry meals and drinks, she used a little cart which slowed down proceedings. A couple near us constantly tried to get her attention by just standing up and staring at her. 

The food was adequate. The portions were small and the flavor was just okay. I ordered the green curry with chicken, which is my go-to meal at Thai places. It was not spicy at all, and the veggies were minimal. My brother ordered the Ginger Chicken. I tried a bite of his and while tasty, it still didn't pack enough flavor for a good Thai dish. 

Overall, a quick meal but not amazing, with weird service. I'll probably not be back in the future."}
{"text":"A quiet environment with good food. This place is definitely worth the visit. The portions are smaller if you compare to salad king which is just a few steps away. But still not bad. 

Check it out if you want to avoid crowd and enjoy a nice quiet meal"}
{"text":"The Thai Street Pad Thai for $10 was decent.  It comes with chicken, shrimp and tofu.  The noodles were done well, but the dish could use more flavor.  The shrimp could also use a little more stove top time since it was cold in the middle.  Putting a little bit of the chili sauce on it does make it taste better.  There was plenty of seating in this restaurant and they were not that busy during weekday lunch time.  I'm giving it 4 stars since I would come back here for lunch.

-Located upstairs above a massage place.
-They take credit card - MC or Visa."}
{"text":"When I am in this area, I'm usually eating at either Kaiju or Banh Mi Boys, but since I was with a rather picky friend this specific day who wanted soup, we came here.

It was about 2:30pm on a Sunday afternoon, the place was basically empty except for one other table. This worked in our favour though, as we were given the chance to sit anywhere. They suggested the window table for the four of us. You see, Thai On Yonge is located one floor above ground level, so a window seat along Yonge Street is pretty cool. Imagine my surprise when those weren't the tables they had in mind for us, there's one more table, tucked in the corner, with two sets of windows, one facing Yonge Street and the other facing Walton Street. Nothing much goes on on Walton Street, but if you enjoy your people-watching while you enjoy your meal (like me), then this is the table to you want. 

They were still offering their lunch special at 2:30pm, so we each ordered one. The lunch special comes with a soup, a spring roll and a main dish, all for $7.99, pretty good deal, right? One of the people at the table was a vegetarian and we wanted to ensure that while he may have ordered a vegetarian main dish, that his soup would also be vegetarian, but our server didn't seem to comprehend English very well, she got very defensive immediately, telling us there is only one soup available for the lunch special and you can't change anything for the special. Ordering became extremely stressful as it was almost like an argument. Were we hangry? Possibly, but I don't think that was an unreasonable request. 

The vegetarian meal did come with a vegetarian soup, but food wasn't anything spectacular, it was pretty standard, yet you can't really argue with how much this meal cost. I don't believe it would get a return visit out of me though."}
{"text":"I don't know about authenticity, Im Asian but not Thai, and I found Salad king tastes better and cheaper, cuz for the same price the portion size here is about 2/3  or 1/2 of what salad king offers. Decor is a bit shaky. The stir fried glass noodle tasted good, but Pad thai was awful, and for both, the shrimps inside was so bad........ waitress/owner was really impatient....  they have 10% student discount tho."}
{"text":"We live nearby and I've had take out from here once but we recently decided to really sit down and try Thai On Yonge.

The decor of his restaurant isn't very fancy and you'll need to go up some stairs but it feels a lot like Thailand which makes it nice.

We ordered the mango salad, lemon grass soup, tamarind beef, and pad kee mao. Woah! Everything was extremely flavourful! The lemon grass soup, salad, and beef definitely packed a punch. Sometimes it was overwhelming but everything was really good. The ingredients were fresh and well balanced in all of them. You can see how colourful everything is in the picture. The mango was ripe and the beef was crispy. The noodles were tasty too- a little oily. The food was very authentically Thai (coming from someone part Thai) and the people working there are Thai. If you go here then I'd recommend trying things on their menu other than pad Thai! 

Pleasantly surprised- we'll be sure to come again when we have a craving for Thai food!We also noticed on our way out that they have boat noodles which we'll definitely be back for :)."}
{"text":"Needed something fast, cheap and close by. We ordered the street pad thai (which I found very bland) and the green chicken curry lunch special (tasted fine, but pricey for what you got) . 

Will likely try a different place the next time are in the area and crave Thai food."}
{"text":"I chose to go here around the Christmas season to avoid the line at Salad King (since the last time i went there, their pad thai was sloppy and mushy). We were greeted and since not many tables were taken, we sat by the window to people watch. The server and cook were definitely thai.

We got a pitcher of Sapporo to start and ordered pad thai and green curry. Both had good spice, and an authentic thai taste of specific spices (ie. no ketchup lol) I asked for medium spice on the green curry and it came out nice and hot. My friend said he really enjoyed the pad thai and it was one of the better ones he's had. Definitely no Khao San Rd but it was pretty good for dt thai. 

The portions were huge and full of ingredients, we couldn't finish the curry and rice. 

All in all I would go back when I'm downtown and craving some coconut milk and fish sauce :)"}
{"text":"The place didn't strike me as wanting to traipse up the stairs and check it out, I mean I've had pretty bad Thai food experiences in Northern America... but I was tired and hungry and I wanted something spicy. This small place seemed like one I might be able to ask for spicy. I ordered the northern version papaya salad and I ask for extra spicy. the Thai lady ask me how many chillies I want. She suggested 5, I said 7, she said 'you sure' I said 'ok 5'  well she was right 5 we're making my nose run, my lips burn, my brow sweat and they were making me very very happy! 
I also had boat noodle soup which similarly transported me straight back to Bangkok, and that is not easy. I don't think any Thai restaurant in the western world had quite achieved that. Until now!"}
{"text":"Came here for lunch and I ordered the beef Pad Woon Sen (stir fry glass noodle). The lunch combo came with lemongrass soup and fried spring roll. Everything was yummy. I came here a few times now and they've been very consistent with their food unlike Salad King. Even their service was fantastic!"}
{"text":"My first time coming here. It always seemed kind of sketchy walking by their hand written sign on Yonge St, but a co-worker had recommended this spot. The restaurant is located upstairs, on top of the souvenir store and moneymart.

We ordered off their lunch special menu - $7.95 for a main dish, a springroll and soup. I had noodles the previous day, so I ordered a rice dish with spicy beef. It was really tasty. I didn't have to add any hot sauce to favour it. I'm normally not a white rice fan, so I would order fried rice or something else next time.

I didn't expect to like this place, I would definitely try it again."}
{"text":"I came here for the first time. The place is nice organized many different kind of food. We ordered the lunch special which I would not suggest ad it is mainly rise and vegetables with some meat. The server was somehow unique it was this old lady who kept stating we are real Thai food all other places around us are not they are owned by Chinese guys and stuff. She seem to have law temper and my friend found it very rude. They offered free soup and spring roll which was very nice and good taste."}
{"text":"Authentic, tasty, Great price! Specially lunch combo!! Service is nice and food came out around 10 minutes at 2pm. I recommend this place."}
{"text":"Being just down the street from Salad King (being known for big portions of edible faux-Thai food and not much else) and being close to Ryerson, we weren't sure what to expect from Thai on Yonge.  But it's now my go-to for Thai food in the area (not much competition, but still...).

The prices are about the same as Salad King and the portions are smaller - but the everything we've had actually TASTES LIKE THAI FOOD.

It replaced a crappy Chinese restaurant which probably replaced a crappy diner (which had a long bar for some reason), so the decor sucks.  And it's definitely not a trendy spot like Salad King -- but the food is good and you don't have to rub elbows with strangers in the cafeteria-esque dining room at Salad King.

But ya, excellent flavouring on everything we've had.  Brought a miserly friend here who is all about food portion over price and even he felt Thai on Yonge was a better bang for the dollar."}
{"text":"Good food, great price, friendly service. Better than Salad King and more authentic. Lunch specials are great value."}
{"text":"Very good Thai food at prices about $1-2 cheaper than most Thai restaurants.  While nothing was amazing the food was well cooked and well presented.  The service was also friendly and helpful.  The one drawback to this place is that it smells - not of cooking but of stale pipe / old building odor.  Most likely the fault of the landlord, not the restaurant, but it does remove some of the enjoyment from eating."}
{"text":"I was really surprised at how great this place was! So excited I found it and will definitely be coming back to try more options. This is located nearby Ryerson. This location does not have the fanciest decor, but it is still very clean and so good! 

Pros:
- Price: The prices here are so good! For a location that is Downtown, I am fairly surprised! You can eat for 2 people for about $25-$35 (depending how much you order). 
- Authenticity: I love how authentic this place feels! It reminds me of some restaurants in Phuket. 
- Food: The quality of food is superb! Everything was made fresh. The shrimp in lemongrass were really good and big, also the soup wasn't to spicy! The thai iced tea was so tasty. The tea taste was distinct and the drink was very creamy!

Cons:
- Parking: Since this located is located in the core of Downtown Toronto, I am not surprised there is no parking. You may have to use public transit or GreenP. 

Foods I recommend: 
- Lemongrass Soup (Shrimp) 
- Green Mango Salad
- Thai Iced Tea
- Curry Beef 

Overall, I can't wait to come back again and try more items!"}
{"text":"+.5 for service

In a downtown core where giants like Pai, Khao San Road, and Sukho Thai thrive, as well as popular student establishments like Salad King, there's...this place that's relatively unknown along Yonge Street. In fact, it's so hidden that it's only accessible via a set of stairs that's very unassuming (the stairs claim it leads to a massage parlour; it doesn't until the third floor!).

Thai On Yonge is an excellent restaurant for someone who wants down to earth Thai food, without the drawn out hype (it never got crowded when I was here). The costs are also substantially lower, and personally I feel the place is better quality than Salad King next door. 

The seating arrangement is a little awkward (lots of weirdly designed booths), but I wasn't bothered too much. You seat yourself, although informing an employee of your arrival would help in getting better service.

I ordered the chicken padthai lunch special, which came with one spring roll and a soup of the day, which turned out to be hot and sour soup. Both the soup and spring roll were quite good, definitely excellent quality for the price I paid ($9 including taxes with the pad thai). The pad thai came after; this restaurant separates the bean sprouts and peanuts, so if you don't like either addition, well, they did the job for you!

Again, for $9 including tax, this is probably one of the best pad thais you can get in the city for under $10. The sauce was done right, the noodles were chewy but not undercooked, and the presentation was nicely done as well. The food came quick enough that I was in and out in about 40 minutes; not bad at all!

Service was excellent once you're seated. The employees are legit Thai people, so you know you're getting the authenticity of Thai food here without breaking your bank.

Definitely will return!"}
{"text":"Golden Curry was amazing. One of the best curry i ever ate.

However everything else especially the pad thai was the worst dish i ever ate. It was so bad i couldn't give the place a two star, which is unfortunate because the golden curry was pretty good. We got other food too but it was also really bad. i don't remember what we got because it was about a year ago. I just remembered and came back to write a review because I was really unhappy I paid a relatively high cost for such low tier food. Dont fall for places just because they have a lot of stars. This is the first time i was deceived by yelp. Very disappointed."}
{"text":"Best Golden Chicken Curry I've ever had!!! 

(Was gonna just eat half bowl since it's kinda late at night....end up ate the whole thing... tooooo goood lol)"}
{"text":"3.5

Pros:
Well made dishes
Friendly service

Cons:
Long wait for food
Portions could be better

I had the day off so I went downtown to take my GF for lunch.  We were feeling Thai and noticed this place on the way thinking about Salad King.  I'm almost certain this place used to be a Chinese restaurant but I'm not absolutely certain.  Walking up the steps, there are quite a bit more seats than I thought there would be.  There are plenty of seats.

We're greeted by the staff and he's very pleasant and nice throughout our stay there.  We're seated immediately and given the menus.  There's quite a bit to choose from.  There's also a lunch special menu with about 7-8 entrees for $7.95.  Everything on the lunch special comes with a soup and spring roll.  My GF ordered the green curry from the lunch menu and I got the Pad Kee Mong from the regular menu.

The free soup and spring roll come out pretty quickly.  My GF had the soup and we split the spring roll.  She says the soup is pretty good.  The spring roll was nice and crispy. It takes about 25 minutes for my dish to come out and then another 10 minutes more for my GF's curry to come.  If you're here casually, it's no biggie, but when you're on a lunch hour, it's very ideal.  By the time my GF got her curry, she had 10 minutes to eat before she had to rush back to work.  We were a bit unlucky because we got there just after 3 other tables had sat down.  This probably contributed more to the wait time than anything.

The dishes themselves were very good though.  Previous reviews all rave about the authenticity.  I have no idea what real authentic Thai tastes like, but these dishes were definitely very good and had a unique flavour.  I was very impressed.  I wished the portions could of been better.  My GF is not the biggest eater so when she wanted bigger portions, you know they could of been better.

All in all, a very good Thai place to try.  I would definitely recommend this place if you got plenty of time to spare.  Going during lunch hour can be risky as if they're busy, you might spend most of your lunch hour just waiting.  The service was spectacular as well."}
{"text":"Try the coconut soup! it's awesome!"}
{"text":"Food was oily but tasty, although a bit too heavy for my liking. Service is altogether another story. I get it that they are a family run restaurant and I wasn't expecting McDonald's speed. However we sat down for a full 15min before waitress came around, because she was busy chatting! Not serving!!! The whole restaurant had 10 customers total! 

After we finally ordered we wanted to add a drink. Had no luck flying down the waitress again (I swear she just pretended not to see us), we walked up to the counter and she actually got annoyed at us. This level of customer appreciation is appalling. Out of principle I will not be coming back."}
{"text":"Really good food, I had the the lemongrass soup, really tasty , the veg and overall food was fresh."}
{"text":"Omg most amazing Thai food I've had in a looong time! Everything we had was delicious. The skewers were juicy and the peanut sauce provided was amazing. We also had the papaya salad with 2 peppers and even then it was very spicy (our mouths were on fire lol). The green curry was soo good, and can't be beat for the price. Same thing goes for the street pad Thai, it was just so tasty. It was so good we returned for a meal the next evening lol. Bonus points for very authentic mango sticky rice! Delicious, cheap, and located downtown. Definitely a 5-star place!"}
{"text":"We decided to check this place out before I went to work since it was 5 min from our apartment. Also I saw it had decent reviews from Yelp so why not. It's upstairs and has a decent amount of room. This was 6pm on a Friday evening and no oher customers. The decor is dated but looks Thai-ish. FYI I am no expert in interior design so I could be totally wrong! There were the gods statues, mostly the colours red and gold. We sat near the window to see Yonge St.  

We ordered Islamic curry noodles and Chicken Pineapple Red Curry. We LOVE Islamic noodles at Salad King so we wanted to see how this restaurant would hold up. Unfortunately, this restaurant's version of Islamic noodles was eh at best. It tasted like Chinese curry noodles. Nothing special about these noodles. However, the Chicken pineapple red curry was delicious! Deep coconut and red curry flavours. The chicken was also cooked juicy and the pineapple added a nice sweet citrusy punch to the curry with rice. 

Looks like the dishes here are a hit or a miss. I think I'll try the pad Thai the next time. The service also was lacking. We were the only customers in the entire restaurant and we had to actually get up ourselves to go to the bar and get a server to take our order. The food came fast though."}
{"text":"The only waiter/waitress I've ever seen here is an older asian women. she is so rude, very slow, and sassy. Sometimes she disappears in the back for 25 minutes at a time. I have had to stand up and look for her to get her attention and she has even told me \"no I'm busy\", the few other customers were as appalled as i was. Don't recommend."}
{"text":"Definitely try the Khao Soi and Street Pad Thai! One of the best I've had! The service could have been better though."}
{"text":"Their Pad See Ew is delicious. More authentic and way better service than Salad King down the street.  Prices are very reasonable. Will definitely be back!"}
{"text":"I have ordered a Pineapple Chicken Curry, because red curry is my favourite dish in Thai cuisine, and that is why I would order the same thing whenever I go to a Thai restaurant.
The dish has one pepper sign on the menu, but when I ate it myself, it tasted pretty mild... I was expecting at least a little bit burning on my lips."}
{"text":"Found another little gem downtown! Had the Golden Chicken Curry, and the Pineapple Fried Rice. Both tasted great, and the service was fantastic. My only issue was the potato in the curry was a little undercooked but overall still delicious. The menu items were also very well-priced. Definitely coming back soon!"}
{"text":"Dropped by Thai on Yonge as per my friend's recommendation and I was not disappointed. I've visited this place when it was a Chinese restaurant and was surprised that Thai on Yonge kept the same decor (added some Thai touches).

The owners are from Thailand which definitely made me more confident with the food and boy was I not disappointed! I ordered the chicken, shrimp & tofu pad thai and it tasted very similar to what I had in Koh Samui and Bangkok. The dish was a little heavier on the fish sauce but delicious nonetheless.

Don't be deterred by the design of the place. It's a hidden gem with their lower prices and tastier food!"}
{"text":"I love this place for its authenticity and unpretentiousness. Their Khao Soi is out of this world. IMHO, even better than Salad King's Khao Soi. Every time I'm in the area and happen to crave authentic Thai food, I go to Thai On Yonge. There are too many inauthentic Thai restaurants in Toronto. This place is a little gem in the heart of Toronto. It's usually empty, which results in fast service, but don't let the absence of patrons fool you. Their food tastes great. I recommend their Street Pad Thai. It's well worth every dollar.

In terms of prices, everything on their menu is reasonably priced. Your bill won't break the bank, while the food will leave your tummy happy :)"}
{"text":"Food was pretty good, I had the pad thai. Tasted very authentic and price was right, especially if you're a student. Not very fond of the service. Would only come back for the price and the convenience."}
{"text":"My fiancé and I went to try out Thai On Yonge. It's on the second floor so most people would probably dismiss it due to it's location. It used to be a Chinese dim sum restaurant.

The owners are definitely Thai and very friendly, which was a great sign that they serve authentic Thai food.

My fiancé and I ordered their street pad Thai (made with tamarind sauce and not ketchup!), and spicy beef salad. My street pad Thai came with a choice of coconut soup or hot and sour soup with spring rolls. I opted for the coconut soup and it was one of the best coconut soups I've had. The soup had a nice tang of lime, some slices of chicken breast and a couple mushrooms. The spring roll on the other hand was mediocre. The pad Thai was very good but I wished it was spicier, or else it would've been awesome. We realized after that there's spice levels on the menu, next time we'll tell them, but they ought to ask you when you're ordering. 

My fiancé's spicy beef salad was quite tasty and fresh. He loved his plate of salad tho he missed the heat as well.

Overall, the decor of the place definitely needs an upgrade, but the service and food were very good so I can dismiss the decor. We will be back for sure!"}
{"text":"Tried the lunch special $8.85, $10 even after tax. Ordered takeout, took 20 minutes to prepare. Service was friendly, just too slow. Food decent sized for the price, considering you received a soup and 2 mini spring rolls, with your main. The problem was the flavor was just not there. I ordered a spicy noodle, and there was zero spice, I actually had to salt it!? Ingredients did seem fresh though. Probably will not go back."}
{"text":"Lost my online order - I showed up on time to pick it up (I had pre-paid online) and they didn't even realize they had received an online order and so only started cooking it then. In the time I waited, four seated parties complained that they had been waiting 40+ minutes to be served their food. Aside from that, food was good."}
{"text":"The taste is very good. But the service is too slooooow. If you are not hurry for the next stop and wanna try some Thailand foods, please come here."}
{"text":"I would rate this higher if the service was good. The food is always nice, but the middle-aged waitress gave us a very bad experience. She always ignore us when we raised our hands and took the wrong orders. She also placed the dishes on the table loudly. Very poor service!"}
{"text":"Having a major thai craving, we came here since it was right near our hotel.
On a Monday night there was only one other party there, sort of strange for downtown, but we continued to sit down.

Our server was very sterile, and kind of grumpy.  No small talk, no smiles, no friendly banter.   She was cold..  Thus only 4 stars.

Good thing the food was amazing, because she would have ruined the entire experience with her attitude.   We ordered spring rolls, green curry, and pad si ew.    All the food was amazing!   The flavours were perfect, and the spice level was perfect."}
