{"text":"I ordered cashew nut chicken and pineapple fried rice. Cashew nut chicken was very well done, they were very generous on cashew which was good. Not many restaurant these days do that. Pineapple fried rice was also well done. I ordered cashew nut chicken thinking I would need a dish to go with my fried rice, but pineapple fried rice was saucy and had enough vegetables, shrimps, chicken and pineapples to have it by itself."}
{"text":"I ordered their Devil Fish tonight for takeout and I'm really impressed! The perfect balance of sweet and spicy. I did ask for the dish \"a little bit less spicey than normal\", so be warned. It definitely had a kick, but nothing too crazy. The fish had a nice light crispy batter, and the veggies were very fresh. Great portion size. I'm excited to try some of the other dishes. Give it a try Roncey! -- Update 1: I've been twice more and this place keeps impressing me! Second round of takeout was for lunch for 5 people this past weekend. I was happy to find on their takeout menu that they have really reasonable lunch specials which are also available on the weekend. We got a chicken pad thai, which was really good. It had a bit of a curry flavor to it, which makes me want to try their curry pad thai. I still prefer a khao san road / sukhai thai pad thai, but this was a pretty close second. A mixed market vegetable dish which was good, but i wouldn't recommend it unless you love tofu. And an amazing Coconut Mango Chicken dish. A must try! Around $35 including tax and the 5 of us couldn't finish it all.  I just went again for my 3rd visit. The daily special was Malay Curry Beef with Roti. Wow!! Absolutely amazing! Delicious thinly sliced well marinated beef, eggplant, potato and that curry sauce, sooooo goood! I could have done without the tomatoes, but they did kind of work in the dish, so i can't fault them for it. The roti was amazing, and reminded me more of a chapati. I don't I had anything that delicious when I visited Kuala Lumpur.  Rating holds. 5 stars!"}
{"text":"Waited over an hour for delivery through Uber eats. Had high hopes but food fell flat. We are huge pad Thai lovers and have tried it all over the city and throughout Thailand. This pad Thai was very sub par. Dry noodles and artificial taste. Definitely no tamarind flavour and I could swear I could taste that undesirable ketchup taste :(   Mango salad, fried rice and spring rolls were good. Pad Thai is simple and should be fool proof with good high quality ingredients, but they missed  the mark on it here unfortunately."}
{"text":"So much food! You will satisfy with the taste and volume. I don't live in the area but I always visit the restaurant when I'm around. Fast service too."}
{"text":"We dined here and it took too long for our food to come, about 40 minutes, which you wouldn't expect from a casual Thai place. The restaurant wasn't busy at all and only had about 3 tables at the time.   When our food came, it was cold. We sent it back to be heated up but when they brought it out again it was still cold, and didn't taste very fresh. Overall the quality was poor.  We were disappointed because we came one time before for take out and the food was tasty and fresh. However it still took 40 minutes for our take out to be ready which is way too long.   We won't be returning here. Consistency in food and service quality is very important."}
{"text":"I have no idea why anyone would give this place a high rating - but those high ratings ruined my Mother's Day dinner! For delivery, we ordered crispy tofu with peanut sauce, chicken satay (peanut sauce), avocado chicken, a beef and chili salad, sticky rice, and a spicy chicken dish I forget the name of.   The peanut sauce was water and sugar, with a tiny amount of peanut butter in it. Sure, water and sugar are cheaper than peanut butter -- but really? It was horrible. The fried tofu was not the beautiful puffy crispy tofu you get from other places, but skinny triangles coated with bread crumbs and burned in oil. It went in the garbage, along with the peanut sauce. Next, the description of the beef and chili salad said it was thin slices of beef with mint, cilantro, and chili. Nope. It was nearly raw, inedible beef, in a soupy cabbage, red pepper, scallion, cucumber, and tomato base. I am allergic to tomatoes. I hadn't said that, which is my fault - but tomatoes were not listed in the ingredients, and hardly any of the things that were listed were actually IN the \"salad.\"  To the garbage bin with that, too. I was left with only chicken satay. It was okay -- until I bit into a piece of chicken still raw in the center.   This place is not only awful - it's a health hazard. Never again!!"}
{"text":"This place is two seconds from my house so I eat here a lot. Always solid food, portions and service. Takeout portions are slightly bigger but you always get steamed rice with most dishes when you dine in. My favourites are too many to list. There literally isn't anything on the menu that's not delicious. Hope they stick around for a long time in the neighbourhood."}
{"text":"Food is fantastic.  Staff is top notch.  I'm super into curry pad thai dishes so when I find a good one I always go back for more.  This place knows me well because of that.  I've ordered other things as well without disappointment... veggie coconut curries, salads, tofu dishes... all were delicious.  All with a homestyle feeling... in the sense that everything looks, feels, and tastes like it's prepped with care.    Highly recommend without a doubt."}
{"text":"This place is amazing! I've eaten here many times and loved every meal. The service was very friendly, helpful and responsive. I've eaten many of the dishes here and they've yet to let me down. It's been a real gem of a find and I would recommend it to anyone."}
{"text":"I can't comment on the restaurant as I ordered delivery from here last night. The portions were large and the food, for the most part, was very good.   We had:  Mango chicken - 4/5  Pad thai - 4/5  sweet and sour beef - 2/5  Green curry with chicken  - 4/5  spring rolls 3/5  coconut rice - 1/5 way too sweet for me!  The price is slightly higher than other thai delivery I've had. Our order came to $77 with the $3 delivery charge, but I feel it was worth it as the food was definitely better quality than most. The chicken was thick pieces of white meat in all the dishes but the pad thai, where it was shredded.    One slight annoyance was that they offer a free pad thai for orders over $50 and when I tried to redeem the coupon I was told on the phone that the minimum order had changed to $60 but the coupon was still for $50 on the menu they sent with the order...  I would definitely order from here again!"}
{"text":"Don't go to any other Thai place in the Roncesvalles/High Park area, go to this one. My bf and I eat here 1-2 times a week and it's very consistent, always fresh, amazing flavors. We always get an order of vegetable coconut soup with our entrees along with roti and/or coconut rice. Every curry they serve is fantastic ESPECIALLY Malay. I can't even explain the party in my mouth when I dip roti into the curry sauce and eat it. The prices are good and so are the portion sizes. They also have good alcohol prices, so this place is a win all around. It beats that yuppy Thai place downtown ANY DAY ALL DAY."}
{"text":"It's a nice little spot , looks beautiful inside. Lunch special $11.99 was great. You pick any dish (beef, chicken ) , noodles or rice, soup or mango salad, and spring rolls.   The food was very tasty, coconut soup was excellent.  Pad Thai was very good. Tons of chicken pieces. I almost wish it was less chicken and more noodles.    However, after a few bites, I realized why it was so tasty. Salt. Everything was too salty. So that's why -1 star.   Our table could tell it wasn't authentic Thai and Malaysian but the meal was good nonetheless.    Yes I would come back again, maybe would ask if they would use less salt."}
{"text":"Ordered delivery using Foodora so can't speak about their in-restaurant service. Had the oodles of noodles with seafood, beef samosas and thai spring rolls, and everything was delicious and fresh. The wait for the food wasn't long at all, and everything was still hot. Will definitely order again and recommend to others - your tastebuds will thank you!"}
{"text":"I recently visited Toronto and looking for a nice restaurant to take out. It was late night. I found out this place in yelp. Ordered Malay shrimp gravy and red curry. Malay curry was delicious and not too spicy. It was on point. I would definitely recommend this one from the menu."}
{"text":"We have been here about three times in the past one week. It is that good!   Every dish that we have tried here has been amazing. The mango salad, soups, malay curries, coconut sticky rice with mango are all absolutely delicious!! Must visit!"}
{"text":"Mediocrity through delivery.  Spring rolls were the highlight of the meal, which is not what one should hope for when it's the cheapest thing on the menu. For mains we ordered chicken pad thai and a chicken & seafood rice noodle dish. Pad thai was bland and the rice noodle dish was a random combination of flavours and ingredients with no real direction.   I will admit the portions were large as the takeout containers were pretty stuffed, but ultimately the food was too generic for me to likely put them on my re-order list too soon."}
{"text":"For comparison sake, we ordered the standards: pad thai, red curry chicken, mango salad and a vegetable curry. It was all pretty tasty and Iiked that I could identify ginger, fish sauce etc when eating it. We ordered delivery and it came pretty quickly. The portion sizes were good. I haven't been inside but I am very happy to see that the TV isn't always on as it has been with the last few places, which had always discouraged me from going in. The three stars is for pretty good, but I don't believe it's particularly different from the other three thai restaurants in the neighbourhood. I would definitely try again, this time in the restaurant."}
{"text":"Got delivery, so not sure about service/restaurant atmosphere. Ordered online through their website, delivery was prompt; food was delivered nice and hot. We ordered roti, mango chicken, curry pad Thai and brown rice with peanut sauce. All dishes were delicious - flavourful and fresh. Prices are a bit higher than other Thai restaurants but portions are generous. If ordering dinner, will definitely have enough for leftovers for next day's lunch. We will be ordering again and would recommend."}
{"text":"My food was not terrible at all, but just ok. We got a Thai fried tofu dish that was marked with two peppers (indicating it was pretty spicy) and I asked for full spiciness but what we got was overly salty and otherwise pretty bland; not spicy a bit. We've gotten take out several times and it's generally like that - not bad, but not really something I'd go out of my way for, to be honest, especially when the prices are all a buck or two higher than I feel like they should be."}
{"text":"Great place to have lunch or dinner . What's not to like at the wonderful lunch special $11.99. Choose a veg/chicken/beef entree with mango salad/soup with a spring roll. The daily lunch deal until 4:00pm!!"}
{"text":"Came here with 5 other friends for a Civic Holiday dinner at 7pm.  Restaurant was about 30% full.  Staff was friendly and food started coming out around 15 mins after ordering.  I got the coconut mango chicken ($13.99) which was good.  Sauce was a bit too strong; the rice helped in diluting it.  The mangos tasted alright but wish they were more soft.  Was able to try my friends dishes and they were good too.  All dishes were full of colour and portions were decent size. Best dish I sampled was the Oodles of noodles."}
{"text":"Waited forever for delivery. An hour late. Restaurant didn't seem to care. Lousy food. Stay away."}
{"text":"They got my phone number wrong, so they couldn't call me to say the food had arrived. Instead of knocking on the door; the driver just left - made zero attempt to deliver. After waiting an hour, I called them. They took no responsibility; did not offer to do anything to make it right, and then they sent the driver back with literally cold food (presumably from being left in a car in winter?) that they did not even bother to reheat. Complete crap."}
{"text":"I'm currently home with a bad cold, but Thai Home's food has made me feel so much better!   I ordered through Foodora so I can't comment on the in-restaurant service, but everything about my meal was fantastic.   I was starving, so I ordered the coconut soup, vegetable pad thai and a side of coconut rice. Everything was still nice and warm, very flavourful and the portions are VERY generous! I've had enough for lunch, dinner and I still have some leftover for a light lunch and dinner tomorrow.   Overall, I would highly recommend Thai Home for some delicious thai food if you're feeling under the weather (or not) and looking for great value for your money."}
{"text":"I ordered delivery after seeing the great reviews. However. Mediocre food and the peanut chicken is flavourless. Big portions though."}
{"text":"Solid food, great service, clean and open late. As far as I'm concerned, this place was a real find. After a double shift, my friend and I wanted to grab something on the way home. We figured we would try it and I'm really glad we did: this could easily become our Go To for Thai in this neighbourhood. The service was good, even though we were just getting take out. She even gave us a promotional discount, which was kind. The restroom was clean and modern (I like the latter but insist in the former). The whole place smelled like fresh cooking, and it was nice that the quiet wasn't interrupted by TV.  As we waited for food, I couldn't help but notice a steady stream of takeout leaving the kitchen. That's impressive, considering it was after 10pm on a Tuesday.  We waited less than 10 minutes,  and it was still hot when we got it home. Despite the 10 minute drive, the shrimp were perfectly cooked. I got the curry Pad Thai and it was the first version I've had in ages that had a great curry aroma to it. And the portion was huge! I would definitely recommend this dish to anyone.  Next time, I'm going to try the beef with roti. You should, too!"}
{"text":"Full disclosure: I have never stepped foot in Thai Home. Rather, I had them send Thai to my home through JustEat like a champ.   There were three of us, including one veggie, so we decided to go all vegetarian so we could sharesies. We had a pad Thai, green curry, Malay curry, and spring rolls. They were all fabulous, and this place isn't stingy with the spice or the portion sizes. A lovely lunch bonus."}
{"text":"Malay Chicken curry is absolutely delicious! I'm actually sort of blown away it's so good. 10/10 would eat again.   Wish I'd found this place sooner. The shrimp red pineapple curry was also on point.  Fantastic! Both dishes came with rice which was a nice plus.  Also the service was super quick and they're open late!   Awesome job, y'all!"}
