{"text":"Hm  überleg schon interessant. War letzte Woche Donnerstag hier mit einem Kollegen spontan eingekehrt. Was soll ich sagen sicher ist es nicht 100%ig wie in Thailand  aber doch sehr angenehm ähnlich. Sushi habe ich keines probiert aber die Thai Gerichte waren lecker. Die Bedienung sehr Nett und zuvorkommend. Wir gehen bestimmt nochmal hin. Ach ja das Lokal war fast ausgebucht und keiner der Gäste musste lange warten im Gegenteil da bin ich andere Dinge gewohnt."}
{"text":"Das Thai- und Sushi Restaurant ist wohl eines der besten in Stade. Alle Speisen werden immer frisch zubereitet und obwohl ich oft dort esse, habe ich noch nichts bekommen, was nicht geschmeckt hätte. Bin seit einiger Zeit ein richtiger Sushi Fan geworden, denn hier schmeckt er hervorragend, weil der Fisch immer frisch ist. Auch die Bedienung ist stets nett und immer um einen bemüht. Nicht umsonst kommen auch öfter zahlreiche Gäste von großen Firmen wie der Dow hierher, denn auch das Preis-/Leistungsverhältnis stimmt."}
{"text":"Es war unser 5. Besuch in diesem Restaurant und wir waren wieder begeistert. Das Essen ist sehr lecker, heiß und sehr frisch. Die Bedienung ist freundlich, auf Sonderwünsche wird eingegangen. Auch kurz vor Schluss ist noch alles möglich. Vom Sushi bin ich begeistert, ich würde allerdings Einmalstäbchen vorziehen. Die Menüs sind besonders zu empfehlen. Auch Besucher sind begeistert, wenn sie asiatisch mögen."}
{"text":"Very nice ambience and the Thai was super! The duck in green curry melted in your mouth with the best spice taste. Need to try the sushi next time!"}
{"text":"Wir sind heute durch Zufall bei einem Sonntagsausflug im Restaurant gelandet. Ich kann mich leider nur meiner Vorrednerin am heutigen Tag anschließen. Wartezeit bei nicht (!) gefülltem Lokal sehr (zu) lange  Begründung es wird alles frisch zubereitet, davon gehe ich a) aus und zudem b) zählt die asiatische Küche meiner Erfahrung zu den schnelleren Vorspeise geschmacklich sehr gut, Hauptgang von mir auch. Die Kokos/Hühnersuppe hat meiner Freundin nicht geschmeckt (zu fett, sehr viel Kokosmiclh) hat und wurde deswegen fast vollständig zurück gegeben. Garniert war die Suppe mit einem verwelcktem, braunem nicht sehr ansehnlichem Koriander als wir darauf hingewiesen haben wir folgende Antwort bekommen:  woher soll ich am Sonntag frische Kräuter bekommen? - kommt aus Thailand, ist am Freitag geliefert worden-passiert schnell mal so eine braune Stelle - es stimmt nicht, dass die Kräuter verwelckt sind - die Suppe ist sehr beliebt bei Stammgästen - wäre das erste mal in 15 Jahren, dass die Suppe nicht schmeckt - wurde noch NIE bemängelt - ist eben Geschmackssache, man mag es oder hasst es - hier kommen viele Chefs der anssäsigen großen Firmen und denen schmeckt es allen z.B. Dow - besteht deswegen bei uns nur aus Kokosmilch, weil andere Restaurants die Suppe mit Wasser aus Preisgründen verdünnen Mit einem tut mir leid, dass es nicht geschmeckt hat, kann ich Ihnen einen Espresso anbieten wäre alles gut gewesen und es hätte eine 4-5 Sterne Bewertung gegeben.  Der Chef wurde in einer frühern Bewertung als Marke/besonderer Typ beschrieben - ja das ist er bestimmt, die Art und Weise wie er seine Gäste behandelt ist speziell und ich wünsche den vielen Chefs der ansääsigen großen Firmen Guten Appetit in diesem Restaurant  wir werden nicht mehr kommen! PS: Was mich nicht wundern würde, wenn in nächste Zeit hier eine SUPER Bewertung auftaucht  ein Schelm wer böses dabei denkt"}
{"text":"Ich kann mich den schlechten Bewertungen   nicht anschließen. Das Essen war sehr gut und richtig lecker. Klar es hat ein wenig länger gedauert bis unsere Bestellungen kamen, aber es wurde frisch gekocht und das ist meiner Meinung nach das Wichtigste. Von daher kann ich jeden der in Stade verweilt oder wohnt das Lokal nur empfehlen. Also hin Leute lecker essen."}
{"text":"Das Thai und Sushi Restaurant ist ein kleines asiatisches Lokal am historischen Hafen Stades. Im Sommer kann man malerisch draussen am Wasser sitzen. Das Restaurant ist ein Familienbetrieb, es ist vielleicht nicht immer alles top-professionell, aber stets mit viel Hingabe gut gemacht. Wir haben uns abends noch spontan mit Lust auf asiatisches Essen ins Restaurant gesetzt. Es gab zwei Vorsuppen (Glasnudel mit Huhn), die gut und mit viel Inhalt gemacht waren. Als Hauptgerichte gab es einmal Sushi und einmal Schweinefleisch auf thailändischen Art. Auch die Hauptgerichte haben gut geschmeckt. Es war hand- und selbstgemacht + nicht glutamat-überladen, wie man es anderswo gelegentlich noch findet. Es fehlt vielleicht noch ein wenig Pfiff bei der Zubereitung, ansonsten nichts auszusetzen."}
{"text":"Das Essen ist in Ordnung. Ich hatte eine SErviette mit einem Ring mit Sojasauce. Als ich die SErviette mit der aus dem Nachbartisch getauscht hatte, knallte man uns die Karten auf den Tisch. Mit Sparheft sollte man gar nicht erst kommen. Es kamen so Sprüche wie ' Kein normaler Mensch ist mittags Sampi' und ich bin doch nicht Ihr dummer Junge (für diesen Vorfall habe ich 6 Zeugen) auch dafür, dass man uns mit dreckiger Hose und schmutzigen Fingernägeln bedient hatte. Glücklicherweise hat dann die Frau unseren Tisch übernommen, sonst wären wir auch gegangen. Wir sind nach diesem Vorfall nicht wieder dahingegangen. Wenn ich Sushi essen will, fahre ich 60 km nach HH  und das ist es mir dan auch wert."}
{"text":"Lange Wartezeit (1 Std.) trotz leerer Tische. Essen bestenfalls mittelmäßig und viel zu fett (ist bei Thai-Küche schon fast eine Kunst...)    Nicht wirklich empfehlenswert."}
{"text":"Super leckere Küche, leider so klein, dass man häufig Wartezeiten von bis zu über einer Stunde in Kauf nehmen muss. Aber die lohnt sich. Personal ist total nett und stellt auf Wunsch den Speiseplan individuell zusammen. Gerne wieder."}
{"text":"Hallo liebe Leser, wir hatten uns eigentlich auf ein leckeres Sushiessen gefreut, wir sind neu zugezogen und kennen uns noch nicht richtig aus, also wählten wir aus dem Internet ein Thai-Sushi Restaurante in Stade.  Die Bedienung reagierte arrogant auf unsere Fragen, bzgl. der unverständlichen Speisekarte. Unhygienisch wirkendes Besteck (abgenutze Essstäbchen) und ein Teller war schmutzig, wurde dann getauscht.  Trotz der langen Wartezeit war das Sushi sehr unprofessionell zubereitet, die Füllung vom Röllchen befand sich teilweise am Rand und nicht in der Mitte umhüllt vom Reis. Die Rollen waren schief und krumm und waren nicht gleich groß. Die California Röllchen sahen fast aus wie Bälle und vielen schnell auseinander. Der Algenrand war viel zu dick und die Röllchen insgesamt sehr, sehr klein.  Das hätte ich zuhause besser hinbekommen.  Die Getränkepreise waren ok und die Vorspeise \"Frühlingsröllchen\" war auch gut.  Ich finde, wenn man keine Ahnung von der Sushi Zubereitung hat, sollte man es auch nicht anbieten, denn ein Sushigericht ist nicht gerade günstig.  Insgesamt muss ich sagen; nie wieder!"}
{"text":"Ich kann vieles der anderen Kommentare nicht bestäitgen. Wir waren mit fast 20 Leuten im letzten Jahr zum ersten Mal hier, und haben absolut hervorragendes Essen bekommen, nichts aus der Truhe oder so. Phantastisches Sushi, und viele andere leckere Gerichte.  Es ist richtig, manchmal hat das Essen etwas gedauert, aber dafür wird es hier selbst und frisch zubereitet.  Ich war inzwischen einmal zu viert dort, und danach noch mal zu zweit, es war immer wieder gut.  Der Wirt ist eine eigene Persönlichkeit, aber ich mag das.  Ich werde definitiv wieder hingehen."}
{"text":"Ich halte das Restaurant für sehr ungepflegt, sieht mehr nach klebriger Kneipe aus. Sushi wirklich sehr, sehr sehr schlecht, da hat gar nichts gepasst nicht der Reis noch schien es frisch! Alles in einem: essen -5 Sterne, bedienung -5, Ambiente -10 Sterne."}
{"text":"Also wir waren überhaupt nicht zufrieden, als wir vor einiger Zeit da waren. Die Bestellung hat sehr lange gedauert und dann kamen die Speisen für uns fünf Personen so unterschiedlich, dass die ersten lange fertig waren, als die letzten bedient wurden. Die Bedienung gab ihr Möglichstes, um uns zufriedenzustellen und war dementsprechend freundlich, aber auch die Qualität der thailändischen Speisen war eher durchschnittlich. Sushi haben wir keines gegessen. Vielleicht haben wir einen schlechten Tag erwischt, aber wir werden uns sehr überlegen, diesem Restaurant noch einmal eine Chance zu geben."}
{"text":"Nicht zu empfehlen! Wir haben gestern weit über eine Stunde auf unser Essen gewartet, obwohl um 18.30 Uhr noch sehr viele Tische frei waren. Das Essen war o.k., der Espresso zum Menü wurde allerdings auch nicht gebracht. Nach freundlicher Rückmeldung an den Chef gab es nur die patzige Antwort, dann gehen Sie doch in den China-Imbiss. Zu guter letzt hat der Chef mein Portemonaie eingesteckt und es nicht gemerkt! Nie wieder. Einen Stern für den netten Platz am Kanal."}
{"text":"Wir sind hier immer zufrieden. Kokos-Curry mit Tofu schmeckt ausgezeichnet, ist immer frisch zubereitet mit knackigem Gemüse. Die Frühlingsrollen sind auch klasse! Die Getränke und Vorspeisen werden immer schnell serviert. Manchmal haben wir etwas länger auf die Hautspeise gewartet, aber nie übermäßig lang. Der Chef und die beiden Damen die hier arbeiten waren bisher bei bestimmt 15 Besuche stets freundlich und zuvorkommend."}
{"text":"Wir sind Stammkunden in diesem recht kleinem thailändischen Restaurat. Eigentlich immer recht zufrieden, da die Küche stets frisch ist. Mittagstisch ist auch gut zu Empfehelen. Preislich absolut einwandfrei."}
{"text":"Ewige wartezeit. Ungemütliches Ambiente. Als wir dann unser Essen zu Hause auspackten(20 für eine Suppe und ein Curry ) war alles durcheinander. 2 Suppen, statt Reis, allerdings auch nicht die, die wir bestellt hatten. Schlecht gewürzt und das fischcurry bestand hauptsächlich aus fischbrocken. Gemüse konnte man suchen-war ja auch Ostern.... Fazit: Nie wieder! In eine Fahrkarte nach HH zum Thai ist besser investiert!!!"}
{"text":"Moin Moin, war mal wieder im Thai & Sushi. Wie immer: Freundliche und schnelle Bedienung. Hervorragendes Essen und super gezapftes Bier. Alles frisch zubereitet, das Gemüse in der Beef-Suppe  aldente, ein tolles Geschmackserlebnis. Das Steak-Fleisch  in der Suppe zart und topp. Die Knusperente super geschmackvoll, das Gemüsebett, frisch zubereitet,  einfach hervorragend. Die Preise sind angemessen. Das Abiente nicht so überladen wie in vielen anderen asiatischen Lokalen. Werde wiederkommen. Im Frühjahr und Sommer eine große Außenterrasse mit Blick auf den alten Hafen."}
{"text":"Waren diesen Monat mal wieder in dem Restaurant. Das Sushi dort schmeckt uns immer wieder gut. Ich kann ganz ehrlich nur selten herausschmecken, ob etwas aus der Konserve kommt, die Ente, die ich abends esse, evtl. schon morgens zubereitet wurde oder der Fisch aus der Tiefkühlung kommt und nicht vom Kutter fangfrisch. Was ich aber ganz sicher schmecken kann, ob es mir überhaupt schmeckt. Und das ist in diesem Restaurant bis jetzt immer der Fall gewesen. Bei besagtem letzen Besuch sagte uns der Inhaber, daß ein Herd nicht gehen würde. Da der Laden sehr gut besucht war an dem Abend (dies sagt wohl einiges über das Restaurant aus), richteten wir uns schon auf eine sehr lange Wartezeit ein  wir hatten es schon mal in dem Restaurant, daß wir über eine Stunde warten mußten, weil ein Koch ausgefallen ist. Das Essen kam aber doch sehr schnell, sehr heiß und sehr lecker aus der Küche. Die Bedienung war äußerst freundlich und tauschte die Eßstäbchen aus, weil die anderen in ihren Augen schöner aussahen. Die Atmospähre ist gemütlich, da der Laden nicht sehr groß ist. Mein Eindruck von der Einrichtung im Laden: Sauber, aber sie kommt so langsam in die Jahre. Trotzdem aber : immer wieder dorthin zum Essen."}
{"text":"Ich kann mich den u.g. Punkten nur anschließen. Essen ging so. Wenn Erwachsene das Essen vor den Kindern bekommen und diese dann nochmals 15 Min warten müssen, dann ist das nicht okay.  Bei der Bezahlung wurde aus einer 33,80 Euro Rechnung bei der EC Kartenzahlung dann auf einmal 99,80 Euro auf dem Abrechnungsbeleg. Auf die Frage hin was das soll, bekamen wir die Antwort: War dunkel im Lokal, so dass man uns 66 Euro Wechselgeld zurück gegeben hat, anstelle Storno. Krank!"}
{"text":"Der Kellner ist sehr arrogant. Ich hatte eine retournierte Serviette (da klebte irgendetwas drauf). Er hatte noch schmutzige Fingernägel und eine dreckige Hose. Wir sind wieder aufgestanden und gegangen. Ich will dann auch nicht mehr wissen, wie es in der Küche ausgesehen hat."}
