{"text":"The atmosphere in this place leaves a lot to be desired.   I was sitting on the bar side and could not believe the nature of the conversation transpiring within my earshot as I tried to enjoy my meal.   The food itself was OK, I certainly have had better pad Thai.    I felt more like I was in the neighborhood shot and a beer place than in a restaurant that should have been an enjoyable it dining experience with beautiful Thai food"}
{"text":"Great food and service. Had the Dumplings appetizer. They were fantastic, great flavor combination. My entree was the Garlic Chicken. It was delicious, the garlic sauce on the chicken was seasoned perfectly. Our waitress was very nice and explained the questions we had on the menu. Portions were generous and our meal arrived quickly. Looking forward to returning."}
{"text":"A new jewel in Brimfield, tucked away in the plaza. Wife and I decided to finally eat at an establishment at this location since moving here a few years ago because we love Thai food. This did not disappoint! The Malay curry has a fantastic curry sauce that immediately jumped up to one of my favorites ever. We also had dumplings for an appetizer that were very good. Plus I've always loved Thai tea and tried Thai coffee this time, also great! Because this has been different eateries in the past couple years and this one is still new, the outside is not eye-catching yet, but you'll be rewarded for checking it out."}
{"text":"Brimfield is lucky to have this kind of flavor in town, however I am reluctant to believe that the locals will actually ever know. This gem is situated in the corner of a plaza that hardly receives any traffic and it's very easy to pass right by this place and not even notice its existence. Take a chance and try something other than the run of the mill joints nearby (McyDees, Wendy's, Subway, etc), and spend money on great tasting food that was made with time, effort, and quality! Hands down, best restaurant in Brimfield. The dumplings are the best I've ever had, and the Drunken Crew plate was awesome too! (For those that like spicy foods)"}
