{"text":"Great value for the money! I've been here for lunch 3 days in a row and each dish was tasty. Friendly servers too!"}
{"text":"Not sure about eating in but their delivery was pretty awful. The salmon tamarind dish looked like a frozen piece of salmon (no real tamarind sauce in sight) slapped onto a bed of soggy vegetables. The bigger issue is these did not seem genuine Thai flavours. They appear to be imitations of Thai food and pretty bad imitations at that. Sad, we wanted a good new Thai place in our neighbourhood. This is not it."}
{"text":"Simple place but awesome food.. I got the lunch combo of green mango salad and Pad See Ew the salad was bursting with flavors and freshness while the pad see ew was perfect! I forgot to mention That needed it to be spicy but the flavours were on point!"}
{"text":"This is the third Thai restaurant we've tried since moving to the Annex in August and it is definitely our favorite. We ordered the veggie Pad Thai, spring rolls, and pineapple fried rice. Everything arrived piping hot and veggies were crisp, the sauce for the Pad Thai delicious, the pineapple fried rice had a wonderful gingery flavor. Two entrees and the spring rolls filled four bellies (two adults, a teen and a child) and there are leftovers. All for $33. I can't wait to try more of their entrees and the delivery included some great coupons. I'm especially interested in the family meals which seem like a great value."}
{"text":"Compared to the last restaurant at this location (Thai as well), the interior has been redone and looks much much better, and they now have beer on tab. I'm sure not same owners as before. 

There are seating areas (bar, bar-high tables, and regular tables). The restaurant is alright for few people but not a large group. They have large TV's so its a good spot to have drinks and watch a game.

I ate once in there and sometimes order to go. The food is ok, not really authentic - Thai Imitation at best. Eating there is better (when not busy), the food looks way better than when ordered to go.

I dislike the fact their chef leaves the shrimp tail shell on, when using shrimp in soups which means soup now requires you get your handy dirty to remove the chewy and unpleasant shell!"}
{"text":"We live in the area and used to get takeout at the previous restaurant  so decided  to try this new place with new owners. Got the standard dinner for two takeout with green curry. Definitely  a step up from the old restaurant. Portions were large, pad Thai very good and green curry excellent too. The interior has been nicely redone and they have draft beer so we will be back for a sit down meal. Great  to see and support good restaurants  in our neighbourhood."}
