{"text":"The place is looking fresh after a recent remodel and addition of outdoor seating.  There is no children's menu, but our kids happily stuff themselves with one of the noodle dishes.  I am absolutely in love with the Kanoom Jean & Kaeng Keiw Warn noodle dish.  I went in one night craving both noodles and curry.  Well, that dish has vermicelli in a delectable green curry.  I could easily eat two bowls of the stuff and the portions are generous.  It will be a very sad day when we move away and I can't eat here anymore."}
{"text":"Maybe 2.5 stars. If you are going to serve pho on your menu, make sure your employees know how to pronounce it: \"F-uh\".  A decent bowl of soup on a cold day, but they should spend enough time on the broth so that condiments aren't necessary."}
{"text":"How things change. Recently went and ordered simply Chicken Satay and Spring Rolls. The satay chicken was rancid. It tasted like shi*t, literally, smelled like dog poop. It was way wrong.  We did get sick overnight.  Finally having called that evening to complain, the person on the other end said we would get a refund that never happened.  Regardless, this place has gone downhill in a major way from award winner to garbage dump.  They have now lost another long-time customer. If you want quality food you need to travel to Milwaukee or Chicago, best to just leave Madison altogether if eating out is important to you, there is little here which can stand the test of time, even Banzo is totally inconsistent with their recipes and quality, sad.  Hopefully Thai Noodle will shutdown and make space for the Subway next door to expand, ewww."}
{"text":"Looking at it, you wouldn't think this place would be so great.  1) Food is very tasty, clean and healthy. 2) Service is phenomenal.  I got curry catfish and vegetables.  I'm also very happy they don't serve any alcohol."}
{"text":"This is my first trip here in Madison and this is one of the places which my coworker recommended for Thai food.   First time I came here I tried the pad thai and it was delicious. Not as \"saucey\" as I am used to but I love it. The second time I had lunch here my recommended the red curry with catfish. I havent eaten that much curry dishes but I like this one.   I love the thai iced tea...I would definitely come back if Im in town."}
{"text":"After reading everybody's review on this place I was excited to get home with my take-out.  I have never had bad Thai food until I came to this place.  I ordered the Panang Curry w/ chicken and asked them to make it spicy.  It was the most bland and flavorless food I have ever experienced and was not spicy in the least.  To top it off the rice was very chalky and after pouring the curry sauce on top of the rice it made for a bland chalky taste.  My girlfriend ordered the Masaman Curry and it was spicier than my entree, after I asked for it to be spicy.  Her entree tasted better than mine but the chalky rice made it taste bad.  To round out our meal we ordered the crab rangoon, this was the best part of the meal.  The crab rangoon was better than most Thai places we have had, but not the best."}
{"text":"I've ordered carry out here dozens of times and the food has always been great. Today I went in for sit down service. There were two employees at the front desk and a woman in line ahead of me. The one employee was helping the customer while the other sat there and never greeted me.... So I decided to find a seat. Before I could sit down at a table the man yelled \"mam!\" At me and then Very aggressively asked if I was here for sit down, in which I replied \"yes\". He then proceeded to bark at me that I needed to wait to be seated. There was only one other guest in the place... So I stood next to the table I was going to sit at and waited for the other employee to put a menu down on the table before I was allowed to sit. I've worked in the food service industry for over ten years and have never treated a guest like that. And so, even though their food is good I will never be ordering from there again. There are plenty if other great restaurants in this town that would actually welcome my business."}
{"text":"This is my go to Thai food restaurant.  They have a great variety on their menu.  I personally almost always go for the curry squash but also love their pad thai and panang.  My dad always gets a different spicy dish with seafood, and he loves it too.  The staff is very friendly and helpful.  They are also quick."}
{"text":"I visited Thai Noodles with a friend, because it seemed like the most interesting restaurant immediately around the IMAX theater. The restaurant is small and a little sparse, with fewer than ten tables. It's clear that their main business is takeout.   I can't comment on most of the menu, although the special looked good. All I ordered was a pad thai and tea. But the pad thai was one of the most flavorful, delicious and inexpensive I've had in Madison. For that alone, I know I'll be back."}
{"text":"I've decided to review Thai Noodles on their food and not their space. The interior of the restaurant is not very inviting, but I find it to be OK for a quick lunch. For dinner, we've always gotten takeout. The food, in my experience, has been consistently good and at a great price. I have found the curry dishes to be quite delicious. I'd say that they compare favorably to Curry In The Box, in that regard. You can make up your own curry combos, as well, choosing different sauces, meats, and veggies. I also like their fresh spring rolls. Good and plentiful ingredients. So far I haven't been disappointed with anything I've ordered."}
{"text":"I've only tried three dishes off of their menu. The spring rolls (Iceberg Lettuce, not much flavor, terrible dipping sauce), the Tofu Pad Thai (good taste, lots to eat, limited flavor), and the Khewtiew (Pho) Pork (tasty broth, not much pork, lots to eat, spicy). Nothing wowed me, but I will be back to try more of the curries, drunken noodles, and pad Thai.  Overall, reasonably good Thai food. Not a place to dine-in at. (Service was clunky and felt like a burden.) Certainly not the best Thai food I've had in Madison, but close to work."}
{"text":"I'm no expert on Thai food, but I know what I like. The pad Thai here is really good. The service was friendly and quick. I'll come back for sure!"}
{"text":"I love this cosy, little restaurant and love to grab take out here. Their spring rolls are so fresh and are yummy - definitely the best I have ever had. My husband and I love the pho and curries. I wouldn't recommend eating in the restaurant during the lunch/dinner rush because they are very popular and it will take longer to get served. Although this place is small and is mainly for takeout, my husband and I stop by on movie dates and I have taken small groups of people here and the service is always super friendly."}
{"text":"Used to really enjoy this place not so much anymore. Food is now awful, ordered chicken satay and it was rancid! The food was rotten and far from fresh. Got really sick from it and would never go back! Manager would not refund our dinner after he said he would, it never happened! we had to throw the whole dinner out after a few bites and getting sick! Buyer beware..."}
{"text":"This is a regular \"go to\" for our family. I know they have a lot of take-out orders but we always dine in. They've refurbished their interiors and they keep it clean! I've only been in Madison for 3 years but have managed to eat at a lot of different restaurants. It's been surprising to me that this city seems to have low cleanliness standards, but not here. Thank you Thai Noodle for being a tasty, friendly, clean and affordable place to come back to!"}
{"text":"Entire family loves the food here.  Have tried a number of the curries and have not been disappointed.  Fried rice and drunken noodles are both excellent as are many of the appetizers.  We do take out here, would not be able to eat as a family nor would we want to...  must be meant to be take out.  The only trouble we have is that we always order so much food because everybody wants some of everything."}
{"text":"Fresh and very tasty , one of the best tasting Thai food in town."}
{"text":"What a great find. I was pleased to see a \"build your own curry\" on their menu. I always struggle to find a curry dish that has lots of veggies and protein, for the right price. The service was great and the place we very clean. We'll definitely be going back."}
{"text":"I came here with friends and it was quite uninspiring.  All other factors aside, the food was pretty underwhelming.  Of all the Thai places I've been in Madison, this is by far the worst.  It was bland, soupy, and sparse.  The drunken noodle dish, for example, was drowned in watery sauce, so much so that each ingredient of it had to be fished out of what was basically an overly salty broth.  Other dishes that I tried were also all either inundated by liquid or completely oversalted (drowning all other flavors, if there even were any other flavors to begin with). I wish that I could rate it even 2 stars, because it looks like it's family run and they try hard, but the food was definitely not worth it."}
{"text":"Traveling on business, this place was a pleasant surprise. Low on atmosphere but really good food. The fresh spring rolls were excellent."}
{"text":"Hole in the wall is a pretty adequate description of this place.  Don't expect atmosphere if you are eating in.  I order take out from here quite regularly as I am a fan of the Pad Thai.  The portions are generous, and I like that the chicken pad thai also has pieces of tofu in it.  The summer rolls are good, and the crab rangoons are a little unique but delicious.  Overall, I prefer Curry in the Box for thai food in Fitchburg, but this place is worth a try.  Order your food for takeout, open a bottle of Chardonnay, and you've got yourself a decent meal in."}
{"text":"The nicest server in the world, I am pretty sure. Delicious food. Clean little place. I will eat there again and I'll bring friends!"}
{"text":"Underwhelmed with the spring rolls and beef pho. Spring rolls and peanut sauce were both bland. Beef pho barely had any meat. Broth was pretty tasty but that bean sprouts were brown and not fresh. May try a different dish in the future. But for the best pho I've had try Saigon Noodles."}
{"text":"I've never been so impressed with a Thai restaurant. This place has got it going on. I absolutely LOVE the Pho. I could eat it everyday. The service is great. Everyone that works there is really nice.  It can get busy at lunch time and you might need to wait, but its worth it!"}
{"text":"My boyfriend and I left this place wondering where we should eat lunch--neither of us felt satisfied after our meals. My boyfriend ordered a seafood dish and I got a HUGE bowl of soup (only one size, 24oz). My $8 soup was a bowl of broth topped with a handful of mushrooms. Overpriced and overspiced... Don't order anything here containing cilantro unless that's all you want to taste."}
{"text":"I would give this restaurant 3 1/2 stars if I could.   My mom who lives in Bangkok, Thailand was visiting us in Madison and she was craving some Thai soup and happened upon the place since it's in our neighborhood. She gave the soup a try and was impressed - which says a lot to me because she is used to the best of the best Thai food living there. So she picked up a copy of their menu and brought it home to show us.   I was impressed by the menu and we decided to order dinner for pick up there last week. When I went to pick up the food I was pleasantly surprised by the interior, it was welcoming and overall clean. The food was ready when they said it would be.   I ordered the yellow curry with three items of your choice (I chose Thai eggplant, straw mushrooms and squash) and it was very tasty. The portion size was generous also. My mom ordered the green curry which was also quite delicious. My spouse ordered the fried shrimp and Chicken Satay. The fried shrimp was too greasy and not a big hit. The chicken satay comes with a random slice of toast, however, it actually goes well with the meal.  The spring roll appetizer I ordered was good, although I would have preferred it without the pork.  I ordered a Thai Ice Tea to go which was also good.   This place has some of the better Thai food I have had in Madison and I am thankful it is in our neighborhood, I found the food more impressive than Sa Bai Thong's. I think it would be nice if they offered delivery in addition to take out. I also think the reason I hadn't visited the restaurant sooner, despite living nearby, is because the name made me think it was solely a noodle place not a Thai restaurant with non noodle options."}
{"text":"this is my drunken noodles.  looks like it came out of a can. a gelatinous sludge. nothing fresh! i would not recommend this place to anyone. NASTY"}
{"text":"Excellent Pho! We returned from a vacation in Vietnam a few weeks ago and we've been missing really good pho. We've had it at a couple restaurants since we've been back and it didn't compare. We tried The pho at Thai Noodles this morning and it was amazing!!! Super delicious broth, great noodles, and good quality beer and pork. This is our new place for pho!"}
{"text":"This is the restaurant I always go to after I finish watching a movie. It is go to Thai restaurant. I can't go as often as I what anymore because I don't leave in the area but when I have I opportunity I always make a stop. It always good and hot."}
{"text":"Really bad food. Got stomach ache the next day after eating the thai fried rice! Yuckkkkkk"}
{"text":"If you have read any of my other reviews of Thai restaurants, you will know I always test a new Thai restaurant with Pad See Ew. It is by all appearances, a simple dish. This is of course, strictly true. However, I have found that simple dishes offer a true test of a restaurant's capabilities and consistency. If a restaurant cannot prepare simple dishes well, there is no reason to expect better from a complex dish. As you may guess, I ordered the Pad See Ew. I was not disappointed. The \"simple\" sauce had that complex, slightly burned flavor that is the mark of the best Thai restaurants (most just take like plain soy sauce). The egg was folded in properly and still looked like egg, not brown, stringy goo. The broccoli was crispy and fresh, but not raw. The noodles were perfectly cooked, neither \"al dente\" (a bogus, nonsensical \"gourmet\" term), nor swollen and overcooked. The spice level was perfect, i.e. spicy with plenty of flavor, not just heat. An excellent assortment of spices accompanied our order to allow customers to customize their meals as desired. I upped the heat considerable after tasting it to make sure the heat would not destroy the flavor. The portion was correct: I was wishing there were a bit more but after sitting for a moment or two discovered I was fully satisfied. The restaurant is small and oriented to lunch diners, but I returned the next day for take-out and found the take-out as good as the dine-in. Under $10 for either meal! Highly recommended."}
{"text":"Wow! What happened?! In a good way!  The drab interior has been transformed into a zen dining area and the customer service has stepped up two notches.  I ordered the green curry, drunken noodles and papaya salad.   READ: this is one of the few Thai places that gets the curry consistency right. It should be creamy, not watery, curry is not soup. I was very pleased that the curry had thicker consistency than many of the other places I've tried recently. I appreciated the varieties of veggies in the curry such as red peppers, onions, bamboo shoots, and Thai eggplant. The drunken noodle was equally well done with a even bean paste sauce, many vegetables, and generous thin portions of sliced beef. I asked for a level 4 spiciness level on the papaya salad  and my nose was dripping by the second bite. I love the accuracy of the heat levels.  Kudos Thai Noodles, I'll be back!"}
{"text":"I was visiting Madison for a family wedding and we were heading to Subway to pick up some lunch.  As we pulled up, I noticed Thai Noodles but didn't want to leave the family since we literally just landed.  Thankfully, my father-in-law shocked me by offering to dine with me while everyone else went to Subway.  I love asian food.  I cook it all the time.  When we go out to eat, it is usually asian.  I am not easily impressed.  The menu was smaller than what I am used to, but I would rather have a few great options than many okay ones.  If a Thai place can't even make pad thai right, move on.  Thankufully, Thai Noodles got it right on the money.  Great value, great food, and wonderful service.  We ate at a few other asian places while in the Greater Madison area, and none of them compared."}
{"text":"Ordered Pad See U and Pad Thai.  Neither were great, but the Pad See U was not good. Basically tasted as if only cooked in soy sauce. Rice noodles were way over cooked and soggy.  Pad Thai was better, but only okay.  There was too much sauce on the noodles, but at least the noodles were properly cooked. Fails in comparison to my favorite Thai place in Madison (Thai Basil)"}
{"text":"I give it a 3 because my two companions liked their lunch, but my pad \"z\" eww was pretty bad. No flavor at all. Very disappointing."}
{"text":"Delicious, delicious, delicious!  I haven't had drunken noodles this awesome in a while.  The crab rangoon were delicious, too!  My boyfriend ordered the duck which was so tender and juicy!  We'll definitely be back soon!!"}
{"text":"We' live nearby so have frequented Thai Noodles often as it's quick to pick up. The only two things we've liked so far is the Panang, but we had that again last night and it was bland. That's the story really, their food lacks any flavor, to the point where it truly is just bland. I think we are done with this place. It is unfortunate. Kissy and Jack"}
{"text":"Enjoyed the Pad Thai, Rangoon and Rolls."}
{"text":"We eat here a lot... Once we decided to let ourselves order out once a week - this is our weekly \"go to\".  The food is filling without being greasy.  The ingredients are fresh and we have liked everything we've tried.  We love their eggrolls and Crab Rangoon.  The Thai Platter for two has become our recent favorite.  The fresh spring rolls and the House Fried Rice with grilled chicken is my favorite (with both sauces), and my husband loves the Pad Thai with chicken.  We also love the green curry with chicken.  (We don't always stick to chicken dishes - they just soak up the Thai flavors best).  I haven't met a special I haven't liked.  A recent seafood dish was one of my favorites with muscles and shrimp.  Leftovers usually don't last long in our house because they taste just as good reheated a couple of days later."}
{"text":"I love Thai Noodles.  My favorite items:  Triangle Curry: Rich, flavorful and packed with ingredients.  Crab Rangoon, which is actually triangle rangoon. Its very full with filling and sweet. I love them.  Spring rolls (raw): I really enjoy this type of food. The rolls always taste fresh and are packed with cilantro, rice noodles and thai roasted pork. SO good!  Roasted Duck Curry: Its a (very) sweet red curry but its delicious. Packed with flavors, its easily one of their best dishes and comes out perfectly every time.  Jungle/Squash/Make your own red curry: I love thai curries. I love that they're sweet, rich and filling.   Thai noodles' curries, I think, are much better than other Thai places in the area. I've never had a bad meal here. I think its a great place to branch off into a different cuisine. The portions are big and the people are friendly. I really like that I can see into the back where the parents are cooking (its a family restaurant) and they have a big cart laden with spice dishes. SO cool!"}
{"text":"This place completely renovated since the last time I was here, inside, outside, and foodside.   The bright, airy interior with wooden chairs and benches were a great backdrop for sipping our Thai iced tea and iced coffee, which were thick with cream and syrupy flavoring. I really enjoyed my sweet drinks alongside a refreshing, green papaya salad with complex flavors encased in pungent fish sauce. The sticky white rice served alongside it complemented the crunchy texture and tempered the pungency.   Their house fried rice was presented beautifully, with crispy battered chicken breast atop, flavorful and tender. This dish is great for those craving familiar flavors. However, I would most recommend their red curry with coconut milk and chicken. It was fragrant and absolutely delicious, even worthier as leftovers.   I love this location next to AMC Fitchburg, which makes for a great, family-friendly lunch stop right before a matinee. While great for dining in, the space is adequate but not large, and I saw plenty of people grabbing takeout orders as well. I hope you'll enjoy Thai Noodles as much as I did!"}
{"text":"Great pad panang, nice service, and fast. I stop by here often for food before weekend work sessions in the Barriques next door.  I've never been disappointed, and always leave full. Plus, they have those amazing guava candies, oh lord."}
{"text":"These guys were going through a remodel the last time I went so as far as in dining experience... there was none. We ordered ahead of time and brought it home with us.   The Pad Thai was a little dry and full of flavor. The crab Rangoon was very tasty. It was uniquely shaped like a triangle and had a lot of filling and less breading. Very good!  I had the Drunken Noodles. WOW! These are worth going back for. I haven't been to another place in Madison with this dish. The noodles were thick and filling. The soupy sauce was spicy and full of flavor. This is a must try on the menu.   Overall, not the best Thai place I've tried but certainly good enough to warrant my repeat business!"}
{"text":"This is not my first visit here but my first review of the place. I struggle a lot with this restaurant. I can't help but compare the dishes to other Thai restaurants or even those from Thailand because of the name but I know this is different.   Take tonight's dish for example. Seafood combo in karee sauce. The sauce was very light and tasted good on its own. I put it over the white rice and it was very tasty.   Somehow the flavor did not penetrate the scallops, shrimps or squid. By the way there were 4 pcs of each. The only way I know how to eat this dish was to scoop the sauce into the rice, put a piece of meat on the rice and scooped that into my mouth at the same time. The dish was also not piping hot either.   I like the flavor of the triangles as well but again something is odd about it. The outside skin is crispy and nicely done. The flavor of the fillings was good also but when you take a bite it feels like you are eating two separate things. If anyone else has this feeling, I would love to hear what you think. It might also be the texture of the fillings - mixed of soft and crunchy vegetables combined with crispy skin.   Closing on a positive note, none of the dishes were super salty and the portion was right for a meal."}
{"text":"My partner and I stopped at Thai Noodles after a movie at the AMC Fitchburg 18 recently. Thai Noodles is located in a strip mall. When we arrived, there was no-one else in the store, but throughout our visit we noticed several patrons ordering take-out. The restaurant is airy and light. Our hostess/waitress was friendly, seated us promptly and provided us with menus. Southeast Asian is my favorite cuisine so after perusing the menu I was excited to try it. We ordered egg-rolls, pho and drunken noodles. The egg-rolls were not my favorite. Slightly smaller than most, they also didn't have as much flavor as I expected and they were served with a sauce which reminded me too much of sweet and sour. The drunken noodles were decent but more drunk (read that as soupy) than I was expecting. The biggest disappointment to me was the pho. It's listed as Khewtiew Beef under noodles rather than soup. It looks like pho, it has the usual pho accouterments, but the deep complex beef flavor of pho was not there. Just a noodle soup rather than pho. Although I liked the atmosphere and the service, I was just not impressed with the food. There's definitely better options in the Madison area."}
{"text":"The best crab rangoon I have ever had!!!   Having lived in SF, NY, LA, and Chicago I asked the waitress how the crab rangoon was and she replied without hesitation \"it's the best in the city.\"  I have to agree and we recommended it to the other two tables dining in the restaurant.  The first table declined the recommendation and the second table ordered it and agreed it was world-class.  The first table eventually decided to order the crab rangoon after the reaction of the second table convinced him it was worth trying!   Service was friendly and prompt and I would strongly recommend this place for a good quick meal or take out.  Agreed that the interior could use a bit more flavor but the food, price and service were more than enough to earn my repeat business."}
{"text":"I went here for lunch and all the tables were taken. It was a very small area, maybe at most 10 tables.  I was told there would be a wait of 10-20 minutes. I opted to order pad thai for take-out. I was disappointed with the dish. Too oily and too much sauce. Ever since then, I have steered clear of pad thai from any restaurant. Traumatized, I tell ya."}
{"text":"After reading all of these reviews, I was really excited for my Thai Noodles experience.   We ordered takeout, I got pad thai and the boy got curry.  We also got tofu eggrolls and spring rolls. The standout item was the eggrolls... The pad thai was nothing special, I have definately had better in Madison and the curry was nothing to write home about either... It was very watery and lacking any flavor... there was no standout spice or curry flavor and the pad thai was very sticky and seemed over cooked."}
{"text":"The service was nice, but the food wasn't great. I had the pad Thai. We also ordered drunken noodle, which was the soup kind. It tasted like .... a thick chicken soup."}
{"text":"Solid curry.  Apps are delicious.  Take outs usually take about 20 minutes, but Ive been a repeat customer for over 20 times and have always been happy with my meal.  Will continue to go back."}
{"text":"Update :  I'd say the curry here is some of the worst I've had in Madison. As the review for the Ramen was glowing, I would advise against the curry - especially if you like the flavors of Sai Bai Thong or Monsoon Siam. I can only describe it as very watery and a little too salty(or some other flavor that seems out of place that someone else could probably identify better.) I did miss out selecting the spiciness for my curry so that may have helped but it was lacking the rich, \"mm-mmmm\" flavor that I'm used to from other places.  Vegetable Red Curry 1/5 Vegetable Ramen 5/5 So a final review of 3.   I'd also say the place gets fairly packed and due to it being small - it seems planning a backup restaurant if it is full seems wise. The staff seems very friendly and courteous with fast service so no complaints here otherwise!"}
{"text":"There are a couple of choices on the menu that are good, primarily the soups.... Yet if you really love Thai food and happen to be in the neighborhood, you might just want to put that craving on hold and go to the Subway next door for a foot long steak and cheese."}
{"text":"This was a small restaurant in a strip mall-ish type plaza. Weather was warm outside and temperature inside was just slightly cooler.  I ordered the stuff chicken wing. It was \"ok\" but didn't have any taste to it besides the sauce they provided. Wouldn't order it again.  I also got the beef pho. Broth was ok and decent amount of noodles for the price,however, the meats were disappointing. It was just regular beef cut up and thrown in to the broth to cook (homestyle).   Overall, I wouldn't go again but give it 3 stars instead of 2 because I didn't feel overcharged but a little more seasoning would've helped."}
{"text":"We ate there on 3/2/15 and when we entered, the place had us wondering if it we should stay or go - it's simple booths and tables. The waiter was nice. We sat towards the back because we wanted to be warm. The important part of the review is that the food was delicious! I had a generous serving of duck curry - wow it was great! All three of us thought the food was perfect! You can take a shuttle from Holiday Inn Express in Verona - but they don't accept AMEX.  So for a casual Thai dinner where you want to eat plenty of really very good Thai food - I can recommend Thai Noodles."}
{"text":"As the vegan in the room (looks around to see whose with me), it's always a challenge to find GOOD vegan spots so whenever I'm visiting I have to rely on YELP quite a bit. Anyway, YELPING about this place. Loved it. Tofu Pad Thai is my fav!!! I'm going back for lunch today so I can try a rice dish.  #teamThainoodlesforever ;-)"}
{"text":"***Updated review!***  In January 2012 I wrote a very in-depth review of this place, and I guess the owners paid attention to my suggestions because the interior has been completely remodeled. It's a warm, inviting color, there are partitions to keep the drafts from disrupting a meal, there is art on the walls...it makes me so much happier to be in there. I can't say enough good things about Thai Noodles. If it was closer to my house we would eat there every week instead of every 6 weeks or so. Hubs and I have been eating here regularly since they first opened, and we're very happy at their success. I hope they stay in business for a long, long time.  It's gone from a strictly take-out place to a restaurant I'd be happy to dine-in at. Here's the relevant leftovers of my older review:  \"Hubs is a big fan of the duck and squash curries, while I'm a fan of the green curry (Gan Kiew Wan) and Pad Thai. I'd also like to give an A+ to the Thai Iced Tea. We have never waited much longer than 25 minutes for our food, even at peak meal times. Since they first opened, I've noticed that the level of spiciness has been tapered down. This place is owned by a family from Thailand--I commented on how good my entree was and the girl waiting on us smiled and said, \"Thanks. My mom made it.\" How can that not melt your heart? Anyway, regarding the spice, I'm guessing they learned pretty quick that Midwestern Americans generally have rather bland tastebuds (meat & potatoes people, I'm looking at you!). If you want the spice and the heat, you have to speak up."}
{"text":"Thai Noodles is always delicious! I've eating at this establishment over the last year and the Pho is always hot and delicious. Crab Rangoon is amazing and the best I have had and so fresh! Today, I got the beef/pork with extra noodles! I drink all my broth first out of habit lol. Yum!"}
{"text":"If you have ever eaten Thai food anywhere else- say, the West coast, you will know what it is supposed to taste like. NOT like this. Sadly this is the worst Thai food I have ever had: the worst. We were sucked in by the 4 star review and went with high hopes.  Pad see ew was bland and boring. Yum pla muk - the seafood salad was so over Fish sauced as to be almost inedible. and no lettuce, just cucumbers. Pad prik mao(?) with beef was barely OK and boring.  The service was friendly. The place seemed clean.  No booze."}
{"text":"Best Thai food in the area. Hands down. Got the pad panang it was so good I had multiple bowls of rice with it. Also the Tom yum soup was awesome with so much mushrooms. I love mushrooms! We will definitely visit here regularly. The service was also great, the servers filled up our drinks constantly and were attentive to our desires. Best Thai place ever"}
{"text":"Anyone claiming this is the best Thai food in Madison definitely has NOT been to Suwanasak, or they know nothing about Thai food, period.  I got the musaman curry, which was fine--spice level was nonexistent, despite asking for some heat. It also lacked the traditional peanutty backbone a musaman curry is supposed to have. Other than that, it was good. We had to ask for the side spices--which are usually on the table--and that helped the heat.  Anyways, in short: it was fine/good, but nothing special. Places like Thai Noodles make me feel the need to revisit my ratings system--this was fine (hence the 3 stars), but if Ayada (Queens) was given 4, where does it end?! This place has nothing on the now-defunct Asian One or clearly superior Suwanasak. Would I go back? Eh, maybe, but not with Suwanasak present in Madison."}
{"text":"I have loved Thai Noodles since the very first time I walked in.  I am now a big pho fan and I love that I can get my level of spicy, yes I know it's dumbed down american, \"just a little more spicy\" but it works for me and they can make it happen.  I have eaten the pho, the fried rice, jungle curry (and many others) and the create your own curry, all of which have been fantastic.  The service is liken to a greasy spoon in a small town.  It's nice, friendly and gracious, food is made to order and they are able to recommend things based on previous visits.  Oh and they remember who you are.      I follow/like them on FB and they announce specials and features.  I love the dinner for 2 special that they run from time to time.  There is competition in this Curry space here in Madison, but I think Thai Noodles takes the prize!  Thanks for being so great!"}
{"text":"Good food, looooooongggggg wait.   I don't mind waiting a while longer for good food but they were really way behind recently.    Waited 40-50 min for my food.  Expected to have to wait only 20.  They told me the wait would be 30 min after I paid for my \"to go\" order.   The food was terrific but this is now the second time I have had to wait a long long time.  It would have been better had they given me a better estimate on the long wait.  I would have gone for some things I needed down the street and then come back. I have to raise them back up a star.  Went back recently because I felt the wait was worth it.   I have been eating at other Asian restaurants recently with mixed results and boy did it stand out when I got my most recent order from Thai Noodles.   The food was awesome and everything was super fresh and delicious.   On top of this my order was ready in a very timely manner so I couldn't be more pleased.   Thanks Tai Noodles, the food was wonderful. OMG!  The pho was awesome!"}
{"text":"This is an excellent family place. The food is great. My family love it as well as my friends and their families. Noodle dishes from around the world including American classics as well as fresh salads and gormet sandwiches. Also very fast service always."}
{"text":"I had the Pad Thai.  It was not the best Pad Thai I've ever had, but it was very good.  The thing that always gets me is the sauce--if there's too much of it, it's just not as good.  There was too much sauce.  However, the flavor was fantastic so when I do come back (and believe me--I will!), I'll just ask them to go about halfsies on the sauce.  We went on a Saturday night (Halloween weekend), and there was plenty of parking. The place itself is small--and also nice and quiet.  We could hear each other talk.  The staff were very attentive, and had no qualms about dividing the check up for our party of four.  All in all?  I will definitely come back.  :)"}
{"text":"Great shrimp rolls and Thai iced tea. The waitress is a joy. The food is delicious and just spicy enough, so be sure to ask for spicier if you prefer it that way. The only reason we didn't give 5 stars was because of the take-out ambience. Great for take-out, bad for eat-in. Great value."}
{"text":"Good, fast thai food. I frequently get the Pad Z U and thai iced coffee and am usually pretty satisfied. The recent renovation is a big plus with a clean interior and plenty of indoor and outdoor seating. Pricing is comparable for the quality of the food."}
{"text":"Love this place for takeout, especially for the price. I've had a pretty good sampling of the menu by now, as I've eaten there more than a dozen times. My favorites are the curries, but I've never had anything that didn't meet my expectations.   Fast, friendly, tasty, consistent. And from where I live (about a mile from the restaurant) it's the BEST takeout available for the price."}
{"text":"This place for whatever reason has glowing reviews and unfortunately I was sucked in by them.  I ordered take-out from here today based on the reviews and I have to say this is hands down the worst Thai food I have ever had.    I ordered the squash curry which sounded great on the menu.  It comes with squash, yams, bamboo shoots and peppers which generally is a recipe for a delicious dinner but trust me my friend it certainly is not.  When I got my food home I was very excited because I noticed how large the portions were and it smelled amazing!  Upon closer inspection however I noticed the separation in the curry which I don't think I have ever noticed as much in other curry dishes.  I prepared my plate and took my first bite and hated it.  The dish lacks flavor and was very runny.  The chicken was okay but everything else was just dreadful.  Even the rice that came with the dish seemed to not have enough salt or something.    On another note when I walked in their was a board with specials on the menu.  Once of the specials was sausage fried rice but there was a dog drawn next to the name of the dish.  This struck me as weird to say the least!  I wish I was able to give this place a better review as it is so close to my place and I'd like to have a great Thai place nearby but this place did not pass the mark.   Others have commented on how authentic this place is but I beg to differ, a lot!  If this is authentic then I'd take inauthentic any day!"}
{"text":"Was looking for something a little lighter on the waist so decided to try the pho. I opted for the seafood pho, which had shrimp, octopus, artificial crab, mussels, rice noodles, and broth. It was served with the typical sides (bean sprouts, onion, lime, etc).   Now I'm no pho expert, but I thought this was some pretty good stuff. I'd happily order this again and likely will.  I've been to the Thai Noodle several times and have always been happy with my meal. They've also recently renovated the inside, making it much more appealing for dining in, which I did. In fact, they have tables to seat 28 comfortably.   Don't hesitate to try the pho next time you have a craving!  Oh yeah, did I mention it was only $8.95!"}
{"text":"I came here on a whim after yelping Asian cuisine. I ordered the pho, but was underwhelmed by it. It was missing the flavorings (most prominently the star anise) usually associated with it. However it is a Thai restaurant so I will be back to try a traditional dish. The spring rolls were fantastic -- flavorful and fresh."}
{"text":"We ordered the beef \"pho\" with tripe, the tom yum soup, and the pad Thai to go. While the food wasn't perfect, it was very good and we felt like we got a good value. I especially enjoyed the spices they used in the beef broth for their \"pho\" and my girlfriend loved their tom yum soup. I would definitely come here again."}
{"text":"One of my staple Thai restaurants in Madison for takeout. They do an excellent job of making their spicy food *spicy* (and not \"Midwestern-spicy\") and also flavorful-spicy (pain is not a flavor.) My favorites on the menu include their pho (one of my baseline dishes for Thai & Vietnamese restaurants) and pad-z-you. My partner loves their satay, spring rolls, and pad thai.  A recent renovation/expansion has improved their dine-in experience, but it's still a bit odd -- very brightly-lit and feels a little *too* fast food (rushed) for food I'd like to sit down and enjoy a bit more. Drinks (something else I only get when I eat there) are also a bit spendy -- I don't mind paying a few dollars for thai coffee or iced tea, or a blended smoothie, but nearly that for a can of soda? These are easily avoidable, though.  Honestly, my biggest (only?) real complaint about Thai Noodles is that they don't deliver; thankfully, I live relatively nearby.  I'd recommend this place to anyone looking for good Thai food in town."}
{"text":"I've been eating at this little gem for over a year now. It's a small place with  5 or 6 tables. Family owned and operated. Stellar service, but what really keeps me going back over and over again is the food. I've traveled through their menu almost completely . This coming from a man that always eats the same thing when I find something good. I've had everyone of the delicious Thai curries. I dream about them . The pad Thai.. 5 stars. The rice and seafood dishes are wonderful. Do yourself a favor and ask for the garlic chili condiment they serve in the little silver bowls. I put it on everything. I can't get enough."}
{"text":"My experience with Thai food was pretty much limited to Pad Thai from food trucks before I went here.  I had some pho with various meats and it was delicious! The portion was large and came with some basil, sprouts, onions, and peppers on a side plate so I could customize it to my taste. I also had the spring rolls with plum sauce and they were so fresh and yummy. Not a ton of atmosphere in the small dining area, but ,hey, I wasn't going there for the ambiance anyway."}
{"text":"We stopped by here because the Indian place, Haveli, on the corner was closed. Thai Noodles was not satisfying.  I ordered Pad Z You per the recommendation from the review below. The noodles weren't fully cooked and the heat (temperature) throughout the dish was inconsistent, as if they threw the dish in the microwave and served it. The beef was tender, though. My friends were much more hungry than I was and finished their dishes. Drunken Noodles ams Green Curry. I checked in using the yelp offer for a free tea and they charged me for it. She returned the money in cash after I asked, which was nice. I wouldn't be returning."}
{"text":"This place has good pho (by Madison standards) and delicious chicken wings. The pho is a bit pricey at $11 but the flavor of the broth is good and they don't scrimp as much on the meat like other pho restaurants in Madison.  A friend ordered the drunken noodles dish and it wasn't until it was served that we recalled that we had ordered this same dish once before, years ago, and it hasn't changed for the better. Like other reviews have mentioned, it's supposed to be a stir fry dish and is a soup instead.   Service is slow and doesn't come out in a particular order.    Downgrading 1 star (4 to 3) because the customer service is not good. I have been back several times and it has not improved. Our waiters are usually nice but the owner is not. Restaurant 101: be kind to your customers. They don't have to eat at your restaurant."}
{"text":"Haven't eaten here in a while. Love the larb and the panang curry. Service was \"laid back\" and atmosphere was deli-like, but the food was awesome."}
{"text":"Why, Why, Why haven't I been here before? We stopped in before a movie at New Vision down the street. The small dining room offers seating for a few tables and they have take out also. I read a Yelp review about their Pad Panang and needed to try it. I ordered it with chicken and a Thai iced tea. The Thai tea was so flavorful and refreshing. It was not overly sweet and had the right amount of cream in it. That plate of chicken pad panang was really great! I added the side of jasmine rice to the plate and mixed it in. That was the best combination. It has just a hint of heat. They serve a dispenser with hot spice options to add to your food. i sprinkled a little red pepper to the plate to kick it up a notch. WOW- I'll be back for more of this menu item! The two others with me both tried it and wanted to trade their plates with me. Both said that their meals were great, but that pad panang was really delicious.I could eat that sauce alone, it's so good. I snapped a photo of the Triple N bowl. It was packed with a variety of meats and veggies and smelled wonderful. There wasn't any of it left when we left, so my suspicion is that it was delicious too!"}
{"text":"Alright I've been holding back. I'll release the main reason I come here - PHO. Their egg rolls, great. Springs rolls, yummy. But the pho which is listed on their menu as khewtiew (which is how my family calls it - ding ding authenticity bell is ringing) is my favorite in Madtown. I get the beef pho (N5) with shrimp (about an extra $3). If you want to go really authentic try it with tripe (it's actually pretty tender - they know what they're doing). They also provide a variety of add-ons: basil, bean sprouts, onions, jalapeños, sambal, chili flakes, chili oil, sugar and lime. Plus soy and hoisin sauce to continue customizing your pho to your liking. But what makes their pho different from the others are the fresh ingredients and the amount of time they take in cooking the broths. Give it a try and you will notice the difference in flavor.  And always a Thai ice tea or coffee. Always. (This mention should probably be in the tips section).  The area is a cute, tiny space but can still accommodate a large group, as long as all the tables aren't already full."}
{"text":"I have very mixed feelings about this place.   When we walked in at first, I was almost positive that we had gotten the wrong address - even though the sign in front obviously said \"Thai Noodle\" - because the place looks nothing at all like a restaurant. It is literally an empty room with a few fold-up chairs/tables strewn around, a fridge in one corner, and the cash register at the other corner. Seriously, this place is NOT AT ALL an eat-in restaurant, and I think they would serve themselves better if they were to advertise themselves as solely a catering/take-out service.   Also, I took a peek into the back \"kitchen\", and I honestly wasn't sure where the cooking was being done. All I saw was a really dark, dirty looking room filled with empty vegetable boxes - plus maybe a glimpse of the one, lone cook in a white jacket. Hygiene, anyone?  Still, they had decent reviews from yelp and other websites, so I decided I'd give it a try. My friend ordered a chicken/rice dish and I ordered a padthai (my go-to thai dish), and it took us about 15 minutes to get the food.   My friend's chicken rice was delicious, but I thought my padthai was at most average. The noodles were a little overcooked and broken up into little pieces, which made it difficult to eat. Otherwise, nothing really stands out about the dish, although lemon juice helped brighten up the flavor.  I may try a few other dishes from Thai Noodle in the future, but I think Noodles&Company's pad thai is the clear winner on this side of Madison.  One redeeming factor: they have a bowl of DELICIOUS guava candy sitting at the cash register stand. I would have dumped the whole bowl of candy into my takeout bag if no one had been watching..."}
{"text":"BEST Thai in the Madison area, hands down. I've tried almost every Thai place around here and this is the clear winner in my eyes. The ingredients are always fresh and it's always excellent. I really don't understand the negative reviews on here. My husband and I eat here about once a week and it never disappoints. It appears to be family owned and operated. They will actually make the food spicy if you ask for it. Level 3 spicy is perfect for me. Can't recommend them enough!"}
{"text":"My daughter says the spring rolls are good, otherwise I'd go with two stars. \"Pad Z You\" had no flavor and the noodles were undercooked and seemed to be of the boxed variety. Egg was lumpy, like it came out of an Egg Beaters box. I never leave noodles behind, at least I never did until now. The spelling of the dish should have been my first clue. Curry was ok if watery."}
{"text":"Best Thai we have had yet! We are afraid to even try other Thai places because nothing yet has even compared! The food is always consistent all around. Me and my other half have been going to Thai Noodles for a couple years now and absolutely love it amazing staff, food and we always feel appreciated. Our favorites are seafood pho, shrimp rolls, spring rolls, chicken wings, duck, Thai tea and ginger tea. The sauce for the shrimp and spring rolls is amazing! Love this place"}
{"text":"Their Panang Chicken is the bomb. I love that they recently renovated to offer more seating and a patio! They also do a good job of delivering \"extra extra extra spicy. A spicy as you can make it!\" when requested.   I wish that they delivered, that's my only complaint."}
{"text":"I really like the food here - eat here at least a few times a year during lunch from work.  The waits can be a little long but, I've never experienced anything extreme or excessive.  They do have a small kitchen so if you go on a busy day, or they have a lot of take out orders, it can be more of a wait."}
{"text":"I always think - there must be MSG or some other delicious carcinogen in here to make it so good.   And then I think - oh well, it's worth it."}
{"text":"This is the second time I've been to this restaurant. My mom was craving Thai food so we chose Thai noodles. For drinks I ordered the Thai ice tea which was very delicious. Very flavorful but not too sweet. Mom ordered the hot ginger tea which she enjoyed.   For appetizer we ordered the Triangle Curry. The flavor was excellent. It had the unique Thai curry flavor. The exterior was a little on the thick side but I still liked the dish overall.   For our entrees I ordered the Pad Z You with shrimp. The shrimp was cooked just right and the rice noodles was just a little bit too al dente. I prefer that then too soft though.  Mom had the special: Tum Kha Noodle Soup with beef. She really liked the flavor of the spicy coconut soup. The beef flavor was not totally to her liking. She will order a different type of meat to try next time.  Overall, the service was excellent and the food was very good. Their portion sizes are pretty generous so we both had some leftover to take home to enjoy again. I would definitely come back again."}
{"text":"Consistent place and always left satisfied. I've ordered take out from here and dined in about 4 times. I find that I carved it if I didn't have it in a while. Fun fact: try the Chinese melon candies after you pay. They are delish.   Love the variety of noodles here, duh. I've tried saucy noodles, soup noodles and their curry with rice. All good and no complaints! My friends and family also love this place and their portions are very reasonable. Service is fine and I've never had a complaint. There's even a parking lot and they do accept credit card.   Great taste overall but their sauces do lean on the sweeter, stickier side that caters more to white people."}
{"text":"I wouldn't go back here for curry.  It's so weird that another reviewer mentioned them getting the thicker consistency of curry right.  I got the duck with red curry and it was barely thicker than water.  I've gone to every other place in town and this was as thin as it gets (go to Curry in the Box instead).  Good flavor at least."}
{"text":"Their ginger honey tea is fantastic! So delicious I wanted to order more to take home. I would come here just for their tea! Their Thai food is good but not amazing (but I'm comparing it to the great options we have where I live in the San Francisco Bay Area).  So, five stars for the tea and the great service."}
{"text":"We got a coupon in the mail, which in my mind, usually means the business isn't doing too hot and wants to gain more customers. Naturally, I looked this place up here and saw a few optimistic reviews, so I, too, was optimistic.  Originally, we had planned to go there and sit down to eat, but it was empty. We got there around 7:45pm. There was one dude outside putting the outdoor seating away, but no one was there to seat us. In the minutes that felt like forever that we were waiting around, we decided to get take out.  I ordered the Drunken Noodles with Beef. I thought I was going crazy because when I opened up my take out container, IT WAS SOUP. I am pretty sure Drunken Noodles is stir-fried, which it is supposed to be. I don't even know where all that water came from... My noodles were old; you know, when rice noodles are cooked, then drained, then re-boiled, it gets that gummy, chewy, gross texture. Also, the green beans in there were extra raw. It's not the desired \"element of crunch\" that gourmet chefs employ.  Going back to my coupon, I got free crab rangoons for spending $20. (My boyfriend ordered the special catfish, in case you were wondering why Drunken Noodles would be $20, but I did not want to try it.) I have to say, the crab rangoons were actually decent. No crab in it, but I can't really say there is crab in any other crab rangoon I've had. They were wrapped in wonton wraps but made into a triangle shape, which worked well.  So... seeing the number of Thai places here in Madison, I am reluctant to revisit this particular restaurant."}
{"text":"I wasn't impressed at all. I had their Shrimp Pad Thai and it was okay. Nothing that would bring me back.  Guess I'm spoiled getting great Thai food in CA..."}
{"text":"Decent Thai in Fitchburg. All things considered, it's a great restaurant. I have other Thai restaurants I prefer for various dishes but those aren't a five minute drive from my house.  Highlights: curry dishes are great. I love, love, love them.  Lowlights: pad thai could be better, not sure what it is, but I prefer other restaurants's take on it. Not bad at all though.  All said, a great non-chain option for Fitchburg folks, and we certainly need more of those."}
{"text":"I love that they have vegan options. Their food is very authentic and flavorful. I think their prices are reasonable as well. The one complaint I have is that the guy that works at the front desk is rude. He never says \"thank you\" and acts like he doesn't want to be there and I am an annoyance for coming in. Although I love their food I feel that the attitude of the man at the front desk makes it so that I will likely just go to Curry in the Box instead as they are much friendlier."}
{"text":"since we share the same ethnic background as the owners of this place, i can make a lot of these foods on my own at home. that being said, when i'm not in the mood to make thai food from scratch, we always go here. i don't mind the seating arrangement of the place since it reminds me of the places in thailand that have awesome food, but are probably way dirtier. whenever they ask us how spicy we want it, we have to say we want it southeast asian spicy so there's a kick to the food, like how we'd make it at home! the following are all good dishes in my opinion: duck curry, pad thai, papaya salad, sticky rice, pad z you, and chicken masamun.  i don't remember having other dishes, but all of these are good and filling.   definitely worth checking out for some quick and cheap thai food."}
