{"text":"Truly one of the most HORRENDOUS restaurants I have ever tried. The fried wonton did not look like the picture in the menu. They were tiny and burnt at the edges but MIRACULOUSLY the insides didn't even appear cooked. Burnt seemed to be the theme of the day. My chicken/'porkchop dish appeared late (the waitor completely forgot the order) and came out black and charred. My dog would have refused this dish. My companion who ordered the pho was served crispy 'stuck-together' noodles. Is this the new style of Pho? The beef in a vermicelli dish we ordered was also charred to the max. 
Save your money and go to Popeye's in the same complex. Trust me, your stomach will thank you."}
{"text":"I have no Childhood Memories of Banh Cuon but at least having it here I now can have Adulthood Memories temporarily until Alzhemiers in a few years.  I got a few other memories from Thang Long as well that are less pleasant unfortunately.  I also hope they will make some adjustments to some Menu items.  2.5'd

4 Large Prima LCD, 1 Small LCD, 1 Projector accompany the Karaoke scale Speakers attached near the ceiling.  While eating they played Vietnamese Karaoke on TV with English Subtitles.  No, it was only afternoon so my Friend wasn't drunk enough yet to start breaking bowls and cups with her singing.   :P

Banh Cuon Thit Cha Lua($6.99) is my first taste of Banh Cuon(Vietnamese Rice Noodle Roll) outside of pre-packaged Grocery Market ones.  Fresh THIN steamed Rice Sheets does make a difference for the better. (+0.5 *Star*)

Pho Tai Name Ve Don($6.50) lacked in every category possible but as this is a somewhat new restaurant, I still wonder why this is the case.  We originally asked for a Pho Sot Vang(Beef Stewed Pho - Hanoi Style) but was notified the Beef was not ready yet this late afternoon.

Special Ha-Noi Vermicelli ($8.99) is both \"Meh, I've experienced better\" and currently indigestion-ing.  The Pork used was Pork Belly which came with Skin that are impossible to chew and digest.  The Meat of the Pork Belly was just as tough.  The Pork Patty was slightly better and the Rice Noodle were the thicker Vermicelli version.

The Banh Cuon did give my Friend her Childhood Memories which was a good way to prevent her from having her Pop Star Daydreams.   :D"}
{"text":"Thang Long is another Vietnamese Restaurant with Hanoi speciality  that opened up at the strip Mall right across from Vaughan Mills.

During the day it is a restaurant but at night Thang Long will be transformed to a Bar and Karaoke.. also specialized in Vietnamese pop songs just in case any of you guys want to drop by.

Inside is nicely decorated with 2 set of sofa and lounger and the front and the back of the restaurant. You will find yourself surrounded by TV.. yes this little place has 6 TVs and you will have a view no matter where you sit!

Special Ha-Noi Vermicelli ($8.99)
- This is the first time I ever has this dish so I have nothing to compare to. Grilled pork belly and pork patties soaked in fish sauce with Vermicelli and various lettuce, mint leaf and basil.
- The pork belly a little hard and chewy... maybe it is not fatty enough :) (gee I don't believe I said that!)

Pho Tai Name Ve Don - Medium rare Beef & Crispy Done Lightly Fat Beef ($6.50)
- Big disappointment... I don't think I will ever order Pho again here
- Soup based is really bland..just a hint of Beef flavour in the soup and not too many other.. no star anise is used..and is not served boiling hot...
- Noodle is the package dried type...
- Beef is tough and overcooked.. Crispy done Lightly Fat Beef? don't see or taste any fat.. and is mighty chewy

Banh Cuon Thit Cha Lua -Steam Rice Roll with Pork ($6.99)
- The best dish we ordered... thinly steamed rice sheet rolled in with shredded pork and wood ear mushroom topped with fried shallots. Nicely done and bring back a lot of childhood memory....

Service here is friendly and nice. Vietnamese pop song and karaoke video accompany us while we eat our lunch....

Nice environment and only if they would work on their cooking...

2.5 star"}
