{"text":"Best fast non-fast food in the city!  The service is amazing and Bev really does remember everyone's name and their favorites.  I always get #27 (shredded pork and spring rolls on vermicelli) - yum!"}
{"text":"Love it!  The people there are so nice. They move real quick. They are out to please. I went in because I really wanted bubble tea. They don't have tapioca in the winter so the owner made me with Jellies. It was pretty good. However once I got there,  and I had a taxi waiting outside...I decided I needed some noodles and shrimp take out! So she rushed it for me and wow, was it ever delicious!!!!!!  Will definitely go back!!"}
{"text":"Fantastic service, fantastic food. It has a dated feel on entry, but it's a factor made completely irrelevant once you taste the food and speak with your servers. For a very affordable price you get great vietnamese cuisine, from employees that are always smiling and making you feel they're actually happy to see you every time you walk in the door. Always worth a visit!"}
{"text":"I can't believe I've come here so often and have yet to write a review.

At the time when I first found this place, it was when I didn't frequent that part of town much and I was actually looking for Don's Photo to window shop or price-compare a piece of photography equipment I had my eye on.

At first, I thought my memory deceived me, but as I walked around back and saw the Don's Photo sign, I realized that I was in the right area and that Don's Photo no longer existed here in Calgary.

I noticed that Thanh Long was (relatively) new to the strip (at least to me), and being hungry (and slightly disappointed after coming all that way) decided to grab a bite there.

As many people have already indicated, service is the number one reason why this place rocks.  They really care about their customers, and as I've sat and watched, are on a first name basis with some of the regulars.

Each pho place makes their broth differently, and the broth here suits my taste well.  I've tried their combo rice plate, and it too was scrumptious.

My only wish is that this place were open later, but you can't complain too much when it comes to the independent, family-run places.

With reasonable prices (especially when considering other food establishments on 17th Ave) and fantastic service, I hope this business sticks around for a long time to come."}
{"text":"People need to stop adding stars for service. I don't care how good it is, the food here is rubbish. Skip this one, you can do better."}
{"text":"Best Vietnamese food in the city.  Vermecelli is out of this world!  Boyfriend likes the beef soup.  Customer service doesn't get ANY better.  Lovely ladies (owners) take pride in their business and put names to faces if you've been there more than once!  Not often you see that in Calgary.  

We go once or twice a month, she calls us by name and asks about how we're doing and remembers our conversations from the last visit.  Love this business."}
{"text":"Friendly staff, but food was decidedly underwhelming. I ordered #27 based on a recommendation. Got some very sad-looking mystery meat plus a very few veggies on top of some noodles. Nothing in the experience said they were interested in providing good food, nothing approached the average meal experience you'd get anywhere in town. Oh well, lots of other choices on that street."}
{"text":"This has become my favorite place for Pho!  Its not just the food!

The food is excellent! Which is a big reason we keep coming back.  I always have a vermicelli bowl and my wife has been having the spring rolls.  They are always excellent!

When we're out eating at a different Pho restaurant we always compare it to the food here. This IMHO is the gold standard of Pho!

Then it comes down to staff.  Once you come in a couple times they come by the table to chat. They get to know your names.  They even (if you're like me and you find something you really like and order it a couple times in a row) they even remember what you order and ask if you are going to have the same thing. 

I always feel welcome like I'm coming into eat with friends.  They call out to you and say Hi!  Its like being Norm from Cheers (maybe that is dating me a bit but i hope you get the point). 

Take the time enjoy this location. Its well worth it!"}
{"text":"Went for the first time a few weeks ago and had one of the best Pork Vermicelli dishes I've had in a long time.  Went again today and had the rare beef soup, which was not as flavourful as I would have hoped, based on my previous experience.  The spring rolls today also seemed a bit dry, but I liked them last time.  Overall, I'd go again."}
{"text":"Great service with average food. 

Went here today because of the outstanding reviews. The food was pretty average to be honest but the service was great. Super friendly and attentive.

Great option if you're in the neighborhood and looking for something quick."}
{"text":"Best Pho in Calgary! Seriously. And it's not just the food, it's the service, Bev - who is the owner, I think. Is SO nice, and she remembers your name, and your order after you have been in a few times. The food comes out quickly, and the servers are always attentive, friendly, and quirky. 
I'm almost reluctant to give it a good review only because I don't want all of Calgary to start showing up and taking over my lunch at my favorite pho place! Lol."}
{"text":"This is my favorite Vietnamese west of forest lawn. Beverly is amazing! She's the real reason that we keep coming back. She always knows what my husband & I want. I always order a 28 beef with half the noodles which she is happy to customize for me."}
{"text":"I've only got take out from this place once and I ordered the chicken sate noodle soup and it didn't taste anything like a sate. Really bland broth with no flavour. There may be other dishes here that redeem the place though!"}
{"text":"One of the best neighborhood Asian restaurants in the beltline, if not Calgary. Bev is a sweetheart and the food rarely disappoints. Nothing fancy but It doesn't try to be. Just good solid value at a clean and friendly place on the trendy and expensive 17 Ave strip. My partner is an Asian chef at a major hotel in the city. This is our favorite neighborhood resto. To go or to stay, all good."}
{"text":"I got a stir fry dish to go. It was prepared quickly, the serving was generous, and they even asked if all veggies were okay on it. I would return."}
{"text":"This is the best Vietnamese place I've eaten at, pho sure. 
(sorry, I couldn't resist)

I love the vegetarian pho. Big chunks of vegetables and tofu and lots of noodles. They will make it spicy for you if you ask. Their salad rolls are delicious as is the peanut sauce they come with. The mango bubble tea is also quite yummy.

The staff here is wonderful. Bev (the owner) suggested I get the medium rather than the large bowl of pho and she was right. I was full after the medium. They come back to check on you and your water glass is always full. The staff know a lot of the people that come in by name and it feels very close-knit.

The prices are extremely reasonable. You come out feeling full and happy that you didn't spend a ton of money. 

I highly recommend this restaurant. I've been here a few times and have never been disappointed. I plan on having the staff know my name too!"}
{"text":"Stopped in because the location was convenient while running some errands and picked up a bowl of Satay Beef Soup to go. The restaurant was very clean and had a retro feeling to the decor, complete with old-timey metal diner style napkin dispensers. My order was taken quickly and they took the time to offer me a few options so that it would be just right. (For their regular presentation the beef in this dish is offered raw, however they provide the option to have it cooked a little if that is your preference). 


When I got home, I was so pleased to find generous portions of fresh, delicious food. The taste was great, the veggies, limes and herbs fresh and crisp, the beef was tender and flavourful and just melted in my mouth. The other thing I liked about their takeout was the dish they provided. It is a dish that would be easy to use if one ordered it for an office lunch/dinner or if dishes were not an option, and was not the standard takeout offering other places provide. A nice touch! The prices are really reasonable. It is definitely my new favourite place on 17th Avenue for Vietnamese!"}
{"text":"Sadly, the pho was pretty bad, very disappointing, it was such a nice place, hostess was great! The soup base was just, blah, tasted like canned soup, ahhh, I am sad that their quality is so low."}
{"text":"Is it weird that I like this place mainly because of the service?  They have amazing staffs there.  They are friendly and they are quick!  And the lady (I think she's the owner) is amazing.  She knows her customers by name!  This is what keeps me going back to this restaurant.  I mean, the food is ok.  It's hit and miss.  Then again even if it's a miss, it's pho...how bad can it be really?"}
{"text":"A 5 for service, but only a 3 for food. I had the beef satay noodle bowl. Nothing special about it, in fact the beef wasn't all that great. Nonetheless the owner was extremely nice and very attentive - she made us feel very welcome."}
{"text":"What a terrible experience.I strongly recommend avoiding this place. 

I ordered a noodle dish and my friend had a soup. Mine came with peanuts which I asked not to have any nuts. My friend ordered extra meat and his came with half of what mine did. 

When we asked about the extra meat they said \"$3 doesn't get you much, it's expensive. We give you one or two small extra chunks\" it went from there to \"Next time don;t order extra meat if you aren't happy about it.\" to \"Meat is expensive we don;t give much extra for $3.\" The owners are incredibly rude and really need to take the attitude down a notch. 

I used the washroom while i was there and it smelled like a porta potty. I asked if they had ever cleaned it and she said no. 

I'd strongly recommend not going to this place."}
{"text":"Skip it.  This is one of the worst places to have pho.  The broth is flavorless...if you're a PHOnadic then you'll know what I mean. To add insult to injury, there's hardly any meat.  This is the caliber I'd expect from a Chinese/Vietnamese or Vietnamese/fusion place but not a full blown Vietnamese restaurant!"}
{"text":"As don't live too far away, dropped in Thanh Long and with the help of outgoing co-owner Beverley dipped into yet another sate pho beef, and found the small flat noodles and beef strips to be nicely cooked. But even after asking for full-bodied broth, it still came out weak. So I audaciously added some leftover peanut sauce and their thick brown sauce with some black pepper, and, although that helped, found it still not all that flavourful. You see, I should not have to doctor any pho too much for flavour: but by experience I've come to know great from passable...

As well, tried their fresh shrimp/veg spring rolls, but they were only okay: they were quite large, and the shrimp, thin noodles and shredded cabbage tender but flavourless. Without the peanut sauce, would be just so boring. No complaints but really no wows either. Just okay. 

Beverley and I had a conversation about the palate of Canadians, and she seems to still marvel at how bland their tastes are. That is probably why the 'sate' beef is neither satiating or sauteed (smile). Yes, one will leave full, but on broth and not necessarily on flavour.

On the plus side, their prices are a bit lower than the standard and the portion just as large as many. Hence that it's a good meal.

Thanh Long is better than many of their competition, but not at all compared to True Contemporary Viet on 8th Ave. SW on the northside of the tracks downtown. Perhaps worth a return, still only 3.25 stars at best."}
{"text":"Dinner time. Check Yelp. Phone dead. UH OH! 
Time to gamble... I put my one coin into the slot and pulled the lever. TOTAL JACKPOT!

Tanh Long has got that 90's hotel crossed with kind of a seniors home feel on the inside. I found out in a few moments that it didn't matter at all - it's a warm, clean place to eat delicious vietnamese food from the nicest people!

I got a pork and vermicelli bowl and just wolfed it down. I tried to make excuses that it was because we were in a rush (which we were) and had a show to be at (which we did) but really, I think it was still just an excuse for me to stuff my face with fresh tasting food faster than humanly possible

Throughout my meal I went from uncertain, if not a little skeptical, to raving about how lovely the people working here are! Please go. It's one of those small local businesses that you feel so good for supporting and you can really tell how much they appreciate it."}
{"text":"Best vietnamese in calgary. 
 the fish saice is fishy, wontons are real, spring rolls are good,  pho to go is best,  gave me the meat so I can cook it rare how I like it for dinner tomorow"}
{"text":"If you're on 17th ave and you're craving Pho on the cheap then come to this restaurant. It's the standard Pho fare. The broth is excellent. I asked the staff about the broth and was told it takes all night to make, which is standard. Unlike many Vietnamese restaurant's where they bring you your food and never come back the service here is really quite good. They seem to appreciate their customers."}
{"text":"I have had pho at over a hundred pho restaurants and this place was average.  I got bored of the broth quickly which had a bit of a different flavor that typical pho.  The noodles were a bit soft and the beef was not sliced thin (but still good).  Maybe good for Calgary, but wouldnt survive in a more competitive area.  Still a somewhat enjoyable meal."}
{"text":"This Pho location on 17th avenue does a mean Pho; and although it is a little steeper in price and it isn't the most spectacular Pho that I have ever had, what separates this Pho house from the rest is the extremely amazing service.  The wait staff here are amazing, the place really needs to be experienced, the food and the rest are just icing on the cake in this yelper's experience."}
{"text":"I've been here twice so far and plan on coming back again. Really liked the sate beef noodle soup."}
{"text":"There are several pho places by my apt on 17th but this is the only one that keeps me coming back. Great service. Friendly staff that remembers me and my orders. Amazing veggie pho with beef broth. I highly recommend this establishment."}
{"text":"Alright, my server alone gets 5 stars. She was adorable!! Always attentive, and just a wee bit quirky making jokes and the like. Like with one of the other tables in the restaurant, a lady and her friend had settled in at a table near the window and then decided they wanted to move to the back of the restaurant. \"Sorry to complicate things!\" the lady said. \"Oh, don't worry about it. Life is already complicated!\" our server joked in return.

As for my food, I got my usual grilled pork on vermicelli with spring rolls, here it's #27. The spring rolls were hot, crispy and fresh! And it all came out of the kitchen pretty quickly. As per usual, there were way more noodles than I could finish, but I ate up every last piece of pork, spring roll and tried to get as many sprouts out of there as I could. Gotta get my veggies in after all!

Only downfall I can see here? They're closed on Sundays."}
{"text":"It was OK. 
Service is good though, they are friendly and it seems as though they get a lot of regulars.
I like that there's parking right in front which is what brought me here in the first place."}
{"text":"I was in Calgary this past weekend and stayed at the nearby Hotel Elan (awesome too). I walked over here Friday night and had #29 - it was amazing! So much food for the price - better then expected. It was so good, I returned the following night for the same dish. Super friendly staff.

Highly recommend #29"}
{"text":"This little place has soups, noodles and stir fry that is both hearty and light on the wallet. I think there are three ladies who work full time and they are all extremely pleasant and professional. The dumplings are pretty decent too. 

I always leave full and that's usually with just the smaller bowl; I'm not a small eater. 

If you're looking for a quieter, friendly Asian culinary experience, I recommend it. I think they've got a lunch special or two as well."}
{"text":"I actually can't say enough about this place. 

Located a few blocks from my home, this has become my go-to \"I don't want to cook\" spot. The staff is so lovely and friendly, you feel like you're walking into your mother's kitchen...if your mother was the owner of a Vietnamese restaurant and knew that you like all your dishes spicy with extra vegetables. 

I always have either Spicy Vegetable Soup or the Stir Fried Tofu. Delicious. Inexpensive. 

Go. There. Now."}
