{"text":"Stopped in with time to kill in FH and decided to give it a try. Not only met, but exceeded expectations. Menu choices were broad, but not overwhelming. Food was quick and delicious. Wine and beer selection wasn't huge, but more than satisfying, including bottles and on tap beer as well as wine. Staff was very friendly. I'll be back."}
{"text":"If you haven't been here yet, I highly recommend that you try it.  The pizza dough is very tasty and you can tell he uses the freshest ingredients.  It reminds me of a local pizza joint back home in Chicago.   The staff and owner are extremely nice and social."}
{"text":"We really like this place! The first time I attempted to order delivery the lady stated they are unable to deliver. Just as well we were living right across the street and walked over to pick up. The white pizza we ordered was fresh and some of the best we have ever had! Even the kids liked it which says a lot. Now that we moved to the opposite side of town hoping they offer delivery in the future! Totally worth the visit!"}
{"text":"Great Pizza and staff! The Tiramisu is pretty good too!"}
{"text":"One of the cheesiest and tastiest slices I have had in Arizona. 2 cheese slices and a drink for $5 and some change. Well done, That Guys Pizza"}
{"text":"My husband and I have been here over 4 times since opening. We have never had a bad experience. You walk though the door and they are happy to see you and very helpful if your are unfamiliar with menu. Food is fresh and hot. We will be eating here on a weekly basis, weather lunch or dinner."}
{"text":"The best pizza in the area hands down!  Everything is made from scratch, all of the ingredients are fresh, and all for a reasonable price.  Drea was a doll helping us with our selection.  If you are craving pizza and Italian food, this is where you want to be and youll thank me later."}
{"text":"What a great find  New restaurant. We had the pepperoni pinwheel as an appetizer. Just delicious; beautiful crust encasing mozzarella and pepperoni with marinara dipping sauce. Their pizzas  are huge and tasty. Need to come back and try their homemade tarimisu. Staff warm and friendly which is what you would expect from a family owned restaurant.  Thanks Drea for a great meal. We will be back. They deliver too."}
{"text":"SAD,the FOOD and SERVICE has taken a DRAMATIC PLUNGE DOWNHILL IN THE PAST FEW MONTHS. I ordered a soda with my meal only to find out when I attempt to fill the cup that it is out. Upon informing staff I'm told they won't receive the soda order until Friday, its the beginning of the week! Not just one flavor is out but 3, with no sign to indicate that on the machine or the staff informing you before you pay.  Another trip I attempt to order the special (slice,side salad & drink) only to be told they don't have any lettuce since they only sold one side salad! What does this mean anyways? If you only sold one salad there should be plenty of lettuce, or are you not providing salad anymore since you aren't selling enough?  Constantly out of chicken, or substituting a different type that is no where near the quality. I'm very sad as I LOVED THAT GUYS PIZZA WHEN THEY OPENED!!"}
{"text":"This place is a joke. Terrible customer service on the phone and when we order delivery it's a two hour wait. This is the second time we experienced this.  It's like they don't want us to buy their pizza."}
{"text":"When they first opened up What great pizza. A month ago picked up a pizza which was soggy with very little,sausage, onion and mushroom which seemed to be sitting in the middle of the pizza and us eating pizza dough beyond the middle. Sad, as they were so good in the beginning. Yesterday we went there for dinner, had sphagetti which had been good before. We ordered sphagetti with meat sauce. The portion was nice sized with huge chunks of sausage. It seemed obvious that marinara sauce was the base and just chunks of sausage added to make the meat sauce. What was really sad is the sauce had more sausage in it then the large pizza we picked a month ago."}
{"text":"We ordered a cheese pizza. The crust was limp and the pizza bottom not fully cooked. If you want real Italian pizza in the valley, you must go to Bianco's."}
{"text":"Omg so much grease! It's was dripping off every slice. There was so much sauce and we requested light sauce. I'm scared to think what normal would look like. The garlic knots were bland. A waste of time and money."}
{"text":"Gave this pizza place a few tries-knew it was no longer Redendo's. Pizza each time was greasy on top and underneath, dough undercooked. Called to let them know, young female said she was sorry, nothing else offered. Disappointed, used to be our favorite pizza place. Won't go back."}
{"text":"1st time here. I thought the pizza was really good. We got the margarita and a bacon + pepperoni. Everyone has an opinion when comes to pizza but this one was made the way I like it. Employees were really friendly and my boys watched them toss pizza. I would highly recommend this pizza joint and will be back."}
{"text":"What a great find. A unique and friendly pizza shop offering fresh quality dishes. Love the Huge NY slices !"}
{"text":"New name, new ownership, new attitude, and new menu!!  I didn't call ahead. I just came in and ordered. Took about 15 minutes. Pizza was hot, cooked just right, and the ingredients tasted fresh!  And to top it off, they even cut the pizza the correct way, unlike so many Arizona pizza joints who insist on cutting pizza in child like bite size squares.  (Seriously. I've lived in over 15 different states and have never seen that unless it was a rectangular party type pizza).   fountain hills finally has a fantastic pizza delivery option!"}
{"text":"Too bad stop in order barberry sandwich hold the oil and and mayo and mustard sorry no English gyro shop next door speaks English"}
{"text":"Really excellent pizza. Very cheesy. Tasty sauce. And all the fixings including garlic, oregano, red peppers and Parmesan cheese. For a little hole in the wall the quality and taste really impressed me. If you are on the way to Payson or heading north on the 87 from Phoenix this is a great place to stop and grab a bite."}
{"text":"On the spur of the moment we decided to try their pizza delivery.   We were delighted with the order taking process and speed and professionalism of delivery.  More importantly the pizza was pretty good!"}
{"text":"Tried this place and customer service was horrible!! Workers were rude and lazy. I ordered a small salad, wings and a couple slices of pizza. They told me they were out of wings and pizza!! The employee said they dont want to make anymore since they will be closing in an hour. Seriously!! I will never go back and will suggest to family, friends and co-workers not go there."}
{"text":"First time here, and we ordered a large Grand Hawaiian pizza and added jalapeños and mushrooms and also ordered the garlic knots. SUPER delicious, will definitely come back to try some other things. We live in Arcadia area and it was totally worth the drive. Yum!"}
{"text":"Ate here for the first time last night. Excellent food and super friendly staff. The margarita pizza reminded us of Italy - best in a long time. Will definitely make this a regular stop!"}
{"text":"We have ordered here since it opened. It used to be fast and good. It seems like the bottom has fallen out of the business.  Half of the time they don't even answer the phone during business hours anymore.  Tonight we ordered the exact same thing as on multiple occasions but the lady who answered the phone could not understand English and the whole conversation was difficult.  We were nervous that we might get the wrong order.  Well, not to worry! We didn't get anything. She never put the order in!  So there we are, an hour later, re-ordering our meal.    Finally, (40 min later) the order arrives.  They give us 20% discount and we are ready to eat and get on with our night, only to discover they got our order wrong! So the cheese pizza is now covered with tons of toppings that were supposed to be in the hot sandwich for my husband (which is missing) and my daughter can't eat it because of allergies.    I try to call and end up getting the same non-English speaking woman on the phone who couldn't even understand enough to write my phone number down for the manager.  I told her I would call back when the manager was expected.  I called back multiple times with no answer.  Finally we get through and demand the charge be voided. We can't get another pizza because it is now 9 pm and kinda starving. Thanks That Guy, I will never call you for food again."}
{"text":"Yum!  Generous fresh toppings on the pizza. Very tasty. The antipasto salad was very fresh and good.  Pleasant service and reasonable price.  Plan to return to try other menu items."}
{"text":"Great calzones and even better service. Very welcoming and friendly! Plus large portions."}
{"text":"Had a terrible experience and never got a response, as some others did, after posting review. I guess they thought since I was staying in motel that they weren't losing any future business. WRONG?  Bought a house in Fountain Hills and now I order from Rosati's, which makes a far superior pizza and has great delivery guys. So, that $30.00 has cost you a couple of hundred so far."}
{"text":"Best pizza around and reasonably priced. Highly recommend you try this place.  They also make calzones and salads.  Location is convenient on the way into Fountain Hills or out from Shay to Hwy 87"}
{"text":"When it first opened the food Was great. But unfortunately, it seems to be going downhill. They started serving Pepsi, which I can't stand. The meatballs where fantastic. Now it seems like you're going cheaper which is made the food quality not to par. I will never eat here again."}
{"text":"First time to the restaurant. The pizza was amazing, I loved the garlic knots with ranch."}
{"text":"A little pricey for subs, first time here not a bad first impression! I got a beehive and a side of fries, which the fries were super crunchy and thin, nothing to new or astonishing but a great bite to grab with friends or during lunch break. Would visit again to try some more!"}
{"text":"Normally I don't write negative reviews, however, it bugs me that everyone is raving about this place on Yelp and Facebook.  Apparently there are not many people in Fountain Hills that have had good pizza.  I tried this place right after they opened and took one bite of the pizza and threw it away.  There was no sauce, the sausage was super greasy and tasted awful!  I thought maybe my experience was just while they were working out the kinks.  So.... I tried them again last week and it was just as gross!  Still, no sauce, weird sausage, cheap pepperoni.  And, above all that, it was so greasy, it melted a hole in the bottom of the pizza box....who wants to put that in their stomach???? I gave them 2 stars instead of 1 because the restaurant was very clean and I love the remodel.  But they will not be getting a third chance from me!"}
{"text":"It would behoove anyone who is a thin-crust, Hawaiian pizza super-fan to buy pie here. It is magnificent. Truly.  I'm no \"pizza connoisseur\" or anything but am pretty selective with dough/crust, sauce, goodies on top, cheese, etc. It is blazingly obvious that this establishment uses quality product as they certainly yield a heavenly treat!  We ordered their garlic knots too, but the pizza was so intoxicating that I saved stomach real estate for pizza.   But, it is quite dangerous as it's a mere 5 min drive from my home. I must eat in moderation here. Plus, our town always welcomes awesome, newer businesses.  That Guy: You have captured my heart. Great job."}
{"text":"I called on a Friday evening multiple times and no one answered. Then called late afternoon on a Sunday and no one answered. I was referred by a friend so I checked to see if they were even still open. She said yes but also told me that she had picked up dough to make something at home and was told they \"didn't have a very good batch of dough that day\". I finally got through on another Friday evening.  There were literally pools of grease on the pizza when we got home.  Pizza is greasy, I get it, but to find puddles of grease throughout is a little much. That was gross and turned me off for good."}
{"text":"I feel like I'm being generous with 4 stars, I'd like to go a 3.5. The staff was super friendly. The place is clean. It was smaller than I expected (We never visited during the old ownership). They had a couple of TVs tuned to college football, that's always good! The pizza had good flavor and a decent amount of toppings. We just prefer a crispier crust.   We'll go back, for sure. Will give them another try 'as is' before we request that the make the crust crispier."}
{"text":"Who's That Guy? Whoever he is, I'm glad he offers giant slices of pizza for the Fountain Hills area! We ordered a slice of pepperoni, a slice of sausage pizza, and toasted ravioli with marinara sauce. The slices were sizable and toppings very generous. The actual pizza though has a thin but softer crust which makes it more foldable. I personally would have liked a little more crispness of the crust to provide more texture difference.  The toasted ravioli was the favorite part of the meal. They were breaded morsels filled with ricotta and bits of jalapeno. I loved that extra addition of spicy pepper to give the meal a little kick.   Service was friendly and cheerful. Overall, not bad!"}
{"text":"I finally found a really good pizza restaurant in Fountain Hills. Ordered 2 extremely large slices with cheese, olives sausage and mushrooms. With Senior discount was 7.99 I could only eat 1.5 slices so big and filling Open til 10 on weekends and they deliver. Mike the owner is very friendly"}
{"text":"I ordered a medium pizza and a dozen wings. The pizza was very soggy in the middle roughly 50 % of the pizza. Pizza was way too greasy,  you will need a degreaser to get your hands clean when done. The hot wings had way too much breading . Will never go back, should have gone to Pizza Hut."}
{"text":"Nice people and great salads coupled with New York style pizza & the famous black and white cookies shipped directly to AZ on a weekly basis.  One of the best places in Fountain Hills for great salads, Pizza and Cookies Feels like you are back in New York"}
{"text":"Wish I had the great experience others were having. Been here 3 or 4 times for takeout since they opened and have yet to get a pizza with a fully cooked crust."}
{"text":"Best pizza in FH and probably best in the valley. They're one of the few places who still feel like they actually try. Juicy, authentic, and quick, they've never disappointed. 2 topping large for $13.15. You can't beat that."}
{"text":"I was really hungry so I thought I would give this place a try.  Well it reminded me of the pizza they sell in gas stations. $5 for 2 slices and a drink.  Enough said."}
{"text":"Great place to eat in or take out... plus they deliver!! I am from the east coast, my husband is from Chicago so our pizza standards are high ...this pizza was delicious everyone is friendly and they have a great selection of beer in bottles and tap as well as some nice wines brand-new interior super comfy booths to sit in fun atmosphere for a small restaurant you will just love it I highly recommend!"}
{"text":"This is real authentic NY style pizza.  Delicious Italian food.  Great spot when I'm in town to satisfy a pizza craving.  Nice people here too.  Great desserts too - love that NY black and white cookie.  I never see those anywhere."}
{"text":"What an extraordinary find!  This is far more than simply a pizza place.  Though the cheese pizza I had was the best I've had in F.H.  The crust was chewy without being soggy.  There was enough cheese to make even a Wisconsin cheese head happy.  Just the right amount without being too rich.  The service was excellent.  It's obvious the owners want to provide personal as well as personable service.  Count me satisfied in that regard.  The menu, beyond pizza looks terrific.  While I was enjoying my pizza, several people came in for take out orders.    It's important to note here that delivery is now an option.    Their menu includes pasta, sub sandwiches, salads and several tempting dessert options.  Something for the pickiest of family members.  The best part is that I got two huge slices of pizza and a drink for less than $6.  I took a menu so I can try other items to be delivered.  This is not some chain restaurant.  It's  locally owned and operated.   Like Arnold says...I'll be back."}
{"text":"Inexpensive and generous fresh hot slice & fresh side salad (had croutons,BLK olives, fresh tomato,lettuce) & drink $4.99. Was delicious.  Black & White cookie from NYC....bellisimo.  Patience is required, but in my opinion worth it.  I do not know who he was to the biz BUT the young man there is trying to do the job of 3-4 others. Unfortunately his two workers were not of much help to him but we're trying w/ sweat &  -but makung him double ck on their orders too.   SOOOO...Advice: try the slice special, just do not expect in 5mins,more like10mins.   He has HELP WANTED pisted uf you know of any able & hard working - could be super."}
{"text":"Placed a \"to go\" order with these guys a while back. The person who answered the phone was pleasant and responsive. The food was ready on time and was packaged neatly. Portion size was fine. And with all of that, the food wasn't really all that good.   To be fair, it was a \"to go\" order, and the sides weren't bad. The pizza, however, was greasy (like a puddle of grease), floppy, salty, and just \"meh.\" It reminded me of cheap pizza that would be served at a kid's party. I should have taken a picture of the pizza I got because it didn't look anything close to the appetizing pictures that were uploaded to Yelp. Maybe I just got a bad pizza. I don't know, but I won't be back.   The service is better than Redondo's (I think they are also less expensive), but the pizza quality took a nose dive.   With the service we received, I'd still encourage you to give them a shot--just try something other than the pizza."}
