{"text":"Reasonable prices, fast & friendly service. Accommodated my custom order to perfection. For fast food, this is fantastic thai. 

For out-of-towners, there are English menus available and the cashier spoke great English."}
{"text":"Personnel agréable, service rapide et endroit propre. Il y a tout ce qu'on est en droit d'attendre d'un Thaï Express."}
{"text":"Not proud of the little salad. Maude loved the pad thai. Simone didn't have anything to eat. I do recommend this restaurant but do not take the little big salad."}
{"text":"I ordered a number 5 (Fried rice, carrots onions with beef pineapple and tomato) for take out. The entree was $9.58 and all I received was one standard size container filled with mostly fried rice and a very little amount of beef. In the restaurant business you get to serve someone just one bad meal - I won't be back."}
{"text":"J'ai découvert ce restaurant cet été. J'avais un été chargé et l'appétit n'était pas au rendez-vous. Je suis allée là, prenant un repas sur le pouce. Une des plus belles surprises de ma vie. Pour l'instant, je n'ai découvert que le riz frit thai épicé, au poisson, au boeuf, la salade de mangue, etc...

J'y retourne régulièrement. Je suis devenue accro. Très peu coûteux. +/- 11.50$ le riz frit au poisson thai. Mais les portions sont tellement énormes qu'on en a pour 2 ou 3. Je devrais me décider à découvrir autre chose sur leur menu mais j'aime trop leur riz frit thai.

Service rapide, courtoix, efficace. Mon gros, et j'insiste GROS coup de coeur.  Un must."}
{"text":"It's been over 3 years that I haven't eaten at a Thai Express. Back then, I would eat at Thai Express at least once a week, either pad thai chicken or the general thai.  After 3 years, suddenly had a craving for a general thai...

Went to the one nearest from work... I was disappointed.  I ordered spicy, but it wasn't spicy at all. The chicken were very dry and chewy... They were probably fried over and over.  The rice full of sauce tasted something like general thai, but the chicken itself was tasteless...

Some might say: \"What do you expect from a fast food?\" Well, If I had it better at other Thai Express, I'm sure they could do better!

Also, only debit or cash!"}
{"text":"Two stars for the service.  The cashier was super friendly and efficient.  I ordered the sweet & sour chicken with rice.  Perhaps I should have ordered noodles because the rice was overcooked and clumpy.  My stir fry contained huge pieces of undercooked onion and a few hard carrots-- nothing else.  The sweet& sour sauce had a slightly fishy flavor and overall was inedible and unappetizing. I've eaten at other Thai Expresses before and had better experiences."}
{"text":"Clean place to eat and fast service. The food was super good and spicy enough. Also very g9od price for the price.
No WiFi"}
{"text":"This Thai Express is situated in the Champlain Mail in Brossard. 
Ideal lunch break during your weekend shopping sprees. Thai Express is always an excellent choice in terms of portion to price ratio. It has a decent variety of choices and also they are vegetarian friendly.

This time I had the chance to try their daily special: Chili chili Bangkok. I took with tofus.
It's pad sew noodle with a Thai sauce. Mild spicy just enough to give it a little kick for the non spicy friendly people. You might have to ask for the spicy option if you're a spicy foodie. It has a decent amount of vegetables. The tofus might disappoint some but it's forgivable. 

Thai Express is an excellent stop for a fast Asian food craving fix.

Fun fact, did you know that Thai Express' take out boxes are microwaveable?"}
{"text":"These guys are scammers. Go somewhere else for lunch in the mall. Let me explain further...

I purchased a General Thai beef plate. I decided to make it a combo because I wanted a drink and the spring roll the combo came with. There is a sign on their fountain machine that it's not working. The combo would normally come with a fountain drink. Instead, they give you a bottled drink, but quietly charge you extra because it's a bottled drink, even though they can't give you a fountain drink. The sign posted has obviously been there a long time as the edges are curling and the tape is starting to peel off. Obviously they have no interest in fixing the fountain machine because it's in their best interest to sell the more expensive bottled pop.
Additionally, on their menu where the price would be to make a meal a combo is blank.

The beef pieces they give you are breaded, as seen in the attached picture. Places will do this to hide the fact that they're hardly giving you any beef. This is one of those places who do this and should be avoided."}
{"text":"Thai Express is a quick-service chain that offers Thai-influenced appetizers (imperial rolls and spring rolls), salads (mango, shrimp and noodle, and chicken and noodle), mini soups with noodles (tom yum soup and regular soup), quick stir-fries (tom yum, noodle soups made with chicken broth, curry (red, green, and yellow), fried rice, pad thai, and pad see ewe.  Located conveniently right off the Metro, we had seen ads after ads of this place, so we were curious in checking in out!  We tried the General Thai Beef (mango panko beef that were super crispy, covered in a sweet chili sauce, over steamed rice with tons of bell peppers; this was actually pretty good!  The sauce itself was thicker and coated the beef strips, the veggies, and the rice really well; rice was of the typical 'fast food' version where some bits were under- or overcooked), and the Pad See Ewe (we opted for the chicken; this was pretty inedible, as the noodles used were of such low quality; it was dried out, not cooked all the way through, and there was no sauce that dressed the chicken or the noodles; the dish was completely flavorless).  I really think I would get cravings for their General Thai Beef, and I sure would order it if was set as one of the options at a food court in a mall; I personally think it's better than the other quick-service Chinese joints.  The Thai influence isn't really there, but for something quick and freshly stir-fried, this place can really satisfy some hunger; they really stuff the take-out boxes (which the designs are pretty cute). The place itself is bright and has plenty of seats.  There's also some great music videos playing, so you can jam while stuffing your face.

+General Thai Beef
+quick-service 'Thai'-esque stir-fry joint
+located next to Subway"}
{"text":"3 visites à date et toujours frais et abordable. Les soupes thaïs disponibles en 2 formats sont délicieuses pour un fast food. Il est possible de prendre un combo. Petite soupe avec un rouleau printanier. Le stationnement est facile et c'est parfait pour une bouchée en magasinant."}
{"text":"This is not a bad Thai Express, it's actually a pretty standard one, but the food just isn't all that good - not the fault of the staff, I imagine, but of the chain itself. Everything's sweet and greasy, which - I'll be honest - is good when you feel like you just want to load up on delicious, greasy noodles, but it's not going to blow you away with taste or quality."}
{"text":"Décevant même avec des attentes réduites. Nourriture minimaliste au point où il n'y a que des nouilles et un bouillon insipide. J'ai cherché longtemps pour trouver les carottes râpée dans le bouillon. Tofu caoutchouteux cuit la veille. 

J'ai mangé dans d'autre restaurant de la chaîne qui m'avait surpris par la qualité des légumes... pas celui-ci. Allez vous acheter un sachet de nouille Ramen a la place..."}
{"text":"Bought tomyum soup and chicken smells as it was rotten. Returned the food and they gave the money back. Can't believe they actually serving rotten meat."}
{"text":"Nice people and food, nice environmental, comfortable sofa . I will be back soon . Thanks guys"}
{"text":"So cool to see a fast-food Thai place, available at many roadside stops in Quebec (maybe in other Canadian Provinces, too). 

This location is right next to a hamburger royalty joint. It was packed. This place, not so much. 

The food was a okay, not the best Asian food I have ever had, but such a more healthy alternative than burger and fries. 

I had Pad Sew which is often one of my favorites at other Thai places. This version had a decent flavor with quite a few noodles, out of proportion with everything else, not entirely uncommon with this dish, but it was noticeable. The noodles were not the typical wide and thin noodles I expect with this dish. 

But I loved that I could have healthier food right off the highway. There were some veggies and the chicken was good. The food was cooked and served quick.

My companion had a Thai soup but it was really more like Pho. Two thumbs up on that dish."}
