{"text":"This was our first time dining here and neither of us were impressed. My skillet was very bland and the turkey sausage had lots of cartilage in it. Gross. We won't be eating here again. Wish it was better since they're a local business and I like to support locally owned business but just can't do it."}
{"text":"Eddie is one of the most attentive, personable servers at this location. Ask for him and make the good egg experience even better."}
{"text":"We come every Subday morning with our children and Tarissa does an amazing job taking care of us. She's incredibly attentive and knowledgable as well as keeps us entertained with her sense of humor. She is by far one of the best servers we've had. Thank you Tarissa for everything and for keeping us company Sunday mornings! ;)  Stephanie, Anthony, Zoey and Gwen Weinberg"}
{"text":"I ordered the Chop Salad for lunch, it had chicken and avocado. It was eh... The chicken was not fresh- tasted/looked like it was quickly microwaved.  They used the wrong lettuce (HUGE disappointment) The citrus dressing was ok Wish the lettuce was right and the chicken was fresh. Will not be coming back unless it is the only breakfast spot available and closest to me."}
{"text":"Everything is great! Erik, the manager is exceptional! He goes out of his way to make customers feel like family. Ask for Kelly. She's very good at suggesting alternatives if you're looking for something a little different.   I love the Macho Nacho Benedict with barbacoa beef and more black beans (less potatoes). Fantastic!"}
{"text":"we had breakfast served by tarisa. she was so polite and kind.  she was very accommodating.  the food was good and served very timely.  there was no obnoxious background music being played.  we enjoyed our morning"}
{"text":"We haven't been to the Good Egg in a while but the changes made will ensure we never go back. The staff was pleasant and the food wasn't bad. But the menu has no more great side options for $1, the paper menus were stained and dirty. Both our glasses and those on the table behind us were dirty. Water was brought to us in a weird milk jug, not a pitcher. All the beloved Gunslinger sauces and jams are gone. They didn't even ask what jam I wanted, they just delivered me a squeeze of mystery fruit paste in a tin cup. We loved this place and it has been a part of our life for years and I left feeling like it was a completely different place, it was depressing. We won't be returning."}
{"text":"Amazing service (thank you Tarisa) and well portioned meals. Fast, hot, and delicious food when you're in the mood for breakfast or lunch. Try The Elevated breakfast sandwich if you love avocado."}
{"text":"I love this place!! I don't live in Arizona, but whenever I visit Phoenix I HAVE to come here!! The food is great!! The service is good as well! Can't go wrong with fresh coffee, fresh juices, and a good meal!"}
{"text":"Excellent service and food. We go every Sunday before I go to work and sometimes we are running late so we call ahead and order. We already know what we want because we get the same thing every week.  I also really like that they have stevia in the raw to sweeten my coffee. Every one working there are friendly and prompt."}
{"text":"I'm torn with giving this a 3 vs. a 4 as the food was excellent, but server was awful.  Manager and general manager made up for it by the end of the meal so I'm going with 4.  Hesitant to go back as Gilbert has many, many choices, but their pineapple upside down pancakes were excellent!  Not as good as Snooze, but definitely better than Black Bear Diner.  Also, their chorizo breakfast burrito smothered in Veracruz sauce with black beans was amazing!"}
{"text":"My favorite for bacon and eggs. Bacon is thick, smoky, and delicious. Breakfast potatoes are diced and cooked perfectly. Toast is thicker than most and topped with real preserves. Over easy eggs just the way I like them and not greasy. All you can drink coffee and you're ready to go."}
{"text":"I will not be back. I've been here 3 times because they are so close to my house, each time trying to see if maybe I'm wrong. Well 3 strikes you're out. The pancakes had way to much baking soda or powder and the omelets are overcooked. The only thing that was good was the sip of mimosa I had. Not impressed."}
{"text":"Went for breakfast this morning, wasn't very busy and service was horrible.  Gave up waiting for the server to bring our check.  After 15 minutes of waiting for her to stop by after we were finished eating (as she never stopped by to ask how our meal was, nor refill our drinks) went to the register to ask for  our check.  Heard our server tell another table that she will take their order but then she was going to sit down and eat her breakfast at a different table near by.  Overall, she seemed very unprofessional and staff was very disorganized, do not plan to go back soon."}
{"text":"Nice little breakfast place. My only gripes have to do with the laws of Arizona regarding dogs."}
{"text":"Great food, and an excellent service experience. Erik and Sandy greet patrons by name and make everyone feel welcome, which is a rarity in this industry demographic."}
{"text":"We decided to give this place another try after getting a free meal from the management to do so. We were both pleased with our meal. I do quite like their crepe eggs and it is a filling plate. My husband liked his buttermilk pancakes as well."}
{"text":"Love this place - they are always great about accommodating our triplets.  Great food, great service."}
{"text":"I love it when family comes in from out of town... one reason is I get to go out for breakfast!  Alas, I'm the only one in my house that likes breakfast food.... :(  So when my brother was here this week, we ran right up to The Good Egg.  It's always solid but this was a reminder... when they are on... they are ON.  I must say, the service was 6 stars.  I had the Eggs Florentine... very well executed and really hit the spot.  My only criticism would be the side of rye toast came barely toasted.  I know I could have asked for them to toast it up.. I'm sure this would have been done quickly, but there is simply a timing issue with eggs and toast!  Must be the same time man! ... lol minor issue... I like coming her. :D"}
{"text":"I give them a 3 star rating because the food was good but we ordered 2 juices and the waitress never asked what size we wanted and automatically poured us the large. The prices are small $2.00, medium $3.00, and large $5.00. I have to say that paying more than $3.00 for any juice is outrageous and price gouging in my opinion. We told the waitress that we wanted small juices when we realized what the prices were and we saw her take the large back to the kitchen. The small juices were not much larger than a shot glass anyhow. I know this is a profit area and I get that, but $5.00 for a small water glass size juice is outrageous.  Food was hot and fresh and the service was great otherwise. They used to give all tables a pitcher of ice water in the Mesa location we used to frequent. I don't know if they stopped doing that but we did have to ask for ice water."}
{"text":"This place never has a long wait, always has delicious food, and their snicker doodle coffee roast is very delicious, a must try! The staff and even the manager is always super friendly, upbeat and always helpful."}
{"text":"Unfortunately with new ownership of all the Good Eggs, the frequent diner card is now buy 10 meals, get one free. It used to be 7 meals. I guess new ownership doesn't care about loyal customers! Food is okay and pricey. Wait staff is great!"}
{"text":"The Good Egg is one of our favorite breakfast spots in the valley. The food is delicious and we enjoy frequenting this location since it's so close to home. We typically go during the weekends. Going on a Saturday for lunch is not as busy as Sunday. We have tried a handful of menu items and none of them disappoint. My favorite is the nurse bialy. It's a filling meal but very healthy option. The Good Egg does a great job at highlighting menu items that are under 500 calories/light choices or placing them in one location for the health conscious to locate easily. My hubby loves the skillets! All of them. Life is too short to have crappy breakfast. Go to the Good Egg and treat yourself to something delicious."}
{"text":"We go here often when all the typical brunch places have lines on a Saturday morning.  The first caveat is that this is a training facility for other Good Egg facilities.  There is often inconsistency for this reason.  So it has been explained to my favorite breakfast crew and me. Service, cooking, quality all impacted.  (Heck, today even the soda was off.)  Mom loves the Lumberjack Skillet.  I love the crazy pancakes that even insulin can't forgive, Pineapple Upside Down, in particular.  My other favorite here is the rye bread.  Oops, I mean Rueben Sandwich.  Sure I love the looks at Miracle Mile, but Good Egg has perfected the portions of sauerkraut to Swiss to meat... and then there is the star of the show, which I already gave top billing...hear the angels singing?... the rye bread!  A particular favorite pairing (no they don't serve wine! It's a breakfast place!) is with their chicken enchilada soup.  The soup is a bit spicy, but so good!"}
{"text":"Quick and good service.  Good breakfast food.  Makes me a happy hungover person :)  The bacon was good, my friend got the french toast and it was cinnamon-y, yum! I also liked the buttermilk pancakes, and their potatoes.  Nothing wrong here, but nothing too fancy."}
{"text":"Like Denny's... OK, better than Denny's or IHOP (iPoop), but there are much better breakfast joints nearby.  Two suggestions: Brunchies & the Hanger Cafe (Chandler Airpark).  All that said, this place isn't bad. The staff is crazy friendly and we saw them interact with some of their regulars like they were family! I'm guessing some of the old farts we saw there go there every day!"}
{"text":"This one is still transitioning to First Watch on the outside but they are serving their menu. I tried the avocado toast for the first time - very good!! I can't tell you how much I appreciate having an entire glass bottle of chilled water throughout my breakfast! No ice, just great tasting water to go with my yummy avocado toast. The staff is friendly and attentive. There is something for everyone, healthy-minded to indulgence. I highly recommend this place for breakfast or lunch."}
{"text":"My daughter and I go here every Sunday for 'brunch'. We usually go around 1pm or later so there's never a wait. We've been doing this for at least the last 6 months and not once have we had a bad experience. The hosts always know where we like to sit and some of the waiters and waitresses see us and come say hi if they can. Everyone is always super friendly and helpful. Also, the food is great! I tend to try different things to switch it up from time to time, and I haven't found anything I don't like. I've been to multiple Good Eggs throughout the Valley and this by far has been the best one I've been to."}
{"text":"***CHAIN ALERT***  The Good Egg... There couldn't be a better name for this spacious restaurant devoted to serving you the tastiest breakfast ever (okay, maybe not EVER! But pretty close).  They have a great variety of Omelettes from the classic \"Denver\" to (my favorite) the \"Hey, Rickie!\"  Their pancakes are great! Light and deliciously evil (or Evilly Delicious?).  The atmosphere is pretty close to a typical breakfast diner, but you don't have the chore of watching the cooks sweating over the hot griddles.  They have a small breakfast bar in the center and plenty of tables.  The outside area is pleasant with shaded drapes to block the hot AZ sun, and the eyesore of the strip mall.  Even if there is a line, it moves pretty fast and you are seated before you know it.  This location is right by my house, so we have eaten here plenty of times and I have never had a 'bad trip'.  Overall, nothing TOO special.  Just good food, clean, friendly attitude, and fast service!"}
{"text":"I'm giving 3 stars because our waitress was super nice.  I had heard about the avocado toast and that it was the best thing ever.  Well it was good but it was mashed up avocado on a piece of whole grain toast w two eggs for $9!  Sorry - not worth it.  Good bacon, great OJ but just not worth the money."}
{"text":"I love this place. The service is usually pretty good. The food is awesome. Good prices for the amount of food you get. I love love love the French toast and their biscuits and gravy are pretty dang good too! Super cute, old fashioned decor inside to make it feel like you're in grandma's small town breakfast joint. Also, they give you a to-go cup for coffee! I love that!"}
{"text":"Came here in a daze after not having slept for a loooong time and flying in to the airport with Dad; reminds me of the nice breakfast diners in Chicago, got the combo with turkey sausage (still greasy--defeats the purpose), eggs (always the same everywhere), french toast (more white bread, nothing too special but filling), coffee.  Nice atmosphere and no major problems, would be great for the weekend brunch!"}
{"text":"The service here is the second to none. The food is very Consistent.  Pancakes Are to die for!!!!"}
{"text":"The is our favorite place for breakfast. We take everyone here when they visit from out of town. We've never had a bad meal out of all the times we've eaten here. I have been to several of the locations and they are all fabulous food and service wise. The lunch menu is yummy too! They offer some healthy choices as well which is always important!"}
{"text":"went here yesterday for a late breakfast-at-lunch-time, first time and as always based on previous reviews ... so here is my two cents. I was glad there was no wait, which actually surprised me. Clean, cute country decor. I liked the water pitchers on every table. The lemon inside was a nice touch, but have to say that to a ice-water-and-lemon-freak to me, there was too little ice and too little lemon. But I don't like overwhelming people with special requests so I didn't say anything. Although I'm sure it wouldn't have been a problem - everyone was very friendly. The menu was fun to read with lots of options.  Notably, side item substitutions are easy and standard. Ok, on to the food. My husband had an 3 egg omelet, which while it was good, was smaller than we expected and have had elsewhere. I ordered the Eggs Benedict with turkey, which was also just ok - not great. The smoked turkey was incredibly over-salty - I left it on the side. What was wonderful were the pancakes, which gave my ratings the two stars. Unlike anywhere else I've been, you can specify if you want the extra ingredients mixed in or just on top. I did ask without knowing and it paid off! They were truly scrumptious, light, fluffy and delicious. Next time I go, it might be alone but for those pancakes it would be worth it! Also, they offer a card which you can get stamps on with purchase of an entree and some days are double stamps. After 6 stamps you get a free entree. This is awesome! I will be back soon."}
{"text":"It's been a few years since I've been at The Good Egg. I don't remember if I didn't like it or was just underwhelmed and opted to not go back.   I can't say that about this visit. WOW, I left full, impressed and wanting to go back ASAP!  We came in around 10 am on a Sunday morning so we expected a brief wait, it wasn't bad, maybe 10 minutes at the most. After being shown to our table we were greeted by a super friendly girl named Tarisa. I ordered the mushroom caps and she quickly had a suggestion for me. Apparently there are mushroom caps that aren't on the menu that have feta, mozzarella, tomatoes and pesto. Sure, why not! I appreciated the suggestion and liked all the ingredients she listed. The only problem was, I couldn't have imagined they were going to taste so phenomenal.  Without her suggestion, I never would have left that happy. I will be back SOON and will not even consider ordering something else. I didn't care about the eggs, potatoes and English Muffin, granted it was all wonderful but the star was the mushrooms. Please put those mushrooms on the menu!!   Tarisa's phenomenal service has gained your restaurant a repeat guest!!"}
{"text":"Great breakfast.  Served quickly.  Tremendous service.  It's a chain, but it does one thing and does it well.  BREAKFAST.  Getting hungry just thinking about it."}
{"text":"Mediocre food and very testy wait staff. I was hoping for a nice breakfast with my family visiting from Washington over the holidays. I stood at the front counter for 15 minutes while customers stepped up to pay at the register. When I walked in to be seated there was only one person paying at the register but then 3 more stepped up to pay. I waited patiently until 4 more joined the line and the person working as cashier continued to help them and ignore my group. Even an acknowledgement would have been appreciated. But we didn't even get that until I spoke up and asked if we could get a table. The food was just ok. My husband and I both asked for eggs over medium and even the whites were runny. Gag."}
{"text":"4 stars who paid for those  nothing special by any means.  Really nice staff .  I could make better food then what I was served.   Seriously who paid for these reviews, doesn't taste right to me.  Lol.  Hey you been warned."}
{"text":"Consistently delicious. I love to try new places but when I know I want great breakfast that is always on point, we go to the Good Egg."}
{"text":"Okay, I've given you two different tries Good Egg! WHY do you over cook the eggs on an eggs benedict?? If your specialty is eggs I expect a proper eggs benedict.  Everyone else's meal at my table looked pretty average as well. No one seemed overly impressed by what they ate."}
{"text":"Dependable good food but kind of expensive...  Food and service here are good...  I lose breakfast motivation when you have over $20 into some really simple breakfast food when I could go eat something more substantial for barely more...  I have eaten at these places for years but as prices go up I go less and less..."}
{"text":"This is one of my favorite places to eat breakfast. Everything always tastes so fresh. The avocado toast is very good and seasonally they have really great specials that use local ingredients. They had corn cakes awhile ago and I still miss them"}
{"text":"Best breakfast place hands down! Great food and friendly people! I've been coming here for a year and it's always been a great experience. I rarely post anything on this but felt that I should let people know what a great place this is. See Micheal what a great attitude and great service!"}
{"text":"WOW try out their Lumberjack skillet - you'll either stuff yourself so much you'll fall asleep on the car ride home or you'll have leftovers for later or the next day.  I normally don't like chains, and especially diner-like chains.  But this place was definitely a good find and I left thoroughly happy."}
{"text":"I have been here a few times now and although I will say my servers have been great, the wait times (for seating AND food) can be much improved. The food is good, not anything super amazing, but decent. Great choices for kids as well but overall, MiMi's or Crackers and Co. Cafe are just better for breakfast."}
{"text":"This is my favorite breakfast place and I love the staff!!! We will continue to eat here for breakfast on a regular basis!"}
{"text":"The hubby and I have been meaning to try this place out for a long while now and we finally got around to trying it out. The restaurant is clean and welcoming. Immediately upon walking into the door we were greeted and sat down.    We brought our girls with us and we all got our drinks. The kids drinks are a little small both kids finished their drinks before the food even came out but they were able to get a refill to go with their food and the drinks were spill proof and had lids which is an added bonus with how accidents happen with kids.    We got our breakfast and the kids were happy with their pancakes. I got the Eggs Benedict. I was surprised at how many different types of Eggs Benedict but I ended up going with the classic type. The eggs were wonderfully done and the country potatoes although very simple were really good. When we got our check, I was surprised that they asked if we wanted any of our drinks to go. That's not something a restaurant asks you on the way out and its a nice option to be able to get your drink to go so you can take it with you. All in all the experience was very nice and we will for sure be coming back."}
{"text":"Was not able to eat, as the kitchen does not open until after 7. I recommend they update hours."}
{"text":"Friendly, professional staff, open till 2:30 PM instead of the typical brunch joint's 2:00.  I have never been to a place where the food was as consistently amazing as The Good Egg. From the massive pancakes to the tender (and well-filled) omelettes to the skillets... I have never had anything here that wasn't perfectly made.  Highly recommend the Bacado omelette and the Lumberjack skillet."}
{"text":"It's hard to screw up breakfast .... these guys know how to! Undercooked potatoes in the skillet, caked on butter on the toast. Watered-down gravy on the biscuits. Overall our worst breakfast experience."}
{"text":"Maybe today was just a bad day for them.. but the culture here seems askew. The wait was 45 minutes after they told us it would be 20. The host would go outside to call out names and barely whisper them.. there were a lot of people confused if they had been called or not. Once seated the restaurant was almost empty. I have worked in restaurants for 10 plus years and this was an obvious sign they are very understaffed. Lots of people waiting but nobody eating. There were lots of flies all over and the decor is old and dusty. The waiter Miles didn't say hello and didn't smile. He's demeanor was basically shouting he hates his job. The food was quick to arrive but the sausage was mushy and  potatoes and eggs were damp and cold. Other Good Egg locations I've been to have been consistent and clean.. this location needs help. They need better staffing and they need an overnight cleaning party fast."}
{"text":"I love the food! The fresh squeezed juices are a unique touch and the menu is delicious."}
{"text":"Not impressed. Feels like a Dennys.  I suppose if you MUST eat at a chain restaurant it would be OK... but life is too short to eat at chains. So I will never go again.  For breakfast only- it's hard to mess up eggs!"}
{"text":"The two stars on yelp mean \"Meh, I've experienced better\" and this restaurant used to be so much better! I used to be a regular at the good egg for the past year and a half. I loved going there - their server Tatum made us feel really special and got to know us really well. She'd make suggestions and when I'd forget to mention something, she would double check to see if I didn't want it or just forgot to mention it. The front desk people were great, the food was slow, but it was because they were making a great meal for us.   Now the Good Egg is First Watch and the changes are \"meh\" egg. Tatum is no longer at the McQueen location, but the remaining servers and new front desk folks are really trying - and I really appreciate that.   The problem is with the food. I know they are saying that they are using \"local fresh ingredients\" but it doesnt feel that way. I ordered the bocado and the eggs felt like they were made from liquid eggs. the bocado used to come with avocados and this time it came literally with one tiny slice and the omelet wasn't \"fresh off the grill\" hot and it got cold very very quickly. The potatoes that came with it were hard. The coffee cups were tiny and the water glass were also tiny.   I'm sorry to say that I'm going to start looking for another brunch place."}
{"text":"One of my favorite breakfast places.  I've tried several different options and so far haven't found anything I didn't like.  It's a little pricey but worth it for the quality of food."}
{"text":"Been coming here for a few years, they have such a friendly staff! The food is delicious, best pancakes and waffles I've ever had. My Mom loves the eggs benedict, the avocado toast is fabulous, I could go on and on. I always sit in Miles section, he takes great care of us but all the servers are awesome here."}
{"text":"Very friendly great service excellent food Terisa was an excellent server I was in a hurry and got my good very quickly"}
{"text":"After an epic night of partying it was the next day and we needed to hit a spot for breakfast... Entered the restaurant it was really busy there was a 15min wait it want really fast. We were seated our waitress seemed less than happy to be there... I on the hand could have been anywhere that sold food. I looked over the menu and ended up going with (Old Pueblo) Chorizo & mild green chilies on top of potatoes under melted cheeses, topped w/2 eggs cooked to order* & Pico De Gallo. Salsa & flour tortillas on the side...  I rate the meal as followed.  Old Pueblo - B+  I would order this again for sure it did the job for me... So if you have a hangover and want to feel better after that epic night this is the meal for you."}
{"text":"Another breakfast/lunch only establishment, closing around 2:30p each day. The menu, as you'd expect, is focused on egg dishes and they do them well. I tried the eggs benedict and it was good, although not as hot as I'd have liked (luke warm at best). The prices are reasonable, less than $10 for most dishes. The service was lackluster- and it wasn't even really that busy (9a on a Sunday). We had to ask for drink refills several times (and cream for the coffee), she seemed a little put out by our asking for refills, which I didn't understand.   The rest of our table seemed happy with their food- although general consensus was that the breakfast potatoes were not that good (bland, and a little overcooked). There are plenty of options for dieters and vegetarians. I noticed the menu provides caloric totals for each plate, which is definitely a nice touch. Most breakfast places are dangerously high on fat content and calories.  I would probably try this place one more time to see if service picks up. My eggs benedict was $8.50 and cup of coffee made the meal around $10 total plus tip/tax. I remembered other Good Egg restaurants drawing big crowds, especially on the weekend so I was surprised to see this place pretty dead for a Sunday morning. It might be a newer location and one that most aren't aware of- so if your a fan of the Good Egg chain head over to the McQueen and Elliot location to avoid wait times and large crowds!"}
{"text":"My friends and I eat at this restaurant every Saturday morning.   We are completely treated like family. Cliff , the manager, does a great job at managing staff but also jumping in and helping with whatever tasks need to be taken care of  i.e. Busing tables to turn them faster, bringing food out to tables, talking with customers etc.  Very personable even under stress.  Kelly is our waitress of choice, however, we have had wonderful experiences with most of them. (Most of them meaning we have not had the others wait on us) Kelly is especially good at offering alternatives when customers ask about changing things away from posted menu.  She is looking at doing what is right for the customer.  The menu offers wide variety of items including many healthier choices.  Pancakes are great- and I am not a pancake person!!  We will continue to frequent this establishment ......."}
{"text":"This is your typical breakfast/ lunch only place. I chose to go because I love one of their omelettes ... that is unfortunately now no longer on the menu. I guess they got bought out by a national change and made some budget cuts here and there. The waitress was nice enough... And after she spilled my juice all over the table, she took it off the bill (I should hope so since it was $3 for juice and she never refilled the spilled portion lol). Accidents happen so it's not because of that, but because of the \"meh\" food, that I won't be back."}
{"text":"What a wonderful breakfast place!  Sandy, our server, was absolutely outstanding catering to our every wish with a smile! The food was great, atmosphere perfect!  Will definitely be coming back!!"}
{"text":"I'll start by saying at least the staff is friendly. Other than that.....not even mediocre when it comes to the food. I ordered their traditional breakfast for lunch to go. Minus the Potatoes, and English muffin. I got 2 poached eggs (they were cold). 3 strips of cold bacon, a ham steak (over cooked, and yep you guessed it, also cold), and a coffee (surprisingly not cold). Total was $17 and some change. This is the 2nd time I've been here, and still not impressed at all. Definitely the last time."}
{"text":"I have a great deal of respect for a buisness that values the customers.  After having an unpleasant experience I was gifted a gift card at an attempt to better my experience.  This experience was much better.  The service was great, the food was awesome.  I certainly will continue to be a customer thanks again."}
{"text":"Came back after long hiatus to see how the First Watch version was. Unfortunately same deal. Great service, Mediocre food (at best), small portions, expensive. Wish it wasn't so because I am a stone throw away. Bummer"}
{"text":"I give this place a zero, but Yelp doesn't have a zero..  Do not go here if you want to be seated timely. Arrived at 10:50, was told it would,be a \"15\" minute wait...even though there were at least 10 open tables.  We put our name on the wait list.  After waiting 40 minutes,  they seated a couple ahead of us that came in 15 minutes after us.  The food is only average here, so there are much better places to go for breakfast where you will actually get seated in your order and timely."}
{"text":"The friendliest staff serving really good breakfasts in a super clean environment.  I eat here often and the food is always hot and served exactly as requested.   I feel more like I am among friends than in a restaurant."}
{"text":"So far I've been to a Good Egg 4x and it's always been satisfactory. Today was another one of those days. This location happens to be right up the street from my little sister so I'm glad they're good. The service is good too as long as you're not in a big hurry. They have an outdoor patio section as well so you can bring your pup if you'd like."}
{"text":"Great place to have breakfast, nice friendly staff and delicious eggs. I like how the staff keep asking if anything is needed, and they serve really good coffee, nice place to start your day with."}
{"text":"I do love the Good Egg but I really dislike this location. There are plenty of other locations close by to choose from. I'd stear clear from here. I've had a small handful of friendly servers and they don't last, probably because in order to work there, you have to have a personality of zero or \"I hate my job\".  I hear people ask for Kelly a lot and I've had her at least two dozen times. She has never been friendly.  It's so close to my home I continue to go and each time I kick myself for doing so.  Go to the Dobson and Baseline location or the Rural and Ray location. OR, you can still choose to go to this location. Just be sure to be very specific with your order and lower your expectations for service."}
{"text":"Went there today for the first time for a late brunch. Was slightly hungover. The interior was your typical homey restaurant type feel minus any soul. Great service. Good hot sauce selection, anyone that carries Green Tabasco is \"ok\" in my book. Liked the pitcher of water they leave at table. Arnold Palmer was slight heavy on the lemonade, which was so tart it was like a slap to the mouth but in a good way. Good menu, nice selection without overloading with choices. Was in the mood for breakfast, something Ordered the 'Macho Nacho' - two eggs over a bed of hash browns, barbacoa, black beans, strips of tortilla chips, served with sour cream, guacamole and a couple tortillas on the side. What can I say, pretty damn delicious. Tortillas were interestingly thick, but went well. Ordered the eggs over easy but came out a little too solid. Dish was so good I forced myself to eat all of it and was uncomfortably full the rest of the afternoon. Definitely a solid breakfast spot."}
{"text":"Great breakfasts, and not as crowded as some of the \"trendy\" spots nearby in Gilbert, which can have completely ridiculously long waits on the weekend. Started coming here for that reason, and really like it. They have probably the best hash browns I've ever had (you have to ask for them, country potatoes are the default breakfast side), and great omelets. Service is generally very good, though can be a bit of a hit and miss. Will continue to be a regular."}
{"text":"We ate breakfast here yesterday, and we just had to come back again today. The food is delicious and the staff is super friendly!"}
{"text":"I like the folks that work here they are very friendly and efficient! The food is always good! They some times have new specials that are interesting! The price is well worth it. For me it is a great location as I can shop in the area and my bank is close by! Rare they don't have what I want. If I come close to closing they always seat me and serve me! I keep going back. Even on a rainy day it feels like the sun is shinning there!"}
{"text":"This was my third time at this The Good Egg. It is a nice place with friendly staff and no wait. The food is good and I like the fact that they give you some guidance on calorie count per meal.  With this place being so close to home, it sure beats the McDonald's across the street."}
