{"text":"Worst coffee ever.

My mom has  lived in the community asociated with the Willows for eight years and never eaten here so when visiting we decided to try it.

I had breakfast, and she has coffee and cake. Food was so-so but man was the coffee bad!  The server was nice enough to replace it not once but twice even offering to brew a fresh pot. Didn't make a difference.

Sat at a window booth and the view was nice over the golf course. Think that it would be a good place for a beer after golfing but that's about it."}
{"text":"The food was great and reasonably priced with good portion sizes. The staff was nice and gave good service, and there is a good view of the golf course. There is a bar section with video poker, but it is separated with a half wall from the restaurant and was not noticeable once seated. It was kid friendly and we were able to split one meal between both kids with no problem."}
{"text":"Everything about this experience was sub par...food was brought out to guests at different times, food was what you expect the see on a kids menu, no refills on drinks. I would like to say this was an isolated incident, but I watched the same thing happen to the other two tables. Save your time and money!"}
{"text":"Wanted to try something different for breakfast with the GF and thought we would try TWR. Located within the clubhouse of the Desert Willow Golf Course, the restaurant is very smart looking.  We picked a table next to the window which looked out north over the facility.

The service was friendly but not as attentive as it could have been given the restaurant was basically empty.

I ordered and omelet with cheese and sausage, hash browns extra crispy.  Upon it's arrival it was very basic in it's presentation and the HB's were not crispy.

The bar area looked very country clubish and seemed that it would be a nice place to enjoy a beer after playing 18."}
{"text":"A little surprise hidden near the MacDonald Ranch Golf Course. Good food. Basic choices. All homemade and served with a smile. Sit on the patio facing the green or find a comfy booth inside."}
{"text":"The Willows has excellent breakfast, lunch and dinners, and is reasonably priced.  The staff is always attentive and gracious.  Windows all around offer a nice view of the golf course and there is a cozy bar area."}
{"text":"The willows is an excellent restaurant. They always have excellent staff.   Nick and Elizabeth are amazing owners and will always treat you like family.   Major kudos to them."}
{"text":"We often eat at the Legacy Golf Course restaurant and decided to give this place a try. First off this place is seriously dated, as in mid 90's model home dated, right down to the faux finish walls. The view was not very good, and the little view that they did have was covered by blinds. Unfortunately the view was better than the food. I had the chicken piccata which was rubbery, bitter, and seemed to not have any lemon in it whatsoever. My husband had the tuna melt which was bland. While he was able to eat his I couldn't get past two bites of mine and sent it back.

I do have to give credit for the service though. She was friendly and very efficient considering she was doing double duty as bartender and server."}
{"text":"This is a great place to enjoy comfort food any time of the day. They make a really delicious waffle with whipped butter.  The service is always friendly and fast, and the atmosphere is peaceful and relaxing. You can gaze upon the golf course while dining outside or in."}
