{"text":"Ok, so I added the Blue Fig to Yelp. It used to be Pasha (http://www.yelp.com/biz/pasha-mediterranean-grill-and-restaurant-solon), which was around before I was in town. I categorized it as a bar, probably to the protests of the owners, but they can change it later. Really, this place operates best as a bar. In fact, they have pretty decent drink specials throughout the week; and it's really a beautiful building inside. The bar is towering and underutilized. They also have a full menu of bar-like food with some other \"fancier\" dishes thrown in (pasta of sorts, nothing grand). But to call it anything more would be kind of a stretch in my mind.

My girlfriend and I hold a special place in our hearts for the Blue Fig though for one reason. It is very close to both our home and the Solon City Hall. Have you ever sat in a City Council meeting before? Because we have. And I am surprised the whole damn town doesn't show up after one of those. The food and spirits after some drolling, mind numbing procedural meetings is always appreciated. For that much I think it would be safe to call this place our \"local bar\". I'm ok with that.

PS. A word to the wise, stay away at lunch. They are severely understaffed, or at least were the last time I went there for lunch."}
{"text":"This used to be a mediocre middle eastern restaurant, and now it's a mediocre sports bar. They kept the middle eastern decor and have tried to make it seem like a bar by tacking posters to the walls over the lovely murals and sponge-painted walls. So it's a bit incongruous.

I don't have cable TV so when I want to watch a football game on a channel I don't get, we try to find a sportsbar showing it. However, even though we were the only people in our section and  even though there were more flat screen TVs than there were employees in the restaurant, they flipped our TV away from the game we watching so the employees could watch the Ohio State pre-game show. Seriously?"}
{"text":"I've only been here once, so this review may be a little immature.  Fortunately it was there the day I went because I waited out a huge storm by drinking CHEAP happy hour beers and eating wings and hummus.  There was nothing extraordinary to say about the food but I would get the wings again.  Service was on the slow side and the other patron at the bar was a very annoying trucker that just wanted to talk to me about everything and anything where it was making the company I had with me feel very weird.  

Overall, I really like the potential this place has.  I personally think it might do better as a sports bar but think that Panini's just opened up trumping that idea.  I just like the layout and the big patio.  I'll probably just go to the Bucket or Panini's if I need to stop for a beer or 5 on my way back to the Heights area.  Go and check it out though, just get something that the waitress recommends."}
