{"text":"Nice place, affordable with a nice owner :) 
Their burgers and breakfast menus are great!! 
Anything u choose will taste nice ! For lots of truckers come here they have big portions to satisfy any belly"}
{"text":"Went here a few times for the all day breakfast. Pretty yummy for what it is. Staff is friendly enough. The decor is a bit of an eyesore. Looks like someone who works construction picked up random odds and ends and stuck it along the walls and counters.  The name is kinda awful as well and I only visited because my boyfriend came across it one day and ate there. It has potential don't get me wrong. It's cute, just not that much inviting as it could be."}
{"text":"Came to Toronto for a quick weekend getaway from Westchester County, NY.  We went to brunch the day before and spent $71 for 2 (with 2 drinks) and didn't want to break the bank for breakfast the next day.  This little mom and pop place was great!!  We walked right in and sat down.  The food was great (we had the steak and eggs came with home fries and toast) delicious coffee, and the price was right $34.  The service was fantastic!!  Husband and wife were both very friendly ."}
{"text":"I got the Super 8. It's $9.95 and has 2 Pancakes, 2 bacon, 2 sausage, eggs any style and home fries. It wasn't too bad it's pretty greasy. The sausages are clearly deep fried, but kind of good. The coffee is $1.50 free refills it's kind of mediocre. It's not very busy at all. It's definitely a place we could come back to. Oh and they take debit that's always a plus. They have a tv here too, the jays game was on."}
{"text":"Great classic old school diner. Good 'old cookin. Simple, tasty, quick, great service , super priced ."}
{"text":"Nice little place!

This is an old-school diner with friendly owners with a uniquely quirky decor (lots of tiles in places you might not expect). They have all day breakfast, but we were there for the lunch menu. They have the standard diner stuff... club sandwiches, fish and chips, souvlaki, roast beef, etc. I tried the roast beef club sandwich. It was served quickly and it was super tasty. The fries were great after adding salt and ketchup."}
{"text":"Unless you're from the area, you'll probably pass this place without so much as a second glance, but it's definitely a gem. It's located in a rundown strip plaza along Keele. Family run, old-fashioned style diner which serves amazing all day breakfast! Portions are generous. Been here a few times and my favourite thing to get is the French connection - eggs your choice, home fries, bacon, sausage AND French toast. So much food. The Benedicts are great as well, although my only complaint is that there might be a little too much hollandaise sauce. Never tried any of the sandwiches here but my boyfriend got the burger once and it is massive! This place is usually operated by two or three people and they are fast and efficient! We come back here frequently and would definitely recommend this gem. It's hard to find good quality diners in this part of Toronto."}
