{"text":"Good menu and extensive beer list. Nice setting. But they still have problems handling service.  Our 2nd drink order took 15 minutes so arrived as we were finishing dinner. We all ordered soup as an appetizer but they came (well 2 came) after we were served our main meal. We mentioned this and reminded them of the other 2 soups but they seemed unaware that often a patron wants their soup before their main meal. I'll give the place one more try but hopefully they can get their act together."}
{"text":"We had dinner for 4 last night and have 2 regrets, 1) We hadn't done it until now and 2) My husband had the beer batter fish.  Don't get me wrong, the fish was fine but my Lemon Grass Halibut was to die for and he regretted not trying one of their more decadent dishes as the rest of us had!  Oh, and the Brussels sprouts were just as mouth watering as before (as were the Whiskey Old Fashions, especially the apple caramel)We were impressed with the amount and variety of menu selections and thought prices were quite reasonable for the large portions and quality of food!  Our new favorite place!!"}
{"text":"We have been here for take out, lunch, and drinks and each time the food is amazing.  The fish fry is the best fish in the area. I do not drink much anymore but I had their old fashion with apple slice and i had to have 2. Going back for more!"}
{"text":"Not only is the food below average, but they don't seem to understand how reservations work. We made a reservation on Open Table. It lets one choose between a bar table and the restaurant. We chose a bar table. When we arrived, they did not honor the reservation and instead put us at a table in the back of the restaurant near the server station. Not only that, I received a No-Show Inquiry from Open Table today, saying the Verona Woods wanted to know why we didn't show for our reservation. I put in a correction and called the restaurant. They said they didn't know how Open Table worked and weren't able to do anything about the No Show. This is the second time out of two visits they've messed up the reservation and served us disappointing food. There will not be a third. If the food were any good, that would be one thing. But bland fish and under-cooked rice were enough to turn me off and now I have to fix my Open Table reputation."}
{"text":"Drinks menu is extensive (especially the beer list), food is very reasonably priced (for the quality), the vibe is lively, service is attentive and while the interiors are not striking or noteworthy are above average. No wonder this place has been packed both the times I visited - once for a family dinner, another time, with a larger group for a party.   As many others have noted, Verona needed a spot like this because when it comes to restaurant choices, lets face it - Verona has been a dump compared to other smaller towns like Mt. Horeb, Waunakee, and Paoli. I am glad we have one now.   Hopefully, the place will keep humming even after the novelty has worn off."}
{"text":"Went for lunch today and was really disappointed. Everyone else's food looked very good...especially the hamburgers and the Brussels sprout appetizer. But do what you do well and quit when you're ahead. I ordered the lunch  busted out blt salad and got lettuce...for $7.00. It was supposed to have tomatoes, avocado, bacon and corn also but all I had was the essence of. When I told the waitress nothing was taken off my check.  Very disappointed....went home and ate. Not sure I'll be going back."}
{"text":"If I could give them less than one star I would.   We came in on a Friday night without a reservation.  No biggie, thought we would give the bar a try too.   Told it was an hour long wait, which even for a good restaurant in Verona (which this isn't) would be excessive, but thought it was new and let's give it a shake.  After an hour and forty minutes (and watching people, that came in after us get seated before us) I decided to have a chat with the owner (can't miss him, big bald moron who likes to make sure he tells people he owns the place and not his peasant servants) he decided to finally seat us.  But, this was also after talking to one of the waiters who saw us sitting there for an extensive wait.  We finally got seated next to a vast array of open tables and were informed that the kitchen was backed up and we could expect an even longer wait for food.   Here's the deal, it's a new place and I get that they are having growing pains.   What bothered me, was not a single F was given in regards to the long wait time and the owner making sure to let me know he is a very successful restaurant owner and not his \"staff\".    I urge you to not give this place business."}
{"text":"The service here was horrible. We had to wait 20 minutes to get a drink and that came out with the meal on a Wednesday night. The food was also sub par, I had the shrimp pesto with \"homemade pesto\"  that did not have any flavor. At $15 a plate, I could make something better at home. Would not recommend this restaurant."}
{"text":"I wanted to love this place, but in the end it really was very mediocre for the price, if you're eating here as a nice dinner place.  I think a lot of it depends on what you order and in that sense it was my fault for ordering pasta, which is almost never good at a place like this.  The pasta was WAY over cooked.  My husband had the ribs, the Saturday special, and those were much better.  There were a few sandwiches that looked good, so we'll probably come back to try those.  It is great to have another restaurant in Verona and I think it's probably going to be ok for just a sandwichy, burgery kind of place, but for a nice restaurant, head into Madison; the money you'll spend here for a nice dinner isn't worth it. For just a regular sandwich kind of dinner, it's going to be ok and worth not having to go far."}
{"text":"Went out to try The Verona Woods, along with two other couples. We had reservations early on a Saturday night. When we arrived we received a warm, friendly greeting and were informed our table was being prepared. We stepped up to the bar, ordered our drinks & our table was ready. Our server, Milissa, was great! We all ordered something different and everyone was very pleased with their meal. The rack of ribs were fantastic!  Even though there is no salad bar, they offered a variety of tasty side dishes. The owner stopped at our table to inquire about the food & service. He was very pleasant and thanked us for coming. Overall, a very nice experience. We'll go back!"}
{"text":"While in town for work, I'm using Yelp to explore local options. I read about Verona Woods, checked out their menu, & decided to give it a try. I dined at the bar on a Sunday evening. The ambiance was nice; it wasn't too busy yet there was a calm, casual feel with a touch of that local neighborhood friendliness. I had a side caesar salad and the prosciutto wrapped chicken; tasty, filling and just under $20. A little sumthin' was missing to really make this a standout dish though. There were several other options that caught my eye, especially from the appetizer menu. The service was friendly & attentive. When I'm in town for work, I'll be returning to Verona Woods!"}
{"text":"In Verona on business, eating an early solo dinner on Valentine's Day.  Seated promptly, nice informative service.  I enjoyed the caramelized leek and red pepper soup; the color wasn't quite what I was expecting, a little gray, but the flavor the caramelized leeks with red pepper flakes was delicious.  I had fish tacos for entree: blackened tilapia in warm tortillas of 50:50 corn/flour (nice texture and nutty flavor), there was a lime-kissed crema, and a delicious gojuchang salsa that had nice depth of flavor and back of the throat heat; napa cabbage provided a great crunch.  Not as much fun as dinner with my sweetie, but delicious food and great service."}
{"text":"Something weird is going on here.  Service is pretty bad (we waited 45 for a morsel of food) the waiter wasn't in the best mood.  The do have a nice looking bar with 3 or 4 decent TVs."}
{"text":"Had dinner with seven of us.  3 pasta dishes, chicken in cream, wings (13 year old), chicken sandwich, and mac and cheese for two year old.  Walked in at 5p on Sunday night with no reservations. Seated with very good service from Dana.  All entrees were good and reasonably priced. Would we go back...probably not because competition is tough in this area.   Manager/owner did come to our table to ask how everything was.  Appreciated that."}
{"text":"I was at Verona Woods months ago for dinner with 5 relatives and we all loved our food. Yesterday was my first time back. I met an old friend there for lunch. We both had the Fall Harvest salad ( spring mix, candied pecans, roasted butternut squash, dried cranberries with a pumpkin dressing) We both thought this salad was to die for. I actually asked the waitress if they sold the dressing. If they ever start selling it I will definitely be buying it! I can't wait to go back and try something else. Their menu is very intriguing. You can bet I won't be waiting months to go back!"}
{"text":"I love what is happening in this part of Verona with new restaurants and shops, but I do feel this place is not at the top of the list of what will draw you out there. Verona Woods has improved nicely since they opened, but I do wish they would scale back their menu a bit and focus a bit more on a few things to do really well.  Outside of our first visit (of 3) right after they opened, I've not had an issue with service. The staff are friendly and attentive.  The menu is large and the portions are large, but the overall quality and taste doesn't always stand up to the higher price. Great beer selection.  We met out of town family for dinner last night, and after giving them the several choices in this convenient meeting spot, they chose the Woods. I ordered the crispy Brussels sprouts as a side, as I had these on the visit before and liked them. I also ordered the adult Mac n Cheese, and we had cheese curds and the potato bites appetizer for the table. The cheese curds were very tasty, but could have used just a bit longer in the fryer, both to get a darker color crust and also to soften and melt the cheese just a bit more. The potato bites had a bbq pork on them which was a bit too sweet though the overall idea of the dish is so much better than the typical potato skins app you see.   I don't know what happened to cause this but I'm all over anything having to do with Brussel sprouts these days and these were pretty good - though any hint of actual sprout flavor is lost to pancetta and a balsamic glaze. If you are scared to try Brussel sprouts again after a traumatic childhood event, start with these.  My husband had the ribs - not the best he's had in his life and not the worst. I feel like that statement probably accurately describes a lot of the menu items. It was the same with the Mac and cheese - great idea, and pasta was cooked well, but just a little short in execution in my mind with flavor and presentation. I would like to try their fish fry once so I'm sure we'll go back at least one more time..."}
{"text":"First let's clarify something:  Rating for restaurants in Madison-Verona area: 3/5  Rating for restaurants in Verona area: 4/5  My husband and I went here on a Friday night and it was packed. The decor was a grey, cool winter palette with nice a fairly nice ambiance. Lots of wood tones scattered throughout which I approved of but my husband wasn't feeling 'inspired' by it.   Pros: + wine list (by glass) is more extensive then would have previously expected  + friendly and accommodating staff + nice ambiance  + fish fry - my husband ordered the fish fry and really enjoyed it. The cod was fried very well although the fried were underwhelming    + fish tacos - i got these and thought they were delightful. Spicy with a really flavorful aioli but kept light by the addition of the cabbage. Would recommend trying this  Cons: + bruschetta trio appetizer - the main sin was that the bread was a soft loaf that was not toasted. Without the bread being toasted, the whole thing had too soft/soggy texture. There was 1 from the trio that had wine poached apples on top of goat cheese which we weren't fans of. Mainly due to texture but also due to taste. The goat cheese was too strong and the apple wasn't crisp enough to balance it out.  + side salad - underwhelming and boring. Had a maple, apple cider vinaigrette which was an interesting dressing but the salad wasn't really made for that type of dressing (store bought, shredded cheddar cheese topping). They did make their own croutons (with the same bread used in the bruschetta) and it was OK but the texture was a bit off and I'm most certain they tossed it in bacon fat. Again, this isn't bad but the was the salad was composed didn't work with the dressing or croutons.   + table bussing - we finished our appetizers and the bus person came over and took all of our silverware off of the table. Both of our knives, and our forks(luckily I was left with a fork so I could eat my salad). We were not offered new silverware and had a hard time finding our waitress to ask. It should also be noted that neither of us had knives when eating our main dish (although I had tacos so I used my hands)  + mystery server - some random person delivered our food but it was a bit awkward. The person sort of snuck up behind, didn't say anything, dropped our plates, and practically ran off. It was rather funny but definitely awkward.  + menu size - this menu was HUGE. There were so many options that my husband and I couldn't figure out what the restaurants 'identity' was. There were like 20 appetizer options (one of which was a burger?..not a slider...but a burger?)  Overall thoughts: food is good for the Verona area. Pricing is fair. My biggest criticism would be for the staff to get a little more training on how to appropriate handle table maintenance and etiquette ( but this is really just my push for this place to set the bar higher ). Menu is way too big! Figure out your identity and simplify the menu. And finally... please toast your bread for the bruschetta (or use a baguette instead of a soft loaf)"}
{"text":"It's great to see the Liberty Park development in southeast Verona coming along so nicely. With the recent addition of Fisher King Winery, we now have the \"New American\" offering of The Verona Woods. This review is based only on a bar visit with appetizers (specifically nachos) . . . additional reviews forthcoming to be sure; very interested in trying the braised short ribs with rigatoni!    The decor is sparse but comfortable, once I got past the jarring color scheme (turquoise upholstery with inlaid wood surfaces??). Great craft beer selections have become the norm in most \"nouveau gastropubs\" and this place is no exception, with 24 on-tap beers covering a wide variety of local brews and imports. Wine list is decent as well, always nice to see an Erath pinot in the offing.  Some intriguing apps on the menu, including brussels sprouts with pancetta and a nice variety of bruschettas. We opted for the nachos with chicken . . . very fresh and tasty, enough to constitute a meal for two. Some bar neighbors got the burgers, which looked superb. There are also grass-fed Angus steaks to lure me back. To top it all off, the staff and management was very friendly and helpful. Good start for this young but promising addition to a growing business center!"}
{"text":"And finally we have great service, foodie food and really nice people in our backyard.  YOu have to check this place. Chef from CIA, NY and it shows.  From the front desk check-in to the server; they clearly care about every detail.  Prices are very reasonable. Thanks Verona Woods, we will be back, and again."}
{"text":"Wish I could give more than a 5 stars! Food and service were both top notch. Great Bloody Mary and the Brussels sprouts were amazing. Very confident whatever food item you get will be cooked well. Also many good vegetarian options. So excited to have a nice restaurant like this in the area and plan to be back a lot!"}
{"text":"A great new entry into the burgeoning SE Verona 'entertainment' district buttressed by WI Brewing Co. Very inviting space with a handmade bar and tables by the owners father. The menu is described as \"Fine casual dining\" and is very good. Our group had the app's and they were excellent! The nacho plate with chicken was piled high and had a restrained amount of heat that pleased my palate. Based on the patrons in the main dining room, the menu is a hit! There is a good wine selection, decent beer options, and an excellent old fashioned, based on one of the O.F. conniseurs in our party. Definitely coming back! Only negative, closing hours are 10:30 on Friday and Sat. Really need to rethink that but otherwise, thus 4 stars, but a very nice addition to the nightlife in Verona!"}
{"text":"We had amazing food and service for our New Year's Eve! Joe did an amazing job and we hope to be back again soon!"}
{"text":"Our group tried the Verona Woods for dinner Sunday night. I'd heard good things so I was excited to try it.  The area where it is located and the building itself seem very new. Inside was clean, spacious, and comfortable. Our waiter took our drink order, then our appetizer order, and eventually our entree order. He seemed to disappear periodically but luckily other servers came by to replenish water pitchers.  For starters we ordered the Ahi Tuna Poke and the Crab Stuffed Mushrooms. The tuna was tasty. The mushrooms didn't really match the menu description. It was a small platter filled with tiny mushrooms and stuffing and then melted cheese on top. The stuffing reminded me of Stove Top and didn't seem to have any crab flavor.  For entrees we had the Woods Baked Ziti, the halibut, the french onion chicken, and fish tacos. Everyone thought their meals were fine. Nothing stood out as exceptional, but no-one had any complaints either.  If I was in the area I would not hesitate to go back and try it again, but I also would not make the journey down from Madison just to go there."}
{"text":"Had a reservation at 6:30 tonight.  We were greeted promptly and told they'd be with us shortly.  15 minutes later we'd not been seated and several groups walked right in and were promptly seated. We'd been here before and the food was good, but won't be going back after this experience."}
{"text":"While I'm excited to see higher-end restaurants making their way into Verona, I have to rate Verona Woods against its peers--for a $150 bill for two people, you can currently get better service and food elsewhere in Madison. Improvements in service and tweaking of the menu can get this pace to four stars.   Overall, food was quite good--we had the sliders for a starter but we weren't asked the \"doneness\"--I'd say they were delivered at medium/medium well, more than they should be but still tasty. Tap beer selection was decent, but has some room for improvement.  I was here for the Valentine's menu (Feb 13) and the place was rather empty. For the first course we ordered the tuna/avocado on sushi rice and the scallops. Both were flavorful and worthy of five stars (never thought I'd be ordering scallops in Verona!)  For the main course, we had the beef tenderloin (with baked potato) and the duck breast. The beef tenderloin was ordered as medium rare but was served rare (not an issue for me, but surely too rare for some). Baked potato lacked finesse (basically a baked potato, shredded cheese and bacon crumbles). The other main course was the duck breast and it was cooked perfectly, a nice rosy pink on the inside.   The meal took a downhill slide when we were only halfway done with our main course when the dessert was delivered to our table... Even more strange was the server proudly telling us how the churros were freshly made (!) but then the dish sat on our table for 15 minutes until we finished our main course. When we got to the desert, the churros were good but disappointingly they were underdone (raw dough) in the center. Disappointing.   Overall, some easy changes could bring this place to four stars, but I'm not sure there's enough here on the menu (and for the price) to get to five stars."}
{"text":"Had friends in from out of town on Easter.  Expected this place to be pretty good based on reviews from the website. The Easter brunch buffet was not as expected. Food brought directly from the kitchen was cold. We were assessed an 18% gratuity for a table of four at a buffet, for the server to bring us a drink and take away dishes.  Seemed a little ridiculous,  but I normally tip 20% or more when I am satisfied. Most likely will not be a next time..."}
{"text":"I enjoyed our dinner here.  I've seen some of the other reviews complaining about service, but ours was outstanding.  Everyone was polite, we were checked on frequently, and we didn't have to wait for our food. Great staff!  We came here on a Friday, so of course we tried the fish fry!  My wife had the beer-battered cod and I tried the pan-seared walleye.  The batter on the cod was very thick, but I was told it was a good dish.  Not my thing, but if you love batter go for it.  The walleye was excellent.  Walleye is easy to dry out.  It's thin and fairly delicate.  Most people fry it in batter to preserve the juices inside.  The Verona Woods pan-fries theirs. The fact that it was not over cooked was not lost on me.  That's not the easiest thing to do, and many places I've been to have done way worse.  The spices on the fillet were tasty as well.  We also had their bruschetta platter, with a classic slice and a couple variants on one plate.  The toasted bread was perfect, and the toppings very tasty.  The cole slaw side could have been a little less bland, and we would have preferred the glazed carrots to be cooked a little longer.  Not terrible, but  some room for improvement.  I fancy myself a connoisseur of fine cole slaw, so it's pretty tough to impress me in that category.  I've got high hopes for this place.  Let's face it.  Verona is a food desert.  There's a couple decent places, a massive nasty fast food row, and not much else.  I'll be back to The Verona Woods.  If the experience is similar to what we just had, I might even become a regular."}
{"text":"Very uncomfortable dinning experience. Both times there with reservations, had to wait 20 minutes  for table. table  were not set. Mass confusion. Moving tables cleaning floor during dinner. Food very average.  Over priced. Wait staff and owner under dressed. Receptionist very snippy. Trying to be high class but not even close."}
{"text":"Food was pretty good. I ordered flank steak special with Mac and cheese. Portions are pretty small. Waiter was clueless and seemed new. Would come back if there was another waiter. Owner came out to greet his customers and welcoming."}
{"text":"Absolutely LOVED this place! And Verona has needed a place like this forever! Took my kids, had amazing service! My son (a vegetarian) had the andouille pasta without the sausage. My daughter had the cream chicken with potatoes and carrots (TO DIE FOR!!), and I asked the server for his favorite which was the red snapper and it did not disappoint. Apps of the bruschetta (OMG the beet is out of this world!!!) and cheese curds (not the best I've ever had but very good).  Hands down I will be here again: there is absolutely nothing to complain about, the food is fantastic, and the self is was out of this world! Well done!!! And so happy that there is FINALLY a nicer place in Verona where the prices/quality/service are in alignment!!!"}
{"text":"Initially, I stopped by this place for a quick drink accidentally at the happy hour.  I ordered a half order of pulled pork nacho and had beers.  The half order nacho came and looked so big I asked them if this is actual half order.  Due to the happy hour discount my bill was not even $10 on the day.  A few days later,    I went back for the BBQ ribs I read at the first time for Saturday.  I ordered a full rack of ribs.  I am allergic to too salty or too sweet food and usually BBQ is the dish having both bad conditions combined together.  I was worried a little before I got the food.  However, when I was served, the BBQ was not sweet or salty at all, very tender juicy baby back ribs.  Just one little downside was that the fries come with ribs were not fresh and maybe reheated the old ones.  I definitely like this place and will go back."}
{"text":"Loved eating dinner here with my wife last weekend! The wait staff was friendly and accommodating. It was a busy weekend for them with graduation and Mother's Day and we never felt neglected or inconvenienced. The wine list was good (and delicious) and the food was excellent! Everything was fresh and cooked just right. We will be coming back again and  bringing some friends."}
{"text":"Went today for Father's Day brunch with my family. We had a wonderful time. The food was very good...I had the pulled pork eggs Benedict. They had a wide variety of food selections on their menu. We have been here for dinner before and enjoyed it. The service was a little slow for the amount of people in the restaurant. Our waiter looked busy managing multiple tables."}
{"text":"Average !!!!!!   overpriced ,and underwhelming. No rolls on the table ( you get one with your fish fry) and they \"a la  carte\" the crap out of their Friday night fish fry and  menu entrees ,with an up charge for ridiculous things like waffle fries? Seriously ? Before you know it your average fish fry is $17-$18 dollars for three small pieces of fish, even smaller if ordered baked and nothing special. Culver's fish fry  tastes better.  The mixed drink menu has no prices because they are over priced and a complete rippppp offfff!!!  The place is incredibly loud and you can't have a conversation without yelling. Average average including the service.  Over priced !-  Go to Applebees!"}
{"text":"We have been to the Woods before with a much better experience, but this visit was awful.   I ordered the Walleye with a potato side and asparagus. When the server came around with the ubiquitous \"how are the first bites tasting\", I told her not good at all, the Walleye is tough and dry, and frankly a little too hot. (spicy) Rather than apologize and remove the dish, the server said she would go tell the chef. When the server returned, she asked if I wanted something else and pointed out on the menu that the Walleye was prepared with a \"house spice blend\" are all spices hot? -  ignoring my feedback that it was tough and dry. This was one small, thin piece of Walleye. The plate sat there at least another 20 minutes while I waited for another dish- lime cilantro shrimp tacos - which were good.   When the check arrived, the server told me I would not be charged for the tacos, ($14.00) but I was charged for the Walleye I found objectionable ($20.00) So, they got an extra six bucks from me because I thought their Walleye was poor quality and had to eat an alternative while my friends watched having finished their dinner. Not again."}
{"text":"Not great. Rude and arrogant bartender who is somewhat confrontational. Not a pleasant experience. Manager (after reading other reviews, I've come to realize this was actually the \"owner\") addressed my experience with bartender AT the bar in front of ALL the other patrons by essentially blaming me, the customer, for the encounter. In the end, food was overpriced and very bland. Will not return."}
{"text":"Good Food, and a nice staff. We did have one order that needed to be sent back because a special request did not happen the first time, but it saw fixed with out much delay."}
{"text":"Food was excellent, server was sweet, wine was delicious. If I were to be critical I'd just ask for some higher end vodka options, best you can get is Absolute according to our waitress. We had the fish tacos, farro cakes, and the filet. Also had some soup of the day which was an Asian inspired soup, that was my favorite part! Everyone at the table loved their food. This place had a very attractive dessert menu. I'll be back! The owner was great and stopped by our table too."}
{"text":"Got the baked cod tonight and asked if there was a vegetable option instead of potato. I was told yes but there is an up charge. I said that was fine. My dish came and on the side of baked cod (which all the cod put together was smaller than half a dollar bill) was THREE pieces of asparagus. Three?! For an up charge?! I clarified with the waiter that this was correct and he said yes. I finished my meal never being asked once if I would like another drink. My kids chicken tenders for $5 were way more impressive than my meal that I paid over $12 for. Rip off."}
{"text":"The cheese curds and Brussel Sprouts are excellent starters at The Verona Woods. If you don't like Brussel Sprouts now... you will. They seer their Brussel Sprouts in an amazing sauce and have thick slices of bacon mixed in (my mouth is watering thinking about it!)   Unfortunately I can't give 5 stars though, simply because both times I have been here my main course has not lived up to the appetizers that proceeded it, too greasy, too dry, not as good as the Brussel Sprouts.  Head here for some drinks and tapas and you won't be disappointed!"}
{"text":"My mom and I had been referred to this place by a few friends & decided to celebrate Mother's Day here. We had reservations and were seated at a cozy table as soon as we walked in. The atmosphere is nice & woodsy-themed. Our waitress greeted us, brought us water and then let us peruse the wine menu. It took a long time for her to return to take our drink order. By the time she did, we were ready to order our meal. I ordered the bruschetta trio and the busted BLT salad. My mom ordered shrimp scampi with gluten free noodles. The bruschetta was the best part about the meal. The busted BLT salad wasn't bad but nothing special. The pasta was sticky and stuck together (Old?) and flavorless. Even Parmesan cheese couldn't save this dish. Needless to say, we were disappointed with our meal and don't have plans to go back.   If you are looking for a delicious meal in Verona, I'd suggest Four Sisters- right next door. We ate their Friday and it was amazing!"}
{"text":"I was excited to check out the new place in town this past Friday and will definitely be going back. After making a reservation for a table in the bar area on Open Table we were seated immediately when we arrived, even though it was very busy. There was also live music in the bar area which was a nice surprise. Our old fashioned's were great and I cannot say enough about how great the Fish fry was. The battered cod had a great, crunchy batter on it that was just delightful and I was thrilled to see potato pancakes (with applesauce!) on the menu. The server we had was great and the owner even stopped by our table to see how things were going. There were some small issues during our meal though. One round of old fashioned's did not look or taste right so we sent them back and the bartender did not seem happy about it, made us feel like a nuisance. Then the kitchen forgot my roll that came with the fish fry. Small hiccups, but overall had a great experience and plan to go back. The Verona Woods is a great addition to the Verona area and I'm looking forward to coming back when the patio is open."}
{"text":"A great place with a couple of frustrating little issues.   First, the service. It's not \"bad\" per se but it's really random. Sometimes terrific and sometimes slow/disorganized.   Second, the wait for food. Maybe this is related to the service but I have had a couple of REALLY long waits here.  Now the positives; excellent quality food, a varied menu, beautiful interior and wonderful bar. Some recommendations; the sliders, the ribs and my god the fish fry! Best bluegill I have had, period."}
{"text":"Horrible service. My team members and I went in at 8:30pm, closing time was 10:00pm. The waiter told us the kitchen may not be opened after the front receptionist handed us our food menus. Long story short.  Very slow service. I went to the counter several times to ask for drinks, food, napkins. No one came to our table expect the manager after about 20-25 mins waiting, not exaggerating. If I could rate her service I would give it a negative score. Very rude. As a manager where you provide service and customer service, do just that! Provide service. Or at  least have the decency to be pleasant and respectful. So finally the food comes out, 2 of us ordered steaks. They tasted ok, I was hoping they would be at least warm if not hot. Lukewarm. Potatoes were good but once again, barely warm. So disappointing. If service was better, and managers attitude in check, this could have been a much better rating.  I felt bad for the bartender though, he did apologize in the end and stated it was his first day, understandable.. but as a bartender, be friendly at least and not towards the end where you plan to milk for a tip. Thankfully the drink was good."}
{"text":"The verona woods deserves the 3.5 stars it has.  Location: new construction. Very nice on the inside. Lots of nooks. 5/5  Service: it seems like from the reviews service can be hit or miss. The feeling I got there was it may have overbearing management that instead of fostering a team, rules with an iron fist. We had good service. Our server seemed a bit inexperienced but was very friendly and came by several times.  Perhaps spending time/$ for training might help.  4/5  Food (what counts): here they fell flat big time. Friday cod fish fry was quite overcooked. The garlic potatoes were glue-like. The farrow grain cake dish was ok. I will say it was well balanced; having separate components that were sweet, salty, and acidic. The problem was that the cake itself was very bland and one note. The one good part was the clam chowder. 2/5  It's a new restaurant with an inexperienced staff and a chef that sent out food he shouldn't have. Hopefully they will get better.  They have potential but not a place I would return to unless I learned of major changes (i.e. new chef)."}
{"text":"After a long trip from out west, we checked into the Hyatt across the street and saw this place. It was late and was worried the kitchen would be close. It was open for another 30-40 minutes. They didn't act as if we were putting them out. The server , Logan, was cheerful and pleasant.  Orders were taken and food brought out in a timely matter.  Interesting menu, burgers, chops, some seafood. They have a fish fry too. Not being too hungry I order a grilled cheese, pesto avocado sandwich. The bread to filling ratio was a wee bit off, too much bread, left most of it. Other order was a stuffed burger, quite good. Soups of the day vary. They pour a good drink too."}
{"text":"I wanted sooooo badly to love this place.  I have been there 8 times, each time desperately hoping the service would improve but, alas, the last experience has given me no option but to give this one a low rating.  What's good - the location.  The location is great as it's mixed into a mecca of fast and cheap food.  The bar area is very nice too. Great beer selection (lots of micro brews).  The food itself is average.  Nothing to write home about but edible and fine.  I have had pasta, steak, fish fry and sandwiches.  All were nothing extraordinary. Don't come here expecting the best meal of your life.  Why do they get a 2 star from me?  Terrible service.  Not just one visit but over and over again.  First, trying to get eye contact from a bar tender has been close to impossible on at least two visits. I mean, it was actually quite remarkable.  Four bartenders would be there and EACH ONE is looking down at their feet rather than scanning the bar for the next person to be served. I honestly don't get it.  Wait times for food and quality of service have been just awful.  Last weekend a group of 6 of us went out for dinner and, after ordering, waited 45 minutes for food to arrive.  The server did very little checking in with us during this ridiculous wait time. I mean, if you're going to have people wait almost an hour for their food at least make sure they have a drink!  Once the food arrived it was cold! Two of us had to send food back because it was at room temperature.  Awful. But the worst part, very little apology. The manager did come out to hear our complaints and said he could \"see what he could do\" and we never saw him again. We did get 50% off our bill which was very generous and nice but the words \"I'm sorry\" vs. excuses would go a long long way.  I'm so disappointed.  Even when the food is kind of 'eh it's really the service and slowness that will stop me from coming here again."}
{"text":"Great food sophisticated menu.  Wait staff were very attentive. We will be back. Pear Blackberry Cider was awesome!"}
{"text":"NEGATIVE STARS. ATTENTION ALL EPIC PEOPLE and anyone else who values a good dining experience. Don't spend your per diem or your own hard earned money at this restaurant!!! The food was fine. But the service and the attitude of the employees here are HORRENDOUS. It was 8pm when my two colleagues and I walked in to meet our group. The hours posted say it closes at 10pm. We were reluctantly greeted by an older lady and a young lady, supposedly the \"manager\" that night...more on that later. They both acted pretty strange, awkward, and reluctant to seat us bc we were wanting to sit with our group even though we said it's fine we can sit anywhere. Our group was almost done so the 3 of us decided to sit at a high top by the bar. Nobody gave us menus or offered us drinks. Aside from our group (already done eating) there were maybe 5 other customers in the place. We went to the bar and ordered drinks from a very flustered bartender. The cocktails were fine, he didn't mess those up. Had to scrounge up our own menus. Not given any utensils or napkins. We again went up to the bar to order food. It's 8:30 now...dude says, let me check if the kitchen is open. And disappears for a bit. Wtf, remember the posted hours are until 10pm!!! Finally \"manager\" girl gets to the bar and pulls out a notepad to take orders, CONDESCENDINGLY says with a fake smile \"what would YOU like??\" (At this point it is taking everything in me to bite my tongue bc I'm representing a company and don't want to be a straight up b#tch). As I finish my order, I clearly and nicely tell her we will need separate checks and she acknowledges this. We ask \"manager girl\", we're just wondering what time it closes....she says \"I'll close whenever you guys leave\".....again fake nice and fake smile. We clarify that the hours say it closes at 10, so is it 9 or 10? She says, through her teeth \"10 is ok\". UMMMM WHAT??? What kind of an answer is that? The SIGN says 10pm....so why would the kitchen close at 8:30pm?!? And why don't you want to actually answer the question? You want to be open for an hour and a half and not serve any food?   Food gets there. My fish and mashed potatoes were good. My friend's steaks and Brussel sprouts were COLD. COLD STEAK!!! F it by then, too tired and waited too long to care about complaining. Dealing with these people. Check comes on ONE tab even though we told her we needed separate checks. Takes \"manager\" forever to come back out from the depths of the back office or wherever the hell she was. Charges on the bill were wrong and of course she is the only person who knows how to fix it.   Look, Verona Woods...I get it. You guys are new-ish. But there will be many many groups like this coming from Epic. Get yourselves together. There was literally no one in this crap joint. We were all pretty relaxed and not in a rush. Just wanted to eat. No fuss. You'd think you'd provide some decent customer service. Or apologize for things and do some damage control when things aren't going right. Or be honest and say, I'm sorry we close at 9. Don't be fake, we're not idiots. People like us give a lot of business to restaurants in the area and believe me, people will go elsewhere when we pass the word around about bad customer service. CUSTOMER SERVICE. It's BASIC.   Also nobody seemed to be helping each other in there. The \"manager\" girl was not helping the other servers who seemed flustered and didn't quite know what they were doing. The servers weren't helping each other. This place is a hot mess with people who don't actually care. Too bad because the decent food is overshadowed by poor preparation and a crap staff. I'm coming back for more training at Epic but I will NEVER EVER come back to this place again! AND the word will be spread to our Epic hosts and colleagues. So I hope you learn to manage your worthless employees."}
{"text":"I'll start with the 1 positive of our experience, they had our reservation and we were seated immediately, it goes down hill from there. The owner told another couple as we entered that they had been open about a week+ and were operating at about 50%, which I took to mean that it was going to be hit or miss. It was a MISS.  Sat us down under this huge photo of birch trees (must be the woods in Verona). Behind us was the cash register and waitress ordering PC and the other way was the alley to the kitchen. Basically we were in a hallway and the noise level is not conducive to a conversation across the table. As soon as we sat down we could feel a draft coming from the kitchen side, which led me to believe they had an outside door open. Another couple seated just after us, also put their coats back-on so I assume they felt the draft also.  The waitress took our drink order and a few minutes later was back for our dinner order. Linda ordered the single pork chop, whereas I ordered the 6 oz filet mignon, medium well. There is no bread or salad with any entrees, you have to order these separately. The meal came about 20 minutes later and I cut into mine and the steak was still moving, medium rare at best. I called the waitress over and told her it wasn't cooked enough. By the time I got my meal back Linda was done eating hers, which was somewhat tough (pork chop). Now my meal ended up being well done, so the kitchen has some real work to do. Additionally the 6 oz. steak was barely 4 oz, if that and maybe why they cut my portion of the bill in half even though the waitress told us they were only going to charge us 50% for the entire meal.  Told the owner on the way out the door of the issues and he seemed to brush them off telling us we haven't had these issues before. Suffice to say this is a 1 and done for us!"}
{"text":"Service is extremely slow, non-existent would be a better description.  The fish was good, but the garlic mash had way too much garlic powder in it.  Based on time from seating to service, and quality of food, can't give a solid review."}
{"text":"Heard good things, so my wife and I decided to stop for drinks and appetizers. We were greeted, seated and waited on almost immediately. Had a really nice young man as our waiter who made some great drink and food recommendations. We ended up ordering the Brussel Sprouts as an appetizer which were fantastic, I had rIbs and my wife had a chicken entrée that were also excellent. Service was top notch and had a great conversation with the Owner before we left which ensured that we will definitely be back."}
{"text":"We went here after hearing great things. We arrived to find the restaurant basically empty on a Saturday night. I ordered the Street Taco's with steak for $12. The steak was dry and the tacos were bland. For $12, you would expect more than just 3 tacos....maybe some rice and beans??? My wife ordered the Gorgonzola Honey Pear Salad. It was $14 with no meat. She said it wasn't anything special.  This place is overpriced and the food is nothing special. The only reason we would ever go back is for a cocktail on the patio where they had live music playing. Don't waste your time/money on the food. The service was good though."}
{"text":"I'm so happy Verona got a restaurant like this one. It's classy beautiful restaurant I love the bar area. I've been here twice now. First time very busy my steak was way over done but I still liked it. I personally won't order the 30$ steak from this place but the other options are great. Cheese curds so good top 5 favorite so far that I've tried in Madison. The bartender he gave great service and seemed cool. I read the halibut was a must try so I got that my second visit. Very delicious I loved the sauce it came with. I al so heard the ribs are a must try! The food for me is a 3 but service and atmosphere a 4 and I'm so glad it's close to me in Verona. I plan on trying a lot more items! Also major kudos to the hostess got me a table right away on a busy Saturday because I was just dining alone."}
{"text":"We love The Verona Woods for lunch and dinner.  The Busted BLT salad with grilled chicken is a favorite.  We also like the ribs!  The staff is very attentive."}
{"text":"The Verona Woods is a newer restaurant, right across the street from the Wisconsin Brewing Company. I've been here four times now, and each time I've left feeling happy and full. The portions are a little on the large side which is OK for me as I enjoy not having to make a lunch for work the next day. My favorite menu item has to be the Buffalo chicken nachos. Although, everything I have tried has been delicious.   The dining room is fairly large, and is sectioned off into different rooms, which is nice to keep the noise down and gives a better feeling of privacy. The bar area is fairly large as well and they occasionally have live music--guitarist/singer. There is plenty of parking and they do take reservations.  My only complaint is that every time I've been here the service has been on the slow side. This might just be a kink that comes along with a newer restaurant, and hopefully service will improve with time. It's nice to have another great restaurant option without having to drive down town. I'm already looking forward to going back."}
{"text":"We went for Mothers Day brunch, the food, not good. I didn't like anything. It was poorly prepared and sat too long in the buffet. The service was chaotic and at $26 a person with the mandatory 18% gratuity I felt taken for a ride. Two stars for ambiance. Usually I am pretty forgiving if service is off, but the food was not good. This restaurant needs to get its act together, right now it has a lot of potential, but potential only gets you two stars."}
{"text":"Best Old Fashioned you'll find. Food is very good as well. I've had the pork chops a couple times and they are fantastic. Mother's Day brunch was quite good as well. Verona needed a place like this badly."}
{"text":"We came in on a Monday evening at 5 for a quick dinner before an appointment in Madison at 645. We allotted ourselves an hour, which for an early dinner I would think would be sufficient. We sat and were greeted with water and a quick mention of the soup of the day. We were told he would be right back.  We planned on ordering a beverage and appetizer as soon as he came back. It was ten minutes later when I got up to see where he went. We were the only table in the dining room and a few people at the bar. He finally came and we decided to just order our entree and maybe get dessert. He did bring my soup right away and it was nice.  He never asked again if either would like a beverage other than water. Our food came about 20 minutes later which is an acceptable amount of time. During that time I never saw him until we both were finished. He offered a dessert menu and we asked to see it. Apparently he either couldn't find one or they were not available because he awkwardly listed them. None were appealing to us. We passed on dessert and quickly paid our bill.  I wouldn't say it was awful but the experience was quite unremarkable."}
{"text":"I'd like to first start this review by giving a shout out to our server Zach for making the dining experience so great. My girlfriend took me here to celebrate my birthday a couple months ago. I'm just now writing this review because honestly the place keeps coming across my mind when weighing dining options. The food was great; I had the signature ribs... amazing. Only regret is not getting the full rack. For desert was the house specially served deliciously next to a nice scoop of ice cream drizzled with chocolate. I'd definitely go back to this place. There was live music playing to a trendy crowd in the lounge while the dining room was filled with an ambiance of conversation. So delighted to have had this dining experience. Thanks to a job well done"}
{"text":"Two stars is a stretch, unfortunately. Cold food, bad acoustics, and a rather aloof hostess. We won't be back."}
{"text":"Loved the house old fashioned. Bartender was knowledgeable and helpful. Fish tacos are excellent and burger was good but messy. All in all a fun place for snacks or dinner"}
{"text":"We are ecstatic that Verona finally has a high quality, interesting and delicious restaurant that everyone in our picky family can enjoy. The menu is quite extensive and well-rounded. The vegetarians in the group were quite pleased by the selection, especially the faro cakes. As others have stated, the Brussel sprouts are delicious. I've had a Brussel sprout and leek soup lunch there and couldn't have been happier. The service is warm and friendly."}
{"text":"Great atmosphere, owner was very pleasant walk around to all of the tables...A nice welcome to Verona .. The Verona woods, staff , server , food was outstanding!"}
{"text":"We were looking to come back and I thought I'd check out Yelp for recommendations. Was surprised to see only 3 stars!  Our party went about 3 weeks ago and had drinks, appetizers, and entrees. All very impressive and service was great.   As others have stated, the Brussels Sprouts are amazing! We had people in our party not a fan of the vegetable beforehand and by the end of the appetizer they were impressed and said they'd order them again. Delicious!   Cheese curds are different than the normal. Not greasy and slimy like many places can get. These were cooked beautifully and had a delicious, crisp texture on the outside.   I got the Shallot Cream Chicken for my entree. I'm not usually a standard meat and potatoes kind of guy, but I took a chance that the dish would be elevated and it was. The bourbon glazed carrots are outstanding and the garlic cream sauce was perfect!   We were really impressed with the service and the food. Loved the atmosphere too! Nice enough to feel like a solid night out but casual enough that you could wear shorts and a polo. Will definitely be back!"}
{"text":"a friend and i went on a friday for fish. The fish was greasy, fries were cold and soggy.  the people that worked there didnt know much and seemed really stressed out and not at ease.   we lucked out and had a nice waiter that tried hard and worked with what he was given.  he did bring out new hot crispy fries and apologized and agreed people that worked there  were stressed.  i say it comes from the owner.  he seemed oblivious.  but when you ask a waiter and they agree, it is true.   i would not go back."}
{"text":"Love the atmosphere, great potential. Wonderful beer list and cool technology that displays the current list and individual beer info on the flatscreen TVs. Highly recommend trying the cheese curds, which are made with muenster cheese sourced out of Monticello, WI. Very different from your typical curd! Excited to see this place implement some fun events, definitely a fun location with Wi Brewing just down the road."}
{"text":"The food here is quite good and it's a pretty nice layout. Every time I go the service is absolutely terrible though. I have given this feedback multiple times and the management has done nothing to improve it. Water is never filled, there is always a long wait, the waiters are constantly interrupting conversations, they prevent seating you if the kitchen is backed up; which just means they neither want you to have drinks and a place to sit while you wait nor can they manage their kitchen well. Their bartenders don't make descent drinks either, they really need to read some mixology books or watch some you tube videos. If they could fix the service it would be a good place."}
{"text":"This is a wonderful place. We had lunch. 3 specials of which we ordered 2 and both were well prepared and enjoyed by us.  The wait staff is most friendly, knowledgeable, and very efficient.  Easy to find and off the well traveled path."}
{"text":"Dining experience was on a Tuesday evening, business causal diner. Really nice atmosphere, no wait for party of five. Meal took some time, drinks to table were SLOW but waitress was pleasant. We had amazing caramel apple brandy old fashions. I ordered the house specialty, single pork chop and spouse ordered double chops. We specifically inquired and waitress confirmed they were thick and juicy--house specialty (diner party are all swine scientists). Meals finally arrived, my chop was thin (grocery store thin), chewy and well over cooked. Spouses were thicker, somewhat over cooked. The positive, the sauce and garlic mashed potatoes were tasty. Others in diner party were satisfied with their selections. I took the risk of embarrassment and sent my chop back and in about 20 minutes, I received what I should have. A beautiful, thick and cooked to perfection pork chop (Costco cut) - the chop one would expect for $18 (however, I was left with cold mashed potatoes).  And it did feel awkward, everyone else having finished, onto coffee, and I just started my meal.  A man did appear at our table to inquire about my new pork chop, apologized and moved on, nothing else.  I see this restaurant as having potential however, if you want us to come back and bring more diner guests, why not pamper us with free desert??  My final review: Mediocre and pricey."}
{"text":"Based on one visit, I'm going with 3 stars. The entrance/host stand area is awful and allows zero room for flow, making it awkward for the host to actually even greet and seat you. Otherwise the restaurant is very clean and nice looking. We were seated in the bar and served by the bartender. Very friendly, but obviously new and not really able to keep up with just 3 tables and two bar guests. Also not well-versed on menu- couldn't answer a couple simple questions, didn't offer to seek answers. Not necessarily his fault, seems like there are some management/training issues to iron out. Food was good, but overall don't feel the need to rush back here."}
{"text":"I have been there twice. First time for lunch a couple months ago and second time last Saturday for dinner. The food and service were great both time. Our server Zach was very efficient and attentive. He checked on us at just the right time and was very patient when there was a misunderstanding about the bill.  The food was delicious. I ordered the ribs that was the special on Sat. It was flavorful and very tender. My mom also enjoyed her Almond crusted salmon. She said it was cooked just right. My husband enjoyed his baked ziti and crispy Brussels sprouts. We will definitely go to this restaurant again."}
{"text":"Good food and service. The harvest salad was delicious. Kid's burgers were also good and on tap beer selection was great including Midwestern brewers."}
{"text":"I haven't tried the food here yet until yesterday due to all the negative food reviews. I ended up getting the dry rubbed wings and they were delicious! Wasn't a fan of the ranch or blue cheese dressing but thankfully they really don't need any kind of sauce. The bartender was super attentive with refilling my water glass and the service he gave was fantastic. We had a good time here and the noise level was decent."}
{"text":"Consistently great food.  I've eaten here on several occasions, and the food is always delicious.  Most recently made a reservation for 2 on a Friday night.  No wait for our table. The front-of-house owner made sure we were treated right. He took our order and suggested their popular appetizer: Crispy Brussel Sprouts.  Love, love, love the brussel sprouts! Amazing how crispy (and tasty) they are. Chunks of pancetta and balsamic glaze added mmm-mmm yummys!  We both chose a Friday Fish Special. And when I asked for a side that was listed on a table sign, I was thrilled to see that staff hustled to remove and revise ALL table signs in the entire dining room by the time we left!  We enjoyed our Baked Cod dinners very much. Between splitting the Brussels and each having fish dinners we were both happily stuffed.  This restaurant does NOT disappoint!"}
{"text":"The Verona Woods = Basic  The halibut was excellent, but one of the appetizers we ordered was never brought to the table and the other one was nothing special.  Our waiter tried to rush us out before dessert; and when we ordered both regular coffee and decaf coffee, we were told the restaurant only has one coffee pot.  Finally, don't agree to eat your meal in the bar unless you have no plans to talk at the table--because the live music is very loud.  (It was even pretty loud in the dining room.)"}
{"text":"This was our second visit and probably our last.  The first time, we were a group of 7, very soon after the restaurant opened.  The food got to us very slowly, but we understood that they were just getting started and will give them a pass for that.  Besides, our group enjoyed the time we had to talk. The food was good.   Last evening we dined again with some friends who had not been there before- their suggestion.   The restaurant is very nicely laid out and the furnishings are attractive. We were greeted by our waitress right away.  We were chatting, so she actually came back a couple of times before we ordered.  All of us ordered soup- one asking for a bowl. It took a looong time before any food arrived and it was everything we ordered at the same time.  The person who ordered the bowl of soup only received a cup.  None of the rest of us got our soup, so had to ask for it.  The waitress took the cup from the person who ordered the bowl and gave it to a different person. We had to ask again for the fourth person's soup.  I have been eating out for about 50 years and in my experience, soup and salads are served first, the meal afterwards. So if it is your policy to serve it at the same time, you might want to tell your customers.  And, by the way, my soup was cold.  It (cartelized leek) probably would have been good hot.  After we got our food, a couple of us ordered more drinks.  After 10 minutes when they still hadn't strived, we asked again and I said I no longer wanted my glass of wine, since I was almost finished with dinner.  Of course, they served it anyway several minutes later.   The food is good, but with this kind of service and the number of great restaurants in the Madison area, we probably won't return. I hope they get it together."}
