{"text":"Well, I was excited to try this place after having heard from several people about it. We were a group of seven people; we made a reservation.  We were seated promptly and served drinks. That's when the good ended. We waited for our order for two - yes, two- hours. Why do fish cakes take two hours to prepare is beyond me, and they weren't even that outstanding. The presentation was sloppy. At the end of the evening, if I was the owner/manager, I would have offered free drinks, desserts on the house, something. None of that happened, so my dining dollars are not going to this place anymore."}
{"text":"Great addition to the Pickering Village as a traditional and intimate local pub. We had great   weather so we sat on the patio for a beer and meal. We had tried Old Flame dirty blonde in  Port Perry and were pleasantly surprised to see it on  the menu again.  We ordered chicken fingers and fries which was perfect casual fare. We were told a new menu  was coming  out. Will be back to check it out."}
{"text":"Very good fish and chips here. It was our first time here and we all got the same thing. Service was very good. It's a nice place with a small patio and bar area. We sat upstairs and I've attached a picture I took. We'll be back!"}
{"text":"This place is a lot of fun. Cozy spot with fantastic patio, super friendly service, home made food and lively atmospere.  Highly recommended and will be back"}
{"text":"My boyfriend and I went here last weekend for our anniversary! We're from Newfoundland and it was perfect for us, we had the Galley Special which was delicious Fish 'N Chips made with actual cod! Such a rarity in Toronto! The atmosphere is great, lovely outdoor patio and they have some live music there on some nights as well! We will for sure be going back and i definitely recommend it :)"}
{"text":"Randomly decided to try this place for lunch.  For an appetizer we ordered the bacon wrapped scallops which were amazing!! I then had a cheeseburger with fries and gravy. Everything was prepared quickly, and the food was really good. I will be back in the future and would suggest trying it yourself."}
{"text":"Absolutely perfect! Service is great, owner is super friendly and the atmosphere is cozy. We got the fish tacos, poutine and honey garlic wings and they were all phenomenal. They make their own fries and gave us each a warm home made bun with butter on the house. Definitely will be going back and trying out the whole menu. Prices are average for a pub and they have upstairs seating as well as a patio!"}
{"text":"The Galley beer is amazing....the food is very cheap but typical pub food! I love the deep fried pickles and the portions are huge"}
