{"text":"This review is for the Grill at the Gold Spike.  We just finished having a late breakfast here, and I couldn't be happier with our choice.  Our server, Angelina, was so incredibly friendly and patient with our questions, and make absolutely sure that all of our food was compliant with our various dietary restrictions.  She was attentive and funny, and you would be lucky to have her as your server.!  Also, the chef, Don, even came out of the kitchen to talk to us and make sure that the dish would come out exactly like we wanted it.   Awesome service by both of them!!  The food is really good as well, a great alternative to the myriad of greasy, fried, fatty, bloating options in the area.  Try the steak loin salad, it's delicious and won't make you feel like you need a nap after.  Prices are more than fair for what you get as well.  For a relaxed breakfast/lunch spot with great service and healthier options, definitely give The Grill a shot!"}
{"text":"This place was so awesome for a small good relaxing  breakfast spot! I felt like it's a little secret .. tried it for the first time today &I would totally bring other local friends here.... , was so nice ! Thank you !!"}
{"text":"I have lived in this area before and actually played the TPC course and never thought to get food here until a friend of mine said they had a new menu and it changed its look to a Gastropub and they stocked up on local beer said it was really worth checking out. So I decided to go check it out and usually i just get an entree but i decided since it was a new menu to go through the motions you know appetizer, entree, dessert. Lets start with the appetizer Duck Confit Tacos.....OH MY GOD these were amazing and if my meal was gonna start out like this my expectations just got a lot higher cause these are worth getting. There was 4 small tacos great to share with someone or if you are like me and can take down some food a good starter. Now for the entree Deep friend Lasagna which once again blew me away and later i found out it was a recipe from one of the chefs grandmother which instantly means its gonna be good so being that i am a big eater I took that down without a problem and almost skipped dessert which would have been a poor decision on my part. I asked my server what he suggest as i always do and he suggested the buttered mac 12 creme brûlée as it was touched up with a mac 12 year scotch and had raisins soaked in burbon and with each bite i became more and more happy which my decision. After all was said and done this was not that expensive and i felt i got more than my moneys worth. I highly suggest this place to anyone looking to have a good meal at a good price."}
{"text":"The Grill is a great place, and very reasonably priced.  I have tried their Cheesesteak and Chicken Philly and was very pleased with the quality of the ingredients used, and the taste of these subs.  Their fries are fried in peanut oil and are also very good and fresh also!  there is a nice little condiment section so that you can add picked or hot peppers and sauces to your order.  The Grill is nice and clean, and a great stop for a quick food fix!"}
{"text":"LOBSTER! LOBSTER! LOBSTER!  I recently dined at the Grill at the TPC ( A Fairmont Scottsdale Princess Restaurant)  and boy was it great.  They are running a summer promotion \"Lobster Fest\", and it is everything you could ask for.  It is a 3 course 38 dollar menu that is super divine.  I started with a caesar salad, my wife had the bibb wedge.  Both were simple and exceptional.  For the entrees you get to select a lobster preparation, either broiled, mesquite grilled, or \"thermidor\".  I went for the \"thermidor\" as I have never had it before.......DELISH!  its some sort of creamy, succulent sauce with the lobster all chunked up and stuffed back into the shell, than baked until it is golden brown and bubbling with love.  My wife had the mesquite grilled which was slightly charred, super sweet, slightly smokey and most of all PERFECTLY COOKED. They give a selection of sides to enjoy family style.... we went for the crispy redskin potatoes, so simple yet SOOOOOO  GOOOOOD.  we also had the Summertash, a mix of grilled corn and other vegetables, this side was to die for.  For dessert I had the chocolate eclairs...so decadent, my wife had the summer grilled peach with tarragon ice cream, yes i said tarragon.  covered with salted caramel and struessel topping..  what a treat.   If you havent been to the Lobster Fest, you need to get there NOW... did i mention it was 38$ FOR LOBSTER"}
{"text":"I stopped by the Grill one night, a few weeks back. I showed up 10 mins before closed and they were more than happy to help me.  They recommended the cheesesteak and I was happy to agree.  Sub was great, fries were great and the service was good as well.  I will bring my wife by to try a sub soon."}
{"text":"The Grill is the restaurant attached to the TPC stadium golf course and is run by the Fairmont Princess Hotel.  It was formerly a steak house, but it's theme was changed to chop and fish house to avoid direct competition with the other property restaurant, \"Bourbon Steak\", a Michael Mina signature faux chic-dive that can barely get food out of the kitchen.    The Princess closed the other property restaurants, Marquesa (5 Stars) and La Hacienda (5 stars) to drive business to Bourbon Steak. The Grill easily and seemingly without effort beats the Bourbon Steak restaurant hands down in every category.  During the day, for lunch, the views of the golf course (#18) are restful and pleasing.  The golfers add a pleasant touch to the view. At night, the view is inky blackness, which is ok by me.  I never understand how this place survives.  In spite of the Princess Hotel total lack of interest in the success of this restaurant, The Grill continues to be a great place to get an if somewhat expensive, excellent dinner.    In fairness, in terms of cost, it's no worse than Mastros, Ocean or any other high end restaurant, and certainly less expensive than Bourbon Steak, but the setting is much more intimate, the service much better, and the food every bit as good, if not better than those other \"must do\" places.  The staff is always knowledgeable, friendly and attentive.  I've been many times and have never been disappointed.  The service is, in a word, professional.  Our recent dinner of Vermouth Mussels, Appetizer Ravioli, Fillet Mignon, pan seared mushrooms and risotto was up to their usual standards.  The ravioli in particular was incredible, sparking a small battle for a access to the delicious pasta.  Although we didn't have fish, the fish menu is pretty extensive and always done well.  The table next to us ordered the lamb and I could overhear them raving about how good it was.   I had the lamb last time and was pleased. We were similarly happy with our choices on this occasion.   There is an extensive wine list and a good selection of by-the-glass choices.   Bottom line:  If you are looking for white linen tablecloth experience, The Grill is the place to go.  Good food, professional service, you will be able hear your dinner companions and you will be well taken care of.  Update:  The Grill is only open for breakfast and lunch during the summer (June - August) months.  Sill a great place to go for lunch until it re-opens for dinner."}
{"text":"My boyfriend played in the TPC tournament. We decided to have dinner here. It was wonderful from start to finish. I had the prefixe which included seafood chowder, fresh salad, lobster & peanut butter tower. We also had a crab cake for an appetizer. HOLY. I consider myself a picky eater. I loved everything. Our waiter, Eric was beyond helpful. He was very personable and kind. My boyfriend had the halibut & crab claw. He was beyond pleased. We appreciated the GM asking about our experience. Overall, one of the best restaurant experiences in my 35 years. We don't get service like this in San Diego!"}
{"text":"Is it possible to go below 1 star? Seafood, even in Arizona, shouldn't be this bad. Soup was cold, scallops smelled like they'd been rotting in transit from the ocean and the lobster tasted almost as good as overcooked styrofoam. The saffron had a hint of dirt flavor. I was embarrassed for the chef. I've never walked out on a meal until eating at the grill."}
{"text":"I went to the Grill Friday night with two of my girlfriends. We sat outside on the beautiful patio overlooking the golf course. There were several other people dining outside- the patio has been remodeled with new furniture, a bar and even televisions outside- so relaxing! There is a new gastropub-style menu so my friends and I got a bottle of wine and decided to try a little of everything. We had the truffle deviled eggs, cheese plate, duck confit tacos, ahi tuna, duck fat grilled cheese and kiltlifter fish and chips- everything was delicious and perfect for sharing! The wasabi crusted ahi was my favorite, but there are so many other things on the menu that I can't wait to go back and try. Staff was really friendly and attentive. Amazing menu and one of the best patios in Scottsdale!"}
{"text":"After getting a recommendation from a friend to check this place out, I took my brother there for dinner who was visiting from out of town. He wasn't staying at the hotel, so the venue was not a typical dinner one for me: I'm from Tempe and tend to eat close to home. The drive was well-worth it. The food and service were excellent. I had the halibut with corncakes - all cooked to perfection. The fish sat on a corn relish that was a refreshing accompaniment, and the dish was a nice balance of sweet and savory. My husband had the bouillabaisse, which was served with the broth on the side and seasoned deliciously. My brother ordered the pork osso bucco with beans. The pork was falling apart tender. Angel gave us delightful service: he was comfortable, non-intrusive in conversations but attentive and informative. He played a big role in this delightful experience. The atmosphere leaves something to be desired, and is the only reason this place gets four instead of five stars. The music is elevator music-style, and the decor is very country club-ish. We went for dinner, so it was dark, but I imagine the view of the course would be beautiful during the day."}
{"text":"While the food is OK, the prices are obscene-even by Snottsdale standards. Yesterday our waiter couldn't have spelled his name right, let alone get our order straight. Fish & Chips instead of French Dip? That's hangover hearing!!! This was our second (and last) trip. No happy hour pricing and spotty service aren't a match for the nice venue-AZ has lots of pretty that comes with great food and service. Sayonara TPC."}
{"text":"Came here because they were on the list of Phoenix Restaurant Week, and chosen the entries of Seafood Chowder, Lobster, and Creme Brulee. The environment is stunning, we were right on the moment when the sun was down to the horizon, left a golden brush touch on the sky with the golf course, the view just beautiful. The entries were pretty good, I still feel like the lobster is a bit over cooked, but it still good. Service is great, definitely will go back again"}
{"text":"Came by for breakfast after a 5K with Cassandra B- originally, the race organizers had planned for food and drink specials here at Gold Spike, but when we arrived, none of the staff were aware of anything of the sort. We ended up at The Grill to grab a bite for breakfast, and it was pretty average.  I'm not a huge breakfast fan, and I typically choose not to dine out for that meal as options are limited and the food is generally pretty standard- it's hard to screw up the usuals, and often even more difficult to make them stand out. That said, Cassandra's pancakes were downright bad while my simple breakfast burrito was nothing special.  Service needs to step up- even if this is down by Fremont, there's a certain standard that should be upheld. We were some of the only breakfast customers when we first arrived, yet it took unreasonably long to get our order and it was difficult to get our server's attention to communicate our issues with the food. Not worth another try with options like Eat, Rachel's Kitchen, and MTO so close by."}
{"text":"One of my worst dining experiences.  Way overpriced, service is pleasant but inept, and the restaurant fudged our credit card bill after we signed and submitted it.  They should revamp the entire management and kitchen staff if they want to continue with their high prices and the prestige of the Princess Resort.  Do not waste your money here on a meal.  Get a drink and then head out somewhere else for a decent meal."}
{"text":"Beautiful setting and good service. However, that doesn't make up for the $14 burger which was average at best and all three of ours were over cooked."}
{"text":"Arizona restaurant week,  What an idea!  Three course meals for $29.  I loved this venue.    I went with two girlfriends.   Be sure to ask for a booth rather than a table.   I started with the Chop salad (Avacado, bacon, hearts of palm, tomato, blue cheese and red wine vinaigrette)   Main course was the roast filet of King Salmon northwest spice rubbed and roasted with a touch of huckleberries.    My friends had Colorado Lamb chops and double cut pork chops.   I finished with  carmel chocolate Creme Brulee with passion fruit.   The best presentation of the evening though was the hand rolled chocolate cigar dipped in hazelnut croquant frangelico anglasie.   It had an \"ash tray and matches\" on the plate.  Sounds nuts,  I know, but it was really great.    Our waiter, Angel, was there just enough and carried on the right amount of conversation.  Yves Leger, the wine steward, knows his wine!   He is from France!   I think we embarrassed him when we asked him to say something romantic in French.   He did speak French BUT it was probably his address.  It sounded wonderful whatever he said.    This is a very nice \"special date\" spot."}
{"text":"Amazing.  This is one of the best restaurants I have ever been to.   The food was really well done. The pork belly app is divine.  I also had the double cut pork chop. It tasted like a veal chop.   The view is also really nice."}
{"text":"I wasn't expecting much, but to my delight I loved this place!  Beautiful views of the golf course and mountains, pet friendly patio and freshly made specialty lemonades with the option to add your favorite spirit...great idea!"}
{"text":"Definatly not penn station, but it's edible. I had the Philly cheesesteak and I wasn't impressed. The bread was overwhelming I thought. I don't think I'd go back!"}
{"text":"My boyfriend and I went to The Grill Friday night for dinner and drinks. We sat on the patio where they had live music. It was a great atmosphere and the staff members were extremely nice and personable. They had good drink specials and the food was amazing. I'm not a big sea food person but I tried a shrimp special that night and loved it. It was a great dining experience for both of us and we will be back for sure. I don't work too far from there so I'm sure I will be ordering to go for lunch also!"}
{"text":"Horrible. I had a hour and 15 minutes for lunch. Took me 5 minutes to walk, and it took forever to order, then we got our food at 12:50. I had to eat so fast, to be back at my meeting at 1:15. To many table and chairs in a small place."}
{"text":"Was in here earlier in the week for breakfast.  The table by the window with a view of the golf course and Camelback Mtn was nice.  The food was pretty average.  My mom ordered the eggs benedict.  It took 20 minutes for it to come out.  I had the two eggs, bacon, sausage toast etc. It was OK but not too exciting.  For a better breakfast experience in the area, I'll stick with Over Easy just down the road."}
{"text":"My fiance and I stayed at the Fairmont in Scottsdale to celebrate our engagement, and we had our first meal here. It was great! We had a nice view of the 18th hole (well, it was already dark, but supposedly we were looking out at the 18th hole :)). Our server was really nice, talkative, and informative. We told him we were going to T Cooks for dinner the next night, and he recommended certain dishes and gave us more info about that restaurant/hotel.   For apps, we ordered the mussels that came with the most amazing garlic bread! I ordered the halibut (super soft) that came with little pieces of pork belly on top of tiny corn pancakes!! How cute is that? The fiance ordered the special of the day, which was some type of pork, that he really enjoyed.  Overall - great experience and would definitely go back!"}
{"text":"All of the reviews posted so far rate this restaurant at 5 stars and for good reason. It is great...one of the best meals that we have experienced in a long time. Took advantage of their Restaurant Week special menu (3 courses with a wonderful variety). Convenient location, easy parking, spectacular views of the TPC golf course and terrific food.   A MUST VISIT!!"}
{"text":"Great food, great service (Kendall rocks!!!), great view!"}
{"text":"They changed the menu. NO fried lasagna anymore. No burgers on the dinner menu. The menu is very limited. The food is good but pricey."}
{"text":"I ate at The Grill with Stefany V. after running a 5k downtown. I don't think the staff was adequately prepared to handle the influx of customers coming from the race because it took ages to get my food. I ordered the chocolate chip pancakes, which is actually on the kids menu. But what the heck, old people enjoy chocolate chip pancakes too!        Chocolate chip pancakes ($5): Awful. The pancakes came in a stack of three and looked good, but failed on the tasting good part. The chocolate chips were disturbingly crunchy and tasted off. Is it too much to ask for melty gooey chocolate chips? I took about 4 measly bites and couldn't stomach anymore. The waitress asked if I wanted it to-go. Um, no, because these pancakes taste like ass. 1/5   Service: Wait times to get my order was way too long and the waitress was not the friendly type. 2/5  Worth a return visit? Definitely add Gold Spike to your itinerary if you're Downtown bar hopping with friends, but maybe avoid eating at The Grill.   *I thought The Grill at Gold Spike deserved it's own business page, so I added it! Now Yelpers can review this small cafe separately from the awesome late night hangout spot that is Gold Spike.*  YELP 100 CHALLENGE 2015: #238"}
{"text":"I had previously gone to this restaurant a few years ago. Since then, they have changed the decor and the menu.  Apparently, they have also changed how they treat their diners.  The waiter was very slow and he didn't really try to help us make a decision or describe any dishes that we asked about.  I ordered the chicken soup as an appetizer - it was okay, although the broth tasted like beef broth.  My husband ordered the parmesan salad, which he liked.  I ordered the filet for dinner - it was incredibly salty and the portion was very small for the money we paid.  I'd much rather eat at the White Chocolate Grill - their filet is 10000000 times better.  My husband ordered the halibut (suggestion from waiter) and it was overcooked.  He told him it was overcooked. He offered to get a new one, but my husband said it was so bad he didn't want another one.  Here's the kicker... he only had 2 bites (yes, 2 bites) and they charged us for his meal!  When I asked the waiter if he'd made a mistake, he looked at me like I made the mistake.  He did remove it after I further explained that he didn't eat it (that was obvious), but without apology.  The manager NEVER came by to see what the issue was - not when the food was returned or when we had the issue with the check.  I would NEVER go to this restaurant again.  We are local and there were several tourists there - one couple was playing cards they had been waiting so long!  Skip The Grill and drive 3 minutes down to the White Chocolate Grill."}
{"text":"Food was amazing , a little pricey though. Our service was great, we sat outside and had a view of the course .  I would go back"}
