{"text":"Love this little gem.. great ride up on harley then chill on their deck for great food awesome friendly service.  I highly recommend this place."}
{"text":"First visit and it won't be our last. Friendly staff and great menu. The baked bree appetizer was soooo good. 
Looking forward to the warmer weather so we can try out the lovely patio."}
{"text":"This is a must go to pub with your buddies!
Not your typical pub, because this place is beautiful and clean. Decent selection on alcohol and the food is a little less greasy and more green ! It's not to know I can get a nice beef sandwich handmade and local!"}
{"text":"Go!  its a great place!  fun, cool, and yummy food"}
{"text":"Excellent food and service, a wonderful Pub atmosphere, I had a \"Schomburger\" the best burger I've ever had!
highly recommend"}
{"text":"We went here last week and had a terrific lunch. I had the Turkey Club and my husband had the Schomburger. Both were delicious and a filling!  Staff was friendly and service was speedy. The whole menu sounds great - I will definitely go back!"}
{"text":"Having moved from Toronto to a small town, I was worried about the lack of decent restaurants that were near us. This place is just great! It's walking distance from our home, the patio is epic, the service is awesome and the food is your typical pub grub - comfy and tasty. I love their  $5 caesar menu on Sundays and their skillet calamari is a must try"}
{"text":"The service is terrible. I over heard the waitresses talking about having to deal with customers on the patio.
I was referred to this pub from 1812 grillhouse which is just up the road and is a fine establishment, but this place was nothing like it. 
I ordered an Amaretto sour and the tattoo covered bartender who looked like, and had the attitude, of someone living under the overpass in scarborough  gave me a rocks glass of lemonade.  When I asked how she makes her cocktail she barked \"this is how we make it here\".  This was my first time here. 
While I ate my brown ooze covered fries the two waitresses talked about what a pain in the ass the patio customers were, how they wanted to talk to them and other unthinkable deeds..
If you like to wasted gas and time to get subpar food and lemonade cocktails this is a place for you.  Somehow I doubt it..
I wish there was a 0 star rating, that's what this staff deserves. As if I don't have the option to spend my money elsewhere.
BAD BAD BAD..."}
{"text":"Being about the only pub in Schomberg left few options for where to get a drink and a bite to eat. Finding a parking spot was easy, and even if you parked a few blocks away its a pleasant walk through the historic village but arriving at the pub a car clearly blocked the stairs leading up to the front door. To my surprise the car was owned by the pub, ( a sign on the car door had a big ad on it) leaving a perilous journey over the ice ?..... who would do that ? 

The place was empty, except for 2 guys sucking back draft beer like they owned a brewery but it was a Monday. Finding for a table that was clean, near impossible, as I could see hand marks, finger marks, and what looked to be smeared food done with a dirty rag so I took a seat at the deserted bar. A cute bartender was quick to serve me but when she coughed  while fixing my drink, touching the lime, and placed the drink in front of me replied  \"Oh I have the flu\" . I thought are you for real, your sick as dog, and your serving food and beverages and just mauled my lime.   I felt like ordering a triple vodka to sterilize my glass. Even worse is that she apparently told the management, and the management told her she had to come in, regardless of having influenza ? Whats next, shooters called H5N! ? Definitely not impressed

Ordering the freshly sliced beef au jus, it arrived quick, but it had way too much grizzle in the beef making for a very uncomfortable chew. I wrestled it down and hoped that the next day I didnt wake up with a fever whilst the staff brought food to the bar in plastic bags, and take out containers, and enjoyed their meal behind the bar. Management is clearly missing and if not for the good company of a friend, I would have bailed but really, there wasn't another option nearby.

At tad bizarre, but the smell of old draft beer and butts leeds me to believe that most were still drunk when they wrote their review or its the only watering hole for a hundred miles.

I wont be back"}
{"text":"Great find that could only occur because of Yelp. At Tristan arena and looking to fill an hour...had excellent two pints and a surprisingly great order of perogies. 
Would definitely try this place again with friends to try out other aspects of the menu. 
Try it out!"}
{"text":"Amazing food, great patio for the summer months as well. Try the pulled pork"}
{"text":"- We arrived at the pub slightly early for our reservation for 8 tonight and were seated promptly in the dining room area, which is a quaint little area separate from the Bar area. It was a nice surprise to see that they had renovated since the last time we where there a few years ago.

- Kids meals are slightly pricey at 9.99, however the quality of the food was superb and well worth the couple extra bucks. Both kids enjoyed their dinner and had full tummies by the end of the meal. 

- All of the appetizers for our table came out together and were nice and hot. the nachos with chilli on top were great. 

- Main courses were also timed perfectly and all arrived together. 

- Nice to see great service and a kitchen working smoothly with the dining room.  

- We will definitely return for another visit soon.

- On a side note they had not seen the first order 15% discount from yelp, however, they honored it without batting an eyelash. They simply snapped a photo of the coupon and my bill showed up with the discount. Totally painless coupon experience for the win."}
{"text":"Awesome place honestly worth the drive. Staff is great and friendly and food is great."}
{"text":"I can't say enough about this place. I read another Yelpster say it's got the greatest patio in Ontario.!! Bold statement but true! Great fresh cooked food (firehouse wings are dynamite), good selection of beer and excellent service. We're an hour away but it's our go to pub on a sunny afternoon or warm evening."}
{"text":"5:30 pm on Main Street Schomberg.  

Are we doing A day in Schomberg (2011, population of 2,321)? but everything seemed to be closed! Even Rona! 

The Schomberg Pub & Patio though is a decent place to chill out a little as their patio is nicely set up. You can even use it on a rainy day as they have a little canopy set up and covered some of the tables. Here you won't be get much people watching as the patio opens up into some woodland area. A cottage like setting!

Unsecured wifi but just like any old historical buildings, there are a lot of blind spot where the signal is really weak. I can barely get a signal from my own phone supplier up here....

Beer is the usual Rickard's, Creemore, Canadian... my Rickard's White ($6.25 tax in) though is nice and cool!

\"END OF SUMMER BASH/HAWAIIAN LUAU - What better way to end the summer then LIVE Hawaiian dancers, roasted pig, live music and good times!!\" Hawaiian dancers in Schomberg?! I don't even have that in Markham!

I hope next time when I am in town, the weather will be nice and sunny so I can chill out on the patio a bit............."}
{"text":"We came to visit this pub on the way back from Hockley & we were very happy that we did. Great pub, staff & outdoor patio.  We came for drinks & appetizers & were very pleased.  I checked in on yelp & unlocked a 15% yelp offer.  When I showed our waitress she advised that their establishment does not have such offer.  I showed her my yelp app with the offer & she did say that they did not approve this.  She was nice enough to offer us 10% off our bill but we declined as it looked like they truly have not approved this deal.  So not sure if owners work with yelp on these deals or if this is an error with yelp?  Either way, if I'm ever in the area again, would definitely go back."}
