{"text":"Food was awesome, had a burger, which might sound simple but lately I can't find a good burger without foo foo toppings & then it's about toppings not the burger.  This burger was cooked right and the meat was tasty. The spicy bacon that everyone talks about was good, my husband loved it.  The flight of beer was a fun way to try new beer.  The bread pudding was to die for, not too sweet.  We had to look at the menu's again so we could pick what to get next time."}
{"text":"Amazing food - everything is delicious. The wings are great, the burgers are excellent - everything! And the beer - it's to die for. Decor is a subdued, but the food and beer and great staff make up for it."}
{"text":"Best local bar in town! Beer is amazing and brewed onsite. Food is fantastic as well. Green chili Mac n Cheese is a must!"}
{"text":"Been there twice & both times, the beer & staff were great. Looking forward to going back soon & trying some of the food."}
{"text":"We looked to be the first table of the soft opening on Monday. First thing, a real beer list! Green Flash, Fate, Hess, their own collab with O.H.S.O. I am excited by the beer these guys are getting on tap. Fate is a hike for me and the fact they had that was awesome. We came to eat so we ordered an appetizer first. Unfortunately they had some issues with it, but one of the owners came over and even offered a different appetizer for free, which we took them up on because by that time we had eaten our entrees and they were bomb! I had the Pub burger and my wife had the Cubano, both eaten quickly because they were delicious.   As for BRI's only on tap brew, Mjango Unchained, its a good beer. It makes me excited for whats to come. I think its awesome they have relationships with great breweries like Fate and O.H.S.O. Can't wait to try the rest of what they are brewing in the coming weeks. Will return many many times."}
{"text":"Wonderful place to visit with friends.  Love the food.  Their collaborative beer with OSHO was great (mango IPA).  Our servers Jeremy and Matt were excellent.  Very smooth for a soft opening."}
{"text":"Quality food and microbrews! You may come for the beer, but you will stay for the food. Candied sriracha bacon, fusion street tacos, and more. The wait staff was very friendly and knowledgeable about both the food and beer. Next time I'm in AZ, I will definitely go back!"}
{"text":"Unless I was being pressured to see a chick flick next door at AMC and needed a beer before doing so,  I'd pass.  Brews were so-so (we tasted and opted for guest taps).      We were discussing the pretzel bites, which magically showed up at our table.  We were all confused as to the miscommunication that led to them being ordered,  so I had one... Terrible.  Just then the server came by and said it was a mistake, to which we answered that we'd thought she'd overheard us discussing them.  We sent them back.  The bill came and pretzel bites were on there.  The server asked if everything was OK as she picked up the credit cards,  to which I answered everything except the pretzel bites we didn't order or eat...  The response was \"Uhhhhhhh,  ok.\",  bill was returned with charge still there and she went on to other tables. Not worth the time to dispute.  Don't know if the staff is new to the hospitality biz or what.     Disappointment for sure."}
{"text":"Most of their food is made from scratch, so it takes considerably longer than other places. I got the tacos and they were pretty bland. Wouldn't necessarily go back for their food, but I would go back to try the different beers they brew there. I had the peach one that they brew themselves and it was good."}
{"text":"Well, we decided to give this place a try again since our son is a regular and he told us that they have all day Happy Hour on Sundays with $5 appetizers...we now have a favorite place to go on Sundays! Their poutine is to die for and only $5! They make it  with tons of machaca meat, gravy, queso fresco, and toppings...YUM!! Pulled pork sliders are a yummy option, too.  They now brew several varieties of beer, my favorite is the Morning Sex, a killer milk stout. My husband likes the Belgium Ale. The servers are all knowledgeable and friendly. There is limited outdoor seating and it faces west, so I have never seen anyone sitting there...maybe at night? It looks like BRI has grown up since my first review back in 2015."}
{"text":"i came here for mother's day to enjoy a glorious meal with my mother and there was a picture of donald trump on the urinal for men to pee on with their penis. my golly golly gosh i was very offended as a liberal jew starving artist i did not feel welcome here!!!!! there was frog piss in the tap water!!! beware keep dogs out!!! drink milk!!!! he has risen!!!!!"}
{"text":"Great beers, good food. Lolli is one of my favorites.  Have tried the Spanglish and Pub burger, both excellent. Try the green chili Mac and cheese."}
{"text":"What a joke. I told my fiance he could pick ANYWHERE he wanted to go for his FIRST Father's day. He chose this place. We had the meat candy wings.  They charged $2 extra because it wasn't on \"special\" for the day... not worth it. We didnt like them at all. They were too chard. We ordered the silly philly steak, and the SW BBQ. Turns out they're out of the meat for the philly. My fiance really wanted the philly. He felt pressured and chose the BRI-to. Got our food really fast, cool. The food though,  what a disappointment. My SW BBQ sandwich was small, and the plate was $10. Not woth it once again. His 2nd choice meal was horrible. The sauce on the burrito taste like a heart attack. It was very sodium packed. The most irritating part of it all is the waiter walked by us literally 10 times without asking how the food was, we sat there with half of our food on our plates still and didnt even ask how our food was. Finally he came and pick up our plates and my fiance told him it was not good. Someone came over, not sure if it was a manger because she didnt introduce herself. She said she took off his meal and offered dessert. We took it, why not. Its fathers day. We waiting another 12 minutes for the brownie dessert. Finally he gave us our check he and bolted. I will never, ever go there again. I dont usually take my time to write reviews, but I did for this one."}
{"text":"Great beer selection and the BRI made beer is excellent. The meat candy and pulled pork was amazing. The staff was friendly and service was exceptional."}
{"text":"Had a rare occasion to be in Mesa and and randomly looked up somewhere to eat that is locally owned.  WOW...we hit the mother load!! The service was quick and super friendly, the beer was fantastic and the food was AMAZING!!! We had the College and San Tan IPA and the Lollii Belgian Ale as well as the Sangwich and Carne Asada Tacos.  We did try the pretzel bites but found them a bit dry.  This is one place I would make the drive to from anywhere in town!!! Thanks for a memorable meal!!!"}
{"text":"I was really excited when this place opened!  More craft beer places in Mesa please!  Beyond the really excellent beers however, I really love how enthusiastic BRI is about it's food.  Many of the items on their menu are locally sourced and made from scratch.  Some beer places put their beer first and the food seems like an afterthought.  Not this place!  Even their ranch dressing is made in house (and amazing!)  This place has fantastic daily specials and a really nice variety on their menu.  The service has always been top-notch.  You can tell that these guys really care about quality and are so enthusiastic about what they do!"}
{"text":"Great craft beer, great food and great service.  Cannot go wrong!  Highly recommend the meat candy!"}
{"text":"Very small place but the service was very good. A small selection of craft beers and I tried a couple of the Belgium blondes and a Vanilla Porter. All were cold and good. I ate the Pub Burger with Green Chile Mac n Cheese with sweet potato fries. The food was hot and fresh. The bun was supposed to be a Hawaiian roll but i thought the bun was nothing special. It has a nice decor and I liked that the place was small and seemed so friendlier. I also liked that there were no televisions in there too. I'll definately eat here again."}
{"text":"We stopped in because of the great rating.  Party of four and two of us decided we'd come back, two would pass.  Food was okay and we tried a lot of stuff.  The Spanglish sandwich was the only item we all really enjoyed.  Sorry, everything else was very mediocre.  However, the service was great and the atmosphere pleasant enough.  Beer selection was good and overall, reasonable prices.  Wish it measured up to what we expected but we were a bit disappointed."}
{"text":"So happy to haven given this place a try! Beer was fantastic, there's something for everyone. We had a flight and it was hard to pick just one favorite. Food was more than just typical bar food. Their wings are grilled and their fries are delish. We'll definitely be back to try more of the menu!"}
{"text":"Can't wait to go back! The beer was amazing, staff were welcoming and accommodating, and food was top notch! Love this place!"}
{"text":"Went here the other Sunday. Cool atmosphere and great bartender/waitress. Very laid back feel and everyone was friendly. All of the food was great. I got the Spanglish and my fiancee got the grilled wings (asked for bbq since it wasn't on the menu and they happily accommodated his request). Loooooved the sandwich and it was a good size. We started with the pretzel nuggets after reading other reviews and are happy we did. As for the beer, I only got to one but honestly, you probably only need two to get a good buzz on considering the alcohol content. We'll be back for sure!"}
{"text":"Food was okay, Typical bar food. Inside it is a bit small and the high tables arent super comfortable. They have board games you can play as well.  Would be okay going back for a group event."}
{"text":"The staff are fabulous.   They were helpful in choosing the right beer for me.   Coffee stout is a must try"}
{"text":"Went here last night during their soft opening.  They don't have the B.R.I. beers on tap yet.  I believe they go on tap on Nov 29th.  Immediately after walking in the door, I knew we would enjoy this place.  Very bright, with some booths, and a few long tables which can be shared among different parties, or used for a big party and a great bar. The craft beer selection is spot on.  From AZ local taps, to upcoming west coast breweries, and some craft classics.    As if the beer selection isn't enough, the food was amazing.  Not old school beer pub food, but well thought out and prepared meals.  We had the pulled pork sandwich w/fries, and an order of green chile mac n' cheese.  We were both really pleased with our meal, and that mac n' cheese was literally the best I've ever had (and I've had a lot).    The rest of the menu looks awesome, and we can't wait to try other dishes.  On top of all that the wait staff were super friendly and attentive.  Many different people stopped by to see if we needed anything.  We also had a chance to meet the co-owner Matt who was a great guy and super excited to get his product out there.  Matt even sent me home with a growler, which will be promptly filled when their beers go on tap.  I'm sure their beers will be spot on.  We're really excited to have this place opening in the East Valley.  Can't wait to get back."}
{"text":"They would received 5 stars if it wasn't so uncomfortable to site and enjoy a nice meal.   It is too hot in this place!!! Plan on sweating as you eat! However the food has improved. But still too hot!!!!  Way too hit"}
{"text":"I have been here multiple times. I love their food and beer. The service has always been great. I will be honest and say there are a few items on the menu that are lacking but the server was honest in making recommendations. I wish they would bring back the special Pale Ale (it is brewed for a charity but can't remember the name) permanently."}
{"text":"These burgers are the best ibe tasted in a while. Southwest pastrami burger is the absolute best!"}
{"text":"Excellent...great food and service. Coffee stout called Morning Sex was to die for. Had the stacked enchiladas minus the egg...savory. Highly recommend. You will not be disappointed!"}
{"text":"I'm not a huge beer person so I can't speak too expertly on that but I will say I loved everything I did try! And the \"beer people\" I went with looooved it too.  I wanted to comment on the food though.. FANTASTIC!!! I forget the name of what I had, but it was some of sirracha and egg burger and it was MIND BLOWING! Only wish that I wasn't already so full because I couldn't finish it! Haha and so my husband did the deed for it.   It's reasonably priced, the staff was very friendly, so I give 5 stars for an overall great experience. Check them out!"}
{"text":"I'm writing this at the bar at BRI. I just finished the stacked enchilada. So very good!! It was pretty spicy but not in an overwhelming way. Super tasty!!   The other night I had the Spanglish sandwich. That was another huge winner!!   The beer selection is pretty good too!  You should check this spot out!"}
{"text":"I''ve become determined to like this bar, but there's something off with the ambiance.    The food is killer, we've had the cheese steak, the Spanglish on our first visit and last night the putein and pub burger, and of course tried a handful of beers recommended by the staff; all of which have been amazing!!!!!   I'm not sure if it's the fact that BRI is extremely well lit for a bar,  the poor sound quality from their audio setup, or the lack of TVs, but I am lacking the desire to stick around after a pint and food. I have high hopes that they will get it dialed in and it's well worth a try if you're in the area."}
{"text":"WHY THE BEER RESEARCH INSTITUTE IS ONE OF THE WORST BREW PUBS I HAVE EVER BEEN TO and why I will not be back spending my hard earn money any time soon.  Reason 1:  The first time I went to BRI my wife and I were ignored when we first arrived.  After we had ordered food, my wife and I sat around for over 45 minutes waiting on our dishes.  I let this first encounter slide since BRI had just newly opened, and I like to give people second chances.  Reason 2:  The second time I visited BRI with my two adult daughters.  Their own impression of the place was the wait staff was terrible, but the drinks and food were good.  They stated that they would probably not go back because the wait staff con out weighted the food/drink pro.  The also stated that the bar did not have an atmosphere that made them (young females) feel comfortable.  Reason 3:  I was refused a BRI growler the third time I went.  I drove over 6 miles to try and support this local brewery, but they told me they were unwilling to give me a growler of their craft beer since they were running low on their own beer.  The owner, Matt, said that I could stay there and drink a pint of their craft beer or receive a discount on a guest tap growler.  It was so frustrating for me because I have a professional license and cannot drink and drive since my license could be taken away by the state of Arizona.  I told Matt this, but he still refused.  The worst part of the third visit?  There were only 3 or 4 people in the bar.  Overall: Pros: great food, decent beers Cons:  TERRIBLE CUSTOMER SERVICE"}
{"text":"Beer flight is such a good deal! Favorite beer was Belgian Tickler and the Street Cred. The poutine was a great start, the meat wasn't dry at all. The best part was the vanilla porter brownie :)"}
{"text":"Morning Sex, All Day Long, and \"Not-Chos\"! Short of Licking the Bowl was Delicious'O! Services is always Awesome, friendly, laid Back Environment. Happy Hour specials all day Sunday."}
{"text":"Ok, so I normally like to visit a place multiple times before I review it. This place I have been to twice and had completely polarized experiences.  First time - I went with a group of 8. The beer was good and that was it. Food was not good at all. The service was awful. They were out of a bunch of the beers. Just not a pleasant experience at all.  Second time - It was me and a friend and we had a much better time. The staff was friendly. The food was better. Fixed a lot of the problems from before.  Notes: Try it first on a less busy night. The experience will be much better."}
{"text":"A friend and I had the pleasure of visiting BRI today for the first time and walked away EXTREMELY satisfied and welcomed. We met one of the owners (Matt) outside and exchanged pleasantries and then we walked in and immediately greeted by the bar tender (Rose) and she made sure we never ran out of beer. We split the green chili pork poutine fries and pulled pork sliders. They were both delicious! We tried all BRI beers on tap and had their 480G, Batch #1, and Farmhouse Saison. My favorite today was the Farmhouse. All in all it was a good visit and will be back, especially because I live within a mile and this is a great biking destination on any given day!"}
{"text":"We stumbled upon this place after a movie and were extremely pleased. First, we were nicely greeted and our server was so nice and helpful. We really enjoyed talking to him. Have fun in Seattle, can't remember your name.  the peach beer was delicious, looking forward to some fall selections now. The Spanglish was yummy, my only compliant was I shared it with my husband and didn't get a whole one to myself. Very spicy, good thing I had that beer. We usually don't get desert but had to try the bread pudding. The coffee creme was really special and an interesting topping for the bread pudding. I do wish the bread pudding was a little more moist though. It was a little dry for our taste but I liked that it didn't have the traditional raisins in it. We'll be back to try a few other things for sure. So glad we stumbled upon BRI."}
{"text":"My boyfriend and I love this place. Everyone's so nice, and the flight's around happy hour are awesome"}
{"text":"We went there mid day just before Thanksgiving. I can be a bit hard to find, it is right next to the AMC Theater. In fact, the back door is just steps from the entrance area of the the theater.  It was before their Grand Opening, so they did not have any of their beers on tap yet. (we went their to try some of their beers) What they did have on tap was an excellent selection. Our bartender was very knowledgeable and friendly. We were going to have lunch as well. My son had one of their sandwiches. It was huge and he said it was very good. I opted for the carne asada tacos. The meat was all gristle. I actually had to spit it out on plate. (ugh) The tacos came with rice and beans. Those came in a small container (the kind used for a side of ranch dressing) the Spanish rice was all dried out and the beans were just a small amount of black beans. We are talking $11 for this meal of two(gristly) tacos. (they did take it off the bill without me asking) Everything else was just fine. We went to a movie and decided to return to BRI for a bit. Had another beer then decided to just go to Red Robin on the other side of Stapley for a burger.  I was excited about a brew pub in Mesa. I live in far east Mesa. I will probably stick with Four Peaks."}
{"text":"Seriously one of my best meals ever. Eggs Benedict with in house chorizo, house made English muffin, and avaxado slices w grilled asparagus and a kind of hash vrowns."}
{"text":"This place is the real deal.  Great awesome service and the beer selection is awesome.  Home grown brew to offers from a variety of brewery's in and outside of AZ!! Our server from England was so attentive!!!"}
{"text":"Love this place. Beer is great. My pub burger was so good. The staff is great! I'll be back!"}
{"text":"Went back after they opened to try their beer and food. The beer was solid, but nothing jumped out. It looks like they are trying different things and getting feedback so don't expect to always have the same options.  The food was phenominal. I had the green chili mac and cheese with machaca. It needed a little more kick for me but, after adding a little hot sauce, it was pure perfection. They make all of their food from scratch (except the bread and one other item, but they will be doing thay soon, as well) and it shows."}
{"text":"Great environment! Staff is very friendly and helpful. I am excited every time I visit to see what beers are on tap and what new food item I will try. As for beer war paint IPA is my favorite, but you can't go wrong with Lolli, street cred, vanilla porter, or 48OG. As far as the food goes like I said before, I have yet to be disappointed. Trying something new each visit. Even the desserts are spot on. Whether you like beer or not it's a great place to go with a group of people or even by yourself. To top it off it's very easy to get to and parking is wonderful!"}
{"text":"Everything is fresh and delicious!!! You really can't go wrong here! With either food or beverage! They do offer samples however they are not individual you have to choose four different beers to sample. Over all great highly recommend it!!"}
{"text":"I am breaking my rule of never reviewing a place after only visiting once for this place.  I like the decor and set up of this place. The food was good and the service on a busy Friday night was prompt and attentive. I like that they supplement their beer list with other great craft brews to be sure that they have something for everyone without feeling pressured to brew what everyone else already has.  All this being said, while I was there I witnessed possibly the best customer service I have seen at a restaurant last Friday, which is what made me make a review. About 7 PM they announced a special limited tapping from another brewery in the valley. The table next to me had just cashed out and were leaving. The man asked the owner, who had just made the announcement and was now at a table eating and drinking with friends, if he could have a sample of the beer before he left. The owner left his dinner, went to the bar and poured the man a sample of the beer.  I see a few posts here bashing the customer service and so I decided that I needed to post that we had the opposite experience on a busy night. Everyone was great, the food was good and I will be going back."}
{"text":"food was good the place was busy and the beer was awesome! friendly server bartender could have been happier but oh well. will not stop me from going again"}
{"text":"Tried this place for dinner for the first time last night. Great little patio out front and exceptional service. We started with the meat candy (bacon) and a side of sweet potato fries... I opted for the Cobb salad for dinner (gluten free) paired with a cider. Great spot, good food, pretty decent sized menu with options and my craft beer drinking husband was loving all the different beers"}
{"text":"Our second trip to BRI.  First visit was fantastic, but had to revisit to ensure they are worth 5 stars.  Hands down, they are.  Scratch made food, high quality innovative beer.  I I hate to divulge this hidden gem, but I'd be remiss if I didn't acknowledge their genius.  My wife had the southwest chicken salad - a green salad with the right amount of chicken and hearty greens with enough dressing to liven it up, but not so much that it was saturated.  I had the Silly Cheese Steak sandwich.  Amazing seasoning on the uber tender beef, complimented with onions, cheese, and 3 types of peppers on a soft roll.  The perfect mix of heat and savory taste.  We finished with the Hawaiian Sweet Bread pudding.  The pudding was awesome, and the topping was a desert unto itself.  We recommended they sell this as a separate mousse type desert.   The beers were phenomenal.  As a FoodieBrewer, I was in heaven.  The lineup is innovative, tasty, and clean.  MoWheat was Awesome, albeit a bit unorthodox with a heft Mosaic hop nose and crisp wheat taste. I closed out with a 9.5% Peach Lolli.  A solid 7 out of 10 in my opinion, but none the less special due to the alcohol content and balance of malt and yeast.  Service - Great. Atmosphere - in line with the Research Institute motife.  Complementary and unimposing.  Kudos to you, BRI!"}
{"text":"Sandwich du jour was awesome and the fries were so perfect after hiking Camelback. Friendly beer smart servers. And the IPA was great. Will be back!"}
{"text":"We visited a few times since the initial review. The beer is still great but the food was not as good. I had gotten the Notchos (without meat) each time and it was more like a plate of chips with very little salsa or toppings. The fries were still tasty and the service was pretty good despite how busy it was."}
{"text":"Small establishment. Vaulted ceilings, making it extra loud. Service seems to be all over the place. Prices are great. We got 2 cubano's and the pretzel appetizer. It came out together, fries were cold and the pretzels were extremely hot, the sandwich was good though. My boyfriend got two beers and I got a Long Island; which wasn't a Long Island, it was more of a hard lemonade. I'm not mad about it though, considering it's a brewery and all."}
{"text":"Accidentally found this place on New Years Day. What a GREAT find it was.  The staff was very helpful and it was a pleasant surprise to find not only 5 of their own brews on tap but other guest taps to choose from too. Recommend the Vanilla Porter and the Blonde.  We only tried the pretzel bites and they were well worth it- let's just say the Beer Mustard (made in house I was told) was well worth it!!  Could have used a bit more mustard and skipped the cheese sauce, heck add a few more pretzels too! :-) We will definitely be back and I'll bring my growlers with me next time."}
{"text":"The Spanglish opened my third eye. It is a symphony of flavor, a vessel to enlightenment, a true gift from the culinary gods. This is sandwich in its final form, fully evolved, complete and perfect."}
{"text":"The beer here is good.  Note:  They like their hops and they like stronger beers.  They also make some fruit beers and ciders--the Cherry Bomb is amazing!  But what really blew me away is their attention to detail about their food!  Everything is fresh made on site.  They ground their own beef and add back in just the right amount of fat for the best flavor.  They have a very creative bacon appetizer that will knock your socks off!  We had cheeseburger sliders, pulled pork sliders with slaw (enhanced with just enough jalapeño to make it interesting) and delightful little pretzel poppers that were, like everything else, FRESHLY MADE.  The place is laid out to mingle and we had a great time with our group.  We will go back-- I can't wait..."}
{"text":"Great beers, and they have happy hour too.  $2 off wings, and most all the 'Shares' are $5 (that's half off most of them!).  They just blew out the wall and doubled their space.  Great place in an unassuming strip mall.  Check it out!"}
{"text":"There is not a bad beer to be had here but the \"480 IPA\" Is crisp and creamy at the same time, no bitterness. 8%alc. 71 IBUs. The poutine was INCREDIBLE! Like moms pot roast on French fries. Make friends with an Uber driver..."}
{"text":"Everything was simply amazing.  The beers were on point.  The poutine was bomb and all of the the recommendations and pairings were great.  The Vanilla Porter Brownie is to die for.  I would come back just for that alone."}
{"text":"Wow-My wife and I came here for a night out and thoroughly enjoyed it.  Staff was friendly and gave my wife a free sample as she wasn't sure which beer she wanted to try.  Both beers we got were their's and both were tasty.  My wife ordered the Spanglish and I ordered the Pub burger. Again, both were delicious and prices were reasonable.  We will definitely be back.  Only reason it is not 5 stars is the fries.  We got both regular and sweet potato fries and they were soggy and greasy.  Everything else was delicious!"}
{"text":"The bee's knees. This hidden gem makes me want to take my pants off (in a good way). Service is outstanding, meat candy (Sriracha bacon), bloody Mary's and their RANCH (ahmahgah).   Get the Spanglish, Cubano and try their beer pairings. You haven't made it to this place, you're a fool. Did I mention their ranch... TO. DIE! I also want to try their philly.   Thanks, BRI!"}
{"text":"WoW...I am duly impressed! My 26 year old son took me here, ordered me a flight of beer to taste and recommended the appetizer called S W Poutine, which sounded gross by the description on the menu, but was AWESOME! He had SW Mac & Cheese with Macha, and I had the Silly Cheese Steak with fries...both to die for! Highly recommend this place for the craft beer and the food."}
{"text":"LOVE this place.  Quirky, clean, EXCELLENT craft beers and POUTINE!!  What more could one want?  I was a little disappointed when we arrived and saw that they had NO \"guest taps\" - which I've used at other places when I wasn't a fan of the house brews.  No issue at all here - while I didn't love every beer I tried they were all very drinkable and at least good.  Their coffee stout (\"Morning Sex\") was absolutely outstanding - so of course after my four ounce sampler I had to have a full pour...  You'd better like coffee to order this - it is FULL of robust coffee flavor.  The Belgian (\"Lolli Blonde Ale\") was wonderful - with the reminiscent truly Belgian hops and a highly carbonated background.  Be careful with this one - while you don't get the sense of a high ABV beer, this puppy is 7.7% - yowza!  Also tried and enjoyed was the Imperial Oatmeal Stout (\"Dark Side Till I Die\"), a very nice varietal albeit a little light on flavor for an Imperial Stout (but yes, I would order it again if I was all hopped up on Morning Sex (yeah, that does sound dirty) and couldn't take another dose of caffeine.    My wife and I split an order of the poutine - and it was very nice.  Not outstanding, but very tasty, and at a mere $5 quite a bargain.  If they used actual cheese curds rather than just sprinkling some feta on top it would have been much better, IMHO.  It paired well with their beer, however, and any complaint I have is a small one.  I am SO sad that this place is over an hour from my home...I would be a regular if it was close.  Hoping that family and friends need to be picked up at the Mesa Airport frequently so I have an excuse to go again!!"}
{"text":"Gotta give props to a restaurant that makes mostly everything from scratch!! I definitely enjoyed my lunch here and the service was good but I just wasn't overwhelmed (hence four stars). I'm sure if you're more of a beer drinker you'll love this place! I'm just more of a checking out local places person. I'll definitely be back with like friends when we want to try something different :)."}
{"text":"Cold wings, under cooked french fries, over cooked burger, and rubbery chicken...too bad cause it had potential. Guess its not being managed well. Wont be going back..."}
{"text":"Cute concept. Beer selection was good, with some better than others (vanilla porter was awesome,the Lolli had something off and not so good). Food however was extremely underwhelming..Husband and I shared the meat candy (good), the silly cheesesteak (weird texture, no flavor, and fries way too overcooked), and the pulled pork sandwich (just meh, and same overcooked fries)."}
{"text":"This is the place you go with those who can appreciate the \"craftsmanship\" of beer & food.  Food you ask?  Well, it's from scratch.  Even the BBQ sauce is made fresh.  All this for the most reasonable prices.  Do I point out the best of the beers?  Impossible.  I'd say the Belgian Tickler is my favorite at the moment, but this changes from week to week.  There is one thing that you must try... the Black & Blue Berry Cider.  Your Welcome."}
{"text":"We heard about this place from a friend ! Really love the food, Green Chile Mac & cheese and the variety of beer to suit anyone.    You gotta try it"}
{"text":"Fun atmosphere but a little on the loud side. Chicken sando and burgers were good. Loved the taste of the Hawaiian roll but eat it fast so it doesn't get soggy.  A nice selection of beers brewed on site. Bread pudding was AMAZING and I don't like bread pudding."}
{"text":"The place looks nice. No televisions of any sort which makes it nice cause it forces people to actually be social. No clocks either so you better not loose track of time or else the wifey will kill your drunk ass.   The poutine wasn't that great. The beer was excellent however.   Overall good place to go for a calm, chill environment. Friendly staff and customers."}
{"text":"Good beer ... cordial staff... came here once thought I would give it another shot... still not blown away by their beer... lots of ipa and that's great but not a lot of other choices ... great location"}
{"text":"The worst service I've ever had, and I've been to a lot of third world countries !!!!"}
{"text":"I was super excited to find out BRI opened so close to my house.   The small restaurant ,which is next to House of Sushi, is minimal, industrialist decor. Five big, black booths are on the perimeter of the walls with ample room. However, beware of the lip on the seat; it's dangerous and has caused a couple people to trip and fall. There are also 3 long bar height tables with stools and stools around the bar. They definitely need some TV's above the bar, which I am sure they'll put in soon.   The beer menu housed a few local selections. We tried and purchased a growler of BRI's Vanilla Porter. Very good. I also tried Papago's Coconut Joe.   We ordered the pretzel nuggets, which were salty and delish with the cheese sauce. My only complaint was they came out after we ordered the build your own burger. They were suppose to be an appetizer and although the server promptly addressed after he noticed, that was the end of it. The burger and fries made up for the delay of appetizer as you could they used an open flame and fresh ingredients. On a whim,  we wanted to sample a side order of mac n cheese. It was cheesy and good, but in my opinion I did not like the sharp cheddar mixed with the what I thought was Gouda.   The price of the meal plus 3 beers was around 30. Not bad at all especially since I don't mind giving back to small businesses.   I recommend you visit for yourself,  just be careful of those benches."}
{"text":"The Beer Research Institute just smashes off the wall brews.   Their Saison D'Hiver is amazing - spice up front, smooth and sweet finish.   Combine awesome fresh brews with a great menu and its a hard place to beat.  I ate the homemade pulled pork sandwich, which was awesome.   Check them out people....."}
{"text":"One of our favorite brew pubs. We haven't eaten here yet, but love the beer. Have the \"morning sex\". It's a beer folks, get your mind out of the gutter. :-) Fantastic. We will be back to try the food."}
{"text":"I am a huge craft brew/scratch food fan, and love this place.  The beer is fantastic, the trouble you may find is that they run out.  Not because they won't make enough, but were drinking it faster than they can make it.    Both times I want the service was great, the beer was great, and the food I tried was great.    The downside-I live in Scottsdale, so I just need to come up with creative ideas on why I am driving to Mesa for a beer.  Well, sometimes, its just worth it."}
{"text":"We liked the brewpub feel. The beer and service was excellent. The food was good and the portions were reasonable and thankfully not super-sized.The carnitas were tasty as was the Mac-n-cheese. My resident cook suggested more salt when cooking the pasta to add background salt.  Pretty much any comment we had on the food was a minor tweak that would give it a bit more depth. My resident brewer and I agreed the beer was top notch and the service was fast and friendly.  We'd go again for certain."}
{"text":"The name intrigued me, but this place is great.  The beers on draft are awesome.  It's hard to find good ales  this far south ( I'm from the Pacific Northwest) but this place is a little known jem that if you're lucky enugh to stumble upon it, you'll see what I am saying."}
{"text":"Had a little daddy/daughter date with my 11 year old twins on Saturday... we were going to see a movie but it was sold out so we opted for a bite to eat and wandered into The Beer Research Institute.  Not SUPER kid friendly... no other kids... and no kids menu... BUT, the twins had a great time. They loved it and really enjoyed the games that they had available - jenga and Uno were the ones we settled on. I didn't end up sampling any of the drinks...   Ambiance - for a Saturday afternoon it was pretty busy... wouldn't call it crowded at all and it was a decent and manageable amount of noise.  Service - Our server was very attentive even though we weren't drinking and gave me a good food recommendation.  Food - The twins ordered a make your own burger that they both enjoyed... but the real gem to me were the wings. Fantastic wings... we just moved up here and so I've been on the look out for a new place for my wings habit... and this is the place. Very tasty, not breaded, grilled... and I like to have them cooked, then dipped, and then grilled again to lock in the flavor and carmelization... awesome! Add in the home made ranch... and you have yourself a winner! The only complain that I had is that you can't just get flats or drums... even if you want to pay extra... just not an option, unfortunately...  So if you're looking for a good place to hang out and explore some beers... I recommend this place!"}
{"text":"Wide range of beers available, great prices, and delicious food combined with a unique and fun atmosphere made the night just perfect. The theme is all about research with test tube handles and flask lights. Really cool place! Drink local!"}
{"text":"The food was great and our waiter was awesome. They even were able to accommodate our daughter who has food allergies with no problem. It was very clean and friendly. My husband had the Spanglish sandwich and it was so good. Not like anything else. I had the chimichurri tacos and they were great. Highly recommended."}
{"text":"Nice people. Nice atmosphere. Good service. Good beer. Food was decent. Could be just a hair bigger for the price. Low key."}
{"text":"We stopped in for a flight of beer- the service was good, the beer was even better."}
{"text":"I was pretty excited to try this place and the online menu looked like the food was reasonably priced.  Walking in the BRI is industrial and white, almost like it was built in a loading dock.  My friend and I sat at the bar and bartender greeted us and was great.  Then we looked at the menu.  Items that were $9 on the website were now $12.  The beers all ran into the ridiculously high ABV range.  If I wanted to drink 8% ABV beer at lunch I would just hit Taco Bell and grab a forty or Old English. Oh, they don't have iced tea...........  The Cubano and black beans were very good, I would eat it again in a more inviting place with a more drinkable beer.  I really don't want to spend 10 days in tent city.  My friend had the bacon wrapped ham and cheese special.  He said he really liked it but wouldn't get it again ???  I don't know, it tasted pretty good to me.  His salad came with a house blue cheese dressing that was really runny, had no chunks and tasted like feet - stinky French feet.   If BRI can see fit to do some research on session beers I may be back otherwise, I a dropping out of this institute."}
{"text":"Our first time to this hideaway will not be our last. It was a little difficult to find but once we did we loved it.  Great beer, the Sriracha Bacon is awesome!   Great service, very friendly and knowledgable as well as truly enjoying what they are doing.  We will be back!"}
{"text":"My friend and I stopped by on our way to have sushi next door (@House Modern Sushi) and we tried their \"batch #1\" (a blonde Belgian) and a vodka cranberry. Both were spectacular. The staff are friendly, and the atmosphere is laid back, Jason was the bomb, and the owner Matt was very nice! I look forward to trying their food in the very near future."}
{"text":"The only good things about this place is the fries and the music they play. The service is terrible! We were greeted by the friendly bartender (wish we sat at the bar) the waiter didn't take long to come by to get our drink order, didn't ask to see if we had been there before. We ordered a few of the beers, the meat candy, and 2 different burgers. Beers aren't bad, never got the meat candy and my husband liked the burger but I wasn't impressed, I've definitely had better. Waiter didn't bring any napkins until after we were done with the meal. I don't think I'd return, rather go to wilderness or cold beer and cheeseburgers."}
{"text":"We went here with my in laws and had fun.  I read about this place in the Phoenix Times.  It was a lot smaller than I had imagined, but great beers and food.  I recommend the flights and the IPA as well as the jalapeño Mac and Cheese.  Service was very helpful in making recommendations and knowledgeable about the beers and menu."}
{"text":"My husband and I went in to check this new place out and we were impressed. We sat at the bar and were helped by Jessie and Brandon throughout our visit. They were both very friendly and made sure we never needed anything.   I had the macaroni and cheese (without meat for me) and it was, without a doubt, the best macaroni and cheese I have ever eaten. This is not your boring, run-of-the-mill mac'n'cheese, but instead it has a lot of different flavors and the green chilies give it a nice touch of heat without burning your mouth.  My husband had the Pub Burger and couldn't stop talking about how good it was afterward. He had never had a burger with an egg on it, but he really liked it and plans to order it again on our next visit.  We don't drink beer, but that wasn't an issue since the place has a bar and Jessie makes an incredible margarita. Next time we might try the wine as well since they offer that as well.  This is a great new place and we'll definitely be back because I'm already craving that mac'n'cheese!"}
{"text":"This place has a very casual vibe. Lots of seating inside with additional patio seating. We ordered the Cubano and split it. It was amazing! We had to order without cheese due to a dairy allergy and even so, it was perfectly moist and delicious. It came with seasoned fries which were also very good. Between two people this was the perfect portion to hold us over."}
{"text":"My husband had the Spanglish sandwich and absolutely loved it. We had two different IPA's and the we're both great. We will be back!"}
{"text":"NOTE: I received a very condescending response from the owner after my initial review (updated below).  I contacted the owner directly and we have reached a better understanding, but it wasn't the right way to respond to an unhappy customer and I still can't recommend this place based on my own experiences.  REVIEW:  This was the biggest let-down I have experienced in a long time!    I was enamored by the crazy number of positive reviews online (mostly employees and friends, I'm guessing?) and convinced my wife and a couple friends to join me for dinner and beers here.    I really loved the idea of the place and I like to support local businesses.  The location was close to me, the simple menu was enticing and the beer selection was more than adequate for what turned out to be a fairly small place.  Unfortunately, our experience didn't live up to the internet hype in the slightest.  I must say that the Steak Chimichurri Tacos were fantastic.  Perhaps a tad over seasoned, but with a little sour cream and pico thrown on top, this is the one dish we tried tonight that I might come back for if the rest of the experience wasn't so bad.  The Carne Asada Tacos, on the other hand, looked similar, but were quite bland and uninspiring.    The beans and rice that accompanied both of the taco dishes were truly a sad affair.  I'm not sure what seasoning they use on the rice, but none of the four of us liked it.  The beans were nothing more than a scoop of black beans straight from a can...no salt, no seasoning, barely warm.  Another item we ordered was the Not-chos (get it?  Nachos).  In my opinion, this was a culinary failure! It's a bowl filled with chips and topped with crumbles of the most dry and tasteless machaca beef you have ever put in your mouth.  There was barely enough cheese to taste on the first layer and no cheese beneath that, just a big bowl of plain, bland tortilla chips.  This item should be a free appetizer for the table while you wait, not a $10 plate!  The last food item we ordered was the SW Putin. I was most excited for this one and it was easily the second best dish on the table.  HOWEVER, the fries were SO salty that the four of us had to take turns eating it.  We're not talking about typical \"salted\" fries here, we're talking about \"salt encrusted\" fries. Too bad.  Lastly and perhaps most importantly:  The drinks.    I'm a huge beer fan, so I tried 7 of their beers and ciders, mostly house, but also a few others.  The biggest complaint we had (as noted by everyone at my table) was how warm the beers were.  One was nearly room temp!  The rest were cool, but certainly not at all cold.    The server checked the lines for us and brought back a sample to confirm the temp was now working properly, but we still got charged for all the warm beers we had been given.  The BRI house beers we tried were generally good, but I hesitate to suggest that any were great.  We didn't try any of the IPA styles since none of us were in an IPA mood.    That said, their house selection is better than most breweries' and encompassed porters, saisons, dubbels, etc. in addition to the prominent IPA lineup that is popular these days.  Yet, while they're certainly on the right track with many of these styles, most varieties felt like they still needed something \"more\" to be perfect (i.e. more body on the tongue for the porter, etc).  Perhaps things were thrown off by the fact that the beers weren't served nearly cold enough.  Between exceptionally disappointing food, beers that left us a bit wanting and service that was more minimal than either good or bad, I can't in my heart of hearts recommend this place to anyone else.    It's a newer establishment and may still be experiencing some growing pains, but there are too many other really solid brew houses around to waste more time and money at The Beer Research Institute.  Sadly, not recommended!"}
{"text":"This is the best spot in the valley to grab a great beer and delicious food. The staff is extremely friendly and they always have great musics playing. A true hidden gem. You can also catch a movie after getting extremely intoxicated with their 2017 Anniversary Beer (12% ABV!!)   If you stop by, make sure to eat their Meat Candy! (Sriracha Candied Bacon)"}
{"text":"Great beer and really tasty food The brownies are awesome too Be sure to come back often as the flavors change"}
{"text":"This place is so unassumingly awesome.  We came across this place on yelp and decided to give it a try cuz BEER.  We walked in to a pretty crowded room but they had a separate second room that we settled into pretty quick...I'm not a people person. Haha   It's a microbrewery and they had a TON of options. Blondes are my fave but I was scared to try theirs because it was described to have bubblegum, banana, and fruity pebbles flavors. It weirded me out and I opted for a 4oz of it for like $1.75. My fave part of the place is that they sold diff sizes you could chose from, so you could try 4oz of each if you wanted to! If only I knew I was guna love the place before I drove myself there... Anyway, it was DELICIOUS. We ordered the poutine and Mac n cheese with their meat candy - candied bacon with sriracha. SOOOOOOOO GOOOOOOOD! Guys, there are not enough words in the dictionary to describe how good everything was here. The Mac n cheese was a little spicy but not crazy. Their ranch has a little spice too but I liked it.   The service was super awesome as well.  I'm only in AZ for a few more days but I might make my husband make the drive from chandler so he can try it himself."}
{"text":"First time visiting, beer selection is awesome.  They have an interesting menu, although I did not have a chance to try anything.  I started with the Vanilla Porter which was really good.  Followed it with a Lolli (Belgian Blond Ale) highly recommended by the bartender, I was not disappointed, had two!     Will definitely return to try the eats when I have more time and am with others."}
{"text":"One of my favorites  in the valley!! This place doesn't get enough praise.  Great beer, yummy food, and awesome staff. A hidden gem that is a must in the East Valley!"}
{"text":"In business about four months, the Beer Research Institute has some issues to work out.    A few weeks back, husband and I landed here and we had a fantastic experience.  The beer selection is fantastic and the ciders are delicious.  Fantastic appetizers, meals and dessert - we were sold.    A few weeks later, we brought some friends in because we were so enthusiastic about our previous experience.  Unfortunately, our experience the second time wasn't as great.  Four out of five of us ordered burgers and three of those burgers were extremely well done.  To their credit, the manager gave over and offered to get us something else.  When we declined, they credited our bill and we appreciated that.  However, it took us THREE tries to get a side of ranch dressing and at some point, they stopped refilling our waters.    As one might expect, my feelings about this place are mixed.  I'm open to giving this place another shot but at the same time, we live very far away and coming here would almost have to be intentional.  Edited to add:   Hi Matt,   I appreciate your response to my review but it feels like you didn't read it.  I absolutely gave you guys credit for offering to bring us something else and comping the meals.  My review even says that we appreciated that!    The entire point of Yelp is to share opinions and my review was about our experience.  Other Yelpers may take it or leave it - that's the beauty of the site.  If we come back and have a positive experience, I will absolutely update my review.   Best,  Kelly"}
{"text":"Two words meat candy, it's definitely a mouthful......of flavor that is! Sriracha candied Bacon, need I say anymore??  It's awesome that is all!  Luckily that's not all....The BRI has that and more to offer, friendly service, several types of beer and they're willing to give you samples in which they serve in a beaker. I'm no beer expert but I like to tap one back now and again, alright more like sip on one slowly but either way, where better to do it than at the BRI. I started out with a sample of the Cherry Bomb, it was a good tasting beer. I then ended up ordering the Julian black and blue because I (one who drinks like a light weight girl) enjoys my beer on the lighter fruity side.  To eat so I didn't hit the floor, I ordered the Spanglish made with meat candy, an over easy egg, tomato, butter lettuce, provolone, topped with chipotle mayo served up on grilled hawaiian bread. It was 3 napkins kind of messy, loved it and can't wait to have it again. My friend got the build your own burger, big and juicy like a burger should be. I'll definitely be back, good beer, good food, good atmosphere and I just can't wait to say \"I'll  order a side of  meat candy, please!\" Happy Yelping and Eating! :)"}
{"text":"I cannot think of any reason this place does not do more business than it does. They have great beer on tap.food is alright. I had the pretzel platter on time and it was not so good. But they reimbursed us as we complained about it. Over all good for beer. A must try for Mesa"}
{"text":"Bless the beast and Beer Geeks! Love this place... The only thing that will keep me from going back are the irresistible hand cut fries.  Emphasis on irresistible.  I'll tell myself I'm gonna order a salad, a  chocolate stout and be done.  Emphasis on \"tell myself.\"  Then of course, yes I will order a side salad with hand cut fries, bread pudding to go....  The beers - absolutely awesome.  So I'm thinking Jason (our waiter) might be the Head Beer Geek (HBG) in charge? So the HBG described the beers, flavors, subtleties, brewing process and so on. He tells us where our food comes from.  We were excited just listening, ready to eat his words.  We were not disappointed from the first bite to last!   Hand crafted beer, hand cut fries, wonderful staff... what's not to love? I think this is my first 5 star rating!  Woohoo!   The ultimate question is will I go back.  YES!!!!  Be Peace!"}
{"text":"Wow....and yum......and wow.  Killer flagship IPA (480), way better than average wings, massive pile of delicious poutine. P.s. happy hour is an understatement. Way too many awesome choices on menu to only visit once. We met Matt the owner and he was a very positive personality. Wait staff was above and beyond. Will visit again very very soon."}
{"text":"One of my favorite places to grab a beer. The menu has a great variety of food. My go to is the Cubano. The pork is so tender and juicy. The beer rotates so you can try something new every time you go in. It gets busy in there on the weekends but the beer is worth the wait. Staff is always friendly and knowledgeable."}
{"text":"Fantastic craft beers on tap.  I started with one of the Lolli beers that was so nice and smooth and flavorful.  Added an amazing sandwich - the silly cheesesteak I believe it was called.  So flavorful and tasty.  For desert, I had their \"Morning Sex\" which was the coffee sweet stout served up with their bread pudding for dessert.  Nearly rolled out there being so full.  Staff was entertaining, bartender was awesome (had to love the English accent) and overall loved the ambience and vibe of the place.  Would recommend checking it out to folks in the area, as I will be returning the next time I'm in town!"}
{"text":"This is a great place!  We stopped for dinner and drinks and were very impressed with both.  The 480G is a great IPA, highly recommended!  Also had the black IPA.  Not as hoppy as I would have liked but flavorful with undertones of coffee and chocolate.  Started off with the Meat Candy appetizer.  It's basically fresh bacon with Sriracha sauce and crushed red pepper flakes.  There's more to it as well.  Just know it tastes great.  For dinner we ordered the tacos and the bbq pork sandwich.  They were both fantastic!  It's a small place in a strip mall, so if you get there during a peak time be prepared to saddle up next to a stranger at one of the long tables.  No biggie, that's part of the experience!  Give it a try, you won't be disappointed."}
{"text":"What a great place!  Went tonight for the second time and it didn't disappoint. The coffee stout is awesome!  They should make a shake out of that one!  Food was great as well. My daughter devoured the mac and cheese. Looking forward to another trip back!"}
{"text":"We still enjoy coming here, the food is tasy and filling. I have one complaint...I want to know where $7 worth of pretzel bites are...I think there were 7 little tiny pretzel balls a tiny cup of cheeze sauce and a little cup of mustard...maybe double the number of pretzel balls, make it worth while..."}
{"text":"Great food and great service! Very upbeat atmosphere. I recommend the meat candy and the spanglish."}
{"text":"We had a great time tonight! Zach was a fabulous server and truly made us feel like we were treasured guests. He took the time to explain to us the different flavors of the incredible house-brewed beers and we appreciate his time and knowledge-- especially on a busy Friday night. After our first experience many months ago, we were hoping that the place had figured out its groove and by God, it had! We truly enjoyed ourselves and due to Zach's attentive and affable nature we'll definitely be back! Can't wait to see you for the 2nd Birthday Party!   Thanks again Zach!"}
{"text":"GREAT BEER and knowledgeable staff!!  Wow I really was impressed. Matt, the bartender, really knew his beer and was very personable. I tried the pretzel nuggets and thought they were fantastic. My absolute favorite beer was Lolli. I was surprised because I normally go for heavy beer but this had an outstanding flavor.  I did enjoy many of them. The prices were very reasonable especially the $5 flight. I'm glad I found this establishment an hope to return next time I'm in the Phoenix area."}
{"text":"The beer and food blew away our expectations. Beer has a Belgian flair to it which is fantastic. Intergalactic and Mo Wheat were our favorites. As for the food, you better try the Spanglish. You will not have had anything like it."}
{"text":"Well geez, on some weekends I might call our backyard and beer fridge, and the shuffling distance in between, a \"beer research institute\", but it's good to know there's also a cool brewery to visit as well.  The name alone got us in, but the knowledgeable staff, tasty food, and delicious beers have kept us coming back.  We've been a few times, tried a few different food items, and sampled all the beers.  They really do an excellent job all around.  The only thing I would change is to have the server stop back and check on us about 5 minutes after they drop the food.  We usually don't see them again until it's check time, or unless they notice an empty glass.    Their beers tend to be fairly aggressive on the flavor and the ABV, so we have to be careful and flip a coin for who is going to drive and who is going to have another drink.  The last time we were there the Belgian lollis were both superb and the black IPA they had made me moan.  It was just that good.    All of the food items we've had were great, and next time we plan to finally try a burger, but you've got to get the pretzel nuggets to start.  Those really go nicely with the beers.  Overall, this has become one of our favorite local breweries."}
{"text":"We drove all the way to Mesa for a birthday.  This place is 40-45 minutes away from our house.  It was well worth it!  The location is in the same plaza where the Movie theater is.  I was looking forward to having the hamburger and the fries, they were delicious.  I washed them down with the Lolli, a nice light beer.  I didn't realized until I was almost done with my second one, and after Scott W. told me the alcohol level, that they are strong.  Good thing I had a designated driver.  The service was great, we had a big group and everyone was taken care of.  I was so hungry that I wolfed my hamburger down and realized later they had forgotten the cheese.  They were so nice that they comp-ed us a dessert.  We got the bread pudding.  Oh my, it was so amazing.  I am not a fan of coffee desserts, except for tiramisu, but this cappuccino cream on top of the bread pudding was so fantastic I would have eaten a bucket of it.  It was the perfect ending to a fun night.  I would definitely drive again 45 minutes  to enjoy their food and beers."}
{"text":"Started with a five star review as the beer was some of best we have ever tasted.  The pub burger had excellent bacon and an egg, very good for a burger.  The three star review is due to the horrible chicken salad.  The chicken tasted horrible.  The greens were so heavily dressed it hurt the mouth and the corn was missing to cut out the spice. I would come back for a beer but no food or possibly just a burger.  This situation was not handled well by the staff."}
{"text":"Hmmm....this place has the potential but it needs to work on some things. First, they need servers who are actually knowledgable about brews...our server was confused about the different beer offerings and actually mixed up our order with different beers than we ordered. And can I get a decent pour? Absolutely no head on my and my partys' beers. When I go to a spot that serves craft beer, the head is thick and the microform is beautiful and uniform, at this place no head and ugly foam, the bubbles were huge and the head was like that of a soda. So first off, better more knowledgable staff and definitely more well trained staff on basic pour methods. Second, the food looks great, but 5 dollars for a tiny portion of French fries? Total rip off. I know they're not officially open but it would have been nice to taste one of their brews, the red IPA sounds amazing. The beer list is solid, but mostly predictable....no reds or amber ales sadly, and nothing new or exciting. Like I said, definitely has the potential but needs a little tweaking."}
{"text":"A friend and I tried 7 different beers in 2 flights and enjoyed them all. A fun science themed brewery with food service, a diverse menu of beers, and food. 4/5 given only because personally a lot of the food was unavoidably spicy, but still delicious. Several of their beers can be put into growlers as well. Definitely coming back."}
{"text":"Great service! Nice joint, good food. Finally a place with AMAZING filtered drinking  water.... !!!"}
{"text":"Research complete. The result: meh. Food was okay. The sauce on the stacked enchiladas didn't really seem to fit and seemed more out of place as we ate. The burger was good, but nothing special. Good selection of high alcohol beers. All in all, nothing too great, nothing too terrible."}
{"text":"Awesome, attentive but not overbearing customer service, delicious beer & good food! Such a rad atmosphere to just come for a beer with a friend or a fun date night."}
{"text":"Great place!  Had the Cubano sandwich and the 480G IPA this time. The meat candy is great too.   Great food, beer, and the music playing is typically great as well."}
{"text":"This place is so good! We got the Mac and cheese as an appetizer, the side size was perfect to share. I ordered the silly cheese steak, with some ranch on the side and it was delicious. The dishes are big but really good!!"}
{"text":"The food is just as good as the beer. Not to mention the awesome staff. A place to be."}
{"text":"Simply put, the \"best craft brew\" in the valley \". Matt and and the staff are awesome. The food is equally great, especially the wings!"}
{"text":"I came down to Scottsdale on a cross country motorcycle trip for the Arizona Bike Week Rally. While staying in Mesa for the rally I found this restaurant on the yelp elite Mesa collection. Since it has great reviews, it's a brewery and a scratch kitchen I couldn't see any harm coming here for lunch. I came here after riding through Cottonwood Canyon in the morning through early afternoon. I ordered a glass of one of their sour beers after having a few tastes of their brews and the Turkey Club with hand cut fries. Both were perfect. The sour beer was very refreshing and the Turkey Club and fries were amazing. The club came on a hearty grain and seed bread. The bartender was very attentive, pleasant, and very pretty, always a bonus. If I make it down that way again, I will be back."}
{"text":"I've been to BRI on a number of occasions and I usually am impressed by their service and products.  Last night, not so much.  During our visit we had to wait 42 minutes to get our bill!  Yes, I counted the minutes exactly after we finished our dinner.    Apparently, management decided to run with one server and one bartender for the evening's dinner rush and their server was far from ready to handle that volume.  I've been a server before for a number of years so I understand that when you get slammed with tables it can be overwhelming however my issue is more so with the lack of empathy for the wait.  I had to flag down the server for my bill, no he did not pre-bus the table, and instead of saying I will be right there he moved his head back as an acknowledgment of us needing our bill.  No big deal, you're busy and I get that but at least acknowledge me with words and not a head-bob from across the room like we're friends or family. Instead of delivering the check himself with an apology for the wait a manager came to deliver the bill.  As it turns out their Point of Sale system went down and they were scrambling around trying to fix it - I understand but an apology from the server is all we needed (e.g. Hey, I'm slammed and am sorry about the wait - No that did not occur.)  The manager delivers our bill and I hand him the cards to split the bill.  He returns with the cards having split the check and guess what - Wrong amounts charged on both cards!  My bill was $34+ and we were charged $4.58 each???  Did we get comped? That would have been nice but let's make sure and ask before we assume anything.  I flag down the manager again and no we were not comped, he just made a small mistake.  Not a big deal as that can happen and I'm not upset about paying for my full bill. He returns with our cards again and it looks like the mistake was corrected and a quick update that our cards will only be charged once but here's another caveat - my card was not handed back to me???  I flag down the manager again and apparently gravity is at fault. \"Sorry bro, gravity\" was the statement provided- that's professional.    Today I open up my bank account online and guess who charged me twice?  Great work BRI - you get to waste more of my time on another day!  You've proven you're not quite ready to handle a small number of tables and your staff is ill prepared by management to cope with a challenge. So why did this whole thing bother me so much?  I've done the job before and handling a dinner rush isn't hard if you multitask.  When you go to the back of the house - make sure your hands are NOT empty and take dirty glasses and plates from your tables (pre-bus).  Apologize to your tables and let them know you're busy but you're giving an effort and just be a professional.  You're a brewery so I expect a level of casualness but is an apology that hard to deliver?  You're better than last night BRI and I've seen you guys shine. Where is the English/Australian fellow that serves tables and essentially makes BRI worthwhile when you go there?   Get your crap together and re-train employees on Customer Service - multitasking as a server is essential and its not hard to be professional and take accountability when you mess up.  Just apologize and your tables will understand - I certainly would have if you took the nine seconds to come over and say the magic words: I am sorry I'm so busy, I will try better next time. Best of luck to you BRI!"}
{"text":"Tried this place after watching the fun review on Check Please AZ! Fun atmosphere with a great variety of brew made in-house and locally sourced. I love that they offer 4oz drafts which makes for a great flight. My husband tried out the Green Chili French Dip sandwich and absolutely loved it as the meat was well marinated and cooked to perfection. We shared the Not-Chos that were topped with machaca and were barely okay as the Que-so' was a little sus. The Bacon bread pudding is a must try! Our server was excellent, attentive, and provided  great brew recommendations. Will definitely be back!"}
{"text":"The food was nothing special, a bit overpriced for what you get. The service was good and I did enjoy the games available while we waited. I would go back if  looking for a beer and burger but it would be more for the laid back atmosphere than for the food. Sorry, the food is not horrible just not that great."}
{"text":"I'm from San Diego, so I am pretty snobby about my beer. What a wonderful surprise to find a place in AZ with great beer. The coffee stout is possibly the best I've tasted.   We also had lunch and the food is a craft as the beer. Service was great"}
{"text":"I am pretty new to drinking beer. The staff is great about suggesting things you might like to try. They are great about bringing out a taste so you can decide before making a commitment.  Sometimes the beer  I want is out but that's just how it goes when it's all so tasty.  The food is also really great!! Don't leave without trying the meat candy and their mac and cheese! Better yet, get the meat candy IN your mac and cheese!"}
{"text":"Second visit to,this establishment.  Bloody Mary was very tasty.  Comes with piece of their candy bacon...yummy.  Lunch was their BLT with avocado.  Comes on Hawaiian Bread..friend enjoyed.  I had the Philly steak..was so tasty and fresh...for side we had mac and cheese and side salad.  Both were wonderful.  Return trip will be mac and cheese.  Music was very loud when we got there and asked waitress if they could lower...she checked with manager..owner ?  And they obliged.  He explained music was loud from night before....glad he was able to accommodate because we did not want  to leave.   We are not IPA drinkers so Mary and greyhound were good choice.  Highly recommend...prices and very reasonable...we will return."}
{"text":"This place is amazing!!! Fantastic beer. I recommend War Paint red. Poutine fries as an app is a great option. I went with the flights of beer sampler, in a brass knuckle holder. Very cool atmosphere, great music. Try the Spanglish! It's hidden in this complex off the 60 and Stapley. Check this place out."}
{"text":"Great beer, awesomely imaginative food, and a friendly staff to top it off!  This place is incredible, I highly recommend getting a \"flight\"  beer sampler and checking out some of the kickass brews made right there in house. Also the \"Meat Candy\" is DELICIOUS! a little spicy but the flavor is intoxicating. I can't wait to go back and try some more of their menu.   The \"War Paint\" red IPA is my personal favorite so far. See you at BRI!"}
{"text":"The experience we had at The Beer Research Institute was excellent.  Kayla was fabulous. She was kind, knowledgeable, engaged with the customers and definitely management material.  We would most certainly come back again and hope that Kayla would be our server."}
{"text":"Stopped in today for the Grand Opening!!.... Had a flight of their three beers...a flight is four, so added a Lost Abbey guest tap.  Ordered (I forget the name) some pulled pork sandwich with jalapeno coleslaw.  It was fine, nothing to write about, but by no means was it bad, it was just fine.  :)  The beer and service were great.  The place is big enough that you don't feel crowded.  I like the set up...well, really everything about the new brewpub....will definitely be back!!"}
{"text":"Very much a hipster joint.  The beer selection is good. The service was adequate. The cleanliness of the place left a lot to be desired. Overall give it a try."}
{"text":"Decent beer. Might have been an off night but apparently their cooking and serving staff feels like it's ok to serve burnt/blackened food to paying customers."}
{"text":"I have returned to BRI. My girlfriend was so hungry coming out of the movies, she was going to pass out, she headed right over to BRI. Craft beer and a burger? Lead the way baby!!  Love the staff, good personality and SUPER helpful with the menu, great suggestions!! BEER, had the street cred IPA........good. 2nd beer, White Russian......HOLY CRAP!!  A white russian in beer form, could be the most wonderful beer I've ever tasted and at 9.5%.........AWESOME, it may have changed my life.  FOOD Pretzel bites with mustard and cheese........ehh.........very doughy. Not crazy about them. I had the Cubano sandwich.........good, not bad. Girl......burger with fried egg and meat candy on top, over cooked a bit, but tasty!!! The highlight was their fries!!!  They were AWESOME!!!!    Next time I come in I'm just going to eat their fries and a glass of meat candy and drink White Russians...........NICE JOB BRI!!!!"}
{"text":"Boom. Some grate beers. Killer IPAs and all details taken care of down to the side salad with candy walnuts."}
{"text":"I love the concept, the flask lights and beakers for tasters. However after that the whole concept seems to end, The inside is pretty basic bar like as are the normal bear glasses.    The beer I tried was decent but nothing special. As for the food a lack of any veggie options other than prezels meant this was just a beer trip for me.  If you go to the movie theater next door this may be a good stop to get in a few brews before the show."}
{"text":"The silly cheese steak I would marry if I could.  Seriously good eats and fantastic brew. Ours server was awesome super helpful and friendly. I can't wait to try more brews."}
{"text":"Ok so the beer was good but I expected a larger selection and feel slightly mislead by their name considering they only had about 12 beers. Now when it comes to the food I had the Carne asada tacos for 10.99 thinking it was going to be a taco plate with rice and beans. I did get rice and beans but in tiny sample cups and the tacos reminded me of tacos I could get at any bar for 1.99. It was two tiny street tacos, granted they were tasty made the small portion all the more depressing know how much that just cost me. I won't be eating there again until they come off their hipster high horse and start providing a fair portion for the cost of the food they serve. Just gotta say the server was nice and attentive"}
{"text":"I have been 3 times now and feel like I have a pretty good grasp of the place...and I love it.  There is just something about the atmosphere that is very relaxed and welcoming and they always have great music playing.    I have eaten a different dish every time I've been and they have all been incredibly delicious.  Their soup is made daily and always something interesting.  As for their fries?  I'm obsessed with them.  They are quite possibly the best fries I've ever had.    The beer lineup is solid.  They seem to have about 3 local or other craft brewery beers for every 1 beer they brew.  That's ok though.  The Street Cred American Dark Ale has quickly become my go to beer there and I think it could really stand as their flagship beer if they wanted.   The bartenders and servers have all been very friendly and knowledgeable about the food and beer.  My service was A++ on 2 of my 3 visits.  On the other occasion the service was less than desired and the food order was messed up.  There was no reason for this as it wasn't busy.  So my suggestion would be to write down the orders!  Can't wait for the next visit."}
{"text":"Disclaimer:  I did not really do any research on beer here as I do not really drink beer ;) I do like watching my friends enjoy beer while I imbibe something else when hanging out, though, and that is exactly what I did here.  I met up with one of my  friends here on my recent trip to AZ for a second lunch ;) after meeting with another group of friends down the street for brunch.  Hence, I wasn't super hungry, but I wanted to catch up with my friend here and ordered the tasty SW Poutine. This was a very hearty version of the french fry dish topped with beef gravy, machaca, queso and pico de gallo. This can easily be shared with several people.  It is probably the richest poutine I have ever had, but was really tasty stuff!  I had a Pinot Gris from Oregon in a can. Yes, hipster wine, and it was refreshingly good. My friend ordered lunch of grilled wings and mac and cheese which he enjoyed as well as the craft beer he drank.   Our friendly server told us that the craft beers rotate so often that he was printing up a brand new list which he handed to us fresh off the printer ;)   Besides craft beer and cider, wine and cocktails, as well as non-alcoholic beverages are on the drink menu.  The American cuisine food menu has appetizers, soup and salads, burgers, sandwiches and entrees.  I liked the atmosphere of Beer Research Institute.  It is a casual, friendly, pub-like kinda place with bar area, communal tables and booths for seating. A great place for hanging out with my friend.  Our server checked on us often, was attentive, helpful and charming.   BRI is a fun place to hang out with friends.  I will definitely come back here next time around with a bigger appetite so I can try some more things off of their menu and check out some of the ciders they have."}
{"text":"Great find in the Phoenix area.  Great beer selection with a broad range of styles, friendly service and great bar food menu.  Had a great time here.  Bring a strip mall find makes a great place like this even more fun and enjoyable."}
{"text":"Cannot say ENOUGH GOOD THINGS about B.R.I.!!!! FOOD ATMOSPHERE STAFF  ..... and the BEER???? . Get yourself here and become a regular like us, you'll be happy you did!!!!"}
{"text":"Has a large selection of craft beers, although a bit heavy on the IPA side(I'm over IPAs) would like to see a few more red/amber/pale choices. The Poutine was good, and the service was great. Knocking off 1 star for the \"too cool for school\" atmosphere, really sometimes would like to get a good beer, without deciding if I like pine/chocolate/lavender/lucky charms \"hints\" or \"finishes\" But maybe that's just my problem? Lol, overall a good place"}
{"text":"Love the ambiance. They kept the theme going from their decor to their beer names! Great beer!"}
{"text":"Nice atmosphere with some great beers.  Loved their sex in the morning.  Parking is only a problem if the nearby theater is showing a blockbuster."}
{"text":"Great new brewery in the East Valley! The inside is decorated well and I love how they don't have TVs- you actually have to talk to people! I would recommend getting a flight so you can try all of BRIs brews. Happy hour runs until 6 and it's $1.50 off all their beers and $1.00 off others. We got the pretzels with cheese/ mustard and the mac and cheese, add green chilies. The pretzels were a little dry, but the stone ground mustard was amazing and able to hide that! While they are still new, they are only filling growlers of their own beers on Monday and Tuesday. Definitely stop in before a movie for awesome food and great craft beers by friendly staff!"}
{"text":"4 Peaks Brewery 5 stars, nearby Wilderness Brewery 4 stars, so under that light, Beer Research Institute ... 3 stars.   I have yet to be wowed by any of the beers they brew in house. Stopped in at least 10 times and have yet to find one I liked enough to order a second. Perhaps I have bad timing, but no matter, they always have a nice selection of unique guest beers on tap. There I always find a winner.   The bar food is the real highlight at the moment, here they beat Wilderness IMO. I really love the green chili Mac & Cheese with Machaca, awesome fresh cut french fries.   The atmosphere's a bit raw, lighting is a tad harsh, rough around the edges if you know what I mean ...  While they have made some minor upgrades over the past year, there's still plenty of room for improvement.  I'll keep trying ... if they keep trying ... I really want every local brewery to succeed."}
{"text":"Our server recommended top IPS for hubby...fantastic.  He was great!  I tried their stout...good.  Apps:  candied bacon & pretzel bites.  Main meals:  chicken tacos and chicken sandwich... all yummy.  Girls had the ice cream porter brownie for dessert.  Definitely will be back; 4 thumbs up."}
{"text":"This place is such a big fat yes for me. When you first walk in, there's a small bar area, but the actual place is set up so it feels really open and spacious. It's clean and the service is fantastic.  The flights come in beakers served on brass knuckle trays and they were playing old school rap. The whole vibe is awesome and everything is really well thought out.  But the real star of the show here is obviously their beers. They are so, so good. We were super bummed that the Mjango Unchained wasn't ready, they were out of war paint and the peach Lolli, but there was still a lot to be happy about. We ended up trying the cherry sour beer, the 480G, the Lolli, and the Ska hoperandi. After the flights, we went with the 480G and the Lolli mixed with the black and blue cider. I loved that the black and blue wasn't as sweet as most ciders and had more of a wine spritzer feel to it. The food we had was awesome. The Cobb wrap and the Sw pulled pork were both super tasty and I couldn't get over the crunchy fries with their ranch.  B.R.I., I love you and I'll be back a million times."}
{"text":"So the beer is the important thing, right? Well, the beer was pretty good--I tried three of their brews and each was good enough for another round. I didn't try the food, and the location seems really odd for this kind of spot, partnered with a very bland interior. White, white, white. I could see it being a good spot where the employees care and want to know the clients, but they have some ways to go yet..."}
{"text":"Love this place. The beer is Excellent and so is the food. It has a great atmosphere with a friendly staff."}
{"text":"No lab coats or caged frat boys used as test subjects. This is a straight up craft beer scientific discovery.   Located in the back of a strip mall in glorious Mesa, AZ is a very unassuming and even a little plain looking brewery. The lay out here is like any normal craft beer house that also serves food. Minus the glass beaker lights hanging from the ceiling.   I came here with the family and a very friendly server, who not only had the low down on the beer, but the food as well, greeted us. There were so many options I decided to go with a mini flight, four beers of my choice. I went with the Vanilla Porter, The Street Cred, War Paint, and 480G IPA. These all being served in a brass knuckle holder.   Vanilla Porter - Great taste and very mellow on the vanilla. I could only taste it on the finish., and for being such a dark beer this was surprisingly light. I would order this again.   The Street Cred - This beer was good, but it's what I call a palate destroyer. If you start with this beer, end with this beer. It will alter your taste buds so you can't get a solid flavor profile from other satisfying suds.   480G IPA - Great classic IPA. This is the beer you should order while looking over either menus, food or beer. Great choice for the craft loving newbie.   War Paint - This was my favorite and I could have had three more pints of this. Super smooth and great flavor. This beer will be my go to next time I'm at BRI.   I also ordered some food on my trip here, the \"Spanglish\". This mutated breakfast sandwich was the perfect pairing with my beer filled flight.  Meat candy, an over easy egg, provolone, lettuce, tomato, and chipotle sauce. All of that on sweet Hawaiian bread. Not sure why it's called the, \"Spanglish\", but I didn't care either. This beast was delicious, the ultimate in breakfast styled food porn. The egg was cooked perfectly and the yolk ran down the sandwich as soon as I cut into it. Pure goodness.   Was I blinded by science? Yes. Craft hoppy science!"}
{"text":"I hate having to write reviews like this but my experience here was sub-par.  To start with I got their Vanilla Porter which while ok was nothing special and nothing distinctive about it. I paired that with an order of the machaca tacos ignoring the advice of my buddy to get the mac and cheese. For an $11 dollar taco plate I was expecting more than the 2 barely filled tacos with condiment cups of rice and beans (that weren't particularly hot either). The flavor was actually fairly bland and underwhelming and not filling. This was basically 2 street tacos and tiny sides for $11, it should be a $7-8 plate not one of the most expensive things on the menu.  However the worst was yet to come. About 20 minutes after I ate as I was driving home I became very very queezy and nauseous, enough that I rolled down the window in 50 degree temps for fresh air. I rushed home and let's just say I got home just in time. I have never had something like that happen before. It was over pretty quick but was still another 7-8 hours before I was able to eat again. I know food poising usually takes a bit but the sudden onset and the fact I hadn't eaten in 12+ hours (and the last meal was something I have all the time) makes believe something was amiss with the tacos.  Based on the fact my buddies enjoyed their meals and I have heard good things from other I will probably come back and try here again but I will be avoiding the tacos."}
{"text":"Great brewery. Food is good. Staff is great. Would like a little more variety on the beer selection would be nice though. I love IPA's as much as the next guy, but I'd guess 10 of the 15 on the list are IPA's. Wouldn't mind a standard pale ale, lager style, or similar beer. ABU is pretty high on most as well. Just my personal opinion on that, but it really is a great place to hang out, eat, and have a few drinks!"}
{"text":"Had the green chili mac n cheese with carnitas and it was Amazing! I like my food a little spicy and it lacked spice but overall was great. after adding some hot sauce, it was perfect. Perhaps adding a sharper cheese and more chili would have been good? My boyfriend had the Cubano sandwich which he loved but he thought the portion size was a little small.  The beer was great! Really good beer selection  The gentleman we had waiting our table was great. He was very friendly and helpful.  One downside was the organization level seemed to be on the lower side (I'm attributing this to being that they are still new). It did take awhile to get our waiter. There seemed to be a lack of flow, and dead space in the front of the restaurant.    Overall the restaurant was good and I think the place has potential to be a favorite and staple in Arizona."}
{"text":"I don't know why it's taken so long for me to write this! We have been here numerous times and it's always great, the food, the service, the beer! I recommended the poutine, it's delicious and enough to be a meal in itself. The pulled pork sandwich is great and how can you pass up their lollipop brew! We of course will be back. Probably this week just like last!"}
{"text":"Great beer- obsessed with Lolli and the Sour the have on tap. Food is good- we only tried a few items- beer brat and the philly cheese steak.. fries are delicious. Service is wonderful !"}
{"text":"Excellent food and some amazing beers! I will definitely recommend this place to my friends."}
{"text":"As the name implies, this is a microbrew place that serves beer-appropriate grub.  A lot of American classics, but with a twist.  For example, I had the green chile French dip sandwich.  Our table also ordered the wings.  The flavors were good.  Nothing to knock your socks off, but solidly good.  I'm always the designated driver, but I am told the two different beers that were ordered also were very tasty.  Service was friendly.  Atmosphere was loud.  A good find."}
{"text":"Spent a weekend hiking/backpacking in AZ. Stopped here for a local beer & bite the night before leaving. Great small local spot. The food was dialed in, the beer was cold, the staff was friendly & the music was money. For anyone in the 28-45 age range this place is a great spot to sit back & enjoy some beers with friends. Our group stayed there for a little over an hour just relaxing with multiple beer flights & pints while listening to Red Hot Chii Peppers, Beastie Boys, Cake. I would recommend the chicken wings & Pub burger."}
{"text":"Had the steak chimmichuri tacos for dinner. A perfect portion size and the steak was great.  I tried all their saisons, the milk stout, and the blonde. All were great. Different styles of hops with each one of the saisons. The blonde had a pleasant floral note.  I'm will definitely be back here."}
{"text":"I can't say that I've ever sampled beer out of giant brass knuckles before. That is, until now. It also helps that these four local beers I sampled also carried great taste!   Top Secret Battle Monkey - double IPA that packs a punch at 10% ABV Fire Squirrel - double red IPA 8% ABV Dark Side Till I Die - one of my favs, Imperial Oatmeal stout (9%) Morning Sex - coffee sweet stout (5.8%) and very dessert like!   The Spanglish sandwich stood out to me since it had the candied Sriracha bacon in it. The addicting sweet spiciness consumed my taste buds. I couldn't tell if everything we ordered was spicy or just the bacon in the sandwich. We had to order a separate side of the candied Sriracha bacon just to be sure so my friends could enjoy it too!  We enjoyed the Machaca poutine fries. It's hard not to love fried food that is covered in cheese, gravy, and Machaca. Secondly, we also liked the pretzel nuggets. These little nuggets were accompanied with spicy mustard, carrying on the spicy theme.   It's safe to say that we really enjoyed are first time here. We may need to grab growlers next time though since this is so far from where we live but anytime we hike the Superstitions or climb Queen Creek, this will be a definite stop!"}
{"text":"Nice spot for beers. Food was just okay with the exception of the meat candy, per my husband. Love the vibe, server had great personality but the service itself was slow. Bar stools are really uncomfortable (the metal ones) and don't lend themselves to sitting and staying a while."}
{"text":"Nice place. Heard about it last week from another beer aficionado over at North Mountain. Just when I thought I was done with exploring local breweries! Was worried at first since its in a major strip mall next to a movie theatre, but I dared to walk in anyway... Service was at first very slow - I suspect it was due to a significant number of patrons and a lack of waitstaff. This corrected itself within 15 min or so and was not a problem going forward. First started with a flight of the barkeep's selection - BRI Lolli, War Paint, Street Cred, and Mo' Wheat. Excellent beers, and every one. All different.  next went with the Monday special Meat Candy Monday. Sriracha, molasses, and bacon. Talk about sweet and spicy chicken wings! These were great and the big hunks of bacon in the sweet sriracha/molasses sauce were an added treat and a further insult to the poor chicken The wings were neat and tasty.   And the Street Cred provided the necessary balance for the heat! I can't eat anymore this trip, but next time I will try the carnitas plate. I'm looking forward to the experience. Good place varied crowd. Maverick tables, and they know how to brew beer."}
{"text":"Stopped here on my latest trip to the Phoenix area! This place is actually in the Mesa Area! Didn't try the food only did the beers of which there were plenty to try! I had to do three flights to get through them all! The beers are well made and decent, but none of them really stand out, in fact I found them all to be rather pedestrian! Nothing wowed me! But the service was good, the beers were good not great but good, and the atmosphere was pleasant! I would definitely recommend stopping in if you're in the area, but this is not a place I would go out of the way to travel to! I did like the beaker jar tasters though, very cool and appropriate for the theme of the place!"}
{"text":"Great food and beer but the worst service I have ever experienced. We were asked to move tables 3 times, the waitresses were switched on us 4 times. Took 25 min for our bill to come and the waitress brought us another tables bill. The manager offered to comp everything but we decided to pay and will never come back again."}
{"text":"Pretty cool place. I had the Morning Sex beer, which is a stout, and it was delicious. I was with a group of friends who were all drinking a few. We got some food too - I had the poutine and it was very good. The service was pretty quick. They have games available and we had some fun with Cards Against Humanity. I hope to be back soon!"}
{"text":"Food was actually excellent and the staff was great. We had the sw poutine, meat candy, chicken sangwich, side salad, Cubano and green chili Mac. Was way more food than we needed but everything was very tasty."}
{"text":"Great place! Scratch Food! Grass fed burgers etc... Tasty beer and great staff! Dog friendly patio in front and back!"}
{"text":"This is a fun little spot.  Met up with a friend late afternoon & we enjoyed the taster flights they offer.  The servers really know their stuff & are clearly passionate about their craft.  If you don't know what you want, they help you make good choices.  Decided it would be sensible to have some nibbles with that much beer going down, but the sweet potato fries weren't as awesome as their beers, just o.k."}
{"text":"We both had the silly cheesesteak. Very flavorful, highly recommend.  I had the San tan moon juice which was perfect.  Hubby had  Lagunitas cappuccino porter and not only did he love it but I did too.  Cool atmosphere, especially for being at a mall.  My only complaint is the menu did not say the silly also had shrooms and red onions....would have wanted the shrooms anyway but onions are not for me, and I just think the menu should cover off on all ingredients on a sandwich.   Regardless, we will def stop back when in that neighborhood..I really want to try the Mac n cheese w.carnitas!"}
{"text":"Love this place fantastic beer and excellent food. Must try the Mac and cheese. Sweet potato gets are awesome. Service was great. Family atmosphere."}
{"text":"The beer is good but today the place was filled with smoke from the grill in the kitchen to the extent that everyone entering commented on the smokey haze. This is the result of the exhaust fan being turned off to prevent high air conditioning bills. This creates a unhealthy atmosphere that I will be avoiding.   I returned today to enjoy their beer and was pleased to see the \"smokey haze\" issue has been resolved."}
{"text":"There were lots of rave reviews so we decided to try. Or server was very knowledgable and helpful and both beers and food. First problems was he was the \"ONLY\" server. Service while good was very, VERY slow. Thankfully we got there and got our order in before it got crowded. One guy covering what should have been at the least 3 if not 4 servers, or a food runner something could help this mess. The statement about the food was, \"Everything we can possibly make in house we do. We cook from scratch.\" Maybe so but everything we had, Pretzel Nuggets and Meat Candy for appetizers and 2 of use with Silly Cheesesteaks and the third with an Eggs Benedict. Pretzel Nuggets were ok, a bit over done I thought. Meat Candy, excellent but could have been cooked a bit more to crisp it up more. Cheesesteaks, meeh, ok and the same with the Eggs Benedict special. We drove from Desert Ridge and our friend from Chandler. The consensus was too far to drive for the service and the food was just ok as to not overcome the service. Supposedly they are going to branch out and one targeted area is Desert Ridge. Will I give it a try when they show up? Yes. Will I drive to this location again? Doubtful."}
{"text":"First of all, incredible name for a brewery! \"Sweetheart, Honey, I was just doing some research!\" The location is both good and bad. Right off the 60 in a busy area? Great! Tucked into a strip with little signage? Not so good. I guess in some ways this could be seen as a good thing though. More importantly, the beer is really good and the service is very friendly and on time. The bartenders are always willing to take the time to answer any questions you may have and carry on a conversation, all while making sure no one is going thirsty. I had a few IPA's- the Intergalactic and 480G. The 480G will be a go to on my next trip for sure. The best part of the visit may have been the Meat Candy. The menu is not extensive, but I get the impression what they do, they do well. This candied bacon was delicious on its own, and I believe can be served on a BLT as well. "}
{"text":"Very nice selection of beers.  If the BRI flavors don't tickle your fancy, they offer popular craft brews.  We were having a good time until my buddy ordered his third beer the bartender cut him off.  He wasn't inebriated but the bartenders excuse was that more than two beers would put him past the legal limit.  I took issue with this because Arizona is a no tolerance state, you can get a DUI after one beer.  If his ultimate concern is keeping his customer below the legal limit, he shouldn't be pouring beer."}
{"text":"Don't let the name fool you; it's not just about beer. The food is top notch. Love this place.  Great food, friendly staff and of course the beer is really good too. The mac n cheese with or without the machaca is delicious. The burgers are always a good choice. I tried the soup on this past visit... can't remember the name... cheesesteak something? It was excellent.  Basically, everything I've ever tried on the menu, I've liked or loved. It's right by the AMC on stapley and the freeway. If you are in the area looking for somewhere to eat, you should definitely go here and support a local business.  It's also kid friendly, which is a bonus."}
{"text":"Delicious beers and good food! Find their beers are usually pretty well balanced. Candied bacon is good but definitely spicy. Good burgers too. Only criticism is still have a ticket for the anniversary beer that I still can't claim for whatever reason but otherwise a favorite spot in Mesa. Plus they're expanding! Yay!"}
{"text":"Due to the reviews I guess I had high expectations.  I like porters and stouts and what they have is so so.  But the food sucks. I've been to this bar twice and my family has been more than that, Each time the food has been horrible. The meat is always way over cooked. The nachos were bare and the candied bacon is saggy,  Very disappointing."}
{"text":"(Lyrics - John Meyer - Waiting On The World To Change)  Me and all my friends We're all very thirsty They say I sing my reviews and  There seems to be a way I always could  Now I taste everything that's going on With the beer and those who make it I just feel like I must make the means To sing above the beats  So they keep researching Researching at the Beer Institute So they keep researching Researching at the Beer Institute   This is definitely a spot for beer lovers.  Unique in it's own right BRI serves up some interesting and fun micro brews!  I used to enjoy a good beer, but now as it climb closer to renewing my AZ driver license I'm more of a whiskey and wine guy.  Needless to say, I ordered me a beer flight of fun.  I don't recall each and every drink I ordered, but I think the next step for them is to label their flights better so you know which one you ordered as you taste.  For food I went for the build a burger option; beef patty, lettuce, tomatoes, and onions on a Hawaiian bun.  I added the bacon and avocado to give some salty punch and a mild buttery texture.  Overall, it was pretty basic burger to me, but I really enjoyed the handcut fries that came along with it.    Service was best as the bartender could handle.  It was a busy day, but seemed like he was the only guy on floor and he was busting his butt - kudos my main man you did well!  In the end, BRI is definitely for you if you love beer and if you just want to have some funk and fun with your drink I totally recommend this spot! - Enjoy!"}
{"text":"First time here and wasn't disappointed. Food was dynamite and the beer is pretty excellent as well. The Django & the Lolli were my favorites of what I tried. Will definitely be back again and again. Only negative is that it can get pricey pretty quick, which is easy to do when everything is so damn good."}
{"text":"I found this place through yelp reviews and thought the name sounded like an awesome place to take my beer loving boyfriend on a Friday night.  We love to try new things and this menu looked like it would be a good place to go!   We got seated right away and were brought out waters immediately, and that kind of service continued all night. They were very accommodating and super helpful when choosing beers and food.  My boyfriend was thrilled with the war paint beer, but the second glass he ordered he loved.  I had the black and blue cider and that was great.  We also started off with the meat candy app.  I'm pretty sure my boyfriends exact words were \"I've had a lot of bacon in my life and this is quite possibly the best.\" So he was obviously hooked.   I ordered the chicken sandwich and that was delicious.  The chicken was juicy and the Hawaiian roll was soft and swift on the inside and crispy on the outside.  My boyfriend had the sw burger and he said it was good, but a little dry, maybe slightly over-cooked, now that I think about it they didn't ask how he wanted it cooked. But either way the French fries made up for it.  Nothing beats fresh cut thick French fries and we loved those!  We've already told friends about our new find and I'm sure we will be back soon! Next time we are getting the brownie Sundae."}
{"text":"I like this place because they pump out many variations of different styles of beers.  Some are hits and some are misses.  The 480G (G is for gangsta) is a fabulous IPA.  The bartenders have always been friendly and extremely knowledgeable."}
{"text":"HAPPY HOUR REVIEW HH is M-F until 6 and ALL DAY Sunday Most of their \"share\" plates are $5 and beers are $3.50!!  Came here on a Sunday around 5ish. Good amount of people in there but we were able to get seated right away.  Ordered the meat candy, pulled pork sliders, and the poutine. They were all great! Lifehack: put the meat candy INSIDE the sliders. BOMB.  Tried the sixdudesandadonut.com which wasn't bad. I definitely enjoyed the mjango unchained more as it wasn't too hoppy for an IPA.  Loved this place. Definitely see myself coming back more often."}
{"text":"Excellent, enthusiastic service, the BRI beers were legitimately tasty, and the food did not disappoint. \"Meat candy\"- sriracha candied bacon- need I say more? The fries seemed from scratch and disappeared before I could really get a feel for them- more 'research' is in order. ;-)"}
{"text":"Food is unique and absolutely delicious!! We ordered the pretzel nuggets, cubano sandwich, and burger w/ meat candy and washed it all down with their in-house beers. All of it was amazing, as was the service. We will definitely be back!"}
{"text":"If you go here for the right reasons, you will not be disappointed.  That means for unique and non traditional beer choices.  The food menu is small but again pretty unique.  Sandwiches are served on Hawaiian sweet bread and they have a new addiction waiting for you in the form of meat candy (yes it is a type of bacon). But like I said you do not go here for any other reason but to try and enjoy their beer selections.  If you are looking for a michelob ultra, move a long, this is not a place for you.  I tried several of their IPA's with their War Paint being my favorite.  I am looking forward to my next visit."}
{"text":"Good beer! Really good food, make sure you get some frys, and if you like it spicy get the meat candy! Biggest problem was the service was very slow....."}
{"text":"Get the pub burger. It is to die for!! And don't forget to ask for the home made ranch. I would buy a growler if it if I could!"}
{"text":"The staff was great and so was their beer. My only recommendation would be to install TVs. Mumford and Sons on repeat will only keep patrons there for so long."}
{"text":"After seeing this place on Check Please we were excited to try it out. Went on saturday at 6:30. Tons of people and a 50 min wait for  a table. No problem.  Bar was full and we tried to stand in a make shitf line. Big problem.  Several staff behind the bar chatting not taking order.  Then constantly got yelled at by staff to get out of the way. One guy said \"This is a really bad place to stand\".  Hmmm where should one stand to get a beer?  After getting yelled at several time we gave up and went to Wilderness with friendly hipsters.  Assuming you stay this busy I suggest you have a waiter taking orders while people wait so yor customers don't get in your way."}
{"text":"This place is roughly a 45 minute drive each way. The first time I went was to meet up with friends after hearing about it. I've since been to a birthday party, twice just because I could convince somebody to meet me there and this last time all by myself. They have a large selection of beers, many of which are brewed on the premise. And to top it off they have really good food. I've sat on both patios and inside. The service is always friendly As long as it stays this way I'll keep making the drive."}
{"text":"Ok this place is great. I tried a few different beer samples to see and they were all so interesting and fun. I like the 480G IPA a lot. What I settled on was this new one the waitress convinced me to try which was a Honey Nut Cheerios IPA. With the malt, they added a ton of crunched up Honey Nut Cheerios. So inventive, weird, and amazing. This place is fantastic. The vibe is inviting, comfortable, and creative. I love this place."}
{"text":"service was great. However, I thought the beer was okay.  We did a flight of beers, and they came out in some cool 100 ml beakers.  However, the flights were really small compared to what I had at other breweries, and the cost for each flight was pretty pricey ($1.50-$3.25 - depending on the beer/flight).  I thought the beer was okay.  I did like the the Morning Sex (sweet stout)."}
{"text":"I'm VERY impressed right now. The beers are  great and the service is amazing, even with how busy it is. Beer Research Institute really knows how to run a business."}
{"text":"Interesting dinner, beer was good, a bit pricey and food spicy. Everyone liked their food, Mac and Cheese, SW Poutin, and Pub Burger. Next time we go it will be happy hour,  $3.50 craft beers. My wife and I had Belgian Ales. Nice time to relax after a tough Friday. Oh yea, almost forgot to mention crazy card game my son thought we should try, Cards Against Humanity. Nice, laid-back atmosphere."}
{"text":"Their green chili mac is amazing.  Casual, low-key place with great food and a sizable beer selection"}
{"text":"My boyfriend and I love checking out breweries.  We both have a love for good food.  With both of those things being said the beer here is great.  My boyfriend recommended it to his friend that lives down the street.  My boyfriend was not thrilled with the fact that he had to order a whole two entrees to get full.  He ordered the carnitas plate first thinking it would have the portions like four peaks for some bizarre reason.  I ordered the pub burger because I like to play it safe.  Does not take me a whole lot to get full but its just...safe.  It was okay.  I love butter lettuce with all my heart and eggs but there was just something missing and cannot put my finger on it...maybe BBQ sauce?  My boyfriend then ordered the TBLT or whatever next and I can always read his face better than anyone when it comes to food since I normally cook dinner on a regular basis.  It was not the normal loving face he can make when he in absolute bliss from food alone.  Now we loved the beer don't get me wrong. We will be back. But Food might not be in our cards the next time."}
{"text":"Great New Restaurant Near the Movies Great service and Good food - right near the movies. Nice selection on tap and their beers are great. Add this to your East Valley hot spots. My favorite is the made-from-scratch sweet potatoe fries."}
{"text":"What a great place!! Staff is friendly and very knowledgable. Their beer is the best around (especially the Peach  Lolli)! Amazing food with great daily specials that won't leave you disappointed! Love this place!!!"}
{"text":"The beers I tried were good, a nicely rough Red IPA and a Belgian Blonde but I ordered the Green Chile Mac n Cheese and was very underwhelmed. They cheese saucy was watery and flavorless and a store brand, the green chiles helped to save the flavor but still fell very flat and mediocre. Try harder guys I wanted to like the place more!!!"}
{"text":"I was quite impressed by every aspect of this new addition to the craft beer scene in the valley.  I ordered a tasting flight and my hubby ordered the IPA.  I am a huge fan of Belgian style brews, so I was super excited to see two Belgians on the menu.  They didn't disappoint.  We ordered a BBQ sandwich and we both loved it.  The service was prompt and friendly."}
{"text":"Awesome food and awesome beer! The bar has great atmosphere as well. If you are on a date night I think there was some board games for added fun. Did I mention the beer is really good? Try the beer milkshake thing"}
{"text":"I am leaving a good review based upon the beer that I enjoyed there. We order one of the mexican dishes on the menu and judging by the price expected a bigger size portion. We planned on sharing the food item only to be shocked at how horribly put together and cheap it was. I will say that other menu items appeared to look good as they went by but ours however was not. Great atmosphere and good beer though."}
{"text":"We tried this place for the first time last night..we weren't disappointed!! Candied bacon was possibly the most delicious thing I've ever tasted! The service was great and the server was friendly and helpful with menu recommendations. The beer was super good and I liked the atmosphere. A very cool local place! Also..the Mac and cheese with the machaca is the best Mac and cheese ever!! The morning sex beer tasted like pure coffee...so good and such a good sippable beer. We will be back!"}
{"text":"The Spanglish = LOVE. It's a must try! Cool place, relaxed atmosphere with laid back patrons and servers. I will go back...soon!"}
{"text":"Darcie and I found BRI on Yelp and were intrigued.   They get high marks for service, food and beer quality. And there is definitely some mystique surrounding the Where-The-Hell-Is-This-Place aspect.  If you are heading over, and we recommend yo do, BRI is in the strip mall with the AMC 24 Theater on the NE corner of Stapley and Baseline. But where? You'll find it near the Theater to the left.  There are only a few trifling negatives. 1) The interior is a bit stark. You get over that very quickly. 2) Wine drinkers are gonna walk away dissatisfied. The wine on hand is in Cans and are $12 a pop. Darcie could not bring herself to order one. Recommendation... get a few bottles of Chard.  We ordered wings and a SW Cheesesteak to share. Darcie, a wine person, ordered a margarita. She liked it fine. I had a Top Secret Battle Monkey ( 10% ABV 100 IBU) to start and finished with a Lolli ( 8.2% ABV 27 IBU). I liked the Lolli better but both were quite tasty.  The wings came out very fast but were oddly cold. I asked that they be reheated. Off they went. On arrival 6-7 minutes later they were piping hot and exceptionally tasty. The cheesesteak was very good as well, with stellar taste, featuring near perfect meat to cheese gooeyness ratio and veggie distribution.  Beer drinkers rejoice. We'll be heading back soon, a taste for adventure (different beers and food) in our hearts."}
{"text":"Have fruity and hoppy beers, not my favorite but good. Food was really good. Went for lunch and easy to get a seat."}
{"text":"This place houses two of my favorite beers:Lolli and Danger Noodle. I am beyond happy this place is expanding. They have the best brewery in the area hands down. I hope they go to bottling soon!"}
{"text":"Bacon is meat candy - which is TRUE!! Everything was really tasty, loved the sweet potato fries (which are the real, white sweet potato, not the orange ones)!! And yes, the meat candy was a MUST!  I'm not a fan of beer (wah, wah), but they do have cocktail drinks as well; ended up with a Moscow Mule, served in a glass, top shelf which was pretty good! The others in my party got beers and they all enjoyed their drinks :)  I really liked the atmosphere here, it's really bright, open, and loud! They also have board games you can play with your friends, family, or new-found friends while you wait for your food, drinks, or a table/spot to open up!"}
{"text":"Good beer- only tried the 480G but thought it was a pretty decent IPA. I'd give the beer 4 stars, the reason for the 5 star rating is the Green Chili Mac & Cheese with Machaca. It was amazing and definetly a reason I would return!"}
{"text":"Great grass fed burgers and healthy chicken. Beer is most excellent and the staff is like family. Fun place to be."}
{"text":"Food was pretty dry and bland for what  we paid :( I enjoyed beer....but I enjoy most beer.... I've been here twice for beer only and had a good time with the staff who re great at the bar but then tried a date night and it was a little embarrassing how bad the food was."}
{"text":"Sucked badly. Always liked this place in the past but it is now dead to me. We ordered two of their signature pub burgers medium rare. We got two well done dry burgers that were barely edible. They may have been reheated. The main flavor was old grease. Could not finish. We told the bartender/waiter. We were told they were having trouble controlling the temperature cooking the meat. BS. I have trouble paying for bad food. They have about 12 draft beers. If you don't want stout, porter, or bitter, good luck. We won't be back."}
{"text":"Hands down an amazing place. The food is out of sight (especially the pulled pork items and green Chile mac), beers are on point, atmosphere is welcoming and the music was spot on. Our server Zeke was the real deal, super personable and friendly. This is a must visit for anyone in the area or visiting!! Don't be a square and be there!!"}
{"text":"We have been to the theater near this place multiple times, and have always been super curious on how it is. After others giving us rave reviews, we showed up on a Sunday afternoon. I will break down the review in parts.  Decor: The restaurant has very standard seating, with booth, tables, and a sitting bar. They have a full brewery in the back, and do give tours if there is an event you booked. Otherwise, there really isn't too much to discuss when it comes to decor.  Food: We were told that all the apps were half off due to happy hour, not including the high end items. We ordered the nachos, and this is why I won't give them 5 stars. The nachos were terrible. The \"queso\" was broken, as in you can see the separation in fat and oil. Yes, I'm a chef, but when I go to a place that raves about homemade food, this was really rough. The meat wasn't great either, I probably won't order them again. Other than that, I had the cuban with REAL SWEET POTATO FRIES. This was a rare sight to see, and I'm so happy that they have it. The cuban sandwich was great and tasty.   Service: Our waitress was super attentive, and friendly. She helped to break down the menu, and recommended a beer that I really enjoyed. The bartender was really great as well. I asked if I could get a tour in the back, and she told me you have to pay for an event, or take a beer tour with a company to go see. Which is totally fine, they have giant windows to peak in.   Overall: The price is very well reasonable compared to the quality of food I received. I will go back there when we go to the movies to get a bite to eat before. I do recommend those who really like craft beers to try them out, I've heard great things and can't wait to try more of them."}
{"text":"My family was having dinner at red lobster when there server had told them about this new brewery that opened up. Local beers, homemade food. Sounded like our spot!  Awesome little place, variety of all local beers. They were so extremely accommodating! Although they were out of a few things they went above and beyond to make our visit perfect! We need more places and more service like this!! Pretzels and green chili Mac and cheese was fantastic!  We will be back!"}
{"text":"We only had an hour for a quick lunch and decided to try BRI. We were a little unsure of how the seating worked when we walked in. When nobody came to the front, we assumed it was seat yourself. It was very busy and we were lucky to find an empty table in the corner. It took a little while for someone to come to our table and greet us. Finally someone, whom I assume was one of the owners, stopped to check on us. He apologized that nobody had been by and said he would send someone over. After that, we had great service and the staff was very friendly and attentive. The FOOD! We ordered the SW Poutine appetizer, which was fries topped with pico, machaca, and gravy. It was the best gravy I have ever tasted and the fries were perfectly seasoned. A server tried to take our empty plate away and we told him to leave it so we could lick the rest of the gravy off the plate. They were out of the food we wanted to order because their delivery was late for the day. We ordered cuban sandwich, fries, and a side salad. I was not expecting much out of this sandwich, after all this is a bar, and how could anything else compete after that delicious gravy! We were really impressed with the sandwich and even the simple side salad. The sandwich was very flavorful and probably one of the best cuban sandwiches I have had in this area. I can't wait to go back and try the daily soup, green chile mac & chesse, and the tacos.  We each had a draft beer but did not have a chance to try a BRI beer. We will definitely be back to try the house beer.  I'm looking forward to many more visits in the near future. I'm happy to have a small brewery in the east valley with such great food! I would love to see a small outdoor seating area and maybe a few more tv's inside."}
{"text":"My husband and I went there for lunch yesterday, (Sunday, April 19th). He had been there before and thought it was a cool little spot. We sat down at the center booth, waited about 5 mins for a server to come over and bring us menus. My husband ordered a beer and I ordered a rum and coke. Another server brought us waters which was nice. (We had a total of about 4 servers) Then our drinks came, my husband got his beer, but for some reason I received a Jack Daniels and coke. Don't get me wrong, I like whiskey, but I ordered RUM. They gave me a new drink, no issues there. Someone came back around and took our food order, I was STARVING and everything on the menu sounded amazing. Now, I get that this is a small hole-in-the-wall bar. I don't discriminate on bar food. However, it took **45 MINUTES** for us to get our food. The place was relatively busy, I understand, but they were serving food to tables that ordered much later than us, like 30 mins later than us and it's a SMALL place. Needless to say, we were completely forgotten about. A guy that I am assuming was the manager even walked about with our food, but for some reason thought that it went to the table next to us. He got completely confused when he saw that they already had their food. Don't mind us! The empty table directly next to them starring at you!! He then ran back to the kitchen with our food where I am only to assume he tossed it. Because 5 minutes later he told us that he was sorry for the wait and the food would be out in 2 more mins. 2 more mins? Why? You just had it in your hands!! Well 2 mins became 10. He returned to tell us he was sorry yet again and that it would be another 5 mins. That 5 mins became 15. At this point I am officially HANGRY and about to hulk smash our table. They FINALLY bring out our food which LOOKS worth the wait. I ordered their chicken sandwich, I attempt to grab it to scarf it down when I had to stop. I am not sure where this amount of grease was coming from, but it looked to me as if the chicken was peeing itself. Literally. It drained for a solid minute. I now had grease soup on my plate. I go to take my first bite in spite and the entire thing fell apart into my grease soup. I had to ask for a second plate so that I could attempt to eat it by cutting it up without saturating it again. My husband's tacos did the same thing but basically worse. His taco grease was a much darker and disturbing brown. I was so grossed out I just gave up any hope of eating. I immediately felt sick and worried as to why this took so long and what exactly was I trying to eat. Even though I sat there with pure disgust on my face with 2 full plates of untouched slop, no one seemed to care. They just brought us our check. 4 drinks and 2 plates of slop for $50. Let the hulk smashing begin. I will never step foot in that place again, no matter how hangry and desperate I am. I've had MUCH better bar food for much less money. Even Filiburtos has treated me better."}
{"text":"Love, Love, Love this place!  Good selection of beers and sometimes ciders.  They have very yummy food.  I highly recommend the Spanglish (you can order it with regular bacon -it usually comes with \"meat candy\" which is spicy).  This is our to-go place for an spontaneous outing (since it is close by).  I had read other reviews where people commented about the noise level at this place, but every time we have been there, we are able to talk without having to scream at each other.  I would say its noise level is pretty normal to low.  I highly recommend this place!"}
{"text":"It's school time!  Grab your pens, pencils or hell why not grab a pint glass and take in the professional instructors!  This place is legit, in house craft beer that really leaves you wanting more. A full bar is available if you are not the beer guru, with wine and spirits. The staff here brew onsite really put their heart and soul into what they produce. Guest beer on tap is also available from other brewery's which mixes it up.  They also offer you some really awesome food options, I highly recommend the SW pontine, a great southern mix of Canadian mex that will leaving you wanting more.  Knowledgeable staff and good food really makes for a wicked brew pub that can rival any other in the area.  Overall: Food: 5-5 Drink: 5-5 Service: 5-5 Coming back: you know it!"}
{"text":"If it were ever possible to love a brick and mortar building and all its contents in a legally significant  way, I would chose this one. Their beer is beyond anything and when they combine thier expertiese with another brewery, the result is of a Gotenks-like magnitude. Just amazing FUUUU-SIIIIION-HAAAA. The GM Jason is incredibly welcoming, knowledgable and savvy about brew. Their food is accessible but elevated things like poutine, burgers AND, most importantly, meat candy. Their bacon appetizer glazed in chile and sriracha is the most amazing thing I've ever noshed. We had two flights that spanned only half of their beet menu and nothing on it was less than perfection. Some were from other local breweries, but most were from their back room. I had many pints of their stout called Morning Sex and it is EVER BIT as good as its namesake. Other winners include thier Peach IPA which is a beer you want to order as soon as you get word of it. They don't print it on their menu because it is so popular. Kegs are drained in 2 hours they report. The flights are served in brass knuckle holders with each brew in a beaker. Its all academic and I want to transfer my credits from college as soon as I can."}
{"text":"I walked in to grab some lunch the other day and when I sat at the bar I was greeted by the bartender who was very polite. I told him that it was my first time going there so he gave me the break down about their beers and menu. I saw that they had a tv at the bar and i asked him to please put on sports center on. He stated that they didn't have any cable or satellite channels. Unfortunately I had to walk out. Maybe if they bring some tv channels in I will return to try their food and beer."}
{"text":"The beer here is quite good. The atmosphere leaves a bit to be desired but its still a good place.  The only reason for 3 starts, and the beer is really driving the 3rd star, is the food. We ordered the pretzel bites and they were a bit off. Not sure if they fried them or not but they  were very oily and had a siracha after taste. And for $7 it was a bit small.  I would not re order and they did not look like the baked pretzels others have posted pictures of.  Service was good. Overall I'd probably come back.  On the high price side.  If the food had been better it would get a solid 4 stars from me."}
{"text":"The Food was AMAZING... The atmosphere a little awkward, and HORRIBLE location but we WILL be back. Hubby had the Spanglish. And DEVOURED it. Literally even the server commented how fast he ate it. He had been there before and knew EXACTLY what he wanted. I started with a tiny salad w/ ranch- Shouldn't be called Ranch, it was REALLY good, but nothing close- maybe call it \"house\" or \"BRI Original\"?? It is REALLY good with the fries! I had had the SW BBQ (on hoagie- im not a fan of Hawaiian rolls) it was great and the server had no problem accommodating the switch and it was pretty dry, but a side of BBQ fixed that right up. And drum roll please...... The green chili mac and cheese was OUT OF THIS WORLD! IT was SO HOT. And SO CREAMY. IT was PERFECT!!!!! I am a mac and chz eater- I try it everywhere i can. And this is hands down the best green chili/spicy mac ive ever had!!! Had a sample of watermelon beer and cherry bomb, both a little off separately, but when I mixed them.. OH YEAH. I actually ordered a 1/2 watermelon 1/2 cherry bomb. It was delicious. We sat on the back patio, nice and shaded buy HOLY COW was it hot. No air, no breeze, no misters, no fans... DEFINITELY need to consider something back there. But it was quiet and fun to people watch the movie goers. And what are those hooks under the tall tables?!? PURSE HOOKS?!?!?! GENIUS!!!! The service was FANTASTIC. He was so personable. Talked with us for a long time (hope he wasn't neglecting anyone). ;) I dont' understand the name... But it doesn't matter the food was awesome. The \"hostess\" looked like a hooker... but again, we WILL be back-  for the food. Really wish it was further south and east. Would be a HUGE success in downtown Gilbert?!? Downtown Chandler? San Tan village? Anywhere, than where its at. Lol. Just would have preferred to walk around and enjoy the night when we were done.  Cant wait to go again!!!"}
{"text":"Amazing locally sourced food and extensive knowledge of their brews. Great atmosphere, will definitely be back again."}
{"text":"Everything was amazing! The food, the staff, the beer, we have no complaints whatsoever. Our only regret is that we are only in town for the night. Absolutely delicious! .... It's been months, and I'm still thinking about how amazing their house made fries were....for reals. I'm craving them so bad right now!"}
{"text":"I loved this place.  I am gonna work towards bejng a regular there. I didn't get the bartenders name but she was cool and provided great customer service.  Had a quick convo with who i believe was the owner and he was extremely nice.  I had the meat candy and the spanglish,  it was different but very good.  I got their beer sampler with 4 different beers.  480g, street cred,  batch #1 and some other beer I forget the name of.  But they were very good.  The 480 and batch #1 were my favorites out of that sampler   I enjoyed my visit there and will keep coming back.  I even went back the same day to get a growler filled with batch # 1."}
{"text":"Love the BRI. First of all their food is really great! I love the Cuban sandwich they have. Their beer is great!! There is always a different selection. The atmosphere is fun and the staff is great!!"}
{"text":"Great beer. Great food. Great service. Reasonable prices. Fun beer names, like \"Top Secret Battle Monkey\", which my son enjoyed.  Tried \"Not-Chos\"  with Machaca for the 1st time.  Good stuff."}
{"text":"Saw them on Check Please so we gave them a try. We had the Potine and the Candied Bacon. French fries were not done in the Potine and the bacon taste was overwhelmed by the pepper. Sat at the bar next to a regular that told us the bacon was not worth ordering. No abience, concrete floors Beer was not cold, had Morning Sex which was a chocolate coffee beer, and a lighter colored one that was good. We got happy hour prices so the bill was not a factor There is so much competition in this space we will not be going back It is ok just not special"}
{"text":"When I visit a brewery for the first time they get ranked against all the other beers I've had before. More importantly, they get a yes or no on whether I would recommend them to a beer snob visiting from somewhere else.  BRI gets a Yes on that front. They also get added to the list of Breweries I Would Go Out Of My Way To Visit. There are way too many places that have popped up around the Phoenix area in recent years that make a mediocre to respectable beer but not of the caliber that would make them competitive against the premier places. BRI might be vying for the latter. Recommended."}
{"text":"This is a good place for groups and the beer is pretty good (and strong!). They're rather new and I think that shows in the service...or lack there of.  During my visit it took me about 20 minutes to finally put a food order in.      That gave me time to look over the food menu which is interesting and quite unexpected from your first impression of the athmosphere.  I went with the cubano.  The chef is definitely heavy handed with the meat as the sandwich was heafty.  The beers run about $5-$7 and the food was reasonably priced.  I'd swing by again for lunch if in the area and probably try the Spanglish sandwich."}
{"text":"Fav place to eat, fav craft beer, and one of our fav places to hang out!! Meat candy is phenominal, green Chile Mac and Cheese is bomb, their fries are amazing, Spanglish is amazing, etc!!! And you can sub and change anything around since everything is made fresh and from scratch!!! Mmmmmmhmmmmm!!"}
{"text":"Great food, great atmosphere and great tastings!  I will say that they are a little pricey but if you go at lunch you can get the special (whatever it is) and it will blow your socks off!  Also, while sitting we asked for tastings and was very happy that they provided any and all that we wanted.    They also offer growler refills with some very delicious beers"}
{"text":"Good food, good beer. The poutine was delicious. The barbecue pork sliders had great flavor but unfortunately there was so much sauce dripping from the coleslaw that immediately after they were presented the bottom of the bones were completely soaked through and mushy. Just flip them upside down though and make it an open face slider and they're okay that way. All in all I'd return"}
{"text":"I really liked this place.  Food was good, good size portions, and the fries were exceptional.  Service was good, place was clean. The reason I gave them 4 stars and not five?  We aren't beer drinkers so we had bloody Mary's . $8.00 a piece, which is a bit much but if it's good, I don't mind.  It was hard to get to the taste because they were so freaking hot! There was a piece of bacon across the top of the glass that had srirche or chili sauce piled on top. As well as a huge amount in the glass.  Way over the top.  My husband likes hot food and he couldn't drink it.  More is not always better.  When we go back, maybe I'll try the beer."}
{"text":"Food was very delicious and staff was polite. Atmosphere was very awesome. Would recommend this place."}
{"text":"WOW, had the silly philly cheese steak sandwich and it was one of the best sandwiches I've ever had! Came with a side of fries that were also seasoned and delicious!  All the beer was really good and different as well! Would definitely recommend this place"}
{"text":"I love this place.  Great beers and great food, what else could you ask for? Definitely one of my favorite breweries in Arizona."}
{"text":"We came here for drinks and a bite to eat. We both got burgers and I didn't think they were anything special (mine was a little burnt too). The servers were friendly and my husband enjoyed some of the beers (there were no standouts). I am not a beer fan but they had canned wine which was surprisingly delicious!"}
{"text":"Good beer and pub grub but they kind of need an interior make-over."}
{"text":"Friendly staff and the food looked good (I'll try it next time). I thought this place was considerably better than the overpriced Arizona Wilderness Brewing. Solid, creative IPAs! I'll be back!"}
{"text":"Ordered the pulled pork sandwich and with a side of the mac and cheese.  Pulled pork was good, came with jalepeño slaw on top, it wasn't spectacular but it hit the spot. The mac and cheese made me regret not ordering a full portion for my meal, it was incredible,  with green chili and shredded cheese melted over the top. My buddy ordered the machaca tacos, the meat was visibly dry. he didn't enjoy them at all and left the rice and beans on his plate. Our server sensed his disdain and offered us a dessert for free. He got the bread pudding with this whipped cream, almost a mousse, made with cappuccino porter. It tasted like tiramisu. I will be returning for copious amounts of said bread pudding which I will be shoveling into my face with both hands. The beers were awesome, and is must go to spot just for that."}
{"text":"This place was delish! Our first time and we will definitely be coming back. Thankful for a friends recommendation because they are so hidden in the back of a strip mall. Amazing sliders, ( we had the pulled pork ), Wings ( medium ) but saucy and grilled - so good! The sweet potato fries were really crispy as well. We sat at the bar and had great service. Will definitely be back!"}
{"text":"Rolled in spur of the moment.  The place was chill as it was 4 pm, happy hourish.  Their beer menu had all the beers but no description luckily the bartender helped me out and even offered samples.  Overall my impression is this spot is heavy on IPAs.  I like 'Em but I'm sick of the hop contest that you get more and more.  It's like a hoppiness coldwar.  Seems like some spots tries to \"out hop\" the rest.  I guess it's just a function of what the people want. Anyhow, overall good. Food looked good but I didn't eat anything.  I'll probably come again."}
{"text":"We came here when they first opened and loved it. They've now expanded! Great Brew Pub with good food as well. The staff is always very friendly and welcoming. Having a GREAT time with my wife at lunch!"}
{"text":"This review of the Beer Research Institute is long overdue.  Like, close to two years overdue.   Sorry, BRI!  The first time I dropped in was in May 2015 with Cheryl B. and a handful of our friends on a Sunday afternoon.   We have been back many a time since, whether it's to enjoy a casual pint, a birthday party or a low key dinner.  They brew a majority of their beers on site, and the selection is plentiful - Provided you don't hate beer, you're sure to find something you'll enjoy.  The flights and tasters arrive in beaker glasses resting in what appears to be a brass knuckles holder, staying true to their theme.   I am addicted to their Mjango Unchained IPA, Lolli, and Peach Lolli. Recently tried the Morning Sex Coffee stout. Be careful with that last one, it is drinkable and will sneak up on you.   Wish they'd bring back the Julian Black and Blue, it's been a while since I've seen it on tap. Perhaps my timing sucks?   Food wise, everything we've tried has been fabulous, but I'll pick my top 3:  1) Green Chile Mac & Cheese with Machaca   Is that Green Chile #NewMexicoTrue ? Hard to tell, sometimes it's hot and other times I can barely taste it.   Either way, you'll enjoy this perfectly baked, just the right amount of gooey and creamy Mac & Cheese. The Machaca is a must add: Cooked right, never tough to chew and seasoned appropriately.   2) Pub Burger   Make sure you put that infamous Sriracha Meat Candy (Bacon) on it. Love biting into this and having that fried egg run everywhere.   Order it with the fries, and a side of Ranch. Holy smokes their Ranch is out of this world. I'm not sure if it's fresh dill they use or what, but I'm a fat girl and I looooooove my Ranch and have no qualms paying for extra. Get a side of it!   3) Pineapple Habanero Grilled Wings   Sweet and Heat is always a neat combination. Ask your server to have the kitchen grill them a little longer for optimum crunch.   The service has never been anything short of friendly.   Oh, and how about those purse hookers under the table? Wish every place had them.   Another excellent option in our Phoenix Brewery and food scene. Always look forward to a return visit! :)"}
{"text":"After throwing  3 birdies back to back in a round of Disc Golf, I wanted to treat myself to a nice meal. I was going to go next door, but after looking into the Institute I got a really positive vibe and went in.      It was a great decision!      As usual I choose the highest % alcohol brew. The \"Top Secret Battle Monkey\" Imperial IPA. I've always found the stronger brews are a good way to determine if a micro-brewery really knows what it's doing. This brew was very, very delicious. I had 2 and could have spent evening just sipping on glass after glass.      For the food my friend had the Stacked Enchilada, which had Southwest grilled chicken inside, a wonderful Chili Verde sauce ( which was a little citrusy) and a lovely egg on top. It was actually much better than my BBQ sandwich.      I had the South West BBQ Sandwich. It was nice but could have been better. Personally I'm and old school BBQ fan. I like my meat  with just it's smoked flavor and the texture of the meat as it comes from being pulled apart. Then the sauce on top. That way you can tell how good the place is at smoking their meat. My sandwich came with the meat soaked in sauce leaving very little uniqueness to the palate and it was very moist, squishy and almost paste like with no real bite to it. You really need that bite from the outside bark and it's delightful chewiness from the smoker to make it a real BBQ sandwich.      Don't get me wrong. The flavor was great and I loved the sauce, I just wasn't thrilled with it's mushiness.      I choose a side salad instead of fries and to be honest the Blue Cheese Dressing was uniquely different. I think they added a little extra spice or something, because I couldn't get enough of it and even scooped it out of the little cup with my finger. So Yummy!      I will be back here often. I really want to try some of the other dishes that made it so hard to decide on a meal.       They all looked so good.      If the two were separate, it would be an outstanding sandwich"}
{"text":"We came in before catching a play at Mesa Arts Center. We were seated promptly and our beer orders taken. The server was very knowledgable and helpful. It was a very busy night because they were hosting a guest brewer from another brewery, which seemed more like a private party for the brewery staff's close friends. At one point, a owner or manager stood up on the bar and told everyone about it. I was glad not to be sitting at the bar with his dirty shoes next to my beverage or where my food would be.  We then ordered our food. I ordered the Build a Burger and my wife the Pub Salad... and then we were forgotten. We waited 35 minutes to finally get our food. At that point we asked the server if he could box it up, so we could take it with us. He seemed surprised, but we explained we had a show to catch and would have to eat in the car. He left and (what seemed to be) a manager showed up with our food. We explained to him our frustration. He apologized for the wait and told us \"one of their grills went down\" and that he \"took care of our entire check\". We were very surprised and grateful.  So: Food=average Beer=good Atmosphere=nothing spectacular Service=good Communication=lacking"}
{"text":"Every once in a while I come across a real gem. Beer Research Institute is one of those breweries. Good beers range from east coast style hazzy IPAs to fruit and even Belgian style beers. Scratch made food was also on point... siracha candied bacon and the best bread pudding ever. Even the staff was knocking it out of the park in my visit, even taking the time to learn my name."}
{"text":"The beer is great, the food is good, but the service is horrendous. First time I went it took quite a while for our food even though there were not many people there. I thought maybe it was just a bad day so I decided to try it out again. The second time it took 2 hours for three of us to order two beers and a meal. As much as I want to like this place, I will not be coming back."}
{"text":"I have been hearing good things about this place and finally had the opportunity to stop by. It is a small place, only open a few months, but they have a nice thing going. I went to try their brewed beers, even though they have a good rotation of guest beers also.   I ordered a flight of four beers, but then saw they had five home brews so the Belgian Tickler became a full sized. That was an excellent beer; a collaboration for College Street. The Vanilla Porter was good, War Paint Red IPA also good, and so was the Lolli. My favorite was the Saison D'hiver - one of the best saisons I have tried.  I did not have the food, but I saw others around me getting it and everything looked awesome. I will go back to try the food. The beer is excellent and the prices are very good. I had the flight and the snifter of the Belgian for under $10 with happy hour."}
{"text":"Great beer, fantastic service!! Must try the wings, meat candy is out of this world. The lolli Belgian blond ale, is lite n tasty it has the right Belgian flavor. The saison is really good. I ate with a big group everyone loved there meals! Mac n cheese w meat candy sauce was amazing. They brew beer on site, locals should come everyday!! I would!!"}
{"text":"This place is fantastic: beer, food, service and atmosphere each get 5 stars.  And I rarely give 5 stars. We came in for lunch and shared a beer, Belgian lolli, which was excellent. We ordered a sandwich and the chili Mac & Cheese with the meat candy (sriracha bacon).  The Mac & Cheese may have been the best I've ever had.  The fries that came with the sandwich were superb with their homemade ranch sauce.  The waiter said that everything in the place is made from scratch with the exception of the rolls and sandwich bread.  It showed in the food. Our server was very attentive and helpful in recommending things, which I love.  We want to come back soon to try other beers and their house Poutine. The description made it seem like a hot mess of fries, cheese, gravy and meat...mmm. Can't wait. As far as food goes, I would choose this place over Wilderness or San Tan Brewery."}
{"text":"Absolutely incredible place! The food is house prepared! Local vendors, etc! It's a concept that is off the hook!   Beer is nearly perfect! Nuff said ... Flight was grand! Lolli my fav!!!   Food was divine! Meat candy is must! Grilled wings.. Yum! And pork salad.. Perfect!   480G is bomb.. Keep them muther Effin heads ringin' ... Lol took us back to 1994! Yay!  Love the Easy and straight outta Mesa tee idea! Even bought one! Great service by Derek and Jason's heartfelt story was awesome!  Lifes too short... Nig... We'll be back soon!"}
{"text":"This place is located right beside the AMC theater.  We stopped in one night to have a quick beer while waiting to see a movie.  They have their own beer and each one has a pretty funny name.  We didn't try any of the food they serve but the people around us were eating and it all looked good.  The one issue with the place is that it's extremely small so there isn't much seating and you're stuck sitting at a tall long table with people you don't know.  If that doesn't bother you then you should check this place out because it is pretty cool."}
{"text":"Went in here on a Sunday afternoon and the place was full of smoke from the kitchen. It doesn't look like there is any ventilation. Weren't greeted or felt welcomed, and our booth had ripped seats. The food was good and our beers were great. The problem was that the service was terrible. Seemed like it took a long time to get our drinks, and when they arrived, they were sweaty and barely cool, like they've been sitting around waiting to get picked up from our server. Waters were empty for most of our visit and weren't filled until we asked twice. Server messed up one order and when it was brought to her attention, she gave us a crap response and uncalled for attitude. It really seems like this place is for craft beer snobs and that's it. Smokey interior with sub par service. Rating it 2 stars because the beer and food were good. Everything else was garbage. I will not be back."}
{"text":"I really enjoyed the food here. The green chili mac and cheese is very tasty, and the best mac and cheese locally I have found, as most places just give you a liquid cheese. They also have meat candy as a side, which is candied bacon with sriracha - scrumptious. Their poutine is delicious as well, and they use fresh cut fries which are a requirement for me to give props to. The brewery has about 5 of their own beers on tap as well as some guest brews. I enjoyed a couple of BRI's but would like to see them have more of their own. I wasn't a huge fan of their brownie dessert."}
{"text":"Amazing food! We had pretzel bites, green chili French dip with sweet potato fries and Cubano with Mac and cheese. Of course we had to try the bread pudding! Delicious!!!!!  I'm not much of a beer taster - but all three were really good.  My only two complaints- the music sucks! And take the sugar off the sweet potato fries. Next time I will order no sugar and they will be the best fries ever eaten. Definitely a must try, just bring ear plugs."}
{"text":"love these guys. great beer. staff is awesome. support this local business"}
{"text":"Went there for a friend's birthday last night as it is close to where he lives and where we have our monthly beer brewing sessions - so a brew pub seemed an appropriate spot to celebrate. Unfortunately, they do not have any of their own beers on tap but what they do have is nicely curated and some interesting beers from various craft breweries.   What stood out for me was just not the beers filling the gap till they get theirs on tap but the quality of the food, it was excellent! They grill their wings versus frying them and they have a side order of candied bacon with sriracha that was delicious (though I would like to see it crisp and glazed versus soft but still good). I have to be honest, all the food we had was much better than I expected.  As for the decor, a thumbs up to the old fashioned lights with bulbs made from 1 liter yeast starter flasks, that was unique and wonderful. What they do need to do is adjust the regular flood lights in the middle, maybe replace with someone with more of a golden glow as they are so bright they sort of drown out the ambient light of the flask based lights.   As for location, if one doesn't live in the area, once the rail is extended pretty easy to ride the rail and then uber it hear and if you drive, right by a movie theater so great location. I have a positive warm glow about this place and can't wait to go back when they have a few of their own beers on tap. :-)"}
{"text":"Pretty cool place! They definitely hit the theme research, I like that they stuck with it through out the restaurant. Your beer testers come in little beaker jars and their lighting is custom with lab flask! Very unique. Not only do they serve different types of beers (not your bud light kind of place) they brew a few different ones themselves. Pretty decent selection! As far as food goes, I wouldn't recommend the tacos, but definitely try a burger! The pub burger to be exact! Huge, pilled on with bacon, eggs, it was delicious! Stop by and give this local place a try! Ohhh and if you can sit in the section with the waiter with the awesome monopoly man mustache, do it! He was very attentive, nice, funny and lets face it, has the coolest mustache I have ever seen! LOL! Im sorry I cant remember his name, but BRI give that guy a raise! :D"}
{"text":"My husband, son and I stopped in for a quick bite and a drink this afternoon and we really liked this place. Service was great, and the food was delicious. We started with the pretzel appetizer, which was very good. It came with a cheese sauce which was so tasty my husband kept it to eat with his fries. I ordered the grilled chicken salad, my husband had the pub burger and my son had the green chili Mac and cheese. My salad was fresh and well dressed. My son loved the green chili Mac and cheese, it was creamy and the green chili flavor really came through. My husband really enjoyed his burger and the fries were fresh cut and delicious. Our only suggestion is that the beer could be colder...our beers seemed a bit warm. Overall, I'd definitely recommend this place and we will definitely return."}
{"text":"We were excited to try a microbrewery. We were a little disappointed though. The beers weren't good quality for a microbrewery. Felt like we could have made better ones. The bacon appetizer was delicious, but extremely spicy. The tacos were decent, but the beans and rice were bad in flavors. Overall disappointed in my experience here. They have extremely cool taster glasses."}
{"text":"Clean, cool place for drinks. Jenna was on it and very friendly. Will be back to try their food."}
{"text":"Great beer and food! The staff is very knowledgeable about the beer. Make sure to try the Meat Candy. Delish!"}
{"text":"This place is near AMC Theaters off Stapley in one of those small storefronts.  There is a small patio area, and most of this eatery is seating area.  The bar is adequate size and the bartender was informative regarding their special brews.  The menu is lacking and expensive for what they are making.  The bathrooms were clean and maintained."}
{"text":"This was a great place for some amazing beer, and the food is top notch. Had a very good time and awesome experience"}
{"text":"We are from MN and were in town for a night. Found this great place. Great beer & friendly service. Nice vibe. Best part, which was a pleasant surprise for a brewery, was the food. We had the Nachos which were the best ever! Then followed by a delicious dessert!  Highly recommend this place. It's gonna be my go to brewery when I'm in town so I can try more of the delicious options on their menu."}
{"text":"Pretty darn good. Went here for a pre-laser tag lunch and beer. First off, the server had an excellently groomed 'tache. Nice 'tache bro. Very nice staff who engaged my friends and I in conversation many times. Great beer recommendations. We all ended up getting the burger and beer special for the day. Burger was delicious, grilled excellent with thousand island and jalapenos. Mmmm mmmm. We went on a sunday and there was barely anyone in there (which is probably to be expected on a sunday) but it filled up fairly quickly around 1pm. The location is a bit obscure inside the shopping strip, its tucked away behind a wal-mart, but when in Mesa I will definitely be back, thanks guys."}
{"text":"Really impressed with this place. Beer was fanstastic! We had the SW Poutine, Pretzels, and Meat Candy for appetizers. All were delicious! Might have to come here again and try other items on the menu."}
{"text":"I am a HUGE fan of this place, and with good reason too. I know it's a bar, and the beer is really good, but the food menu is even better! I like the freedoms that the chef takes with the daily special. Every daily special is different from the next. One of the draws (maybe a drawBACK for some people) of this place is that they have NO TV'S. The reasoning is that they want you to talk to the people you came with, what a novel idea!"}
{"text":"Delicious food and nice kitch. I got a burger with Mac & Cheese and Salad as sides. I'm a big eater but I couldn't finish it there was so much. Can't wait to go back next time I'm in AZ."}
{"text":"Yeah, the beer's not bad. I had an IPA and an American ale that were both...beer. Neither stood out for any special reason, but neither tasted like water.   Food's okay, too. I went with a friend, and we're both vegetarian, so we were basically stuck ordering sides (we're used to that, so it's not a big deal). We had beans, sweet potato fries, and mac/cheese. Of the three, I definitely recommend the mac & cheese.   If that were it, I think I'd go back for another try...  But the service. The service was terrible. We went at 1:30, and the place was far from busy. Even so, we were constantly left waiting for service. I was also taken aback by our server's unhelpfulness when it came to ordering. I asked her which of the IPAs she recommended, and she told me to choose the one that smelled and tasted like weed...Just a note: that is not a good sales pitch.  To top it off, a regular came in near the end of our meal, and wanted our table. For some absurd reason, the server thought it would be okay to ask us to move tables just for the other customer. Um, no?   Anyway, that's about it. Decent beer, decent food, and awful service."}
{"text":"Just got home from the San Diego beer seen. Found a new nano brewery in my backyard. Friendly bar tender and showed pride in the beer. Good beer and good food. Need to go back fore sure."}
{"text":"This place has a great coffee stout.  I was also impressed with their grilled wings (order them extra crispy). They were great. I've also tried the pretzel nuggets with queso, but I don't think it's worth the $7 they charge. The fries were just average to me.  The brews, the wings, and their great customer service keep me coming back."}
{"text":"Excellent beer, very good food, attentive, friendly service, and a stack of board games by the door.   The beers range from the creative to variations on comfortable old favorites,and the selection is wide and deep."}
{"text":"Beer is good, food is good service was a little slow met the brewers at an event late last year trying vanilla porter was the bomb  had not had a chance to go to location until today will be back"}
{"text":"Had a great time. Great beer and burger was delicious. Best part was how friendly the staff was and very prompt service. We'll definitely go back !"}
{"text":"Brand new place that looks very promising but I don't think they worked out all the kinks. It's obvious this is a beer garden. Great choice of beers. What's letting me down is the food. No vegan option, no seafood, no veggie option. This place was designed for white collar couples and friends with no regard to Arizona's unique food cravings. I'll come back when they have food for everyone."}
{"text":"Food is pretty good, service could use some work. I highly recommend the meat candy!  Beers are pretty good as well. The place is small and fills up quickly so definitely go early and on weekdays to get a seat."}
{"text":"Very friendly relaxing place for lunch or dinner. Good beer made on site, and great food. Just a pleasant place for a stop."}
{"text":"This place was great, yes I am a vegan. No I didn't come for the meat fest.   I came for beer! And they did not disappoint. My dad was excited to bring me here, because they are rather new and weren't here when I lived in town. Darn! Got a few flights to test out their selection and enjoyed them all. Their IPA is really good.   The food is not very vegan friendly, but being in Mesa I'm not surprised. I was able to get a salad though so I was able to put something in my belly. It was good too! My family got meat stuff and enjoyed it. There was a bit of an issue with one of our meals, but the staff were extremely on top of it and impressed all of us with their attentiveness. And no, it wasn't meat in my salad... :P  They were pretty busy for a Friday afternoon, so I can imagine they are packing on the weekend and in the evening."}
{"text":"I can't really get enough of this place. The Mjango Unchained is amazing. Such a high abv but all you taste is a gentle IPA flavor. The Morning sex is the best coffee beer you will ever taste! It pairs with the bacon bread pudding perfectly! I'm a die-hard CA small brewery fan, but this brewery is by far, the whole package."}
{"text":"Decent beers in an odd atmosphere.  Calling your beers things like \"sugar tits\" and other sexual innuendo is cool and all, but I feel like this place is trying a bit too hard to be trendy. The food was OK.  The salad was too spicy for my sister, as were the tacos.  I love spicy food, but some kind of warning on the menu would be nice. No real problems with the place, but no real reason for me to return."}
{"text":"Morning Sex by BRI* was amazing!! A sweet coffee stout. While Robert had Lolli, by the same company. @B.R.I.Brews you made our afternoon.  And The Beer Research Institute burger was almost as good as our server. He was fantastic!!"}
{"text":"Went in yesterday for a drink, and wasn't impressed with the service at the bar. My husband got the Salty Dog, and I got an Old Fashioned, which were both good. But the blonde bartender was so unfriendly, and it ruined the whole experience. We just wanted a quick drink, and originally told her no thanks to the food menu, but the people next to us ordered food, which changed my mind. We waited over 20 minutes for her to even check on us, and I made eye contact and smiled at her several times during those 20 minutes, and she still didn't come over so I gave up on asking for a menu. I used to work at a bar, and was surprised she didn't even smile at us once, and only said three words (\"okay\", \"yeah\", and \"uh-huh\") to us the entire time. Overall it was a bummer, since I have heard such good things and the atmosphere was cool. Other guests sitting at the bar were more helpful then the bartender, by giving me suggestions on what to drink, and were bantering with us which was fun. And I loved the little beaker glasses and lights. But I doubt we will be back, after the poor service."}
{"text":"So I went to the Beer Research Institute because I had their \"Morning Sex\" stout at  another local bar. I had found them on Facebook and the pictures of the food looked amazing so I took a 20 minute trip to try them. When I walked in they were pretty busy. I would have preferred a bar seat but ended up at a booth which was totally fine. The waiter was great. He was friendly and had my beer and food ready really quick. I ordered the Morning Sex instead of trying something new because it's so good. I ordered the pretzel bites and the steak chimchurri  tacos. I was a little disappointed with the tacos. I tried them first without adding anything to them and the meat was pretty greasy and bland. Once I added the pico de gallo and sour cream they tasted better, but I still was not impressed. Maybe my expectations were too high?  The atmosphere was pretty cool. They brew their own beer there so you can see the giant vats. It seems like a pretty laid back place   I probably won't be back just because it is so far from me and the beer I really like is served at a bar that is close to me. If it were closer, it might be a different story.  I would suggest it if you wanted to go somewhere that had good beer and you lived close by, but I would suggest something else for dinner."}
{"text":"This place is kind of hidden next to the AMC theater and doesn't look like much from outside, but is really great! Service was fantastic and the server was very knowledgeable about their beer selection which is very interesting. I tried a Black IPA which I loved.  The Grilled Teriyaki wings and Mac and Cheese were both very yummy. We also ordered the Pub Burger which looked like heaven but was totally charred and overdone.  Aside from the burger, we've had a couple enjoyable meals here now and will be back."}
{"text":"Great staff. Great service. Very good food!  I always love no matter what time of the year it is. They always have a dark beer on tap!  Most think stouts and porters are just fall/winter beers but for some. They can be drank enjoyably all year.   One of my favorite spots to stop in when Im out in the east valley.   If you like stouts??  Try their morning sex!!"}
{"text":"Great beer. Good inventive food TERRIBLE service on a Friday night (7:30 ish). 20+ minutes for a beer, 1 HR. For food order. That was wrong....I don't know about the rest, but our server was ambivalent and next to useless- when we could even find him"}
{"text":"Came on a Saturday with family. The layout of the Beer Research Institute seems chaotic and unorganized,which doesn't really give welcoming or good vibes when entering.  This is a seat yourself type of place; like most bars, which is reasonable.  After scanning the items I ordered a 4oz Strawberry Who's Mike and the Pork Sliders.  I'm not much of a beer person, so I ordered the 4oz, which the waitress repeated and confirmed. Then I got the pork sliders that supposedly had jalapeno sauce in it. Honestly, I was gravely disappointed, the pork sliders tasted sweet and plain, not spicy and tender. The Strawberry Who's Mike tasted like wonder bread and has not the slightest taste of strawberry. Then above all the waitress gave me a 12oz glass; when I specifically told her 4oz, then charges me for it. I just would not recommend coming here, the food is plain and it seems like they train there employees to up charge and giving people orders they did not ask for."}
{"text":"I have been to many brewery's in other states and I honestly put this location at the top of the list. My group sampled 8 brews and everyone was tasty and unique. Best was the whisky barrel dark, awesome blend! Unique brews are hard to find, these finishes stood out and were very individual.  The food was equally well prepared. Spanglish sandwich was excellent. Over easy egg was perfectly prepared, runny yoke but absolutely no undercooked white. Spicy sauce complimented the rest of the sandwich and the sweet carmelized bacon (a specialty there) very well, fries were crunchy and seasoned just right for my taste.  Very reasonable prices.  Best of all, employees were knowledgable about the brews and how they were made. This will be a stopping point every time I am in AZ from now on."}
{"text":"Food was pretty good. The beer was very good. All the beers were well crafted and on point for the style, very flavorful. They obviously have their brewing skills down and the food is a nice add-on."}
{"text":"My wife and I don't drink alcohol but we came in for the food and it hit the spot Bobby was are server and was great ,you have to try the meat candy and the brownies were the bomb and I don't usually use that word the but that's what they were the  steak sandwich is what I had and my wife Carne witch were both good, I don't normally write reviews but had to share this one"}
{"text":"This place is amazing! The food is done right and sourced correctly. The beer is always fresh. And happy hour is really on point. I cant say enough about how much I enjoy this place."}
{"text":"Huge fan.. local product.. haven't had much food but what I have had was ok... My focus is the beer... Not only do they brew great beer in house but they highlight other local brews and bring in amazing other craft from around the country.... 480g.. squirrel fire.. and street cred is my shit!!!!!!!!!!!!!!!!!!!!"}
{"text":"Loving this new try, have the meat candy it's all the rave for a reason. Burgers outstanding and the icing on my cake today was the Top Secret Battle Monkey wow super tasty with the perfect Hoppiness ! Loving the atmosphere vibe and the style portrayed in the guys adds the . In my I :) superb menu I wish I had room for the green chili Mac I would love to sample it but I'm full . Def coming back :)"}
{"text":"Being from New Mexico, I'm usually pretty skeptical when I see \"New Mexico green chile\" on a menu in Arizona. Usually, what is served is crap poblano chile that tastes nothing like real hatch valley chile. Naturally, we rolled our eyes and scoffed at the sight of \"New Mexico green\" on their menu, but the server talked us into giving it a shot. We were pleasantly surprised, because what we were served is actually New Mexico Hatch Valley green chile. I had the green chile Mac and cheese and highly recommend it. Service was great, beer was excellent, food was outstanding. Highly recommend."}
{"text":"A glorious brewery with some of the best beer I have had in the valley. Must try the meat candy!"}
{"text":"Great beer, food, and service!  Avid and passionate brewers having fun slinging their trade. Well worth stopping in!"}
{"text":"BRI is one of my favourite places to go to eat and drink a beer in Mesa. They have 16 beers on tap, the beer I had  was called morning sex, its a stout, it has good coffee, vanilla, and a  essence of has some chocolatey notes, and a little heavy. Very smooth and tasty.   The Appetiser we had was the Meat candy  delicious bacon with a Chipotle sauce and brown sugar made this bacon taste sweet salty and spicy, I loved it.   I had a SW cheesesteak . The description was it's so good it's silly. Delicious steak and cheese sautéed onions and the southwest twist it had was three different kinds of peppers Anaheim peppers were so good, and provolone cheese.it was extremely good."}
{"text":"How did I not know about this place sooner. My son and I were in for lunch. We started with two of their house brews. My son had the Street Cred black IPA and I went with the Lolli Belgian Blond. Both were great! We ordered the build your own burger (bacon and swiss) and the Cubano and shared. I had heard their burgers were great and this one didn't disappoint. Thick patty perfectly cooked on a soft Hawaiian roll. The Cubano was even better, exactly what I want in a cuban sandwich. We chased lunch down with a couple more brews. The food is all scratch made and their beers are on point. Can hardly wait to go back again!"}
{"text":"WORST service I have ever had at a brewery. Came on a Thursday night for the first time; the place was busy so we sat on the back patio. Took 10-15 minutes to get water. Had to go to the bar to order my first drink. No one checked on us. Took forever to get a second drink and food order. Mac n cheese was good but my fiancé ordered the carne Asada tacos with rice and beans and it looked nasty. Did not taste good. The only saving grace is the beer was good. I would give it a second chance only because I love beer. I NEVER submit reviews on Yelp but this service was so horrid I couldn't help but voice my opinion. I love local breweries and was excited about BRI but the experience was EXTREMELY poor. There was no sense of urgency and they didn't seem to care that customers were waiting and received terrible service. The owners should be ASHAMED that customers were given the service that we got."}
{"text":"Beer and food that are both very tasty! What more need I say? Only one complaint...,no lunch menu is served on weekends until 2? I wasn't looking for breakfast at noon on a Saturday, and pancakes and beer just did not do it for me.nice that they offer breakfast, but should maybe consider opening up lunch as well."}
{"text":"It's a cool place with great craft beers and the food is amazing! Not to mention the staff is great and they know their beers."}
{"text":"Beer is good tried 3 different ones nothing great just good.   They do have big list of beers to chose from.  I had the steak tacos they were pretty lame. It's was like a version of Mexican food at Denny's. Also tried the meat candy,  inedible. Covered in red pepper and siracha way too spicy and the bacon wasn't even crisp.  Service was good just slow.  Probably won't be back."}
{"text":"I honestly can't believe this was my first time here. I had the double IPA and the mange IPA which was phenomenal. I will be back in the future. Plus the playlist is great."}
{"text":"Best service!  So friendly and atmosphere is great!  Get anything with ranch.  They make it here and it is DELICIOUS!  They have dark IPAs so if you're on the hunt, look no further.    Definitely coming back for more!  Can't wait to try the SW Poutine!"}
{"text":"As usual when I try a new brewery I have never been to,  I had a flight of their own brews plus one guest tap.  All I had was good.  Decor is nice. One word of warning: the habanero wings are really, really HOT!!! Food challenge worthy."}
{"text":"Welp. The beer is good and the service is good, but I have had better food. We had the burrito, the green chile mac and cheese and the poutine. All the food was completely flavorless. There was a strange burnt flavor to the burrito I am supposing was chipotle? But it didn't taste of spice, just burnt and smoky.  The poutine had no gravy or queso fresco.  And the mac and cheese needed salt. In fact, everything needed salt. It was like eating food when you have a cold.  There was no taste to anything. My husband raised his eyebrow and asked if I felt the food was flavorless and I had to agree.    Overall, unimpressed. We will not be back."}
{"text":"Here today for their soft opening. Impressed by the one beer they made (with OSHO).    Didn't try any food, but will be back."}
{"text":"To celebrate my bday we did an East valley brewery tour. I called ahead and made reservations, and called the night of to say we were running about an hour behind schedule. For a moment on the phone it seemed like they weren't going to take us because of tartiness, which is absurd because there were two other tables seated when we arrived , otherwise the place was empty. We got there about 9pm. Kitchen closes at 930 and last call at 945. I work in food service and I know this is plenty of time to order a couple appetizers and a few flights of beer, which again I told them over the phone when I made the reservation that this was our plan. We we're extremely rushed and it felt very uncomfortable.   We ordered some beers to take home and asked our server to pick something for our DD to enjoy who was waiting in the van. THIS IS MY BIGGEST COMPLAINT! I wouldn't be leaving this review if just this part had gone well. We explained to our server that our friend mostly drinks lite beers like bud lite so something similar to that. We trusted his recommendation without being offered a taste, big mistake. He gave us sours.... Nothing close in taste to a lite beer. Incredibly disappointing.   They were also out of two of the beers we ordered for flights and instead of offering to replace it with something else they just left it out. Still paid full price tho!   TBH it was the worst stop of the night. We will not be coming back."}
{"text":"This is a great place with better than great beer and food. Beer is 5 stars, food is 4, and staff is over the top. Quaint, friendly, and soul filling.  Love the sweet meat!!! Cuban with green chili mac is one of our faves. Will definitely frequent this gastropub. Prices are good also!"}
{"text":"I've been here a handful of times for events and have had an amazing experience every time. First of all, #Taxationistheft.  The service. The wait staff is attentive. I think our waitress came by probably 10-12 times to check how we liked our beers, to make sure we had enough water, and if we wanted another beer. I didn't even have time to think that I wanted anything before they came by.   Beer and food. I love the beers and their unique names. I like the taxation is theft, the lolli, and the cactus beers. Honestly, I haven't tried a beer that I didn't like. I've only ever tried their one salad, which I liked as well.   Decor: The inside a bit small, but features about 2-3 long tables with lots of chairs, several booths, and seats at the bar. The outside also features several long tables, but does not have misters. It's comfortable at night time, but I don't think I would sit out there in the daytime durin summer.   I would definitely recommend!"}
{"text":"Meat candy! I finally got myself some meat candy! haha. Thanks to Cheryl B, I got to experience the BRI with 6-7 other people. The service here was fantastic, even with the size of our group, it was as if this restaurant had been here a long time (and I don't think it has...actually I don't know). I started with the made in house collaborazz raspberry beer, which was pretty delicious. I love when places brew their own beer, it doesn't get much better than that. For food, I had the burger with the fried egg and bacon on it, but subbed meat candy for the regular bacon (which they did for me at no cost!). It came with delightfully crunchy fries. This burger was large, juicy, spicy, sweet, and everything you could want from a burger. Was it on the pricy side? Yes. Was it worth it? Absolutely. I will be back!"}
{"text":"First time visit. Friend and I heard about the burgers, but we opted for the bbq pulled pork. Fries for my buddy and tots for me. Everything tasted great. And the waitress was very attentive and friendly. Will definitely return to try the burgers!"}
{"text":"I found this place on yelp and I'm always up for trying new breweries but ended up being disappointed.   For entrees I ordered the green chili Mac and cheese and added machata to it. Which is a shredded typed of beef. It was a bit spicy but good. My boyfriend ordered the carne asada tacos and these were extremely disappointing for $11. The two tacos were only a little bigger than mini tacos. It came with rice and beans that came in those sauce cups that you use to put your salsa in. That's it?   For beer I ordered their Christmas ale. It tasted really good in the beginning but I'm a slow drinker. After a while it got really flat and tasted really bitter. I was disappointed that they had such a small selection of beers for a brewery. The only plus for me was our waiter was very friendly and knowledgable of their beers."}
{"text":"My first visit to this place and there was some good & some bad. The restaurant itself was fine, nothing special about the ambiance or decor, pretty basic actually.  There are no TVs & no background music, which is fine, just thought it was worth mentioning.  The beer was quite good, I had the red BRI IPA, pretty solid.  My wife & I both ordered burgers, she was happy w/ hers, my Pub Burger was very overcooked.  I took a bite & waited for the server to come back by but he never did.  After a while I just decided to eat the overdone burger.  The flavors were actually good but it was difficult to enjoy being that well done.    Our server never came back to ask how the food was or if we needed anything else. After we finished we had to ask another server for our check & at no point was there a simple 'how was everything'.  I didn't really care at that point I just wanted to let him know about my burger.  Our server was actually very nice when he was around, I just think the place was understaffed.    Overall we had poor service and poor cooking.  The beer was good, the burger had good taste so I think there is potential.  I was really hoping for a 5 star experience, the issues we had are easily correctable so if there is a next time, hopefully it's a better time."}
{"text":"This place is awesome. Service is always friendly and efficient. Knowledgeable staff, great beers. Ask for Jarrod, he's the bomb.com."}
{"text":"Another East Valley Brewery? Yep, the more the merrier!   Have been to BRI 3 times now, and this is probably the start of a serious trend. I love the decor when you walk in, the flask lights and the cool science themed wall hangings plus the flights are served in little beakers, very cute. For a first effort on a new system I think these guys are off to a great start. I like the Street Cred and then I tried the 480G and its a fantastic example of a West Coast IPA. The Belgians aren't my favorite but like i said, great start for these guys.   The guest taps are great and really reasonably priced. They really have a great variety too - even the ciders for those that like the sweet stuff. The food menu is nice, I had an issue with my order the first time I was there and they quickly fixed it for me and made sure i was happy - gotta love the customer service! All the bartenders have been super helpful and friendly and the atmosphere is really nice - communal tables and no TVs - forced us to actually talk to eachother!   Give BRI a shot, you won't be disappointed. :)"}
{"text":"BRI has a wonderful beer selection. The top secret battle money was our favorite. They offer growlers for some of their brews. We took home the 480g and my husband loved it.   They also carry a small selection of alcohol and mixers for those who aren't beer drinkers.  The food was good. I had the green chili mac n cheese with machaca meat.  It was excellent.  I would definately try it again.  My husband had the carne asada tacos and my son had a burger. Both were good. The restaurant is smaller than I thought it would be.  The service was good. We went early and it was not that busy, however,  it was really starting to fill up when we left."}
{"text":"Have been going to this place pretty frequently. It's nice having a brewery near by. My favorite beer by far is Dirty Jesus, the server said something about money getting donated to a friend that had passed for every beer that is ordered; which is awesome of them.   The food is pretty amazing. Although I can't get myself to order anything but the Spanglish. It's so freakin delicious. I highly recommend this place."}
{"text":"This place is awful on the hostess and no consideration when busy.  Expect long hour waits, don't believe the hype.  Will never eat or drink at this place."}
{"text":"This is the first time that we have been to BRI since they expanded their restaurant and their production capacity.  It appears that BRI has hopped on the IPA train as the variety of IPAs increased significantly and the number of ales and stouts have dwindled.  This is great for people who like IPAs, but not great for people like me, who don't.  I tried a sample of the MikeWho? Hard cider and found it too sour.  My husband and I chose Sixdudesandadonut beer, which is a stout beer with chocolate raspberry donuts mixed into the mash(?).  I found it too sweet with a funny taste.  Their nacho appetizers were really bland and needed real cheese.  Whatever alternative they used made the chips soggy. I did like their mango peach chicken salad as a light alternative to their burgers.  My husband enjoyed his cowboy burger.  The atmosphere is still good and the service is excellent.  Unfortunately, the main reason we have come in the past  was for the variety of beer types and that is no longer the case."}
{"text":"All beers are brewed in house and they're amazing! The  Secret Battle Monkey double IPA is one of the smoothest IPA'S I've ever had. Good munchy food too. I'll definitely be back"}
{"text":"Great atmosphere, food, beer, kid friendly And amazing prices all day on Sunday. Yummy Mac and cheese!!!! We will be back"}
{"text":"Sometimes the Dogg tries something new and it don't work out so I don't post.  Cause I ain't a hater and maybe it was a off day on the place and maybe I was off.  So you haven't heard from the Dogg for awhile.  But hold on to your hats folks...............the D has found Beer n Eats Nirvana (RIP Kurt).  Craft Brews they make on site!!! All food home made.  Had the wings!!!! All I can say is holy cow batman.......I believe in wings again. These people make all of their sauces??? WTF?  Ya, 5 sauces my friend.  If you have a very diverse palate try all of them.  Oh yeah and definitely try their ranch......sons and daughters I don't wax eloquently about ranch......but if you like a lil bite in your ranch, their ranch is the bomb.  Ok now beer...:......mango IPA GET IT, not too sweet awesome flavor. They offer a hell of a lot craft beers. I cant figure which is best but I will tell you they got something for everyone.  And my liquor friends they offer real drinks from local distilleries in this state.  So get off your beautiful buns and get into the Institute and get your medicine.....you will thank the Dogg."}
{"text":"I first read about BRI on Yelp. I was intrigued by their motto. \"Doing beer research one pint at a time.\" This turned out to be not entirely true since they have a sampler 4 pack so you can find the beer on their menu that you like. Personally I really liked the Citrana out of Tucson which is described as a wild sour ale.  The bartender, Jesse, asked what type of beers I liked when I first sat down. I wasn't helpful in telling her much but she picked 4 distinct types to give me a good choice for a second beer.   I also tried the Silly Cheese Steak. The menu claims it is \"silly good\". It was excellent as were the crispy fries that accompanied it. The steak was thinly sliced and there were crisp peppers and melted provolone cheese covering the steak. The roll was soft and tasty though I would prefer a crusty roll.   The only problem I had was finding the place. It is near the AMC theaters on Stapley. But I was expecting a stand alone building like the chain restaurants in that plaza. It is in the plaza building near the Starbucks. It was definitely worth looking for.  I recommend you conduct your own research and remember to reward good service with a good tip."}
{"text":"There selection of house beers is nice, my boyfriend and I love IPAs which theirs are not to bad.  Some are better then others. Our first time here was after the kitchen was closed. our most recent visit we came specifically for dinner and are leaving disappointed. We had the poutine for an appetizer which we just warm, very bland, and needed salt. I ordered the burrito and thought it came with guacamole.  I even asked to make sure it came with guac but no guac inside and I didn't even get my side of sour cream like it says on the menu. The red chile sauce was subpar again, needed salt and was barley warm. I'm not really sure what was up with the amount of cucumbers that were very large diced that were in my burrito, I would be ok with some but they made up 50% of my burrito . I was disappointed and prob won't eat there again."}
{"text":"I just love this place!  I have never had bad beer, or food or service.  Everyone is welcoming, friendly!!  My only complaint is it's not closer to home!! Highly recommend."}
{"text":"I would have given them 5 stars until...   I experienced an unload of 7 messages via email notification from the app Untappd after rating their beers. I rated them anywhere from 0.5-5/5 stars for a few of their beers.   This is just two of the examples of the comments posted on the app (all but one have been deleted):  \"You either dont know how this app works and how it affects small, independent business owners or...youre a cunt. Not sure on which of those\"  -The Beer Research Institute  \"two camps you fit into but....Jesus fucking Christ! Thanks for trying our beer...I guess???\" -The Beer Research Institute   I actually recommended this business yesterday before I received these messages today.   I hope that the owner knows what they are advertising. It's extremely unfortunate that those who were great to us while we were there have to be associated with working for a company who would allow something like this to be sent out to one of their patrons.   Sincerely,  It's not my beer ratings that will kill your business.   These are screenshots of the email notifications."}
{"text":"\"In a study, scientists report that drinking beer can be good for the liver. I'm sorry, did I say 'scientists'? I meant Irish people.\" ? Tina Fey  Even though the ginger is out of my hair, you gotta respect a good quote and love the Irish.  Anywho, I came here a bit wary after seeing cutie Susan P.'s review.  I heeded her advice and skipped the tacos since I was famished and could eat a small buffalo by myself.  Ain't nobody got time for tiny food!  A few steps and a hop onto a bar stool [I'm short, okay?], I was ready to eat and get my drank on!  It was a busy Friday night and we came during the dinner rush.  Although it was a noisy and packed house, Brandon/Brendon [sorry, I couldn't hear properly since it was so loud] took care of us amazingly.  He was a saint surrounded by demanding drunks and annoying tourists and never did he let a glass go empty.  I ordered a Julian Cherry Bomb and boy was that a mistake.  It was all on me and not the bartender's fault at all.  I really should have asked for a sample.  It ended up tasting like tart cherry pie filling which might appeal to some but I'm not much of a fruity-pie type.  It took a while but I got it down.  Also to be consumed was a B.R.I War Paint IPA and a B.R.I. Street Cred American.  Both were a million times better, sorry California, and was full of hoppy-goodness.  To be eaten and shared was a huge plate of SW Poutine, Green Chile Mac & Cheese with carnitas, and the Spanglish.  The SW Poutine was amazing.  It was full of all that rich, fatty, salty goodness you crave while knocking back some brews and it helped prevent me from getting sick off that Cherry Bomb.  Anthony Bourdain would approve of this dish.  And as fast as that Cherry Bomb was coursing through me, the house fries with that beef gravy, machaca, pico de gallo, and queso fresco helped settle my stomach.  The Green Chile Mac & Cheese with carnitas was ordered based off what Susan said.  She said it was spicy and hey, I was feeling spicy myself!  It was so cheesy and rich and oh my goodness, I couldn't stop myself from stabbing into macaroni after macaroni.  It didn't taste all that spicy to me though so I topped it with some Arizona Gunslinger and it was perfection.  Mmm!  Next to be shared was the Spanglish.  Spanglish... Meat candy (candied bacon with Sriracha), an over easy egg, provolone, tomato, lettuce, and chipotle mayo on Hawaiian sweet bread.  How can that not sound boss?  The co-diner said it was too spicy but I thought it was perfect.  I would have topped that with some Arizona Gunslinger too but I didn't want to make the companion feel like a wimp... that wimp.  ;)  Anyways, it was a great Friday dinner and I'll be back for more!  Since we were seated at the bar, may I suggest adding to the back wall?  It needs some color or texture... some kind of visual interest!  Also, a really swole guy to throw out drunk men hitting on girls would probably do everyone some good.  To many more successful days, nights, years, and decades to The Beer Research Institute!"}
{"text":"The start was a little rough. They need to be able to come up with a seating order. There was some confusion and some people that showed up after us got seated before us. Once we got seated (at the bar) my wife and I were amazed at how personable the bartenders were. Great selection of beer and food, I suggest trying the Meat Candy. I would also recommend trying this place at least once then go from there."}
{"text":"I don't understand why I haven't heard about this place.  Found a place close to my east valley family and we had a blast here.  Food was great and beer is better!"}
{"text":"Food and beer is good but not spectacular. A little pricey for what you get but still a good spot. Impressed by the sour beer options. The west collaboration inside job was the best."}
{"text":"We had the southwest poutine for an appetizer, it was great. We both had the pub burger, so juice it was running down my arm. Everything was awesome!! We strongly recommend trying for yourself."}
{"text":"Local craft beer at its peak right here.  These folks know how to do it right.  Enjoyed my sampler of beers in little chemistry beakers, then opted for the Batch #1 which I thought was best.  I was treated to very attentive and friendly service, reasonable prices, and an overall neighborhood sort of feel that I found most attractive.  This is my new favorite local brewpub."}
{"text":"Didn't care much for the patrons on our first visit. But, the beer and the bartender/brewer brought us back. Haven't tried the food as of yet, but will update when I do. I feel that, with a name like BRI, it's worth reviewing the beer and service, and if the food is good, which it sounds like it probably is, that is just a bonus!  I love the Morning Sex! Yep, just said that. It is a very smooth coffee tilted beer with local ingredients. Just plain yum. I also liked the Street Cred, which was a rather hoppy dark ale. I wouldn't choose that one every day, but it was good in a sampler. I had the Loli, which was their blond, and then some fruit flavored Loli, but I really wasn't a fan of either. We tasted a decent saison (don't remember the name), and also a sour. Both were solid. The bartender/brewer was very cool and professional.   It's a long haul out there, but I will definitely go back to BRI for more beers, maybe trivia, and to try the food."}
{"text":"Great service, beer and food! I only wish it was closer to my part of town. But whenever I'm in this part of the valley, I'll definitely come back. Mac and cheese with green chiles is perfect. Silly (really...not a typo) cheesesteak was lean and yummy. Red IPA rocked. Great fries too."}
{"text":"{Update follows) The food was acceptable and the beer was good, but nothing really special I'm sorry to say other than our waiter was outstanding.  He was knowledgeable, friendly and attentive.  I would recommend going here based on his service alone.  Sadly my sandwich was nothing to write home about which is a shame because this place has a incredible amount of potential.  But with Arizona Wilderness, Four Peaks,  and San Tan not all that far away they really need to step up their game if they want to compete.  This place could be a standout elsewhere but they are just not up to the competition in the Phoenix valley.  I do hope that they can improve and get to a level to compete with other offerings in the area.  They were good enough that I'll give them another shot and I will post another review when I do. Update:  After I posted this review I found out that the friend I had dined here with experienced some rather unpleasant gastrointestinal problems.  I cannot say if it was related for sure or not but he certainly believes it was.  This, combined with the recent report that they received a failing D grade on their most recent inspection is why I have dropped the rating.  Unless there is some real improvement I can not recommend going here."}
{"text":"Beer Stop 143 -----  I came here after getting a recommendation from Angels Trumpet. I didn't actually realize how big Phoenix area was, until the Uber was $40 bucks!  Oh well, Beer Research Institute was worth the trek.  Let me just say this, if you love IPA's, COME HERE! B.R.I. crafts several different styles of IPA - from Belgian to Single Hopped to Black to Fruit IPA. I had a taster flight of each and was very impressed with them all. The standout was the Belgian IPA , usually I'm not a fan of the yeast/hop balance in a Belgian IPA but B.R.I's version was a bit more hop forward then typical. Nice!  You need to come here, especially if you love IPA's!"}
{"text":"Really good beer on a hot summer day in a nicely air-conditioned spot - oh yes. Every beer we sampled was good, not too hoppy, and just the way we like it. Friendly, efficient customer service, and great sweet potato fries too!! We'll be back."}
{"text":"Yelp friend Cheryl B introduced me to this place and I have to say I am a fan. I love the fact that they brew their own beer so there is always something new to try but they also have some of the most popular craft brews on tap as well. As for the food, of course the tasty sriracha cadied bacon is fantastic as well as their pretzel bites. However, I recent discovered that they can make a pretty decent salad as well."}
{"text":"There's such great reviews on this place. However I was so not impressed by their menu or beer selection. The decor is awful. A friend and I went here on a week night it was slow service was mediocre. Not impressed whatsoever I have no idea why people go here."}
{"text":"I like this place,  it has theirs own unique style.  I feel like it was just a room where they brewed beer but then it become a bar. The decoration I don't think it's complete or who knows maybe that's the style. It's cool though, I loved the shot classes and the lamps at the bar they are from like the chemistry lab. The location is a little hiding.  The service is good the waitress are helpful and nice.  Sometimes I get shy when I have to ask for more test samples but they gave me a few more beers to try with out even asking. About the food,  we got the  poutine as an appetizer and it  was  amazing.  I got the green chile mac & cheese and it was ok,  not that impressive.    Overall,  good place I  definitely recommend it.  I'm sure I'll be back there."}
{"text":"Visited for beer only, so I cannot provide a review on food. (We ate at Az Wilderness a few miles away) We visited mid-day on a Friday and went for a flight in order to try the IPAs. The staff was friendly, there were several people inside eating and the food looked good. Would give a 3.5 star, if I could. The strip mall location didn't do much for ambiance."}
{"text":"Very nice place, casual atmosphere, very crowded around 8:00pm. I don't think this place is \"divey\", only two months old, very clean and new. I got a flight, you can pick your own beer for the flight, kind of surprising. The waitress brought me my flight and told me what was on it and what order, but i think she got it wrong. I ordered a beer I liked from the flight, but got a beer that tasted different. Ordered some not-chos (nachos) from the menu, really good. I will come back and try more food. Overall I like the place and plan on coming back. Crowd is kind of hipsterish, lots of beards. It would be kool if the bartenders wore lab coats and safety glasses, just a suggestion :) good music too, I heard Bad Religion, Social Distortion, and No Doubt, Green Day, The Ramones, and AFI."}
{"text":"Treated rudely. Asked if they had any beers that were lower in abv than 6 or 7% and were told you don 't drink much beer do you? We left"}
{"text":"WoW WoW Wow!!!!!!! Yummy Beer, juciy wings, clean, great service, and the food (holy cow) the food is out of this world good!!!!"}
{"text":"The food is awesome! The mac and cheese wity candied  meat is spicy and definitely had me sweating but was amazing!  Beer was great. Darkest ipa I have had and didn't hesitate drinking it! Our server was Elizabeth and was super friendly and nice! Prices are what you'd expect for great food and a good atmosphere."}
