{"text":"In my opinion, The Gyro Place makes the best Gyro in Southwest PA. The seasonings they use on the meat is delicious. They typically offer a Buy 3 Get 1 Free offer, which is great for a hungry family."}
{"text":"Stopped here at about 3 pm on a Friday on the way back to St. Clairsville from Pittsburgh. Only one other person in the place. VERY friendly woman behind the counter, and the owner was cooking...nice guy, chatted it up with my husband.  I ordered the 1/2 lb gyro combo, and my husband got the \"Super\" combo, which is a whole pound of gyro meat on a pita! The pita bread was wonderful; very soft and fresh. Delicious meat, which I believe was a lamb mixture, didn't ask. Fresh salad and tzaziki sauce on top! Fries were meh, kinda tasted like the oil needed to be changed. Fries are kindof a big deal to me, so that's the only reason I don't give 5 stars!  We ate ALL OF IT, which was totally uncalled for, lol.   Nice little place in a shopping center. Clean bathrooms. Good gyros!"}
{"text":"The owners of this place are absolutely wonderful people enjoy talking with them they have some of the best Greek food around they cater to your personal needs cute little place inside very home like. A lot of different choices for their menu and got to say even though the Greek food is marvelous their burger is to die for."}
{"text":"Excellent and authentic!!It's all great Greek to me!  You gotta taste for yourself. Very friendly and engaging proprietor.  Cares about his customers and likes to see them satisfied.  Not enough places and owners like this left out here."}
{"text":"Awesome find. Owner is very nice. Food is epic tasty and a super gyro is so big you need a fork and knife to eat it."}
{"text":"Killah Gyros.  Small place.   Service is home -spun and a little slow.  I hope this is enough for Yelp to consider this a review. Jeeez."}
{"text":"Great food, even better people.  Recently moved back to the area and am always up to try my fav sandwich, the gyro. To my surprise, I stumbled upon one of the best that I've ever had.   Since becoming a regular, Peter convinced me to try the gyro salad as well which I will put into my lunch rotation. Seriously, I eat here at least once a week. You should really give it a try."}
{"text":"Man this joint is good I had a half of a Gyro I almost stuck my foot in my mouth and order the super gyro but I didn't because that half of one was big enough to satisfy my big greedy ass wow"}
{"text":"Delicious, authentic gyros!! It's definitely a hole in a wall, but you know those are the best places!!"}
{"text":"Doesn't disappoint. This place usually has good deals (like buy 4 get 1 free). Solid and must try if you're in the area and want gyros"}
{"text":"Summary: Hole-in-the-wall with good Greek food.   The Goods: - The food is tasty and the portions large (Everything I've eaten I wish I had split, and I am a bigger-than-average eater). - The small business, family attitude. - Gyros. - Salads.  The Bads: - The place is a hole in the wall. Not in a nostalgic, inviting way, but in a 1970's Arby's cast-off furniture way. - Seating is limited. If there are any more than 4 in your group, foreddaboutit.  - Seating at most booths is fixed to the table. At 1960 waistline distances. So if you are part of the 30% fatty epidemic, expect to wipe, no scrub, the table's edge with your shirt. - Sometimes the food delivery can take a bit longer than desired, especially if there's a lunch crowd (like 3 or 4 people in front of you). - A little pricy for a single meal. But the quantity is adequate to feed 2. (On that basis, it's a bargain!)  The Uglies: - If you are blind, you may end up ordering lunch at the insurance office next door. The main door goes into an anteroom, with two doors off that. Just guess and walk I  Bottom line: Go for the food, take your patience."}
{"text":"Excellent food with great prices don't be deceived by its appearance. Service was fast and very friendly. The only gyro you need a fork to eat with or a roll of paper towels"}
{"text":"Fresh and delicious Gyro near Southpointe area in Canonsburg. I would recommend you the regular Gyro combo and the meat was not dry at all. Personally for me it was bit salty but with pita it goes well."}
{"text":"Went there last night with my wife. Husband and wife team very nice , the food was amazing. After speaking with Kim for a while it was almost like we were meant to eat there. Great prices , great food and great owners  , you will not leave this place hungry."}
