{"text":"Monday night- 2$ off burgers and 1$ off imports 
Tuesday- 40 cent jumbo wings 20 ounce draft for 2 bucks labatt
Wednesday- ladies night 3$ and under drinks and $5.95 home made spaghetti dinner
Thursday- $1.25 beef and chicken tacos and 2$mexican beers
Friday-seafood specials a dozen mussels for $2.50
Sat- $9.99 strip steak dinner 1$ shot specials
Sunday funday- buck a bone home.made.ribs 3$ vodka bombs
Pretty fun place"}
{"text":"Went to the rib last night and was so disappointed. The bartender was rude, unprofessional,  and clearly intoxicated. She greeted us with \"whatta you guys want\"? We were given the wrong drink and the food was not what it used to be there. The rib is normally a good place, hopefully this was just a bad night."}
{"text":"This place...is wonderful.  A) Ping Pong.  B) HUGE BEERS C) HUGE BEERS FOR A MAX OF $3, usually cheaper.  D) FOOD SPECIALS!

This place is clean and comfortable, ie there is room.  You will get service.  Your beer will be refilled.  You will breathe easy.

Food is pretty good.  Tacos are my favorite, and the soups are good.  Food specials every day...which I'm posting because that is all I care about...

MON $2 off burgers
TUE 35 cent wings
WED $4.95 spaghetti dinner
THU $1.25 tacos
FRI $2.50 dozen mussels
SAT $9.99 strip steak dinner
SUN buck-a-bone ribs"}
{"text":"Great food specials with something different every night. Try the great burgers (Mondays), wings (Tuesdays), and the $9.99 12 oz steak (Saturdays)."}
{"text":"I have been a customer for well over a year. I ordered wings extra crispy while my friend ordered a patty melt.
Wings came out and they were dangerously under cooked but the best was my friends patty melt. It was served without a burger. How do you serve a burger without a burger? 
I sent the wings back and refused more food. My friend did get a burger but it was served on the old cold bread. I'm done"}
{"text":"The food is always good.
When Mo is in the kitchen, it's great. I have no idea if he still works there, it's been a while.

Wings, ribs, burgers, even their pound of pasta special. All good. 
The mozzarella sticks are great. They seem house made? 
Tacos on Thursdays are fantastic.

Staff is, for the most part, great. 
Had one server who was outside smoking and started accusing a guy of stealing stuff while throwing out some disgusting racial slurs.  As if that wasn't bad enough, she then saw a guy who was watching ants devour some garbage and decided to kick him while he was kneeling into the ants. It was a weird five minutes. 
But I haven't seen her working the bar since, so maybe she took her bullying tendencies elsewhere. 
Everyone else I've seen there has been great. 

Soda game isn't that good, but this isn't really a soda bar."}
{"text":"Ballin on a budget. Got a full steak dinner, beer, and Jameson for under $20. It's unheard of. I'm satisfied. Food is above average."}
{"text":"Fun place to hang, they have alot to do. Pool tables, corn hole inside, darts. The food is good the wings are massive! I ordered the nachos and it was enough to feed 4 people! Whenever i get a chance to hang out i like to stop in here."}
{"text":"Service was good as was the food. Servings were large and well prepared. Will definitely go back."}
{"text":"I came here for wing night and it was great.  The wings could stand to be a little more crispy, but I was still happy with the flavor and options.  40 cent wings is a damn good deal.  The bartenders and regulars were all cool, the jukebox was playing metal music, they have ripoff tickets, I played some ping pong!, and they have a pool table.  It's a good time all around.  The prices weren't crazy and I felt very welcomed.  This is a solid neighborhood bar for the area!"}
{"text":"Imagine: bugs flying everywhere. Sticky stools covered in old beer. Upon arrival you are usually greeted by a grumpy man with a baseball cap smoking cigarettes. Tonight a small group of friends came in. The first bartender was pretty sweet until the other barmaid started talking to her and that's when the service started to take a turn. We went to the pool table with 3/5 of us drinking. As soon as we got situated the bartender alerted us that we all had to be eating or drinking otherwise we had to leave. Totally understandable but the approach was unprofessional. We were one of the only customers in the bar and they knew at the time we were going straight to the tables so why not tell us right away? Very unwelcoming and passive aggressive. So we tried to finish and move on quickly, we all work in the customer service industry so the last thing we wanted to be was a burden. The \"bouncer/owner\" was staring at us through the window and he came in to glare. I tried to greet him and he completely ignored me and continued to watch us uncomfortably. We all got out of there ASAP and it used to be one of my favorite Lakewood bars despite it's boring and dreary atmosphere. Do yourself a favor and go to the Richland and Iggy's instead, great service and great prices! So long Flying Rib! I hope you can return to the way it was before... Until then peace baby!"}
{"text":"I had a great experience here, the value here can't be beat. I wanted to play some ping pong so I asked about their beer pricing. \"Everything is below $3.\" I was half expecting the beers to come back on the bill as $3.25 or something like that but either way, I was fine. I first asked for the Platform draft which the bartender told me she thought it had possibly gone bad. Uhhh, that's weird, but I guess if it did, thanks for the warning. I ordered Sam Adams Cold Snap which was really good and it actually was under $3 - $2.75 for a 20oz, not a pint. And she made sure it was full to the brim. They held my ID and credit card as collateral for the paddles and ball (the paddles look pretty beat up but work fine). 

The pool table is right by the window, and in the same room are two small pool tables and two cornhole boards. In the backroom there's darts as well.

The ping pong table is much better than the paddle, a very good table actually, and there's just barely enough room to play. Why are there no coat/purse hangers anywhere? But you can just grab a stool anywhere in the bar area and place your stuff on it. We played some decently intense ping pong. Quite a few times the ball flew over by the pool tables or cornhole and the other clients were nice about it and grabbed it for us.

The pool tables are small but they're in good condition and well lit. $1 per game, quarters, and there's a newish looking change machine right there. The sticks are just randomly around the bar, no idea why they don't have a stick rack. Iggy's tables are better, but unless you're drinking Miller, the beer at Iggy's is way more expensive, probably due to the lack of food.

Overall, you can get the two drink minimum for two people (to play ping pong), 80 oz of craft beer (a typical 6 pack is 72 oz for comparison), for $11 + tax and tip. Add $2-3 for a few games of pool and since ping pong/darts/corn hole doesn't cost any extra, you can be out the door for $16-17 for hours of fun for two. It's a great neighborhood spot. I teetered between four and five, but went with five in the end because I feel this place is a bit underrated here."}
{"text":"Worst service I've ever experienced and I am a server so I like to think I have more patience for there shortcomings . 
Was made to feel like I was \"causing problems \" for asking to speak to management . And then was refused service . I could write four pages of things that went wrong"}
{"text":"The rib is a great place to play pool or corn hole when the weather is nice outside.  The bartenders are rude and inattentive. Last time I was there I spent $5 on the juke box and the bartender decided she didn't like my songs so she skipped them all.  I would go back for pool but don't expect any kind of good service."}
{"text":"Dive bar atmosphere. Cheap beer. Cheap, delicious fried food that is appropriately priced. We got the chicken tenders and at $6 they were delicious and filling. I'm not giving 5-stars because I reserve that for my \"omg I can't wait to go back there,\" type joints -- I'm not clamoring to get back ASAP but would have no reservations going back -- but if you keep your expectations realistic for what this place is it's a 5-star in its own right."}
{"text":"I will always recommend a place where you can get drunk on good beers extremely cheap. Two bucks for a 20oz. Yuengling Black & Tan!! I also saw Shiner Bock on tap but that's just a bit too much for little ole me to handle. I remember the other nightly specials looking awesome, but all that Yuengling made me a little fuzzy. The food looked good too! I stole a bit of my friend's fried food, the fried zucchini was delicious and made me feel like I was getting the \"healthier\" end of the stick. 

The regulars are really, really friendly. Like, a bit overly friendly. But otherwise, a fun time!"}
{"text":"Ohio City has The Flying Fig. Lakewood has The Flying Rib. The food prices here will not make you go broke and it is a gamer's paradise. They have pool tables, darts and a punching machine. My friends were playing the punching machine game and whoever had the weakest blow had to buy a round. One of them tallied up a hit that read \"666\". The mark of the beast scared everyone out of the bar and we crawled down Madison to a safer place."}
{"text":"Another Lakewood dive bar with really friendly service. You feel \"at home\" right away. Our bartender was a total sweetheart, and the cook was a real gem as well. I miss this type of interaction in L.A. 

Cheap drinks and ridiculously fattening CLE style bar food. I watched an unusually large lady plow through a plate of potato skins just before washing them down with some chili fries. I'm not too sure how I feel about that still... I guess that she was really hungry. 

Decent wings. Nothing special... they hit the spot!

I think that the jukebox was the only expensive thing in the place."}
