{"text":"Tried this cafe on the recommendation of others on yelp. The food was good, but I would call this a $$ restaurant. Not that great of a value. I had the chicken burger sandwich and my husband had a roast beef sandwich. They were good, but a bit pricy as you might imagine for a museum cafe."}
{"text":"I've lived in PIttsburgh most of my life and have gone to the Carnegie zillions of times. I had never been to this cafe though. When you go in on of the entrances of the Museum of Art it will be in front of the large glass window facing Forbes Ave and the fountain. You can pick up sandwiches and cold foods from the cases or order hot food at the register. Their menu very pretty diverse so its good for all ages. Its cafeteria style unless you order hot. If you order hot food they bring it to the table. Meals are under $10.  My favorite item is their salmon cake with asparagus and wild rice. It was amazing! The best I ever had."}
{"text":"The Cafe has recently re-opened after being remodeled. They have replaced the cafeteria style grill with a sit-down restaurant. This is the first restaurant review I have ever done. I felt compelled to do so because this was such a horrible eating experience. The atmosphere was quite nice and the service was fine but the food was grossly (pun intended) overpriced but wouldn't have been good at any price.   I took my family of 4 there after a day at the museum. All of us were equally disappointed. The daily special was banana pancakes. In order to 'elevate' it they mixed the butter with thyme. Both of the boys, who do NOT have discriminating palates, commented, \"How can you screw up pancakes\". Per their words, \"I had to choke it down.\" I ordered a vegetable pot pie that was so small I could have finished it in a couple of bites. Instead I had to pick through the slimy sauce to get to the vegetables which tasted like they came from a can. The highlight was my wife's salad which was nothing special but was at least 'fine'.   I understand the inflated prices that come with visiting a place like the museum but for $70 I expected better.  For $5 I would have expected better. The old grille was very good and much more reasonably priced.  I would frequently meet people there for lunch even if I wasn't at the museum. Not anymore. Take the 5 minutes and walk over to Craig Street to eat."}
{"text":"The Carnegie Museum is a world-class museum with a third-world café. Hopefully they are managing the exhibits better than their cafe which used to be fabulous until they outsourced it to some low-brow food service conglomerate. Their Caesar salad was iceberg lettuce with rancid salmon that was so fishy I couldn't touch it. The sandwich had veggies that were near spoiling. The coffee was skunky. The soup was straight from a plastic bag and very oily. I have been to so many museum cafes around the world where the food was a work of art in flavor and presentation. This is not one of them. Eat on Craig Street. Enjoy the museum but let them know how much their restaurant falls short."}
{"text":"I had the pleasure of having lunch with a friend at this renovated space. I loved the changes made and the modernness of the update. We had a tour in the morning and wanted a quick bite to eat. I ordered a zucchini panini with shoe string fries and a glass of lemonade. Our orders arrived within a reasonable amount of time. I enjoyed everything and thought the entree and drinks were reasonably priced."}
{"text":"The boy and I were visiting his brother and sister-in-law who have recently moved to Pittsburg.  During our day-long visit to the Carnegie Museums, we decided to stop and have lunch here rather than wander the city looking for food.    The boy had the steak sandwich, which he said was a little greasy, but yummy.  I had the petite salad and mushroom soup; it came with a cute little bread bun.  The salad was prettily presented, but the carrot curlicues were very challenging to eat gracefully.  The soup was very good, and the combo only cost $5!  We sat by the window, which presented a nice view of the fountain and the street."}
{"text":"Five of us had lunch recently, with the brunch menu. Five of us had completely different entrees - except for the superb celery soup as an appetizer, which a few of us had. Five of us passed around our entrees to see what the others thought of the dish, and the taste of it. Five of us agreed the menu is too odd, with too many ingredients that no one knows what they are, and the dishes simply didn't taste good. The ONLY thing we all agreed was good was a shrimp roll... though quite skimpy... we think it was 4 shrimp for $16.00???   It's trying to hard to be unusual.... For museum fare, I'll stick with Phipps or the Frick.  The service was impeccable, really a fantastic staff. The setting is great, but very cold... dress warm in the winter. It's also quite pricey for the quality. They need to come up with a better menu."}
{"text":"Beautiful decor, but service was underwhelming and croque madame drowned in cheese. Coffee was average. There are better places around for the money."}
{"text":"I love this place. It's not your normal cafe.For me, I thought the prices were low considering the type of food that was being served. They're not serving dive bar food, the food menu is more upscale. But the prices are on the lower side in my opinion. The quality of the food is excellent.   I'm not sure why people are saying the prices are expensive. Go to a chain cafe and ask how much for a coffee! yea, ouch!   When i'm back in the area... i will certainly come back!"}
{"text":"I thought the service was great. Our waiter was very attentive. Food was just amazing! We had brunch menu on Saturday. French toast was the best! This place is a gem. I loved that we could be seated outside next to the fountain and enjoy the view."}
{"text":"Our table was divided on whether to write a good review, lest others find out about this place and it gets crowded.....but ok here you go.  The Carnegie has finally gotten rid of the cafeteria style restaurant and classed it up a bit.  We went in for brunch and it was FANTASTIC.  Yes, they have brunch cocktails.  A lot of them.  And they're good.  The food was also excellent - the french toast with brie and lemon compote was delicious.  If you're looking for a traditional sausage and eggs style breakfast, this isn't the place to come - but if you wanna be a little fancy, this is the place.  Made reservations, but they weren't needed....we were the first ones there at 10:30 and it never really filled up.  But we'll be back!"}
{"text":"We had a good meal at Cafe Carnegie, but I feel there is room for improvement. The cheese plate was a bit puzzling, although the Pirate Blue is outstanding, I'm not sure why the Feta cheese was included.  The Eggplant Parmesan was really excellent, I would definitely order this again. The Burrata with heirloom tomatoes was excellent.   The service could be improved, for example, our server did not know much of anything about the cheese plate.  I'm a huge fan of Sonja Finn, and she has brought things to a much higher level, perhaps she will bring more changes for the better."}
{"text":"The cafe has been upgraded since I was last in the museum! I attended an evening event there and also stopped in for a coffee meeting mid-morning one day recently. The space is beautiful and the barista was very friendly! I went with tea - they had a very good selection - and the space is perfect for a meeting with 1 or many people.   The evening event allowed me to taste a few different options from the menu. My sister loved the oysters (not something I'll try) - she said everyone should experience them! With a great selection on the menu, I'm excited to stop back in and see what else is good!"}
{"text":"You'd be hard pressed to find a classier venue for lunch in the Oakland area than the Carnegie Cafe!  Located in the front entrance of the Carnegie Museum of Art the cafe overlooks the fountain and, well, Forbes Avenue.  But it's serene and lovely and you feel just a little fancy here.  Except that the service is cafeteria style.  So you order, grab a tray, and go do the line and pay at the end.  Oh, and you pick up an empty cup and get yourself a soda.  Kinda takes away from the ambiance.    Nice lunch options and the prices are reasonable.  I had a half sandwich (ham, brie, on a cute little biscuit) and a bowl of soup (asparagus) and a drink (iced tea) and I think it came to about $11.  While you order and pay in a cafeteria style environment, the food is cooked to order and then served to your table by wait staff.  I'm not going to dine here everyday for lunch because I'm just not that fancy and there are so many options for lunch in Oakland.  However, I will come here frequently and sit and watch the fountains and enjoy the environment."}
{"text":"I was so excited when my friend who was visiting from NYC suggested the cafe Carnegie! I had heard about the remodel and was dying to try it. I have to say from the moment I walked in I knew I was going to enjoy our lunch. I love museums and always appreciate a good museum cafeteria! Calling this a cafeteria though is of course not fair. It's much more than that! It's a wonderful dining experience. I didn't spend much time looking at the menu because as soon as I saw savory crepes I knew I nothing else on the menu could beat it! And I'm so glad I got them. They were excellent. The blend of chicken, mushrooms, peas and to die for sauce has me still thinking about them days later! I loved my cold brew coffee and the uniforms for the wait staff! I know I will be back!"}
{"text":"This is a nice place for lunch, but mainly because of the museum ambience.  It is basically a cafeteria.  You point and order and they bring it to your table.  Selections are tasty but limited. Prices are reasonable .  Fora day at the museum I would opt for a Craig Street stop first."}
{"text":"We came here for brunch after a yoga event that took place in the museum. The service, food, and drinks were all great. We had the deviled eggs, jelly donuts, griddled sandwich, and bocadilla de tortilla and it was all fantastic- fresh ingredients, well-prepared, and flavorful. They serve high-quality coffee and also had delicious brunch cocktails- the Bloody Mary and Craig Street Wallbanger were both top notice!  We were seated immediately by the hostess and our server was very attentive. There were a fair amount of people in the restaurant and the food came out very quickly.   I highly recommend this restaurant and plan on returning in the near future."}
{"text":"After a really nice morning in the museum, a trip to the cafe was just as nice.  I enjoyed the lunch. Everything was tasty and fresh!  Our sever was very friendly and accommodating to our granddaughter.  I enjoyed the fresh salad and cheese platter.  It is a little pricey for a small menu, but well worth it.  Highly recommended!!"}
{"text":"Has this cafe always been here?  I have no idea.  I discovered this cafe was here when we were setting up an event for work, and my boss said we were getting lunch here.  Who am I to complain about free lunch?  You walk up to the counter, order, and find a seat.  There is real silverware and plates, but we ended up taking food to go.  They provided us with plasticware and napkins.  The menu is small.  There were four sandwich options, two soups, a salad, and a few other things.  What I really liked is that each sandwich came with a side.  I got the buffalo chicken breast sandwich ($8.75), which had buffalo chicken breast, America cheese, lettuce, tomatoes, and pickles.  The sandwich was large and tasted good.  I had two little cheese and sun-dried tomato risotto bites.  They were delicious, and I wish there had been more.  Apparently the chips for a side are good as well, and there were quite a few of those in a portion.  The service was friendly, and everyone was happy with lunch!"}
{"text":"Had brunch. 4** is out of generosity, more like a 3 & 1/2. Ambiance is nice and cozy. Food is good, but we had much better tasting dishes in museum's restaurants then here. A bit overpriced for what it was. Service was nice and friendly, but not very professional. Unless the weather prevents you from walking 5 minutes, there is much better alternative if in the area called The Porch."}
{"text":"Best salads I've eaten in Pittsburgh. Get the Farro, Chicken Salad, or or Cheve Chaud. Also, Griddled Sandwich is the best comfort food I've eaten. Make sure you get a bite of the house-madenaturally leavened sourdough bread."}
{"text":"I came for Sunday brunch and was a little disappointed. There were not a lot of options for vegetarians. Basically either french toast or a sandwich. I ended up getting an omelette sandwich. It was supposed to be an upscale type of restaurant, but the food was not looked after or seasoned like an upscale restaurant. They did use tons of ingredients though and weird cheese, so I guess they thought that was enough.   The sandwich wasn't bad. It was messy so I couldn't use my fingers, but the crust was super hard so it was also nearly impossible to cut with a knife. It was very oily but the flavors were okay. I didn't touch the salad because I don't remember the menu even mentioning a salad coming with it. I am really picky about dressings.   I would come back to try other items, especially if they get more options for me."}
{"text":"I've only tried the coffee bar, but the in-house pastries are out of this world."}
{"text":"They need more veggie options.  I asked for the fontina and spinach quiche, which sounded delicious.  A few moments after I ordered, the staff told me they were out.  They were apologetic, but the only other veggie options were salads and (yuck) a garden burger.  I ended up disappointed, and having to find somewhere else to get food."}
{"text":"appreciate the decor of this place but the coffee is not worth the trip....3.75 for a latte that didn't taste all that great and nowhere as good as commonplace coffee."}
{"text":"The food here is delicious. The ambiance (if you sit outside next to the fountain) is peaceful. However, be prepared to overpay and leave hungry."}
{"text":"A hidden gem! Usually people don't go to museums for their cafes, so I was pleasantly surprised to discover that the cafe was open for brunch and served up a pretty good menu. The ambiance was very nice, with classy decorations and a good view. I enjoyed the light display and the tall windows that allowed diners to see the pleasing fountain display.  For a Saturday morning it wasn't too busy and my friend and I were able to secure a table without a reservation. The staff was cordial and helpful. Our waitress made some pretty good suggestions regarding the menu. Everything seemed delicious and there appeared to be good vegetarian selections as well.   We took her suggestion and ordered the Bocadillo di Tortilla for $13 and a short stack of pancakes for $7. The name tortilla is a bit misleading: it's actually a sandwich with two thick slices of bread around arugula, manchego, aioli and an egg, spinach, and potato frittata. The sandwich was decent. The crispiness of the bread paired well with the soft frittata. However, it wasn't too outstanding, I'm not sure if I would order it again. It was nice to try it. I would consider it a good experiment as opposed to what I usually order. Although the short stack seemed small it was still quite filling and soaked well with maple syrup. The pancake was soft and fluffy, very satisfying.  The portions were quite generous so we ended up packing up our leftovers.  Overall, I would come back here again. It's reasonably priced for a brunch place and has a nice atmosphere. I definitely want to try their banana pancakes next time!"}
{"text":"I will allow that the prices are high for Pittsburgh but for me they are normal for where I live and low for what you get.  Be aware that if you are a party of two you will be seated at a European-style two-top close to your neighbors.  This is OK unless said neighbors don't know how to behave and would truly earn any dirty looks they'd garner if they did the same in Paris.  This happened to us.  One of our neighbors was so loud and full of himself he boggled our brains and made us miserable.  We debated getting up and walking up but instead convinced the host to move us instead.  Fortunately all of our new neighbors engaged in much quieter conversation.  We wound up having a very delicious and relaxing lunch here.  We debated the menu until we saw another diner's vegetable pot pie.  It is so cute!  It's a modest puff pastry box with a lid.  Inside were brussels sprouts, sweet potatoes, pearl onions, and maybe something else.  The sauce was delectable.  It was served with a simple yet flavorful side salad.  The vinaigrette leaned on the side of featuring the flavor and texture of the high-quality olive oil, which was a good thing.  We also enjoyed the grilled sandwich.  This was an umami explosion of broccoli rabe, egg, and bread, with a little sopresata for flavor.  It was served with a slightly different side salad; dressing was more piquant with more emphasis on the vinegar.  This was a good foil for the decadent egg.  We also shared a double-shot cortado, which we felt was on par with what you'd be served in a European cafe.  Yum.  And it was served in a cute glass.  We enjoyed our food and time.  The entrees were a tad salty for our tastes but we run very sensitive on the salt-meter.  I am looking forward to trying more meals at the Cafe Carnegie.  I will probably try to avoid the smack middle of lunch time."}
{"text":"On the plus side, their french fries tasted like they were from McDonalds - who have good fries. On the down side, their french fries tasted like they were from McDonalds - but were three times the price.  For the price and decor, my lunch should have packed far more of a flavorful punch. When the menu description boasts of jalapeno, homemade bread, and dill aioli, I should be savoring each bite. Instead, I ate a boring shrimp sandwich. Shrimp was overcooked and hardly seasoned and the bread was not the right fit for what they were going for.  I'm pretty bummed out because upon entering, I was excited to have a new place to take clients for lunch meetings. But I don't want my clients to leave the meeting feeling unfulfilled from lunch and have that affect their insights of our discussion. Bummer."}
{"text":"This is a very cute café setting, with an upscale twist to it. It seems very nice for a lunch date or girlfriends happy hour. The prices are a bit higher and small portions, as was described not to make you so full that you cannot stay awoke while walking around in the museum. Stay woke!!!!  I tried the deviled eggs, oysters, and watermelon and olive kabob. The deviled eggs are so delicious and definitely a must try! The watermelon and olive kabob was tasty as well. Oysters, meh! The biggest gripe that I had were the drinks. I tried the Sangria and a gin that appeared herbal aromatic. Both did not have any sweetness to it. So I didn't care for that too much, especially with the Sangria. However, the gin was pretty good. I enjoyed the aromatherapy of it--very soothing and relaxing.  This is probably not a place that I would frequent because it is not exactly my style. But I probably will pop in if I just so happen to be at the museum."}
{"text":"A business associate suggested this restaurant for lunch which is actually inside the Museum (although it has it's own street entrance.) Server was friendly and engaging with good knowledge of the menu items, she even managed to sell me on \"nitro cold brew coffee\" which was really good. I had the roast lamb sandwich, my associate had the grilled Caesar, both were great tasting and delivered quickly. The homemade bread on my sandwich was awesome, I would go back just for that! The Museum is near our office so not many lunch options of this style near us, it's mostly fast/casual grab and go food in this area."}
{"text":"This is inside the Carnegie Art Museum but outside the paid area.  Although very crowded it was surprisingly quick.  Order at a counter, pick up your drink, pay, and they bring the meal to your table.  Small menu, light stuff, but fast and good.  I had a cajun shrimp salad (the daily special that day), crunchy lettuce decorated with the medium-sized well-spiced shrimp.  Definitely a satisfying light meal."}
{"text":"Beautiful cafe located inside one of one of my favorite museums in Pittsburgh, but the food just wasn't nearly as astounding as the ambience. The chilled zucchini soup was oily and unsavory and the tea sandwiches I got had soggy bread and weren't too appetizing. The nitro cold brew is decent! Maybe I just ordered the wrong things; hope this place proves me wrong the next time I swing by the art museum."}
{"text":"This is a great lunch place for us non-students working in Oakland. The atmosphere is relaxed and the service, which now includes cleaning off tables, is friendly and nonchalant. Plus, you can always check out the museum store for gift ideas.   The food is okay. It can be hit or miss. The crab sandwich I had recently was exactly what I was looking for that day, and I really enjoy their broccoli/bacon side dish. However, their weekly quiche is on the dry side and sometimes the salads are a bit of a let down.   I'll definitely be back it's always a solid option."}
{"text":"The Cafe Carnegie is a separate entity from the museum. It is laid out nicely but can be very costly when you are having lunch. They also have a coffee and full bar on site as well. It is usually best to make a reservation since the place gets fairly crowded over the lunch hour. I had one and was deciding whether I wanted to go with a salad or panini. They are now full table service. They serve brunch on the weekends.  I opted for the latter and had the grilled zucchini panini with avocado, mozzarella, and other things on their homemade sourdough bread. I had read that all their sandwiches are made with homemade bread. The sandwiches with the exception of one all come with an order of French Fries.  I got my order and noticed it was slightly burnt along the edges but it didn't stop me from eating it. It actually didn't seem to have much of a flavor nevertheless I found it very filling.   I really on the other hand enjoyed the French fries that went with it. The waitress staff were both friendly and helpful.  This is an okay business for one or two people having lunch but if you are bringing a family it can get pretty costly and there are very few items on it for kids. I believe the museums have another cafe in the basement which is supposed to be more family friendly but I have not had an opportunity to check it out."}
{"text":"I've eaten here a few times and have seen lots of change; for the better. The quality of the food and service have progressively improved over the years. Brunch as of late has been fresh and tasty. And nothing beats a cocktail with brunch. By far the French Toast has to be my favorite. Packed with delicious fruits and toppings. I've had a couple of sandwiches here that were kinda subpar and for that the star rating is lower than I'd like to be able to give."}
