{"text":"It's not bad.  A bubbletea will cost around $5.25 which is cheaper than the one around the corner.  The mango is good.  I tried the strawberry and their special mixes but those weren't great."}
{"text":"Their bubble tea is yummy! The honey lemon bubble tea is so sweet and tasty and comes in a tall cup! The avocado bbt is so creamy, perhaps they use breve milk?   I just don't like how you have to walk over to the other store to pay with debit, but that's fine because their bbt is delicious! They do take a bit long to make it though."}
{"text":"My favourite bubble tea place! If you like milk tea you should try their milk tea deluxe or their signature milk tea which comes with 3 toppings and it is so yummy!  They also have crepes and other snacks. You should try their takoyaki as well, it so full of flavour and so delicious! Though the service is kind of slow sometimes especially if theres lot of customer but i think its worth it!"}
{"text":"Been a few times. Usually fast service and yummy food/crepes and good bubble tea.  But today the service was very slow and 4 people who ordered after me got served before I did. The crepes were yummy as usual."}
{"text":"Been here twice now. Bbt are really good. Had the milk tea deluxe it was so good. The waffle was okay a bit too sweet and the waffle to dense needs to be lighter. Service is slowwwwwww! I'd come back to try the other specialty bbt they have."}
{"text":"Worst service and bubble tea in Calgary. I ordered a fresh papaya and while I was paying for the drink I overheard the girl making my drink said to the girl who took my payment they were out of papaya. They whispered back and forth until my drink was done. I took a sip of it and I was grossed out by the bright pale yellow powered papaya drink. I told them it was not fresh papaya and they kept looking away and lied to me that it was fresh papaya. They couldn't say it straight to my face when I repeatedly confronted them. Papaya is my favourite bubbletea and I know what it should taste and look like. Then the 3rd girl came out and heard the whole thing and didn't bother doing anything either. All three girls had a chance to make it right by refunding my money or make me a real fresh papaya drink. They all looked away. I left my drink behind and tell them to keep it because I didn't want to stand there and make a confrontational scene.   Trashy place deserves trashy employees. I would never come back here again and I don't suggest anyone to. I told many of my friends the story and some of them told me they experience similar problems from the same place.  Please do yourself a favor and go across from their competitor Quickly and get yourself a real drink."}
{"text":"Decent bubble tea joint found inside the pacific mall. Seating is fairly substantial for its size but don't expect a lot of comfort. I really enjoyed my coffee milk bubble tea. It was the perfect combo of coffee and tea flavours. And I always enjoy the chewiness of the tapioca pearls.  This place also has a large variety of crepes and waffles. They also have the Hong Kong style bubble waffle which is sort of like a bunch of cake pops connecting. We ordered a couple to try but they were out of ingredients and didn't let us know till the waffles were ready. They just added a substitution without asking to one of them but asked about the other and then they were out of what we asked for again so we're left with something different anyway.   Despite that the soft cone stuffed waffles were still thoroughly enjoyable and I would definitely recommend checking them out."}
{"text":"This place is my go-to bubbletea place. Very affordable and yummy! Couldn't decide which one I should get because of their unlimited choice of drink from fruity to creamy. Ended up choosing avocado mango with every tapioca not to mention that you can mix any tapiocas with free of charge. I heard they just recently renovated so I can't wait to get my next bubble soon and ofcourse with every tapioca I could possible get"}
{"text":"I never tried his place before although I've seen it in passing several times. There used to be another BBT place across the hall that I always went to for HK milk tea. I felt like some of that but got regular black mill tea instead with pearls. The guy barely understood me when I ordered. I had go repeat myself a few times. I got my drink and it was pretty simple though not bad. I think I prefer Ten Ren's in front of T&T for the flavour. I would probably be going there rather than here in the future if I feel a pang of BBT cravings."}
{"text":"You can find the oh-so-instagrammable bubble waffle crepes here! I ordered the strawberry almond bubble waffle and it came to just about $9 after tax. The bubble waffle was a bit dense and not as crispy as I like and the ice cream inside was a cheap fake strawberry. They were also out of many ice cream flavors such as taro and green tea. I was a bit disappointed. It could have been much more delicious with some yummy ice cream filling!"}
{"text":"Attention Blind Daters! I think I just found the funnest place, on a budget,  to take your date in Calgary.  Start with a cheap matinee at the MovieDome, and afterwards, take her out for dessert at The Crepe Cafe.   I just stumbled upon this gem the other day, at Pacific Place mall in the NW. The funky Jetsons furniture first draws you in, and you're hooked by the extremely lifelike and decadent wax models of the \"baddest-assed\" crepes your face has ever laid eyes on!  HUGE crispy crepes, filled with entire slices of dense, rich chocolate cake, strawberries and whipped cream. If there hadn't been glass in between me and the crepe, I wouldve eaten it, forgetting it was wax!  To wash it down, we ordered the Almond Blue Dream-almonds, blueberries, yogurt and honey... Yummy healthy goodness never tasted this good!  And then, to walk it off, take her to China and tour her around T&T Supermarket, down the hall. Check out all the exotic alien-looking fruits, New Years cakes, shaped like blocks of gold, and bottles of Canadian made Harp Seal Oil, encapsulated in easy to swallow gel caps.  I even found a ketchup bottle filled with tiny shrimps, complete with eyes. Trust me, it's better than any movie!)"}
