{"text":"I had lunch here today.  Really enjoyed it.  Server was amazing, service was excellent and the food awesome.    Short sweet review .. give a try!!"}
{"text":"We were in a search for a place for dinner so we decided to stop by and give it a try.  The place looked cozy but it wasn't very busy.  We ordered the double leg dinner, ribs and the pot pie. It comes with coleslaw with a choice of creamy or vinaigrette dressing. The chicken was okay, typical rotisserie chicken, but the sauce was way too salty. The pot pie was pretty good, there were big pieces of chicken in it covered with a puff pastry.   If you check in on yelp, you can get a free dessert.  We got the deep dish chocolate chip cookie with ice cream. It was yummy - the warmth of the cookie with the coldness of the ice cream.. Yum!   I don't know if we'd go for dinner again, but they have breakfast and brunch so maybe we'll give that a try."}
{"text":"Good place for a reasonable breakfast. Breakfast burger with egg? Yes please! Parking was ample...."}
{"text":"If you like St Hubert or Swiss chalet this is petty much the same thing."}
{"text":"They have applied good things since I  entered my last review. Hope they will improve more and be great."}
{"text":"Decent food. Service was good. Nothing extraordinary on menu but the kids liked it. Better chicken sauce than Swiss. Id try breakfast soon."}
{"text":"If you LOVED st huberts and miss it dearly, you'll be obsessed with the Q! I literally drive 30 minutes out of north toronto to come here and I always drag my friends there too.  This place slaughters swiss chalet with their deliciousness.  Their fries make me drool, and their sauce is beyond life changing.  I know I'm a bit overly enthusiastic about it, but it's my all time favorite restaurant.  It can be a bit pricey - the chicken fingers are like 16 bucks or something - but the quarter chicken dinner will change your life.  And i love that it comes with a toasted bun instead of the gross stale role they give you at swiss.  Mmm I love you Q!!!!!"}
{"text":"I'm the Duke here so I'm a regular. If you like chicken, this is the place to go! Pay no attention to the dutchess, she's clearly not on the ball. The best rotisserie chicken in town at this place!!   Also the dessert menu is spectacular, try the 7th Heaven!"}
{"text":"First of all they are overpriced . Swiss Chalet gives the same for less money and better, faster service. Chicken often dry. Had the sandwich and it was dry as shoe leather, certainly not fresh. Wondering if it was yesterday's left over chicken."}
{"text":"I had lunch with my sister today.  She had the 1/4 chicken. I had the pulled pork sandwich.  Both where good. I did get there house made chicken soup I could not finished it. I was not the best. The noodles where over cooked. The broth had no flavor. And I could not find the chicken. My sister makes me go with her she loves it. It's not one of my favorite."}
{"text":"I can't say enough about this place! For those of you who have read my profile, St. Hubert's Rotisserie is my favourite restaurant. I remember going there when i was young and loved it! However, St. Hubert's left and the Queensway Rotisserie (The Q) took over. St. Hubert's is still in Quebec and only other location in Canada is in Cornwall. So I have not been able to eat anything like it until now! The Q is pretty much like how St. Hubert's used to be. I didn't know this place took over until I saw a review recently on yelp. So yelp reunited me with my first love! Chose to come here on a Sunday for my bday dinner with the family. Their chicken is cooked perfectly. Juicy with Lots of crispy skin without being burnt. I got mine with fries. The dipping sauce is how I remember it...sooo good I could drink it but I settled for dipping! Didn't really care for the creamy coleslaw that comes with it though. As it was not that creamy and taste was just not there. The menu offers a lot of different dishes. Not just chicken and ribs. Will definitely go back again and again!"}
{"text":"I've been coming here since I moved to Toronto about 10 years go.  I grew up on St. Hubert Bar BQ and still love it.  The Chicken is the same but they added more items to the menu.  The price was ridiculously low when it was part of St Hubert's.  Prices have gone up pretty steadily now that it's The Q.  A hot chicken sandwich used to be below $10, it's now about $12.50 with about $1.50 more for white meat.    The food is great, the service is very friendly and fast.  For quality/ price ratio, this is an excellent place.  They used to put wrestling on the TVs.  Happy to see that's gone.  You won't regret your choice if you come here!  I highly recommend it."}
{"text":"Thought the food would be crummy but looks definitely are deceiving. The California Cobb Salad was awesome, everything was so fresh (which surprised me, even the bacon was good) and my favorite thing about it- no iceberg lettuce, all romaine! If you're a chicken connoisseur this is the place for you."}
{"text":"Today I wasn't in the mood to cook... the wife was in the mood for Greek (food!). So I found this place had souvlaki on the menu. It was bloody awful... first off it was luke warm when it got here. Next... the roast potatoes were actually potato wedges; dry and bland wedges. The chicken was flavorless and burnt. The rice was awful. The tzatziki was bland and flavorless. The garlic bread was a ridiculous half of an over toasted bun. The salad was ok... although I've never seen a Greek salad with carrots and cucumber before. Furthermore the price was about the highest I've ever paid for souvlaki.   In a word... this food was blech!"}
{"text":"Come here every time I'm in town. Being from Montreal I do go to St-Hubert and while there are similarities between The Q and St-Hubert, the food especially the chicken at The Q is juicier and fresher.    This is a must for those who like Swiss Chalet. You'll find the food at The Q is far better and you won't be disappointed.   Bon Appétit"}
{"text":"If you want to get the best French toast in the city,this is the place to go. They provide breakfast menu till 1pm. The french toast is made using Egg bread, so the taste is unique. I can't remember the number of times I have gone there just to ear the breakfast french toast."}
{"text":"We love Q Grill.  We used to live in Etobicoke and moved downtown.  We drive back for Q Grill.  The service and food is consistently great and it is a cozy, family atmosphere.  And we noticed a drive-through!  Fabulous! Thanks, as always."}
{"text":"Compared to Swiss Chalet that seems to be serving pigeons lately, the Q's portions are huge.  Still very tasty after all these years too.  The menu has been expanded to include seafoods and even items like butter chicken."}
{"text":"I ordered delivery for the convinience. It took quite long time to arrive (50 min) though it was stated when i ordered. The food was regular and a bit pricey. The mashed potatoes were very bland. I don't use to put gravy on it but this time was necessary if i wanted to taste some flavour. Also the coleslaw portion was way too small."}
{"text":"Just went for the first time today and it was outstanding. The best rotisserie chicken i've ever had. Service was fast. Menu looks great. Im excited to come back."}
{"text":"Food was good. Big portions so make sure you come hungry!"}
{"text":"There is a big sign outside the says Q on it.  Ample parking used to be St. Huberts.  My kids love this place and i'm glad they do because I really hate chicken places like Swiss Chalet and St. Huberts but this place has great rotisserie chicken.  The daily lunch special from Monday to Friday 11am to 3pm is buy one meal get the second for free.  Two quarter white meat chickens w/2 pops is $18.77 taxes in.  It also comes with creamy or vinegar coleslaw.  I wouldn't rush there for dinner but if your in the neighbourhood for lunch this is an excellent deal and in my opnion about 100 times better then Swiss Chalet.   note: i give it four stars for price, service and quality compared to price"}
{"text":"I was invited for a lunch meeting here and having driven past it numerous times when I worked in Etobicoke for a couple of years at one point, I was excited by the opportunity to try this place.   There is plenty of parking at this place, and when I was there they had just repaved and painted the lines in addition the exterior of the restaurant was crisp, clean and well kept, a sign to me that management/ownership takes pride in the appearance of their wants to present a professional product. Upon entry I realized that the interior was well on it's way to the same presentation. I say \"on it's way\" as some areas were fresh, and noticeably newly renovated while others were slightly dated. That being said, it's clear they are investing in this place in a big way so full points on aesthetics!  I will say one thing, you really do feel as if you are in a Swiss chalet/ St.Hubert's (I think the Swiss Chalet loving Vincent P from Cambridge would even be impressed). However, as I mentioned above, it's getting a fresh look to an old concept.   We were seated right away and I had to take note of their menu, lots of great pictures and a true rotisserie style menu with all the standards (chicken, ribs, etc). After being told that their chicken was better than a St.H or Swiss Chalet by my lunch mate I obviously had to try it out! It came with coleslaw, fries, and 1/2 a hamburger bun (I did feel this could have been an actual bun or garlic toast instead - the presentation of a hamburger bun is not what I would call \"classy\"). The roasted bird was as good as her word, perhaps not better but definitely equally as good in my books. I did enjoy the chalet sauce (I mean who doesn't).  Over all the meal was A-OK for me (aka a 3 star). Where they earn the extra star is in the following areas:  - aforementioned attention to image and presentation of the menu, interior and exterior - Buy one get one free lunch menu Monday to Friday until 3pm - Fast, friendly service - Their impressive espresso bar that is a focal point the moment you walk in.   I think with a few little tweeks this place will earn a 5 star in my books. That being said this is still a great spot for lunch, dinner or group outing, if you're in the area give them a try and let me know your thoughts.  Eatcrest OUT!"}
{"text":"A former St Huberts that kept the decor and a similar menu, but changed the name when the franchise left Ontario. Having driven by this place many times, I decided to stop in with some friends for lunch.  The place is well kept, the food is good, and menu is well priced. They have a variety of lunch specials that are not worthy. They include a meal with a drink and unlimited coleslaw for under $15. I had the hot chicken sandwitch special. One friend had the rack of ribs meal. Another had the quarter chicken lunch meal. We were all satisfied with our food. I will be returning to try the ribs on a subsequent visit."}
{"text":"Gave this place another chance. Service was good. Food was really great. Bit pricey but worth it. Will come back again. Glad I didn't let one bad experience keep me away"}
{"text":"The food is good and priced reasonably. The interior could use an update. Otherwise, it's a great place to have a casual meal."}
{"text":"This used to be St. Hubert's before the name or owner change.  Came here for lunch with a friend and got the buy one get one free special.  If you each buy a drink you get 1 main dish free.  We both got chicken dinners...1 leg and 1 breast.  The breast dinner looks so much better than the leg which seemed much smaller.  You get a choice of coleslaw- vinaigrette or creamy...both are good just depends on your mood or preference.  You can't go wrong with the fries but I got veggies this time which was not bad.  The bread sucks which is the top portion of a burger bun.  I think the chicken pot pie is one of the best tasting things on the menu.  Chicken does taste a bit better than Swiss Chalet that's why I come back."}
{"text":"My boyfriend and I used to like coming here for a weekend breakfast while we were running errands in Etobicoke. we'd have breakfast at  \"The Q\" twice a month. It's almost always busy, but and they have a few servers who are outstanding and really good at their jobs. I feel sad for these servers because they they have to work with the other half of the staff who are absolute tools.  The worst was Club Boy, a faux-hawked sleepy eyed 20 something guy, who did nothing but stand around and try to look hot. He arrived at thetable 15 minutes after we sat, despite the fact that he was lollygagging by the kitchen. He completely messed up our order and when I mentioned that there must have been some confusion, he WINKED AT ME! Like... what? Dude, I could be your Mother (well, no I couldn't because I'm proud to say that nothing that stupid has come that close to my who-who), but why on earth would you wink at me? I'm supposed to think that you're so hot that I just don't care that you got our orders wrong?  I watched the entire place going haywire while he just stood there bobbing his head. It was obvious that the other serving staff hated him enough to not even help him.  I had to take my bill to the cash register after waiting 20 minutes from the time he dropped off the bill (which we had to ask for twice).  Twice we were also served by another gentleman who left us waiting forever. We sat in the front area that was a little out of the way and we sat for 10 minutes without menus. When we got them, it took our server forever to return to ask for coffee. Don't deny me my caffeine in the morning, or I will be very grumpy. We were there for 2 hours in total just for breakfast. The second time we went and he was our server, things were much the same.  Eventually, we just stopped coming to the Q. The rage inducing waits for coffee and stupid staff just drove us away.  I will say that we have been there numerous times and had great service. But when it's hit or miss, you don't want to risk a miss."}
{"text":"oh man i remember st hubert as a kid this is pretty much it! way better then the Swiss good portions Friendly staff i like this place!"}
{"text":"We order The Q quite often at work because its reasonably priced, ever since Marios BBQ has closed down we've made a habit at ordering from the Qs. Great quality rotisserie chicken, Im pleased with takeout. Hope to eat inside soon!"}
{"text":"We decided to dine here for the first time, after having driven by it countless times or opting for The Grille down the street.  We order the shrimp & cheese sandwich and BBQ rotisserie chicken sandwich; both came with fries and coleslaw.  We thought the food was just mediocre, acceptable but nothing superb, slightly pricey for its quality.  Service was unfortunately incredibly slow...given that we dined at an early dinner hour, we had to wait quite a bit for our food...and for acknowledgement of our payment.  A request for a water refill was never filled.  Kinda regretted trying it out...nice to say we did but I think we'll stick with The Grille!"}
{"text":"I've driven by this place for years and finally decided to stop in instead of at Swiss Chalet down the road.  I'll definitely be back.  This place is essentially St. Hubert under a different name (and yes, it was actually a St. Hubert at one point).  Most of the menu resembles old SH favorites including the coleslaw that comes with dinner.  Prices are standard compared to its competitors.  I find the quality a bit better as well.  Overall, a yummy and much better alternative to their main competitor, Swiss Chalet.  Do yourself a favor and stop here instead.  The only complaint from our meal was the caesar salad to share that we ordered was WAY too small.  Otherwise, the meal was terrific."}
{"text":"Back again, and once again all is good.  We had the chicken poutine, which surpassed my personal expectations, and the standard rotisserie chickicken meal.  The coleslaw was delish.  Fries were crisp.  Service was above average.  It was another great day out."}
{"text":"The Q! Went there for breakfast. Highly recommended. Nice atmosphere. The poached eggs were perfect. Right on the money. The coffee was free! [my favorite price] The prices in general were great. I had 2 poached eggs, toast, salad and fruit/granola yoghurt [$9] My wife, son and I spend together $19 and we were all satisfied. Did I mention the free coffee?...with free refills?  My toddler son got a free toy to keep him happy while waiting. Good service. No complains. We will be back...often."}
{"text":"Went here today for brunch.  They have breakfast which is something I don't expect from a chicken place. This place used to be St. Hubert's  years ago which is pretty much a  Quebec based chicken and rib place much like Swiss Chalet. This place is a bit more expensive than Swiss Chalet but their half chicken dinner is much larger. The decor is also nicer as the menu also has more selection.    The service is ok, nothing spectacular. I always find myself seeking out the servers to get refills here regardless of how busy the place may seem.  The food is good but it seems a little higher than expected. For instance a half chicken dinner is 18 and rib dinner is like 24+. Still the breakfast is decent and they have a nice place with a kids menu etc."}
{"text":"I just came back from this restaurant, have been going to  this  restaurant for years, formerly St.hubert's (who pulled investment out of Ontario and invested in Quebec to update all theree existing restaurants). Anyways there chicken is bigger and better than any Swiss Chalet I've ever tried and I have been eating Swiss for decades (not bad) but, this Joint is a little more refined. The service is fast and efficient, the food is always conistent and the price is a little more than Swiss but well worth it. I had a full rack of ribs, shoe string fries and the famous St. HUberts gravy. I forgot to mention the coleslaw, fresh, crunchy and just enough mayo (don't forget to add black pepper on top). I had have of my wife's quarter white, made a small sandwich with the ever famous burger tops toasted, dipped in the sauce.. Awesome meal and always great food and service. highly recomend"}
{"text":"Worse than Swiss Chalet. Quarter chicken was half-decent, juicy enough but too much dark meat. And very tiny. But the gravy was terrible, can't taste anything but salt. Fries were the cheap frozen variety. Vinaigrette coleslaw was a big miss. And completely lifeless service. Will avoid"}
{"text":"Unlimited coleslaw!!!!  This place was great, been going for a couple years, but recently it's been seriously lagging in customer service.  The younger waitresses yelling across the room from right beside customers tables, and joking around loudly like idiots unaware of the people trying to have their own conversation and meals. I enjoy seeing staff have fun but not being absolutely obnoxious.  However, everything I've ordered here has been amazing. And they lave lots of booths for a private-ish meal."}
{"text":"Came here for dinner with my coworkers. The restaurant is big with lots of seating. A typical dinner type restaurant with lots of menu selections from specialty salads, steak/rotisserie chicken and sandwiches. I had the hot chicken sandwich $16 it was very good and filling. The service was amazing. Our waitress was very friendly and attentive. They also have a four course dinner for $20 but you need to be extra hungry as the portion size is huge."}
{"text":"We get delivery from here all the time.  And not just chicken dinners - we've tried a bunch of their menu items, all have been good.  My current favorites are the burger and the hunter chicken."}
{"text":"An alternative to Swiss Chalet modeled after (exactly) St. Hubert. The food is almost identical to either with the exception on the chicken wings which are expensive and small but absolutely delicious!"}
{"text":"My first time here, thanks to a friend. Don't go by the outside of the place, can be quite deceiving. The place from inside has a good decor and feels warm and friendly. Came here on 1st January and the service was incredible! I ordered a west coast egg Benedict which was delicious! Made of hollandaise sauce, bacon, avocado, grilled shrimps and eggs poached just the way I like it! Overall a good place and would recommend you come here for brunch!"}
{"text":"Pretty excellent example of WAY OVERPRICED. 1/4 chicken, fries, ribs $28 +tax. No drinks about 60 bucks w tip... Quality of food a 3.5/4 stars.. The price keeps me from ever returning."}
{"text":"Well another dinner at the Q on Queensway . Been coming here for years , and honestly never  Been dissapointed . The chicken is always fantastic and the gravy / sauce is alwsys great and waaayyy better the that other chicken place y'all go to swiss chalet ....I'd pick this place over that any day !!!  Place is clean , nice and quiet as its full of old people . But that's ok for a relaxing meal ! Give em a try!"}
{"text":"The \"Q\" is this rotisserie chicken spot that is near identical to Swiss Chalet, but pricier and smaller portions....  The Q offers up rotisserie chicken with some other comfort food items. They have an eclectic menu as they also do steaks and seafood and such, but chicken is their primary area of focus.   I got the quarter chicken lunch special that comes with fries, slaw, and bread (as well as soup for lunch) for $12.95. The chicken leg was rather small, which was pretty disappointing, but the meat was tasty and the skin was pretty crispy. Fries were the best kind as they are the crisp ones and not the flaccid greasy ones that Swiss Chalet has. Bread was a pretty weak half of a hamburger bun??  Overall, I found the Q pretty disappointing. The prices are higher than Swiss Chalet, and although the chicken might be slightly better, they're smaller and not as filling. Gravy that comes with the chicken is the same too. Can't tell much of a difference."}
{"text":"Found this place on Yelp and stopped in for a quick lunch as I was in the area.  It reminded me of a really old Swiss Chalet.  The decor could use an upgrade.    I had the chicken wrap with a bowl of soup.  The soup tasted homemade and the wrap was quick good.  It came warm, which was actually quite nice.    Cheap prices.  If I'm in the area again I'd come back."}
{"text":"Great place to have breakfast (all day breakfast) we came here due to high traffic at Sunny morning and I was pleasantly surprised. Great portions, and very yummy breakfast. All in all great alternative in the area if you can't manage to get a seat somewhere else. Very pleased and will be returning! Sorry other guys but this might be the new go to place for me. :)"}
{"text":"Disappointed in the poor service from waitress. Asian mid aged lady - unfriendly. Cold, no hello, no \"how is your meal\", nothing other than are you ready to order and here is your bill. Great food, nice atmosphere and very clean - but when the server is crap - I don't come back. Some of the other servers there are great - I find the male servers more friendly than the women. Come for be good, but not for the service :( Thumbs down   Return on 04NOV- the food continues to be  Ok -the creamy coleslaw is as bland as a politicians promise. The servers are really what make it for me here - they are professional, friendly - I can see they are working very hard and they try very hard to make sure I am satisfied and happy - I come back for the service and the hardworking staff"}
{"text":"I haven't been to this restaurant since it was St. Hubert's.  Thought I'd give it a try but was rather disappointed in the quality and taste of the food.  Wish I had just gone to Swiss Chalet."}
{"text":"Waiter mixed up order, delivered totally different dish to my husband after an extremely long wait for food. Food bill came, full priced. Everything tasted good but I was unimpressed with the lack of consideration around delivery a totally different meal than what was ordered."}
{"text":"I love St Hubert's like a fat kid loves cake. There's no sugar coating it, they know how to do rotisserie like no else's one's business. If you're wondering why I'm going on about St Hubert in a review for The Q you've never been there because The Q IS St Hubert! That's right, you heard me correctly, they're the SAME PLACE!  Now that I've used up all the CAPS LOCK I have for the day, I'll explain. The Q used to be St Hubert's when St Hubert's was still in Toronto. St Hubert's left, but apparently no one told The Q, so they kept making and selling St Hubert chicken, fries and sauce. It's epic beyond your wildest rotisserie dreams!  Now, before you go mistaking The Q for your favorite downtown club, let's get a few things straight:   1. It's still a chicken joint  2. It's out in Etobicoke 3. The majority of the diners here are in their golden years  But hey, the food is FANTASTIC YO! (Okay, so I wasn't quite done with the CAPS LOCK). It's like St Hubert's never left! It's so freakin' good!!  Big dining room, not a lot of atmosphere, nobody gives a crap.  GO!!!"}
{"text":"I don't know if anyone else calls it Q, but it works for me.  This is well known as St Hubert Chicken under a different name.  I had a double legs dinner.  Chicken was juicy, tender, fresh, well seasoned.  The sides were okay.  The coffee was outstanding.  The services was average.  Q's chicken are better than Swiss Chalet's, yet I won't go out of my way to come here.  If I must have chicken and I am far from here, Swiss Chalet be it.  Overall 3.5 stars."}
{"text":"Felt like I was at Swiss Chalet with prices like Moxie's.  Food tasted good. Service was friendly. But prices were a bit much for what we got and atmosphere.  Won't be returning."}
{"text":"Kind of a clone of a Swiss Chalet or St. Hubert, but with a bit wider menu.  Not spectacular but not bad."}
{"text":"Our first visit. We didnt know they did breakfast. It was poached eggs over rotiserre chicken with their Q sauce. Everything was hot and very big portions."}
{"text":"More expensive version of Swiss chalet. The decorations were better but the food was about the same. The one slice of bread provided was either the top or bottom half of a hamburger bun. Would probably go to Swiss chalet down the street next time I'm in the area."}
{"text":"Visiting Toronto we were looking for a place for breakfast and lunch.  Looked up this place and seemed like an obvious choice a little bit of everything.  Upon arrival there was a few parties ahead of us waiting for a table we waited about 5 min waiter was polite and provided quick service.  I ordered the brunch special toast topped with Swiss cheese ham and 3 eggs cooked to order, a side of potatoes seasoned amazing... Strip of bacon, sausage link, baked beans and to finish it of a fruit kabob I ordered a mimosa and a pancake too. Pancake was not to my standards seemed to be prepared out of a box instead of home made from scratch as I would expect. Hubs ordered 1/4 rotissory chicken came with creamy coleslaw side a fries toasted bun and a dipping sauce tasted like gravy from a can.  3rd person in our party ordered loaded baked potato was good size no too large taste was average nothing special had an onion taste. Coke products and full service bar. Place was very well maintained and staff were great check in with foursquare for special offer we got a BOGO free 1/4 chicken meal. I give this place 4 stars knocked one off for the sucky pancake..."}
{"text":"It is what it is. Service was good, food was fine but the menu is obviously nothing special. If you're in the area and want a traditional breakfast, go for it."}
{"text":"I have never been to a St Hubert, but Lee has. He remembers when this place was one of the last ones in Ontario, and we decided to give it a whirl. The first time we went, he made some suggestions to make it the \"authentic\" experience.  They still sell some of the same dishes, with the blessing of the original group (according to the person who waited on us, who was super nice.)  If you've been to a Swiss Chalet, it's pretty similar, but nicer for sure. We both ordered quarter chicken white meat dinners, mine with poutine, his with fries. You get a choice of coleslaws as well, either vinegary (my usual favorite style) or creamy (the St Hubert style.)   The chicken was quite delicious, nicely roasted and with a good flavor. It comes with a dipping sauce much like Swiss Chalet's, with a bit of an allspice flavor.   Another thing I really liked about this place was that they have a couple of micros on tap: Port Credit brewing and Great Lakes (Ontario) Brewing at the time of this review. That's something that is really great, nice to see them being supportive of local stuff.  One thing that really blew my mind was the music. The music! It was a hilarious throwback easy listening station. A Summer Place was playing at one point. Lee and I giggled about that quite a bit.  Decor is pretty unusual as well, but I really liked the quirkiness. It had an off the wall weirdness that felt authentic to me.   I liked it so much that I decided to give it another whirl when I was on my way out of town. I decided to do the rotisserie chicken poutine, which was pretty good. It's basically the quarter chicken dinner with the added shortcut of the chicken being removed for you.  Despite a large group of French speakers being sat at the same time as me, I had prompt and friendly service.  I am definitely going to give it another visit to try brunch.  If you want some yummy comfort food that is a step up from Swiss Chalet, or you have a nostalgic desire for St Hubert's, give this place a shot, you won't be disappointed."}
{"text":"I have always loved the Q and to this day I still visit there from time to time to grab my good old quarter chicken meal with creamy coleslaw, I have since cut out the pop but everything else remains the same which is one of the main reasons why I love this place so much.  After all the years going here much of this place has remained unchanged because why fix something that ain't broke?! Sorry for the western inspired pun here but it is mildly fitting here as this place does have a casual, country design concept with a very welcoming atmosphere I would say. The location is a large one with plenty of seating and space so it's fantastic for large parties and families flock here as well as there are decent kids and senior specials. I like that the tables and booths are all spacious and comfy, although at certain peak times I will say it can get rather loud as it is a common family hot spot but still I find the experience a good one. It also has it's very own, large private parking lot which I adore and they are wheel chair accessible which I think ALL venues should be in the GTA..... preferably everywhere.  The food, as I mentioned earlier is very consistent in quality and the menu hasn't really changed all that much so you can expect your favorites to stay for a while on the menu. In comparison to swiss chalet I like this place a hundred times more as the ingredients seem to have much greater quality and the care put into the meal and it's presentation far surpasses them. The chicken is always flavorful with crispy skin and juicy meat, I always get white meat but my Dad loves the dark meat and claims it's way juicier then swiss chalet. The chicken sauce is my absolute favorite, I really can't get enough of it and drench both my chicken and my fries with it even though they both are delicious without it I still can't help it LOL! I used to love their fountain pop, it sounds a little silly cause you'd think pop is pop but when I used to drink pop like it was water I adored this place because they always had a perfect ratio of syrup vs soda water, so the pops were always bubbly and refreshing. However now that I have cut good old pop from my diet I have been trying a few of their wine selections and juices all of which have been fantastic so I'm not missing my friend so much anymore ;)  Service is impeccable here, I have always been thoroughly impressed with the variety of servers they employed there. I will admit I am not frequenting this place as often as I used to, in fact I drop in a few times a month if that now so I am not certain about the staff now however I can't see the standard dropping within the few years I haven't been a regular. I am more of a takeout girl now but I still find the service to be quite good and I do enjoy the convenient takeout and drive thru options which really accommodate everyone.   All in all I highly recommend this place if your looking for a hearty home style meal and would suggest you try this place if your looking for an alternative to Swiss Chalet"}
{"text":"When finding a place to eat with a kid..I always get nervous for the crowds and for the mess he may make.  I didn't have to worry. The waitress adored E and brought him his food so fast!!! She was patient and sweet to him. The other customers enjoyed my son's entertainment.   I had the fried chicken eggs and waffle. So delicious. We both ate every bite.  Will go back!   Mamas & Minis"}
{"text":"So, my first experience here truly sucked....well except for the food.  They have the best burgers!  The second time I went I had good service and another amazing burger!  I like their burger with a fried egg on top for breakfast and their bacon cheeseburger for dinner.  I now order their burgers for delivery every Friday night along with an order of potato munchers(look like fried stuffed jalapenos....but way better).  They are a little high priced for a burger....but once you taste them you can see why....super deliciousness wrapped in artery clogging goodness.  I think if I died with their burger next to me that I would be completely at peace:)"}
{"text":"This place is awful. I ordered the Hunters Chicken. Service is slow, people who sat down after us were served well before. Powdered mashed potatoes and overcooked chicken in a nasty sauce. Husband ordered the stuff chicken- dry nasty chicken stuffed with some awful tasting frozen spinach concoction and burnt veggies. Didn't finish my food, so disappointed, never returning. If you want to be known for Rotisserie chicken \"you have failed this city\"."}
{"text":"This is a terrible restaurant with poor service and bad food.  I went here on a weekend for brunch with my girlfriend.  We were seated and then were not attended to for quite a while.  It then took forever for the server to bring us our coffee.  My girlfriend ordered the eggs benedict and asked for spinach to be added to them... instead she got a bowl of cooked spinach.  I made the mistake of ordering a breakfast burrito, I've had better at McDonalds.  And to top things off I found the prices we're a couple bucks more than  The Grille, which is right across the street.  So if you're thinking of eating here, I'd recommend just walking across the street to The Grille... it's better anytime of the day."}
{"text":"I'm the Duchess here so I'm a regular. I appreciate that the Q Diner is expanding chicken menu but they don't properly serve chicken and/or beef fajitas. If double serving or combo for 2, you need 2 sets of toppings & a good supply of tortillas for 2 to share. They don't do this & I had to keep calling waitress over, to my frustration. Nobody sautes carrot strips with peppers, onions & tomatoes with fajita meat strips, they taste too bitter, so omit them. The beef fajitas were delicious but the grilled chicken fajitas Were dry and tasteles and there weren't enough of either for 2 people. I shouldn't have to call waitress over for additional napkins & drink refills. Service has gone downhill at Q :("}
{"text":"I was skeptical about coming to this restaurant, but with a car getting serviced at Canadian tire across the street I had little choice. My dining partner said \"if it's this busy- it can't be that bad.\"   Uh, turns out it can. This restaurant was as bad as it gets in my mind. Processed foods, churned out for the masses. The menu featured about 45 items, always a bad sign. I ordered a burger, usually a safe choice, and I was brought back instantly to my highschool cafeteria days. The burger was huge, the pancakes my dining partner ordered were huge. Huge portions sizes do not equal value if the quality is junk.  Apparently the chicken and ribs are good here but I will not be returning to check them out. My food dollars are more wisely spent elsewhere."}
{"text":"Food is good taste just like Swiss chalet I think it used to be a st Hubert or something but it's very similar I enjoyed it."}
{"text":"We went to the Q and decided to drive-thru. First of all! NEVER PUT A TRAINEE ON THE WINDOW ESPECIALLY WHEN THERE'S A LINE!!! The girl had no idea what she was doing. Theonly thing I ordered was a chicken-poutine and a eco pack. Than we had to wait 15 minutes and at the 15 minute mark the girl said \"sorry, they're just starting to make your food now\". 10 min later the girl gave us our stuff, luckily I saw the recipt attached and realized it wasn't even our order.  We went back through the drive-thru and there was still a huge line, we had to wait another 10 min and than they finally gave us our right order without any apology. I will never return! And I will tell everyone I know about my experience!"}
{"text":"We wanted to have some chicken so after reading Yelp reviews of The Q we decided to have lunch here during my break.  We went for the 2 for 1 lunch deal. The deal basically states that you have to purchase two drinks and an entree in order to get the second entree (equal or lesser value) for free. I chose the quarter leg and Naveen S. got the bbq chicken sandwich with a glass of oj and a coffee.  The quarter leg tasted hot and fresh out of the oven. However, when I looked at the bbq chicken sandwich it looked pretty dry and it was.   Overall, it was an a-ok place that we had lunch at but it wasn't anything spectacular.  PS: If you check-in on the Yelp app you'll get one free dessert. We were going to get it but we were decently full so we chose not to."}
{"text":"Love St Hubert ...oh now The Q. Oh lala love this place! Better chicken, sauce and coleslaw than other places! Here you get two sides with unlimited coleslaw either vinegar or creamy just perfect not too salty or spicy! One restaurant who has nailed food, atmosphere and service all within a great value! Xo"}
