{"text":"The little dog is a cute little space beside its big sister The Big Chill. Their specialty are little hot dogs that are steamed which has nicked named them steamies ($2). 

My boyfriend and I had a steamie each and splitted the chili cheese fries ($4). The steamies were SOOOO yummy. We got them \"all-dressed\" which was a combo of a couple things of which I only remember mustard and coleslaw. The actual hot dog meat was really juicy and soft. These are pretty small so they would make a good snack. The chili cheese fries were pretty normal, the only cool thing was that they give you a fork-esque flat piece of wood to eat it with (perhaps the long lost sibling of those flat pieces of wood you eat those little cups of ice cream with? Do you know what I'm talking about? lol).

There are also sausages that are Nathan's famous? Not totally sure what they were called but I'll be trying those next time. And there is also a vegetarian option and poutine.

The actual store does not have room for seating but there is outdoor seating that they share with The Big Chill with a wide range of options. Think wooden benches, plastic bar-style chairs, wooden beach chairs, and then mini seating for kids (so cute!).

Overall, a nice place to grab a snack and I'll definitely be coming back for more!"}
{"text":"This is not the Montreal Steamy experience.  The dog was not steamed enough.  They took the dog out of the fridge after we ordered.  Then we got served minutes later.......To be fair, it was OKish but not great.

The worse thing however is the service.  We got there and no one to be seen.  We waited and waited until someone next door in the ice cream shop cried out that they would be there soon.  We waited and waited some more.  Finally the guy came around and took our order.  I think he was in some sort of contest to see how few words he could use to get this order over with.  We were the only ones in this very little place.  Seating is either next door at ice cream place or outside.

We did get our food from the quasi mute and eat outside.

Later, we went to get ice cream and guess who almost took my ice cream order......"}
{"text":"As a Montreal ex-pat, I've experienced the crimes against poutine committed by Torontonians and Ontario in general (sauf Ottawa/NCR).  You know things are bad when real poutine-slingers have to qualify their product with the tag-line \"We use real curds!\"

When I stumbled upon The Little Dog, I jumped at the chance to sample a steamie without having to go to Oshawa.  After abandoning my wife and kid to the mobs on College Street during the Taste of Little Italy festival, I ordered two steamies, \"Aw drrresed\" and then engaged in a friendly banter with the cashier.

Soon two steamies were served up and before I even looked at it I knew something was wrong.  The bun felt too firm.  A quick peek confirmed two unwelcome facts.  One: the bun wasn't steamed!!!!  Two: they used creamy cole slaw!!!  WTF is creamy cole slaw doing on my steamie!!!

I stumble out, my body shocked by the sudden, violent drop of my food-expectation high.  I bite into my first dog and it just wasn't even close to what I had hoped would be nitrate-fuelled heaven.  Madly thinking about how I would be able to scrape the creamy cabbage from my hot dog as I head to the closest garbage bin, I managed to simply eat the wiener itself and tossed the remaining unsteamed bun and slaw.  The second one I just tossed before taking comfort in the arms of my wife and the babbling and smile of my baby girl.

If I ever go back, it'll be for a plain hot dog and only after confirming that the bun is steamed but then it's not how a steamie is supposed to be eaten..."}
{"text":"Marginal hot dog. Frozen fries. Unfriendly staff. 

Nothing innovative or delicious here.  

Soggy bun: hotdog was ready before fries, so they put the entire dressed hotdog in the steamer to keep it warm...why would they do that?!  I got a water-logged bun- GROSS!!"}
{"text":"Was planning on eating an ice-cream cone but then I saw The Little Dog. 

A Montreal steamie is 1.99$ with a lot of toppings- a small cone is like 3.50$. F that noise. 

It was as good as a little steamed hotdog should be. The dude was really bad at selling hotdogs / poutine. He seemed sort of sad about the whole hotdog slingin' industry. Next time, I'll try the bigger ones. Chicago and NYC dogs are also on the menu. Not sure what their deals are."}
{"text":"Hot dogs. Service très agréable, produits de qualité, bien situé et parfait par une nuit d'été."}
{"text":"It's all about the dog. And it always comes back to the dog. Ask Anthony Bourdain, he'll say the same thing.

This joint gives you the Montreal steamie, the Chicago 58, and the king of kings - Nathans.

They got great toppings for almost any need i.e. coney island style, detroit style, chicago style (almost chicago style, they're missing the pickled sports pepper and celery salt). Small price to pay considering.

And remember people that A TRUE DOG IS STEAMED. And thats exactly what you'll get. 

The fries are average. Just go for the dog."}
{"text":"Saltiest. Poutine. EVER.
(that's not a good thing, by the way)"}
{"text":"These dogs are awesome! 

If you are not a fan of the enormous grilled wieners that Toronto is known to serve street side, then this is the place for you! These little Montreal-style dogs come topped with slaw (amongst other condiments) which for me is all it took to take hotdogs from meh to yeah! 

The tiny take-away counter is so cute and has ample patio seating out front making this a great summertime destination."}
{"text":"Not perfect but the best you can expect in Toronto. Not steamed in the Montreal style but they do try and they give it a good shot. for $2.00 you wont be disappointed.  I will stop in here from time to time for a quick bite and will by pass Fancy Franks down the street, triple the price and can you imagine, fancy frank failed to have a Montreal classic on the menu... shame on them."}
{"text":"The steamed hot dogs get four stars but the overall experience feels more like three stars. I arrived on a Sunday night and was the only person there. This might be due to the lack of seating.

The hot dogs are surprisingly good. I think this is the first Steamed hot dog I enjoyed in Toronto. Coming from Montreal, I grew up on the delicious steamed hot dog. Little Dog's bun and hot dog were perfectly steamed and the key topping - the cole slaw was a close imitation of true \"Montreal style\". I find the cole slaw is where most Toronto steamies fall short (when you can find them). 

As people mentioned in previous reviews, the french fries are a real let down. They are cooked in some kind of acme contraption. Put the fries in the top and a minute or two later they come out the bottom. I would skip these next time, stick with the hot dogs.

The restaurant is very odd. It's located in the back of an ice cream shop. You place your order, get your food and then you try to find a seat in the ice cream parlour. They ask you to return your tray and garbage to the restaurant (I guess so the ice cream staff don't have to clean it up). I just don't get it, they should have some dedicated seating. 

I will be back again when I'm in the area again. It's not the Montreal Pool Room but probably the best in Toronto. Give it a try if you never had a steamed hotdog.

BK"}
{"text":"As an avid Montreal Steamie lover (born and raised just outside of Montreal) this really did miss the mark. I was elated walking down College one evening and seeing the advertising for Montreal style steamies outside of the shop, and I vowed to come back and give them a try.

I brought my girlfriend along a couple of weeks later who has never experienced the beautiful, melt in your mouth, flavourful masterpiece of a steamie, and I was so excited for her to try.

What we received were standard hot dogs with barely steamed buns. Although good hot dogs altogether, they were not the steamed hotdogs that I had anticipated and would much rather pay $2 to a street meat stand and get a bigger and better product. The service was mediocre and nothing to rave about.

I long for the day that someone brings the traditional Montreal steamie to Toronto. Until then, street meat it is."}
{"text":"These lil' steamed Montreal hotdogs are good. For the price, you get your bucks worth. I had a steamie combo (sounds pretty vulgar, but I have a dirty mind) for 5 bucks flat, including taxes. 

They load the dogs up with anything you want. Mustard, Chipotle Mayo, Ketchup/Catsup, Coleslaw, Relish and Pickles. Now that's what I call a solid hot dog. Albeit smaller than the ones you see sold at street vendors, the taste and flavours are awesome.

The coolest part of all, they have an automatic fryer used for their fries. It's a machine that looks like an oven and produces good Mc Cain tasting, but not greasy, fries."}
{"text":"The best in the city of Toronto, reminds me of Belle Province in Montreal. I think buns can be smaller, less bread. 2 steamies and fries $8 good deal. I walk over all the time. 

Its clean and attached to an ice cream parkour i havent tried. They have a small patio you can sit at."}
{"text":"These hot dogs are fantastic, makes the street meat taste like the crap it usually is, great service as well."}
{"text":"This place is a nice little tucked away storefront off College Street in Little Italy, attached to the side of the Big Chill Ice Cream location. 

I personally like stopping in for a $1.99 Montreal Steamie while needing a snack on my way through the area. It's the perfect sized snack in an area that actually doesn't really have any hot dog street meat vendors. If feeling more hungry upgrade to one of their full size dogs for $3.49, but personally I go for 2 of the smaller ones.

A little ketchup, relish, and their custom chipotle mayo, and you've got a winner. A winner that I will continue to stop in and partake in. See you soon for another steamie, Little Dog!"}
{"text":"Let me first start off by saying I REALLY wanted to love this place.
Ever since Steam City closed down and left a large gaping hole in my heart, I have been yearning for my Lesters fix. So when I heard Toronto was again getting a Steamie dealer I was over the moon.  Sadly I had forgotten that Toronto is not Montreal and after seeing what this city has done to the Poutine (Sacrilege!!) I should have known better.  The place itself is super cute, small walk in in the traditional Montreal style and adorned with a mish mash of pop culture trinkets but the food is a bit lackluster.  While the Lesters wiener and bun are steamed to perfection the final product is just wrong.  Instead of traditional choux the dogs are covered in creamy coleslaw which I am pretty sure is a crime against nature and the poutine is marginally better, but made with shoestring fries and coated  with sodium laden gravy which is meh.  On a positive note the curds are bang on and the server super friendly so props to that.  A  few small changes such as fresh cut double fried potatoes and REAL choux or a vinaigrette coleslaw could make this place bombtastic but for now not so much.  Bottom line  - if you've never had a real steamie before and you are looking for a snack, it's not a terrible place but if like me you are a Montreal transplant or a fan of the real deal I recommend  you take a pass."}
{"text":"Not exactly the Montreal style you hope for when you walk in and order. But it's quick, decent and a quality steamie for only $1.99. What else do you need to know?!"}
{"text":"After reading the reviews below, I guess I went on an off day. Bun not fully steamed, hot dog warm, McCain frozen fries.......really? Montreal steamed hot dogs? Um, not in a million years!
I miss Lafleurs, La Belle Province, Montreal pool Room and the hundreds of others who always serve fresh made (never frozen) fries, whose steamed dogs are always HOT and of course a fresh steamed white bread bun!

There used to be a place in Toronto called Steamies a few years ago who were almost an exact replica of the Montreal experience but sadly they no longer exist.

Save your hot dog money for a trip to Montreal for the real thing"}
{"text":"Like others who have enjoyed Montreal's classic recession food, the steamie, I too wanted to like this place. In short, twice the price but not as nice. Montreal Pool Room and La Belle Province steamies run $1 a dog. They're $1.99 here. It's not like there's a huge amount of competition in the steamie space in Toronto, of course. 

No seating but you can slam your steamies down in the attached ice cream parlor. All dressed comes with a slaw but it's a kind of creamy slaw, not like the more regular, heaped chopped cabbage over flowing the Montreal steamie. End of the day, a hot dog, no matter how you dress it, is still a dog. The Montreal steamie's appeal is price: $1 for a dog heaped with needed veggies. $2 makes the steamie less palatable, figuratively and literally. For 50 cents more you can get a jumbo street dog and load it up with onions, olives, and needed veggies Reagan style via condiments. 

Service is really friendly. I can see this place being great after bar food."}
{"text":"You can come here to get a good, solid wiener!

In the case of The Little Dog I don't think size matters. I went with the all-beef wiener. Because of it's size it doesn't fit into the buns very well as it is quite a bit longer, and has slightly more girth than the original wiener. I think I would be just as satisfied with and original wiener than it's all-beef counterpart and would have saved myself two bucks.

The place is quaint and has that hot dog stand kind of feel. The menus are done with chalkboards and there are little trinkets placed all around. There's a bright flashing sign above the awning so you can't miss this place when walk by at night, as I quickly found out.

I was there just before closing on a Tuesday night so I was the only customer. The owner(?) was friendly and after greeting me warned me that it would take 4 minutes once I ordered. Not sure if this is standard or just because I was there right before closing and he didn't have anything pre-prepared.

Go try The Little Dog's wiener. I'm sure you won't regret it."}
{"text":"Not sure what the hype is about. $2 for a steamed hot dog. The bun was of the cheap variety. The one big plus is that they have chipotle mayo, coleslaw, sauerkraut, etc. that you can ask for which helps make it a little more filling."}
{"text":"As a Montrealer living in Toronto I have been dreaming of a day when Toronto would have a true steamie restaurant. Guess I'll have to wait a little longer. 
The Buns and dogs were steamed well but that's about all that was right. Onions were cut way too large and wrong type of onion was used making the flavor too strong, the coleslaw was dry and not marinated at all. The other problem with little dog is their French fries, not at all the type of fries you'd find at a steamie restaurant and more like McDonald's or Burger King garbage fries.
I really wanted this place to be great but guess I'll just have to wait a little longer"}
