{"text":"Went here on the weekend, was not impressed.   I ordered an amber beer, and clearly was brought a pale ale. I didn't bother sending it back because our waitress seemed a little clueless overall.   The food was really bland, and the menu was pretty pathetic. A wrinkled piece of paper inside a clear folder, with very few options.   There were a number of chalkboards with specials and other messages around the bar and they all looked like a two-year old had scribbled the writing on them. The whole place was messy, dark and dated.   No need to return here."}
{"text":"I'm loathe to have my first review be a bad one, but I feel sort of compelled to write this review. On a lovely holiday Monday, after some frisbee in the park, some friends and I decided we needed some food.  The Abbey seemed to fulfill all necessary criteria.  The criteria being: patio, beer and tasty food.   Well, it had two of the three, however, those two were not enough to redeem this place, especially in light of the laughably awful service. Now, I'll admit that three of the people in our party got their food and enjoyed it.  However, two of us were not so lucky.   First we were given the wrong food.  The one other person who ordered at the same time as us (we sort of ordered in two shifts) got his food.  They took back our messed up orders, with the excuse that the computer wasn't working and thus the orders were messed up...uh okay.  Twenty minutes later we recieved the food we ordered, just as our friend was finishing his meal.  Unfortunately, my greek salad came topped with fetid feta cheese and the caesar wrap came complete with bugs squished on the lettuce.   The good news was that the food was comped.  However, it took us a little too long to pay as the debit machine phone line was being used by a disgruntled employee to complain about her employment situation and to utter expletives in that regard. Needless to say we won't go back.  There are too many awesome restaurants and patios to waste any more time there.   We did enjoy the beautiful sunshine though : )"}
{"text":"Not interested in eating here...but for a regular bar to drink at its totally great. And I like Wednesday karaoke, because you can get lots of mic time."}
{"text":"Beer here is excruciatingly expensive--$7.75 a creemoire and 5.50 for the crap ones. The food is perfectly mediocre... 1lb wings for 9.95 were lukewarm when I got them. There's a patio which is worth another star, but honestly for this location where there's a ton of good food they really ought to step up the game."}
{"text":"Don't come here to eat. Don't come here for prompt or courteous service. Come only if you want to chill out on a patio on the sun. I like their patio because it is usually empty and stays sunny into the evening, but even I would not bother showing up in the winter. There is simply nothing else to draw me to this place.  I don't go for sports or I may appreciate the televisions within. A couple of jars on the patio, and not if you are in a hurry, is the only reason to come here.  It's a good reason, though, and that is why I keep comng back."}
{"text":"The Abbey is a typical towny-bar.  Reasonable beer selection and many tv's with sports on.    You aren't there for the food and if you are you shouldn't have high expectations.  You won't get food poisoning, but you're not going to rave about the food either."}
{"text":"This is one of those places that proves that with good real estate you don't actually need to put any money into maintaining anything to keep the business going. Nothing has changed in at least the last 2 years that I've lived in the neighbourhood. The signs are peeling off the outside of the building, the inside environment is updated only with upcoming UFC event posters.  The food is mediocre at best, and the wait staff are scarce and impersonal to use kinder words.  But they do have a saving grace and the only reason Im not giving this place a 1 star review... They have a half decent selection of beer and a big patio that seats many people so does pretty well when the weather is nice, and it'll probably remain in business doing the same thing for the next 5 years at least simply because of this."}
{"text":"I was at The Abbey on June 13 2011. I wanted to try it out, we have so many times passed it when it was quiet. They have a gorgeous big patio that wasn't slammed with people... (Patio Photo's Included)   We decided to eat inside, since I wanted to take some photos for yelp and get a better idea of why this place was so poorly reviewed.   I found the food (Fish & Chips) to be delicious! Pleasantly Surprised!! They also have a Veggie Burger, but we didn't go for it...The Fish has some spice and herbs in the batter which make the fish flavorful and unique. We both (My husband and I) ordered Fish & Chips and a pint of Stella. It was well cooked... Taite said it was one of the best fish he has had in Toronto... Crunchy Batter, Flaky Fish... Photo's Included...He would give the fish a 4 1/2 out of 5 (He is a hard marker when it comes to fish)   This bar has very cold beer, a great on tap selection and a typical darker and warmer feeling that most traditional pubs have. (I took a picture of the on tap menu for those looking)   There was one gentleman running the entire show, taking orders, working the bar, making drinks for tables, and for bar patrons and serving up the tasty food. He was very polite, genuine and accurate. We got our beer in 2:36 seconds after we ordered... Pints... Good Service to say the least! Also, we got our fish in about 12 minutes... Piping hot Fish, okay hot fries... The fries are like a skinny shoe string fry with the peel on. I would have liked them to be hotter, but I am really picky about the heat of my food. (steaming hot, burn your face is right up my alley)   This place is a solid local pub, It isn't a Hipster joint where Hipsters can pretend to play dingy while getting served up gourmet something you have never heard of... It is a good bar where they are polite, to the point, efficient and don't have time to give the reach around the Hipsters want... But We liked it. There was some major damage on the ceiling near us, but we were told about it, and I didn't find that distracting at all.   The Hockey Game was playing on a Monster Screen, and on several other TVs... We will be back. They also have Karaoke, which I always like to check out karaoke...  Our Bill 2 Beer, Two Piece Fish & Chips X 2 and a soda all rang up to under $40.00 with Tax.   I like it.   The Gentleman working let me know that the patio is great when it is sunny and that they get sun until really late, Pretty Awesome, Can't wait to try that. I will review it again then. Maybe they can score a 4 next time with me..."}
{"text":"I've been coming to this pub quite a bit lately. I don't have cable TV and I am always looking for a good spot to chill and watch sports. Luckily the Abbey is a few minutes away on my bike and they always have the Blue Jays game on. Their College Street location is really accessible, and they have a very large patio that stays sunny all day.  The service has been friendly and efficient each time I've been, but it's also not been very busy, so I almost get priority service. I've ate there a few times as well. Sometimes the food is average and other times it's quite tasty. I do recommend sticking with pub fare such as burgers and nachos. In fact, the nachos are quite loaded with toppings and well-worth the price. A good rule of thumb is to maybe stick to the specials, such as burgers, wings, and quesadillas.  They have lots of beer on tap, including Stella and Guinness, so you can never go wrong with a cold pint. The patio is large but also very exposed. Would be great if they had some more hedges, plants and flowers to make things a little more organic. The inside is a little dark and poorly laid out in places, which is a shame because if you want to watch the TVs you'll have to do it inside.  I've always walked past the Abbey and wanted to pop in, but never did until recently. It definitely has a nice pub vibe on the outside, but needs some work. The location and size give it an insane amount of potential. This could very well be one of the greatest patios in the city one day. In the meantime, as long as they keep the Stella cold and the Jays game on I will keep coming.  Note: They have karaoke on Wednesdays, if that's your steez."}
{"text":"The wings are good.  They taste just like the Wheat Sheaf wings, which are my favourite.  However, eight wings and a very cold domestic bottle costs $16.50 before tip, so I'll just go to the Wheat Sheaf in the future."}
{"text":"This place is incredibly depressing and unhygenic.   I would classify this as a \"dive bar\" without the redeeming quality of decent food and some unifentifiable charm that would make you want to come back.   Upon entering the washroom there is an overwhelming fear of being confronted by a poorly camouflaged glory-hole shaped circle on the wall. The feeling of having been transported to an overused gas station toilet is amplified by the door not closing when seated (what is this, a stall for ants?) and the insulation of an eskimo outhouse which makes it feel the exact temperature as outside,  which is always lots of fun in the winter, provided you like sitting on what feels like a toilet boil made of glacial ice. The numerous requests for sexual favors crudely scrawled on the walls help help lighten the mood while taking a really depressing and uncomfortable dump.   Note to kitchen and bar staff: if you can't properly fry a chicken wing, or sufficiently melt a plate of nachos make up for it with cheaper drinks."}
{"text":"We stopped in for a victory celebration after our volleyball season finished and while the place is not much to look at, we had a very nice evening.   The food was actually really good. Between all of us we had nachos, fish and chips, chicken fingers, the abbey burger and the steak sandwich and there were no complaints in the group. I had the fish and chips and I was actually surprised at how good they were. It did take a little while for the food to come out, especially since we were the only ones there, but I feel like it was worth the wait.   There wasn't much atmosphere there that night (Monday) as the place was basically empty except for us.   I don't know that I'd make the effort to go there again, but if I was in the area and hungry I'd have no worries stopping in to get something to eat or drink."}
{"text":"This place was sparsely populated during the opening World Cup game, and seemingly empty otherwise. It's run by a family, but service is decidedly unfriendly. Ordering was an affair in patience, with painstakingly long wait times and forgotten orders the name of the day. Beer came slowly, and most of what they purported to have on tap had run dry.  Haven't been personally, but they apparently have $3 Jäger and Karaoke on Wednesdays, so if you're  into hard alcohol and awful singing, this might be the spot."}
