{"text":"Small place but awesome food, run by a Chinese family. Only drawback -- cash only-- accepted"}
{"text":"I called in a pick up order for 3 soups, and 2 orders  of dumplings. They told me the order would be ready in 20 minutes. I had to wait  45 minutes for the order. The girls who packed the order did a horrible job. They put all the sauces  inside the dumplings, and they went all over the dumplings.  They packaged all three soups in one thin plastic bag, and did mot double the bag. The bag slipped out of my hand, and I lost one soup. I called the restaurant the night i went to the restaurant to see if I could get a portion of the bill refunded, as  i spent over 40 dollars. The girls working said no could not do anything. i called the restaurant  a couple of days after and spoke with the owner.  who was very apologetic. I told her my situation  she said she would check with the girls and get back to me . She took my number, and I have still not heard from her."}
{"text":"Disappointing. Overpriced, tiny dumplings. Also, tea at a Chinese restaurant should be loose-leaved, not in tea bags!

Fortune Dumpling is still new, but could learn a few things from Qing Hua Dumplings on Lincoln."}
{"text":"I was there with my wife on a friday eve nice and clean place....not crowded for that time...not many ppl can be accommodated...but its nice

Amazing service and helpful servers....food wise its all depends what you order ..its reasonable price and fresh ...u can actually see how they make ur food.....

Except bubble tea...rest are amazing and definitely go there again


 Recommend for couples and group....too ..place is a bit small so call ahead
Quality + Quantity + Price  all fits perfectly + service = 5*"}
{"text":"Great Service and good food at the reasonable price. I really like it that you can see where they are cooking the food. 

So if you are a budget but want to have some decent dumplings downtown, give this place a try. :)"}
{"text":"We went in for lunch with some reservations based on the reviews online but were pleasantly surprised. We had quick friendly service and great food . Our order consisted of the peanut dumplings, Chinese pancake , garlic pork and the lamb and coriander dumplings. I would repeat the same again with no doubt. I do think the peanut dumplings were exceptional though and are worth a try. Happy eating!!!"}
{"text":"Jianbing pancakes tasted alright, although they are a bit too expensive in my opinion as their portions are not as big comparing to what I usually have back in China.

I'm complaining about their service here. Seriously, the waiter needs some coffee. He looked sleepy, walked like he just got out of bed, and didn't bother to refill my water."}
{"text":"So I look up from my desk and The Good Doctor (PhD, not MD) says: \"Lunch?\"
It being noon I'm good with the suggestion so after the normal round of indecisiveness we settle for \"That New-ish Dumpling Place nearby.

The place was quiet, not having gotten hit by the lunchtime so we were immediately greeted and seated by one of the chefs working the dumpling station. (Hello handmade purses of savoriness!) 

As our our orders were taken I asked for the Beef/ Coriander dumplings with a bubble tea, but was told that the tapioca (the \"bubbles\") weren't ready.  An eyebrow shot up, wondering how a bubble tea restaurant could not have their bubbles ready for the lunch crowd. On the other hand - you have to appreciate the freshness of the bubbles so I let that slide, resolved to having a St Laurent frappé (water) alongside my dumplings.

My dumplings... Chef brings me this plate of gorgeous steaming-hot dumplings and I want to dig right in but can't because The Good Doctor's order hasn't arrived. When his plate of Beef/Onion finally shows up 3 minutes later my dish is now only warm. Their sense of timing is *not* stellar, but moments later I am presented with my bubble tea, fresh off the bubble express. I'm pretty excited and quaff a couple of squidgees before turning to my meal.

I love coriander. I really really do. 

Not too hot and not too cold, these dumplings were exquisite! The full flavour of the beef and the freshness of the cilantro combined harmoniously in my mouth. Try them with the hot sauce they put out on the tables, but don't get overzealous with the stuff or you'll have your own story to write about.

Synopsis:
While the food was good their timing is a bit of a problem."}
{"text":"??????????????????????????????Montréal ! Get your authentic Chinese Dumplings on! Get some get some now. Try the Jianbing as well. Trust me. I am so good at advising where to eat tasty food."}
{"text":"So full! My sister and I stopped in for lunch today and shared a few things.
Soft tofu with green onion: a cold dish with chili oil, soy sauce, white and black sesame seeds, and green onion. Savory, spicy, a nice way to start. 
Spring rolls: classic small spring rolls, not greasy at all.
Pork and fermented cabbage dumplings (fried): wow you can tell these are home - made.  We stuffed ourselves with them because we didn't want to stop eating. 
Overall a reasonable priced lunch downtown, and we were in and out in less than an hour."}
{"text":"Great simple and tasty hand-made dumplings"}
{"text":"Came in here with a group on Sunday, for lunch after work, not what I expected. This is starch & starch heaven, not my idea of a good lunch. They specialise in   pancakes which come wrapped around 2 pieces of fried dough, and dumplings as well as, of course, bubble tea. I was not at all impressed with the pancakes nor the dill dumplings , which were simply filled with glass noodles and some chopped dill. The cabbage stuffed dumplings were a bit better, but only because there was actually SOME veggie filling. The green tea was hot and enough for 3 people.  As to the policy of opening the entry door and leaving it open on a frosty winter's day, what is that all about?? We were freezing and it was very cold outside!  Not impressed at all."}
{"text":"The one good thing, the portions are rather large here. You won't be hungry when you leave, assuming you can stomach the food, which left much to be desired.

The actual dumplings that you order are ok, I've had better, like nearby at Qing Hua. But they are not bad. If all they served was dumplings, I would probably give this 3.5-4 stars. They were hand made and were rather juicy, even the fried ones. You can watch them make it so you know its very fresh. 

However, the other dishes that they serve are not up to par. I would only order the dumplings if I ever went back. 

The restaurant itself is nice and clean. The staff is courteous and attentive. I could not recommend this over Qing Hua."}
{"text":"Small place, friendly and attentive staffs, laid back atmosphere. I love their fried dumplings! A must try as this is their speciality. The friend dumplings are crispy on the outside yet still have the soup on the inside. Not drying, not overcooked. They make it fresh here. I think this place is great for lunch or even nights where you don't want to eat so much. For how much they give you, I think the prices are reasonable."}
{"text":"Hand made dumplings. SOLD. Some kind of eggy crepe thingy to die for. SOLD. Great service. SOLD. Finally a good dumpling spot downtown on Ste-Catherine. They make their dumplings by hand and they are soft and boiling hot and don't need any additives. Just some wooden chopsticks please. Plastic ones are way too slippery for the lay person not used to using them every day. Or maybe I'm not ready to take off the training wheels yet.

The décor... well let's just say, not much of the budget went into that. I didn't care for the tables or chairs. But the service is extremely courteous with the owner never far away keeping her keen eyes on EVERYTHING that happens. 

In any case, I love having me dumplings to go. And for those who love Bubble Tea, they gots plenty of offerings as well."}
{"text":"The owner is from Tianjin, China. Their specialty is the crepe and dumplings. Ask for the crepe with spicy sauce and you won't be disappointed. If you want to do take out, the crepe and dumplings are great choices too. 
I also had their tofu dish, which is like a thick soup        It is a traditional Chinese breakfast. It is good. 
They offer the bubble tea too. I never liked those kind of drinks."}
