{"text":"Food is good, price is cheap. Definitely a new go to spot. Must try the baked pork chop. Will be going back shortly to try the dinner menu. Coffee/tea is not the best but good enough for a lunch."}
{"text":"Had lunch there today and was pleasantly surprised with the decor, portions and price.

It was clean and I found the decor very modern for an HK style cafe.

Lunch time drew crowds and a lineup, and I could see why -- combination of it being located in a business area as well as decent prices for the food. The taste is comparable to other HK style cafes. we ordered 4 dishes, and the best was the stir fried rice noodle with beef and olive leaves -- tasty and non greasy.

Would go back for lunch."}
{"text":"Just went there for lunch around 12:30pm during weekday. Need a little line up as it is not a big place, and get sit very fast.
Waitness is ok and efficient, not really expect service went it is busy. 
The choice of lunch is limited but got your order within ten minutes.
But just the cold lemon need improve."}
{"text":"Great and fast service!! Food was amazing.  Tasted delicious definitely coming back again soon"}
{"text":"I travel to Toronto on business from Chicago. I stayed in the hotel across the street, and came here because it was convenient.  The food was delicious, well prepared, and reasonably priced.  The service was very attentive. 
On my next trip, I booked at the same hotel, just so I could return to the 6 cafe, and was not disappointed! The waitress remembered me from the last time and recommended a new dish that I had not tried before.  A great experience both times!"}
{"text":"I know (only from a professional/impersonal standpoint) the son of the owner (for full disclosure--and it would not change my review). The food is very good. I didn't expect beef that would melt in your mouth; the fried rice was perfect. I didn't try the fish but my partner did and loved it. Everything we ordered, for take-out, was excellent. Everything tasted like it was cooked for you (rather than the way most restaurants serve dishes like they are cooked for hundreds). My only regret is that we did not order more. 

The food is Hong-Kong styled (at least from my recollection of Hong Kong); it tasted authentic and fresh. I would recommend this restaurant to anyone."}
{"text":"We have been here quite a few times for lunch, dinner and afternoon tea. The décor is modern and seating is comfortable.
Food- The quality is consistently very good and appealing. It is rare in Chinese restaurants
Service- The servers and owner greets you with a smile and they remember my favorites tea.
Value- It is reasonable and you get what you paid for.  Good portion size.
Parking- I never have any issue to find a parking space. In & Out is quick and easy."}
{"text":"My family and I came here for lunch. We ordered 3 dishes in total: seafood tom yum noodle, black pepper chicken rice, and chicken fried rice wrap in lotus leaf. Overall the food was OK. The black pepper chicken rice was really salty and the fried rice wrap in lotus leaf was just Yeung Chow fried rice wrap in lotus leaf. The portion size was a bit small compared to other HK cafes. 

The service definitely needs improvement. They messed up one of our order and we had to wait for like 20 mins. It seems that we were not the only one who had a messed up order. We saw several dishes going back to the kitchen from other tables. They won't refill tea unless you ask them to."}
{"text":"One of my favorites place for HK style cafe. They got good value lunch specials and an excellent selection. It is often packed at lunch times."}
{"text":"Generous portions, tasty but felt execution on some of the dishes could've been better.  

For example, my chicken steak with black pepper sauce was smothered in the gravy.  It's almost as it's using the sauce to hide \"imperfections\" (?).  It was tasty, so next time I will ask for the sauce on the side.  

Also, the spaghetti meat sauce was really wet & saucy, probably because they didn't drain the pasta.  Tasted only ok.  Latter, we can find better options elsewhere; though as mentioned, portions are generous.

Vegetarian chow mein was our fav dish, nice mix of veg on crispy noodles.

Will visit again to try other dishes."}
{"text":"3rd time at this restaurant. Today service was horrible... After ordering and sitting there for 20 mins, the waitress comes to ask us what we had ordered again...with no apology for obviously forgetting to input our order... As we sat there... I counted over 9 tables of people who came after us, who ordered and received their food before any of our food came... Not even our drinks came... I asked about our drinks and the male waiter said \"it's coming\" (that was at least 35 mins of sitting there).... So I continue to watch as ppl get their food.. Even a table who sat down 40 mins after we sat down, received their food... Seriously... Wouldn't it have made sense that you ask the kitchen to make our order first since the waitress was the one who forgot?....I kept staring at the kitchen window every so often hoping to see my meal...some waiters noticed at times and would say \"it's coming\" in a manner like I'm being impatient... So finally my husband's dish comes after 40 mins....i still have to wait another 10 mins.... Not one apology at all... Not one acknowledgment that they made a mistake.... No discount which is fine... But a simple apology should have been the minimum.... Stars are because food is good... But not if I have to sit there for almost an hour for a pork cutlet with fried egg on white rice..."}
{"text":"My experience today was quite upsetting. Food was actually pretty good for a HK style restaurant. Service, however, was horrible!! The baked pork chop rice in tomato sauce came 40minutes after we were seated. When we asked one of the server to check out the status of the dish, server was really rude and said \"we are busy, you gotta wait\" I'm sorry???? Not expecting spectacular service from a hk style restaurant, but please common courtesy at least. Don't think I'll go back again. Rather pay higher price and go to Phoenix."}
{"text":"Zero Star if I could. They deserve that for being unprofessional and liars. We waited 20mins and got our number. Next to be seated. 4 people walked right in, without hesitation, went for the only empty table  (just cleaned and suppose to be for us). They waved to a staff in the back and she nodded back. That's all! Cheating without shame. We confronted the staff in front, and she gave us a BS excuse that they just stepped out. We left. Go somewhere else with your $$ and do not encourage this type of practice."}
{"text":"This is my favourite local HK style restaurant in Markham!! Here are some of the reasons why I give this place 5 *****. 

- fast service
- really good food
- good portions
- good drinks!

I've been here 5 times and the quality of the food has met my expectations each time. I've come here with groups of 2/3 and big groups of 8/9. Some of the things I've found the best from here include:

- sesame chicken
- beef cubes
- fried vermicelli noodles
- Ribena lemon tea (must get it every time)

I would check this place out for dinner and lunch, it usually fills up but wait times aren't bad."}
{"text":"The Six Cafe is our go to restaurant in Markham for several reasons. Their food is absolutely delicious, it is authentic Chinese food and every dish is very flavourful. One of our go to dishes is their hand pulled chicken. Our 3 year old son has many many allergies, so taking him out to eat is quite difficult. Their hand pulled chicken is so delicious that our 3 year old son requested to go there for his birthday dinner. The chicken is moist and very tasty. I have recommended the Six Cafe to many of my relatives and friends and they now go there all the time. They have very good deals for lunch and they are very accommodating in meeting any requests that you may have. Their Chinese milk tea and their lemon iced tea is also very delicious. I do think they take much care in preparing their dishes and drinks, they care about customer satisfaction. I have never had a bad experience with service or food there, and will be returning again and again. They also have 2 TV's broadcasting either popular shows or games so that's a bonus. One of the best Chinese restaurants in Markham in my opinion, you will not be disappointed."}
{"text":"Went for lunch - Saturday.  There was as line up but no real problem getting seated.

This is more of a Hong Kong style cafe menu.  The prices are reasonable and the serving size was good.  Flavour was just OK.

Service was non-existent once you get your food.  Forget tea refills unless you ask for it."}
{"text":"This is a small local restaurant that has delicious authentic Chinese food for such a great price...I don't think you can find better pricing especially for the quality! It is a hidden gem in my opinion. They have the best hand shredded chicken I've ever had. They also have extremely cheap take out gui ling gao compared to pretty much everywhere and the quality is just as good. The service was good, the only thing is it is a small place. I definitely recommend this place and I would come back for sure."}
{"text":"The Six Cafe and Restaurant is tucked away in a corner of a office middle, almost unnoticeable unless you were really looking for it. If I didn't know about this from a friend, I would never have ventured here on my own.

The prices on the menu are definitely above average, priced a couple dollars more than your usual Chinese restaurant averaging around $15 a dish. The sweet and sour pork costs about 13$, with 10 pieces on the plate it comes up to over a dollar a motel; definitely not enough value on the dollar. 

As for the food quality, I argue you would find similar value at a Chinese food court in terms of flavour, more volume and at half the price! I think it speaks volumes when the complimentary soup is the most tasty thing they served among the various dishes we ordered. The milk tea, which I was told was the highlight, has a fragrant aroma but does not hold water in terms of overall flavour. Even the hot pepper oil, displayed for sale on the wall, does not hold up in terms of flavour. 

Despite the overall soothing ambiance of the establishment, I cannot provide my stamp of approval without feeling guilty of ripping off future guests. With so many Chinese establishments offering similar ware at a lower price in the area, the future does not look bright for the success of the Six Cafe and Restaurant."}
{"text":"Foods tastes good but comparative small portion with reasonable price at this area. We are served fast and sitting are comfortable."}
{"text":"Great HK style restaurant. If u r sick and tired of Richmond Court, congee queen, this is definitely a good place to go especially in lunch time they have a wide variety of selections including a drink which I found is pretty good deal for the quality of food. Feature dishes are hand shedded chickens and sesame chickens must try."}
{"text":"I had been visited twice and one time for take out from here.  All I can say is poor service.  We were there for lunch n ask for chicken on rice or noodle.  They said the chicken not ready yet.  It's lunch time!!  Fine we ordered something else.  After about 10 minutes, the waitress brought a chicken noodle to the table next to us.  We asked why you guys serve them the chicken?  The waitress answered it is because they called to reserve it! I was like.... seriously?  Customers have to order just a ??? and need to call in advance to reserve it?  You must be kidding!
After a week, we called to order for a take out lunch.  They told us the same as no chicken is ready yet! This is not making sense at all.
We went there again this week and we arrived at 4:40pm was expecting the afternoon tea menu.  We found out the afternoon tea was ended by 4:30pm.  The waitress talked to us with no smile said no more afternoon tea menu and you have to order from lunch menu!  Me n my family feels their attitude was so rude we decided to leave.  One more thing, usually if the afternoon tea menu was not serving anymore you should ask customer to order from the dinner menu not going back to the lunch menu huh? 
We decided we will not go back to this place anymore! Bad experience EACH TIME!!!! Poor service!!"}
{"text":"Great spot for dinner or lunch!
Been here twice now and enjoyed both meals.

Nice modern Chinese style cafe with both Noodle/Fried Rice dishes and Seafood/Meat/Veggie dishes for sharing.

I particularly like their oyster dishes, both the honey pepper or ginger onion flavours are good.  The hand shredded chicken is also pretty good."}
{"text":"Service
Possibly the worst service ever. I'm not saying the people here are mean, but they are so not attentive. My boyfriend got a table for 4 and was never given a menu. When we waved to get service, the waitress came in with a pen and paper and we were like...mmm, there is no menu and that's what we asked for. We looked around and noticed that other tables got their starter soup, so when we asked the same waitress for help she kinda went 'oh right'. That's so sad man. Anyhow, I came here because I read pretty positive reviews online from Yelp. One reviewer actually noted that the restaurant provides unlimited soup. I was like, that's crazy so I asked another waitress (hoping this time someone smarter could answer the question). She responded by letting out a big laugh and said she never heard of it. I'm like wow, okay. I don't really blame her for the response, but she probably could have given a more polite answer.

Food
The food was good. It came out fast and the portions were decent. The prices are not too bad, and I think they are well matched. In fact, if the dishes were $1 cheaper I would come back monthly lols (despite the bad service). I want to say that the fish we ordered at night was SUPER SUPER TENDER, and delicious. What was unfortunate was that lunch and dinner menus were totally different. I really wanted to try the spaghetti, but it was not available. Anyhow, I would say that for cafe-styled Chinese food, this one is worth a second visit."}
{"text":"Environment: 4/5 - Quite modern, mixed with rustic flare that looks like any typical interior for almost every fusion restaurants. Space is spacious and open. There are booths on the side near the windows and tables for larger groups in the middle. 

Food: 3/5 - I came here during afternoon tea time so I ordered the Pork cutlet with instant noodles and iced lemon tea. I didn't think they could fail such simple dish and drink. My pork cutlet which was supposed to be crispy was soggy because it was served with the noodles in the soup together. Other places would served the pork cutlet on the side separately to prevent it from getting soaked up in the soup. The soup for the noodles and the pork itself was tasteless. My iced lemon tea was not sweet at all but I could not add in more sweetener because the plastic cup was already concealed. My husband on the other hand, ordered their black pepper chicken rice from their regular menu. It came in a decent portion but nothing really spectacular. Overall, I'd say the food we experienced was mediocre. And with so many HK style restaurants option in the area, don't think we have a reason to come back. 

Service: 2/5 - Non-existent. The restaurant was quiet when we were there, with only 3 tables occupied. Nobody bothered to serve us, fill our drinks or clean the table until upon our requests. We also sensed a slight attitude problem from the server that took our orders."}
{"text":"The food here is very flavorful. Came for dinner with a party of 4 on a Sunday night. There was a short line but we were seated fairly quickly. We ordered the steamed shrimp fried rice, beef and broccoli, shredded chicken and a tofu dish. All was delicious and very flavorful. The tofu dish good but wasn't anything special though. I couldn't tell you the actual names on the menu because there were no pictures on the menu. I ordered by literally pointing at the Yelp pictures lol. Recommend they add pictures to their menu in the future."}
{"text":"I had a late dinner here with my mom recently.  We chose it primarily because it was across the street from our hotel (Monte Carlo Inn Toronto-Markham) but we were not disappointed.  We weren't super hungry, so we ordered 2 dishes to share.  We actually ended up with some leftovers to bring back to the hotel.

We got the Fried Garlic Rice with Shrimp ($11.95) and the Sweet and Sour Pork with Pineapple ($10.95).  I saw all the pictures on Yelp that the pork dish had blueberries in it and I was so excited to try it, but when it arrived it didn't have any blueberries and when I asked about it, the server said they're not in season.  In all fairness, the menu does not list the blueberries as being in the dish, so I guess it's just a bonus ingredient that they add when blueberries are in season.  Nonetheless, the Sweet and Sour Pork was delicious.  The pork wasn't too fatty, which is my main complaint with this dish usually.  The sauce was good; a nice balance of sweet and sour, not overpowering one way or the other.  The pineapple were fresh and not canned.  The bell peppers were tasty too.  The dish is served atop a crispy sheet, like a giant fried wonton wrapper or something like that.  My mom loved this.  

The rice was excellent.  The shrimp were a little on the small side, but there were 10 of them.  They leave the shell on though, so it was a bit of a pain to peel them.  There was lots of garlic, some masago and also lots of fried egg white.  The rice was perfectly seasoned, not too salty.  They fry the rice and then steam it briefly on a lotus leaf.  Presentation was lovely.

They did give us some complimentary soup to start.  It was totally bland and one of the worst soups I've had in my life, but it was free, so I won't count it against the rating.  I had a spoonful and that was enough for me.  

Our server was super nice.  His English was somewhat limited so communication was difficult, but he put forth a good effort.

The place is new and clean.

The restaurant is on the ground level of an office building and there aren't other restaurants around it.  I guess it caters more to the office people and maybe hotel guests (?).  There's some free parking in the office building parking lot."}
{"text":"Back to 4 stars, portions have increased and food was good this most recent check in."}
{"text":"Me and my family (7 of us in total) came here for our Chinese New Year's Eve dinner. The food was great quality and the restaurant space was not too loud or crowded. I was starving when I got there so I could not wait for the food to come! We ordered 6 dishes to share and just as my stomach had hoped, they all came within a short time! 

We got the braised tofu, ribs in ice plum sauce, sweet and sour pork, fish fillet in corn sauce, shredded chicken and oyster pancake. The ice plum sauce had a sweetness that went really well with the ribs, the only thing was the ribs were pretty fatty which I must say was not a bad thing...but the healthy-ish part me said maybe I shouldn't have too many. I thought the oyster pancakes were cooked perfectly and the eggs were nice and fluffy. I highly recommend the shredded chicken, its flavorful and juicy with just the right amount of salt! The prices were very fair for all the dishes and we had enough food for our table. I know this will become our new spot in Markham for family dinners!"}
{"text":"Visited on a few occasions for lunch during the week. All lunch dishes are under $9 and based on the few rice dishes (Yang Chow, Chicken) that I've had are good sized portions. Food is tasty, staff are quick and courteous enough and the price is right. Great overall value. I will return."}
{"text":"This is my first time here. Very generous family-size portions for $12, and the ingredients are fresh. We ordered a Cantonese Chow Mein (a standard classic for testing their menu) and a Chicken Fried Rice wrapped in Lotus Leaf for two people. First impressions: very good \"wok hei\" (??)... because you can't *not* hear that loud vent from the kitchen, but also, the quality of ingredients and its infused flavour is difficult to miss. I think tonight, I ate the greenest (in colour) broccoli of my life! The chicken in my fried rice was very well rendered; they did not cheap out on the meat. Lots of finely diced chicken with a good mix of meat and skin to make the fried rice very yummy. The rice could be more moist. I did not get any trouble with overseasoning or oily dishes like most other reviewers. 

I decided to get a iced milk tea to-go, because I didn't know when I'd be back. To my surprise they used a large bbt cup, larger than what I expected to get! (Forgot to check price, likely ~$3.75). Milk tea was a good balance of ice, tea, milk and syrup, no complaints there. Milk tea: approved. 

Clean, new decor, comfy seats. Their staff are friendly and efficient. Before I stepped inside, I already appreciated that they played official TVB tv. I also noticed and appreciated the unique tea pots and serving plates that they used. This place really gives you the HK feels :) I will definitely be back to try out their happy hour menu, my favourite meal of the day."}
{"text":"After going thru the reviews of others, my folks and I decided to give this place a try. This place is lively and definitely reminds me of all those HK restaurants. 

The venue used to Le Modern Japanese restaurant. The tables and chairs still looked about the same. So we sat down, and I already felt the air was a bit on the stuffy end. This could be an indication for improvement. However, the venue is clean and well lit plus it is very lively with lots of chatter from other patrons (signs of being HK like). 

We ordered several dishes: vermicelli with seafood, steamed rice with shrimp, veggie with two types of eggs and crispy chicken. At first we wanted a different chicken, but they didn't have the other choices in stock. To me that is a bit odd? I mean it says a few things: They don't keep stale food they prep for the day of, which is a good thing. At the same time, it's not hard to make some dishes, so that's not a good thing to me. But I would speculate their business model leans on speed and volume delivery, they will prep all the food for the day of and what's left is left. Back to the dishes. We ordered and not long after the veggie and chicken came out. Then the vermicelli and finally the rice. Veggie is about the same compare to other Chinese restaurants. The chicken gotten a bit on the oily end. But I love the vermicelli and steamed rice a lot. The latter two dishes came out piping hot. Plus the vermicelli was not oily at all, which says good things about the chef and oil control.

I may come back to this place when it is warmer, so the A/C is on and it's not as stuffy. Btw, the rating is for a 3.5 and it's all for the steamed rice and vermicelli dishes. :)"}
{"text":"The Nine o Five, The Tech, or by any other name would it not represent them better than \"The Six\" which seems a very Torontonian terminology rather than Markham.  1:30 pm weekday, parking nearly full, busy, crowded, and well designed layout makes for an excellent  first impression, especially when the TV is facing me.

Limited lunch menu options, priced reasonably, food arrives at a steady pace, drinks arrived upon request, waitress catered to non-chinese speakers well and know their tastes, so far so good.  Aside from that snot-looking thing in one of the bowls, I believe this place is \"average\".  2.5 *stars*

Pan-fried Chicken Steak w/Black Pepper on Rice $7.95 - Crispy skin, tender meat, pretty saucy with that pepper kick.  If there was a few pieces of steam veg on the side it would be a complete meal.  It was served with coffee/tea but not a soup although sometimes I don't drink the soups from other cafes simply because it's salted hot water."}
{"text":"Out of the few HK style cafes that I've tried, this one is my favourite! I'm not the biggest fan of Chinese food but I actually really enjoyed my meal here. I felt that the dishes I ordered tasted great compared to other restaurants that sell the same/similar items. I enjoyed the Fried Rice Noodles with Beef in Egg Sauce very much and would definitely order it again if I were to return. I also loved the cold HK milk tea. Delicious, affordable, and huge portions of everything! Woo!

The service sucks, as it does in most Chinese restaurants, but that's okay. It took forever to get anyone's attention. Had at least two people make eye contact with me just to walk away. The one lady with the nice big dimples was the only person to notice us when we were trying to ask for hot sauce, water, the bill, takeout boxes, etc... And she wasn't even our server. She was awesome.

P.S. When I first came in, there was a bit of a wait to get seated. Did not expect that. I asked the host if this place was cash only upon entering, and he said that they also accept debit. However, when the bill actually came, our server said it was cash only... Weird. I guess you should be sure to bring cash if you plan on visiting just in case."}
{"text":"Awesome HK style restaurant with a wide variety of food selection I especially like the hand shredded chickens and sesame chickens drinks come with take out cup easy to bring it around without spilling owner is super friendly and treat all customers like her buddies lunch special are really good deal including drink below $10 so which is definitely my top pick. Owner always maintain top quality of food and the kitchen is super clean highly recommended"}
{"text":"Summary: upscale looking restaurant offers Chinese dishes that are a bit on the small size, but full - and I mean FULL - of flavour/seasoning/sauce (which can be good... or bad)

Top Must-Get: sesame chicken
Top Regret: sesame chicken (seriously... You must get it just to see. And then you'll regret it, but getting it is worth regretting it)

Our first (and only) time to the Six cafe was as a group of 10 after a late game. Coming in at 10 pm on a Wednesday, we were seated fairly quickly.

The best way to describe the dishes here are that the food isn't bland. This is because the chefs, bless them, absolutely SMOTHER the food in seasoning.

Case in point? The sesame chicken was completely surrounded by sesame. As in, it could've been a duck, turkey, or oddly shaped lobster for all I know, because the skin was literally covered in sesame. There was possibly more sesame than chicken. It was more chicken-sesame than sesame chicken. It (unsurprisingly) tasted very sesame-y and leaned on the salty side. So if you like sesame, it's a Must-Get, and if you don't, it's not. But it was hilarious to watch come out, so you should get it anyway.

Typically, when restaurants do this, you get the impression they're hiding the fact that the meat isn't fresh or the rice/noodles are very moist - but y'know, the chicken (the actual meat/protein) part wasn't that bad: not lick your lips tender, but not super dry either.

On the other hand, the eel fried rice was not considered that popular amongst our team and was 'meh'. Our other carb-heavy dish, veggie fried noodles, was very small and also wasn't particularly appetizing, although it came out decently quick and we wolfed it down since we were so hungry.

Service was decent and it had a good vibe though. I hear the lunch menu is better - I'd probably try that next time instead of a late night dinner!"}
{"text":"Food - ***
Service - *
We were in search of another restaurant to try near home.  Decided to use Yelp and saw that this place (hidden in an office building) had pretty good ratings for a Chinese restaurant so we gave it a try.  Don't follow Google Maps as it tells you to do a U-turn on Woodbine going north.  You can enter making a left at Hooper.

We were the first ones in at 5:45pm and we were greeted by a lady, unsmiling asking if we had made reservations.  We didn't and she proceeded to take us to a long table in the middle.  She plopped some menus down and as my grandma was looking one over, muttering to herself about what type of \"dishes\" this place served, I guess the lady overheard my grandma say, \"Oh, must be Taiwanese food?\" And she snapped, \"No this is Cantonese food\".  Wow.  My grandmother was just talking to herself.  You don't need to be rude about it.  

My grandma heard her say that and just stated that she saw the Taiwanese way of saying pineapple, and A-veggies that's why she thought Taiwanese and the lady just looked at her and restated that it was Cantonese food.

Food came and we ordered a fried noodle dish which was average, asked for the sauce on the side so that the noodles wouldn't get soggy.  Noodles were a bit on the oily side though (pool of oil at the bottom of the plate).  Eggplant and ground pork dish was pretty good flavour-wise, but way too much thick sauce.  The olive, honey ribs were pretty good taste-wish, but again the sauce was so thick!  The same ribs are made at Golden Duke Restaurant and they're drier, less mucky.  The HK tea wasn't too bad.

Again, the lady's service was scary.  I didn't want to ask her for things because she just seemed so mean.  I didn't want her to snap my head off.  I even avoided asking for hot water for my baby's cereal and ended up using the cold water from his water bottle.  When I asked her for at teaspoon ???.?she snaps, \"???\" Wow.

All of the things brought to our table were put on the furthest corner!  Why?  My tea was placed all the way on the other side so I had to walk over to get it (my baby was beside me).  She saw me do this, but she brought the sugar later (after I had to ask if it was already added) and put it in that same corner!

The last thing that was disturbing was that I heard what sounded like nail clipping in the back!  Click click click... Gross.

The restaurant did fill up, but I guess the guests are used to the poor service.  Next time (if there is a next time), we may need to get the less saucy dishes."}
{"text":"Food is still good, but plates have gotten noticeably smaller. Service has gone down as well... The entire wait staff have short memories and are hard of hearing it seems. Shame."}
{"text":"Hubby and I needed something hot and quick and comforting to eat as we're both battling a cold so I decided we should try this place out. The cafe itself is located in a small plaza within the mixed use building on the corner of Woodbine Avenue and Hooper Road. The cafe is spacious yet cozy with wooden live edge style tables suitable for parties up to 8 people in the central part of the restaurant, and booths and smaller tables towards the periphery. 

The cafe features a Hong Kong style menu with lunch specials from 12-5pm and happy hour specials from 2:30-4:30pm. Specials are served with choice of coffee or HK style milk tea, or cold drinks for an additional $1.25. Dinner menu features Cantonese style cuisine. 

I ordered beef with rice noodle soup with satay sauce from the happy hour menu. The menu indicated that the soup was spicy but it was not. For $6 including HK milk tea, it made for a cheap and cheerful lunch that pretty much was enough for hubby and myself (plus a few bites of the fried rice with Singapore sauce that he ordered). His fried rice ($8.25) had a decent amount of beef in it and was generous in portion size. We ate about 1/3 of his rice and still had enough leftovers to fill a large takeout container. 

Dinner menu items are several dollars more expensive. Yang chow fried rice is $8.25 on the lunch menu but $10.95 on the dinner menu! We'll be back but most likely for lunch or afternoon snack."}
{"text":"Went for dinner before 6.  Quite quiet since post afternoon tea hours.

Ordered Cantonese stir fry dishes off dinner menu.  Sesame chicken was great.  Same with mushroom with grouper.  And black pepper beef hotpot.

All dishes under $13.  Ok portion size.  Good wokhay.  Surprised to get grouper fish at such good price.

Free starter soup.  Instead of ordering white rice.  We ordered one of the lotus leaf steamed rice.  Portion for this was small.

However everything well executed and perfectly seasoned.  Surprise such good quality at a hk cafe.

Will definitely return for lunch and pm tea.  Clean and modern."}
{"text":"I came here on a sunday afternoon for their lunch. We got the tom yum soup noodle, beef brisket curry with rice, and the eel fried rice. The tom yum soup had no tom yum flavour. To be completely honest, I didn't even know what I was eating. The noodle it came with is the thin vermicilli noodle and it was hard. The chicken pieces in the soup had no taste to it. I don't think they boiled the noodles properly. The curry beef brisket was ok, it wasn't good or bad. It was nothing special. The rice was way too hard. The eel fried rice was flavourful and had adequate amount of eel, but again the rice was too hard. I prefer softer rice, but if you like harder textured rice then this place is for you. All three meals came with a drink. Food came out hot and the place was quite clean. Prices were moderate. One thing I wanted to mention is the attitude of one particular staff. He was extremely rude and had a very impatient attitude. But other then him, all the other female staff were polite and nice. Maybe he was having a bad day. I heard their stir fry noodle dishes are better. Maybe i just ordered the wrong things."}
{"text":"Tried this Cha Chaan Teng for lunch my first dish has go to be the baked pork chop In tomato sauce if they do it well then probably the chef has the right stuff if you know what I mean.  So to me it was average it taste okay with the price point.  The other dish I tried was the fried rice in a steamer which was good.  Will come back to try the other menu items."}
{"text":"We popped into this spot after a friends recommendation and my wife and I really wanted HK afternoon tea. We had once dropped in to try a quick bite so we wanted to explore other options. The restaurant is very spacious and quiet when we got there. I ordered the Stir Fried Spaghetti with Beef and my wife ordered the Tom Yum Gong noodle. My first bite into the stir fry was inviting but my general rule for Chinese restaurants: if it tastes good but you can't pinpoint what tastes good...MSG. I found the noodles were quite hard in the center and very floury so the pleasantry wore off. The Tom Yum Gong was very tomatoey which was strange and the noodles were too soft. 
We would like to give this place and their other die she's another try, however, there are so many other options in the vicinity, I'm quite sure it might be a while before we try this place again."}
{"text":"I've been wanting to come to this place for quite some time now ever since my Uncle bought over their Shredded Chicken dish. It was very flavourful and tasted very . 

At first I thought this place would serve breakfast, lunch, and dinner so I went around 10...only to find out they open at 11. Made a second trip here at 11 (luckily I live close by) and there were only 2 people inside. But half the restaurant was quickly filled up by around 11:30. 

I order the stir fried vermicelli with salted fish and pork ($7.95) (seems like a lot of people ordered this dish?) and fried rice with chicken and shrimp wrapped in lotus leaf (8.95). 

The vermicelli was quite big (good for sharing) and tasted pretty good. The portion of the fried rice however was smaller but looked nice from being wrapped up in the lotus leaf. The taste was so-so...quite bland and there wasn't much flavour or taste to it. 

The service was okay, nothing bad but not special either. The environment was nice, however at times it can get quite loud! 

I'd definitely be back in the future to try out their other items but I'd probably stick with their stir fried noodles instead of fried rice."}
{"text":"As a vegetarian, I did not like this place. I came into this place cause I heard great things but I should have checked the menu before going in. There were no vegetarian options and they didn't seem willing to substitute anything. My friend ordered the veggie fried rice, the one thing they had and it lacked flavour. The staff was nice though!"}
{"text":"Atmosphere is above average for a HK cafe. Had afternoon tea here, prices were very reasonable. Nothing fancy but the service is prompt and friendly. The food was tasty and good for value. Would come back again."}
{"text":"Was here for a party of 7.  The table spacing is really tight.  The good came hot and it tasted pretty good.  We first ordered 6 dishes, but ended up ordering an extra dish as the portion seems a bit small.  The eel fried rice was ok, small traces of eel could be found.  The oyster dish came in 8 pieces for 25 dollars.  It was tasty.  Pictur says it all.  Liked the way they name their restaurant the 6, as an attraction to the new young generation."}
{"text":"Came here three times already. Once for dinner the other times for lunch. Affordable prices and huge portions. I always frequented Hai Tang HK style cafe on woodbine and 16th and I'm so glad this place opened up. It shares some similar items with Hai Tang, as are many HK restaurants any way, but it's more spacious, cleaner and cozier. Their Baked Pork chop in tomato sauce actually has slices of tomatoes. They don't skimp on the shrimp and other goodies in their lily leaf wrapped rice. The Tong yum goon noodle soup was more like a tong yum goon \"inspired\" noodle soup because it was lacking the spiciness, lime and shrimp flavours you typically find in a Tog yum goon. Their appetizers come in decent sizes. No all day breakfast but their lunch selection is definitely adequate. Comes with milk tea, coffee or lemon tea for free, as are other HK style cafes."}
{"text":"VENUE/AMBIANCE (3 stars)
Located underneath an office building, the nondescript exterior is easy to miss. There was sufficient parking on off peak hours when we visited on a Saturday afternoon. Large interior with terrible acoustics make for a rather noisy eating experience.

SERVICE (2 stars)
Waiters pretty much ignored us for the longest time although there were tables available. Once they set us up with menus, we were left alone for a long period of time. It took us a couple attempts to finally wave a waiter over to take our order. Seems to be understaffed or maybe just inattentive service. 

FOOD (3 stars)
Ordered a Chicken Steak with Pepper Sauce on Rice and a Vermicelli with Chicken and Fish Cake in Tom Yum Soup. The kitchen was slow and we had to wait significantly longer for the rice. The Tom Yum Soup needed more flavor and the Pepper Sauce was too salty. Decent portions were given. I did like how cold drinks (+$1) are served in take-out bubble tea cups. 

QUALITY/VALUE (4)
Price-wise, The Six is on par or cheaper than nearby Hong Kong style cafes. The location and service is also reflected in the price. 

OVERALL 
3 stars - Would return if in the area."}
{"text":"Newly open Hong Kong style cafe, ordered egg covered beef rice noodles, and black pepper sauce chicken with rice.

The \"waat dan beef noodle\" is good, egg not overcooked. The chicken is fried, good black pepper sauce.

Price is very fair, big portions.

Will come back, recommended."}
{"text":"Great service and delicious food. Big portion and reasonable price. Will definitely go back."}
{"text":"This review is for lunch only.

I ate lunches here 3 times: once with family and twice with co-workers.  I have eaten stir fried rice, stir fried noodles and noodle soup.  In all case, the portion was generous.  Two stir fries can easily feed three to four people.  Stir fry rice is particularly well made, which is a testimony of the cook's skills.  Lunch pricing is reasonable.  Food are flavourful and at times bold (stir fry rice with shrimp paste).  The cooks are not shy with condiments.  I LOVE saltiness, so I fully enjoyed my meals here.  Some may find certain selections too salty.  Do order carefully if you mind your sodium intake.  Choose something that uses steamed rice base, and you could enjoy the value here still.  Services are courteous, which is quite a pleasant surprise for a place of this price point.  

Obviously, I have already revisited a few times.  I likely will patronize again.  

Exceptional values for lunches.  Recommended."}
{"text":"Finally checked out this restaurant. We went for lunch at 12:30 on a weekday and the place was packed. I find the menu a little different from the typical HK cafe offerings. We got the Fried Rice Noodle with green beans and bean sprouts, fried curry vermicelli with pork and shrimps, and the crispy sesame chicken. Everything we had was good. The fried noodles were very flavourful and the chicken was not dry. We want to come back for the steamed sticky rice in lotus leaf. It looked really good! The disappointment about our visit is that they missed one of our orders. Hopefully that won't happen on our next visit."}
{"text":"One of the better HK Cafes around. They have lunch specials and happy hour menus. Everything is very tasty and feels a tier better than your typical HK style cafes. 

Only come for lunch but looking forward to dinner one day."}
{"text":"I first came across this little place while trying to look for something to eat before playing pool at Le Cue across the street. I was pleasantly surprised, as I did not expect too much. The food here is decently priced and the portions are fairly large. I tried the fried rice with beef and shrimp paste and now I order it every time I go. I really like their HK style milk tea as well (not too sweet, and a nice balance of tea and milk). This has become my go-to pre-pool dinner place. Definitely recommend giving it a try!"}
{"text":"It was a beautiful sunny Saturday so I decided to take my family out for dinner. Unfortunately, the sun set on our experience before we even started eating.

Food 2/5
----------
First off, we wanted to try the rice noodle w/ beef since that's our favourite at Chinese style cafes. However, when it came to ordering, they told us that they were out of rice noodles. Really? It was only 6 pm...on a Saturday...and you don't have rice noodles which is a big part of your menu? Mind blown. We also wanted to order their steam rice with shrimp but that was also unavailable. At this point, we were pretty frustrated, but we decided to still give them a try.

We ordered their sweet and sour pork. It was okay, there were some inconsistency in their batter to pork ratio. Not too big of a deal. However, there were several pieces that were just fat. Ugh!

Next up was the BBQ eel fried rice. This tasted pretty good, it was full of flavour and they had quite a bit of small pieces of eel in it. I would say this was the best dish we had. 

However, I can't say the same for their steamed fish. The fish itself was very bland, definitely needed some salt. The flavour was overpowered by the preserved vegetables on top. It wasn't worth the price in my opinion.

The final dish we ordered was the fried egg noodles w/ chicken in satay sauce. The egg noodle itself was pretty good with some crispy parts. However, for a dish that supposed to have chicken in it, there weren't much. It was more of shredded chicken than chicken pieces. The sauce was very thick and pretty salty. Overall, this dish was below my expectation of how egg noodle dishes are made.     

Service 2/5
----------
The service was just okay. We were given the menu when we sat down and they gave us a tea pot, pretty standard. But it was hard to get their attention even though it wasn't too busy when we went. Also we were seated right behind the section where the waiter was sorting the utensils, so it was pretty irritating to hear the spoons and forks hitting against each other. 

Atmosphere 3/5
----------
The cafe was pretty spacious with a modern feel. I like how they displayed jars of herbal jelly along the side where you have the option to purchase. The TV was a nice addition to the place. I would say they should consider changing some of their chairs as they were pretty rusty.

Overall, my first time experience at this cafe was pretty disappointing. Many of their popular items on their menu were unavailable, food qualify was below average, and service was just okay. Unfortunately I won't be coming back here again."}
{"text":"This is our favourite go to place for Singapore Rice noodle.  After the HK Style cafe nearby closed down, we found a replacement that's even better.  Ingredients are fresh and quality is excellent.  Staff is attentive and friendly, they provide free complementary soup for dinners.

I have tried many dishes, lots of choices on the menu.  Decor is nice and modern, atmosphere is quite loud like a typical Chinese restaurant.  We were here the other day when it was hot outside and stifling inside.  I don't think they have air conditioning, or at least not on that day."}
{"text":"Pretty hidden place along Woodbine, I wouldn't have noticed this place until someone had recommended to there to eat. The restaurants location is a bit strange part of a large business building on the main exterior level. 

Came here for dinner and lunch once. I personally enjoyed dinner more than lunch. For dinner I had gone with a large group and ordered multiple dishes and overall everything tasted pretty good. However, lunch was just very average. 

Lunch they have a ton of choices of so many dishes. Starts from 1 to 46 or 49 o_0!  I had ordered one of the most common dishes seen on Yelp which alot of people took pictures of. The taste was mediocre, slightly more bland and more goopy as I can tell they put too much corn starch in making the sauce.. There afternoon tea menu @ 2:30 is more expensive too than other places as well. 

They also forgot my drink that was included in my meal and had to ask them several times for them to give it to me. When I asked them to give me a take out cup because I had to leave one of the waitresses said \"that's an additional $2..\" So I said back to her \"hey I waited for almost 15 minutes for my drink that you couldn't get out and I am here waiting for it....\" \" Another waitress came over and gave me the cup free of charge and apologized for the wait and that the bill was lost and didn't know she was suppose to make it... 

Food is overall very average and service is Ok, except they can be quite forgetful at times the customer service is below average..."}
{"text":"This is a newly opened HK style cafe serving a plethora of noodles and rice dishes. Prices are around $7-10 for the lunch specials that come with coffee or tea. My family ordered 3 specials and they were all pretty good! The portions were generous and I liked that nothing was too over-seasoned. There is also dinner dishes that we look forward to coming back for. Overall, place was clean and service was good."}
{"text":"Pros:
Good portions
Prices are fair

Cons:
Bad acoustics
Average food

The Six is more a Chinese restaurant that doubles as a HK style cafe at lunch. Going with their namesake, the Six has a very modern feel. Word of warning, this place gets extremely loud when it's full.

When you come for lunch, you're basically only given the lunch menu.  It has a good assortment of HK style cafe dishes.  I believe you can ask for the dinner menu which has a lot more on it.  

One thing you notice immediately upon walking in is how loud this place is.  The acoustics are just horrible.  They haven't used anything to dampen sound here.  When the place is at capacity, you can barely hear the person across from you. Our youngest could not sleep at all with all the noise happening.  Thankfully, we came in during the tail end of lunch.  After about 20 minutes, the place starting emptying out.  When it was less than half full, the noise was much more bearable.  

We ordered the beef with egg sauce rice noodle and the black pepper chicken steak on rice.  The food comes out rather quickly which is nice when you're in a rush.  Going along with some of the previous reviews, the food tastes a bit over salted.  From my pics you can see that they gave me a lot of black pepper sauce.  The sauce was a little too salty and overpowered the dish a little. The portions though, are very good for the price you're paying.  

As with most lunch specials, you get a drink with your meal.  You can pay a little extra for a cold drink.  When you order a cold drink, it comes in container like you would get if you ordered a milk tea from a tea shop. It's a very good size as well so you get your value and get to take it with you should you not finish it.  

All in all, the Six is a solid entry in the neighbourhood.  If they step up their food game a little more, it will be even better."}
{"text":"First time to try this after seeing the good reviews. Place looks nice . Not a lot of choices on the menu. Ordered pomegranate ribs and beef cube in maggi sauce which both are good. The other items recommended to us like the sesame chicken and vermicelli with fish I find it nothing special. Portion is really small when each order is around $12 to $15."}
{"text":"Came here around 8:45PM on a Saturday night; the restaurant closes at 10PM.

Surprisingly, the restaurant was pretty packed for such a late time. Disappointed to find out that they did not have any chicken dishes left, nor the intestines... seems like towards the end of the day many things were not available.

We were given two menus.. one with meat/veggies dishes, the other with carbs (noodles/rice). I found it odd that they did not have a complete menu available with drinks/appetizers/other options. Amongst our party of 9, we ordered sweet & sour pork, oyster omellette, fried rice, vermicelli noodles to name a few.

We were given a bowl of soup to start (which did not have much taste... seemed like they ran low towards closing time and added some water to it).

The food overall was not bad, flavours were definitely there, just a tad greasy for my liking. Portions were good for the price.

Intrigued to come back as they have a fairly large lunch menu with combos."}
{"text":"I love the traditional cantonese style dishes this restaurant offers. The food was amazing, and so was the service."}
{"text":"This is the 3rd time visiting here and it's still as good as it was since day 1. Portions are generous and spacing is amazing. Staff is friendly and the price per food is pretty good for what you are getting. Also, the locations is really good with many parking spaces so parking isn't much of an issue here.

I ordered the chicken steak with black pepper and it was really good. Although it could use a little less sauce is all. My party ordered the pork chop on rice with eggs and beyond amazing.

Overall, I would recommend any family to go have a meal here."}
{"text":"The food is very average.  It looks like a hk style cafe but for dinner,  they only have the shared dishes.  If you want noodle or sandwiches, they only have them for lunch."}
{"text":"The taste is pretty good. The portion is not as big as many other Chinese places. I would come back."}
{"text":"My review is based on their lunch and Tea Time menu. 

The 6 Cafe is a Hong Kong style cafe and offers wide selection of rice and noodles in the lunch menu. Tea time menu has much less choices, but in general is $2 cheaper than the lunch menu. 

We ordered Guilin soup vermicelli and beef brisket soup ho fan from the Tea Time Menu, fried vermicelli with salted fish and minced pork from Lunch menu. 

I am not sure if it is because Guilin soup vermicelli is from Tea Time menu, the topping portion was very little. Since the topping and vermicelli proportion were way off, the whole dish was pretty bland. 

Beef brisket didn't taste good either, not tender enough. And the ho fan broke into pieces. 

We didn't enjoy the soup noodles at all. 

However, the fried vermicelli was much better. It was nicely cooked and not greasy/oily. I could smell the aroma from the dish. I saw the fried noodles dishes the other patrons ordered looked very nice too. 

I may come back but only order the fried rice / noodles dishes. 

Overall the service was slow and lacking but you cannot expect too much from a Hong Kong style cafe restaurant."}
{"text":"Great food great Hk style restaurant that is hard to find with reasonable price and famous must eat hand shredded chickens and sesame chickens.  Great service ."}
{"text":"My brother in law had recommended this restaurant and we enjoyed our food there! Overall the service was great, food came out in reasonable time and piping hot. Our somewhat picky kids enjoyed the food here as well. We ordered 3 items from the lunch special- beef brisket noodle soup, satay beef noodle soup, chicken wings with a side of French fries. We also ordered the beef and tomato on rice. Def will be going back to try other dishes from their menu. The lunch special comes with either hot coffee or milk tea/ lemon tea. It's extra charge to make it on ice \"cold\" but they give you the drink in a take out sealed cup! Haven't seen any other restaurant serve their cold drink option that way. So we got 2 hot milk teas and 2 cold lemon teas. Actually I think all our meals came with a drink! The owner was nice enough to offer us a free sticky rice ball stuffed with black sesame seeds dessert! So yummy!"}
{"text":"Been here twice so far, once for dinner and once for lunch.
I find the food here pretty salty in general.

Fried rice with Chicken & Pork wrapped in Lotus Leaf ($11.95)
The size of this was smaller than I expected it to be. Flavor was ok, nothing special - tasted like normal  fried rice, not like it being in the Lotus leaf added any flavor to it. 

Fried rice noodle with beef in egg sauce ($7.95)
Price was decent giving the size. Tasted good, and you can tell it had \"wok hei\". Only thing was you couldn't eat too much of it cause it was really salty!

One thing that I did like was for your lunch set meals it comes with a drink and it's an extra $1 for a cold drink, but it comes in those take out drink cups which is equivalent to the size of bubble tea so it's actually worth it unlike other locations.

In general the food here is decent, aside from the fact that I find every dish pretty salty. Their afternoon tea menu seems to be decently priced too, but I have yet to try so can't speak to the portion. Service is horrible though I must say. There is this one lady that works and is always super grumpy, rude, and full of attitude. Like I mean, if you hate your job that much why are you still there?

Side note, not the best place to go to when it's really busy. At my last visit during lunch time, the poor table beside me was missing one of their dishes. Her husband already finished eating his, and they asked for her dish multiple times but just kept getting brushed off. My boyfriend and I sat down after them but was served before them, even another table across from me that sat down after us got their food first."}
{"text":"I feel it's pricey for the type of food, however the food seems less oily and MSG which are good thumbs up for me. The price is more reasonable for lunch or afternoon tea time and that's probably the time I would visit again."}
{"text":"Had dinner here with family last weekend. We were celebrating 4 generations within the family.  The elders ordered everything on the menu and we were stuffed. The presentation of the food was nice but the taste of the food was amazing.  The service from the staff was top notch.  We will definitely be back to try other items on their menu."}
{"text":"While the food is acceptable, the noise level is not. Measured using a dB meter, every time I visit the restaurant, the noise level is at 92 dB !!!! We always had to shout. As for me three strikes and you're out, I will come back to this place again."}
{"text":"3.5 stars for this HK style cafe with a roomy interior and high ceilings. They have steamed rice on lotus leaf with tiger prawns, which is a refreshing option compared to the typical HK cafe dishes. The black pepper chicken on fried rice was good, with the chicken pre-cut which was nice. Portions are huge and prices are reasonable."}
{"text":"Lunch/Afternoon Tea Special is a 4 Star as a Hong Kong Cafe Style Restaurant
Dinner is a 2.5 Star as a Chinese Restaurant

The menu for dinner is totally different than lunch/afternoon tea. So really depends when you are going, your experience would be totally different! As I have been to both, I would said The Six Cafe and Restaurant is a 3 star experience overall. 

The Good: Lunch menu has the usual Hong Kong Cafe offerings. Excellent selection and big portion. Their stir fried noodles are excellent! Really good wok hay, Highly recommended!

The Excellent: Service is friendly and efficient! Waitress makes good recommendations.

The Bad: Dinner was meh. The 3 dish we ordered were really oily and over seasoned. I eat out a lot and I am used to oily and salty food but this is another level! 

So-So: The restaurant has a really high noise level when full house. I have a headache just eating here! Come when it is not busy, you will have a totally different experience.

I will be back before 5:30 pm for their Hong Kong Style Cafe food. As it is definitely one of the better ones in the area. But for dinner, there are so many other choices and it would be a pass!"}
