{"text":"I've been here twice, for both dinner and lunch, and had a great experience both times. For dinner I had the vegan burrito and it was great.  Fresh and tasty and refreshingly different. My husband had a quinoa taco salad (also vegan) and it was to-die-for.  

For lunch I had a grilled sandwich and coffee, also both delicious and reasonably priced. 

Aside from the food, my favourite things about this place are definitely the service, which was awesome, the fact that they have plenty of vegan options, and the beer and drink selection. The space itself is also very cool and they have dance party nights that look like they would be a lot of fun. 

I will definitely return."}
{"text":"Had the burger. Flavourful and filling without being a drippy mess. Cool decor, great music selection, and the service was spot on."}
{"text":"We showed up to an empty restaurant at 11 am with a reservation for 7 people. Our food took well over an hour after ordering to arrive, with another table arriving after us and eating before us. 

When the food finally arrived, it was fairly mediocre - the skillet meals looked great, but the other breakfast plates failed to impress. Limp, half-cooked hashbrowns, overdone bacon, and the vegan benny was relatively tasteless. The biscuits and gravy is $14 and consists of two biscuits without a side, which seems steep.

The service was friendly, but nobody acknowledged the fact that our meals took forever.  Seeing as the service took so long that one of our party had to ask for her meal to be expedited so she could make it in time for her movie at 1 pm (2 hours after we arrived), it seems like they could have easily comped her coffee or the like. I think The Steady has recently introduced breakfast, so maybe they are still working out the kinks. This is a business in my neighbourhood that I want to patronize, but I don't think I'll be going back there for breakfast anytime soon."}
{"text":"I was super excited to try out The Steady as I had walked past it quite a few times and liked the look of the menu which appeared to adventurously deviate from the regular Eggs Benny brunch formula that so many cafes follow. 

The Southern Skillet caught my eye- \"Fresh Spinach, Breakfast Sausage, Fire-Roasted Bell Peppers, Onions, Mushrooms, Grape Tomatoes on a bed of Golden Hashbrowns, Topped with Cheese and 2 Fried Eggs Cooked the Way You Like 'em\". The overall concept of the dish sounds amazing but I was sorely disappointed as a result of the following- the breakfast sausage was so bland and I felt was though it was just there to add some meaty texture to the dish. Minimal flavour was also an issue with the cheese but perhaps I am more used to a sharper cheddar. The hashbrowns weren't so golden and I think they could have been pan fried for a few minutes more. The scrambled eggs were well cooked. A few bites in, I ended up asking Keaton for ketchup and it was unfortunate that I had to rely on ketchup and hot sauce to add flavour to the meal rather than compliment it. 

The mocha I ordered was tasty and I am willing to give this place another try as their sweet breakfast options do sound amazing."}
{"text":"I've been to this place more than a few times now and each time I've never been disappointed. 

The brunch is fantastic and full of flavor. I am a basic person so I usually order the \"this or that\" breakfast and man, the hasbrowns are the best I've ever had. This is saying a lot because usually a basic breakfast is just that, basic and this was not. 

The service was also nothing short of awesome. 

I ordered donuts as an appetizer. Try the donuts. Actually, just try one and if you say you don't want more, you're a liar."}
{"text":"Finally managed to go here for brunch. And it did not disappoint. Plenty of vegan and gluten-free options (with a couple being in both categories) - including the only vegan donuts in the city that are also gf. Sadly they had just sold out of the donuts when we got around to ordering. Three of us had the vegan egg benny (mine on a tostada instead of the bun to de-glutenify it), and one person had the vegan banana foster waffle. Delicious food all around. Standard brunch pricing (vegan benny was $14), good portions.

Great atmosphere - pleasant music, loads of room between tables, pretty chill all around. Great service - very friendly and helpful. They seem accommodating as well in making substitutions, which is always incredibly pleasant and welcome.

Bathrooms could be cleaned more frequently. They were fine, but there was paper all over the floor. A sweep here and there would up the place for sure."}
{"text":"Let me start by saying that I love this place and am going to have to try to make it out to Bloordale more often!

1st visit: I first visited The Steady Cafe for brunch last fall with a large group (10+? people).  I started off with the Southern Sinner ($9), which unfortunately took longer than I would have liked to arrive.  But when I tasted it-yum!  It tastes exactly as described (sweet tea, booze, and coconuts).  I've since tried two cocktails and the Southern Sinner is my favourite.

I also ordered the Collard Stuffed Cornbread Waffle with Chipotle Maple Syrup ($13) and added a side of sausage (because I wanted a dose of protein).  One thing that annoyed me a bit was that the menu said that fruit was included on the side but the waitress didn't bring it out.  When I asked about it, she thought that I was mistaken but later did bring the fruit out for me once she realized the error.  I appreciate that she was nice about it.  Another downside was that the sausage was sort of bland.  I had high expectations since I believe their sausage is homemade but I didn't really enjoy it.  The waffle was really good and very large.

I also ordered the OMG Sugar & Cinnamon Donuts ($6) and I really enjoyed these!  I wished that they were more moist but the coconut cream made up for it!  The cream had a mild coconutty sweetness to it and was at a somewhat cool temp which I really liked.  

Overall, for this visit, the service was slow but to be fair, I was part of a large group.  At least the service was friendly.

2nd visit: I visited again this past New Year's Day for brunch in a smaller group. I ordered the Southern Sinner again and found it a bit weaker than what I remembered but tasty nonetheless.

I also ordered the Skillet ($13) this time because I had sampled a friend's plate during my first visit and remember wishing that I had ordered it instead of the waffle!  The Skillet didn't disappoint - a nice mishmash of spinach, sausage, tomatoes, eggs, cheese atop hashbrowns brought out in a piping hot skillet!  This definitely gives alot of bang for your buck because it's tasty, hearty, and very filling.  I was also pleased because the sausage was more flavourful than last time.  Perhaps it's just that there was enough salt this time. Still it was a huge improvement.

Service was friendly as usual, which was more impressive considering our server had worked late the night before for New Year's Eve!

3rd visit: I recently went with a friend to try the new dinner menu which is VERY well-priced.  I made a change from my usual Southern Sinner and went with the Forbidden Fruit ($10) to start.  It's not my favourite - I found it to be bland.  Next time, I plan to try the Dirty Jolene (with donut liquer!) or I can go with ol' reliable - the Southern Sinner.

For my main, I started out with the Enchiladas ($6). I LOVED these!  There were 3 smallish chicken enchiladas with a side of cumin sour cream.  I would say that they were mildly spiced but still very tasty.  I loved the seasoning of the chicken and the cumin sour cream took it over the top for me!  I have never thought of \"spiking\" sour cream with cumin but I may give it a try at home.  I think that this is a very economical dish - tasty and filling.  My friend ordered the Tequila Pine Burgerette ($7) and I thought it looked pretty small.  I had a taste of the burger itself and wasn't wowed - but keep in mind that I didn't really taste the slaw or mayo that was part of it.

Service was friendly as usual!

On another note, the washrooms are clean but they look like high school washrooms and they REALLY need to get one of the stall doors fixed.  Overall, I won't let this deter me and can't wait to return for dinner!!

Final note: Go to The Steady now!  For brunch and dinner!"}
{"text":"My favourite weekend brunch spot in the neighbourhood. Pricey but worth a visit every now and again"}
{"text":"By far the best vegan donut (and probably the best donut) I've ever had. They far outshine every other vegan donut in this city! I also love that this place has vegan brunch options as well as meat options - I don't feel guilty bringing my non-vegan friends here. I've had better vegan \"egg\" dishes but the vegan eggs benny was still quite tasty."}
{"text":"I am writing this review because we came here for brunch based on a good review from what I consider to be a reputable source, a review I now find baffling. 

The service was efficient and polite, and there was no wait for a table but the food was really, really sub-par. We had the Biscuits and Gravy and the Southern Skillet and found them both very tasteless and under-seasoned. The ingredients did not seem to be of a very high quality and the portions were less than generous for the price also. 

Like most people who live in Toronto I have been to a lot of brunch spots and this one does not hold up. 

I don't know if maybe the vegan and veggie options are the real draw here or if it was just an off day but based on my experience I would definitely not return here for brunch and I cannot recommend it."}
{"text":"Horrible. I went here recently for brunch and I left feeling like I could have stayed at home and/or longing to go somewhere else for more food. Vegan options were lacking. The vegan eggs benny was gross and a very small portion. The baked french toast was good at first, but tasted worse with every bite. I don't have much of a sweet tooth, so opinions on it may vary. It was also very cold inside and the bathroom only had cold water and no paper towels. The service was very, very slow. When asked how the food was we replied saying we were disatifised and the server just said \"Ok..\" and walked away. The other server also didn't bother to ask me why I only ate one quarter of my plate. I do not recommend this place at all. Go eat across street at Hogtown Vegan."}
{"text":"Yes this place is the best! I've only been here for an impromtu dance party but I immedeatly loved this place. The back room is perfect for an intimate party. The decore is the cutest too. My favourite part was their fake christmas-like palm trees, i must get my hands on something like that. It brings a whole new meaning to christmas in july. 

The staff was also so nice! I've been to so many bars where the bartenders aren't the friendlist( of course I understand what they have to go through most of the time) but here they were so friendly :)

My next step is to go and try their brunch that I keep hearing great things about. 
What a cool place, dancing and great food :)

Love it!"}
{"text":"This is a cute spot. Came in here on a Friday night after Nazareth/Drift were full, tired from a week of work and desperate for something to eat. The cocktail menu looks really promising - tempted to get something but opted for a lot of water instead. My partner and I ordered 4 tapas style dishes and while they sounded really good, some stuff (ribs, pork) came back a bit too charred for our liking.  Good flavours, but nothing you can't make at home with some basic ingredients. Overall we were not disappointed but not overly enthused. Will probably come back to try out the brunch menu since that may be their thing!"}
{"text":"After visiting The Steady twice, I am sad to have to give it a 2 star review based on service. On both occasions I visited for drinks with friends on a Friday or Saturday night. After being seated by staff, my friends and I waited 20 minutes before our drink order was taken after asking for service. It was not overly busy on either occasion. After we got our drinks service continued to be poor. Went back the second time hoping for a better experience. Want to support this independent establishment with a good looking menu, but after these two unpleasant experiences I won't be giving it a third try."}
{"text":"Wonderful brunch (lots of gluten free and vegan options), very tasty coffee and a cool and alternative vibe. The service was slow - my coffee came fast but the food took a while. But hey, who is in a rush on Saturday morning anyway? LGBT community seems to be regular customers. I will  definitely return for brunch and also want to check out their evening events."}
{"text":"This place feels like somewhere Elvis would go for a hungover breakfast the morning after a show. There's a huge flamingo by the front window, flamingo wallpaper, white lights strung up over the ceiling, pastel coloured paint on the wall, a case of pink glazed donuts by the front (vegan and made fresh) and an ENORMOUS and retro looking industrial grade coffee maker (they don't have drop coffee, just Americanos). You can either eat in the front which has a hot pink bench running along one wall and a retro cafe feel or you can eat in the back on the dance floor at one of the many tables.

As for food there are vegan and meat options. I opted for the classic breakfast with two eggs, hash browns, bacon, and greens. I ordered the eggs over medium and hallelujah they came over medium. Coffee refills were $1 and something but the one Americano was so strong I didn't need any more coffee. No toast came with the meal but the hash browns were a large portion and crispy so I didn't miss the toast. 

Service was great. The food took a while to come out so our server gave us a free donut. It had just been made so it was so soft, extremely sweet and had a slight cinnamon taste. It was delicious, didn't taste vegan. It reminded me of a beaver tail. The day we went it had a pink glaze and was called the \"Cuba Libre\" donut, I think probably because Fidel Castro had died that morning."}
{"text":"I have been to this bar many many a times. 
Great beer selection. 
Great bartender (girl).
Asshat owner. Seriously worst service and attitude ever. At first I thought he just got away with it, now I know why. There's only one way you can keep a job and be that bad at your job, and it's owning the place."}
{"text":"Great food I had the chicken and avocado enchiladas and they were delicious and filling. They have amazing service my drink was never empty. They host really fun events in the evening and have really good fun DJs playing at them. The Steady is a great addition to the neighbourhood and ill def be headed there as often as possible!!!"}
{"text":"Went here with my fiance for brunch on a Saturday morning at 10:30am recently. When we arrived there were only a few other tables being used, but it got progressively fuller as the time went on.

I had the special that day, which was a Miami inspired breakfast burrito. Overall, I'd say my meal was a 4 out of 5 and tasted just delicious. I'm not sure why it's served with \"salad\" (aka lettuce...which seems to be the thing to put beside brunch and call it salad.) But the burrito was so good, I didn't really care about what was beside it.

My fiance had the normal breakfast, you know, 2 eggs, hash browns and sausage. It wasn't really that much of a standout, and she found that the sausage was SUPER full of rosemary, so if you're not into that I'd say get the bacon.

Our service was pretty good, however we did see two tables come in, sit for 15-20 mins then get up and leave. There was one server when we arrived, and the second server didn't get there until 11:30 or so when we left...I guess they needed him earlier.

Overall, this place was good, and if someone wanted to go there again I wouldn't say no. However, in a city where you can find a well executed brunch with regular frequency, The Steady was good but not standout."}
{"text":"The Steady is pretty awesome. I had been watching the restaurant for a while, and had it on my \"to check out\" list, and as soon as I heard they launched a brunch menu, I could wait no longer! 

They take reservations for brunch (more awesomeness points,) so I took advantage of this by bringing in a giant party of 16 to test out the brunch menu! They had no problems accommodating this, and set up two large tables in the back facing each other so our large group was able to stay in the same area.

If you're looking for some hair of the dog, they have a pretty awesome and creative brunch cocktail menu. I didn't try one myself, but I heard some very good things from my fellow dining companions that did try one.

The Steady has a really alternative vibe (which I love,) and the servers and cooks really emulate that vibe also. While our servers were super friendly, service did leave a little something to be desired (could check in on us more, food and drinks were very slow, even for a group of this size) Note: no splitting bills here.

The food is amaaaaaaaaaazing. LOTS of options for meat lovers, vegans, and gluten intolerant people alike. The \"This & That\" breakfast, that seems really simple, but consists of lots of breakfast staple options (eggs, bacon or sausage, biscuit or hashbrows, fruit or greens, etc.) and had, by far, the best scrambled eggs I have ever had the pleasure of consuming in my life. They were cooked perfectly, and seasoned sooo well. My description just doesn't do them justice. I don't know if they slip drugs into those eggs because they are addictive as heck, but trust me, try them. My boyfriend ended up ordering an extra side of 5 eggs because they were so good.

I had the red velvet pancakes that came with a coconut sauce, and they were quite yummy. A HUGE portion size, I didn't finish more than about a quarter of my giant stack. While good, they can get a bit one-note if you are eating the entire plate. I suggest getting a side of something or sharing the pancakes with a friend.

Check out the calendar on their website - they hold  a lot of cool events in the evenings.

Anyway, had a fantastic time here, and really, just can't wait to come back. What a gem."}
{"text":"Omg amateur hour. One bartender for about a hundred + people. Ridiculous line up. They don't know what they're doing. Otherwise an awesome high school party."}
{"text":"Great service, cool ambience, well priced food! Would definitely go back. The hash browns were amazing!"}
{"text":"No complaints here. Nice classic trashy place turned nice with just enough of a clean up and just enough old and dated look to make one happy. We sat in the front smaller section. There's a bigger space in the back which looks like it can host parties.

Staff was super nice. They have lots of vegan options. I had the tofu mash. My friend had the vegan eggs benie. We were both happy. She also had a mimosa for $6. 

They have vegan doughnuts. Today was coconut. Absolutely delicious. Well worth the $3!

Located on bloor around dovercourt, it's easy to get to by bike or subway."}
{"text":"Uh..I'm so sad I didn't know about this place sooner! I went here for brunch and loved it. Tons of veg and vegan options. And they make a good americano (a must!).

I had the vegan eggs benedict and it was quite good. I would have preferred that it came with potatoes on the side but at least I didn't leave brunch feeling crazy full and sluggish as is usually the case after brunch out on a Sunday.

It didn't seem that busy for a Sunday brunch, so maybe not too many people know of this place? Such a shame."}
{"text":"Decor is super cute but the food is hit or miss (some is really good and some is really bad) but the service is TERRIBLE. It's so insanely slow and the servers seem so out of it/they just don't care at all. There's so many other great breakfast places in the city so I won't be coming back."}
{"text":"From the outside you may not think this restaurant has great brunch or is super gluten and vegan friendly but it is. A pleasant surprise and not super busy on a Saturday morning."}
{"text":"This place is an example of one I wanted to work out - I wanted to give a great review to - and yet here I am, giving it 2 stars.  We were visiting Toronto for the weekend and spotted this place and menu by walking by.  It was a Saturday night, and the place was closed.  However, we noticed that they serve a Vegan Benny!  We were staying in the entertainment district, but we made plans to come back to this neighborhood in the morning before we hit the road.  After all, that unique option is probably worth it.

We arrived at 10 am (1 hr after their posted hours said they were open), and it looked like we were the first ones in the door.  The server told us that they just opened and we can sit anywhere.  The place has a cool look - very similar to the old school city diners.  

We both ordered a cup of coffee, a Vegan Benny, and two of their popular vegan donuts.  Right away, we were told that the donuts haven't been made and that it will be a while.  So, we understood and just ordered the meals.  As a few more tables arrived, we continued to wait.  As we waited, we drank our coffee (which was a damn fine cup of coffee) - but there weren't free refills.  The server made one cup at a time, and there'd be an additional charge for a refill.  It actually came as quite a shock, because diners that look like this (or represent themselves like this) is classic Americana, where an aging man can still drink an entire pot of black coffee as the world passes him by.  But I couldn't.  Instead, we continued to wait.  The Vegan Benny arrived at our table 50 minutes later.  We waited 50 minutes in a diner for our brunch.  From what I observed, so did many other tables.  

I'm going to try and separate the food's end result from the experience.
Honestly, the Vegan Benny tasted good.  It was a unique item, done pretty well, and I'd probably like to eat something like that again.  Meanwhile, the fresh fruit on the side was about 3 pieces of melon.  So in short, the brunch was small.  Very small.  And we waited forever for this, without being offered an apology or a second cup of coffee!  We paid, and we left.  We were walking out the door around 11:20 am - which was the exact time the server was writing up the sidewalk chalkboard sign (2.5 hrs after their posted hrs state they're open), advertising their vegan donut special.  

Maybe they do open at 10 am.  Maybe it was the cook's first day on the job.  Maybe the server has never socialized with other human beings.  It could've just been a very bad shift on this one specific day.  But I probably won't be back to find out if it has more to offer."}
{"text":"Not only do they have my favourite Niagara Falls beer (Silversmith black lager), they offer vegan options as well as meat. Now both my boyfriend and I can enjoy dinner easily. Try the vegan salad it's amazing!
After we went once we found ourselves back twice more in a week.
So glad we stumbled on this this place."}
{"text":"Holy cannoli this place is cute.
Pink flamingo wallpaper, pastels everywhere, an image of Bowie juxtaposed beside an illustration of a unicorn sleeping between two hunks of bread. Be still my twee hipster heart.
We went for brunch this weekend and got the full experience- food, booze and donuts.

While I wasn't really moved by the biscuits and gravy (I'm tainted by exceptional southern food + the biscuits were soggy) my companions were blown away by the teddy and the vegan benny. As well, as much as I'm not much of a cake donut person, the vegan donuts (adorned with unrelenting sprinkles) were also very good.

Service was also awesome. Ya'll should go."}
