{"text":"If you like over priced food, and no atmosphere, this is the place for you. Little pricier than Earls but no where near the calibre of food or service. Sorry folks going to have to get your pricing in order with other pub grub in the area."}
{"text":"After a long day of helping mother dearest clean out her garage, boyfriend and i decided to go out for dinner. We were going to go to the rock.. and as most of you know by my review of the one in Red Deer,  I was pretty hell bent of going to it. Sadly it was full of kids and the wait was really long, so we decided to go to the blind monk. 

There was only one bartender on who was serving the entire restaurant and one cook. 

We ordered the calamari to start. It  took much longer to get it then it should have. Although it was really good, waiting for it seemed like an eternity.

Boyfriend ordered the nacho pizza and asked for it to be turned into a calzone. When it came out it was almost the size of a foot ball, HUGE! He liked it, ate the whole thing and had no complaints. 

I had the steak sandwich with a side of caesar, everything was great beside the mound of onions that came on top and the fact that my steak had no seasoning on it. 

Full and satisfied we left. Will return there at some point when we decide to leave the downtown bubble again and go that far north."}
{"text":"Lordy, Lordy where to begin...
We wanted to try this place out as we had seen on-line that almost, if not every night of the week, they have good food and drink specials.
We missed going downtown last night for wing night and had a craving so thought we would try this place out close to home.
Blind Monk is like a pub wanting to be a restaurant. Or vice versa. With a lot of TVs. Within the Royal Oak area and no doubt the high rent, it seems they ran out of money for decent low tables and chairs. I was glad to get out of there in the end - the uncomfortableness of the seats and the food were the reasons we left early.
It was Taco Thursday night so we ordered 1 each of those (soft shells, chicken and beef - chicken was better). Not too bad at $1.99 each.
The wings were a disaster. The tiniest things (I refuse to call them real wings - no bird or otherwise could get off the ground with these things) They were TEENY and dry with the sauce (honey garlic) just barely there drizzled on. Hubby got the lemon pepper wings - he had no real comment and stayed quiet which means they were bad. The carrots were the best things on the plate!
The Corona was cold and a deal on Thursdays for $4.25 a bottle but was only here long enough to have 1.
The place was not very busy but there were some 'regulars' at the bar that I pray to God were not driving home.
The service was OK. It was slow going to get our food but the waitress was friendly enough and it is not her fault nor the cooks' that the owner here seemingly buys the worst wings money can buy. ($24 for 2 small orders)
The menu is extensive and I am a tad curious about how the pizza would be... if I were meeting people here as the chosen destination I would most likely stick to drinks.
We left this \"pub\" not satisfied and scooted over the Smashburger 2 doors down to bring home a couple of chicken sandwiches."}
{"text":"I know a guy that will only eat in two restaurants - this one and Earls.  So I figure,  it's close to my house why not give it a try?  (I actually have given it 4)

First try -  my Alfredo sauce was bland, congealed and greasy.   I didn't even finish half.  Assumed it was an off day so I tried it again. 
Second try - brunch - equivalent to food at Denny's but slower.  Fiance liked his food better so it inspired a third trip.
Third try - brunch again.  This time my fiance was disappointed and my food was meh.  We resolved it not a food place for us
Fourth try - drinks ... and it's pretty hard to go wrong with a couple drinks.

This is our closest place to drink and karaokes and I think we'd like to check out the later of that sometime.  I wouldn't eat here - but I would say that of a lot of watering holes.

Review 2 of 30 in Yelp's 30 Day Challenge"}
{"text":"The food is BAD! Hamburgers are either burnt to a crisp or raw.  The fries seem like they are from the day before.  Anything you order has no flavor or seasoning.  The cooks should take a culinary course.

The waitress' are rude, slow and only want their tip.  

The owner should give every person a spare pair of pants, cuz you'll probably crap 'em on the way home from the bad food.

He seems clueless about the problems of the place and I bet he loves the food."}
{"text":"Used to be a great spot to have a pint, eat some unique food and play some Golden Tee....it's gone down hill with some management changes. It's walking distance so still make the occasional trek but feel guilty afterwards for dropping any $$$ there. Too bad as it once was pretty good."}
