{"text":"Found this gem on Ritual while browsing for breakfast places nearby last week. On this special day they had an omelette available inside a buttery delysees croissant. However, I have not been able to find this available any other day on my Ritual app since. Hopefully I can solve this mystery and be reunited with what was the most delicious breakfast pastry I have ever had."}
{"text":"One of my favourite coffee shops in the area. Definitely has that indie feel with the way it is decorated. I do feel they could work on it a bit more. It's a little discombobulated.

All that being said, amazing customer service. I've had a couple baristas behind the counter and they were so warm and friendly. Solid lattes, americanos and I think I had the cortado last time. 

It's surrounded by several big competitors. I'm happy to spend my money here just because I do like supporting the little guy. It's got a very chill vibe.

I'm not sure what else to tell you. There's not much in the way of extras to buy. I think they could up their offerings in that area. I was craving something but they didn't have much to offer. 

Not much seating in the cafe itself but adjacent to spot itself is a seating area. I believe it must be shared with the people that lease or rent the spaces upstairs."}
{"text":"Super friendly service and cool urban feel. One of the best lattes I've ever had in Toronto!"}
{"text":"The Independent (without an E?) coffee shop took over the old Sense Appeal, and has new ownership, though the decor looks the exact same except they moved the sugar to the opposite side, replacing it with cute artisan-made soap, and they've added some geek figurines on a shelf at the window.

In the summer they didn't have an ice machine so they didn't serve iced coffee or cold brew or anything cold. I asked if they were getting one and the guy said maybe next year. 

The London fog is pretty good. 

The chai latte is terrible. There were bits of tea in it, so there was definitely some added texture. It didn't have much flavour, so what it lacked in flavour it made up for in solids and texture? That's not really my (tea) bag. I ended up throwing half of it out. 

The flat white was pretty good. 

The coffee lids are red, so that's kinda cool. 

They sell Delysée croissants (the mini croissant sandwiches with eggs). I love those things, that place is the best. 

There's a guy who is there often and he is somewhat curt and doesn't like answering questions. He's not mean or rude in any way, just socially he's quite brief and doesn't seem welcoming of any questions or conversation. Baristas are friendlier at other coffee shops in the area, including Dark Horse, Quantum, and Early Bird (a bit farther), but if you don't have any questions and just need an espresso-based beverage, you'll be happy with the results. 

Overall I would avoid the chai latte, but I would go back for a London fog, latte, or flat white when in the area if I wanted a change from Dark Horse or Quantum."}
{"text":"Cute rustic/industrial vibe cafe with a small menu. They have a small assortment of coffee, tea, specialty drinks, and a few baked goods. I ordered a matcha latte with almond milk ($4.50, they didn't charge extra for non dairy milk). They don't add sugar or sweeteners to it, which I like. I could really taste the strong matcha flavor!

They also have a loyalty program where after 5 purchases you get a drink on the house and 15% off breakfast."}
{"text":"I love this place! I came across this place a few weeks ago and I can't get enough. This place has become my go-to cafe whenever I'm in the area. The establishment is a nice little cafe tucked away at the bottom of a building filled with local startups. The place gives off rustic, hip, and friendly vibes, and the baristas are very casual. There is adequate space to sit here and lots of natural lighting and nice decor.

The last time I was here, the barista working was super friendly and helped my friends and I in selecting what to order. Their teas are very aromatic - I really liked the hibiscus tea. I tried the Ethiopian blend of coffee and also a regular latte. Good. Stuff. I'm not the biggest coffee connoisseur but I very much enjoyed the latte. 

Their food items are very tasty too - I tried the almond croissant/pastry (sooo good!) and also their chia seed pudding. I am not exaggerating, but the chia seed pudding is by far THE BEST I've ever had. It had a nice vanilla / almond / cardamom flavour with coconut shavings, fruit, and granola. Unlike other chia seed puddings, this one is very thick and not watery. For about $8-9 dollars, the pudding is definitely worth the price and I HIGHLY RECOMMEND it. 

I'm a huge fan of this place and I've become a regular whenever I'm in the area!"}
