{"text":"Horrible service the old hag working could not have been more inconvenienced by our occupying her establishment.  Not recommended"}
{"text":"My wife and I showed up at the Heights at about 9:30 this evening. The inside of the bar was full, so we went outside to sit. As we walked outside, we passed the server who was taking care of the patrons on the patio. So, we sat down, expecting her to come by and take our drink order. Instead, she went back inside, then came back outside a few minutes later. However, she ignored us again and went back inside. I was about to get up to go inside and just get our drinks at the bar, but I saw the server come outside again to bring food to the table right next to us. She served the food, then unbelievably turned around to go back inside.........we were ignored for about 10-15 minutes and decided to go to another establishment in the area where we received great service."}
{"text":"We have gone there a couple times because it is a bar close to us. I feel like because we are not regulars we are not treated well. The bar lacks a young crowd because of how we are treated once we get there. The manager gets paid to play darts and eat not help the customers and foster the business they can bring."}
{"text":"Place is a great local watering hole perfect for pre gaming before a night out. Nothing spectacular but waitresses are pretty helpful unless the managers only have one girl waiting tables that night. Cant blame the waitresses but other than that, good food, good prices and a good choice."}
{"text":"Seriously... best grilled cheese I've ever tasted!!! The bar was great. Lots of tv's for game time. friendly and fast service."}
{"text":"This is a bit of a dive, but the food is good.  It has, for me, great proximity...  The service could be a bit faster, but it is usually fine.  I do, however, get the feeling that regulars get annoyed at people who are not normally there."}
{"text":"Best place to get drunk for miles in any direction. Wish they had Coke instead of Pepsi, though."}
{"text":"Yippee! A neighborhood bar just opened in my neighborhood. Clean with friendly staff and the burgers are pretty decent too.  Perfect for when we don't want to go too far.  We'll be supporting this place."}
{"text":"Enjoyed lunch today, at this little bar place I've been hearing about. It was super clean and menu has a lot to choose from. I had a cheeseburger and my friend had the taco salad. Food and service was great! We are planning trips back happy hour and adult trivia."}
{"text":"I go there once a week to play darts. Always see the same people playing, this time around I went to go play as usual with my neighbor. There was no one at the dart boards,  i put my money in to play and a tall skinny guy Klux Klux Klan guy his 40s who can't handle his beer comes to me and proceeds to tell me that he's playing on that board and that is his money. When somebody tells me that they will give you money to leave the place, they are definitely racist since I was the only non Anglo there. I will never ever go there again, and I will definitely spread the word about this racist piece of shot place. The sad part is no one said a damn thing. Will never spend my money there."}
{"text":"This place has mad potential! Who would like to see a hip hop/dance night here on Saturday nights with a love dj? lemme know! Cuz I can bring it!"}
{"text":"second time here people are friendly , beer is cold and the food is great. Perfect neighborhood bar, see ya there!"}
{"text":"Went here yesterday for the first time. Pleasantly surprised actually. Well all had sandwiches and burgers, 4 total. Every one was cooked well, juicy and flavorful. Service was far about average. Food is priced considerably low. Very good value, quality, and portion for the money. TVs are ok. There are better places, but for the price of food and beer, this place is respectable. Another reviewer said this place was red neck. Must have been the day they went on or something. I went during March madness and there was a mix of younger college types and what seemed middle class mid aged people. Staff was very friendly and quick. Bar and table top stools are rather uncomfortable. Bathrooms were clean. All in all a decent bar."}
{"text":"Kayla is hands down the best!! So friendly and personable! Food is very good and totchos and fish fry are great!"}
{"text":"Happened to find this place on Sunday when I was going to Panda Express. We stopped in to watch the Sunday playoff games and we were extremely happy.

The happy specials were decent and the food we ordered was good, especially for bar food, and it was a nice clean crowd.

We just moved to the are and we'll definitely be back."}
{"text":"Very happy to see a small bar pop up close to the house.  It is what it is, a small bar with small bar food.  No cullinary stars in the kitchen but reports from the croud are that the food is just what you would expect and decent.

They have $2.50 coronas all the time and specials on canned beer which is great to see from a place like this.

Where they do excell is on their TV's.  They have at least a dozen BIG ones.  Full HD and they also have two projectors that broadcast onto entire walls.  

This bar is very small so I'd say that they have as close to as many TV's per square foot as Santisi Bros, and with better quality.  Now that is saying something.

Support your local dive bar!!!!!"}
{"text":"My co- workers and I frequently come here for Happy Hour. The prices are great and the totchos (tater tot nachos) are fantastic. I haven't tried the fish fry, but it smells delicious. The wait staff is very attentive, so much so, one now knows my drink order by heart. I almost feel like Norm on \"Cheers\"."}
{"text":"My husband and I moved near this bar about 10 years ago. We have probably gone to this bar over 100 times. 

Location - great, atmosphere - great, over all experience - great, but the last 2 years have been frustrating. Drinks are well made, but the mixers are sub par. Please purchase and serve better fruit drink mixers (orange, cranberry, and grapefruit juice). 

The main problem I have is the newer service people. There is a blond that has taken multiple orders from me in the last year, and she has gotten at least 8 of them wrong. Last night we ordered grilled cheese, were charged for grilled chicken, and given grilled pork. We ordered 3 items, and all were soggy, and had poor sides (the side of the celery stalks that you would normally throw out).

It makes me sad that this place has deteriorated so badly over the last 2 years."}
{"text":"I haven't had the food yet, but it's a nice and comfortable neighborhood bar... I agree with another reviewer that it's a typical 'local' bar without the douchey regulars... I think they've done a great job with the place. Perfect location to watch games with two huge projection screens, good entertainment on the weekends, great bartenders and a fun local crowd.  We had a good time here the few times we've visited; we will be back!"}
{"text":"came in saturday and had their mushroom burger.  The burger was awesome! My friend also enjoyed their food.  Our waitress was excellant! She was one of the best I have had anywhere.  We will be going back for sure"}
{"text":"The food wasn't at all fresh, the drink was great though. I didn't find the servicer all that great either. Yes, the girl was friendly, but attention to her first customer's ever! a thumbs down. Over all experience not my cup of tea! It looks, and feels just another hole in the wall type of  bar!"}
{"text":"Dig this spot. In bike range for me and my girlfriend, and we pop in on weekends from time to time. Reasonably priced drinks, decent bar snack-type food, but happy hour is just so-so.

Service is always great at the bar or at a table. Attentive, fast and friendly. 

Good atmosphere. Doesn't have the creepy, douchey regulars that most bars of similar ilk tend to attract. Very chill place to have a few beers and put some money in the jukebox."}
{"text":"Use to be a great place to grab dinner with the kids or go hang out with the neighbor's for beers.  It was our fun easy going neighborhood bar.  Sorry to say our Neighborhood Gang has moved on.  The drunk under educated racist wanna be billy bad %÷#$ have ruined our local hangout.  If your Hispanic don't even open the door.  If your an interracial marriage don't even pull into the parking lot.  So we'll just wait for the new bar by Lowe's to open I hear it's going to be a great friendly neighborhood sports bar."}
{"text":"Prices are good but the food was bad, even for bar food. Nothing good on tap."}
{"text":"They have a name change, Fletcher's.  They are no longer a sports bar.  They removed most of their high tables, dart boards and several t.vs.  we went to watch Cardinals and Falcons game, one they didn't have it on the big screen until we asked, they would not turn on sound.  They said they had to have music on the juke box.  There were less then Ten people in the place and two brought food from outside.  We were told that they haven't gotten full liquor license and that is why, well if that were the case you would still try to get that sports crowd.  We ate our nachos and told them we were leaving to go watch the game somewhere else.  
The nachos were over cooked and the cheese was too greasey.  The other thing we were told is they are sponsoring the local high school which might be more of the reason they aren't catering to sports fans.  Our waitress was nice but that's about it."}
{"text":"Great burgers and tasty wings. Great nighborhood sports bar."}
{"text":"Raunchy. If it wasn't for the decent food and nice staff it would be rated lower. The food was decently priced and it tasted pretty good.nothing spectacular. Once staff decided we weren't ordering drinks they were less attentive but I guess it's expected. The crowd is pretty gross. Groups of older
Women making out with everyone....everywhere. I was mostly irritated when they tried to include me. Yuck. Wouldn't visit again."}
{"text":"I live in Tempe and go to ASU so it's hard to find a bar that compares to the status of powerhouse bars found in Tempe and Scottsdale. The Hights is an exception, this place is awesome. Fantastic service, prices, and an even better atmosphere. I totally recommend trying this place out! You'll for sure be back again. 
-Michael"}
{"text":"Fantastic place to meet new friends and enjoy the food. Kayla is so great. Ask her about her greenhouse"}
{"text":"We love this neighborhood \"dive\" bar.  The menu is basically bar food - wings, burgers, fried appetizers, etc.  Food is reasonably priced and good.  They have great drink prices - $2.25 draft and $2.75 bottles of beer.  A great local hangout.  It's a basic sports bar and the music is loud.  They have video games.  If you live in Fletcher Heights you can walk there, which is definitely a plus if you want to hang out for a while and have a few drinks."}
{"text":"Started going to this bar to play free poker, have something to eat and drink, meet new people and have a good time. Been doing this for about a year until last night when their so called General Manager( who is only there a few months) said he did not like poker people and did not like us there anymore. And that was said in front of people that were eating, drinking and playing cards. If he was ever properly trained in being a Gen Mgr he would have spoken to the Director in private and discussed the matter. He later became very rude to other players.   We are a very nice crowd of players (not rowdy).  I guess our $50 to $90 bar tabs will be better spent else where. 
Other couples spend more or less but feel the same way."}
{"text":"Local bar the wife and I like to visit. Nice friendly staff and quick to help.  Nice place with good drinks at a good price.  Haven't tried the food yet."}
{"text":"I have been dropping lately and have found this place to be a great restaurant and bar.  The team is always friendly, quick to serve and they know the menu very well.  I highly recommend for lunch, dinner or brunch!"}
{"text":"So I had the interesting adventure and opportunity to spend a few hours here last night.  I met some fun people and had an affordable night out. There is a jukebox and a neighborhood crowd that isn't afraid to sing along. I saw someone offer to buy someone a cab ride home and someone bought the bar a round of shots.  There's definitely some good people watching there too!"}
{"text":"The first time I walked in to the Heights when they first opened until now, this is an awesome small hometown feeling establishment. All the staff is great, the owners are great people and the customers are great. If you are looking for a place to call your  hang out, this is it."}
{"text":"This place with the previous bar staff was less than my favorite however Kayla the Sunday day bartender and crew have recaptured us on all of our recent visits. Great place for Golden tee and bfast on a sunday!"}
{"text":"Beer was not that cold the 1st time I went here.  Thes time it was cold, so I was happy.  The food and atmosphere are okay.  Some of the table stools are wobbly, which is annoying.  They have an outdoor patio that allows smoking, which my husband appreciates.  Unfortunately, the most memorable thing about this"}
{"text":"Good food good prices friendly staff nice neighborhood sports bar.  Love me some sweet potatoes fries!"}
{"text":"This is a place for local rednecks! I didn't think I'd find em in this neighborhood, but they are there. The bartender was slow and only paid attention to her regulars. The food was OK, and the beer was not cold enough. There was a very awkward moment when the regulars were howling about music other than country music, and they weren't being shy about it. A lot of the other patrons look uncomfortable. I don't recommend this place unless you like to fly a Confederate flag from your F150 pickup truck."}
{"text":"2 stars cause the prices are reasonable... place looks ok, but the server was swearing and  talking to her friend more than taking care of the few customers in the place ... I would never bring friends or family to a place that allows the f word every five minutes! Food was so so.... never going back"}
{"text":"Stopped in on a Sunday late evening for a
drink and quick bite to eat. 
It was a little awkward upon first arrival as the bar was dead. There were a handful of regulars and what looked like a bartender who was off shift,doing some type of paperwork at the bar. 

But the bar tender was super sweet and quick to get us drinks.    

Over the next hour about 15 or so more customers showed up, making for a good Sunday night crowd. 

Food was good, wish they had better drink specials in the late evening of a Sunday, but I will def be back."}
{"text":"Great neighborhood bar!!! Great food , staff and Brian the manager is awesome :) HH is awesome !"}
{"text":"Very disappointed! Local customers who have been coming to this bar for years and built a relationship with the staff that made them feel like family. Had a table of 15+ of under age drinkers who were at the golf tournament all day come in and sit behind us being physical and disrespectful telling us we shouldn't be at a bar \" if we don't want to be touched\". The table to our right had a family of four with two kids the age of 10 and below. Management and security did nothing until called over and then basically said it was time for us to leave. Unfortunately I guess this is the type of clientele they want in their establishment.  I no longer will bring my family of four back here as I feel the business and new ownership prefers to cater to one time \"questionable drinking age\" patrons then established multiple visit local customers who have been supporting the business for years."}
{"text":"Not a bad sports bar in the corner of a shopping center. Had dinner and a couple of beers while sitting at the bar. Bartender was very friendly and attentive, the beers were cold and fresh from the tap, but the food was only so so. I have been here a couple of other times and it was pretty much the same story on those visits. I will probably come back again - nice atmosphere, lots of sports on TV."}
{"text":"Average strip mall bar. I would not go out of my way to go here but if you do you are treated well, good food, good drinks and good service. 

The drinks are on the weaker side no over pouring here. They are a little on the expensive side as well. They are not bad just not amazing. 

The staff is good, a little slow on the bar side, but it works. 

They do some Trivia type stuff that gets fun. Plenty of seats and screens to view sports etc."}
{"text":"The Heights is a fairly new sports bar that opened up in the Fletcher Heights shopping plaza at Lake Pleasant and 83rd Avenue. 

The bar inside is a little on the small side, but is always clean and well-kept. The bathrooms are single-toilet rooms, but they are also very clean, huge plus. They have a lot of TV's going with sports, and they pipe the audio outside to the patio, so if you're not down with that, probably not the right bar for you. 

They're open late, and after sports finish broadcasting they play music and it becomes more of a \"bar-bar.\" The crowd is middle-aged, and you have a lot of local regulars that probably live right around the corner. They will be drunk and they will want to talk to you and randomly join your party or conversation uninvited. That's the nature of a true neighborhood bar, so be prepared for that. (That being said, the bartenders are female and they will keep a strict eye out for older guys doing the aforementioned to younger women out with friends which is nice.) 

It's a friendly atmosphere, though, I've been there a handful of times and I've never encountered any more than harmless drunks that want to chat. Their drinks are good and cheap. I've not had their food, but it looks like standard pub fare. 

All in all, a pretty nice place to grab a few drinks and watch the game!"}
{"text":"This is a great neighborhood bar-and-grill. It has a Cheers atmosphere. The food and the service is very good .The staff is always 'friendly. My favorite is the Sonoran cheese steak. And the cheese curds are addicting. All ages come in here and everyone is always friendly. The owners are always in so say Hi to them. They have darts and Golden Tee. I highly recommend you visit this restaurant if you're in the area."}
{"text":"Great food great service. Second time in here and will definitely be coming back. I came in during happy hour and the drink prices were very reasonable. $4 for a pint of union Jack."}
{"text":"A place that has potential!  Great burgers, happy hour specials and atmosphere but the service lacks!  The service is so bad, that alone will prevent me from coming back."}
{"text":"Great service, drinks, and food. $1 beers and tasty chips & dip, which you can't beat."}
{"text":"All right guys and gals here is my review. First of all this place treats you like family they remember my name and my drink and always genuinely ask how I am and about myself and aren't afraid to tell me about their lives. It's nice to come here to get away to a different life. Here's what really gets me the cooks especially Victor is great!! His burgers are amazing!! Also guess what I work at a burger joint \"yumm\" and his are like I said amazing! He is always happy to meet a guest that is happy with his food. John is the owner you can usually point him out with his happy strut."}
{"text":"The Heights is a local neighborhood restaurant, was excited to try this place since it's so close to home. Dark, hole in the wall, weak drinks and crappy food.  We we're the only ones in there ordering food and took a very long time to get the food out.  When she finally brought out the food it was made wrong.  We ended up just scraping off all the onions and eating them anyway since it took so long to get the food in the first place. We will not be returning!!! Such a bummer"}
{"text":"If your looking for a real hole in the wall, no help, no service kind of bar than this is your spot. Would have had a 40$ tab but couldn't get help because Christin and the other chick were too busy stuffin their face with nachos. So I would not recommend but if you're looking for a 3$ non happy hour beer with limited selection up to kilt lifter with no service than this is your spot. And as I write this we have rookies barfing in the bath room."}
{"text":"Went a month ago and had a great time.   After tonight I'll never go back.  Most of my songs got bumped and then laughed at.  Only to a girl that looks and acts like
A 10 yr old.   I don't beg for great Music sorry"}
{"text":"Came in for happy hour on Thursday for the first time.  The happy hour specials were pretty standard. I was hoping for something a little different than everyone else. The happy hour food specials were pretty bland, again, nothing unique (fries, chips and salsa,  pretzel bites,  etc).

The menu looked promising after reading through it. I decided to order the frisco burger and my girlfriend order the wings (medium sauce).

The Frisco burger came with sourdough bread (the main reason I ordered it) which tasted like the off brand bread you could get at super market.  I was hoping for a higher quality bread. The burger was cooked well and toppings were good (also included thousand island dressing). The wings weren't very good. They tasted like frozen, store bought wings. The sauce was nothing special. 

Great atmosphere in the restaurant with TV's AND projectors! I'm sure during football season, it gets rowdy. I'll likely check that out.

I'm hoping my choices in food next time will impress me more."}
{"text":"Came here to meet a friend for a drink, ended up staying for a few.lol.  Overall a chill cool neighborhood bar. Super cheap beer, and they even have Firestone IPA on tap. They serve food late. I didn't rode anything but friend has and likes the burgers a lot. Lots of TVs and lots of space, best of all seems like a good crowd that comes out here. On a Saturday night when I came they were not to buys, but we all had a blast when one of my buddies started playing 2pac on the stereo all night. Ha, I guess I'll come back!"}
{"text":"This place is pretty legit, I came here with friends and wish I remember more but I was plastered.  I do remember seeing the 2 largest televisions I have ever seen inside this place.  Each TV covered an entire wall, what a great place to watch a game!  Anyway, the service was great at the bar and it's not a huge place but looks like there were lots of regulars.  Very clean, casual and just a fun place to hang out."}
{"text":"The Sweet Potato fries are excellent. We actually went here two nights in a row when my father was here. We were working late each night and it was on the way  home. Both nights the service was excellent. Very quick and attentive. The beer was ice cold and the food was really good. We wouldn't have gone back if it wasn't good. It's a cool little place with nice big TVs to watch sports. I will definately check it out when football season starts."}
{"text":"Great little neighborhood bar. We live waaaay on the other side of town but were in the area for a basketball tournament last night and stopped in  with our kids for a bite and a few drinks. Beer was cold, and the food was good solid bar food. We had wings, cheese curds, jalapeño poppers, sliders, and potato skins. Had a good time and would definitely return."}
{"text":"Food is good, service is good. Nice local hangout spot! Darts are fun, always something to do here. I come here a few times a week! My favorite is the pretzels! Good drink specials, good place! Touch tunes is fun too! Playing music from your phone!"}
{"text":"Love coming to the heights great food. Sit at the bar for the best service and see Kayla."}
{"text":"Went at half time during the football game, nice casual feel to it. They have some great drink specials! My wife and I both had burgers which were very good. They only had one waitress, Emily who  did a good job of checking in on everyone regularily. Will definitely be going there again."}
{"text":"Denver Broncos bar, so glad I found you. Besides that the food is very good and cooked perfectly.  My son had the Wings and loved them.  I had the pulled pork and it was very good.  No complainst from anyone in my party."}
{"text":"The Heights usually delivers with prompt service and above average bar food. The wings are very good if you ask for them grilled. I also like the burgers there. Emily is a great bartender that has remembered my name since my first visit! 

Room for improvement: Dont put up the chairs in the bar until you are closed. Its a real turn off to see that when you walk in. Also once our waitress was drunk, but we havent seen her since.

Bottom Line: Stay on your toes Hieghts... keep it fresh or you will get stale soon. But sofar..very good."}
{"text":"This place looks practically brand new. The carpet looks so clean I'm worried it will be ruined by some stains.  There are a few flat screen TVs here, and two giant wall projectors to keep you entertained for sports.  The service we had we very good- drinks were refilled, etc.  The food was decent; I had a chicken philly and onion rings.  This isn't exactly close to where I live, but if it was I would probably come here all the time.  I heard they have karaoke on Wednesdays but I wish it was Friday or Saturday."}
{"text":"They are under new ownership and so far the new owners are great. They appear to be continuing continuing all the great thongs that were here before. They are very active in day to day operations. We see then here all the time. They created the penny beer/wine special.  Their pizza is hand made and to die for. The burgers are always great to. The staff is friendly and attentive. Don't be surprised if you find it packed on a Friday night. The world knows about this place."}
{"text":"Service was good...food was good..drinks..were good. Prices good. The only thing that was a turn off was there were little kids that were probably under about 3 or 4 running around the place. I assumed they were family of the owners due to they even ran in and out of the kitchen and the little boy ran out the front door. The mothers acted like all was normal...so maybe it is for them. Everything was good except one does not feel a bar should be a playground for little ones."}
{"text":"Forward to 2017...still love this place..food is getting close to amazing whether you like byrgers..wings..sandwhiches or fish fry.  Great service...great prices..our new fav hang im North Peoria!@  yay!!"}
{"text":"Pretty fun place to hang out and grab a few drinks....depending on who your waitress is.
Roxxey is great; personable and prompt, making frequent stops to see if we needed anything.  Unfortunately Roxxey's shift was ending and she asked us if we'd be willing to cash out, which we did.  We then got Stephani, who is not only a crummy waitress, she has the bland personality to match.  She'd walk by us several times, not stopping in to see if we needed anything.  When we did ask, she acted as if we were inconveniencing her.
Food was also just ok."}
{"text":"Ok dive-ish atmosphere, but last time I went the owners kid was running between tables screaming with him watching and laughing. Food is AWFUL!! I hate to say this as it is so dang close to home, but ugh..."}
{"text":"The Heights is The Stang House! Official home of the SMHS Mustangs.  More to come.  @SMHSSTUCREW @SunriseMtnFans @mustangballers @SMHSFootballFam @sunrisemustangs"}
{"text":"This is one of my favs. I cannot even explain why. I just like  the place. Has a little bit of everything for everybody.  People are relaxed and friendly but not too in your face when you are new. Food is  handy dandy, staff has all been good to us and we enjoy the outdoor patio often too.  Prices are fair and the TVs are plentiful and you can see them from any angle. 
Like I said, I just like this place for hanging out with friends and a drink."}
