{"text":"Just landed from orlando, checked into hotel and found our way to garden cafe....good thing we stopped! Food was great! Service was great! Outdoors was fantastic ! 

I should have tipped 20% but your order and then sit down and I didn't realize the wait staff is a real wait staff not just deliver your food!

I would recommend! We had grilled shrimp, garden tacos w shrimp, salads and also chicken sandwich."}
{"text":"What a great location for lunch!  It's very casual, you pay for your food prior to sitting down.  The meal I had here was great and the servers were very attentive.  I've also gone here for happy hours and the music was wonderful.  Plus you get free food with your drink purchase and drinks were very reasonably priced as well.  Wish I had made a point to come here more often during the summer!"}
{"text":"After my horrible experience with ECCO shoes, I've been writing about my positive experiences.  Beautiful place to have lunch.  Shaded tables, great food and service.  Fabulous fountain.  Cool place to have lunch on a hot day.  Loved the summer minestrone & the best iced tea.  Wish it was in Richmond."}
{"text":"I've long been a seeker of those places that make you feel like you are having that quintessential city experience. Things like riding a subway, eating a meal by big windows overlooking downtown, taking in a show, kissing you significant other under the lights on a snowy night in the holiday season... The Garden Cafe just made that list. And the best part was it wasn't something I knew would fit the bill.

The Garden Cafe sits in the courtyard next to Heinz hall, on the corner of Liberty and 6th (where 6th doglegs to become Market in front of the Fairmont Hotel). The cafe is only open on days when the weather forecast is favorable because the entire place is outside. You walk into the plaza, and there is a table with a register. You order here, and go and find a table on the brick patio, sitting among fountains, trees, and the beauty of this serene downtown setting, separated from the randomness and dirt of the sidewalk by the beauty of brick walls with lush greens growing atop. 

I had a chicken and brie wrap with corn something (salsa?) and some kind of Aioli suase... it was AMAZING. And it was served with a quarter pickle spear and fires. The fries were shoestring, crispy, DELICIOUS and awesome. The Wrap didn't seem huge (big enough, I figured, for a light lunch), and the whole thing was $7.something with the initial included 10% gratuity. 

I was stunned when I returned to my office and found myself fighting off a food coma. SO filling. This place is unbelievable and has such an amazing ambiance. You feel like you are really in a city, but an idealistic one where everyone is nice, all the air smells amazing, the new buildings are cool and unique and the old ones are classy and ancient in their stories. You get the feeling that you can conquer the world and when you get back to the office you are going to win that big account. OK... i guess this has nothing to do with the food, but it is pretty cool. The fountains, the trees, the food, the staff... all just really great! 

It was a little windy and that made it slightly challenging to eat normally, and the sounds from busses can on occasion be a little much. You will also hear any crazies yelling from the other side of the wall, but only the loudest ones. 

I would absolutely recommend this place. 

Weekdays 11:30-2:30, weather permitting."}
{"text":"Best place for lunch in Pittsburgh! Gorgeous patio, remarkable service and people, delicious food and drinks all to the sound of a beautiful fountain. I'll be back!"}
{"text":"I absolutely love eating here for lunch downtown! It's one of the few outdoor spaces around here and I always enjoy my meal along with the whole experience. They have many different sandwich and salad options-- burgers, grilled chicken, Caesar salads and more. Last time I went here, they had a strawberry basil lemonade that was wonderful to drink while sitting out in the sun near the calming sounds of the waterfall.

I have never been here for happy hour, but I know it is on Wednesdays and they have food and drink specials, along with live music!"}
