{"text":"Such good and quality consistent food. Had the Waldorf Salad today.  New favorite. Love the decor and staff at this location. )"}
{"text":"We have been to this restaurant a few times and won't be going back! This is by far the dirtiest place I have eaten. Every time we have been there food is wedged in between the cracks of the booths and the tables are sticky. There is so much food under the floor that you have to swipe it away before you sit down. In regards to customer service, the manager (don't know her name but older women with a sour look) is always very rude and unpleasant. We kept going back because the food was fresh and good but I can no longer deal with dirt. Spend your money elsewhere and don't eat on other peoples filth."}
{"text":"My wife and I eat at the Good Egg few times month.  We love going there because the food is always good, and the restaurant is always clean.  The servers and staff has always been professional and our primary server that we use is Greg.   Greg is very personable and he very patient with the customers even if they are doing special orders.   And if the food is not prepared right he will return it to the kitchen and then has the order rushed.

So if you go the Good Egg located in the area of 83 Ave and Union Hills ask for Greg."}
{"text":"Had breakfast for the first time at the good egg today:-) We will be back regularly after the experience that Greg(server) gave us, at breakfast this morning. I had the Chorizo and eggs, French toast with caramelized pecans and cream cheese frosting  drizzled with syrup and it was to die for! The service From our waiter , Greg, was phenomenal and couldn't have asked for one thing to be different. We were there for maybe 30 to 40 minutes, quick service for sunday morning.  We even saw Frank Gore, the running back for the San Francisco 49ers, come in as we were eating breakfast. Thank you for the great experience, we will be back to The Good Egg!"}
{"text":"Yesterday was our first time eating here, we LOVED it!   We had Greg as our server and he was awesome and the food was amazing.  Go check it out, great place for breakfast or dinner."}
{"text":"Food was simply delicious, service was awesome (thank you Kaitlyn), wait time for seating and food was very minimal.  I had the Bacado omlet-yum!!!  Crispy bacon and avocado and plenty of both.  Hubby had the Florentine skillet which was an awesome flavor combo, and Hollandaise sauce was creamy and light.  Nice crispy country potatoes as a side to both.  Real butter and high quality jam served with the toast! They offered three different types of coffee- dark roast, golden roast and decaf- we tried both caffeinated blends and they were rich and flavorful.  The bring coffee decanteurs to your table so you can have as much as you like which is ingenious- easy on the server, keeps customer happy!. So much more on the menu we are anxious to try!  We ate out on the patio which was nicely shaded, enclosed and breezy.  My hubby and I go out to breakfast every weekend- it is our quiet reconnect time.  We usually go to a local diner close to our house but although this is slightly more of a drive, I think we found our new weekly spot!!!"}
{"text":"The good egg is my favorite place... Everyday I have oatmeal with the fixin's .. Sometimes I have a pancake... It's great food ... But the Service is wonderful Greg my almost everyday server is the best... So polite friendly... Makes my day! .. He brings sunshine when the Egg is busy... Or the kitchen is back up... Over all wonderful place..."}
{"text":"I would not go back here.  The service was bad.  They did not refill our drinks, the potatoes were cold, the side salads taste like dirt."}
{"text":"This was not my first time and nor was it my first bad experience at this place, so having said that I try to be very conscious of how I order my eggs at an Egg specialized place. I don't order it medium poached eggs when they are slammed or anything that's going to roll someone's eye back behind their head when they are busy. Well, it wasn't very busy and not so early that the cooks haven't had their morning eye openers (haha).  But it sucks when they bring you poached eggs that rivals imitation rubber  eggs, then the server says to you that this is a poached egg as if you didn't know what you were ordering. When it came back \"CORRECTED\" one egg was broken open and the other still little over-cooked. I figured one out of two eggs was still better and if I sent it back it would not have improved my experience there anymore. Would I go back, maybe but definitely not until the summers in phoenix gets colder then 60 degrees."}
{"text":"Overall good, definitely needs to improve in the service but food was good might be coming back in the future."}
{"text":"Food was fair. Have had much better at other places for a whole lot cheaper!  Eggs benedict runny , eggs were cooked hard...couldn't wait to have it remade, as had an appt. Will NEVER  RETURN.   Greg only bright spot of that gross experience."}
{"text":"Tried the good egg for the first & last time this morning. Bacon was over cooked, eggs under cooked & gravy was out of a can! Would not revisit. Mc Donalds is right down the road with better food at a cheaper price."}
{"text":"Our server Kaitlyn was AMAZ!!!! She recommended the roasted corn pancakes and they were sooo good. Good Egg never disappoints. Been coming here for years and the food, service, and atmosphere are top notch!"}
{"text":"This place gets a solid two stars.the service is excellent i am having to stick to a certain healthily diet which sometimes makes it hard to eat out  the waitress that we had was top shelf helpful.she took her time which s nice especially now adays.The food to my self and my guest the taste was very bland.the food looks great just bland."}
{"text":"We tend to find ourselves in Peoria at least once per year, and have always gone to this restaurant in The Good Egg chain on our trips.  Our visit today will make us reconsider.  

I'll preface this by saying that before today I had never left a sit-down restaurant without leaving a tip (at least a restaurant where tips are expected).  Today's service was so incredibly poor that I didn't leave the customary 20%.

I should have realized from the beginning that our visit was cursed.  We came in with our infant and preschooler, and were paraded past a number of empty tables to the very back corner of the restaurant, right next to the restrooms.  If you have ever read Waiter Rant, you know that the tables closest to the restrooms are not necessarily provided with the best service.

We were originally going to be seated in a booth, but the hostess was happy to let us move to the table across the aisle so we could move our preschooler's seat closer to the table.  This becomes an important fact later.

Our waitress was quick to take our order, and actually came back a minute or so after leaving to confirm one piece of the order.  From that point on, it was at least 25 minutes before we talked to anyone.  Our older daughter colored the complimentary coloring page.  She flipped it over and drew a picture.  We even had a chance to walk to the restroom right next to our table so she could do a quick pit stop.  The wait was long enough that the couple who were seated at the booth we were originally going to be seated at had already received their food and were happily halfway through their meal.  

Finally, our waitress stopped by and informed us that the kitchen didn't have our order.  She assured us that she had put a rush on the order, and that it would be out very soon.  I even asked whether we could get the fruit and yogurt plate we ordered for our daughter ahead of the rest of the food, since a hungry 3 year old who is forced to wait patiently can be an entirely unpleasant experience.  We were assured that the food would be right out.

I'm not sure what The Good Egg's definition of \"right out\" is, but we were able to draw with crayons a bit more, stack the strawberry and blackberry jam tins into pyramids, practice counting jam tins, and watch the couple at the booth we were originally going to be seated at finish their meal and leave before we received our food.  At about the 40-45 minute mark, my wife had had enough and went to the front desk to ask for a manager.  Shortly after she got back, the chickens had apparently laid enough eggs for our meal to be delivered to our table.

Immediately after our food arrived, a very apologetic manager arrived to let us know that she would take care of the situation, and that the meal was on the house.  She confirmed that the service was unacceptable, that the waitress should have let her know about the issue before my wife went to the front desk to ask to see a manager, and took responsibility.  In one way, this was refreshing -- it's not often that you find a business willing to say \"we screwed up - we're sorry.\"   On the other hand, these are generally not random occurrences, and this is not the first time we've had excruciatingly slow service from The Good Egg.

The meal itself, once it showed up, was OK.  My wife got the special, which was some type of egg dish.  She commented that it looked like it had sat under a heat lamp for a while.  Our daughter had a fruit and yogurt plate which apparently was acceptable.  I had the pancakes, eggs, and sausage combo.  The whole wheat pancakes had bananas cooked into them, and were somewhat soggy.  I'm not sure if they had sat there for a while, were undercooked, or if it was the extra juice from the bananas that made them looser than pancakes normally are.  The eggs were cooked a bit runnier than I would normally expect over medium to be.  The sausage, on the other hand, was very tasty and plump, with a slight kick to it.

After our complaint to the manager, our waitress stopped by a couple of times to check to make sure we had everything we needed, apologized several times for the problems, and didn't try making any more excuses.  Quite honestly, I think the problem likely stemmed from the fact that when the order was originally taken, she forgot to ask how I wanted my eggs cooked.  That step of having to come back and get that information was probably the critical extra step that potentially prevented our order from either being inputted into the order system, or sent as a complete order to the kitchen.  That being said, it's her responsibility to follow up.  She seemed competent enough, and I would hope that management is competent enough to see it as an opportunity for training, and not an opportunity for discipline, unless there's a track record.  Live and learn."}
{"text":"It's not always a Good Time going there. I don't know, sometimes the food is cooked with passion, then there are times when they will burn your food. The service is temperamental, sometimes they are in a good mood then there are times when they are distant. Oh! I strongly urge ppl to read that free meal coupon. It's ONLY for entries! No sides or drinks. So get a day starter or another full meal."}
{"text":"This place has a great menu, particularly for breakfast and brunch, that allows you to select from the standards or experiment with something more creative. Omelettes, scrambles, and the southwestern dishes have always been my go-tos, among which, the Old Pueblo (off the South by Southwest section of the menu) is my absolute fav!

Every location I've visited across the valley has great service, food, and ambiance. ANDDD...the Arizona hot sauce at each table is knock-your-socks-off good (try the organic chipotle habanero)!"}
{"text":"I've been coming here for a few years and have generally had positive experiences. There food is normally quite good, but I think I've been there my last time.  

We went for breakfast this morning.  We were told that there was a 15 minute wait. It was actually more like 35 mins. No big deal, these sorts of things happen. After being seated it took longer than normal for the server to take our orders.  Again, no big deal.

But then about 40 minutes later, I had to flag down our server to ask if our food was on its way (keep in mind there were only two of us and so it wasn't because we had a large order) and she assured me it was. A few minutes later, she drops by with my side order (a side of biscuits & gravy), but neither entree. So I guess I'm supposed to eat first or let it go cold? 

About five minutes later our entrees arrive and we're starving now. We've been at this restaurant for 80 or so minutes by now and we finally have our plates! My wife's food seems alright, but my corn beef hash is cold in sections. Not only that, but as I move my plate over so my wife can try it, my hand gets covered in brown stuff from the bottom of the plate! Fortunately, it's chocolate rather than, well, other brown stuff, but still, I'm pretty annoyed by now.  I tell the server of my cold corn beef hash and she rushes off to get me a new portion. But of course, it again takes a while and by this time, I've lost my patience and my appetite. 

When paying the check, the lady asked us how everything was, and I told her that frankly I wasn't pleased. She said sorry and asked if we wanted to speak with the manager. I declined. I just wanted to leave--because we'd spent way too much of our day there already. I wasn't going to wait around any longer.  I still left our server a generous tip, because I don't think it was really her fault, but then felt crappy about spending $26 dollars for an awful experience. 

It's HIGHLY unlikely that I'll return here again. Very disappointed with the service and wait time.  In fact, as we were leaving the table next to us was complaining about the service as well."}
{"text":"Love this place! Very casual and the staff is friendly... I always love lotsa cream in my coffee.. They'll bring it to YA!"}
{"text":"Love the Good Egg.  GREAT food, good service, clean.  Never disappoints no matter which location."}
{"text":"Ask for Greg for very good service and a great dining experience!.  We totally enjoyed the experience of having him as are waiter. He is lots of fun and very quick at his job. I would give him 5 stars."}
{"text":"We used to eat at the Good Egg on Union Hills regularly, however the service and food had been disappointing the past few visits.  It's unfortunate the manager is lazy and it has degraded the operations.  Food is slow to come out and undercooked.  They don't have enough waitstaff so our waitress was working multiple sections of tables.  Hopefully they will get a better manager soon."}
{"text":"My wife son and I go here often to get breakfast and lunch. Although lunch is good, the breakfast is much better. I recommend the Bacado, it is a really good omelet with bacon cheese and avocado! It is the best thing on the menu. Plus they have Gun Slinger hot sauce which is the greatest hot sauce known to man! (you can buy Gun Slinger in the store now at frys)"}
{"text":"We decided to try The Good Egg on Mother's Day for the first time. There was a 35 minute wait, but at least they had refreshments outside for the people waiting. We were seated at a nice large table and the menu looked pretty good, but once we got our food it was ice cold! We actually had to send it back. I have never had this happen at a restaurant before. The waitress gave me a GIGANTIC cinnamon roll as an apology and lord was it delicious but cold food is just unacceptable. On an up note- they give you free chocolates on Mother's Day!"}
{"text":"Classic yet accessible. Food was very good and the server Kaitlin did a great job taking care of me at the bar. I can be high maintenance but I was more than adequately serviced! Kudos to a nice restaurant team from someone who has been in the business for a decade"}
{"text":"Stopped in at 8 AM on Saturday, April 23rd. My wife and I were seated quickly....then, we waited, and waited, and waited. 3 other tables were seated around us and all were helped. We waited 15 minutes watching all of this happen. We finally had to flag someone down, who was totally oblivious that we were even there. We told her how long we had been there and watched her wait on everyone but us. Needless to say, we got up and left. Many other choices that you can choose. At the IHOP now, great service and great food. Stay away from The Good Egg, never been treated so poorly."}
{"text":"My husband and I had a late breakfast at the Good Egg, Union Hills this week and I don't want to let the opportunity to pass without expressing how much fun we had at this occasion.  We were celebrating our January birthdays, so had a  coupon for a buy one get one offer.  Our waitress, Emily, was so cheerful, sincere and accommodating.  She promptly brought us our beverages and then stayed around to answer questions about menu items, since we hadn't been there since First Watch had remodeled the restaurant.  My husband wanted to try one of the fresh, healthy juice drinks and she recommended the carrot mixture.  It was pretty to look at and he found it both unique & delicious.  I had a hard time choosing an entrée since her suggested options all sounded spectacular (especially the seasonal salmon eggs benedict).  However, I am sure I made the right choice with the light spinach/avocado/mushroom/Jack CREPE-EGGS.  The crepes were served omelet style with an English muffin/ poppy seed dressing and fresh fruit dish.  It was delicious!  My husband felt his Four Peaks French toast was the superior dish, but I beg to differ... Refills and condiments were delivered rapidly and the whole experience was a lot of fun. Service was excellent.  The decor is light, rustic/modern and very well planned out with a nice outdoor dining area.   It's great to find such a lovely breakfast place nearby and we won't have to drive into Phoenix to entertain friends. We will make breakfast at the Good Egg part of our dining habit :-) and I hope you'll give them a try."}
{"text":"My husband and I are big fans of breakfast fare and we've become regulars at The Good Egg for consistent delicious fixes.

They have an extensive menu that provides more healthy options (that actually taste good) than most breakfast restaurants offer.

The service and food isn't always stellar, which is why I give it 4 stars rather than 5, but both are usually excellent and I have never left completely disappointed."}
{"text":"Service was fantastic. It has been a year since coming to good egg and I was hoping that it had changed for the better. The food was still bland (veggie omelette) or it was super sweet (pineapple pancake). I will not be going back after this last visit. To their credit, service was fantastic and we were seated pretty quickly."}
{"text":"I called ahead and someone forgot to write our name down.  We were worried we couldn't get it, but management made it right and got us in almost immediately."}
{"text":"Made a last minute  decision  to have breakfast  at The Good Egg while on our trip to AZ and let me say it was a good decision.  I like to keep things sweet and simple so let's just get to it, I would highly recommend their lumberjack skillet with their fresh bisket served with honey. The service was great and our waitress Anna was attentive and pleasant. I highly  recommend The Good Egg as the place to start your day."}
{"text":"I heard this place was newly remodeled so we decided to come her for brunch after hiking. I've been to the Good Egg location in Mesa before. It was alright, kinda like a tad bit step up to Denny's but that's what it reminded me off...but oh myyy..this location looks wonderful. The new decor is awesome, it has a very rustic farm vibe going on and I love it!

I ordered the cucumber mint refresher..the taste was good but I didn't like the carbonation and the sugary ness of it..I wish it was a bit healthier.

I ended up getting the crepe spicy-egg..It was bomb! And again, it tasted healthier since it also had egg whites on it. The portion was huge so I couldn't finish it all...I mean I could have but I didn't lol..Came with fruits and English muffins...everything was delicious.

Can't wait to come back!"}
{"text":"Phoenix seems to lack interesting breakfast venues according to our friend that lives there.  He recommended the Good Egg at this location because it has a fairly nice interior.  This was my third time dining there.   

Service seems to be somewhat inconsistent despite what I've read on some of the reviews posted here.  There is one manager that seems to run the place quite well; unfortunately that was not the case when we visited this week.

I ordered the Florentine Benedict which was their version of Eggs Benedict with spinach, tomato and two asparagus spears.  While it was good, it wasn't what I consider to be out of this world; perhaps they tried to make it low cal as it did not have much Hollandaise sauce.  

Our server gave us the menus immediately, but it took about 10 minutes for him to ask us if we were ready to order.  I wasn't sure whether he was covering too many tables, but service was quite slow.  He was, however, quick to give us refills of water."}
{"text":"Had the opportunity to eat here again. Service was still slow, had the same waiter.  There was a vast improvement in the food! Food was hot, and yummy. Loved the biscuits! Would eat here again, maybe ask to be seated in another section."}
{"text":"Absolutely perfect Old Pueblo! They changed the biscuits and gravy since First Watch took over so we don't look forward to those anymore but the Old Pueblo is a great new addition."}
{"text":"Love this place!  I go for breakfast a lot; today I had lunch there for the first time.  I ordered a grilled chicken quesadilla and the (very helpful) waiter let me know it would just have chicken and cheese, which would have been OK, but he then suggested having it with peppers, onions, sauce and green chilis mixed in (\"the old way\" they used to make it)... Well, I took his suggestion and the quesadilla was awesome!!  This is a great place for kids, too.  Can't beat the pancakes. :)"}
{"text":"We usually frequent this restaurant on the weekends, when yes, it can get busy.  However, the wait, is definitely worth it.  On the weekends, they usually serve coffee out front while you wait.  I have never had a problem with my order coming out incorrect or taking forever.  

I have two favorite items to order: Veggie Interesting omelette or the eye opener combo.  The coffee is always fresh and perfectly brewed for me.  The wait staff are very nice and efficient.  

Seating can be inside or outside.  They have misters  and umbrellas outside for the hot mid-mornings."}
{"text":"This is my favorite place to go for breakfast. Great eggs (real) even when scrambled. I never noticed the difference until I ate here!  They have great unique crepes, French toast and pancake options and yummy turkey sausage (doesn't taste like jimmy dean). The atmosphere is very open, comfortable and friendly, unlike my usual IHOP options. I love the call ahead seating. I call when I'm leaving my house since I'm about 20 mins away and am usually sat quickly. There price is almost the same as IHOP and much better quality and friendlier service."}
{"text":"My girlfriend and I have visited the location behind Arrowhead Mall a few times in the hopes of finding a good breakfast place.  We wanted to like this place, because the menu offers alot of great sounding dishes.....We really wanted to give this place the benefit of the doubt after our first visit, but this place just falls short on so many levels.  First of all....the service sucks.  If it's busy, you will wait forever just to get water and your order taken....  Then there is the food.  It sucks....  They even managed to make eggs boring and that is hard to do, considering how many ways you can make them.  We have been waited on 2 of the 3 times by a less than friendly waitress who still has the god awful Kate Gossling hair cut, and has the personality of a thumb tack.  After asking for a fresh cup of coffee (since the ones we were served tasted like gasoline) she told us that she just served us from the freshest pot they had, and that nothing was wrong with the coffee.  The Country Gravy tasted like it was made from a store bought packet, and the salsa was mediocre at best.  If you are looking for a place that serves below average food and a bitter waitress...then The 'Good' Egg is your place to go.  I'd prefer Denny's over this place, because I'd atleast know not to expect much for my $ there."}
{"text":"Not impressed. Had the Bacado. Eggs were \"rubbery\" . Flavorless everything else. Also, restaurant decor has changed. Seating is uncomfortable and now has a cold and uninviting feel to it. We used to frequent this restaurant a lot. I think this was my last visit."}
{"text":"Popular breakfast place on the NW side of town.  The wait was long but the place was pretty packed.I tried the lumberjack skillet.  It came with two eggs, potatoes, peppers, bacon, ham, sausage, and cheese.  My meal was okay.  The portion was about right.  Not too big and not too small.  The price was average for the fare.  I asked for over easy eggs and received over medium.  Not a huge deal but kind of on par with the whole experience.  

Good Egg is a good name as it was good.  Not great, not bad...pretty much just okay.  Probably would come back sometime but nothing I'd highly recommend."}
{"text":"Despite the fact that it only got two and 1/2 star review...I decided to come here for brunch/lunch today anyway. Now usually Yelp reviews are pretty accurate....and well 2 and 1/2 stars is pretty bad....but I believe it should be at least 3 stars and 1/2. why? well because......

first of all the service....I have never had such gentle and soft-spoken hostess and waiter before. They were so gentle and friendly .. in some ways it is weird but it's not bad at all. They talk very softly but it's not like you can't hear them. I really enjoyed the service here.

secondly the food was pretty good...at least what my bf and I had ordered. My bf's Traditional Day Starter Plate - two scramble eggs, 3 pump and juicy sausages served with country potatoes and a slice of English muffin...was delightful. As for mine, Green Eggs and Ham.....thin sliced ham, sauteed mushrooms and arugula served on two toasty English muffin and topped with two poached eggs covered with pesto sauce and comes with a side of country potatoes. It was a delicious meal...one of which I totally demolished. 

Overall this place isn't as bad as some people say it is. I'm certainly glad I tried it. Although I do have a minute complaint and that is the pricing....it is a little on the pricey side for breakfast/brunch and it's mostly egg dishes so with that said...I would definitely come back."}
{"text":"This is the only place I will drink orange juice. I despise oranges but I could drink Good Egg orange juice all day. The pancake is absolutely perfect and fluffy. It's so huge that my mom and I split it whenever we go. Good Egg eggs are cooked perfectly as well. I want to take one of the cooks home with me and force them to make me breakfast everyday. I love the Good Egg."}
{"text":"Great place for breakfast! Fresh, light, healthy options combined with more traditional, filling choices. I went for the eggs florentine which were perfect, loved the mushrooms in there. Great atmosphere, calm, quiet. We came with a larger group but everyone was able to find something. Very good kids menu with a variety of options. Priced just right. Our party left full and very happy! Also the four peaks French toast is AMAZING!"}
{"text":"My boyfriend and I are visiting AZ this week for a Spring Training game, and our hotel was less than a mile from our hotel, and decided to give it a try. 
I am SO HAPPY we did. Super affordable, GREAT atmosphere, and delicious food with amazing service. 
Our server Anna was great, they give you a pit of coffee rite away at your table as soon as you sit down, ( of course after pouring you a cup first). Menus are simple and beautiful. 
Being from CA, I'm not going to lie, I got nervous at first walking in seeing the atmosphere, and thinking it might be a vegan place, but so happy it wasn't. 
Boyfriend had the Lumberjack Skillet, and I had the Good Eggs Benedict. 
A must stop for everyone in the area! Enjoy!"}
{"text":"We needed to eat where we thought we'd be able to order a meal low in sodium.  We came as close as possible, but overall it was still around 700 mg of sodium.  However, the waitress was very patient and helpful and the cook was more than willing to prepare potatoes without butter and salt.  This really made a huge difference!

Plus, they have a binder with a complete nutritional breakdown of their menu items.  Viewing this also helped.  All restaurants should offer this feature to customers.  

Our food was tasty and the atmosphere was pleasant.  It is a very clean and well lighted space.  

I would have given this restaurant 5 stars, but I found it a bit expensive.  

We would eat. Here again.  It was an overall good experience."}
{"text":"I love the Good Egg.  I think I have been to the Good Egg at least 20 times in the past 2 yrs and have never been disappointed with the food.  Oh sure, there are a couple of grouchy waiters (not waitress') but even if they are grouchy, they are still competent.  

The Good Egg is one of those places that I like to take friends out to when friends come to town to visit too and it is a great place for our bicycle club to meet after a ride.  To me, it just feels like a local neighborhood eatery, sort of like a home away from home."}
{"text":"Waitress was very kind and was very good at time management. I know that it being Father's Day, or a national holiday it can get very busy, especially around breakfast time. We got there around 7 and were immediately seated. They have really nice sized booths there, not the typical seating that might be in an IHOP or Denny's where you're almost playing footsies with the person sitting in front of you. 

I got the eye opener which came with four pieces of bacon, two pancakes, and eggs. Very delicious and it came at a good price."}
{"text":"I couldn't say better things about this place. We come here alot offer the gym as it is in the same complex. Food is always great, staff is awesome, and food is never cold.  

Today they really went above and beyond. Right after we sat down Debbie (manager) came up to us and asked us if we lost anything while sitting down waiting to be seated. We said, \"no I don't think so\". She said check your pockets. My Roomate said yes I lost about $400. She gave us the money. We tried to give her $20 for making sure we got the money we lost and she would not except. Very professional and classy."}
{"text":"Food here is always great. See my photo regarding the New Fresh Juices. If you are like me then you expect a full glass of juice. Instead I got a full glass of ice with half a glass of juice. I was told they could't accommodate me and fill up the glass with super tasty juice. Boo.   

The side kick pancakes were amazing as usual so I can't say more than I have.  Some tips: be prepared for a long wait due to the popularity of Good Egg in general.  The coffee is fantastic and the noise is average considering the number of patrons."}
{"text":"Not bad overall. This is like my 10th time dining at a Good Egg restaurant and I can say that while most of the time the food is good, they never seem to get all the food hot. For instance my dish came with breakfast potatoes and while they were tasty, they came out cold. They happily replaced them but still, it's frustrating when they tell you \"careful the plates are extremely hot\" but the food isn't.  Also, they have plain coffee and flavored ones. Their plain coffee is obviously very cheap as it tastes horrible when it is anything but piping hot. Service was good today but the kitchen service seemed very slow even though we were at the tail end of their midday rush."}
{"text":"We love going to this place for breakfast! We always make sure we sit in Dorothy's section. She always has a smile on her face and makes this place worth coming to!! My husband loves ordering the old pueblo. When you go you have to ask for Dorothy, she's the BEST!!!!!"}
{"text":"When I had heard that First Watch had taken over The Good Egg I was super excited as First Watch is my family's favorite breakfast restaurant and I was even more excited about having a First Watch near our home in Arrowhead.   Unfortunately,  I was sadly disappointed after eating there.  The reason our family likes eating at First Watch is because the food is good and fresh and we don't mind paying additional for this reason.  The food at this location was just over priced diner food almost comparable to Denny's.  The bacon was tasteless and the service was lacking.  Greg our server seemed to be preoccupied in an almost empty restaurant,  as we had to ask couple times before he brought us out water.  When we asked for creamer for our coffee  he brought three creamers enough for one cup of coffee.   Needless to say we didn't ask for anything else after that.  I'm saddened that this location is lacking as I so wanted it to be our families Saturday morning breakfast place..."}
{"text":"Greg is a great server! Food is yummy and prices are very reasonable. My boyfriend and I like to come here for brunch on our days off. Wish they were open late for the days I am in the mood for breakfast for dinner."}
{"text":"We're looking for a breakfast place, so of course how do pass up a place with the word EGG in its name???

There was a substantial number of people waiting outside, good good. The 20 minute wait flew by. The interior was open and airy. The menu is quite simple, filled with simple breakfast and brunch items. 

I'm working thru a head cold so I wanted an entree with lots of flavor and seasoning to battle the no-taste buds I had. Macho Nachos and Erik got Eggs Benny. I also ordered the Cucumber Mint Refresher.

So while waiting I couldn't help but look around. Of the three servers buzzing around us, each one looked so pissed and annoyed to be doing what they were doing. No one smiled and seriously does this place intentionally hire people with bitchy resting face? 

Our orders came out and mine looked amazing. I couldn't wait to stab the over easy eggs and watch the runny yolks well, run. Except they didnt, run. They stayed pretty still, solid even.

Look, my life is pretty boring. I don't get to go out into the wee mornings and let my hair down, I don't have celebrity sightings (anymore), and battling this cold i am just makijg it day by day....and so when I order over easy with the anticipation of runny yolks, well, I want runny yolks. Disappointment runneth over. Like how I wanted my eggs.  Erik was somewhat disappointed with the potatoes on his plate....they were crushed up and seared, with not much seasoning. But can I just say the Cucumber Refresher was perfect. 

So well, I'm not from this area and I wouldn't necessarily say it was a bad breakfast. I would just probably get up some super courage to ask for the eggs to be made to my order. Otherwise, go and try it for yourself....I don't think you'll leave disappointed."}
{"text":"This afternoon made a great find at 1:30 PM on \"Mother's Day\" upon leaving the Arrowhead Mall with my wife & two sons! \"The Good Egg.\" Waiter Greg gave us fast & Frienly service and plenty of extra time to eat, as we were a little close to closing. The house sandwiches and salads were very fresh & delicious. The ice tea perfect and a flowers for my wife!"}
{"text":"Well, this isn't \"The Good Egg\" anymore- it's \"First Watch\" and I will most likely become a rare patron of this place. Unfortunately, my main reason for visiting (my favorite breakfast dish) has disappeared, the portions have gotten more expensive and smaller, and the atmosphere has shifted. Maybe i could come to love this place- but not really looking forward to going back. Who knows, maybe you'll have better luck?"}
{"text":"Wait staff is great and food is served promptly and hot.

I had the biscuits and gravy which were served with country potatoes and two eggs.

Gravy is bland, had to pile on the salt and pepper then douse them with cholula hot sauce and actually gave up after two bites.

Potatoes are seasoned well but really dry. Stopped after a couple of bites.

Asked for my eggs to be fried hard. They were runny so didn't eat them either.

Tasted my mates pancakes. Not bad. Hash browns were perfect. Sausage was great.

I'll be back but not for the biscuits and gravy and will be hoping my eggs are cooked as ordered."}
{"text":"I was really in the mood for breakfast and you can't go wrong with The Good Egg, they have a great offering for breakfast.  Even though there was a wait, I was able to get a counter seat quickly and Catrina was a great waitress to make the breakfast complete.  I had ala cart, pancakes, biscuit and gravy and bacon.  Everything was as order and tasted great!"}
{"text":"Been here about 10 times... each time I've had a good experience and left way too full. They have such good food! What I really love is the option to make everything healthy. I don't eat out for breakfast much because I'm so picky but at The Good Egg you have options. So I'll get wheat pancakes with sugar free syrup, egg white, and hash browns (that's not good I know, but my fave). Most of the servers are courteous, we had one that was not so amazing, but she could have just been having a bad day, we're all human! Nice little place to grab a bite after the gym or a hike on a Saturday morning."}
{"text":"Breakfast was very good and our server Greg was outstanding! The pancakes are one of the best in Arizona! If you're in the mood for biscuits and gravy it's very tasty, I had an omelette which was excellent. And I judge a place by the coffee they have excellent coffee! The Good Egg is one of my favorite breakfast places!"}
{"text":"I was meeting friends here for breakfast Saturday morning and showed up a little late. They had already ordered. When I showed up the waitress asked what I wanted to drink, but didn't bring me a menu or come back for over 10 minutes. When she finally did it wasn't worth ordering since their food would be out way before my own. In the end I also got charged over $5 for a single glass of orange juice. This place is too expensive and the service isn't good enough to bother. There are plenty of other places to go for good food."}
{"text":"The good egg is yummy!!! The grains,nuts  and fruit bowl is delish. Also the biscuit and gravy breakfast was very yummy. It's busy in the weekends but very quiet on weekdays."}
{"text":"I came here craving an old favourite, The Crabby One, but instead found that it was bought by First Watch. The menu is some combined version of the two, and it looks like they got rid of all the amazing menu items that made The Good Egg my favourite breakfast joint. So I ordered a veggie white omelet with Brie and it was almost gross. Zero flavor, steamed veggies with no salt. If there was cheese, I never saw it. My husband got an eggs Benedict and the egg was cooked well, but the sauce wasn't rich, the ham was lunchmeat and wasn't thick, and the hollandaise was to lemony. No seasoning either. Total fail. And we paid $31 for unflavored food and two cups of black coffee. Most expensive gross breakfast I've ever had. I won't be going back. If you used to love The Good Egg, I would stay away."}
{"text":"It's a great casual breakfast restaurant to start your morning. I just had the Kale juice and it tasted great. The lumberjack is really filling. I really like that they have stevia packets for coffee. A very healthy alternative. It's only open for breakfast and lunch so go early."}
{"text":"Ordered two of their fresh juices to go... They didn't taste freshly juiced. The kale tonic was so sweet I couldn't even finish it. 

The customer service was great and the young man at the front was helpful and quick.

I didn't get any food so I can only speak for the juices."}
{"text":"Breakfast 10:30 9/8/13
Acceptable is about it. My Pesto Parmesan eggs Benedict were barely warm. The hostess shouldn't be a hostess. Poor customer attitude. You should NEVER wave your hand towards a customer to get their attention when they're 10 feet away and make them come to you. Pick up 2 menus, walk over and say \"your table is ready, if you'd please follow me.\" Even her greeting seemed like she was irritated she had to be there. There are better Good Eggs in town."}
{"text":"If I could rate the service for this specific location less than zero, I would. It should not have taken an hour to get our food when my party was 2 out of 8 people in the entire restaurant. 

Let's start with the poor management. Apparently a business meeting they were doing a catering pickup order for was miscommunicated and was actually a drop off. So instead of sending a busser or back of house prep cook, the manager decides to send 2 of the 3 servers to the drop off. How do I know this? Everyone did, as the manager was literally yelling on the phone for EVERYONE to hear. How hard is 10 people for one server you ask? In my opinion not much at all, but you may need to tell that server that she needs to pick up the other tables as the other two servers left. 

Here's where the fun begins, 5-6 parties show up at once and at this time the one server still hasn't made rounds to the abandoned tables to take their orders. You would think the manager would step up and wait some tables, however she was busy telling new potential customers that \"we cannot seat you. We only have one server\" as their confused faces looked upon 30+ open tables. At this time, two parties that were seated half an hour ago were walking out because their orders haven't been taken yet.

As for the food. They earned 3 stars for my girlfriend's plate as it was subpar and a 1 star for mine. It takes much skill to burn and under cook potatoes at the same time. Maybe that's worthy of 5 stars. The cook's a magician nonetheless. My chorizo had the consistency of tofu and was deemed inedible. I do like tofu but not when it's advertised as pork. I will not be returning until the under new management sign appears."}
{"text":"Average breakfast food. The service at this location is not the best. They ran out of fresh juice the day i came in. The apple crunch blintz are a light and tasty breakfast and the country combo omelette will satisfy even the hungriest person."}
{"text":"Stopped in this morning because a friend started waiting tables here.  Obviously the service was stellar as hers always is but because I have a bias I am not including it in my rating.

Got seated out on the patio and it was a wonderful morning to do so.  Getting there early it wasn't very crowded. I noticed over twice as many cars in the lot when I left.  Whoever ordered the patio chairs never had to sit in them for very long.  They are sorta ok for setting back with coffee but a bit of work to set up to the table.

Speaking of coffee I had decaf.  For breakfast I had scrambled eggs, sausage, pancakes.  Eggs apparently got plated first as they were only lukewarm as the rest of the dish was still hot.  They honored my request to cook the sausage well.  I actually liked the thin pancakes, they were not doughy or over crisped and were still warm enough when I got them to finish melting the butter.

The Good Egg is not my favorite breakfast spot but it is ok and consistent across the chain.  And it is an Arizona chain."}
{"text":"Great food, as always!  I'm pleasantly surprised at how consistent they are, across multiple locations.  Service was great, considering the busy Sunday Brunch crowd."}
{"text":"We were seated quickly, but the table was barely dry from being cleaned.  The booths had crumbles, I just used the menus to wipe the seats.  The server came back quick to get drink orders.  I ordered the baked potato skillet:  2 fresh eggs* any style atop fresh, seasoned potatoes, bacon, roasted onions, sour cream, scallions & tomatoes. Served with an English muffin.  The food was very bland!  I normally don't add salt to my food, but I had to!  Our server was nice and very attentive."}
{"text":"Service was inattentive and my food was cold, so I sent it back.  My 'scramble' was 95% potatoes, we won't go back."}
{"text":"I've recently decided that I am into breakfast.  Pretty much every Sunday for the last month or so, I've enjoyed a decadent brunch.  I was meeting a friend in Peoria this time around and thought The Good Egg was a decent spot to check out again.  This friend of mine happens to have a two month old infant and it was totally a fine spot to bring a baby.  

There are, unfortunately no delicious mimosas to loosen you up, but water is always a good alternative.  Or, a hot chocolate in my case for this morning.  

I had the Livin' La Vida Loca omelet which was pretty much the perfect amount of spice and flavor.  It is an omelet with a Southwestern and spicy flare.  I omitted the chorizo for mushrooms and was so very pleased.  I think the name is quite ridiculous, but it most definitely a Mexican inspired omelet.

Our service was friendly and efficient.  A solid breakfast spot (minus the lack of mimosas), for sure."}
{"text":"Can we please just change their name?

The few experiences that I have had at The \"Good\" Egg have been horrible. The food is never good and I feel like the waitresses really loathe their jobs. The one time I did have an extremely nice waitress, the food was the worst. It seems like it is never a win-win with this place, but rather lose-lose. 

I doubt I will ever think about going back here, but in the rare case that I do, I will hopefully have a better experience."}
{"text":"Bad Egg.  Food is not good. Got the skillet which tasted like old Chinese food,  pancakes were so dry.  Our server was great however. Won't return."}
{"text":"Fresh squeezed orange juice for $5 was a bit pricey but it was wonderful OJ!

The skillets (Lumberjack and Baked Potato) were wonderful.  The hash is more home fry ish but it actually lead to a very good texture with the skillet.  The service was very nice and attentive.   I am very glad to come to this every time I am in AZ.

They even have a frequent diner card, and on Mondays you get double stamps."}
{"text":"While I'm still trying to find more awesome breakfast spots when I visit my friend in AZ, I keep coming to this place since I find it to be an acceptable place to get decent early morning fare. 

I received nice and prompt service and most importantly, my coffee kept getting refilled so no complaints there. The menu options will give people a chance to find something they like and I do appreciate a good amount of healthy options.

I still wish I can find some local brunch gems but this place suffices in the meantime."}
{"text":"Just recently moved to the area and happy to have found a go to breakfast joint. They offer a wide variety of plates, some healthy, some more glutinous. The place is always busy but is worth the plate. Ask for kaitlyn to be your waittress. She hooks it up and makes the meal all that more enjoyable. 5 stars."}
{"text":"After writing my review the manager contacted me to apologize and asked if we would give them a second chance. We went back on a busy day but were seating quickly, and everything was fine. I wanted to order the omelet again just to see if they improved it, but I was really in the mood for french toast. So I ordered the french toast combo, daughter got a kids breakfast, and fiance got a skillet. Everything was really good and our waitress was good about checking on us an appropriate amount of times. I don't have any complaints really - the only thing I would say is that when our food came out, it was dropped off by someone else who just put it on our table and left rather quickly without asking if we needed anything. There was no syrup on our table, no salt and pepper, and we needed more napkins. I was a little annoyed because I wanted to start eating. But our waitress came out about 2 minutes after and realized we didn't have syrup and brought it right away without us even having to ask. She also said the salt and pepper was inside (we sat on the patio) because it had rained the night before and the humidity was clogging the salt shakers so they had kept them inside. I appreciated the explanation and overall this experience was much better than the first."}
{"text":"Yeah, I dont think we will be coming back any time soon here either. I dont know what has happened to this place over the last year, but something really bad has happened to it. 

The water pitcher had someone's hair in it. The waiter made us feel like he was doing us a favor by serving us. The eggs benedict was cold, and so were the potatoes, so we waited 10 minutes for the waiter to come around to sent them back. They came back again cold. By this time the rest of the family had finished their meal so I said screw it, ate the potatoes cold, paid, and left. Gave them a sub-par tweet and they replied that they wanted to make things right with us. Still havent heard back from them. Im done."}
{"text":"We've been to this location multiple times and often enjoy it.  We've never had an issue with the food, it has always been above par.  The crowd is diverse with lunch folk, seniors, and people hungover from partying the night before.  I would give this place four stars if it were not for the extremely unpleasant hostess we have encountered numerous times.   When we went up to the front, she was on the phone and didn't acknowledge us.  We waited, and waited, while she talked away.  Finally, (putting the call on hold must have been such a difficulty) she seated us, WITHOUT speaking to us, but talking on the phone the entire time.  Um, really?  Our service otherwise, has always been great.  They also offer to go refills on tea which is pretty exciting. :)"}
{"text":"I get the same thing every single time the don't even have to ask anymore. Love it when i am hungover!"}
{"text":"Having never been to a Good Egg I was sadly disappointed.  The traffic at 10:00AM was as expected, busy. Suprisingly we were seated within 15 minutes. The waitress brought the beverages in a timely maner & that is where it stops. After taking our order it took forever for our first item to arive. My son got his cheese buger at least 5 minutes before I got my measly Spanish omlette then while we waited & waited 2 more of our party's dishes arrived . A minute or so later a fifth dish arrived. My husband waited, nothing, finally the waitress came by to see how everything was & almost left before my husband could tell her he had not received his. Oh, Ha,Ha it went to someone else. So, Ha,Ha we will take our business somewhere else.       
   saravh"}
{"text":"A hippie modern atmosphere eatery for breakfast. The restaurant is spacious, quick to bring your food out, and affordable. The entrees are big, tasty, and hearty. The florentine Benedict was savory and delicious. It came on an English muffin with cooked spinach, mushrooms, onions, fresh diced tomatoes, and Hollandaise sauce. Served with a side of country potatoes."}
{"text":"Always delicious anytime we eat here! I had the breakfast sandwich with fruit and the child had The Eye Opener. Great menu selections and the food is always hot and fresh."}
{"text":"I've only had two things off of the menu, so my review is pancake-based. 

I'm 240 pounds of beard and man and with that being said, I can't ever finish more than 3/4 of a short stack. The portions are HUGE! I like the whole wheat option, as well as being able to select different nuts, or oats, fruits, or even chocolate chips to add to the pancakes. The real maple syrup option is the deal-sealer. 

Our service here has always been good as well. When you've been here enough times, they'll start to worry when you don't come as often. Ha! 

For my fellow gym goers: They have one of the healthiest breakfast menus you can find. I'm into heavy lifting, so I love coming here to carb up. (Obviously...pancakes)

Give this place a visit when you get out of the gym, or when you're in the area!"}
{"text":"We love this place. The avocado toast is so delicious that I could eat it everyday! The smoothies are also outstanding. We take our out of town guests here and they love it too! The food is consistently great. We have tried many different options, and have enjoyed all of them."}
{"text":"Very good and different items on the menu. Service was great too."}
{"text":"This is absolutely my favorite breakfast place!  The southwest inspired dishes like the huevos rancheros and the Macho Nacho are particularly delicious.  Our regular server Greg is the best!  He always remembers everyone's favorite drink order and what we ordered last time.  He makes a dynamite strawberry shortcake with extra strawberries.  And my infant daughter adores him!  It's a very family oriented environment.  If you want a great breakfast, I would definitely recommend the Good Egg and ask for Greg!"}
{"text":"\"Nice & Simple\"
2 Eggs (cooked to order) w/ an English Muffin.

Where would I have any room to complain on something so \"simple\" :)
Only $1 to add an egg, and there's a whole list of extra sides for all orders over $5!
Place is quite the bargain for the quickness in turning tables and quality of the food.

Reason for not giving a full '5' Stars is mainly the staff and size of this location. But I'm only human, and the point of my visit is for a quality breakfast/brunch at a reasonable price. That they accomplished so bravo Good Egg."}
{"text":"We went for Father's Day breakfast and were told there would be a 15 minute wait, I didn't believe this as she was saying it, I really didn't believe it almost 40 minutes later.  The food was pretty much not cold, the plates were hot though so I'm guessing they enjoyed some quality time under a warmer.  Service was slow and the food is really nothing special.  We might give it another try on a less busy morning."}
{"text":"This is my regular Sunday brunch place.  I am 90% gluten and dairy free except when I go here.  The cinnamon french toast is better than well....lets say a hot man.  The skillets are wonderful and the wait staff is usually very friendly.  My only wish is the coffee was a smidge milder."}
{"text":"A good solid breakfast place.

It's not going to change your life but sometimes you just want someone else to make you bacon!

The food was good, the place was clean and the restaurant was well staffed. 

I would recommend this place to anyone that wants to have breakfast out but would like something way better than an IHOP etc."}
{"text":"We decided to try Good Egg once again, I was reminded why we never came back. I like the fact that they have the amount of calories next to the menu items but the food was not great. The \"whole wheat\" bread was the exact same bread that I would get in my elementary school lunch, which was a ghetto school. The egg whites that I had, had oil at the bottom of the dish and not a normal amount of oil either. I will not be coming back and do not recommend it."}
{"text":"Sub par food that's overpriced, but even worse is the service. Denise was my server and she was awful. Looked like the whole staff didn't want to be there, but she was particularly bad. Didn't ask us if we needed anything or how our food was even though she asked the people next to us moments prior. She would waltz past us, forget about the basic things asked of her like a to go box, and to top it off the  first and only time she stopped by our table without us having to flag her down was to drop off the check, without making any eye contact, and telling us that we could pay at the cashier at anytime."}
{"text":"The good egg is rotten. Long wait to get seated, long wait for our food which was for the most part cold. After returning one of the dishes still was missing requested side dish. The one highlight was the Bacado and avocado toast was very good and the two that came out hot!"}
{"text":"Been coming here since they opened, great food, service and affordable. Family friendly"}
{"text":"Hhhm. Food was excellent, service was lacking. Not the servers fault that the place was packed with a waiting list when there are only 5 on the floor. If management gets there stuff together this place would really rock!"}
{"text":"I always enjoy my breakfast at The Good Egg! They have a large menu so no matter what kind of mood I am in, I can find something to satisfy my hunger. A BIG plus is their add on items that are only $1! As long as you buy an entree that is $4.95 or more, you can add an item for only $1 more. I typically get an omelette and add $1 pancakes. What a deal!
Also, love the free meals cards. Five stamps=a free meal. At this location, Mondays are double stamp day so you can fill up a card quickly.
The service is usually fast and friendly. However, there is one hostess who never smiles and seems to always have a bad attitude. There have been times when she doesn't even speak to me when I go to the register to pay. Not a deal breaker, but I probably would have given 5 stars if it weren't for her!"}
{"text":"This place was aweful.  This was our 3rd time trying it hoping it would get better...it did not.  My husband ordered a ham skillet featuring grilled onions, mushrooms and peppers with eggs over easy. Waitress sold us a side of hollandaise.  The veges were not grilled and eggs were over hard. The hollandaise for $1.00 was about a tablespoon.  The brown sugar that came with my oatmeal was hard. We will never go back."}
{"text":"What I ordered was actually pretty good I'm not going to complain. It's better than a lot of other places as well. I wrote a bad review another good egg that I ate up but it's probably just the food that they serve me at that place. This what I ordered is actually really good and I would recommend it it's not bad it's better than any I hop out there or Denny's for pretty much the same price. It was pretty feeling as well. The service was nice as well and I have to think the manager from the downtown location she hooked me up with the free on the house breakfast lunch or dinner I just want to give a shout I'll turn say thank you for changing my mind away I think about the good egg. Just because one a bad experience does that mean it's always going to be bad."}
{"text":"Just average. My eggs Benedict Florentine was good but almost no discernable bacon on it. I'll stick with Black Bear Diner"}
{"text":"Great food and large servings! Sometimes a little crowded and noisy but overall dining is pleasant.  Usually try to eat here at least once a month with the family! Awesome wheat French toast and best bacon slices around town!"}
{"text":"We have breakfast at the Good Egg in Glendale and love it. Kaitlin was our waitress last time we were there and did a great job taking care of us. The food is always great. We will be back!

Bob and Judy
Glendale, AZ"}
{"text":"So strange...we were added to the waiting list (about 8 on the list ahead of us), looked around and saw tons of empty tables/booths. Super slow at getting people seated at them! Very high prices ($5 for a single pancake)! The server was fine, breakfast a bit slow in delivery, and food just okay. Won't be returning!"}
{"text":"Four peaks French toast is the best, and of course I love the whole staff and the managers!"}
{"text":"My first trip to this restaurant. Service was good. Prices reasonable. I had the classic eggs benedict which were so-so. Good choices on the breakfast menu otherwise. Coffee was decent. Overall, I did not find the food worthy of making a regular trip back here when there are many other choices for breakfast."}
{"text":"Been here numerous times. Food is decent but i think tad over priced. Customer service has always been good. The crowd is typical church crowd."}
{"text":"Great food and great service. Love the free coffee while you wait!  Lots of good options. Definitely want to try the fresh juices next time"}
{"text":"Great breakfast items.  The just changed the decor inside from grandmas house in the 80's to hipster barn.  It looks nice.  The menu seems shorter now but plenty of breakfast favorites. The portions are pretty big and you could split a meal if you want to. The pancakes, French toast , and omelets are all good.  The bacon is pretty good too, thick and cooked well. I've never had the lunch it looks good but I definitely come here for breakfast.  You have to come early on the weekends before 9 or the line can get pretty long."}
{"text":"Been coming a long time. Food is good and very customizable,  which can be handy since they changed their menu a little while ago and some of the old favs arent as recognizable(now a burrito when i used to order scramble-Hot Juan, but they still make the scramble if you ask). Multiple batter options, no grief when I request a single yolk in my scramble...etc.  Service can be a little slow even when not too busy, which is my only real gripe. Love the Organic Harvest Jalapeno hot sauce too!"}
{"text":"I was passing through PHX and my friend suggested this place. I hadn't heard of it because I'm not from the area so didn't have an idea that it's a chain until I tried to map it. It was a mess trying to figure out which one he was talking about; however, when I arrived I was  not disappointed. 
     I was greeted as soon and I came through the door and sat at one of the empty booths with my wife. As we waited for my friend the server came and got our drink order. The entire place has a cozy, modern feel, with a lot of wood worked into the decor. I really liked it a lot. It was interesting too look around. When I saw that it was a chain I somewhat expected an IHOP or Denny's vibe, but it's definitely a couple of steps up. 
     Lastly, I got the eye opener plate with ham. Everything was cooked how I asked it and the coffee was decent. Not craft or quality coffee, but it wasn't bad coffee either. I would be happy to come back."}
{"text":"Chain restaurant location here in Peoria has been on par with the others in the valley.  Service, food, and the wait are fairly consistent.  Omelets are what I recommend for this place (who wouldn't have eggs at a place called 'The Good Egg' ??).

Pass on the pancakes.  Coffee could be improved."}
{"text":"Average breakfast place.  

I think the egg dishes are more unique than IHOP etc, but nothing really special.  

Usually the servers are really nice, but there was one that made unnecessary comments on what my friend ordered."}
{"text":"So the family would like me to start off by saying wouldn't it be nice if the servers smiled at least once. Oh yes and why are they so stingy with the butter. Oh and when did they change their menu. 
I guess we shouldn't expect good things to remain good forever, but we can dream. We used to enjoy The Good Egg but now......well.....meh. Wish we still liked it but, no."}
