{"text":"The fish and chips here is really good. You can tell by the packed parking lot and long line to get in for dinner.   We came here on a Saturday night at around 7 and they were sold out of halibut!! They had just run out so the server had to come and ask us for a new order. So disappointed! I love halibut! We ended up getting haddock and basa instead.  The fish was fresh and flaky and battered perfectly. Chips are great too and coleslaw was yummy.   Need to come back for the halibut!"}
{"text":"Have only tried their takeout but can be picked up in 10 minutes and soon you are dining on some delish fish."}
{"text":"The best fish and chips in Toronto.  Nice service and the nice owner lady is always walking around.  My parents - in their 80s -  loves the place and food as does my 3 year old granddaughter.  Food is always consistent excellent."}
{"text":"Excellent meal last night with friends.  Fish was an ample portion, fries were plentiful and excellent.  Key Lime pie to die for!!!  All serviced with a smile and a great sense of humour by our server, Deb.  Will definitely go back!"}
{"text":"Very pleased!  Best fish and chips I've had in years.  Great service too!  Will definitely come back and reccomend"}
{"text":"No frills great place for some fish and chips.  We got the Poutine as well and it was excellent.  Great value for the price!"}
{"text":"I stopped by yesterday night for dinner and the place was packed! Luckily a table was leaving just as I entered the restaurant so getting a table was fairly quick. When seated, I ordered a fisherman's platter and a halibut fish & chips that was shared among 3 people and some appetizers (calamari and cesar salad).  THIS PLACE IS BOMB! I was really impressed with the sizes of the portions and the amount of fries they give you with the orders. The fish filets were nice and thick and the batter on the fried everythings were crispy and not overly oily.   The waitress that waited on us was very helpful too and was super friendly.   It's out of my local area but I'll definitely be going back here when I want  some more fish 'n' chips!! RECCOM: Halibut (soft, creamy texture and was very flavourful)"}
{"text":"Went for lunch while my car was being washed, and boy am I glad I found this place.  Haddock was great, and the atmosphere demanded having a nice beer with the meal.  Dessert was really the icing on the cake though.  Beer-battered deep fried pineapple with a scoop of vanilla ice cream.  What more needs to be said?"}
{"text":"Very popular fish and chips place. There was a bit of a line-up on a week night.  Mostly mature adults when we were there.  I chose the fish and chips with halibut. The fish was tender, white and delicious, the batter I found a bit heavy even though it was crunchy, but their fries were a bit disappointing. They looked like all the little end pieces had been put on the plate.  Didn't have dessert. The surroundings though are very dated, some of the furniture etc. look very old,  and the place sure could use a facelift. Looks like it hasn't been renovated in many years. We sat in the extension part and it looked quite drab and very cramped, very basic and has probably never seen an interior designer."}
{"text":"This place is just absolutely amazing. I love coming here.   The haddock and poutine is my favourite. By the way the busser is SO cute. Jesus."}
{"text":"The Olde Yorke Fish & Chips was rated by blogto as the best fish and chips in Toronto. So, I decided to try it. They basically turn a dish that is often served roadside in newspaper into a high-class thing. If you know fish and chips, this place will definitely be up to your standards. We also had some beer and tried the dessert. The apple crisp and ice cream was everything I thought it would be. As we were leaving the line for their dinner rush was starting at the front door. Basically, come early or late for whatever meal you want and you can avoid the lines."}
{"text":"The line up was long but moved quickly. As far as fish and chips are concerned, it doesn't get any better than this. I had the halibut and chips. It was a very generous portion of perfectly fried chips but the absolute winner was the halibut. The batter was light and crispy and not oily at all.   As an interesting side note: they also had deep fried mars bar on the menu. will try next time."}
{"text":"So many great reviews but my experience was nothing to rave about. Ordered the halibut. Much to my dismay, crust was not crispy...  sat under a heat lamp a little too long? Flavour was okay - accompanied with bland tarter sauce. Was a fairly small serving of fish. But because of that i had no hesitation in ordering dessert, the deep fried Mars bar! But alas, that too fell flat ;(  An anorexic serving. 2 thumb-sized morsels - were these baby Mars? - served alongside a scoop of vanilla 'ice-milk' ice-cream. ie. puddle of milk beside my mangled mess of caramel.  On the upside service was excellent. Server was friendly, attentive, and had a good sense of humor. Decor was homey and comfy - small rooms throughout, red velvet seats, warm ambiance. They also have their own parking lot - nice bonus! Unfortunately even though it's in my neighbourhood, doubt i will return. I left craving good fish & chips!"}
{"text":"One of the best I've ever had. Second to none in the GTA. Wait staff extremely courteous; however, parking is difficult at most times."}
{"text":"The food is decent here. There are a couple things that bother me about this place though. I ordered the haddock and my boyfriend ordered the halibut. They both tasted and looked exactly the same. The price difference just isn't worth it. Secondly, the most irritating thing is the drink issue they have going on here. The pop is regular restaurant free refill price. However, you don't get free refill. Even worse than that the cups are so small. They pour them out of a can at the bar and refuse to give you the whole can. I watched them pour more people's drinks and noticed that one glass of pop isn't even a whole can, you get less than a can of pop for typical restaurant prices with no free refills. It's so irritating I almost want to give them 2 stars but the food isn't that bad."}
{"text":"One of the better fish and chip spots in Toronto.  BATHROOM - clean and tidy!  I always make sure this is the first thing I check out - because it gives a clear indication of how they care for the kitchen.   One of my pet peeves about fish and chips is the batter.  It's either too oily or too heavily crusted over my fish.   The other pet peeve is the limited range of seafood offered at most joints.  What I loved about Olde Yorke Fish and Chips is that it satisfied both my concerns. The batter is light. The seafood variety is plentiful & fresh. I love that they can tell me exactly where each type of fish/crustacean comes from.  For appetizer I tried the special of the day \"cod cheeks\".  Being that most people shy away from this part of the fish (they don't know what they're missing).  Generally, this is a part that goes to the \"elders\" of a family when my family eats fish Chinese style.  Being one that usually forfeits this part to my elders, I was happy to indulge.   They didn't disappoint - the fish was fresh, tender and juicy. With a little bit of tartar sauce - it was delicious.   I had the halibut and chips - the halibut is typically a meatier type of fish (similar to salmon).  It's very difficult to cook properly so that the meat remains juicy and tender.  I wasn't completely satisfied with how it was cooked because it was slightly over done. The fish was a little too dry and too chewy for my liking.   The bf had the fisherman's platter.  It has a mix of shrimp, scallops and haddock.  This was delicious. Each item was cooked perfectly.  The only reason why I gave this place a 3 out of 5 was because of: 1) Service 2) Halibut being dry  Reason #2 I've explained above, so let me get to the #1 reason why this place got docked on points.  It was lunch hour, but it wasn't extremely busy - there was no line up.  Our waitress had a very condescending method of talking to us upon taking our order.  On top of that, even though she wasn't serving us, we could hear her gossiping and making snarky remarks to her other colleagues (about what, I wasn't sure.)  This didn't make for a very pleasant dining experience being seated all but 4 ft away from the action.  A couple sat in a booth behind us and complained about the cold drafty wind to our waitress. She went and got the hostess, who indignantly reprimanded the woman saying \"when I first seated you, you said you didn't mind sitting here!\"    What kind of service is that?  Maybe the woman didn't realize how bloody cold it would be when the hostess sat her there.  Either way, as someone in the service industry, it goes a long way to not make a snarky remark and try to prove to the customer that you were right.   A dining experience isn't just about the food - it's about the environment that goes with the food.   I was not impressed with the environment.  The manager didn't set a great example either - standing behind the bar, sorting through papers and indulging on the gossip. He really should have stepped up, seen what was going on and made sure the staff were on tip top behavior.   In conclusion - this place does certain menu items right. But the staff behavior & environment could sure use a facelift."}
{"text":"Have driven by a number of times and noticed a long line up. Checked it out this evening a quickly realized why the line. We were seated within 2 minuets. Excellent service. Ryan, our waiter was attentive and helpful with the menu. We ordered the Fisherman platter, onion rings Caesar salad and for dessert the calamari. Everything arrived in order and appropriately heated. We will return to try the rest of the menu"}
{"text":"I have tried many fish & chips places but I have to say that I have had the best fish and chips at this restaurant. I can't comment much on their customer service as I always get it to go and I have only dined in once. They have a separate entrance for a take out which I really love about. The portion is always big and it's very crispy. If anyone asks me to recommend a place for fish & chips this place would be the one I would strongly recommend."}
{"text":"Best authentic fish and chips in a great British pub setting."}
{"text":"Never had such good fish and chips. Reasonably priced for sure. I would suggest halibut 110% of the time. I've tried them all though and they are great! Enjoy!"}
{"text":"Go there from time to time during curling season. Most food on menu reasonable, service also okay. A touch too pricey for a chipper IMO   They will bring free bread to the table but only if you ask. If you order the deep fried fish, tell them to be sure the batter is cooked thoroughly. They run their fryers a little hot for speed, but often batter inside and sometimes fish remains slimy and uncooked.  Nice British-ish atmosphere, great place and great ambience.   4 stars"}
{"text":"Ive been dying for fish and chips so I looked on yelp for the place with the best reviews. It just so happened to be olde york fish and chips. I had the halibut and poutine ($19) the fish was a decent size and was not oily like most battered fish. It was light and very good. The poutine was also very good. The restaurant was decorated old school and looked super cool. I quite enjoyed my visit there. This will definately be my go to fish spot from now on."}
{"text":"The food was really good. We ordered the clam chowder which was heavenly! We ordered the seafood platter and swapped the haddock for halibut. We also got a side of the amazing onion rings. These onion rings are gigantic and are so worth it!! Definitely a must visit for fish and chips!! The customer service was okay. It wasn't as great as I thought it was going to be. Parking is a bit of a hassle especially if you have a bigger vehicle. I would suggest parking across the street or finding parking elsewhere. We ended up getting a parking spot but was hard to get in and out of the car. We went for dinner at 5 pm on a Friday and managed to get a seat in the partially outdoor area. By the time we were leaving, the line up to get into the restaurant was out the door. So try and go for dinner around 5 pm so you don't have to wait to get in. Overall, food was delish!"}
{"text":"Came here on a friday for dinner, and although it was busy, we waited less than 10 minutes for a table for 2.    The fish and chips were very good.  I preferred the haddock over the halibut (didn't try the cod) -- the batter was perfectly crispy and the fish was moist and flaky.  I got poutine instead of regular chips and it was delicious!    I'd definitely recommend coming here if you're looking for a place that does fish and chips the right way."}
{"text":"Best fish and chips in toronto!! The batter is done just right and the fries are nice and thickly cut!  I would pass on the fried calms they were a let down. Not much flavour.  The onion rings are huge and delicious. The best I've ever had. Perfectly battered and fried!"}
{"text":"Hubby and I have been meaning to try this neighborhood gem for a long time. We used to live in Leaside more than 5 years ago, and only now did we manage to get our act together to try the Old Yorke.  We were not disappointed.  The only disappointment is we have to travel so far to have good fish and chips again.  We went for lunch on a saturday afternoon, arriving at around 12:30pm.  The place was half empty when i went in to scout out the situation for the baby stroller.  NOTE TO PARENTS WITH SMALL INFANTS:  Leave the stroller in the car.  When you enter the restaurant, there are 4-5 steps you have to climb to get up to the dining room.  Unless you want to hurt your back picking up the stroller to climb the stairs, just bring the car seat.  Oh, and there IS a changing table in the washroom (in the women's  only - aren't we living in an equal opportunity society nowadays?). We assumed they didn't have one, and proceeded to change baby in the backseat of the car - oops.  I had the halibut and chips, hubby had the fisherman's platter (haddock, shrimp, and scallop).  The food came very quickly, a nice change from Blue Nose where we had to wait more than 30 minutes for our order last time.  By the time we dug into our deep fried goodness, the place was starting to get packed.  There was a lineup by 1pm.  My halibut arrived golden and crispy.  The fish was flaky and tender.  The batter was light and not oily.  The chips were fresh cut and delicious.  You know you have great fresh cut fries when you have the little pieces of potato skin amongst the big fries that are super crispy and so yummy. I cleaned up my plate. Hubby's fisherman's platter was very sizable.  Generous portion of haddock, 4 pieces of shrimp, and 3 pieces of scallops.  I had a piece of the shrimp.  It was perfectly cooked with a good bite.  Nothing worse than overcooked shrimp, right?    My plate didn't come with tartar sauce, so I flagged down our waitress to get some.  Apparently tartar sauce is by request (but it comes standard with the fisherman's platter - don't ask me why).  Even though the menu says \"all main courses include coleslaw and bread with butter\", our waitress asked if we wanted bread after taking our order.  We said yes.  The bread didn't taste baked in house, but it was good.  We didn't have enough stomach room for dessert, but I would have liked to try the deep fried pineapple rings with ice cream.   All in all, I will return to the Old Yorke if I'm in the neighborhood.  I've heard of the lineups at dinner times, so going at lunch is probably the safer bet.  And if there is a huge lineup, there's always Duffs on Bayview to fill in that deep fried goodness void!"}
{"text":"Best fish & chips in T.O.   hands down!  It'll be busy but if you can brave the lineups this tight little place is perfect for a pre-movie dinner."}
{"text":"My new obsession - I pick up once a week and the only reason I'm not giving it 5/5 is the price. This is because I find the halibut really much better than the other varieties of fish they do but it costs a lot more and the portion is smaller than the other fish but really I get it so I'm not too bothered. Now the thing is I do put it in the toaster oven when I get home so it's hot again and makes it more crispy and I'm able to drain off excess oil so I love doing take out I think more than probably sitting there. Take out service is great I call ahead and it's always ready for me. It's very authentic and fresh"}
{"text":"This is my favourite fish and chips place in Toronto. They have good portions and friendly service.   I got the clam chowder to start and it was good, vey creamy and with a good serving of clams. For our mains, I got the halibut with fries and my friend got the cod with onion rings. The onion rings were huge and crispy. Both fish were delicious but I preferred the cod over the halibut.   They do have their own parking lot but it fills up fast during lunch and dinner hours even on weekdays. There's also street parking around the restaurant."}
{"text":"Best fish & chips in Toronto. Anytime I crave fish & chips, we go here. Take out service is great as is the dine-in."}
{"text":"Haddock and chips. Absolutely delicious!  Perfectly fried. Does not taste greasy. Love Love the tartar sauce. Good service. Luckily we got there when there were few people there. When we left, there was a line out the door waiting for a table! Great service as well."}
{"text":"Best fish and chips in Toronto period.  Eating in or taking away, tasty food and great service."}
{"text":"Poor service. Food was taken away even we were not done, constantly asked if we were done even restaurant was empty, didn't pour us water, didn't give us tartar sauce...not a good experience"}
{"text":"gotta agree, folks this is good fish n chips! the fish is massive, the portions are great, ambiance chilled. Im gonna be eating there for a while. Wanted to try the cherry pie dessert, unfortunately they were out of it.  Holding up all 5 fingers for this place, it deserves it!"}
{"text":"I went there for the first time last week and all I have to say is \" What's the big deal\"?? What is it with all the great reviews for this place?  The fries are soggy, the fish (in the halibut fish and chips) is just greasy, too much breaded and a small piece of fish for the $13 dollars that I paid.  Just look at the pictures of other reviews here of the fish..it's so small.  In a nut shell, don't waste your time here..  there are much better places for fish and chips in the city.  Actually anywhere but here."}
{"text":"Wife has wanted mushy peas for years and came across this place when searching Toronto best fish and chips. Wife had chips, mushy peas and gravy 10/10 for mushy peas  I had cod and chips Delicious and very crispy batter  The queue to get in was out the door  Thid business should never fail with such quality food"}
{"text":"Fish and chips have always been one of my comfort food and every once in a while I crave it. I have heard good things about this place and i've always wanted to try it out. And finally i had the chance one Saturday afternoon. We opted to go after lunch hours cause i read reviews that they have limiter parking. We arrived at 3 pm and we did not find parking right at the restaurant but there was a lot of street parking around the residential area. We were seated right away and our server was pleasant. We ordered haddock, cod and chips and both are good. The batter is not overwhelming and its very crispy. Really satisfied my fried food cravings. The tartar sauce was good too and it looks like its an in house made one since it was not in a packet. And they gave us more than enough tartar sauce. Definitely one of the best fish and chips place in toronto."}
{"text":"great place always a high level of good old comfort food the staff have been there forever and always take care of you"}
{"text":"Best halibut and chips in town. And accommodating, friendly staff. Thank you Anjanette for the great service."}
{"text":"Great fish and chips.  Will be back.  Received a big piece of fish and the batter stayed crisp until the last bite.  Impressive.  The fries were great; fresh cut, crispy on the outside and creamy on the inside. It also comes with a little paper cup of coleslaw, but nothing special and was a miss for me."}
{"text":"Our family has lived near this restaurant for years, but never got around to trying it as we were in the fish and chips business. It's been 7 years since we sold our establishment, but were never satisfied with other places we have tried.  We have been here twice now and can say with certainty, we will be back.  Portion size is reasonable, given that the price of fish has increased in the last decade. The chips could do with some improvement, some parts were soggy and others crispy.    Service is friendly, but they do get fairly busy on Friday and weekends.  Parking spots are limited as well but as others have mentioned, plenty of parking space and space in the plaza across the street if you're arriving for dinner after plaza business hours."}
{"text":"Non-greasy fried fish, and thick cut chips. What's not to love?!  I was first introduced to this place over 15 years go when my dad took me to work one day and treated me to lunch. Since those 15 years I've yet to find another fish and chips place better than this one.  They use fresh ingredients and you can taste the difference. Price vs portion size is spot on.  Depending on when you go the lines will be long but it's worth the wait. Everyone that I've introduced this place to has always loved it without fail!"}
{"text":"Best fish and chips in the city so far. Generous portions and clean space. Set up nicely for take away."}
{"text":"I come here all the time. Fish and chips are the best. Any other place can't stand up to it. The fish has some much flavour and just enough batter. The fries always come out perfectly golden..  its making me hungry right now thing about it."}
{"text":"I agree with previous posters. Best fish and chips in town. Great service. Highly recommend it."}
{"text":"Frankly, I would not give this restaurant 1 * , but it is the lowest option. These people have no consideration for handicapped people. I was horrified at our treatment.  We went to this neighbourhood restaurant for my best friend's birthday dinner ( at her request), and she was excited to about her evening.   There was a 20 minute wait, so we ordered a drink from the bar, the 2 guys each ordered a beer, and the girls (my friend and I) decided to split a beer as we did not want to fill up before our fish and chips, as they can be quite filling.  We were then seated and put our order in.  We ordered a half litre of wine with dinner, and a short time later, the waitress came back and told us she could bring our food, but she could not serve us any alcohol, the half litre of wine. I, discreetly, asked to speak to her, to let her know that my friends husband had a brain injury and is handicapped, and that she might have misread the situation.  He walks with a limp and has a left side deficit from his stroke, and sometimes speaks loudly.   She then told me that it was my friend,  (his wife)that was slurring!?  Just to qualify, she had not even had half of a beer. I know this because we left half of it as we walked out.  I understand that they did not know he was handicapped, but when I explained, they did not change their position.  It was humiliating, and they live in the neighbourhood and have always liked to go here.  Needless to say, they will never be back and neither will we.  We will let our friends know how awfully we were treated as well.  I am not handicapped, myself, but cannot believe the treatment that we received.  I would love to know what this woman made her judgement on. We went to another neighbourhood restaurant and were treated as anybody should be, wonderfully! At least she still had a nice birthday.  We are all 50 +....., not that it should matter. Just to say again, will never go back, and if you are handicapped or know and care about somebody who is, please do not give this establishment your business!  I am still in utter shock at our treatment."}
{"text":"Best fish and chips in the city, hands down. I have been ordering takeout from here for years. The actual restaurant is a little dated and is a much older crowd, but the food is absolutely delicious!"}
{"text":"I went here for lunch during the week.  Our party of 3 were quickly seated and quickly served.  Busy with seniors, families and some other middle aged white collar workers.  I had haddock and fries - nice and crispy.  I had to ask for tartar sauce.  I usually don't eat greasy food but it was your standard fish and chips.  No complaints.    Deep fried Mars bar?!  Maybe next time."}
{"text":"Best fish and chips in Toronto. I always get a greek salad, onion rings and the cod. When I am feeling like a real glutinous fatty I go cray and get a deep fried mars bar. I don't actually like fish and chips but love Olde York. There is almost always a line up in peak hours just to let new comers know. The best thing about this place is the staff who work their bottoms off to please the customers and make sure everyone is happy."}
{"text":"This is hands down the best fish and chips in town! Food was scrumptious - fish was juicy, flavourful and cooked to perfection. I also had the clam strips and it was the bomb!!! I'd go there every day if I lived in the area. Service was outstanding. The hostess was very friendly and tended to our needs. Kudos!  Everyone, go try this place! It really is the best in town!"}
{"text":"The fish and chips are great! We ordered haddock and cod along with chips and onion rings. The batter was light and crunchy although cooked a bit too much as the fish had dried out a little on the haddock. Servers were friendly and attentive and orders came out pretty quickly considering the place was packed. Prices are really reasonable for quality and size of servings. I love this place and would definitely come back. The chips are as good as any I've had since leaving England. Oh and don't be afraid to sit at the bar if the booths are full!!"}
{"text":"How have I not reviewed this place? I live here.   OK, not exactly - but it's definitely on my list of frequent haunts.   What brings me back (aside from relative proximity to my apartment) is the crispy fried fish.  Heavier and heartier than tempura, yet retains satisfyingly crisp batter shell housing a flakey, moist, and flavourful fish of your choice (halibut, haddock, cod & hake).  Ocean Wise considerations aside, the halibut is pricier for a smaller portion size.  I like the haddock taste anyway, it's more fishy-er in a good way.  If you opt for a side of onion rings instead of fries (which, by the way, you can upgrade to poutine for an additional ~$2) be prepared to pay for the price of one serving of your chosen fish plus a full order of onion rings.  Don't forget to leave room for dessert: their homemade key lime pie is popular for a reason, and if you haven't yet had your fill of brown, fried foods, there's also a battered and deep fried Mars bar topped with a scoop of vanilla ice cream.  I've yet to try the sherry trifle, but I once overheard an elderly British couple complain that it \"just (wasn't) quite like Britain's\". What I took from that experience was that, hey, for-real British people come here so it can't be all that bad...  Seating Tip: Friday evenings are the busiest day of the week! Come early (before 6pm) or come late (8pm or after), else be prepared for a wait that trails outside the door of this pub. You can also do take-out if you enter the take-out door from the side of the establishment.   Ordering Tip: You'll need to specifically ask for tartar sauce if you want it. Otherwise you're looking at only the malt or white vinegar bottle on the table as condiments. If you ask for tartar sauce, the standard portion is two packs/mini cup per person."}
{"text":"They are amazing. We went to this place after 4 years and the food is still as good as before. Funny that only women work there. I'm proud of them"}
{"text":"|| Must Try: Haddock & Chips, Cod & Chips, Fishermans Platter, Clam Chowder   || Rating: (10/10) Food, (9/10) Service, (9/10) Value, (10/10) Ambience, (9/10) Presentation, (10/10) Cleanliness  || My Experience:    Came here amidst all the high reviews found on Yelp. Although there are plenty of good or even great fish and chips places in Toronto and the GTA, Olde York is easily a step above, truly amazing.   Starting with the clam Chowder, it was presented nicely. The soup itself is very thick and filled with goodies. A must Try for sure.   We split the Fishermans Platter, so we had the Haddock, Shrimp, Scallop and Chips, and added a cod. Nothing short of fantastic. Fresh fish with the perfect among of batter, nice and crispy but without the overload of oil. There was a perfect balance of fish and batter.   This spot has easily taken the crown as one of the best fish and chip spots in Toronto!"}
{"text":"I've had a lot of fish n chips in my life. These guys do it right every time.  Olde Yorke is hands down the best fish n chips in the city. Fresh cut homemade fries are cooked to perfection awesome gravy as well if you like that. The fish is a nice size piece and you cant find a trace of oil. Don't know how they do it usually from other fish n chip places your brown back would be full of grease. Bag still dry when you get home. Only problem, usually a line up outside to dine in, which should tell you something about the quality."}
{"text":"The fish and chips were exactly what everyone else says: delicious. I really enjoyed their haddock & chips.  The service was really friendly as well. I definitely recommend if you're in the area."}
{"text":"I used to think I hated Fish and Chips because I thought the doughy, oily filets in most bars are how you're supposed to get it. It wasn't until we visited Scotland that I realized Fish and Chips wasn't meant to be like that.   The Olde Yorke Fish and Chips is the closest example to what I've come to learn was authentic fish and chips and it is so very good. Their other things are good too, like the clam chowder and calamari.  I like that they have different types of fish, the halibut and chips is excellent and it is always more than enough food.  The place is so busy that we tend to get takeout more often than eat there. I wish they would not use styrofoam containers, not because it isn't authentic but once when we brought it home you could see the styrofoam is a little misshapen and melted where the fish touched it. The fish straight out of the fryer is too hot for the container. Plus it isn't the most environmentally friendly container."}
{"text":"First amazing Fish and Chips since home back in the UK. Amazingly flaky fish with amazing batter, so fresh. The chips are freshly hand made and amazingly crispy. This place deserves one more \"amazingly\" for being amazing...Woops that's nearly 5! Oh and very friendly family run business"}
{"text":"Best fish and chips in the city! Coming here is a treat since it's not convenient for me to get to, but whenever I eat here I always leave happy.  The service is okay, but the food more than makes up for it! Come with an appetite - you will never leave here hungry."}
{"text":"Whether I'm getting take out or dining in, this place is consistently great. My personal favourite is Cod & Chips with a piece of Key Lime Pie for dessert. If you're getting take out, ask for their home tartar sauce, it's much better than the packaged one they'll normally stick in.  Insanely long line ups on Good Friday and most Friday/Saturday nights. I'd put it in my top two for fish & chips in Toronto."}
{"text":"Well it is a grey Friday afternoon and we decided to stray from our usual F&C spot and truck all the way crosstown to a place that people have spoken highly of.  Wooooo Nelly!!!!!!! Got there to find the lot full and a stream of geriatrics streaming in and out.  It looked like they were serving the blue plate special in Boca and the clatter of cane and walkers was deafening.  Lets just say skinny 80 yr old Brits with bad teeth and in shorts in November is not easy on the eyes. G-d it was like Spitting Image had come to life.  So we get in the door and give our name.  A very nice looking room, although the bar as a feeding station is a waste of space. But it was a nice dinning room.  So they call our name and walk us to the back and through a door to what used to be the porch and sit us on some mid-range patio furniture and give us menus.  Ordered Cod and Chips and Mushy Peas.  The fish was an average size, the batter crispy, it was not flaky but wet and falling apart on fork, the fries okay, the slaw bland and the mushy peas not all that mushy and also bland. service was minimal and abysmal, didn't get asked if we wanted another drink til we were done. When we left we compared notes and agreed that THIS WAS NOT THE CATCH OF THE DAY."}
{"text":"Absolutely the best fish & chips in Toronto. Crispy light batter on large pieces of fish, great fries and onion rings and now tasting their steak and Guinness pie that's delicious. Highly recommend d this place."}
{"text":"The city's best fish & chips. Be prepared to line up with the rest of the blue hair catholic crowd on Friday night and check your heart monitor at the door. It's deep fried goodness at its best."}
{"text":"*****This review is solely on the service I received and not for the food*******  Amazing amazing fish and chips. 5/5  But the worst worst service ever. If you ever get Stacy - the Asian lady.   Not to be racist cause I am Asian.  Good luck if you ever get her.   So we sat there for more than 10 mins and server didn't even come present herself.  No water no nothing!! Even other servers notice that we had no service and I heard one of them ask the bar who was in charge of us.    So finally, she showed up after her co-worker told her it is around 15 mins after getting seated.  She never once came to check up on us for the entire meal, only time she came was to take our order and bring the food.  So she didn't bring us water the entire night and we were not able to flag her down cause she didn't even give us a look.  So finally we asked another waitress for water and she is like  there is no more glasses.  But 2 mins later an older lady came and gave us 1 glass for the two of us.  Okay, so why would you bring 1 glass when we have 2 people.    We sat there trying to get the attention of Stacy so we can get the bill.  Again no luck.  The place isn't even that big.  She had max 5 tables to look after.  So we asked another waitress for the bill she rudely said you need  to ask your server.  We told her she was missing so she went to find her.  5 mins later she came with bill, so I asked her one last time for a glass of water.  She cleared the table and never came back with the water.  I was just fed up now so we decided just to go now and we gave her the tip she deserved. Minimum!! We shouldn't have given any cause she didn't do anything to deserve it!!  Food 4/5 stars Service I got from Stacy 0/5  What we ordered   1) Haddock and chips                              -  $11.50  2) Halibut and Chips                                - $14.50  3) 2 glasses of water that never came  - Priceless  Don't know if I will come back again unless I am sure not to get this useless waitress."}
{"text":"3.5 STARS Definitely a solid fish & chips place that does it well. Very professional, efficient and attentive staff. My haddock wasn't oily or overly battered and tasted much better with their homemade tartar sauce which you have to ask for btw. Strange that tartar didn't come with the meal. The side of creamy coleslaw and poutine were pretty standard. Anyways this old style English pub is worth coming to if not for their fish & chips perhaps their homemade Guinness & steak meat pies which are also very good.  Don't let the limited street parking deter you, come on in for a pint!  If you don't like warm stuffy rooms don't sit at the back enclosed patio but stay upfront, cheers."}
{"text":"Olde Yorke Fish & Chips has been around for as long as I can remember and for good reason. The staff take care of you! As soon as I walked in I was greeted and sat at the bar where each stool had a place setting ready for a meal. They knew exactly what people want. Like the sign says outside: 'Fish and chips and a beer, a gourmet meal for an Englishman'.  Speaking of beer, they had a nice selection on tap and the bartender is easy to get a pint from. They had a nice hoppy IPA for me to start, and then a milder, easy-drinking, lower alcohol Tetley stout to go with my lunch which was perfect! Loved the menu! For fish they have a few choices including cod, halibut and I ordered the haddock for $11.95. The halibut, king of fish here, was $16.95. My fish was fantastic, a nice big fillet, taking up the entire length of my plate. Instead of nibbling on it, I could savour big chunky bites which was more satisfying than ever. Chips were average, and the cole slaw was creamy and consisted of a nice dollop. I asked for tar tar sauce to top it off. As I mentioned, the staff was incomparable. They keep the busy restaurant spotless and everyone worked together. A saw a mom with a toddler leave one of the cool red vinyl tuck upholstered booths messy and immediately after they left, TWO women showed up, one with a sprayer and the other with a broom sweeping and cleaning ready for the next customer. Very impressive! I remarked to the barkeep about the cool British menu which had an enticing selection of desserts, and she said the key lime is to die for. Gotta return to Olde Yorke to try that or the deep fried Mars bar. Great spot in Olde East Yorke."}
{"text":"Rain drizzling, speeding towards higher intensity, we dashed for the front door, only to be found in the takeout entry. We quickly dashed back out, turned the corner, and with relief opened the door into the dining restaurant. The line was long, we could barely fit, so with a look of resignation, but still energetic with optimism, we dared back out into the grizzly rain, and hopped quickly back inside. We debated a bit about the merits of cod vs halibut, but settled on the tried and true halibut. To a no-nonsense and efficient staff, we made our order: fried fish, with a side of chips, and gravy, and yes, one more piece of fish please. Order in hand, we ran back through the rain to take our meal into the car. We ripped open the paper take-out bag, and immediately began preparing our meal, pouring tartare sauce from its plastic prison, and sparing no vinegar for the fish and chips. Finally, at last, we took that first bite of steamy, hot, and perfectly crisped fish."}
{"text":"Service is great and the servers always know how to ensure my 2-year-old is taken care of. Haddock is excellent! Loved the calamari as well. Parking is a bit tricky though."}
{"text":"My favorite Fish and Chips place!  -Love the old British Pub feel inside. -Prices are very reasonable. -Portions are big! -Fishes are always fresh and perfectly cooked -The BEST onion rings I've had. Always perfectly crunchy yet still being fluffy with thick cuts of onion. It also is the least oiliest rings I've had."}
{"text":"- good neighborhood joint that is comfortable, and unpretentious.  - fisherman's platter (halibut, scallops, shrimp) for 17.99 is well worth it. - loved the fact that this place was full of seniors too!"}
{"text":"Had dinner here with friends and I have to say this could very well be the best fish and chips place in the city! We all ordered the halibut fish and chips -- the fish was lightly battered and crispy on the outside, flakey on the inside. Even their fries are good! They are thick cut and meaty on the inside, they aren't like normal deep fried fries. For dessert everybody had the homemade key lime pie except for me, I had the deep fried pineapple rings which were meh. I'm going with the pie next time!  Unlike other reviewers we had an excellent server (girl with the blue tattoo on her neck...can't remember her name except that itstarts with a C). The only weird incident was when a gaggle of servers were chatting by the service station at the patio door and a few if them kept looking/staring at our table. At least it felt that way.    Like other reviewers, I did notice the average age of the diners is 70-100 and a good chunk of them are Brits. And the line up starts early. We went for dinner at 5:30 to avoid the line but a lot of the tables were already full!"}
{"text":"Brilliant Fish & Chips at a decent price. We order take out at least once every two weeks (or more often if we are craving it). As a British Ex Pat I have high expectations of Fish & Chips and this place does a great job."}
{"text":"My family and I have been eating at Olde Yorke for years and we never leave unsatisfied.  The quality of the food is excellent and the service is good.  It's a cozy little restaurant with lots of charm.  The only problems are a lack of available parking and the fact that the restaurant can't accommodate large crowds.  An underground parking lot would be nice, with an expansion of the restaurant built over top.  This is a popular restaurant and waiting time for a table can be very long and physically uncomfortable, due to the tight parameters of the building.  Perhaps a second location is needed?  It would definitely help ease the congestion."}
{"text":"5 stars for the fish and the chips. Fresh tasting fish in just enough batter with crisp, creamy fries. No pools of grease (not that I could see or taste, anyway...). It was all totally soggy by the time we got it home (10 minutes) but we solved this with a few minutes on a cookie sheet in the oven. We might have used these few minutes to make our own tartar sauce to replace the Wings packets that it came with. Despite the bad tartar sauce, it's still the best fish and chips I've had in Toronto."}
{"text":"If you're looking for the best fish and chips in Toronto, this is it.  This place has been around since I was a teenager and it never disappoints.  Be sure to make a reservation if you're coming on a Friday or weekend because it gets busy!    Inside the decor is warm and inviting.  It almost looks like you're sitting down for dinner at your old British neighbors house from the 80's.  Not a bad thinf though, I like the vibe it gives off.  Service is friendly and our servers always come by to ask how we are doing and refill drinks.  Food is awesome, in fact I haven't had better since I visited Australia!  The fish and chips are so crisp along with their fries.  The shrimps and other battered sea food are also great and everything is always perfectly crisp on the inside and out!  This is the go to place for fish and chips in Tdot!"}
{"text":"If you want fish and chips you really can't go anywhere else.   The halibut is flaky as heck and the batter crisp to perfection.   Don't discount the chowder or onion rings either.  Love love love this place."}
{"text":"We loved the fish and chips. I got the halibut while the rest ordered the cod. We had fast service and delicious food. My whole family enjoyed everything. They were friendly to my kids. I would recommend this to anyone who loves fish and chips."}
{"text":"I was here on Thursday night on March 20. I had a Platter and it was incredible. Just everything you'd ever want in a fish and chips. Delicious Haddock scallops shrimp and chips, plus a great beer selection that doesn't hurt the wallet like a downtown or corporate place. The night was made better with the service. Our server was Liz (Because that's what the bill said lol) and she was fast and informative. Great attention to detail all around and it was good to see the manager walking around making sure everyone was ok. Will be coming back again."}
{"text":"The yummiest, crispiest, flakiest, moistest, crunchiest, mushy pea havin'est Fish and Chips in the City!  Love the decor and ambiance of this place. The square bar, the old pub carpeting and the nice tufted chair covers. Service was excellent and they have COD, which is what I always prefer for my fried fish. Halibut is a delicious fish, but I find it too dense for batter and prefer it roasted if I'm having it. The batter was crunchy and the fish was perfectly cooked. Chips were crunchy and soaked up the vinegar well. Coleslaw was perfect and the tartar sauce was good.  Washed down with a pint, this was the nicest lunch I've had in a long time.The best Fish and Chips I've had in a long time.  I will visit this place more often although it could't be in a more inconvenient location for me.   Worth the drive."}
{"text":"Had a great experience here for lunch. Good service, best part was the meal. We had the haddock and it was massive!! Definitely get your money's worth in terms of quality and quantity.  Plenty of seats and the fish was spot on. Most restaurants overkill the batter and this place has it right with its ratios."}
{"text":"Came here for lunch, this place was busy. Fish and chips were the best I've had in Toronto. It wasn't as greasy as they normally are. Would recommend!"}
{"text":"Great place when you are craving fish and chips!  This place gets pretty busy on the weekend so be prepared for a bit of a wait.  We came on a Saturday night and there was a line up out the door.  We waited about 20 minutes so it wasn't that bad.  We ordered the cod and chips and also halibut with onion rings.  Everything was really good.  The onion rings were huge.  I found a small piece of plastic in the onion ring batter which was a bit off-putting so I don't think I'll be ordering that again.  Both types of fish were really tasty.  Judging from what some of the other tables ordered around us it looks like they have some pretty decent desserts.  Unfortunately,  we were too stuffed to order any.  They supposedly got voted best fish and chips in Toronto.  Overall, decent place for some fried seafood."}
{"text":"I don't give out many 5* reviews. This isn't one of those \"best food ever\" 5* reviews, but rather awarded because the fish & chips could not have possibly been better. Out server was really helpful in ensuring that we didn't over order. The onion rings were fantastic, chips thick and crisp and fist great. Out table got both cod and haddock and I'll settle this right here: Haddock is better. It's not as flaky, but has more oiliness and flavour that makes the fish great. You can't lose with either."}
{"text":"This place has the best fish and chips in Toronto. When I went I also go the battered prawns and it was delicious!  I have no complaints about the food but there are a couple reasons I'm giving it 4 stars instead of 5.  First, there's often a wait to get into the restaurant. I know this isn't the restaurant's fault but I think it should factor in.  Second, the service was a bit slow. The two times I've gone have been relatively busy but these guys are often busy so they should find a way to speed things up.  Regardless I'll be back, a good fish and chips place can change you life :)"}
{"text":"I have to agree with fellow reviewers - this is the best fish and chips in Toronto that I have found.   My partner in crime, Christine C, and I headed to Olde Yorke to prove that there is some good fish and chips to be had in this city and so I could indulge in a deep fried Mars bar ; )   Without stealing my brother Vivek's \"punder\", this place was great, just for the \"halibut\"! The fish to batter ratio was stellar. The batter was thick, but not concrete wall thick. It was deep fried goodness, but not greasy. The chips were seasoned (unlike Reliable) and dense, but not soggy. The portion size was large, but if you arrive hungry, you will finish the plate.   Christine had the fried clams. Man oh man...I may have to have these when I come back!!   The decor is very cosy, like you are in a pub across the pond. Even the bathroom is cute.   The staff are helpful, friendly and seem to be enjoying themselves.   The deep fried Mars bar is gross-good. You know you shouldn't eat it, but you do because it is ooeeyyy goodness. I did leave a piece of fried batter on the plate. An offering to the Fried Gods."}
{"text":"Good fish and chips, not the best i have ever had, far from the worst! I really liked that neither the fish nor the chips were dripping oil.  The scallops particularly nice.  Good, efficient service.  I recommend."}
{"text":"This is a very cute restaurant,  and feels very homely. It was funny because walking in you're surrounded by a much older demographic. All of the customers are older- very cute. Had a pub feel going on on one side of the restaurant, another side a quiet dining area. Got seated in the dining room- creepily quiet, I felt the need to speak in a softer voice otherwise other customers would hear my conversation (I was at lunch with my assistant).  I ordered the seafood platter which came with a huge piece of haddock and fried scallop and shrimp trios. It came with a huge portion of French fries. When I got it I was amazed by the amount of fried oily foods on my plate. I loved the batter so much! The scallops were good but not stringy enough for me and the shrimp was great. The haddock though didnt impress me too much only cause of its distinct haddock taste but tried some of my friend's cod and it was really good.   The furniture and decor made for a cute but slightly creepy dining experience. Our total was 45$ which is costly for a fish n chips lunch."}
{"text":"Great fish and chips and an authentically uptight WASP crowd with soft English chins make this a uniquely Leaside experience. We showed up at 6pm on Saturday to a full house and a 20-30 minute lineup. Our twosome grabbed comfy seats at the bar and enjoyed middling pub pints. The craft beer movement hasn't yet touched this traditional establishment and a flavourful IPA on tap wasn't in the cards. The fish and chips was everything you would expect and high quality, and I believe the solid predictability of the fare is something that this crowd depends upon. Experimentation of any kind would surely be punished, so don't expect any boundary pushing adaptations here!"}
{"text":"We go here all the time for Fish and Chips. One of the best in the area. Good fish, reasonable variety, decent beer selection.  Parking is a bit of a pain, because their lot is small, they're popular, and the surrounding area isn't overflowing with lots of extra parking."}
{"text":"Exec Summary: Awesome fish, and OK chips.   Things to try: um... the fish?   Price: About $10 + tax and tip  My friends keep telling me about this place, and I finally managed to try it out, and I'm glad I did!  The biggest factors for good fish and chips are: the fish, the batter, and the amount of grease. That's a bit of a no brainer.  Olde York has a simple recipe, with good, flaky fish, a crispy batter, and most importantly, that is not too greasy.   It's fish and chips, it's obviously not healthy, but nobody likes a oily grease soaked piece of fish! Olde York delivers here with good frying techniques to keep the batter crisp.  The chips were ok, nothing spectacular.   Next time, I'll have to try the onion rings!"}
{"text":"One of the best Fish & Chips spot in Toronto!...Clean indoor and outdoor patio! Friendly staff and the price is just right! The food is really good and they come fast!! If you ever crave for a fish & chips, this is the place to go to if you're around the area!!"}
{"text":"Review on the Run:  Easily one of the better Fish & Chip places in the city.  It's even got a bit of traditional UK Fish & Chip atmosphere that is quite charming.    Good selection of fish that was lightly battered.  They're all priced around the $10-$12.  It was packed even for a Wednesday lunch service.  And not sure why, but I guess the seniors all love their fish.    They do have Deep Fried Mars Bars on the menu, and I'll have to give it a try next time.  Conclusion: Eat Here?  Definitely Yes!"}
{"text":"I came here because they were rated #1 fish and chips in Toronto so I had to see it for myself.   I came for takeout an hour before closing on a weeknight and they were pretty busy. There's only 3 choices of fish to choose from (cod, haddock and halibut) so I got the haddock and chips with a side order of chowder.   The haddock was still very juicy inside and the filet was lightly battered. I found the. After very flavourful on its own that you can probably skip the tartar sauce. The portions are very large and filling. I didn't love the fries that much, so I'd probably just order the fish on its own next time.  The chowder was very thick and had more potatoes than clams but still made for a hearty meal."}
{"text":"I was off yesterday and in the area of where one of my best friends works and I had asked her if she was available to have lunch with myself and the wife.  She was and she selected The Olde Yorke Fish & Chips as the spot as it was very close to work and we were able to get in before noon (busy time).  I'm hardly ever in this part of town (Leaside) so I'm not very familiar with it at all.  This area is rather hard up for parking but I was able to find a spot near the front that allowed for free half hour parking.    The first thing I couldn't help but notice was that there was a thick dark drape that you kind of had to brush to the side to get inside the place.  Then you notice the pub style type furnishing that sort of hits you at once with a larger dining area to the side.  The place feels very pubsy, British even in the decor.  It doesn't seem to be as casual as other fish and chip places I know of and frequent more often.    Everything you'd expect to see on the table was already there such as ketchup, malt, salt and pepper.  You know if malt's on the table the place is aiming to be legit.  All three of us ordered the exact same thing as far as meals went which was the halibut and chips.  We were offered bread and butter as well.  The platters were a nice generous serving with a side of cole slaw while tarter sauce was in individual plastic capped side mini cups.  The serving for 17 bucks is a good size.  Normally I'm used to seeing halibut portions either rectangular or square in shape as opposed to a long strip which is how I usually see cod served.  The fish is however very tasty and filling, I mean it's halibut right?  Another thing I'm not used to seeing is the batter \"bubbled\".  The batter appears to have an uneven coating for however they cook it but it seems that here it is the norm as well as all the other photos I've ever seen of fish being served here.  I suppose it has to do with how they prepare it.  That visual doesn't really affect taste however, it's just superficial really.  The fish and chips served here at the Olde (with an E) Yorke (also with an E) are good.  I can however say that I know of 2 places that make it better.  Fish is fish however whether it's the chips or the batter the other two I'm thinking of just for my personal preference taste better overall.  This is not to say Olde Yorke is not good, it is however just not as good.  Still I found the service here to be very good and friendly not to mention fast and precise.  Our server genuinely seemed very happy to serve us and the environment and service are quite nicely done.  The fish and chips however like I said, I've had better here.  I suppose all the high ratings had me expecting something in the 5 star echelon but for me it was just a good meal, not great."}
{"text":"When you ask people where to get the best fish and chips in Toronto; most will more than likely point you in the direction of olde yorke. This iconic staple, located in the heart of leaside, goes above and beyond the standards of quality and more importantly, service. Even if the fish here was mediocre, which is definitely not the case,i would still be giving them a 5 star review, simply because the large amount of service staff here , in such a small space might I add, makes you feel right at home and totally comfortable. Every employee here takes pride in their job, and that alone is what makes this place a great experience.   Unlike most fish and chips I've had, the batter here is perfectly crisp and isn't too thick and soggy or over powering. The chips are great as well, oil in the kitchen is definitely always fresh, you don't get a sticky feeling in your mouth after eating them.   Beer selection was what really won me over. this is the only place ,that I've found , that serves tetleys English ale. Thick beer but goes great with fish and chips.   Always busy, so expect to wait at least 20 minutes, or more if you go around peak times. Enjoy!!"}
{"text":"Saturday lunch at 2pm - seated immediately (lucky apparently since all other seats were taken). Fast service. Had the chowder (was above avg - very creamy and tasty and not too salty - but could have been warmer. Haddock and cod were both very good - flaky, tasty, batter wasn't overwhelming and wasn't greasy. Chips were nice and meaty. Coleslaw not too creamy, nice and tart. Tartar was tasty, not watery; rather quite creamy. Very nice inside - even the washrooms were quite regal."}
{"text":"Toronto's no. 1 fish & chips place. Ordered chowder soup and halibut. Never disappointed."}
{"text":"We have a winnah!!  In my personal quest for Toronto's best fish and chips-Olde Yorke is the champ!  The batter is perfect here, perfect thickness and taste-it is a little poofy but still retains its crispy, crunchy side. And the portion whoa-very generous with its cuts of fish, I have tried the haddock and it was cooked well not dried out at all. Fries are slightly weak -they are a tad soft and lightly coloured I prefer my chips to be a little more well done. Desserts are interesting they have deep fried mars bars on occasion, deep fried pineapple rings and I tried a wonderful homemade apple crumble they had served with some very tasty vanilla ice cream.  Service is friendly although there tends to be a lineup at the door whereupon you will have to leave your name wih hostess but the lineup tends to move along quickly. Very distinct british pub setting with the wood bar, cushioned chairs and leather booths-charming if you will. And the patrons can be quite cute and funny : a moment of hilarity occured during my meal here tonight when I got handed a new bottle of heinz and had to pat away at the bottle. The elderly gentleman sitting next to me at the bar frantically motioned at the servers and proclaimed: 'hey! she's having trouble getting her ketchup out!' :)"}
{"text":"It would have been better if they brought back the bread.   I've been going there since the 90's and food and service has been consistently good and never disappointing."}
{"text":"BEST FISH AND CHIPS IN TORONTO hands down. Place is always packed come night time as people simply can't get enough of their classic style fish and chips. Crispy and tasty, can't say enough, it's absolutely delicious. Fries are to die for I get them extra crispy - got to live sometimes right?   Also have lots of great fish options that aren't breaded/deep friend if that's your thing but either way when looking for the real deal this is THE place to go!"}
{"text":"YUMMM! the restaurant was nice and clean and offered wheelchair accessibility at the back entrance along with a parking lot. the staff was friendly and their menu was simple to read and look at. their prices were very good in my opinion and the fish was delicious. there's only a few fish and chip joints i've been to and this is a top choice for me. i'd recommend for those looking for some good fish and chips."}
{"text":"I've had everything on the menu over the years. I've never been disappointed. I have no worries about bringing friends and family here, knowing the food and service will be very good. There is often a line-up, particularly on Fridays. The back room is noisier than the front so for a date you'd want a booth but for a large group, the back. They do have take-out but not delivery. Best halibut I've had in this city; it's light/flaky/fresh and has a light crispy batter. The staff are wonderfully warm and charming but not intrusive."}
{"text":"This is the one and only fish and chips in a civil environment in Toronto. Arrive early, otherwise be prepared for a line up. Excellent food. Everyone has their favourite, but mine is the cod. The cod is juicy and made just right. If you're into the chicken like dryness, then the halibut would be your choice."}
{"text":"*this review is 1 star for a small but rude service experience - the fish & chips was excellent*  Service: 0 out of 5  Why: Very simple. We walked in at 415pm on a Saturday and the place was dead. 42 empty seats and 8 people in the restaurant. It's an ice storm blizzard out - the roads are empty. And we drove through that mess because of all the positive Yelp reviews. Two of us, and we asked if we could sit at the 4-seater table because it was cozy next to the heater and fireplace. And we were denied by the manager. Why? \"Because it's Saturday and it gets pretty busy.\" To which I said, \"it looks pretty empty to me...\" She rudely and arrogantly responded that they fully expect the place to get packed very quickly...Now at this point I'm just shocked. As a manager, you're choosing to be deny an actual living breathing paying customer that is here now and optimize for the imaginary potential customer that may come later? It is the complete opposite of customer service. Maybe if it's packed already and we're being picky, sure. But there are more staff than customers at this point.   Here's how business works: the customer you have in front of you right now is the most important one. I don't know if the attitude was because you were having a bad day, or if it's because we're coloured people and your staff is all white (in a wealthy white neighborhood) but I hope you realize & understand how obnoxiously you treated us and how it hurt and made us feel unwelcome.   At the time we left, there were 44 spaces open. 530 on a Saturday and the place was empty. Obviously. Because it was one of the worst storms of the year.   So buck up, look in the mirror, learn a little bit about customer service and maybe one day you can be a reasonably successful restaurant manager.   For anyone who wants to know, the fish and chips was actually really good. But guess what - still 1 star rating. Treat customers better.  Oh also, serving your tartar sauce and coleslaw in paper and plastic containers makes your entire product look cheap and amateur like a chip truck next to a Canadian tire. Don't market yourself as \"posh\" and not even serve the food in proper dishes.  --"}
{"text":"The best I've ever had....EVER!!! Real fish and chips cooked to perfection. Real homemade french fries and crispy batter on the fish....large servings too."}
{"text":"Went for lunch today and it was awesome. Ate way too much because as we waited for the 3rd person in our party we ordered a fried calamari which was good not great. The standouts are the haddock and the poutine...outstanding.. Definitely not a thin batter but also not heavy.... Very crispy and delicious. The gravy in the poutine was sooo good. We wanted to try the fried mars bar but it wasn't going to happen. The service was excellent ....very friendly staff. #1 Fish n chips joint as far as I'm concerned."}
{"text":"Good portions. Fresh... not too heavy in batter.  Service is friendly.  Fries you will like or won't.   Full...did even have room for desert. Definitely will head back for more..."}
{"text":"Looking for some old-school fish and chips? Look no further than Olde Yorke Fish & Chips! Most importantly, save some space for their precious apple crumble for dessert. Just a bite from our full experience review."}
{"text":"Greek salad and halibut is excellent as you can see from the picture.  Great service.  Worth checking out the place.  Fried clams are good and so is their chowder.  My favorite place for fish and chips."}
{"text":"Came here on a rainy Saturday afternoon. The parking space was very limited to be prepared to drive around to look for a spot.   The fish and chips were very good. The halibut was very fresh - light and fluffy. Generous portions. It also comes with a small side of coleslaw.   We also ordered a chowder which was pretty good as well. If you are use to having chowder from Boston then you may be slightly disappointment as there wasn't a lot of seafood in it."}
{"text":"I don't really like fish and chips but if I were to go somewhere in Toronto for them this would be it. Their halibut is off the hook. Always busy at night. Expect a wait out the door on Fridays and Saturdays. I've had friends visit from the UK and they say they have fish and chips down pat. Only reason I took a star off is because, again, I don't really like fish and chips."}
{"text":"Great food, atmosphere and quick service! I got the cod & chips with tartar sauce and it was so tasty! Will be back in the future!"}
{"text":"A year and a half later, I have returned.  As usual, it was busy and we had to wait for a few minutes before we were seated. We sat in the most recently renovated area - it was pretty nice.  Tonight I ordered the Calamari & Chips (appx $12). The calamari was really good ... perfectly battered and fried, it was delish. The fries were okay; it would add to the dish if there are more dips than just ketchup i.e. garlic mayo, curry sauce, etc.  Service was pretty good.  Because of my Lifestyle Change Journey, I can't eat here often, but once in a while, I'll be back."}
{"text":"I've been trying to find the best fish and chips in Toronto for a long time, and this is it!  Can't remember the place I used to go to as a child, where the fish was wrapped in newspaper.  But this is far superior!"}
{"text":"I love fish and chips and no one does it better than these guys! The fish is fresh and flavorful - you get to choose from haddock or halibut and cod sometimes. The fries are amazing and the portions are huge! I love the decor, rich woods and leather  with comfy booths and a good seating area at the bar. Makes me feel like I'm in England when I eat here - great atmosphere. The server's are always very pleasant and are very honest with their recommendations. And don't forget to have their Apple crumble! Huge portion of thinly sliced apples, lots of cinnamon with brown sugar, butter and that crumble topping with fresh vanilla ice cream..... Mmm I'm drooling at the mere thought of it."}
{"text":"Ordered the fisherman's platter and onion rings to share. The fisherman's platter was really good and delicious. The onion rings were a bit too greasy...if only the onion rings were a bit thinner and less battered it would be a hit w me. The fries were rly delicious. The bread they served us was disappointing...just sandwich bread...how about some actual buns? warm buns or a maybe a soup as an app?  Definitely will return someday."}
{"text":"I had a craving for fish and chips and this place was close to my workplace so I decided to give it a try and ordered the Cod and Chips takeout. Total came to about $10.50.  The smell coming from the takeout bag was extremely inviting. However when I looked into the bag I noticed they had forgotten the coleslaw, tartar sauce and condiments! It's too bad because it was my first time trying the place out, so this dragged down the rating because there was nothing to counter the oiliness without condiments/coleslaw..  That aside, the Cod was a nice portion and had good flavour. It could have used a bit of tartness from malt vinegar to make it better, but I don't know if it would be outstanding even with it. The cashier was nice and place is a pleasant one to go to, but if you order takeout, I'd recommend checking that you have everything before leaving!  Would consider going again only if I'm really craving for fish and chips, but wouldn't make a special trip for it."}
{"text":"so i was craving fish and chips one day last week and had to look on yelp. all these reviews made me think: hey i must go there! annnnnd i was disappointed.  first, the halibut was meh, too fried, too oily, not enough fish.. and not very tender. also, the fries are so blah, no flavor, no salt, no taste... i actually left a lot of fries behind and i almost never leave fries behind. Think I've been to MUCH better fish and chip places in the past. and finally, they give you bread and butter when you sit down... maybe i'm used to french baguette or italian bread but the stuff they give you here tasted like day old bread from the supermarket: totally unpleasant. maybe do not give me bread, i woulda been okay without it.   the store is quite cute, reminds me of an old british bar, lots of character in decor.   will go and find another fish and chip place. i am willing to sacrifice decor for better food."}
{"text":"I love me some fish and chips. Probably one of my childhood favorites, and Olde Yorke executes it wonderfully.  Located in the Leaside neighborhood, this place is so cute and charming from the outside; really exemplifies an old world style with a nautical feel. How appropriate. :)  Husband and I had been craving for some fish and chips for a really long time, and after reading favorable reviews of this place, we decided to check it out during our recent holiday visit. We came on the 27th of December, and were happy that they were actually open! (A lot of businesses were still on holiday)  Just to note: They have a take-out side and a sit-down side to maximize efficiency. We sat near the front of the restaurant, but I saw many patrons come over to the bar area near us from the back, so I think the place is spread out pretty deeply. We went over the menu, and went straight for the fish and chips, calamari, and bowl of clam chowder.  Clam chowder, priced at $5.25 was pretty good, but lacked actual clams. I tasted more of the essence of the soup rather the actual seafood, so I was slightly disappointed. There was a good amount of potatoes and onions without being overwhelming, but I probably wouldn't order this next time.  The calamari was fresh and nicely fried. Not like your typical Italian style calamari, the breading was thinner and not super crunchy. We loved it, and at the price of $5, this was a generous portion. Definitely worth getting if you're a fan of squid.  The fish and chips, also, was awesome. They have the traditional haddock and chips, but they also have halibut as well. Husband ordered the halibut ($13.95), and I went with the haddock ($11.50). Huge portions, and the batter was extraordinary. Perfectly dense without being greasy or heavy, and crispy too. The fries were nothing special, but that fish was great.  Like mentioned, portions are big, and if you order separately, you will definitely have leftovers! We wanted to try the key lime pie, but were too stuffed! Next time, we will though. :)  Happy to have found this place, and even though they have a small area for parking, this place is worth circling for!"}
{"text":"Patio and indoor.   Limited parking.   Best fish and chips.   One of the best poutine.  A bit pricey.   Good service.   Takes all methods of payment."}
{"text":"I've been back a few times recently... maybe it's because Penrose is long gone, or maybe it's because I'm in the neighbourhood but I have to say Olde Yorke probably now has the best fish & chips in the city.  I don't dine in often but as take-out, they are quite awesome! Prices are still reasonable compared to other places and it was worth posting an updated review.  The parking lot can still be a bit tricky as far as getting in or out but you can easily find parking within walking distance as it backs onto a residential area."}
{"text":"One of the best fish and chip places in Toronto. I used to work as a server at a fish and chips restaurant for 3 years so I know my stuff.   I've tried the fisherman's platter both times (scallop, shrimp, haddock + chips) and it hasn't disappointed me. The halibut and poutine is also phenomenal. This place is so good, there is often times a lineup, but it's worth it! So, SO worth it.   There is a separate doorway for takeout and dine-in."}
{"text":"Absolutely love this place. I've been a long time customer and they never disappoint.   Their service is always great. They're welcoming, quick, and their food is always consistent. If it tastes amazing this time around, it'll be equally awesome next time as well. They're great for take out as well! Usually pick my food up only 10-15 minutes after placing my order for lunch.   I have tried their Halibut and Haddock and they're both equally great. Their burgers are also very good, as are their chips.   Highly recommend this place."}
{"text":"Outstanding fish and chips!! And not only fish, calamari and shrimp are also super tasty and worth trying! The seafood is so fresh and has the perfect ratio of fish to batter. Every bite is as crisp as the first and it doesn't get soggy on the plate. The chips are also super indulgent! I think they do a double fry because their thick cut chips are soft on the inside but crunchy on the outside. The tartar sauce is pretty much butter too, it's so rich I could spread it on a slice of bread haha.  Service is always friendly and I'm sure they have many Leaside locals who return often! The sunroom/patio is also lovely, it uses lots of natural lighting to create the space. Although the furniture and atmosphere could use a little updating I think the customers appreciate its historic flare!"}
{"text":"Just had dinner there last night. This establishment is the second one that receives my 5 Star rating. That was almost lost by the fact that we had to wait too long for refills and for a bit too long for our check.  What can I say? The fish is perfect! I had Haddock and Chips and my wife had the Fisherman's Plate. They were both done to perfection. It reminded of a place on the Queensway, Viking Fish and Chips, which seems to have 'moved'.  I had started with a home-made Clam Chowder which was excellent. It was a very pleasurable dinner. It is not a fancy place, you do have to wait in line, but you will be rewarded.  Just great!"}
{"text":"Fish and Chips is something i don't usually eat, because I feel super unhealthy after eating it.  However, once in awhile is not a bad option.  I came here on a weekend with my parents since they love Fish and Chips and based on recommendations from a few friends, I decided to come here with my parents and give them a surprise.  Parking is limited, so if you want to park in their parking lot, good luck to that!  I managed to find one luckily as someone was just leaving.   You can always park on the side streets for free!  The moment I stepped in, I really liked the environment, the layout looks like an old house so it felt very cozy.  The servers and hostess were also very friendly!  Food, so I know their best dish is the Habilbut, however, I am not a big fan of very dense fish meat, so i went with a lighter one which is Haddock.  I also upgraded my chips (fries) to a poutine which i regretted, it was delicious, don't get me wrong, but I felt VERY full and greasy afterwards!  The Haddock was perfect for me in terms of the portion and texture.  We also ordered their famous hand cut onion rings which were HUGE and delicious!  Want a fish and chips place uptown?  I strongly recommend this one!"}
{"text":"So after reading so many amazing reviews and seeing this place as number one on many best fish and chips charts I went out of my way to eat here. This place had a lot of seating and is a pleasant place to be.   With that said I was quite disappointed with the fish and chips. It's not that they weren't good but with all the hype I was expecting much more. The halibut fish and tartar sauce were fine. Possibly better than most places but not by a huge margin. But why I think there are many better fish and chips places out there was the fries. To me they were below average. Just typical fluffy fries with little to no taste. Seeing when you have fish and chips the chips tend to be most of the plate when they aren't up to par the whole meal hurts.  One plus is this place really does hook you up with a big filling plate."}
{"text":"I've been coming here for years with the familia. My parents miss good old British fish and chips, and they love this spot! I can see why!   Olde York has a great atmosphere, service, are family friendly and have amazing food!   They were able to accommodate a group of 10 within 15 minutes of us walking in for a late lunch (2:30 ish).   I had the hake and poutine, which was the lunch special. The batter was light, crispy and delicious. So many other places fail on the batter, but this place hits in on the money. The fries are also amazing; thick cut, crispy and delicious. For anyone looking for a slightly healthier meal, they also make great salads (that can replace the fries), and their coleslaw is also delicious.   After devouring the fish and chips, we ordered some deep fried mars bars to share. I will say this; after having lived in Scotland, which is the land of deep frying anything and everything (including my first deep fried mars bar, which was amazing), Olde York hit the nail on the head once again with their simple, yet delicious dessert! They also served it with a scoop of vanilla ice cream, which is always fantastic :)   I'd highly recommend coming here for fish and chips, especially if you're from the UK and miss this British staple!"}
{"text":"There are plenty 'o fish in the sea but the ones that end up on the plates at Olde Yorke Fish & Chips are just a joy to be had, or in this case, haddock. Oh gosh, I think the punster that is Vivek is starting to rub off on me.   I finally made the pilgrimage to Olde Yorke and it was most definitely worth the effort. Shari M, my fellow meat diva and I continued on our travels to find the city's best fish and chips and I'm pretty sure we've hit the right fishing spot on Laird Avenue. OY has a really comfortable vibe about it and this is the sort of place my Mother would have absolutely loved. Cozy surroundings, straight up simple comfort food and nasty assed desserts, what more does a girl possibly need? Throw in the fact I can have a glass of the vino with my food and I'm as happy as a clam, or in this case, a clam strip.    I had the clam strips and they were great. A big, crispy pile of deep fried clams that were not remotely oily sided with a heaping mountain  of golden hot chips, coleslaw and clam dipping sauce. Shari had herself a big honking hunk of fish that was so crispy when she cut in to it I could hear the crunch. Now this is the way fish and chips were meant to be.   To finish off the fish gluttony we shared a deep fried Mars bar for dessert. It was just downright ooey gooey nastiness. I had a bite and that was it for me. I lived the rest of that dessert adventure vicariously through Shari's best imitation of Sally's moment in the deli with Harry. It was food orgasms all around. (see the pics)  Dessert aside, if you are in the market for some serious fish and chips then this is the spot for you.   We shall continue on our finding Nemo quest but I'm pretty sure in the end we'll both agree that the OY is absolutely one of the best, if not the best, fish and chip destination in the city."}
{"text":"This place is absolutely the best local fish and chips ever.  Hidden away in the Leaside neighbourhood in a little corner unit, it can be easy to drive right by and not give it a second look especially considering the plaza right across with more well known food options.  Wait times can be a bit long depending on the day and time, but the food is definitely worth the wait.  Once we were seated, we were warmly greeted by our server who handed us our menus and asked if we'd like something to drink to start off.  Going through the menu,  I was stuck between the haddock or halibut, but eventually decided on the haddock.  A friend recommend I get the poutine upgrade with it and I'm so glad i listened. The haddock had a perfect texture to it, soft and moist. The batter was not too thick and was just right as to not overpower the fish with oil.   The poutine is an absolute must on your first try here.  The fries are thick cut and fried to perfection.  The gravy and cheese curds complement the whole meal.  One of the best things about this quaint fish and chips spot is that the menu is clean and simple, focusing on what they do best without all the extra frills and upsells.  I wish I lived closer to the area or had something just as amazing in my neighbourhood, I'd absolutely go as often as I could given how great the food is.  For $11.65, you can't go wrong here!"}
{"text":"Love their fish and chips. Good service & delicious food! Batter is fresh and crisp doesn't taste greasy /oily  Decent price too!"}
{"text":"Good was good! Had the fisherman's platter it is typical English style food. Service was avg. At best, however I was not impressed with the tables, they need to be bigger. Also we asked for a bigger table because my Dad has Parkinson's and his handshakes was not impressed when the Manager said no I am saving it for bigger groups. My Dad's fork went flying to the table next to us luckily they they were nice enough to understand. However there were other elderly people there and utensils fell on the floor because the tables are too close together and not big enough. Your bar is built for a younger crowd however the customers were older you need to give them a little more space to walk through it becomes tough for them."}
{"text":"Love this place! Yes, it is busy. Best bet is during summer when all the Leasideites are up at their summer homes. Great service, huge helpings and you don't walk out of there with that greasy mouth that you get from many fish and chips places. Good bang for your buck."}
{"text":"Best fish 'n chips so far! I had Halibut and chips. The batter was thin the fish was fresh! And the deep fried Mars bar was to die for! The chocolate mixed so well with a scoop of vanilla ice cream! I'm definitely coming back again!"}
{"text":"Best. Fish & Chips. Ever.  I cannot say enough good things about this place. If someone were to ask me where the best fish and chips place in the city (or even possibly the world) is, it is always Olde Yorke. It's homey, it's friendly, the food is stellar. Nice balance of batter and fish with delicious thick fries. You can also get poutine, the Canadian fave! :3  My cousin and her husband (who is from/lives in the UK) came here with us a while back and he said that outside of one place in England, this is the best fish and chips he has had! Olde Yorke is great for smaller gatherings and perfect for the good ol' British food craving.   Olde Yorke is the mightiest warrior in the battle of Fish and Chips. I have not seen a mightier one as of yet..."}
{"text":"Best fish and chips I've had outside of England. Scratch that best fish and chips anywhere. I never seen anyone batter the fish the way these guys do it is delicious. If you go you have to try the halibut."}
{"text":"Super reliable fish and chips place. I am impressed at how unchanged this place is, it's pretty much the same as I remember it from my first visit years ago. The fish is still in large portions, perfectly fried so that it is light and crispy on the outside without being oily. The fish itself has great texture and holds up well to the batter.   I am not a fan of thick-cut fries so the chips didn't do anything to change my personal preference. Nothing really wrong with them, just not my favorite form of fry. Will switch it out for something else next time I'm in the area and craving deep fried battered fish.  They have a nice porch area in the back which has windows that can completely open to the outside. Granted, there isn't much of a view (parking lot, street, buildings) but on a nice day it would be a great place to have a meal."}
{"text":"My favourite fish in the whole city-actually pretty much the only fish I enjoy eating. Only problem? Line ups are ridiculous, and when you finally get in it's noisy and cramped. Go when it's not peak time and get the halibut. Yum. It's popular for a reason."}
{"text":"Tried their calamari and halibut & chips. The calamari was a bit disappointing. It didn't taste fresh and it was small. As a result, it compromised the chewy texture.   The halibut and chips was fresh, dense, and meaty. Nonetheless, they didn't season the halibut properly, and it was kind of bland."}
{"text":"This is my favourite fish and chips place in Toronto. Takeout works but it is best to dine in so that the food stays crispy.   Halibut and chips is my favourite. The shrimp are great too!"}
{"text":"Nice little place, comfy interior, great service, good food! Most fish is battered (as expected), but there's one healthy option, which was really good too!"}
{"text":"This is by far the best fish and chips joint.  The fish is coated in a golden and light batter; and it's crispy and not greasy at all. Their hand-cut fries and onion rings are fried to perfection.  Chowder, coleslaw and pie are all delish.  Nice ambiance of British pub-style and great service!"}
{"text":"Ok -- I rarely give 5 stars but this hit the mark.  True English fish and chips - just like my Mom used to make! We had the cod and chips with a pint and mushy peas (English folks will get this one).  They had other fish types including haddock, basa, and halibut.  Other seafood specialities like shrimp are available.  They came piping hot to the table.  The fish batter was really crispy and just like a fish and chip shop in England.  The fish was flaky and just right.  Very generous portions of fish too.  Mushy peas were also just like mom made. It also comes with creamy coleslaw.  Bread and butter was also served, and yes - I had to make a chip butty.  Heaven!!!  We went early on a Friday evening (around 5 pm), when we left just before 6, there was a big line up out the door, and getting away from the parking area just to the side of the building was a bit of a challenge as people double parked behind cars!    Regardless -- we will be back again!  I only wish I could have brought my Mom (who is not living in Toronto) with us.  She would have loved it.  Sadly we did not have room for dessert!  Next time for sure."}
{"text":"Best fish and chips I've had in a long time ! I had the  haddock and chips along with the onion rings. The entire meal was delicious !"}
{"text":"Got take out here because this place is usually really busy so I doubt we would have  space to dine in there. We called in ahead of time to place our orders so that we could minimize our wait time as much as possible: I got the cod and chips but substituted the chips with Caesar salad. The batter and the fish was really good but the portions, along with a full salad, was really filling... Their tartar sauce was good as well! The only thing is that it's pretty expensive.. Other than that, I would definitely come here if I need a fish and chips fix."}
{"text":"Haddock and chips are the best I've had in Canada. Great service, hot food and a great atmosphere.  Will add to my favourites."}
{"text":"Average fish, not so great chips. This is one example where size and style might not equal substance - at least for us, at the time we visited, anyway!   We visited on a weekday evening around 7:00 PM, and it was relatively busy. Admittedly, I found out about this place after seeing pictures of massive onion rings on social media - so obviously, Onion Rings being my middle name, I had to come here and check it out for myself.   We ordered: a) cod and chips, b) haddock and chips, with a side order of c) onion rings. The fish was fine - crispy, not overtly fishy, and not too much batter. It was perfectly average, and nothing really stood out. The onion rings and chips, on the other hand, were soggier than we were expecting. Not crispy at all, with the moisture from the onion rings seeping into the batter and making more than slightly mushy (you can imagine my tragic disappointment!!). The chips were also quite soggy and weren't the crispy kind some might anticipate from a meal like this.  Ambiance has a very traditional, English-pub, let's-go-back-to-80's-London vibe, which I don't mind and still found very engaging. Service was average; lighting is dim but still family-friendly.  For two people, with tax and tip, we paid around $40. Not sure we'll be back - the place is charming, but not sure if the food warrants a repeat visit. Note that parking was a bit difficult to find; street parking was pretty limited - we ended up parking at a plaza not too far away instead."}
{"text":"This is a must try! It is the best fish & chips I have ever had. Restaurant is alway clean and has the feel of an old English pub. Staff are friendly and food comes quickly after ordering. But get there early the lineup for dinner can be long, it's worth it!"}
{"text":"I've been hearing nothing but positive things about The Olde Yorke's fish and chips, and yet it wasn't until a few days ago that I finally got to check the place out for myself.  We arrived around 5:00 on a weekday and the place wasn't exactly packed. We were shown to a cozy booth by the bar and I began perusing the menu, although I already knew I wanted some variety of fish and chips. I'm far from a connoisseur of this fried specialty, so I just decided to order the first option on the menu: Cod & Chips (\"Moist & flaky, a British & Newfoundland favourite, served with coleslaw\").  It arrived a short time later and was undeniably delicious. The big, freshly-friend chunk of cod was cooked really well, although the fish itself was perhaps just a little overdone (i.e. it was flakier than you might expect). The fries were also quite tasty, while the coleslaw hit the spot.  I did find it unusual that the dish didn't come with tartar sauce, and when I asked for some, I only got a tiny take-out container of the stuff. It was definitely not enough for my preference."}
{"text":"Haven't been to this place in ages, but when living downtown I used to frequent this place on a regular basis.  Popped in today for lunch and despite the fact that it was a Thursday, the place was packed.   Warm wood décor with a heavy curtain across the entranceway (to protect patrons from the cold wind), this place exudes a charm usually reserved for pubs in England.  Both of us opted for Halibut and chips ($13.45/order, a bit on the steep side but worth every penny). The fish was cooked to perfection..it was moist, nicely battered and the accompanying fries were great. Even the coleslaw was excellent.  One small complaint is that with your meal you get bread....and it is just that. 4 slices of white bread served with the coldest butter packets I've ever encountered. I guess they know that your arteries will soon be filled with grease so they're trying to prevent you from eating butter and having a heart attack while at their establishment.  All in all, one of the best fish and chip places I've been to. They need to open a location in Woodbridge....."}
{"text":"This is the best place I've eaten since arriving in Toronto. I am a Chicago native and can be very picky about authenticity, texture, and bunch of other things when it comes to food. However the halibut fish and chips were awesome! Cooked to perfection and with fresh cut fries, not frozen. I will definitely be back."}
{"text":"Hands down best fish and chips place in Toronto. We always order the fisherman's platter with shrimp, scallops and swap out the haddock for halibut.  The clam chowder is amazing and I don't typically like this kind of soup. The onion rings are enormous and uses the same batter as the fish so it's light and very nicely flavored."}
{"text":"Had a very tasty meal here today.   Had the haddock and chips,   nice fish and crispy and light,  the chips were great too.    Not a huge portion by any standards but nicely done."}
{"text":"Nice variety of tasty fish and chips and seafood items in a warm, old-fashioned atmosphere.  Very pleasant service.  While the food was very good I am a bit hesitant to say it provides the best fish and chips in the city."}
{"text":"UGHH ! Never again in life. Fries all stuck together, Fish, with lots of batter. In fact, there was hardly any fish at all, just many pieces of empty batter. Extremely greasy to boot. Couldn't figure out the long line-up outside... or the fact that the place was packed. Went during the holidays and by the afternoon they had run out of several types of fish. Don't recall any coleslaw, either, or onion rings. Shocked at the high ratings this joint gets. Horrid. Avoid at all cost."}
{"text":"Hands down best fish and chips place in Toronto. My advice to you is to come at odd times because they 1) close early and 2) they have long waits for meal times. There is the takeout counter at the side, but won't be as fresh and hot as eating in ;)  Highly recommend!"}
{"text":"Busy spot for a weekday lunch!  Parking is minimal. Service is quick. Decor is reminiscent of an English pub. We had the halibut and fries with coleslaw. Great portion size (not overly large or scant). The fish was lightly battered, which I appreciated, and the fries were soggy. Creamy coleslaw."}
{"text":"Not impressed. For my order I had shrimp and chips and an order of halibut. The shrimp tasted like farmed pooey dirty shrimp. I only ate one & the order came with 8. The halibut was delicious and not overly greasy. Although it came out w no tartar sauce. I had to ask for this which came in the smallest tiniest takeout sized container. It was the size of a nickel. I used 2 containers and could have used another but didn't want to ask again. The chips were nothing special. The gravy was ok. I wouldn't go back here again."}
{"text":"Great place and super friendly service. You have to wait a bit if you go there on a Friday evening but the staff is always pleasant and very organized.  I loved the fish but I believe they can do better to make their chips tastier.  Overall, excellent experience! :)"}
{"text":"Good food. The best part is the gravy that came with the fries. SO yummy. It was creamy smooth and buttery!"}
{"text":"One of the best fish and chips I ever had. Start with ordering their onion rings so big and really crispy. Then I ordered the haddock fish and chips. No fish and chips is even comparable to this place if you are craving fish and chips this is the place to go. It's not insanely oily like other fish and chip places. The crispness is what attracts me to fish and chips. The volume of customers can already tell a person that this place has phenomenal food."}
{"text":"So, we were in the area, planning on doing some tastings at nearby Amsterdam Brewing. I figured it was probably a really good idea to get some food in our stomachs before we went over to put some beer in it.  I did a quick search of what was in the area, and this place popped up. Mmmmm, fish and chips. I suggested this to Lee and our other friend, and we met here for a nice lunch.  The space is really nice. It's an elegant British Pub look, with no televisions around to be found, but a lot of gleaming wood. It was pretty busy but we were led to a table quickly.  There were a number of different options for fish. I went for haddock, as did Lee. Oh ... I see poutine on the menu. Of course, I have to get that instead of just chips. Lee says he knows a good idea when he steals it, and got the same thing. Our friend opted for cod and chips.  Yum. Generous portions, nicely battered and fried, with flaky creamy fish. The poutine was delicious, with nice curds and gravy. They also have a great beer selection, with beers from nearby (including Amsterdam) and far. This was probably one of the better fish and chips I've had.  So, if you want some good grub, but you don't want to be distracted by eleventy billion televisions, come here. It's a perfect pre (or post) brewery stop!"}
{"text":"Always so busy so we only get take out but this place is the best. Fries are amazing and the fish is great. We only get halibut so can't comment on other types but the halibut is always so good. Highly recommend."}
{"text":"Not your old dirty and grungy fish and chip place, this is a place where you can take your date for a nice delicious classy meal, it's set in a British style setting with excellent service, the prices are reasonable and generous portions  We ordered the halibut and haddock and in all honesty I prefer the haddock because I feel that the fish is more fluffier as the halibut was a bit too firm for my liking  Will definitely come back to this place"}
{"text":"In Fish & Chips this is the BEST! Just to show how good they are, they close at 9pm on Saturdays and at 8:30pm there were people still waiting by the door. Apparently it is just as busy for lunch, so you must get here by noon or no fish for you! At night it's a bit of an older crowd, the décor is of a British pub (very nice!), and the staff is courteous. We ordered a Chowder (amazing, chunky, and not salty), Caesar Salad (very good), Halibut & Chips (the fish melts in your mouth, the taste is incredible, not overpowering just right, and the batter is light). So many good things to say about this restaurant, I can't wait to come back!!"}
{"text":"Simply the best fish and chips I've had in Toronto.  Not greasy and not salty.  Great coleslaw.  Perfect sized portion doesn't leave you hungry nor bloated.  Price for Halibut extremely reasonable especially compared to places like Reliable Fish and Chips.  Our waitress was very prompt and friendly.  The restaurant was so clean and very cozy.  If I had to complain, I don't see the point of serving thin (but tasty bread) with cold butter.  That's the only thing I could possibly find to complain about.  I am reading some of the other more negative reviews and am finding them hard to believe but I will say we went at 3pm on a Wednesday afternoon.  I know this place gets PACKED at lunch and dinner so I imagine during rush times, our meal would not likely be so perfect.  So choose a good time to go, don't expect miracles when lineups are out the door."}
{"text":"I love this place. I discover this place during a work luncheon and I've been happy with them on every visit and have been a regular customer since. The fish and chip is 100% satisfaction and fried perfectly everytime. Its never been greasy or oily and there fries are also awesome; cook perfectly golden and crispy. I no longer need to lok for another other fish and chip place after eating here. Service can be slow at times but given there popularity that is to be expected; most of the time service is time appropriate. I gave it 4 Stars because there washroom is super small and really tight. This is coming from a petite size person here. Lol!! But I will give the food a 5 Star rating. Regardless, definitely recommend this place."}
{"text":"Great Food. Lousy Service...Do not recommend on busy times...or for birthdays or special occasions....Lied about getting a birthday treat......and told that customers were abusing the privilege....You can't ask for id?    I am looking for another place to eat  because the owners  do not value loyal business...I have gone here numerous times....Treated like a number and a  $$$$. I will have to check out Penrose and other places....I like great food.....but I don't want Indigestion.....or a headache."}
{"text":"My first experience in fish & chips restaurant, the whole experience was good and I recommend people who like greasy food to go there. The staff are welcoming, the atmosphere is joyful, the service is very good, and the beer selection is great. As for the food, i think I didn't like this type of fried food, we ordered the fisherman platter, which is expensive in my opinion, the shrimp and scallops are small size. we added another Cod, and onion rings, the cod was average, the onion rings were very greasy and the frying batter was kind of doughy from inside and crunchy from outside. We ordered a poutine plate, we didn't touch it actually so we had it as take away. As for me I didn't like the experience of fish and chips, i think it s heavy and overrated, and thats why i gave it 3 stars. as a restaurant, I believe if you like these types of food, you should go and enjoy it there."}
{"text":"Sadly, I think that the long lines here are worth the wait.   This place really focuses on old school British fish and chips. Both the fish and chips are made perfectly with high quality ingredients."}
{"text":"Been years since i've been here. Gave up on the lengthy lineups years ago. Got lucky walking by on Friday and was surprised...No lineup Decided to go and check it out.  As always the food is up to par. Comes supper hot since they're used to having a line up. Can't say the same about our waitress but from experience the service is normally friendly in a homey kind of way. The new addition brings a nice bright change to the place. Though it's a little bit tight and makes you feel like your sitting at your neighbors table. I wouldn't recommend it for a romantic dinner or a personal conversation place. But if you want to get in and out quick with a full belly. This is the place for you."}
{"text":"Perfectly deep fried Haddock and thick cut fries!  Best Fish & Chips I've had in Toronto.  Good portion too.  I will definitely be returning for more."}
{"text":"Food 5/5 Service 0.5/5 Atmosphere 5/5  Weird that this type of restaurant u expect service and surprisingly get treated with absolutely none.  Asked for two waters with our order. Got none. Asked for water again halfway through our meal. And got one glass from a different waitress for two ppl. Asked for refill at the end with our bill. Got none. That single waitress provided nothing. Horrible , slow agonizing service throughout entire meal (huge delay in order as well, and it didn't look like she had too many tables to bustle).  I would rather prefer ordering at a counter instead then deal with no service.   Btw loved decor, atmosphere is pub style that specifically specializes in fish and chips.  Fish was brilliant. Chips was a miss."}
{"text":"Second time to see if it was as good as I remembered.   It was.!!!!  Cold winter day but warm and cozy inside. Officially on my favorite places to eat. Friendly staff, great food."}
{"text":"This is one of the best fish and chips in Toronto. I am a regular but lately their fish is getting smaller and smaller. Please put back a meaty fish halibut that I use to have and just increased the price."}
{"text":"Three co-workers and I had lunch today at Olde Yorke Fish & Chips.  It's about a ten minute drive from the office and we go every once in a while on a Friday.  It's quite a busy spot so we try to get there just before noon. Today it was packed and we got one of the last tables.  They started us off with a basket of bread and butter.  Baljeet, Imran and I ordered Haddock & Chips (6oz portion, an East Coast favourite). It was delicious! The batter isn't too thick.   Helene ordered Weightwatcher (broiled haddock) with fries. She said hers was delicious too.  Despite how busy the restaurant was, Stacey, our server, took good care of us.  A fun lunch!"}
{"text":"I was preoccupied worth a meeting but the the service was good and knowledge. I wish they had more imported beers though"}
{"text":"Great fish and chips, every time. Never had a bad meal here.   Parking can be a challenge sometimes on weekends and there's often a line up."}
{"text":"Great place with decent service. They have a nice covered patio area that is nice to sit out on a warm day.   Got the fisherman's platter. The fish and chips are delicious and definitely worth it. The halibut was flakey and delicious. Fries are decent. The scallops were just okay. The coleslaw brings it all together.   We went in just before dinner time, but by the time we left, there was a huge line. And the most british ppl i've seen in toronto in once place. Overall very good place."}
{"text":"We came for the fish 'n chips and it was a perfect 10, both the cod and the halibut. The dining area was comfortable too. The only thing I would change would be to serve the coleslaw in a ceramic ramekin instead of the paper one. We'll be back for sure!"}
{"text":"Impeccable service. Great food. Excellent selection / variety on the menu. Prices are fair for this style of restaurant. Decor is tasteful and upscale.  FIVE STARS!!!"}
{"text":"Best fish and chips in toronto without a doubt. Closest you will get to the original Brighton style. The line up is indicative enough as to how good this place is. I'm a big fan of the fishermans platter with is fish, shrimp, scallops and chips. Also, i usually get a calamari entree with greek salad as an appetizer to share. Really good and i love their greek. It's piled nice.   Ambience is pub like - i like the patio more."}
{"text":"My brother and I came here after finding out Adamson's Barbeque wasn't open on Mondays. We're happy that we did. This place has a great patio that has an atmosphere that feels complete different from a normal pub. It actually felt like an upscale brunch place instead.  We ordered the calamari and salad along with the seafood platter to share. It was great, calamari and all the seafood were lightly battered. There wasn't a lot of seasoning so you can really taste the freshness of the seafood. We decided to cake on some salt just because we prefer a bit of flavour. The scallops were delicious.  We went on a Monday so it wasn't that busy aside from the afternoon rush. Although, we were told that it gets really busy after Tuesday. I wouldn't come here unless there was space on the patio. There are about 20 seats there so... It's best to show up on a Monday or Tuesday."}
{"text":"Definitely the best fish and chips I've ever had!   This is a really wonderful little gem in the Leaside neighbourhood. Packed on a Friday night, we waited about 30 minutes for a seat but it was worth the wait.   Once we were seated we got our menus and couldn't decide on the cod or the haddock so we got one of each and split them. Both were fantastic, we favored the haddock slightly, mostly for the texture, it's a bit softer and has a bit of a sweeter flavour but both are truly excellent choices. The batter is light and not too greasy or heavy. The fries are also great, they are thick cut and fried nicely. What I like is that this place has a small and focused menu, nothing fancy or out of the ordinary, just some really good fish and chips. They do of course have some other seafood items and even some items for the non-seafood lovers. I did see a lot of people ordering the calamari and the onion rings so I must make a point to try those next time.  It's definitely an older looking place but I love the fact that it has some history and you feel like you're stepping into your local pub and having a meal with friends and neighbors. Service was really nice and sincere as well.   I'd love to have a place like this in my neighbourhood, I'd be an instant regular, as I'm sure many of the customers are. This is a great place! It's popular so be prepared to wait, but it's worth it!"}
{"text":"When it comes to Fish & Chips, Olde Yorke is as authentic as you will find in Toronto.  The number of customers with British accents in the dining room tells you it's the real deal.  The portions are big, 1 piece of fish in a perfectly light and crispy batter, is plenty, and the amount of chips/fries is perfect.  The fries are crispy on the outside and pillowy soft on the inside.  These are not skinny fries, these are chunky chips, as they should be.  The onion rings are great but get cold fast, and somehow seem greasier as they get cold, not so with the fish and chips... strange.  Tartar sauce, lemon, malt vinegar, ketchup, and salt are all there on the table for you, and I do find that the fries need salt so you can adjust to your taste.  I have never been able to try any desserts here because after eating my haddock and chips, I'm stuffed to the gills (pun intended) and ready for a nap from the carb coma.  The halibut it more expensive and is a very meaty, but dry fish, the cod is very moist but can have a very fishy taste, where haddock is in between, a bit moist, a bit meaty, but very mild.    They have take out but I would never consider it, the fish and chips could never stay as crispy as they are fresh from the oil.  Beware Friday nights there are always long line ups.  And on any day, the parking lot is full, so look for street parking but watch the signs for areas marked as No Parking."}
{"text":"Consistently great, top-notch fish and chips.  I think they have some other options, but really, why would anyone order anything else?  I think their cod is the best option of the three fish they offer (cod, halibut and something else).  Beer selection is limited, but the Tetley's is decent.  Be prepared to line up - every time we go, it's a 20-minute or so wait, usually starting out on the street.  Service is efficient and fine, but really it's about the quality of the fish & chips they server - one of the best in Toronto."}
{"text":"Out of all the fish and chips places I've tried and searched for, I would say Old Yorke fish and chips at the top of the chart. I always usually order the halibut and substitute the fries for a Poutine. Great for a Sunday lunch or weekend lunch. Fish is evenly battered. Halibut is a good portion. And Poutine is well balanced with gravy and yummy cheese curds that melt perfectly.   If you're looking for a good fish and chips place, this is the place to go to!!"}
{"text":"Huge line up of people outside its doors all trying to get in for the good old yorke fishes cannot be wrong. This place is usually packed with diners especially in the evenings, luckily they have a separate take out entrance for those faint of heart which is just as good, but without a bar.  The fish and chips are good here, batter is crisp and well adhered to the fish not greasy at all, chips are made from real potatoes. We always always get halibut, its meat is more tender than haddock and it lacks the fishy smell of haddock. But what really keeps me coming so far from my densely Israeli populated area is their clam chowder...mmm...thick and creamy and yes made with clams. It is nicely spiced and the small cubed potatoes are always done to perfection, not over nor under done as if they were making it just for you. And it is only $4.40, what more can you ask for.  The decor inside is nice and has an old charm to it, servers are friendly and unintrusive, food is delivered as soon as it is ready, nice and hot.  My only complain is that they do not take reservations and sometimes I just don't feel like standing outside in an uninspiring lineup, and I cannot take a group here because making my friends wait is even worse than entertaining them at home with juggling."}
{"text":"Great halibut and chips, prompt friendly service. Parking is always a challenge even during lunch mid week"}
{"text":"Is it possible to give a 3.5?  That's what I really mean.  It was sort of our own fault for deciding on getting takeout from here when we were around the corner at the Petsmart and Home Depot, driving almost all the way home in the west-end when we realized we needed some beer to accompany the meal.  And then when we got home we unloaded our purchases, dilly dallied, so by the time we were ready to eat the food was a bit worse for wear.    However, the haddock was very good and as mentioned by other reviewers, the batter to fish ratio was excellent.  We got the family deal (yes, for two adults) and the coleslaw serving was beyond generous.  The fries did not fare well in their styrofoam take-out-containers/incubators.  This was our first time trying Olde Yorke, we had heard of it before and reading the reviews here sealed the deal.  (I felt so high-tech when I used my mobile to find nearby food places on yelp, read the reviews, then used the map function to find our way there - like, all that was missing was the hipster instrumental soundtrack and the voice-over saying \"there's an app for that\").   A definite try again.  Next time we're in the east end we'll prioritize the food first!"}
{"text":"Food: 5 stars Large hearty portions without compromising the taste and texture. I got the haddock and chips, and the ratio of batter to fish is just right. The haddock was pretty firm and meaty, and the chips were delicious but after I finished the fish, I was too full for the fries. Feel free to pack them home for a snack later. The meal also comes with a small serving of coleslaw. It was crispy and creamy; it was okay (not a big fan of coleslaw). I don't think they normally serve tartar sauce with their fish and chips so be sure to ask for it. We had bread and butter to start. I found the bread a little hard but at least the butter was nice and soft. Pet peeve: rock hard butter for your bread. To finish, my friends and I shared the apple crisp and ice cream. It was delicious! You're basically eating crunchy apple pie filling with vanilla ice cream.   Ambiance: 5 stars They could probably have more work done on the exterior. If my friend hadn't been there before, I would have totally overlooked the place. However, the interior is very stylish with red booths near the bar and a few other neat dining rooms. I would say the solarium was the best with all its big windows and glass roof. If it gets too hot, you can ask your waitress to have the windows opened and catch a nice breeze. Good spot to sit and chat with some friends.  Service: 5 stars I should have asked for her name but our waitress was one of the best I have ever encountered. Very polite and friendly, with a big smile on her face at all times, and checked up on us periodically. In fact, all the staff I have interacted with at Old Yorke Fish and Chips were pleasant and joyful.   Will definitely be back for more, and to try their homemade key lime pie!"}
{"text":"You know you've hit something good when you see a line during dinner, and it was a gem!  The service was great, our waitress came over several times to see that we're good.  My boyfriend and I ordered their Fisherman's Platter with chips and Cod with Garden salad. The Fisherman's Platter came with halibut, scallops and shrimps. The shrimps were amazing, I would order a full portion shrimp next time :) both the fishes were battered nicely and not over done. It was crispy and flakey on the inside.  I have to say that this place is \"the\" place if you're craving some good fish and chips!"}
{"text":"Not only was the fish excellent, but the fries were the best I've ever had.  I happened to be up there for a few different weeks, working at the AT&T / Telus facility across the road.  We never had time to go anywhere else for lunch, so we just walked across the street every day, not that I was ever disappointed to eat there.  Recently I had occasion to take a vacation road trip with the g/f.  Starting from home in NYC and did some wineries and crossed the border at Niagara Falls (but NOT all in the same day!), all as an excuse to take her there for the best French fries ever.  We got there a bit after lunch time and had no trouble getting a seat and having our food.  Was a great memory and I'm glad I took her there :)  Anyone nearby should DEFINITELY stop here for lunch or dinner."}
{"text":"I don't really have much to say about the service and the atmosphere. The service was average and I don't mean that in a bad way... They did what was expected and I was happy with that. The atmosphere was pretty nice - I liked the patio-ish room, though it was VERY hot - but it was our fault for choosing to sit out there.   What really stood out was the food. I had the halibut and chips and my wife had the cod and salad. The fish was definitely one of the best fish and chips I've had, and that's including London (UK). Amazing batter served hot and super crispy. Halibut was slightly meatier than the cod - the flavour was similar but neither were at all fishy. I had wanted to try here for a while and I am glad we did. The chips were nothing to write home about, but I still ate them all. Will definitely going back in the future, especially to try the desserts too!"}
{"text":"Have tried fish and chips all over the city and must say this is the best place in my opinion. The deep fried shrimp are amazing too . I live in the west end of the city in Etobicoke or I would be going there more often . The good thing is when I do travel to the eat in it is such a treat"}
{"text":"Consistently good! Anything I've had here is spot on except once had the clam chowder and it had clumps of I guess flour not dissolved. I would rate it a 4.5 but give it a 5 because of its cleanliness and consistency of great food. Don't let the one time clam chowder clumps be an issue because I've been to Old Yorke countless times. My go to for my fish and chips fix since their opening."}
{"text":"My partner and I have always driven by this place and admired the long lines ups so one day we made an effort to drive all the way there to finally experience all the hype. Unfortunately, it was not as amazing as it looked. It was decent, however, it was bland, little overcooked, definitely not fresh but frozen and the batter was just plain batter. The only thing I enjoyed was the fact that it was crispy. Perhaps my seafood experiences around the world has tainted my experience but I really think it can be done so much better. Definitely worth a try for yourself!"}
{"text":"After eating at The Olde Yorke Fish and Chips.. I am a believer!   I never realize that Fish and Chips can be so tasty! I do feel a little guilty when I decide to have some deep fried fish! Gee Deep Fried to Golden Crisp with batter... You know how much calories that is?? But I have to tell you, one bite and I know it worth all those extra time exercising/yoga and more.   Dropped by on a Friday afternoon.. this place was packed!! I think I am the only Asian surrounded by more mature European crowds.. Yes I stick out like a sore thumb.   Haddocks and Chips ($10.45)  - Fish is really sizable! So moist! So Flaky!  - Batter not oily! Perfectly done with a nice crunch!  - Fries are standard... maybe I can substitute for a mixed salad or something? so I am not eating a double fried fried entrees?   Services here can be a little slow.... since most of the customers are seniors and they are really enjoying themselves and not rushing anywhere... If you in a rush... don't come! They will make your blood pressure really goes up!   Now when I think of Fish and Chips.. Olde Yorke is the one I daydream about!"}
{"text":"Fish and chips were delicious! The crispiest batter I have ever had. The servers were nice and attentive. The restaurant itself had so much character. Tables are a little too close to one another but thats kind of a Toronto food scene staple. Lol Will be visiting this place again and again!"}
{"text":"Preface: I have eaten in at Olde Yorke before and it probably deserved four stars for those visits, but this is a review of my take out visit tonight.   Ordered two pieces of halibut and chips for take out. Typically takeaway F&C has been paper wrapped, but this was in styrofoam. Perhaps this accounts for the condition of the fish when I got home (approx 20 mins later).   Fish was overcooked and was, frankly, a bit dry. The batter was soggy (as could be expected) but turned quite rubbery. Chips were nice - a thicker cut and not over salted.   F&C is a rare treat as it's a heavy heavy meal, so I don't think I'll be back for takeout again. I think that Olde Yorke's takeaway isn't as good as Penrose or Harbord, but certainly better than any others.   For an eat-in experience, my current favourite F&Cs in the city was actually Oyster Boy's."}
{"text":"Food is great. Go to fish and chips for my friends and I. Real hot place lol Heater on blast  Service is alright Pretty busy place so reserve or be ready to wait Friend ordered a Caesar. Looked and tasted meh, but I don't go for drinks right haha"}
{"text":"With the exception of two despicable toddlers whose parents needed a lesson in child discipline, Justin E. and I were younger than the average Old Yorke patron by 30-40 years. At 6pm this place was slammed with grandparents, in-laws, and other family members queuing up to get a seat.  I heard not one but TWO separate diners utter the following sentence: \"I'm in a quest to find the city's best fish and chips and so far this is still my favourite.\" If that's not an endorsement I don't know what is.   This was the first time I was ever trying fish and chips so I had to go for the 'premium' type recommended to me - the halibut - with a side order of haddock just for comparative purposes.  The menu is heavy on the standard F&C options - cod (from Iceland), haddock (the usual) and halibut, all at around $11 with chips. There was also a \"Weight Watchers\" version of fish and chips made with broiled halibut and salad instead of fries. Then there were some more creative options like shrimp 'n chips, scallop 'n chips and even a hamburger and chicken breast. If you like beer they have Guinness, Tetleys Cream Ale and Steam Whistle on tap. A glass of wine was only $6.50 (!).  Halibut and chips were quite tasty and the ratio of batter to actual fish was solid. Chips were well done and I never thought I'd say this but I've now sampled tartar sauce and I actually liked it. I can't say that fish and chips will be something I'll be eating regularly as I eat enough fried food as it is and if something's gonna be deep fried I need it to be a little saltier, but if I do I'll definitely be back here.  As if I had any room in my gullet for dessert, I still ordered from the list of homemade treats (deep fried pineapple rings, sherry trifle, apple crisp or pumpkin pie). Of course I had to go for the seasonal pumpkin pie and as expected it was CrazySexyCool."}
{"text":"Everything I tried here was delicious. Service was awesome. Food was quick. Fries, fish, pie, calamari.. Can't wait to go back!"}
{"text":"Best fish & chips I've had in North America. I've had fish & chips in London and Hong Kong. There was a bit of a wait for my food to come out, but that proves that it was being made to order. It came out piping hot and perfectly cooked, crispy and not greasy. The fish was very fresh and tasty. No wonder they were voted Toronto's Best Fish & Chips."}
{"text":"Cozy. Great haddock and delicious meat pie. Chowder was solid. Very accomodating service.   Highly reccommended."}
