{"text":"You shoot pool here. That's all. The fried pickles are not on par with the Cinebarre, not on par with Jackalope Jack's. You come here to shot pool, not eat pickles that have been fried."}
{"text":"Went there on a Thursday night. Pool room was filled but restaurant area was empty. Try to get a drink at both bars and had to wait very very long each time. It even took 10 minutes just to close out. Probably not coming back anytime soon"}
{"text":"This is bar I visit regularly and every time I go the staff is friendly and delivers great customer service. I like how the bar has two sides one full of pool tables and then you have the restaurant side that has the tables and booths. I would highly recommend trying this place out if you haven't been."}
{"text":"I speak only for the pool hall side of things. Game time is priced well. Bartender is great and remembers what you get if you go more than a couple of times. Food is fine and can't say I have had bad food ever. Not sure why such low reviews."}
{"text":"Went there on Thursday night for college night and it was the WORST experience I have EVER had in my life!!!! The bouncer at the door checking IDs was the most unprofessional person I have ever seen. He told me he name was Jay but I'm sure he was lying because he knew how unsatisfied we were and didn't want to be associated. He then told me people call him polo cause he was wearing a red polo sweater. He was a black guy probably 6'3 and 280 pounds, bald, and said he went to chapel hill . I really hope management sees this so he can get fired. He is making your business lose money! He made probably 30 people wait in line outside and wouldn't let them in because he said they were at capacity but we watch at least 20 people leave and he never let anyone in. Then he let people in that walked up from the back of the line and told me that he knew them and that \"it's who you know\" that's why they got in. I also saw him let a few guys in that didn't have their IDs because they told him they play football for UNCC. I saw many people leave the line and go somewhere else and so did we! I was with a big group of friends and we would have spent a good bit of money at this place and would have come back im sure but none of us will ever be back  because of the customer service and the way this bouncer treated us. I really hope the owner sees this and does something to fix it because you are losing a lot of business!!"}
{"text":"Went with a large group on a Friday evening. The group reserved the entire back area so we could be together. The restaurant only had two people assigned our area (we had at least 100 people and over 15 tables). We personally waited 15 minutes just to get our drink order then we placed our food order and waited well over an hour for our food. By the time we received our food several of the tables in our group decided to leave and go to the Cook Out to get better service and actually have their dinner after finding out that the order they had placed over an hour earlier hadn't even been started yet in the kitchen!!! The management knew we were coming well in advance yet chose to schedule a light staff in the dining room and in the kitchen. The food was mediocre at best and I only gave it one star because zero stars was not an option."}
{"text":"Quick short: Terrible service, friendly servers, great crowd, too loud music and a risk of an epileptic episode. 

Would I return? Yes! But I'd eat somewhere else and drink in the car before entering. Pre-game it is!

We waited just 4mins shy of an hour on food and drinks. We watched food pass by us over and over. I wanted to steal a fry sooo bad. I was hungry. I was thirsty. But apologies came in full.. from all. The waiter, the waitress, the bus boy, the managers, someone's mama... Jesus too! I knew the warnings but wanted to go anyways. 

The food was excellent too. Well worth the wait... Actually the wait was brutal. My friend's drink came first, mine came after my meal!. My food came about 50mins in and my friend had to wait an additional 15 for hers, and her meal came incomplete. By the time she got the rest, the other food was cold. Oh when I finally got my drink, I realized I wasn't even in the mood to drink. How sad. I like NEVER turn down a drink. I was too upset to even try it. 

Again, some of the friendliest servers I've ever met but the most unorganized process ever. I can only assume the kitchen is understaff and maybe the wait staff is too. But the system is broken.... Chef Ramsey may need to come out and help this establishment."}
{"text":"Bought a lunch Groupon and went to check this place out..... sign on the door said they were \"closed for remodeling\". Then the next time we went an employee said\" they were usually open for lunch but closed today\". So I waited for the weekend to use by Groupon drove up there again and they were wonding people down with metal detector, checking for weapons as they went in the door.
 Needless to say we did not go in and forfeited my Groupon- so I cannot comment on the food.

 I personally would stay away from this place."}
{"text":"I have been to The Press Box every week since they have opened.  I completely disagree with the comment that calls this beautiful esablishment \"A DUMP\"!  By no means is The Press Box a dump or dirty!  Every new place has its kinks to work out.  This sports bar is nice enough for a suit and tie yet laid back enough for a pair of jeans and a t-shirt.  The owner Chris is super cool and the general manager Stephanie is always greeting new customers with a smile.  There wings are to die for as well as their philly cheesesteak!  They have kids eat free every weekend all weekend.   Its a super affordable place for families and it caters to all types of people.  From UNCC college night on wednesdays to ladies nights and even live bands!  I recommend The Press Box for a great night out, a quick lunch break, or an after work drink spot!"}
{"text":"I would not recommend ever going there. I am 24 years old and the bouncer wouldn't let me in because I did not know my DRIVERS LICENSE number?! Their staff and bouncers are so incredibly rude. And their food is terrible anyway."}
{"text":"I was excited to see a new place opening in the Flying Saucer shopping center as I call it. My excitement dwindled shortly after walking into the door. This place has zero atmosphere. No music just TVs all over the place with no volume. Good place to read a book if that is your fancy. So then I hoped the food would be awesome since it was their training week and you think they would want to make a good impression on their new customers. Asking for no lemon in your water was too much to ask. My pregnant wife had to ask twice for no lemon in her water. The food was horrible. We ordered they messed it up on my order and hers. At that point, I asked if we could just leave the dump and they obliged. STAY FAR FAR AWAY!!!!"}
{"text":"This place sucks. Me and my boyfriend came to their brunch and I swear not only was the service horrible but the brunch was as well. The grits were hard as a rock, the bacon was super greasy and they didn't have anything to put in the omelettes.  They ran out of plates and cups and they had a nerve to add gratuity into the check. 

The bathrooms were nasty. The music was not consistent. They didn't open on time and servers were walking around looking clueless.  We will never be back. 

I believe my boyfriend forced himself to keep getting plates so that he could get his money worth because it was over priced. Horrible horrible horrible!!!!"}
{"text":"Two stars is pushing it with this place.  I hate to give negative reviews but.... 

First, the food is just sub par. Came on a night where the apps are half off and that's pretty much what they are worth. I will say the chicken tenders aren't bad and the food came out hot. Quesadillas were a bit greasy and the chicken inside tasted a little dry. Mozzarella sticks were meh. The food just was not as tasty as it could have been. 

Service was decent but that as well could have been much better. I wasn't impressed. 

Upon receiving the bill, there was an \"automatic gratuity\" added of more than 25%. Automatic gratuity was not explained at the beginning of ordering our food or drinks. Normally at any restaurant they inform you of all gratuity charges that may be added to your bill due to a larger party or after hours (We were a party of four). After asking the manager why there was an automatic gratuity charge, he stated it was because \"they consider every party a large party and he's been adding gratuity on his bills for the past two years\" this is nowhere in writing. It's not the issue of the automatic gratuity, it's the in consideration of informing your customers that this will be taking place. Especially if service is mediocre. 

Overall, it's not somewhere I would rush back to. In support of events, would probably be the only reason to come back to this place."}
{"text":"Great place to meet friends for drinks, to play pool, and listen to music. Wouldn't touch the food. There is no love coming out that kitchen. Bar food isn't that hard to make, so really not sure what the issue is. Eat before you come!"}
{"text":"Horrible service. Took 20 minutes for a drink order.. Server didn't know any of the beers on tap and thought I was making up one of the beer names. I ordered some boneless wings and asked her if the certain rub was spicy and she said \"no, not at all\", so I ordered them. \"Not spicy at all\" turned out to be eye-watering spicy. I was going to tough it out and dip them in some sauce to cut the heat and then swig some water, but the waiter kept avoiding our table, clearly looking right over at us and then walking away. This went on for 30 minutes without her checking back with us, so i gave up. She finally came back after my boyfriend was finished with his food and I asked for the check and a box, which took another 15 minutes. I shouldn't have tipped her anything more than the $1 I did, but I hope she got that I was upset by our service that night."}
{"text":"This place is very nice. There are multiple pool tables, great drink specials. $2 beer specials. Great service. Clean,  fun and great music even on a Monday. Definitely worth 5 stars!"}
{"text":"Watered down ciroc shots....f
 this place they would not a serve me after accusing them of doing so!"}
{"text":"I went here for brunch for the first time last weekend. Brunch starts at 12pm, we arrive at 12:20 pm, and don't get seated until 12:35pm. The was no line and plenty of empty tables available. One employee told us to wait to be seated and the other told us to seat ourselves.. After we get seated we head over to the brunch buffet which is the smallest, simplest spread I have ever seen for a buffet( especially for the price). The waffles and French taste were cold, bacon greasy, potatoes burned, and grits had to be cut with a fork. To top it all off the plates were dirty, and the kept running out of cups. They had one person working the dinning room while I observed other employees on there phones, the managers or owner walking around calling shots but doing nothing to satisfy the customers needs. At the end of the horrible brunch the ticket comes out and they have a nerve to add in the gratuity and it's just two of us. I spent $60 on two people for a meal and service that wasn't worth $30. I will NEVER go to this place for BRUNCH EVER AGAIN."}
{"text":"BEWARE IF YOU ORDER FOOD THEY WILL CHARGE YOU  Gratuity! They charge me gratuity, I had to talk to a manager because I needed to know where does it says gratuity will be automatically added and why was it added for a party of 2?? And it was me and my husband! The manager said (something that does not made sense) \"because it's a busy place and sometimes people don't pay their tab but you can say you don't want gratuity to your servicer\". So question was WHY WAS IT ADDED IN THE FIRST PLACE?? No I was  NOT DRUNK yes I ALWAYS look to see what I'm getting charged for.  I feel that for those whom been drinking heavy, might not have noticed or paid it any attention. It's like taking advantage of someone. YOU CAN NOT CHARGE GRATUITY IF ITS NOT LISTED ANYWHERE!! Point black period!! 

Nice Atmosphere. The food was good. I would go back now I know what to look for. Great vibes. The only down side was that gratuity issues. Yes I would go back."}
{"text":"We attended a costume party. We went in on the pool room side. Then when we went to the second bar, we were stopped by a man and told we had to pay to come on that side of the bar. WTH. It was a silent party so there was no music if you didn't rent the headphones. So we $15 before we even got our 1st drink. There was a large crowd so seems like this is the place for pricey fun"}
{"text":"First time coming here & I must say- it is great! They just opened less than a month ago. The review saying they took a while to get their check, I'm sure it was bc they were familiarizing themselves to the new system. Awesome atmosphere. Good music, GREAT drink specials, & great service. All bartenders/managers introduced themselves to us & told us about their upcoming events. It feels good to know they valued us as a customer. I will definitely be coming back & telling EVERYONE about this place. I'm sure they will have a large crowd once school resumes."}
{"text":"White couple dress coded. Other people inside with the same clothes as my husband.  I called them out on it but chose not to fight."}
{"text":"If you are looking for a spot to grab some wings and fries or just to chill with some friends, I would recommend this spot. I was visiting from out of town and a local friend suggested the Pressbox. The atmosphere was cool. I enjoyed the music. I ordered the chicken cheesesteak on a wrap. It was tasty. Our server was friendly and very patient with us."}
{"text":"A nice place to go with friends for food and drinks. One of the few places in the University Area where you are not surrounded by college kids. (Well unless it's college night) more of a Grown adult bar. Food is great, we had the tex mex egg rolls, and chicken fingers. Staff is very friendly. Great music when there is a dj, and for those of you who don't like to dance you can play a game of pool at the billards. Highly recommend this place, you won't be disappointed."}
{"text":"Guys. If you love buffalo chicken, and if you love grilled cheese. This place has a BCGC. What is a BCGC you may ask? A buffalo chicken grilled cheese. Yes. You read that right. Dip it in ranch and call it a day! Also. If you are a pocket points user they have a chicken strip app for 50% off. So it's like $4 for 5-6 strips and honey mustard!!! It's a total bar scene on the weekends so if you're not into that, go for lunch! 
(The BCGC is not pictured because we ate it too fast) 
Eat on!"}
{"text":"Went there to see Simplified, otherwise I would not have gone there! Spoke with the owner, a very nice, friendly man. I think they were expecting a big crowd because there were staff/security guys everywhere (guys with ear pieces). The construction makes it difficult to get in, but that's not their fault and it will end soon! Looked like a nice place to play pool, nice tables, well lit, etc..... I was on restaurant side to listen to Simplified. Set up is nice, plenty of parking, I would go back if Simplified were playing, but not otherwise. My two recommendations are: 1. The bar service is VERY slow. The young one guy is friendly, but 3 different times, I stood at the almost empty bar and waited 3-5 minutes for another beer. Those three times, one bartender was looking up watching TV and never acknowledged me and the other bartenders were visiting with each other! No bar staff should ever make a customer wait for another drink because they are watching TV or chatting with each other! Especially when the bar had maybe 3-4 people sitting at it! Two of those times, I had to physically walk over to where those bartenders were visiting (to make it obvious) to get my beer? 2. I know is early but the food really wasn't good. Not even for bar food. Sorry, I wish this review was better, but it's just honest. I would only go back if Simplified was playing, but I wouldn't get food! I'd also hope to get much better bar service!"}
{"text":"Service is terrible. Owner is rude. Food is even worse then anthing.  Stay far away from this place."}
{"text":"Service sucked.  Our server Deztiny seemed to  be too entertained by something in her notebook vs her only table.  Ordered a meal to come out now and she brought it out with everyone's meal. Not ok when my friend had to take her meal and run. Plus I asked for celery and carrots with my meal and she didn't bother to tell me they didn't have any. I addition I asked for vodka in a cup plus a side of cranberry juice in another glass so I can mix as I want and she brings me a mixed drink.  Then it takes her 30 minutes to check on us and I tell her and her response was oh they mixed it...m ummm you brought me the drink. You should have checked, no??? Never will return for a dine in experience.  Burger was good. Wings were great. Beer was cold. Keep in mind a party of 4 came about 2 hours after us and she was attentive to them..."}
{"text":"Was there last night. Very nice spot. Nice pool area on one side and a lounge is on the other side of the glass. 

The food was ok. Wings were kind of blah. The had an oven baked taste. The fried shrimp and crab cakes were good. Now for the not cool.

$2 Bud Light draft was cool! The bartender having to track down my server to force her to work my table? Not cool. What else wasn't cool? The same server that didn't want to wait my table slipping an automatic gratuity on my check. For a table of one? Not cool."}
{"text":"I've been here once before and I had crappy service but last night left me a little confused. We came here for a friends birthday ready to have a good time. When we got to the door 2 of my friends who had on white T-shirts was told they couldn't come in because of their shirts. Very odd because the person right in front of us had on a plain white t shirt as well. When I asked security why this was, he said its because that guy was friends with a manager which i get.... thats fine. But I sat there right in front of his face and counted 7 other people inside that I can see with plain white t-shirts on. Im disgusted and would love to know what the real issue was.  RULES SHOULD APPLY TO ALL OR NONE....Will not EVER be back."}
{"text":"My Wife and I hung out here tonight and had a good time. The dance floor is too small so tables are scarce when the VIP bookings are big. We went to the pool area rented a table had few drinks and appetizers and had fun. The DJ knows his music and had the crowd going. We were able to squeeze in some dancing. Prices were reasonable and if they can add more tables to the dance floor area, the score would be higher. We still will come back"}
{"text":"The environment is nice. I wish there was a location near the uptown area. Luckily, the light rail should make activities easy to get to. The men are nice and always willing to offer drinks. Plenty of seating when you get there earlier."}
{"text":"I was not impressed with this place at all. Overcrowded, took 25 minutes to get a drink and an hour to order and receive food. The food was not that good but the price wasn't bad. The music was not for a diverse setting and definitely not for the grown sexy and classy! Parking was just hideous. You'll have to try it for yourself, but I won't return."}
{"text":"The atmosphere in this place is like the upstairs den of your rich aunt who spends all of her time away from that den having an affair with a younger man. It has all the flash, but none of the life, personality, or flavor a fun space should have. The people at the Press Box/Billiards hall are equally boring and flavorless, with each white male blending into the next wearing Chevrolet t-shirts and flip flops with jeans. The place was no fun for me and my friends on my 21st birthday."}
{"text":"I am a 51 year old women arrived at press box today Sunday April 8, 2018 at 5:30 pm with a male friend age 45 who forgot his I.D. he clearly looked over 21. We wanted to play pool and have food. Children are actually allowed accompanied by an adult in the day time. These so called door guys said my friend had to tip them for them to let him in. Instead we left  and spent over $250 @ sports bar with no problem. Moral of the story these guys try to shake down patrons for cash. Which has happened before. Really sad a hood place with ppl. Like this working for them won't be around for long...."}
{"text":"I'm usually all for press box on Thursday nights. It's a cool atmosphere and cheap cover and cheaper drinks. Usually pretty crowded with lots of people to mingle with. DJ is always on point and able to get everyone Dancing. If you go to the bar, Daraies and the cute, short dark headed girl are ALWAYS on point. There is one bartender i would steer clear of. Seems to have an attitude and acts like he hates his job. Good place to watch games!!! Oh, did I mention they have a pool hall?! Definitely a place to check out."}
{"text":"Awesome new place in the university area!! Pool tables, great drink places, friendly & attentive staff. First bar I went to that each and every staff member came up to me introduced their self and shook my hand. I highly recommended this place."}
{"text":"I really like this sports bar it had a indoor out door feel. The drinks were really good as well. The wait staff I had I could have done without she seemed to be seriously chasing tips. But concerning the environment they played R&B and hip hop in between time outs and commercials that way you weren't to distracted when the actual game was on. ill definitely revisit this spot again with a different waitress."}
{"text":"This spot is cool. Nice chill atmosphere and upbeat hip hop. The crowd is mixed.  It's smooth, affordable drinks. Idk if they serve food."}
{"text":"I have been 2 the press box 6 times and have been approached once by a waiter. If u c one, it's only once. Forget refills..... if this place is in business next year I will b surprised.  It does look nice, but that's it"}
{"text":"Good service is everything to me and this place has horrible service. The bartenders aren't able to multitask at all and the service is just really bad and slow.

The actual layout of the place is done very nicely. There's a bar, a dining area and a side room that's very big where you can play pool. I didn't even try the food because while I was about to order a gentleman came up to me telling me how bland the food was so, I did pass on that. 

As for the drinks, my amaretto sour was decent. Not the best I've tasted though. 

I certainly wouldn't come back to this place. The service was enough to keep me away."}
