{"text":"I am pleasantly surprised. I wasnt sure about this place since the change from a pub to a resturant. It is nice  dining.  Due to the new changes, I don't think people know it is a  restaurant, so it is squiet.  All new staff within the last few Weeks are dedicated to the changes taking place from a pub to a restaurant. Within the next month the transformation will be complete.    Ate the rib eye and it was amazing.  Properly, but not overly seasoned.  The veg and sides we perfectly cooked as well.    Menu will be changing in the next few weeks with a new executive chef.  Have no doubt it will be amazing and well thought out.   Dedicated staff. Great, quality meat.  Passion for food.   I am looking forward to coming here in the next few weeks, especially with the additional changes coming."}
{"text":"The food is underwhelming, and the atmosphere is like that of a hotel bar or restaurant, but overall this place is ok. Lots of beers on tap, and the service is fine."}
{"text":"Came as a group for lunch only a few people there.  Food was below average and pricey for what you get.  One person had to send meal back because it was burned then was charged extra for mushrooms and shrimp.  Waitress not that friendly and grabbed the cash on the table before we had a chance to adjust the tip.  We tried to get her attention but she avoided us and hid in the back.  Not going back to this place!"}
{"text":"The food and service are still sub par. It took almost 15 mins for our server to acknowledge us and just as long to deliver a beer that tasted flat and stale. Definitely will not return"}
{"text":"This place was terrible I went for lunch and ordered a steak medium  I got it well done and when I brought it up with the waitress she said \"that's how the do medium here I should have asked for rare \" my whole steak was well done no pink at all  I will never go back."}
{"text":"Living far south has its advantages and disadvantages. One of the downsides is it's hard  to find somewhere to go that's close by when you want to go out and have a night on the town and not drive.  We came to the conclusion to go check out The Plow, it seemed like a promising tap house but I wasn't actually sure if I was walking into a full on pub or a steakhouse.   The interior is pretty cozy and nice I liked the décor and what they did with the space, except the fact that the dining room and lounge are all one room and you just basically choose if you want to sit on the left with high tables or the right with booths.  It was around 9PM on a Saturday when we arrived and I found it to be quite loud- although there wasn't that many people the existing tables were loud - maybe it was because they were Canucks fans...ha-ha?   Our waitress was friendly and served us very quickly and I was impressed by the selection of beer on the menu.  We ordered the Avocado shrimp dip and the home-style lobster mac and cheese to share. Let me just say that the moment those macaroni noodle's drenched in cheese hit my tongue I was in a cheese paradise. The dish had tons of full large succulent lobster pieces in it.... I savored every bite. The Avocado dip was just ok however. It tasted like prepackaged guacamole and had full shrimp in it so that made it really hard to scoop up with the tortilla chips that were provided. Our server said they are changing up the menu to make the venue a bit less pub and more \"steak house\" which kind of sucks because I was really enjoying the idea of this kind of tap & grill venue being close to me.  I guess I will have to see how much it changes and make my decision on if I'll enjoy going back or not when that time comes!"}
{"text":"Not the best food or service. Huge place thats never full. Meh!"}
{"text":"Have passed this particular pub/restaurant many times over the past year but hadn't been in until a couple of weeks ago. I now wish I'd started going a lot sooner.  Firstly in spite of its position on the corner of McLeod Trail and Sun Valley Blvd, it's quite tricky to find the entrance which is actually on Midpark Way- look for the signs for the Wingate Hotel and it's there.  As you might expect from the name, the décor and atmosphere is Western- photographs of Calgary Stampede on the walls, Country music playing in the background. There are large flatscreen TVs all round the bar area which usually show sports if there are any on.  I've only eaten in the bar- which is clean and basic- think along the lines of Earls or similar, but the restaurant area appears to be furnished to a higher standard and would be better suited to a more formal dining experience.  First time I went here I ordered a (blue) New York striploin steak, and got exactly what I asked for; quite possibly the best steak I've been served since coming to Calgary- and I've had a few- accompanied by perfectly-cooked vegetables. For dessert I had panna cotta with mango sauce- which was as least as good as any dessert I've had in downtown restaurants.  On our second visit my wife and I started with mussels in marina sauce then split a pizza. The mussels were delicious, as was the pizza; the base was cooked perfectly and tasted much better than what you get from most regular pizza places.  In short I have no complaints about the food which I've found to be delicious. I find the menu to be interesting and inventive and there are plenty of items that I'm looking forward to trying in the future.  The service we've received has always been friendly and efficient but without being intrusive. Our server- we've had the same one both visits- regularly checked whether we wanted anything without constantly hovering around, which was appreciated.  The draught beer selection is pretty good- roughly 20 beers I think- with some good local, and not so local, craft brews from the likes of Village and Wild Rose. Incidentally it's the only pub I've found so far serving Wild Rose Wraspberry in Southern Calgary- which is a plus.  The bottled beer selection is comprehensive and features some rather unusual brews that I haven't seen elsewhere such as those from Fernie Brewing Company.  Like most Calgary pubs The Plow has daily food and drink features that are worth checking out, my favourite probably being $5 pints of Calgary-brewed craft beers on Fridays. Being a bit of a beer geek who likes to drink local brews, this is a big attraction for me.  There's a reasonable selection of domestic and imported wines, although I have not, as yet, indulged in those.  The price of food and drink isn't bad either. It's not the cheapest bar in town but a night out here won't exactly break the bank, and some comparable- and also some not so good- establishments are substantially more expensive. As far as my wife and I are concerned it's the latest addition to the list of places we will be visiting regularly.  I'd strongly recommend The Plow to anyone who likes steak or beer, or who wants to go out for a good meal and a drink. It's possible to go there for a relaxed bar meal or something more formal.   Definitely worth checking out."}
{"text":"Decided to stop in and check out The plow. Was quite pleased with the new renovations.  The place was very clean and had a nice setup. I had the lamb gnocchi.  Very impressed. Great meal. I'll definitely stop in again when in south Calgary"}
