{"text":"Great food and reasonable prices.  The bar staff is cool, some can be edgy.  But that's what you'd expect from a biker bar!"}
{"text":"Great Place! The Bartenders are all women and hot! But more importantly give great service and are friendly!! Hard to find these days but they make it happen! Free Pizza m-f from 3-6pm and it's excellent! Good ;local hangout and good drinks at a cheap price! Love this place!!"}
{"text":"We like to people watch on Sundays. Great entertainment, and fun food."}
{"text":"This is a WI-FI Review 
When at a restaurant, coffee shop or other business, 
I, like many other people these days want Internet access 
using my IPod or IPhone through a free WI-FI connection. 
      The Hideaway does have WI-FI but it is locked and I was told that it is not available for the customers to use. I guess they think that bikers are not the type of customer that would want WI-FI. Guess again. On weekends I've seen many bikers at Harold's gazing at the screens of their IPods, IPhones and even Netbooks sloshing down beer after beer. The Hideaway owners are obviously living in the 1980's business world. 1 Star for The Hideaway on their WI-FI.
                        Food and Drink
      For afternoon happy hour some days they have free meatballs in a gravy type sauce and other days, pizza."}
{"text":"Great place to stop by when in CaveCreek....lots of beautiful motorcycles!!! They have done some improvement on the outside by adding in more patio space. I also like the live music that they have playing there on some nights. When there's a special event though, this place gets really packed!!! Food is ok...beer is always going to be beer...hahahaha!!!"}
{"text":"Two Harley's and four friends for lunch at the Hideaway. We enjoyed a few brews, couple cigars and a great lunch. Will be heading back real soon."}
{"text":"Pretty cool little biker bar.  Food was good typical bar portions with pretty standard bar.  It has a very large outside patio which I am sure make it the go to spot in the Arizona summer heat."}
{"text":"A must stop in Cave Creek. The best people watching next to Vegas. 

The most friendly people in AZ hang out here. Love it....5 stars!!!!"}
{"text":"Awesome place to stop for a beer and a burger when out on the bike... I great conversation and service. Give it a try, you won't be disappointed."}
{"text":"The men's room is hideous. It is worth going to the Hide to see this bathroom.  You'll take photos to share on Facebook. And if you're ever sent to a ISIS prison and someone says the bathrooms are disgusting.  You can say this is nothing.  I've pissed at The Hideaway"}
{"text":"It's called the Hideaway for some very good reasons....do not piss off the locals or the non- want to be locals for that matter, they will kill you, eat you children, and bugger  you in the most heinous ways if you ever insult their bar, bike, or women.
That being said, you could not meet a nicer bunch or people, in all the times I've been there, I have never witnessed a fight, a stolen (worst sin ever) bike, wallet, or witnessed a fight.
Truly great people, awesome, fun and hot female staff, (had to throw that in) and cheap specials/ happy hours"}
{"text":"We had so much fun at this bar!!! The outdoor fire pit was cozy and fabulous, the beer was cold, hot rods revving and motorcycles rounded out the dive bar/biker bar experience.  Don't forget to staple a dollar bill to the ceiling covered with your own personal act of vandalism before you leave."}
{"text":"Great place to ride the rzr to and have a few beers with your friends! Great football bar. I love cave creek and the area. Food is so so but just what you would expect from a bar. The live bands are right on. I love going here on the weekends."}
{"text":"Love the Hideaway!  One of my favorite spots any day of the week. Don't be alarmed by the \"Biker bar\" theme, as most of them are Christmas bikers who are Lawyers, or Investment bankers during the week. I have never seen anything remotely resembling a hardcore biker gang, or any trouble there after being a regular for several years. Mark runs a great Bar, and its full of friendly bikers of all ages. I don't even have a bike, or leather chaps, or even pretend to be a biker and get along with everyone. The pizza is just about as good as it gets. Possibly my favorite pizza in the valley (except Spinatos). Live music , video jukebox, and great atmosphere. I even dragged some Snottsdale friends up there and they now love this place. Just try it, and it will most likely become your favorite as well....."}
{"text":"Such a great biker bar, been going here for years. it can get s little ridiculously crowded during the nice tourist riding season so I get why he made the bike parking into more patio and fire pit, but I miss sitting and bike watching and chatting up people coming and going. nothing interesting beer wise, stick to bottles. The wings and sandwiches are good bar fare."}
{"text":"Love to stop here! This is a great place to have a drink and relax! Except for the main bar, all of the seating is outside with misters in the summer and heaters in the winter.  

The bartenders are friendly. They pour a good drink. Food is available. 

Yes, it's a biker bar, but very laid back. Be it locals or out-of-towners, all are welcome here."}
{"text":"I don't know about the rest of their menu but I dropped by today and had the cheese sliders.  Although they took a while to cook (everything is done to order), they were really nicely cooked.  A little pink inside with mustard, ketchup and pickles already in them.  3 for $7.  The place where I used to buy sliders (initials TG) make them so thin that they are overcooked after one side is done.  These were amazingly juicy.  Two beers and the sliders and I was happy, happy, happy.  Thanks to the cook at Hideaway who was on duty on Sunday."}
{"text":"Chicken sandwich with fries was awesome. Staff - frickin awesome. Music - awesome. Love this place. I always want more beers on tap everywhere so that's my only wish. Other than that - frickin awesome!!!!"}
{"text":"Went to the Hideaway for my last time today.  I moved here a little over two years ago, and found this wonderful biker bar.  The beers were a little expensive, but the food was good, and I got to hang with like minded folks.  But seems like the more popular it got, the more they would charge for the beers.  Last fall they were wanting $4.25, which was stupid expensive.  I hadn't been there since last fall, so thought I'd stop by today for a few beers and a burger.  

They are now charging five dollars for a 12 ounce bottle of beer.  That's just stupid tourist trap pricing.  A pity.  It used to be such a good place.  I've spent my last dollar at The Hideaway."}
{"text":"BEST BIKER BAR IN ARIZONA!  And home of Cave Creek BIKE WEEK! Love the events, there is always something going on during weekends (especially when weather is nice) ! It's a traditional biker bar and they are rockin it! Good music, food, and people! Find CJ if you go, she is awesome and will take care of you. You can tell she loves her job & customers. Thank you for the awesome times! We will be back - you got some customers for life! 

Also- check out \"Hideaways Roadhouse\" down the street! It gives the \"newer\" biker bar feel but still awesome - same owner!!"}
{"text":"Met up here with the crew this past Sunday, for one beer and some comical people watching.

This place used to be a favorite hang out for me, years ago when the majority of the bikers were true and gritty.  There were fewer posers back then.  You know the guys I'm talking about.  The ones who wear the perfectly matched bandana with obnoxious Ed Hardy/Affliction/Tap Out muscle t-shirts, fake bake tans, blingy jeans, tweezed eye brows, perfectly coiffed goatee and excessively expensive clown bikes that scream \"look at me and how much I spent on this bad boy\", sporting 22\" plus rims that are great for local bar hop posing, provided they can make super wide turns around a corner and climb a not so steep driveway, all the while sucking on a big fat cheap cigar like an equally cheap insecure porn star.  Some of the gals are equally entertaining, with their store bought bolt-ons, botox, plastic inserts, excessively colored hair, blingy bling bling jeans, leathery sun damaged skin and more.  Sadly, the ratio of real bikers to posers has changed beyond comical.  This would be a great place for casting the next reality show about wannabe bikers.  Luckily, their idea of going for a ride, means riding to the local Chuy's for bike night or a bar that isn't more than 20 miles away.

Either way, go check out the Hideaway.  Have your beer or two, enjoy the live music and the very entertaining people watching, then jump on your bike and go grab lunch at Harold's, or better yet, loop the long way down to San Tan Flat in Queen Creek, or the Road Runner or Chilleen's or Sidewinders.  The posers won't be at those other places because it's too far of a ride for them and the parking lots aren't paved. ;-P

Hahaha.  Good times in the Sonoran Desert.  Good times indeed."}
{"text":"The most yuppiest biker bar in the valley.. They hate the locals in cave creek and only cater to the yuppie big wheel bagger crowd from phoenix, locals should not give him one single dime!!"}
{"text":"Crummy food, dirty bathrooms with no doors, for a place that considers themselves world renown - a crappy little hole in the wall."}
{"text":"Best biker bar in AZ! Rode the Indian out here yesterday. Cold beer from nice waitresses, live music and bikes. What more do you need? This place is awesome!"}
{"text":"good finger food, love the live music... love the fact you can pull up to the corral style fence with you Harley. in the cooler weather  they have the fire pit going just a melo and fun hang out...."}
{"text":"Great place to pull up on yer' Hawg and enjoy a break in your ride. All or Most are Discovery channel bikers though. Some great bikes to look at if you are in to HD's. Great pizza and spicy bloody Mary's. If you ride up on yer' sled, watch your pipe noise as Cave Creek has an 84 DB limit law and they will write you up."}
{"text":"If you want people watching, music that's too loud and too much bass, this spot is for you. I have a great time people watching and women who just don't have a clue on how to dress hot, (train wrecks).  Mgt.  get a clue and turn the music down a tad, I like it loud but when you can't talk to someone 12\" from you it just sucks."}
{"text":"Great biker bar. Loved it. Stopped by during Biketoberfest. One of our favorite places- and we have only just moved to the area!"}
{"text":"Best biker bar in AZ. Always a fun time, we always meet new friendly people here.  Fire pits going in the winter time, live music, the perfect out door bar. The food is great too!!
We come back time and time again!!"}
{"text":"I ride about 50 miles to come here great place good people mark is awesome bikes are cool it's a fun place for bikers and bike lovers the staff is friendly foods is good you can bring friends or meet new ones I think it's a good destination ride for the day.
LOUD PIPS and live music love it"}
{"text":"Just had a fundraiser for our animal rescue, and The Hideaway was our last stop. They were fantastic, and gave out free meals to our volunteers and riders for the event. I've been here 3-4 times now, and every time I really enjoyed myself. Friendly staff, good drinks, good food, and good atmosphere. Fantastic. Can't wait to do our ride again next year!!!"}
{"text":"This is one of my haunts. I'm not complaining about the place but I am complaining about the \"service\"
This chick did at least 12 shots behind the bar in front of me in the short time I was there. She didn't run me a tab but charged me what she decided was right. Then when I asked for my tab, it was wrong and I paid, I did say something and she argued with me about how much she hooks it up. 
Correct me if I'm wrong but is \"hooking it up\" really what it's about? The small crowd was hammered and behaving as they wished. 
I like this place. Would hate to see it go down because some drunk bartender acted like an irresponsible individual with no regard for the business."}
{"text":"We recently rode over & found this place.  Great atmosphere, food & service.  Staff is very friendly. We bought some merchandise & hung our personalized dollar bill up before we left.    Definitely worth the ride over from out of state."}
{"text":"It's a biker bar. I love Harleys so this was so cool for me too see so many works of art lined up bike after bike after bike. One word... Beautiful. I was star stuck, I had just been to the infamous Jackson Barrot car show and there were a few cool bikes but this was like a showroom of awesome for the price of a tasty beverage. 

At some point they announced,  \"if you are the owner of an orange Harley, it just fell over\" the crowd gasped including myself. It's ok it didn't even look scratched. 
If you have a car and walk up they know so don't play they won't kill you unless you are a douche. 

There was live music and a bunch of shops to buy things like corsets, patches, t-shirts, whips etc.
 I picked up a cute set of pasties for $5"}
{"text":"We love the Hideaway! They do surprisingly good food, and the crowd is always a hoot to check out. Sitting outside and enjoying a cold beer, a burger and fries is a great way to spend an afternoon in Cave Creek. Super friendly (if somewhat slow) service and great atmosphere make this a go to."}
{"text":"While you might pass this place up because you think it's just another \"biker bar\", but don't miss this place. 
Sure, there are bikers, but also tourists and locals.
Outside there are fire pits and pool tables which make it easy to meet your neighbors.
They usually have have music which always adds to the fun!!!"}
{"text":"Despite my mom being very difficult and high maintenance towards the bartender she was super sweet and the food and drinks were great! Thursday night live music was so good!

*** above is my original review, written while we were still there, but on our way out the bartender walked up and grabbed my boyfriends butt as we were leaving  ... How inappropriate and unprofessional!"}
{"text":"Stop by the Hideaway today and had a good time. Plenty of bikes, food and live music. It's worth the afternoon to spend some time there."}
{"text":"Had a fantastic time at this cool biker bar while in town for my nephew's graduation from ASU. Waaaay too good of a time, in fact...with my wonderful, fun, crazy family who came from all over to celebrate this milestone. We drank, danced, sang with the band, and ate huge plates of bar-food-fried yumminess, all outside on a gorgeous Arizona spring night. The regulars didn't seem to mind our woo-hoo behavior, either, which makes this place as good as a biker bar gets."}
{"text":"Great people, vets, bikers, hippies, cowboys old young. Cool spot. Favorite place to hang and people watch."}
{"text":"Great live music, good drinks, lovely bartenders in a little mini western town. Will be back the next time I roll through!"}
{"text":"The bar service was great,  the place is a great bar i give that team a 5 BUT its a terrible place to eat, maybe better after 5 drinks.... but the food 1 star, the pizza we waited 45 min for was soggy and the rest of the food came out cold i guess they made it wait for the pizza.... seating is for a bar not a meal,  not a problem except the place showed up on my 'restaurant' search so we were surprised when we got there,  confused how to order and then yuck food... but again the bar made it better, cold drinks nice staff, fast, good prices, good live music"}
{"text":"Crazy out door place to be during bike week. They had trinket vendors out there and the atmosphere was fun. bartenders were a site to see! a must during bike week. not sure about the rest of the year yet, I'll letcha know next time I drop in....."}
{"text":"This is one of the best biker bars around!!!  Great happy hour during the week days!! The burgers are great and the servers are all cute and very friendly! Don't let all the tatoos and leather intimidate you!  We took our friend Paula there last Sunday on their Anniversary weekend and she was in her tennis outfit! There were many bikers there and a great band was playing and the place was packed full! The Hideaway guy patrolling the parking lot joked and said, \"Did you just come off your Harley in that tennis skirt?\" The drink prices are reasonable and I highly recommend this place on a sunny afternoon! Great people watching and you might be surprised at who you might run into?!!"}
{"text":"One of our favorite Biker Bars to stop at but once the band starts it horrible.  I don't know what they are hearing in their heads but it just sounds like a garage band jam session of songs no one has ever heard of.  Sounds like the same song for 4 hours.  The crowd claps and screams at the end because it is finally over. The one man band they have during the day is awesome.  Don't know who the owner owes a favor to with that horrible band but enough is enough. I've watched over and over the crowd thins every time they start."}
{"text":"Such a fun little place to get away to in Cave Creek. The outside fire pit and bar area is great. Not too bad for a little biker bar in a mini western town. Love Cave Creek & will be back soon!"}
{"text":"Loved our visit during bike week, we were only in Cave Creek on Wednesday night, but loved our fast and furious get away. Friendly staff and great food, not to mention some great venders on site. We hope to do this again next year."}
{"text":"I do not go here because of it being a biker bar. In fact, I have never been there in the evening when the crowds are there.   My grandsons (ages 4 and 9) absolutely love having lunch there.  In addition, I convinced my \"senior\" exercise group to have lunch there and they loved it, too.  Their food is excellent.  They serve Angus beef burgers!!  Where can you go and get a lemonade (unlimited refills) and enough fries for 2-3 people for under $5.00.  That's what my grandsons like.  In addition, they both have stapled their autographed $1.00 bills on the wall.  My son thinks they have the best pizza around.  It is a fun fun place."}
{"text":"We went to the Hideaway for breakfast at 10:00 AM today, 12/11.   The lady who does the cooking said she wasn't open yet and that she didn't even know what time it was.  I told her it was 10:00 and asked her how long it would be before she opened.  Her response was \"maybe 15 minutes, maybe 30\".  Then she said \"they serve breakfast next door.

No way to treat customers!"}
{"text":"This is me and my friends go to spot. All the bartenders are top-notch, beautiful and super friendly. I don't know of another bar that is quite so authentic. Being located in CaveCreek makes it that much more enjoyable. The absolute best biker bar in AZ. Don't miss Sunday Funday with live music and an eclectic mix of bikers, cowboys, and everything in between."}
{"text":"Great place...food is very good and bikes can be pretty exotic too!
Best times are on weekends for sights."}
{"text":"I updated my review due to the fact that the  ownership / management handled themselves very professionally and expeditiously resolved the problem. Bravo!! The drinks were good and the atmosphere was fun. Great place to hangout!! Thanks Kevin!!"}
{"text":"Worth the drive!  I travel to Phoenix once a month for business and this is by far, my favorite joint.  Pretty good food, relaxing atmosphere, and really nice bartenders."}
{"text":"Its a cool bar... BUT what is NOT COOL is that the guy who was out front directing the motorcycles in to the \"motorcycle parking\" area YELLED AT ME when I tried to park my car in a PARKING LOT! There was a sign that said PARKING! Ive never been there before SO I DIDNT KNOW! And I dont think its fair that he yelled at me. I probably wont go there again unless I have too. Its too bad because its a cool place. But I dont appreciate being talked to like that."}
{"text":"Only two types of people here.  Friends & friends you don't know yet. Always something fun going on. Agree w previous review about it being a \" Biker Bar\".  All good ppl .... very few he'll raisers.  If you ride ... and haven't been out here yet...... get your ass in gear!!"}
{"text":"Five stars for sure if they could figure out the a/c thing. But the compromise is worth it to have the open air bar. Wicked hangout in Fall & Spring. Cold beer & good bar food. Really good bands on the weekends. Even if you don't have a bike totally worth 'cruzin' to. Great people."}
{"text":"This place is a must-visit if you are ever passing through the Cave Creek, Carefree area.  It's a biker bar first and foremost so that should be enough of a clue to most of you about many things including service, attitudes, decor, and of course motorcycle gazing.

We always hit this when down in Scottsdale and they never dissapoint.  They have a great staff serving tasty burgers and awesome pizzas made to order.  Wash it all down with a frosty beer then sit back and people watch. 

It's been fun to watch them grow from a \"shed\" to having a huge new wood deck with misters (absolute requirement in July!) and outside mini bar.  Friday nights and weekends in early Summer are a blast.  Just need to be careful if you've had a few as the local police patrol are always watching and are pretty picky about loud bikes sometimes."}
{"text":"Fun relaxed place to have drinks and listen to great music on a Friday night  (Michael  Nitro)! The staff is very friendly."}
{"text":"Whata great spot! Chill place, Bikes, beers, n babes! Enough said. ITs about that time of the year again!! Can't wait!!"}
{"text":"Great food for what it is, excellent friendly atmosphere I just wish they were reward the regular customers maybe like $5 off a t-shirt when you spend $100.

Considering I'm there twice a week"}
{"text":"My favorite dive bar in Cave Creek. They have a great little patio, interesting servers, and live music. The place feels like it has been here 100-years. The drinks are pretty reasonable and the crowd provides for ample people watching."}
{"text":"A fun place to stop for a burger and fries and some suds. Fun atmosphere for the biker in you. Friendly people and staff. Defiantly go again. And the custom bike company touches are cool."}
{"text":"Rarely have I enjoyed an establishment more than the Hideaway somewhere near Cave Creek Arizona. I visited there on March 28th and 29th during the Arizona Bike Week festivities for 2015. This is a biker bar on steroids. The temperature outside was 95 degrees but you couldn't tell with the cold beers flowing and the water misters running. The only thing hotter than the temperature was the bartenders. These girls were sensational to look at and skilled at keeping the party flowing. They worked their asses off! I have been to more than my fair share of biker bars and this is easily one of the top two I've ever visited. if you find yourself riding through the area do not hesitate to stop here. You will be very thankful that you did!"}
{"text":"A genuine, authentic, not-for-the-faint-of-heart biker bar. The real deal. If you're looking for WiFi as a previous poser, err..poster, wrote, this isn't the place for you. The \"weekend motorcyclists\" stick out like a sore thumb because the place is packed with legitimate bikers and 1&'ers. The food is what it should be; old fashioned, American, put-a-smile-on-your-drunk-face good eatin,' Great beer, staff is just as legit and no nonsense. They'll take care of you but don't act like a rube. 

Overall, a throwback kind of place to a bygone era when the customer was only right if he didn't act like a stuck up shithead. Treat the place(staff and patrons) with respect and you just might make some friends. Show up in your tricked out touring bike that looks like you wash it more than you ride it, wearing HD logos from head to toe and expecting WiFi and perhaps you should just take your sorry ass on down the road somewhere else. 

My alltime favorite joint. If you don't like it, you don't understand it."}
{"text":"The Hideaway makes the best burger and fries in the valley bar none! Have been a customer since 2008, and is a favorite destination.
It's a great place to have a cold one, and enjoy
visiting with other bikers etc.  The annual events are always lots of fun too. Always lots of out-of-towner's in the winter months, that come down to enjoy our fantastic State, with ideal riding conditions.
Mike CVMA"}
{"text":"Karaoke + football + 31 degrees!  This is a cool little biker bar.  They have karaoke on some nights.  Lots of outdoor seating, inside is pretty tiny though.  I had a burger here a long time ago... I think it was decent."}
{"text":"A must stop spot for Bike Week! Had a great time.  Great music and awesome bartenders. Excited for next time!"}
{"text":"This place is an awesome bar to hang out in.  When I lived in Phoenix I could be found almost every weekend at the table under the tree at the front of the patio.  The food is fantastic and is prepared to order,  The burger is great, get it with grilled onion, cheese, and bacon.  Or get the pizza, it's delicious.  
The staff is awesome as well.  Mark, the owner, is a great guy and does everything he can to make sure his customers have a great time.   
Be aware that there is no car parking at the bar itself, it's bike parking only.  But if you are arriving in a cage you would probably be more comfortable at the Hideaway Roadhouse just up the street."}
{"text":"We had a few beers here on the spacious  patio that has a very nice misting system (plus, noticed a nice and artsy lava firepit featuring their logo for cooler temps.
  
A decent rock/country/western band was playing that Saturday afternoon. Tableside bar service was excellent and the beers were served in nice-sized disposable cups (on the patio at least) at a very reasonable price ( we had a good Mexican beer). It reminded me of an kegger cup, which spark a few memories.

 The food here smells fabulous but we had already eaten upon our stop here. 

This is a very popular stop, as Cave Creek is in General, for bikers and other cool people.

 Some really cool original bikes you can check out (never, ever, ever touch biker's bikes [No matter where you are]) in the parking lot. I'm giving it 5 stars for the cold beer and warm service at a friendly price."}
