{"text":"I've hesitated writing my review hoping I could write a more positive one...The hotel and the Statehouse are beautiful with excellent views.  The food is hit or miss. That being said, we have had some excellent meals there.  The service is very disappointing and hasn't improved with time.  From the bartenders to the servers no one seems to own their position or seem comfortable. 

A few of our experiences...We were at the Statehouse for our anniversary and my parents had called to send over a couple glasses of champagne to us.  The host told them that they couldn't seem to find us.  We were one of two tables seated in the restaurant that night. They could have found us if they had tried.  Also, my husbands steak was horrible, shouldn't have been served. 

We were in the bar another night with 5 bartenders behind the bar discussing who should go home since it was a slow night.  As the only two in the bar we sat listening with empty drinks.

A couple friends and I stopped in for drinks and appetizers after the homecoming game.  Yes, it was busy and yes, they knew they would have a huge crowd due to the after party they were hosting. But, they all seemed flustered and irritated. It took at least 20 minutes for someone to acknowledge us.  We asked about the wine and she said she didn't know because it was her first week.  I knew for a fact it wasn't her first week. I hope the  assumption isn't that everyone is a one time customer due to the fact that it's a hotel and people come and go. But, that's how we felt.  I could go on...

It's such a beautiful hotel and restaurant but the service does not live up the standards that you should expect to experience in a place like this.  I really do hope they can figure it out and turn things around.  Not sure how many more chances we will give."}
{"text":"We went for a brunch buffet on a Sunday morning. The atmosphere was nice with a fantastic view of lake mendota. The food was very good, great selection at the buffer and great quality. The pastries were excellent, as was the French toast and sausage. However, the service was very poor. Might be in part to them being fairly new, but some things were inexcusable. The staff never picked up our used plates, there was just a big stack on our table. We also had to ask repeatedly to get coffee refills and the omelette bar was all over the place. They served us the incorrect omelette on one occasion and underdone omelettes on two others. The waitress we had was only mildly attentive and seemed overwhelmed though they weren't terribly busy. Would like to go back for the food but if the service doesn't improve we won't be back."}
{"text":"It was our first outing to this newly renovated hotel and the Statehouse bar. We didn't dine there, although we intended to order some bar appetizers. Overall, the experience was just awkward.

- The bar table we chose had been wiped down with a sour rag, so it smelled awful. Awkward.

- We asked if we could sit in a different area. \"Yes, but you can't have drinks out there.\" Awkward.

- We found a spot to sit, but had to flag down a bartender/server to take our order. Awkward.

- With a group of four, we were given just one bar menu. We asked for another menu but were told there was a shortage. Awkward.

- The drinks arrived and the server promptly left. We were considering ordering some food, but we weren't going to flag down help yet again. Awkward.

- All four of our drinks sat empty for about 10 minutes before anyone checked on us. Awkward.

- To accompany the second round of drinks, we asked for ice water which was delivered about 15 minutes after the drinks arrived. Awkward.

- We asked the front desk about validating our parking and was told, \"No, you can just pay on the way out.\" Awkward.

Given the Edgewater's longstanding \"meh\" reputation in Madison, its stumbles out of the gate after the renovation and its apparent lackadaisical attitude toward service, training and effective management, it's going to be a tough road. There are so many better options."}
{"text":"I was VERY disappointed in our experience at The Statehouse.  The host and waiter seemed inexperienced and lacked the professionalism i would expect in a restaurant of this nature.  We were seated at a table so small there wasn't enough room for our food despite the fact that there were plenty of larger tables for 2 available.  We had reservations but no choice in where we sat.

The drinks were terrible.  I sent my lemon drop martini back as it appeared to be nothing more than flavored vodka. Our waiter acted irritated that I sent it back. My wife ordered a Cosmo that had a nasty aftertaste.

The food was mediocre. The beef tenderloin was a good quality cut of meat but it was under cooked.  My wife ordered braised ribs with root vegetables. The ribs were ok but the root vegetables were nearly raw and almost impossible to eat.

The waiter was inattentive and indifferent. We were over half finished with our meals before he asked how our food was. We had to ask for both the drinks menu and the desert menu.

The only positive thing I can say is that the mashed potatoes were delicious.

Needless to say, we won't be going back."}
{"text":"i attended a luncheon for 60 women at the Statehouse.  The hotel is lovely and the view is gorgeous.  The food was horrendous.  Many of us had a chicken caesar salad and some had mushroom risotto.  The salad was $23 and looked like a side salad. The chicken seemed similar to a prepackaged cooked chicken but was so sparse it was hard to find. The risotto was rice with a few mushrooms, not even close to correctly cooked risotto.  Not even a breadstick with the $23 salad, much less a muffin or roll.  The service was acceptable but very unprofessional.  We were given a lovely dessert plate of bars for our table of four but were never told by our server to share with the table next to us.  How about a smaller plate for each table! 
This would've been a wonderful opportunity for the Edgewater to have captured 60 future Madison customers. At a recent meeting of this local group, the conversation turned to the horrible food at the Statehouse and the terrible experiences they've heard from others."}
{"text":"Don't go!  We had a large table and not one of the meals was anything beyond average.  Maybe even not that.  We had to ask for bread, ground pepper.  Service was nothing special, but the food was even worse.  A huge disappointment for the cost.  No wonder the dining room was almost empty.  They need a different chef and maybe even supplier.  Will not go back."}
{"text":"I drove 1 hr 15 min to be with family member for brunch this am.  The build out of this resto and the view are great.  The food is something else.  2 of us ordered the the egg white omelette appeared to be yellow as it was bathed in better.  The smoothie was average at best and the hot chocolate was less than stellar.

They need a good bar consultant with a craft cocktail movement in Madison.  The bloody mary was ordinary at best."}
{"text":"We ate at The Statehouse during restaurant week January 2017. The food was simply not good. Bland, slightly burned--each dish lacked flavor. Charging the highest possible price for a restaurant week meal ($35 per person) was not at all justified.  The ambiance was also quite strange--it was very dark in the restaurant and there was no warm lighting. The goal of restaurant week is to introduce people to a restaurant in the hopes that they will return. I will not be returning."}
{"text":"Everyone in our party loved The Statehouse. The food is excellent and the service was very attentive.. The view of the lake is beautiful.  However it was discouraging to see that it was only 1/4 full. The only minor drawback is that the bottle of white wine that we ordered  was not as chilled as it should have been. The server did a great job of getting it into an ice bucket immediately and getting it chilled to the proper temperature. I will definitely return."}
{"text":"My family and I made a reservation for eight and ate off of the diner menu.  The atmosphere was great and the seating was very comfortable, although elbow around the table could have been better.  The food was OK, not great.  I had the KC steak which I ordered medium rare but it came back medium.  My wife ordered the same and hers was cooked perfectly.  Overall, I'd say the steak was comparable to Outback Steakhouse but at more than twice the price.  The steak wasn't a bad cut, it just didn't have any real flavor.  I recommend visiting the Tornado Room for a high quality steak that's actually worth the price.  We had several appetizers.  The crab cakes were good.  The \"sweet bread\" wasn't bad.  Understand that this is a meat dish though, and from what I understand, it's cow thyroid.  Again it wasn't bad, but I certainly wouldn't order it again.  The highlight of the menu were the several desserts.  The cheesecake, baked in-house pie, and chocolate cake were all very good.  I'm willing to try this restaurant again, maybe for the breakfast menu, but currently, this restaurant isn't worth the high price point.  If you are staying at the Edgewater, get a cab and try out any of downtown Madison's better restaurants.  You'll spend less and have a better dining experience."}
{"text":"Was anxious to try the Edgewater after its renovations and reopening.  Went twice -- once with friends for dinner and another time to show my visiting relative the new buildings.  
The Statehouse is beautiful and the Edgewater is still a wonderful location.  Food was OK, not really special.  Had the walleye pike.  
Service was very nice but very inept.  Our waitress was covering for the bartender as well and knew nothing about making drinks.  She served a glass a prosecco in a large wine glass instead of a champagne flute.  
at the bar the next night, I asked the same waitress for an Irish Coffee on a very cold night and was served whiskey and lukewarm coffee in a glass; no whipped cream at all, none offered.  My wife ordered a Sambuca.  It arrived over ice (supposed to be served neat with a couple of coffee beans as a garnish; flambée optional).  These things could be fixed with a little training or even by consulting a bartender's guide for one brief second before serving.  
I sure hope that they invest some time and money into staff training to get the service level to rise to the level of the setting."}
{"text":"Believe the bad reviews.  They are true.  Gone is the truly elegant, fine dining experience of yesterday's Edgwater.  We read the reviews and hoped what was said was because the restaurant was new and improvements would have been made after 6 months since opening.  Sadly, improvements better be made soon or I fear for the worse for the Statehouse.  We had dinner at the Statehouse for Valentines Day.  The dinner was 4 courses $75 a plate.  The food was not very good and the service worse.  You can read the details if you like but the bottom line is The Statehouse has a 5 star location but 1 star service and 2 star food.

We were given a complimentary glass of champagne.  Surprisingly when our champagne was gone our waiter did not inquire if we wanted another drink.  We needed to ask for one.   When that drink was gone, we were not asked if we would like another.

My wife and I both had a crab soufflé for a starter.  The flavor was good but  the soufflé was rubbery and heated inconsistently.  It had obviously been reheated in a microwave.  My wife's plate was cleared while I was still eating.  

The salad was spinach with a marinated pear.  Again, the flavor was okay but it was very small.  It was served very quickly following the starter course.  The spinach lay flat and was wilted.  It had been made hours before.  

I had a filet.  It was done medium rare as requested.  The sauce was sparse.  The plate was very empty.  5 little salt encrusted fingerling potatoes with the filet. 

My wife had scallops in a bed of split pea risotto with pancetta.  The scallops were not hot all the way through.

The restaurant is elegant with an open kitchen concept.  We watched food set on the wall waiting to be served for 3-5 minutes.  Servers would carry 4-5 plates cradled in their arms.  We waited a very long time after our salad for our main course, which is why we noticed the food sitting on the wall waiting to be served.  Our waiter served our entrees to the table next to ours.  He politely apologized to them for the wait.  When they informed him they already ate he served it to us.  No apology for the wait or the mistake to us.

After the main course we again waited a long time for our dessert.    Dessert was good.  After dessert we waited for our bill and waited for our credit card to be run.  Finally the manager noticed us waiting that he came and ran our card.

Although the restaurant is elegant, it is loud.  It was full for Valanetine's day.  Music cut in and out of the speaker.  It was usually too loud to hear the music.  The design of the room has no sound barriers like three-quarter walls.  We made a reservation for two but the hostess was surprised we were not a party of 4.  We were sat at a 4 top.  There was a 4 top next to us with 2 at the table.  I was glad, had there been 4 at the table next to us I would have been closer to the person sitting at the next table than I was to my wife.
We tried to valet park upon arrival.  Although we saw valet's, none came to our car.  We parked ourselves.  When we arrived at the restaurant the hostess took our coats and checked them.  There is no place to set your things like a purse or gloves while you get your coats on.

We wanted to eat at the Statehouse so ignored the reviews.  After tip, parking, and dinner we dropped approximately $225 for a dinner for 2.  This is not a sustainable situation for the Statehouse or the Edgewater.  I hope the ownership figures out soon."}
{"text":"We celebrated my sister-in-law's 50th birthday party at the Statehouse not too long ago. The service was excellent and the waitstaff were very attentive to our needs. Everyone seemed very pleased with their meals and my sister-in-law and her husband said the steaks they had were among the best they've ever had. It's quite a compliment coming from them as they live overseas, have travelled extensively, and I know they've been to more than their fairshare of nice restaurants.

Personally, I had the Heritage Pork Chop w/cheddar jalapeno grits, mashed potatoes, and a Caesar salad and I could not have been happier with my meal. Afterwards, my daughter and I stolled down to the dock, which had some pretty nice evening views of Lake Mendota and the UW Terrace.

Overall, a great experience and one that I'd highly recommend."}
{"text":"The restaurant is beautiful. It was pretty much empty until towards the end of our meal, but it was nice having the quiet. The waiters automatically brought us more bread when we ran out and more drinks when we finished them. The only negative things that I can say are that my mother's scallops were undercooked and my filet was slightly burnt. Other than that, I have no complaints and I definitely recommend this restaurant to anyone who is looking for a nice, quiet meal."}
{"text":"Such a special experience at The Statehouse on our visit from San Francisco. Sitting by the window at sunset overlooking sailboats on the lake, we had a superb meal. Our table of four started off with charcuterie, oysters and shrimp cocktail. All were fresh and hit the spot. The real stars were our entrees, which we split, and included an amazing steak on the most delicious mashed potatoes I've ever had smothered with the best gravy I've ever had! It was really a classic menu updated with unexpected favors and an artistic presentation. I'd also suggest a post meal cocktail on the dock down at The Boathouse!"}
{"text":"My wife, her parents and I ate at the Statehouse restaurant for the first time Saturday, Oct. 11, and we were very disappointed.  Although the food--the walleye, scallops, beat salad, pasta dish--was good to above-average, it was not on a par with several other of the better restaurants in Madison.  

More disappointing was that my mother-in-law had made the reservation indicating it was a special dinner for her 62d anniversary and specifically asked for and was assured a table by the windows. Well, of course, the maître-d refused to honor that request even though two tables sat empty during our entire meal!  Our waiter was very personable and competent but no one offered us a wine list until we asked for it twice.  

It may be unfair to compare the new with the old Edgewater, but we always thought the old Edgewater had a unique panache in that it served steak diane and Caesar salad at tableside and had a number of other very nice touches that made it a destination for many special occasions.  Not a whole lot is unique about the Statehouse."}
{"text":"Overpriced, mediocre food overall and awful service! I do not tend to notice or evaluate service, unless the staff really stands out. The service was so bad, it stood out. We made a reservation for 6.  5 of us arrived together and informed the staff that our 6th would arrive shortly. The table had only 5 seats and incomplete place settings. We pointed this out to the host seating us, and she assured us she would fix it. 10 minutes later, when the guest arrived, still no chair. He stood around for at least another 10 minutes, and finally took a chair from another table for himself. The restaurant was half empty. (Graduation weekend in Madison, most restaurants are fully booked-now we know why this place was available). The waiter seemed unsure, and ordering became a fiasco. We finally got through ordering- usually a simple straightforward process. The food was quite pricey - for example 5 small (chewy) scallops for $38.00, salad and soup extra. My husband loves oysters and ordered an appetizer. It came with 4 oysters and 2 clams. He asked for all oysters instead and said that increasing  the charge would be fine, and they said, no, can't make the substitution. No explanation. Being a good guy, he ordered it as is for the 4 oysters (which were good). He enjoyed his filet mignon steak more than I enjoyed the scallops. The salads were interesting and good. However, the worst part of poor service happened at the end of the meal. We ordered coffees all around. When the wait staff brought my husband's coffee from behind, they did not warn him and they spilled an entire cup of coffee all over his shirt. Thank goodness the coffee was only like warm! They neither apologized or offered to make amends of any kind. We left with a large bill and an unhappy crew. We were in Madison for a celebration, and this choice of place to celebrate was s huge disappointment."}
{"text":"My favorite part of Statehouse is the views, absolutely beautiful view of lake mendota with the option of either indoor or outdoor seating. I went for lunch and got the salmon and was not disappointed. It was cooked perfectly however it could have been more flavorful, I ordered a side of lemons which really helped add some flavor. I would recommend this if you are looking for a fancy place to eat in Madison. The staff was really nice too!"}
{"text":"Not sure why this place has a bad rep...Ate here for lunch and it was great! Excellent atmosphere and view, food was good, prices reasonable, service attentive. Not sure what else you need in a restaurant. I had the duck confit poutine which was very good, and a burger, and we had a bunch of other apps that were good."}
{"text":"Just a disaster. 

We walked in on a Friday afternoon to make reservations. They told me that for a party of 2, as in only 2 people, the only open reservations they had was for 6:00PM and 9:00PM. I Asked if they had a 5:00PM slot, and they said no. We were excited that it seemed so packed (so it must be popular!) and picked the 6:00PM slot.

Showing up at 6:00PM on a Saturday, we found the place to be a complete ghost town. We were literally the ONLY people in the restaurant. No, I'm not saying \"Yea there were a couple of other tables filled but it was overall pretty empty\". I'm saying \"There was not another seated table in the entire restaurant except for us.\" Clearly not as popular as they thought they were in their heads (but their ego only expands from there).

The ambiance is beautiful, and the restaurant itself is presented quite well. Kudos to the construction and design crew. The design however is where the favorable parts about this restaurant end. 

Our waiter was decent. He knew most of the menu, was able to give us a basic description of the wine (though flubbed on telling us the location of most of them). No personal stuff, no chit chat. There was a very clear line between who he was (somebody there to make us pay for a service) versus who he wasn't (there to help us enjoy our meal to the fullest). 

The food is ridiculously overpriced. Their cheapest entree's are around $30 and for a decent steak expect to pay upwards of $60+. That's for a SINGLE ENTREE. Want a side with that? Expect to pay $6 each for watery mashed potatoes or soggy asparagus. I was incredibly underwhelmed by the food. In no way was this a $150 dinner for two. I could have gotten a better meal down at the square for a third of the cost, easily. 

It seems that the Statehouse thinks that it is the only classy and decent food serving place in all of Madison, and can thus charge you an arm and a leg for a basic meal. NEWSFLASH: THIS IS MADISON! This place is a foodie's dream and far far better food exists just a block or two away. Save yourself the massive pocket book write-off and go to a place where you will actually get quality food.

Overall, I felt like the entire time the Statehouse was attempting to tell me that it was better than me. If this place was decently priced, I might actually return and recommend it just based off of it's ambiance and location. The adequate service and overpriced food forces me to not recommend this restaurant to anyone except those who wish to waste their money."}
{"text":"The stars are for the service - great guys. The food is pretty awful. It's overpriced and you can get better at Denny's. Ordered the club which was supposed to have avocado but I only saw a smudge in the corner of a piece of bread. Underwhelming to say the least."}
{"text":"Came back for a second time a few weeks ago.  All aspects of the food were excellent.  Music volume was louder which helped give a more active feel to the place given that it was about 1/3 full again.  Our server was very, very green.  Seemed pretty clueless so they are still struggling to develop a quality service team.  One other issue was that their menu states that they serve fresh squeezed fruit and vegetable juice.  They had none on hand and evidently were dropping it from their menu.  

Note to management.  For a restaurant at the level you are trying to achieve, fresh squeezed juices are a must.  They do it at other restaurants all over town, I am pretty sure you can pull it off too.  Otherwise, I love the place(impeccable space, impeccable views) and I am hoping you can get it hitting on all cylinders."}
{"text":"My original review below was posted on April 5 after our Easter brunch. 

I travel 45 weeks a year and rely on reviews on Yelp to be accurate when I'm picking out a place in a new city to go to. So I'd like to retract part of what I originally posted. This morning (4/6) the GM of the Statehouse gave me a call and apologized for our experience. He said he has been in the job a short time and knows they have areas that need to be addressed and he is working on them and appreciated the comments. He urged me to give them another try, which we will.

So I retract my comment that management doesn't care, as it appears they are paying attention to Yelp reviews and recognize the need to fix service issues. We'll try again.




Original 4.5.15 posting:


Great views, that's about it though. We've been to the Statehouse twice, each time the food is average and the service is awful. I don't mind spending on a meal (this one was $250 for 4 adults and 2 kids for a brunch), but there are lots of places in Madison that consider themselves high end that have better food and decent service.

Today we went for Easter brunch (ordering a four course brunch off of the menu). It took 25 minutes to get a server, it took 45 minutes to get the first course. The total meal took 2 hours. You might say \"well it was Easter brunch\", but at this time there were at least 6 open tables and a lot of the rest were people sitting waiting for food. Any food. There were servers standing around, but it looked like they had no food to serve - lots of cooks in the back but it was a scene right out of \"Hell's Kitchen\"  - lots of activity with no results. The team in the back would have had to face elimination.

If it wasn't for the view and the hotel I'm not sure this level of service and food would allow this restaurant to be viable. I see a lot of negative reviews for the Statehouse on this site. It doesn't seem the owners really care because these negative reviews start on opening day and continue to now. Six months is enough time to get some value to equal the price."}
{"text":"My family made reservations for a Christmas Eve dinner. When we arrived, checked in 15 minutes early and were told the restaurant was running 30 minutes late, we should have left for Dennys but decided to give the statehouse the benefit of the doubt and stick around. We were finally seated 45 minutes after our confirmed time, were gracious and unlike the angry diners seated to our left , did pay for our drinks. Note to self, angry diners...free drinks.  Our water glasses weren't filled when we arrived at our table...we were seated 45 minutes after our reservation.....When our dinners arrived, more than an hour after we were seated, 2 of the 6 were stone cold.... not cool, not tepid, freezing cold.  One of our dinners was initially served to a diner at another table...yuck!
The cold dinners were removed from our bill, and we left the restaurant 3 hours after our reservation with no dessert, no offer of free drinks, dessert, coffee to make up for the terrible service. Note to self again....we didn't complain....... no free service.....
So very disappointed with everything associated with this meal... time, food, service.
The 1   rating was only because of the lights around the skating rink."}
{"text":"Terrible food experience at Sunday brunch.  Very nice waitress, but inexcusable food quality - and at a time when it wasn't even very busy. 

The brunch Buffett didn't look good to most of us so all but one in our party ordered off the menu. The 1 who did the buffet was repeatedly thwarted because she mainly wanted the quiche from the buffet - and it each time she approached the buffet there was no quiche being refilled (ditto for the scrambled eggs).

Off the menu: Beware the eggs Benedict; menu does not state that it sits atop a soggy blob of bread-pudding-like muck. The 3 folks who ordered it barely ate it. My over-easy egg-plate arrived totally cold, without the bacon, dry/tasteless cubed potatoes, and with the toast untoasted.

I have never had a good meal at this Edgewater restaurant; finally had to speak up."}
{"text":"The panoramic views of the lake from The Statehouse's dining area are what make going here worthwhile. Otherwise, The Statehouse is a pretty typical hotel restaurant with over-inflated prices. The food is decent but the service is uneducated. Our server was very unsophisticated and could not answer a single question without first checking with the kitchen or the bar. They were out of two of the three seafood selections on Christmas Day, just after opening. She tried to make a joke out of it but honestly, print new menus. I'm not sure if the selections are always this limited or if it was because it was Christmas Day but they only had three salads available: Iceberg, Caesar and an arugula salad that was ruined with odd ingredients. The tuna I was served was no better than what I make at home and a bit a dry and overcooked- definitely not sushi grade! The accompaniments were good and the bread was actually excellent. The mashed potatoes were also quite good and plentiful as a side dish. Desserts were disappointing. The ice cream \"selection\" consisted of chocolate or vanilla (seriously) and was $6. They could not provide an after-dinner drink list and had no idea how to serve any that we ordered. The \"coat check\" was a complete disaster- the person taking them and bringing them out took more than five minutes on each trip. It turns out that the coat room is actually a tiny service closet. Why the pretense? There is valet service for $15 or self-park for $5. Overall, we were stuck going here because nothing else was open on Christmas in Madison. However, I would not recommend eating here if other options are available, unless you're strictly interested in the view, which does happen to be beautiful."}
{"text":"An utter disaster. 
Valet only parking no valet parkers
No choice of seating in a near empty restaurant
Darkened room midday 
Had to request wine list 
One order of a walleye plate morphed into the delivery of a fish sandwich which wasn't even on the menu 
The salt shaker top was loose so it all poured on my meal 
French fries cold and soggy 
Never offered desert 
Took 4 people to validate parking 
The place is a mess"}
{"text":"I really hope The Statehouse improves their game because the renovation of the Edgewater hotel is beautiful, but I don't understand how they decided to make their food service such an afterthought. I've heard nothing but very bad reviews and so we decided to check it out for ourselves one afternoon.

The service was pretty slow considering there were just a couple tables ordering drinks and appetizers, which is what I had also heard, though everyone was very friendly. 

When we finally were able to order, the drinks took about 15 minutes (although they did take one off of the bill) because they \"could not find\" one of the ingredients... for one of their \"signature\" cocktails... in the entire hotel?

We ordered cheese curds aaaannnd honestly they were pretty terrible considering the fantastic places nearby (and just being in Wisconsin). I'm nearly certain they were frozen (and if they weren't that may be more disappointing).

I was hoping that the new Edgewater would be a fun place to make a new hangout, order drinks and get dinner, and use the facilities... but so far I'm not super impressed."}
{"text":"I've given the Statehouse 2 months to resolve their issues.  Unfortunately, the food is still no good and the management doesn't seem to care."}
{"text":"The Statehouse is a beautiful venue overlooking Lake Mendota. Excellent shrimp cocktail with extremely hot cocktail sauce.  The lobster roll was very fresh but relatively tasteless. The crème brûlée dessert was very good. The servers were pleasant but not polished. We would probably come back and try them once more."}
{"text":"Below average service and average food for the price.   Views are great but there needs to be some staff training on how to serve. Disappointing for sure."}
{"text":"We were staying at the Edgewater hotel in Madison and had breakfast several times at The Statehouse. 

-The atmosphere is phenomenal--very bright and spacious with panoramic views of Lake Mendota.
-Service was friendly, but quite slow. And there were several times we were trying to find our waitress and couldn't.
-A manager did come by once to ask how were doing, so that was nice.
-On the Saturday of a Badgers home game, the only offered the buffet. I understand that because they are so crowded that day--but it was disappointing.
-The buffet was good with a nice selection--including great bacon, quiche, fresh carved roast beef.
-There's a made-to-order omelette station with very friendly cooks who did a great job!
-Oatmeal was delicious--complemented well by fresh fruit."}
{"text":"Not worth the price! Excellent decor and atmosphere, wishing for the menu to catch up. We ordered calamari and oysters which were decent but nothing special and definitely overpriced. The vodka martinis had a weird after taste so that was disappointing. Between us we had four entrees: half chicken, filet, scallops and walleye. Nothing was flavored well, we all were adding salt to it. Lackluster and disappointing since we were so enamored by the new look of the place. If you're going to spend $50 a person go to Rare, Graze, Cento, Estrellon, etc. Madison has so many good restaurants, unless Statehouse picks it up I don't know what would draw us back."}
{"text":"Food: Less than mediocre for the price. Steak was small and served barely warm (I would even say cold). Salmon very small. the \"vegetables\" is a puree size and color of baby shit.

Mashed potatoes are fine, again, way too small.

Dessert: Someone should let show them what tiramisu looks like. Hint: it does not look like a rectangle less than one inch high. This tiramisu was supposedly with matcha green tea instead of coffee. No flavor of any tea at all. It was green, so i give them that. For some reason it was drenched in cherry syrup... Why? what does cherry syrup have to do with green tea or tiramisu? Who knows.

Even the full menu is tiny. They only had the short menu. Your choice of \"seasonal vegetables\", which were baby carrots (that's it) - $9, or mashed potatoes... one medium potato at most.

Why would anyone spend $60+ here on tiny cold steak and some baby carrots is beyond me. 

Service was fine. The food took forever to arrive, but kitchen is probably to blame considering the dismal food quality.

Waste of time."}
{"text":"We dined at the Statehouse this weekend. The Edgewater Hotel is officially out of the long soft-opening phase but this is still a work in progress. I'm not surprised that previous reviewers genuinely were displeased with their experiences, but I'm optimistic that as this impressive space comes together- Madisonians and our guests will come to love the new Edgewater Hotel. 

Service was outstanding, attentive and personable. Everyone that we interacted with in the restaurant was incredibly welcoming and gracious. 

We enjoyed wonderful cocktails, entrees and desserts. The restaurant is positioning itself to contend with the likes of the Capitol Chophouse and while perhaps not quite there yet- they are well on their way!"}
{"text":"Not worth it. The prices are very high, which would be fine if the food/service were great but both failed miserably. My husband and I went on a Saturday evening to celebrate the birthday of a friend. We arrived around 7:15 and finally got our entrees about 2 hours later. This was not by our choice nor was it because the house was packed, although the waitress used \"house chaos\" as the reason for the poor service when she delivered the bill to us nearly 3 hours after we entered the restaurant.

What went wrong? 
1- The waitress offered a glass of Proseco to the B-day girl yet charged her for it anyway. 
2- Two in our party ordered salads which never came. 
3- The food was so so. One of us ordered the scallops that tasted gritty. Two of us ordered steaks; one medium and the other medium rare. The medium came out medium rare while mine (the medium rare) came out cold and nearing medium. When I asked them to do something about my cold steak they put it under the broiler which obviously made it warmer but also inedible. When we complained about the overall quality of the meal the waitress offered us free desserts which were ok but hardly worth the overall poor experience we had already had.
4- As I already said, the bill came with the Proseco on it but the 2 salads were also on it which we had to of course remind the waitress to correct.

After all of this we sought out the manager who was very apologetic. He removed the cost of my steak and begged us to give the restaurant a second chance, but with so many better (and cheaper) restaurants in and around Madison I see no reason to return."}
{"text":"We've been here many times already for dinner and we highly recommend the lobster rolls! Yum! Fried Calamari was nicely flavored and fried. Great view and tasty food, what more can you ask for?"}
{"text":"Bar: The brandy Alexander was ultra tasty, but once I got my drink, I was totally ignored. The bartender who made my drink was presumably on break so I don't blame him, but the other guy just kept walking past for an hour without bothering to ask if I wanted more water or anything. Would like to try the restaurant but the bar has only half the required elements of a decent haunt."}
{"text":"I will try the Statehouse again, perhaps in another year, at which point I hope they have their act together.
Positives:
- an outstanding location, ambiance, and interesting decor (history).
- a menu which is exciting and holds great promise.
- The burgers looked great.  Perhaps we should have stuck with simplicity instead of the entrees.

Negatives:  Please understand this visit was homecoming night ... perhaps they were overwhelmed, or not on their game that night, yet there were empty tables.
- Took 20 minutes to seat after reservation time (forgiveable).
- Waited over 15-20 minutes, while seated at the table, for a server to great us (not forgiveable).  We saw the manager chatting with a server about who was assigned to our table.
- Server was really, really nice ... yet she disappeared frequently and was very inattentive.   Cutlery wasn't cleared / replaced, had to finally ask for the bill, as she wasn't around ... and it was now 2 1/2 hours in...  !!!!    Several times she mentioned our food was coming, only to have it walked by us to other tables.   The servers misplaced the salads and entree dishes to the incorrect diners.   
- The food took forever ... and then was served as it came out, yet we saw plated entrees sitting under the heat lights for a while.   Orders were confused, not properly cooked, and even the promising menu items were lacking the flavor they deserved, and I'll even say some were bland.   A bright spot was the walleye.
- The prices were high for the offering, and I don't normally say that, because fine dining, flavor, presentation, and uniqueness deserve a premium value.   It was not found here.

In general, given the prices, I would have expected more.   At about $70-$80 / person, the Statehouse has a long way to go to gain a reputation worthy of the price, given the lack of value.  Yet, with the transient and unknowing clientele, they will get it and continue to muddle by.

The service and food prep wouldn't last six months in a big city.   Even in Madison, I wonder if the other restaurants gaining a good rep won't cut into the Statehouse future ... but the Edgewater will likely prop it up and provide a stream of diners."}
{"text":"I'll cut to the chase on this - stay clear of this disaster of a restaurant.  I went out to with some friends last night and this place screwed up in every possible way.  It took about a half hour to get served something to drink, and even the water was lukewarm and had some stuff floating in it.  Had I known what was coming I would have savored the mysterious floating gunk because it was the best thing I ate at this dump.  

After about an hour and a half we were served our entrees, although we watched them sit under the heat lamps for 20 minutes beforehand.  I had the yellowfin tuna special, which was dry and indescribably nasty and smelled foul.  It was, however, served with 4 green beans.  The steaks were overcooked, some in our group wisely choosing to send the meals back and skip dinner.  They came with some strange salt crusted balls they claimed were potatoes, but tasted more like salt crusted balls if you know what I mean.  

It took about another 45 minutes to get our checks, which were wrong when they arrived.  The meals ranged from $38 for a serving of three scallops served atop gummy rice, to $60 for the steak that would have been Applebees quality at best had it been correctly cooked - which it wasn't.  This wasn't my first bad meal in Madison, but it was the first one I consider cruel and abusive to my mouth.  I bought my first tongue scraper on my way home.

Recommend to your enemies."}
{"text":"I was only here for drinks at the bar but thought it was a very nice area. Fantastic patio to watch the sunset over Mendota. Drinks were good, and service was decent. Price for the drinks were fine, but didn't even look at the food menu."}
{"text":"Lunch awful. Salmon salad. All lettuce. Three small bits of salmon. Nothing else. Soup average. Seating cramped. Way over priced."}
{"text":"I love the power of Yelp......Helping the un-seen be seen. 

Its so wonderful. 

I came back the next day and the manager had actually read my Yelp review and came and apologized and then comped my breakfast. 

Its nice to see that I was heard and the situation was made better so quickly. 

Also lo and behold they DO have jelly for my toast :)"}
{"text":"Went to lunch at the Statehouse in early December. I ordered one of the only vegetarian dishes on the menu, a beet, red rice, and bean burger w/ vegan cheese and a whole-grain bun. The beets in the burger were very flavorful but no seasoning was detectable, it was very dry, and it the ingredients seemed over-combined to the point of making the burger mushy. Overall it is not an impressive veggie burger and is in desperate need of some seasoning, texture, and sauce. Graze has a much more flavorful beet burger. The cheese curds we ordered, on the other hand, were delicious and not too greasy. The Basil Gimlet cocktail is super refreshing. The furnishings in the restaurant are a little awkward for the room, but the view of the lake on a good-weather day is stunning and the open-kitchen is gorgeous. I would go back for cocktails and apps on a sunny day, though not again for lunch."}
{"text":"We were a little nervous about selecting The Statehouse based on earlier reviews. However, we decided to chance it, and we were not disappointed.

We started with drinks on the terrace overlooking Lake Mendota. The view is spectacular. Bar service is a tad slow because they only had one server, and where the bar is located inside is a bit of a hike.

Dinner inside was quite good. No problem with service; our server was quite attentive. For appetizers we had several. The shrimp cocktail was my personal favorite: huge shrimp, fresh and perfectly chilled. Other favorites included the crab soup and Portuguese soup. However, I thought the calamari was undercooked. Salads are good, very fresh. I think the iceberg wedge was my favorite. It could easily be shared.

The entrees were all great: filet mignon and strip steak were perfectly cooked as well as the walleye and hake. 

All in all, it was a very nice evening. The place is beautiful, and I would definitely return."}
{"text":"This was my second time at this restaurant. Last time I had the steak and lobster, which was pretty good. It does have a nice ambiance and if you get an earlier seating the view is nice along the lake. I remembered the experience with some fondness and had wanted to come back.

My second visit though was a culinary fail. The service was friendly but the food service was slow. The seafood platter for two seemed the way to go but was largely disappointing. The lobster bisque was good. They were out of the pork chops so I ordered the seafood pasta. They were also out of the black squid ink noodles. (In full disclosure, to their credit, they attempted to make it up to us at the end of the night by covering our first round of drinks.) Quite honestly that's all fine but the noodles came out undercooked and the mussels... eh. We also had ordered the chicken breast. This was disappointingly cold. Brussels sprouts and sweet potato were good. I would have just opted for a steak but I had just had a meal at a local steakhouse the previous night. For dessert the ice cream came out melting and the caramel corn ice cream tasted more like vanilla with the occasional wisp of caramel corn while the vanilla had very little flavor. If the run on sentence is confusing, just think of how confused my tastebuds felt. To cap off the night, the coffee required a reminder before it trailed in at the end and the requested boxed leftover chicken and brussels sprouts played hide and seek.

Maybe they were having difficulty with the higher than normal crowd, but the competition in Madison is too high at this level to make this a serious dining option.

I'll average my two experiences and give two stars."}
{"text":"UPDATE:  I can say now that inconsistent fits this to a tee!  Visited for our fourth visit and the food was, meh.  The appetizer was delicious, but how can you got wrong with cheese curds?  Salads were good.  Main courses - left a lot to be desired.  Dining companion had walleye, where the breading was so thick you couldn't taste the fish and the portion so tiny, well, it must have been a baby walleye.  I had a steak which was fine.  Both were accompanied by \"root mashes\" which were disgusting.  We told the server we were less than thrilled, and she commented that they have gotten a lot of complaints about the mashes...  The chef needs to get with it!!!  It was made right by free desserts.  But, this is used to be a destination restaurant inside the hotel, now it is a hotel restaurant.  OK if you're staying there but not worth venturing out to dine there."}
{"text":"Amazing view, fresh oysters, delectable desserts. My family and I had a wonderful time with great service and fresh dishes. Try the scallops!"}
{"text":"Wow. What a disappointment. So 4 of us went for a business dinner. 2 bottles of wine, 3 starters, 3 sides ,4 entrees, 2 desserts and $400 later.... But really. I wouldn't have minded the price tag if the food was actually good. For starters we ordered the octopus; which was overcooked and tough, the oysters; good, and the crab soufflé; rubbery. Sides; a Corn dish which was decent, portobello fries; also pretty good and kale... Way to salty, but cooked well. Entree; I had the scallops-way way way too salty. I seriously couldn't even eat it. Even the risotto was salty. My husband had the crab linguini and for $39 I expected way more crab in the dish. The restaurant itself has an amazing view and beautiful interior but the food is nothing to be desired."}
{"text":"Had breakfast here with friends at 8:30 am on a Monday. Dining room was approximately one quarter full.  Beautiful space, as others have said. Spectacular view, too. Food is mediocre at best. Standard upscale'ish hotel restaurant menu with attendant prices. 

Had two eggs over easy, chicken sausage and potatoes. The eggs were cooked just right. Fried diced potatoes were lukewarm, mealy and burnt tasting. Two smallish chicken sausages were also lukewarm and rubbery. Toast also accompanied. Only white was available.  No butter on them, provided or offered.

Dining companion 1  had the Market Omelette which was an omelette with a variety of seasonal vegetables. In this case, fava beans, spinach, mushrooms, tomatoes and something else which we could not understand from the server.  It was medium sized but dark brown and appeared on the overly toasty side. Companion One says it was overdone. 

Companion 2 had the mushroom and spinach quiche of the day. It was a large slice and accompanied by a nice mixed green salad.  There was no choice of dressing.  She did not remark whether it was particularly good or bad so suspect it was just meh. 

Service was just fine and the space is well laid out for our mobility challenged Yelp brothers and sisters. 

But for the view, I would not return for breakfast. A better or just as middling breakfast can be had at so many other places without paying $3/hour for parking in the hotel lot across the street.  I do not believe parking is prorated either. We stayed a little over two hours catching up and parking was $9.  So heads up. 

I would perhaps try them again for a business lunch or cocktails. But without a bit of a better experience, I will reserve my larger dinner dining dollars for elsewhere."}
{"text":"We've been going to the Statehouse for drinks and dinner much more than I'd like to admit. The location is amazing, the price is right, and it's free of the loud undergrads. We really like that you can hold a conversation across a table of 6-10 people without having to fight with loud music and guests. It did have a very rough start (see my previous reviews) but has steadily improved since then. The food and drinks are on point and the staff is extremely friendly. They are constantly bringing out new menu items which is exciting and some of the new talent they've acquired in the kitchen and bar area has really paid off.

Also, a huge plus that we just found out about is that they do validate parking. It makes the Statehouse an easy decision when we're taking a car downtown instead of Uber."}
{"text":"I cannot comment on their food specifically, but we were staying in the hotel and went down at 11:45pm to have a drink on a Saturday night, and we were informed that the bar already did last call. The bar was filled with people including a bride and groom who had their wedding there, so this did seem odd to me that there was a last call with so many customers before midnight on a Saturday. Moral of the story is just to make sure you take advantage of the refrigerators they have in the room, because they charge $7 for a beer anyways."}
{"text":"Visited on Father's Day 2016.  Assigned waiter provided poor service.  He was perfunctory, and he was non responsive to requests, even simple ones such as asking for additional half and half for our table of 8.  Long delay in food delivery, and two people received their plates 15 minutes after the rest of us.  Complaint to management went unanswered.  Food quality was average.  We are l30 year locals, unlikely to return.  The dining room was not busy."}
{"text":"From looking at the other reviews on here, I am a bit relieved that I only imbibed at the Statehouse.  It really is a beautiful space on the lakefront here in Madison, which is a rare find.  I have my fingers crossed that their kitchen will be able to work out the kinks!  I highly suggest meeting up with friends and family for unwinding on a late afternoon/evening."}
{"text":"I ate here twice, dinner and breakfast. Wouldn't have eaten here twice if I had not been staying at the hotel.
Service both meals was very slow to non-existent.
Dinner was cold steak but hot side of fries.  You would think the steak would have been at least warm. When I told the server his response was, \"sorry\".
Breakfast was okay but expensive $15 for an omelet. It took 20 minutes after I was seated to get waited on.
Will not be back to the restaurant or the hotel."}
{"text":"We are staying at the Edgewater on an annual romantic getaway excursion. We were so pleased with a top-rate meal tonight, stellar cocktails and impeccable service by the warm and gracious Dean and Rileigh. Truly baffled by the lukewarm reviews for this place. The food and service always impress, especially Dean our knowledgeable and elegant waiter."}
{"text":"Awful! We were here for nearly hours due to slow service, several orders of cold fries, drink mix ups, and waiting 45 minutes for our check. Waitress said fries didn't come with our meals so we ordered extras. Turns out every meal came with fries. It was a huge mess. Had to go out of our way to confront the manager by the end of it because it seemed she purposely avoided our table. Will not be back"}
{"text":"Enjoyed two meals at this restaurant over the past weekend.  Our dinner at the Statehouse was truly spectacular.   The waiter was knowledgeable about the menu and wine list and gave us the opportunity to sample a wine before we ordered.  He was attentive throughout the meal without being overbearing.  The food was delicious!  I had the salmon and my companion had a steak - both delicious and cooked just right!     In reading some of the previous reviews, it seems that the service was not up to par .... they seemed to have figured it out!  We were delighted!  Definitely an upscale experience.

A nice bonus is the gorgeous view from the restaurant.  Lake Mendota is beautiful.

Lunch was also excellent!  Our salads were fresh, tasty and attractively presented.

I would highly recommend this restaurant for the food, the service and the spectacular views."}
{"text":"This restaurant has terrible service. We ordered a 3 course meal for restaurant week and ordered our appetizer, main course, and dessert all at the beginning. Our appetizer and main course came quickly and tasted delicious. After our plates had been cleared, we waited over half an hour for our desserts to come out. The table next to us, which ordered the same thing after we had ordered, received their dessert before us. In addition, we parked in the garage and hoped to have our parking
 validated. We were told that the restaurant was out of parking validation tickets but that we could press the call button on our way out and they would let us out for free. The restaurant staff lied to us as there wasn't even a call button in the parking garage. I am very disappointed with this restaurant and would not recommend it to anyone. The only reason they have 2 stars is because the food was decent."}
{"text":"We went to the Statehouse for our anniversary. It couldn't have been better. Service was respectful, quick, and spot on. Food was excellent!  Favors were simple, but delicious.  I had the salmon and my husband had the ribeye, both were great. This will be a new favorite on my list of fine dinning Madison restaurants."}
{"text":"Gave them a second chance after making the mistake of going on restaurant week last year. The service was great, Dalton was responsive and offered great service. The food was great, the wedge salad being my favorite. It was nice to see the service matches the wonderful views of lake Mendota!"}
{"text":"My husband and I were very excited to check out the restaurant at the newly remodeled Edgewater Hotel, The Statehouse. We made a reservation on Open Table and were surprised when we arrived and found out the restaurant is really only open to hotel guests at this time, so it was pretty empty inside.

Moving on... The service was good, though not the best we've had in Madison. The arugula salad was good, as was the octopus appetizer. For main courses, we got the crab cake soufflé and the Kansas City Strip. Both were good, though again, not the best we've had in Madison. The creamed corn side was great though! It had some caramel popcorn on top too which was delicious!

The wine list is on the small side but they do have some nice options. We didn't see a cocktail menu so I'm not sure if they have that ready yet or not.

The ambiance needs some work but has great potential. The lighting was a bit bright and the overhead music was very soft. We don't want to have to yell to hear each other  but also don't want to hear all the kitchen noise.

We will definitely be returning to the Statehouse in the next few months after they get all the kinks worked out. The new Edgewater Hotel is very nice and there will be a nice variety of dining and drink options available once everything is open."}
{"text":"Great premium dining experience. Service, venue, ambience, view, menu, wine list - all top notch. As you would expect, you pay for it as well.  We had a very enjoyable evening."}
{"text":"The Edgewater is in a great location and had decent drinks. 

That being said the service was terrible and incredibly slow. It took over a half hour for simple drinks to arrive at your table. The food was also bad, it was tiny in portion and overcooked. I would not reccomend eating here."}
{"text":"I was really looking forward to trying out the cocktails at the Statehouse. Unfortunately I was not as wowed as I had hoped. The cocktail menu has some standards, and the apple old fashioned was tasty. However, adding in tax, parking, and tip; $30+ for two cocktails is a bit much for an average bar experience. It seems to be the most expensive parking rate I have seen in the city at $3.00/hour."}
{"text":"The plus side: Gorgeous views, delicious crab cakes, nice staff and ambiance.
The minus side: The onion rings. PSA- do not be temped by the onion rings.

For me, the lake view really made the  experience.The food was in general good, with a few rock stars and a few misses. Overall, I was not \"wowed.\" Which is why I'm dealing out 3 star

What I tried:
Crab cake lyonnaise- fantastic, this was one of the rock stars. One of the best crab cakes I've ever had.
Waygu meatballs- did not like the texture at all. Not quite seasoned enough. Was better when used as a spread on bread.
Lobster bisque- lovely, very rich, very flavorful. You should order this.
Grilled Atlantic swordfish- Fish was cooked  perfectly but simply. Served with roasted red potatoes that were very boring.
Grass fed beef tenderloin- added steak diane enhancement- delicious, but not quite cooked as ordered. Did not ask for a re-fire, but i'm sure they would have happily done so.
Potato hash browns, horseradish cream, arugula- it's one really big hash brown that is about 5 inches in diameter. Not enough sauce but was pretty good
Beer and vodka battered onion rings- very oily, not flavorful. Would not recommend at all. Our server was very nice when we said we did not love them and look it off the bill. Which was very nice and above and beyond.
Pear tart- The worst. The crust was so hard it could only be sawed apart with a steak knife and the pears were very hard and lacked flavor. The red wine reduction, however, was very nice.

Overall, I would probably come back and was definitely worth the visit. I'll be back, but may be in a year or two."}
{"text":"We visited both the terrace and the bar inside during the week. Not very crowded. Atlhough.....85% of the terrace was taken by a big, loud group, consuming 120% of the attention of the waiters. We really felt neglected. Had to call out several times to make an order. Saw at least five different people. Food was delivered without any word, the bill was almost thrown on our table, so you can imagine we gave a very lousy tip. Sorry. If you don't even bother to make eye contact, you should look for an job in an other industry.

How different was the service inside! A real nice guy from NY. Entertaining, quick. And although he mixed up my order it didn't feel as a problem."}
{"text":"The Statehouse is now open to the public (as of 10/18/14).  Went for Saturday Brunch on opening morning.  The view is great and the Dining Room looks beautiful, as well as the full bar, which is not yet operable.
  
Service was acceptable but not great.  He was friendly and somewhat attentive, but he seemed to lack experience.  We (2) both had coffee and noticed that they need to change the little cream holder/dish; when you pour the cream, there is nothing you can do to keep it from dripping down the side and spilling everywhere.  

The food, like the service, was acceptable.  We ordered (1) Fruit Plate, which was beautiful and (2) The Biscuits and Gravy, which was served with fried ham and some eggs.  Very middle of the road.  I ate it, but was not impressed enough to go back for it.  We also split the Red Velvet Stack.  I was very excited because these are, as far as I know, the first on menu Red Velvet Pancakes in town.  One again, they were alright.  Not very red, but more brown, which is actually more true to red velvet, and I'm not going to complain that they decided not to put dye in them.  The flavor of the actual cakes was fine, they did however pick up a lemony flavor from the mascarpone.  I should have ordered the mascarpone on the side and asked for real butter, that was my own mistake.  

I will go back to try more of the menu, as I am a Breakfast and Brunch freak.  I just hope that next time I am as impressed with the way the food tastes as I am with how good it sounds on the menu."}
{"text":"Lovely views and a great bar, but unfortunately I cannot review the food this time.   We had a great time enjoying some delicious cocktails from the bar and taking in the lakeside views inside and out of the hotel.   Great place during the day to relax and wind down."}
{"text":"I've been to the Edgewater twice now for food/drinks, and, living on Langdon Street, I want to give the place the benefit of the doubt because having such a beautiful restaurant/facility practically next door is exciting. And yet, both times I have been underwhelmed. 

The service is very formal, which may be a good thing depending on your taste, but from my perspective, tends of come off as stiff and just a little bit classist.

More importantly, the food is nothing but a let-down. Madison is a foodie paradise. With destination restaurants such as L'Etoile, innovative gastropubs like Merchant, and local ingredients galore, the Statehouse cannot expect to compete if it continues on its current path. My bother and I ordered the duck confit poutine ($10). The fries were clearly frozen, the duck was dry, and the cheese seemed extremely processed. There was also a small (imperceptible until it was in my mouth) bone left in the duck meat. My brother ordered the bourbon burger ($12)--although we're 95% sure he received the bacon cheeseburger instead--medium rare, and received a dry, overcooked (no pink to be found in that patty) basic bacon cheeseburger. I, not having high hopes, ordered the grilled cheese sandwich ($9) which was actually very tasty but, come on, how do you screw that one up? 

All in all, other reviewers are right on the nose when they say that the Edgewater and Statehouse are beautiful, but the service is stiff and still working out some kinks and the food is mediocre at best, and certainly not worth the price, even if you factor in the ambiance. I have high hopes that the Statehouse will work through these growing pains and begin to invest in high quality ingredients and attention to detail. If not, the restaurant will not survive in the Madison dining community."}
{"text":"I must add the manager contacted me & refunded our bill which was very nice of him. I hope the server in question learns from this & improves her skills. The Statehouse management called & were very apologetic & made up for he poor experience."}
{"text":"Inedible food and incompetent service in a shiny 4-star toy on the lakeside waterfront \"100% corner\" in Madison.  After staying at the Edgewater for business over four days and dining at the Statehouse four times, this review applies to the front of house and the back.  Routinely, I was not acknowledged or offered water for more than 20 minutes even when indicating in advance that I was on my way to a meeting.  The food was not served to order (raw poached eggs, tough and over salted meats/fish, over sauced mystery fish, raw strawberry pie dough). At breakfast, I had to request my check FIVE times and was 20 minutes late to my meeting.  At the last meal (and why didn't I learn my lesson?), my salad and entrée were served at the same time, swimming in a mass of unidentifiable glop.  Servers are not trained/ knowledgeable about what they are selling/serving. I had requested fish similar to trout and got a fatty, oily, thick, tough, over-salted bottom feeder.  When I opened my napkin for silverware, there was a lone spoon inside and no fork so I couldn't eat it anyway - again after a 45 minute wait.  I sent it back and got a cheese plate. Go for the view and enjoy a drink, but prepare yourself to feel like the invisible guest.  I suggest all employees watch the film \"A Five Star Life\" (Italian with English subtitles) to get an idea of a luxury guest's expectations and the Statehouse's vast room for improvement."}
{"text":"We enjoyed a very nice dinner with good attentive service and very fine food. It was our first visit to the dining room after being at a couple of functions since the opening of the new hotel. 

The appetizers were highlighted by some very large prawns in the shrimp cocktail that were firm and succulent. The oysters of the day were a bit on the small side, but were also good. 

My wife had the fish of the day a pan seared Rockfish that was outstanding. It came steaming hot and was prepared just right. I had a ribeye steak sandwich that was tender and had great flavor. 

We enjoyed the view of the lake and the feel of the room. We will be back again."}
{"text":"Update 2/22/16
I have to say I am very impressed. The next morning after posting the review below. I received a call and email from the general manager of the State House. He apologized for our experience promised to follow up with his staff. I really appreciated his concern and I have changed my mind. I will go back to give the State House another try. 

2/21/16
We went there today with family we don't see often. The atmosphere is beautiful with a great view. The food off the menu and the brunch was good but not remarkable. 

The reason for the low review was our waitress. She spilled our water, mixed drinks, and coffee. Not just once or twice but every time she attempted to pour a drink or serve it. She never offered to help clean up what she had spilled or even offer a napkin. 

She criticized a choice of drink order. She mixed up the orders when serving, had to be reminded of small requests like a knife 3 times and Then after we had paid the bill and were saying goodbye she came to scold us for taking staying too long. 

To be honest, I expected at better level of service from the Edgewater. I won't be back."}
{"text":"Made a reservation for Restaurant Week before reading any reviews. Then after reading the reviews, we had very low expectations, which were definitely warranted.

The restaurant is inside a newly renovated hotel.  Walking in towards the restaurant feels more like a brightly light hall of fame tour.

The restaurant itself has a nice view and general atmosphere, but terrible service and mediocre, bland food.  

Apparently, it was a chore for our server to do anything other than take the order and deliver the bill.  Nothing was explained on the menu,  our table was never checked on through the meal, and we were never offered anything other than table water.

The meal was overpriced for Restaurant Week. But I would have been infuriated if I had to pay full price for lukewarm food with no seasoning.  I cannot recommended a single thing we tried.

For being a Friday night, the restaurant was not busy -- apparently word is getting around about this less than stellar experience."}
{"text":"Beautiful lakeside view, delish food. Pure elegance.
We dined there last night.  Jodie is an excellent server.
Kudos to the staff."}
{"text":"The food was great and the service was perfect. Restaurant Manger Liz is very friendly and professional. Couldn't ask for a better experience!"}
{"text":"My husband and his family were meeting in Madison for his father's birthday.  We were able to stay in the hotel that the Statehouse is in. The food, drinks and service are wounderfull. The only problem I have is the price. It costs more for a cocktail then high-end cocktail bars in the Twin Cities.The breakfast while delicious was as pricy as an expensive lunch. They staff was wounderfull, if a bit inattentive. I did enjoy my time in the Statehouse. It feels like a very sleek Manhattan hotel bar. Except the employees were way into the WI game. So my opinion the flavors were enough to surpass the rest of the experience.  I would say worth it. Once in a while....once a year."}
{"text":"We walked in and thought.  This is amazing. But unfortunately it went down from there. Service and food were both underwhelming.
And then the manager from the state house had an amazing treat with champagne waiting for us after our Spa treatment. 

Really nice. Second Chance. Chanced my review"}
{"text":"My mom stayed at the Edgewater a few month ago and we had dinner with a few friends at The Statehouse. The service was incredibly friendly and competent. The food was delicious and beautifully presented. I also really enjoyed the wine list which featured a strong selection of lesser known California wines that I rarely find in Wisconsin. We will be back!"}
{"text":"We had a stellar experience at the Statehouse last night. The new decor gives it a warm, New York feel. We enjoyed seeing the happy couples celebrating weddings and reunions while we enjoyed our drinks on the terrace  overlooking gorgeous Lake Mendota. 
Our indoor table also overlooked the lake and the impeccable service started as soon as we arrived. The warm olive bread and seasoned butter were a nice way to start our evening. The appetizers were generous. The lobster bisque was a hit. 
We ordered salmon, steak and scallops. We all agreed they were done to perfection. The sides of mushrooms and frites added a nice compliment. The only thing I could improve was the house salad dressing was a bit strong with mustard/vinegar (and I usually enjoy grainy mustard). 
Save room for the apple pie (that easily served four of us), and the hazel nut chocolate dessert. Both a bit of heaven. 
Watching the storm brewing during sunset was amazing. We took some great pictures. 
Definitely worth the spurge."}
{"text":"I was veeeery excited to try out this restaurant since I had been watching/hearing about the Edgewater's exciting renovations for such a long time, so when a member of my dinner group suggested it, I was delighted. We dined here on 10/11/14.

We valeted our car.  I wasn't even out of the vehicle before I was greeted by a couple of obnoxious drunk guys spouting off at the mouth.  Badgers won that day-gotsta celebrate I guess.

While one of us checked in our party of 12, the rest of us thought we would get a drink at the bar while we waited.  It was a very makeshift bar-the kind you would find at a very makeshift wedding reception with only a handful of different liquors set out on a table with some wine, no tappers, etc. Thankfully they were ready to seat us before we even got to order... so we proceeded to the table.

The restaurant was comfortable. High ceilings, warm, soft lighting from the well scaled chandeliers hanging above. Obviously the view of the lake was fantastic as the Autumn sun was setting.  Too bad the open kitchen's bright task light kept trying to creep in and ruin my ambiance.  

So back to my pre-dinner cocktail....I love a good old fashioned and quite frankly, was scared to order one after seeing that ghetto bar, but it's what I really had a taste for, so I thought I would exercise due diligence and ask some specific Qs, such as, if they muddle their drinks, etc. After about 30 long minutes, our drinks arrived. Well, the muddling turned out fine, but there were only about four ice cubes in the entire glass. One of my dining companions, Rich B. (see his recent review on 10/12) was kind enough to order me a glass of ice to make it right. Thanks, Rich B!  

I ordered the beef heart tartare. Edible, but still some of the worst I've ever had and I pretty much order tartare whenever I see it on a menu.  Chef was a bit heavy-handed on the mustard. 

I ordered the Filet for my main course-medium rare.  They served it to me somewhere between Medium to medium well. I sent it back and enjoyed the company of my friends while they prepared another for me.  Soon afterward, as my friends were finishing up their meals, the Manager brought me my second steak.  I cut into it to find that it was so rare it was purple.  Mgr said she was hurrying my steak so that I could eat dinner, but I never really ate anything because I obviously sent that one back too. Haste makes waste.   They did ask me if there was ANYTHING on the menu they could get me to right this wrong, but at this point, my friends had finished eating and I had run out of patience, so it's a good thing that bottle of Sauvignon Blanc I ordered went well with my bread and butter dinner. 

My husband had the Seared Diver Scallops with Risotto. He wished there were more than three scallops, but the dish was tasty.  Many of our friends ordered the fish and it was horribly overcooked in every case. 

As a peace offering to one of us in the group when they forgot to bring out their side dish, they offered a different potato type side dish of baby potatoes encrusted (=coated and rolling around in) salt.  //see picture//  This was perhaps the highlight of the evening and gave us all a good chuckle.  It was something you would expect your four year old to whip up and surprise you with on Mother's Day.  What on Earth was going on back there in that kitchen?!?!

No.  Just no."}
{"text":"Since we were staying at Edgewater, we ate dinner and breakfast here for our last night. 
Kitchen closes at 10 pm, but their bar is open with bar food only so this review is only for that. 
Bar food is decent. Calamari was good but the salad I ordered was just okay. We had Brussels sprouts and soup for snack before the gym and that was good. Although I must say service is just a little slow considered that the place was not that busy. 
For the breakfast, the quiche was super tasty and came with salad. We also ordered some  Belgian waffles and they were good better than what I have had before. There are small and crunchy outside and soft inside which was good. 
When we come back for a business trip again, will definitely stay in Edgewater and try this place for dinner."}
{"text":"It never ceases to amaze me how many people visit a restaurant just as it opens then hit Yelp and hammer them with 2 stars!  Everyone knows this industry takes time to work out the kinks and a lot of these reviews are petty and premature!  That being said, knowing The Statehouse has been open for over a year they really do an amazing job!  Truth be told they have one of the best views of the lake in Madison, but they don't rest on that.  They have exceptional service and outstanding food and drinks to boot!  Having just visited again last night, their wedge salad is one of the best in town (I know, you're thinking it's just a salad, but trust me and order it), their lobster bisque is drool-worthy, and the chilled crab claws are out of this world.  

My advice, take the older reviews with a grain of salt and visit The Statehouse...I truly think you won't be disappointed!  But if you're up for something more casual, hit the Boathouse, it's equally as delish!"}
