{"text":"The previous reviews are pretty accurate as to the description of the venue.  Beautiful view of Twin Lakes - which is what upped my rating to a 3.  Nice choice of wines, including a house bottled wine, at very reasonable prices.  Limited menu, but nice range of choices. Food is delicious and well-prepared. So why doesn't the restaurant attract more traffic. 1. They need to decide if they are a catering venue or a restaurant, how you can have a restaurant that is CLOSED ON SATURDAYS is beyond me. 2. They need to decide if they are a bar or a restaurant; when you are spending 100 dollars on dinner for two and cannot get a table on a Friday night because groups of golfers are drinking cokes and beers, it is a problem, which leads to - 3. They need to learn to take and honor reservations."}
{"text":"I will begin by stating that none of what follows was any fault of our server.  She did everything possible to try and accommodate us but I will chalk up the experience to a failure on the kitchen and planning of the establishment.   1.)  We made our reservation for New Year's Eve after viewing the menu online and from the look of it, there were many options for appetizers, entree's, salads, etc.  However, once we arrived and were seated, we were informed that there would be a limited, pre-set menu for the evening because \"we are booked solid and it's easier for the kitchen\".  There was no posting of the set menu on the website or when contacting The Overlook for availability.   Because of this, our selection in all categories was cut to about one third of the original menu.   2.)  We chose the calamari appetizer which was described as a crispy breading with a sweet chili sauce.  Although the dish arrived hot and had good flavor, the breading was completely soggy.   3.) When ordering our entree's (keep in mind this was at 7:45 pm) we were informed that they were already out of the filet (further reducing our already limited choices).  I chose the bone-in ribeye while my wife chose the boneless ribeye, both ordered cooked medium.  While waiting for our dinner, we overheard the server at the next table inform the guests that they were now out of the filet and the boneless ribeye (it was now 8:00pm at this point and we counted at least 1/3rd of the tables were still open, I'm not sure who was ordering all of the steak).  On a side note, any kitchen worth it's salt knows that of you cut the bone out of the 16oz ribeye, it can pass as a 10oz boneless ribeye, but I digress. 4.)  When the steaks arrived (sides of green beans and potatoes au gratin), both were severely under cooked.  My wife's steak appeared to still be raw through the center (despite the amount of char on the outside) while mine was cold to the touch.  Our server mentioned that they had been sending a lot of steaks back that evening  (a mystery as the 'fully booked' restaurant was still only half full so I'm not sure how many it takes to reach 'a lot'.) Either the steaks were frozen accounting for the charred outside/raw inside or the kitchen staff does not know medium from rare from raw.  For the record, the steaks were less than an inch thick, so I can only imagine how the filet (the apparently few available that evening) came out.  As for the sides, the au gratin potatoes were obviously cut from a larger serving dish as the portion on my plate was perfectly square.  The green beans were perfect. 5.)  Our server apologized for the steaks and took them back to be cooked longer (as the kitchen was now out of steak), and they were returned  as medium well/well.  At some point in any poor dining experience, one hits the 'let's just eat and get out of here' mode.  We hit that point about now.  We would have left earlier, except we hadn't finished our bottle of wine, which like the green beans, was excellent. 6.) I retract my comment about the kitchen not being worth its salt.  Salt is apparently the one thing the do very well back there.  My potatoes were inedible without downing a glass of water in between bites, while my wife's serving alternated between loaded with salt or pepper depending on the bite.   7) At this point our server knew we were ready to leave, and even the manager offered a free desert for our under-then-over-cooked steaks.  We took the desert to go but honestly, 24 hours later, it is still in our refrigerator.  We were offered an apology by the manager when we left, but frankly, we will not be back.   If your reasoning for having a limited menu is to 'make it easier for the kitchen because we are fully booked' then you had better be able to handle the limited menu.   Bonus, there was live music which was set to an appropriate volume so diners could still have a conversation without yelling."}
{"text":"As for country clubs go, I don't usually attend due to an uppity nature, but this is on the water and full of a boaters mantality. Fresh fish and meat year round. The food is delicious for a setting like this. Wine selections, service, full bar and atmosphere is great. I suggest lamb lollipops, scallop wrap, rosemary fries and chicken marsala. I have had most of the standard menu plus their specials! I approve."}
{"text":"Awful...never go there! We had my daughter's wedding ceremony there and the wedding planner and owner were not the least bit accommodating. They made what was supposed to be a special day stressful and worrisome. The planner was nowhere to be found when we needed her and when we did manage to track her down she acted annoyed that we were asking for her assistance. Not to mention the place was dirty from the previous evening's service. The wastebaskets in the bathrooms were overflowing and there were crumbs all over the floor. Awful experience! They don't deserve your business."}
{"text":"It is an amazing place with a beautiful ambience !! The patio overlooks the lake and watching the sunset is an experience by itself. The food is \" par excellence \" and the wine selections are perfect . CJ is a great \"host\" and always takes care of me and my guests. Michaela is very nice enjoyed meeting her. A special thanks to Marie !! Zou who is also the owner , is a very personable guy and Jay is a super great chef . A special thanks to Stephen who takes great care and makes sure everyone is having a good time. Would highly recommend this place.  Thx DR MD"}
{"text":"Finally made it here! After hearing a lot of good reports, we finally had the perfect Saturday weather and schedule to have lunch. The restaurant is actually part of the former country club and therefore has some large meeting rooms and event venues as well as the dining area. The new owners of the golf course have opted for a public course and have built a new club house nearby.  The weather was great and there was a large party indoors, so we opted for the outside deck overlooking Twin Lake. I chose the mussels, which were great: carmalized leeks, saffron sauce, chives, cherry tomatoes,  in a faily creamy broth, all topped with nice toasted baguette slices. The mussels were divine and the sauce was great for dipping the baguette between the mussels. My friend had the \"house\" salad, which was anything but normal: nice baby greens, feta cheese, candied walnuts, with a well balanced balsamic dressing. She chose to add a grilled chicken breast that was moist and had been sliced into strips. I will definately be back, as the dinner menu looks very interesting!!"}
{"text":"Ask for raspberry brownie cheesecake. Enter heaven!!!  Tuesday is retail wine night and half priced apps!"}
{"text":"My wife and I love the Overlook. We started coming here after the Rusty Nail closed. The staff, including bartender sisters Mary and Christie, are such warm people. The deck overlooking east Twin Lake is beautiful. I just wish it would get the traffic it deserves, The biggest problem is that it's a block off of Highway 43 so unless you know it is there, you would just keep driving. They are not allowed to have a sign on 43.  Still, please frequent the Overlook. It's a hidden gem."}
{"text":"If you can sit outside at The Overlook, do it! The views of the lake are gorgeous and perfect for a little dinner getaway!  This would be a great date night spot on a summer night! I ordered the Sicillian Eggplant which was like an eggplant parmesan.  It was a very thinly sliced fried eggplant that came over an alfredo pasta that was great!  The cooked veggies were also good too!.  I would love to go back, sit on the patio and try another yummy dish!"}
{"text":"My wife and I ended up here because we were looking for a few things:  1. Outdoor seating 2. Views of water 3. Good food and wine  Honestly, the Overlook delivers pretty well. Their patio overlooking the quaint twin lakes is really nice. The view is excellent and the table choice is nice. I highly recommend the patio scene as one of the best in the area.   Sadly, the rest of the venue is awkward and severly dated. I'll admit, they are working with what they have. The Overlook is also a banquet center and is decorated as an old golf club would have been - since it is an old golf club. You enter into the old entrance of the club. It is lazily furnished and is less than welcoming. The bathrooms for the men are downstairs in the old locker rooms. Weird.  Once you get back to the restaurant area, it gets a bit better, but this space needs some updating in order to separate it from the \"banquet hall\" look of the majority of the rest of the space.  Lesson - patio!!  The craft beer list was top notch and the wine list was equally impressive. The wine was also reasonably priced. I chose a Cab ($6.50) and the pour was generous - high marks for the booze.  The service was pretty good. Our waitress was very nice. It ended up being a bit windy outside and she was able to easily move us into the main restaurant.   We started with cheese sticks. They were fine, but nothing that I couldn't pick up at a local grocery or fast food joint. Oddly enough they were reminiscent of the sticks at Arby's.  The wife and I both had the burger and ordered it medium. The bun was great as were the fresh cut fries. But both burgers came out grossly under done - rare at best. The edges were seared, but the entire inside of both was raw. Sadly, our waitress never came back to check on us in order to remedy the issue. We ended up having to take them off the bill and headed out. The waitress actually came back to the table after asking her head chef and having him confirm that the burgers were, indeed far from being on par.   I'm going to give them another swing, but only because of the patio. It is just too nice to give up. So, stay tuned for an update that is hopefully better."}
{"text":"By far The Overlook is one of my (if not my number 1) favorite places to dine, relax and just enjoy a nice glass of wine.  The food is always prepared to order and the manager/chef does everything possible to meet my dietary restrictions.   The bar and wait staff are top notch!  Their professionalism and friendly demeanor is so welcoming that each guest automatically feels like one of the family.    Because of my food restrictions, the only proteins I'm able to eat without issue is seafood.  Zou will, without hesitation, adjust most menu items to accommodate my needs.  My favorite is a spinach salad with seared scallops and a warm vinaigrette dressing.  To. Die. For!!!  Christy the bar tender is amazing and guests are always greeted warmly and with a smile.   The view over the lake is just stunning and I'm sure anyone who visits the Overlook will find the atmosphere just as enjoyable as the food.  You can't help but feel good from the moment you walk in and you will dread the moment you have to leave."}
