{"text":"The homemade chips are great. So was the soup.  Fast service. Moderate prices. Nice view of the driving range"}
{"text":"we heard about a great fish fry.. much to our dismay, it was NOT.  baked fish was cold, and our waitress, scooped the fish off our plate, with tongs  to reheat.. brought back the same fish warmed up- leaving us the fries & cold slaw.  Brought back the same fish, all slimy - with our cold fries and warm coleslaw to ENJOY!.  I would warn every single person about this fish fry... GO SOMEWHERE ELSE IF YOU WANT A BAKED FISH FRY... (a negative rating if you want a baked fish fry.. and WE LOVE FISH FRY!!)"}
{"text":"This restaurant can not get the orders right two days in a row they can not even put the order in right or bring it out to the customers with all your food right missing food on your plate had to send it back two days in a row"}
{"text":"Tried for first time. Husband had breakfast and I had lunch, so that was a positive. Food was nothing special, but it was freshly cooked. Falls into the category of good value for money. Service was very attentive with constant refills of soda."}
{"text":"Four of us went for a fish fry on Friday. The fish itself was great. It's served with fries and coleslaw. Problem was that the dressing for the coleslaw ran all (and I mean ALL) over the plate, making the fries completely soggy. Couldn't cut the fish without getting dressing all over it as well. Suggestion - put the slaw in its own little dish or plastic cup to keep it separated from the rest of the meal."}
{"text":"The Crooked Putter has the best FISH and Chips
Plus great Cole slaw every Friday night.
The prices are so fair for \"an all you can eat\" restaurant.
The serve staff are friendly and make the evening lots of fun."}
{"text":"OK, this is a homey little golf course cafe that caters to the golfers and putters.  They usually do a decent job, but when busy, miss the mark.  My wife ordered scrambled eggs and sausage.  She received eggs over easy and bacon.  Ok, they were busy, but folks at the flat top need to read the orders closer as this is the second straight mix up in our order in consecutive  visits.  Frankly, I get the impression that they are truly too cramped for adequate space behind the counter and their equipment needs a serious update to accommodate a rush in business. And it is quite noticeable that staff are side-stepping, dodging each other and just squeezing by to move about the kitchen area.  My suggestion would be to close for a thorough remodel. On the brighter side, prices are reasonable, staff is welcoming and courteous.  The food is good and the pancakes are great."}
{"text":"I went to this place on Friday evening for the all you can eat fish fry (essentially fish and chips).  I paid around $25 for 2 people which is quite reasonable.  I had trouble finishing just one plate, so the helpings are generous.  My friend had the fried fish and enjoyed it very much.  I prefer mine baked and found this to be quite tasty.  The chips were crinkle cut and were good as well.  Not overly greasy.  I did find the coleslaw to be a little bland, but this is very easily overlooked considering most people do not order fish and chips for the coleslaw."}
{"text":"Nothing fancy here, but good salads and sandwiches with a lovely view of Grandview.  Everyone from servers to customers is friendly and welcoming.  the Ceasar dressing tasted homemade - quite delicious."}
{"text":"I'm being kind giving it a single star. The entrance is bland & cold no character to the building. It's industrial looking.  Dead flies all over the entry door, makes you wonder how clean the inside is. Not!!!  The noise level is horrendous. You can't carry on a conversation with your table mates. I don't want to hear conversations around me nor do I want them to hear mine. The food was mediocre a wide selection on the menu but a little high on the price points. Service was good the reason for the single star & she was willing to give us three separate checks."}
{"text":"Stopped by here and it was the worst breakfast I'd ever had. It's hard to screw up breakfast, but the cook managed to do so. The waitress wasn't attentive towards me. Maybe it was an off morning for them. I'll never know, though. I'll never be back"}
{"text":"Went for breakfast. Nothing special as for food but not horrible. If you are golfing here then by all means stop by for a bite. Otherwise there are WAY better places for breakfast around. Did not try lunch so can't speak to that part of the menu."}
{"text":"This is a great restaurant , place is reasonable  priced , large portions  and good food and services . The place is simple"}
{"text":"We love coming in for breakfast and lunch. Good food, good service, and good deals. Great place to cool off and get a bite to eat and a drink."}
{"text":"I had heard good things about this place and being a local and living nearby, it seemed worth a try. We arrived about noon on a weekday and finding no hostess or server to seat us, we sat at a table on the outdoor patio. With no staff in sight after being seated for 5 minutes, I ventured inside and still could find no one to make eye contact with. I returned to our table and found that my wife had talked to a server and ordered our drinks. Someone came to our table after 10 more minutes and took our food order. After waiting patiently for 30 more minutes for our sandwiches to arrive, I flagged down our server and asked why our food hadn't arrived. She told me it would \"be right out\". We waited 15 more minutes and walked out. I've rarely suffered worse service than this in many years of dining out. It seems this place is more focused on serving beer and wine than food. The tables around us were getting their drinks refilled with no wait at all. Even if the kitchen is having a problem, the customer should be told about it and decide whether to order or leave."}
{"text":"The servers are polite and competent.
The breakfast are excellent as is the decor"}
{"text":"Came here for breakfast at the insistence of my grandparents. They love this place. I ordered your standard breakfast fare and it came out fast and hot and cooked perfectly. The potatoes were excellent. The wait staff was friendly and responsive! I hear they have fish frys too so I'll have to come back! They come highly recommended by the locals, so check them out."}
{"text":"STAY AWAY
I really wish I could have left 0 stars. This was by far the worst restaurant I have ever been to. We went for friday fish fry all you can eat. The place was filthy. The floors and the walls were disgusting, and there were flies all over the place! On top of that the service was HORRENDOUS, absolutely awful!!! They  got our order wrong twice!! And didn't make eye contact with us as we were waitng to place another order, and there were only 3 other customers in there. Doesn't stop there, the baked fish was OK , the french fries and coleslaw were nasty, and the tarter sauce was basic and tasteless. My neighbor raved about the price,  which I was not impressed by either, I looked over their menu which I thought the prices were the same as any where else.
please save yourself from this horror!
Bad bad bad, just bad."}
{"text":"This is a nice little place to come and have a bite to eat. I had the patty melt and it was delicious. It was also nice to be there in the winter time and we could watch people hit balls while we had a bite to eat for lunch.  The homemade chips are also very tasty."}
{"text":"Best. Burgers. EVER. That's truly all you need to know. When we're in the mood for a treat at work, we'll head on down for the cheeseburger lunch special: a BIG burger, a pickle spear, fries, and a drink. So delish! 

This is also a tasty stop for a hearty breakfast burrito. You'll love it!"}
{"text":"Need to update my last review of this restaurant. Went there a couple of days ago with a large group of people and experience a super job by the chefs and wait staff. Food very good, service very a good. I will continue to go and enjoy the service and food there as long as they continue in this direction. KEEP IT UP!"}
{"text":"This place is great!  Good breakfasts at fair prices, and THE BEST fish fry (WED. & FRI) I have ever enjoyed.  Quality fish, thin coating, and the fish / fries / slaw will keep on coming if that's what you want! The only problem, during the winter you need to arrive by 4:30 pm to find a table for enjoying the Fish & Chips.  Tip --- you can also get the fish baked, or a \"half and half\" plate with a little of both.

Also, the staff seems to be happy and friendly and quick to chat and share a smile.  We stop at this place at least once per week."}
{"text":"This place need to be cleaned... Needs to be on  dirty dinner. Gave it one star because it is the lowest I can go."}
{"text":"I gave it four stars because of accommodations. It's just a cafe. But, the breakfast is great, the wait staff is friendly, and the the prices are reasonable. Sure, it's associated with a golf course, but, so what. Food is great!"}
