{"text":"This is your run-of-the-mill Hong Kong style fast food restaurant with fairly affordable pricing. Too bad in 'sauga you don't really have much choice. However, they have good take-out portions and the food actually tastes alright believe it or not. Just don't expect any decent service and a place that's spic and span. I have their food here regularly and haven't died yet :)"}
{"text":"Went to this place as I wanted to get a bit to eat and wanted to have Chinese food at a new place that I haven't gone to before. Went based on reviews and I was satisfied with my results.   The inside is nice as it has many seats, but don't go around lunch time or at dinner as it can get really packed and have a long line up. The dish that I got was the Sweet and Sour Chicken with white rice. I ended up paying $10 as the rice did not come with the dish, so that was a big downside for me.   Over all if you are looking for some quick, cheap Chinese food, then this place is for you. Personally I wound let go out of my way to go back to this place, as there are many other options around the GTA."}
{"text":"I remember coming to this place when I was a kid back in the 90's.  This was before all the new restaurants opened up in Golden Square and it only had Big Bowl Congee, Chiu Chow Man and The Star Fast Food.    At that point in time, Star Fast Food was one of the better options at that time as you could probably get a meal for 4-5 people for $20 including tea.  So it gets one star for \"nostalgia\" factor.    However, I went recently and while the prices remain cheap, the food appears to be have gotten worse.  I got the fried fish with cream corn that came with rice and soya milk for around $6.50.  While the portion was ample and the fish was fried fairly well, the cream corn sauce was pretty sad. It was very watered down cream of corn soup.  It used to be a lot better because it was creamier.  I think this place can do in a pinch, but I'd much rather go to any of other places in this plaza."}
{"text":"The Star Fast Food is a Hong Kong style cafe that you have to self serve as if you are in a McDonald or a canteen.  No one seated us upon entering; we selected a table ourselves.  The menu was on the wall behind the ordering counter.  We approached the cashier to place order and pay immediately.  We approached the counter to get the food when the cashier called our order number.  We carried our trays and plates to the garbage boxes when done.  I am totally fine with this arrangement.   What resulted in the lower star rating was the slow speed of getting the food, in this case breakfast, ready.  We waited so long, and I noticed that latter order numbers were called before ours.  I approached the cashier in an attempt to expedite our order, of which she looked past me silently and walked straight into the kitchen behind the counter.  We got our order soon after, in 3 installments: coffee first, then one-half of the order, then the other half.  This was definitely strange for a simple breakfast order. I could tell the cafe was understaffed this morning, but allowing latter orders to take precedent over ours was not how I expected fast food restaurant to operate.  On the plus side, the food and beverage tasted fine.  The set breakfast and lunches are cheap as per portion.  Obviously, tipping is not required."}
{"text":"Been going here since I was a kid...like 4 years old, I'm 21 now. Love the place, if you don't care about the way a restaurant looks/atmosphere, then this place is great if you just like Chinese food.  All dishes are served with styrofoam containers and plastic  utensils, simple but gets the job done. My favourite is this vermicelli noodle with salty veggies and pork strips. Super simple but very good. Daily lunch and dinner specials are posted on the wall by the register. Order food, sit down, wait for your number to be called. Busy times are normally morning, noon, and dinner. Mid afternoon is more quiet."}
{"text":"The Star Fastfood is a great dive. Standard HK-style cafe food - tasty, cheap and consistent. Unlike most joints in Mississauga, this one has been around for a while - so that's gotta mean something.  ATMOSPHERE: Bit of a dive. Very casual, and not the most comfortable place to eat. But all this reminds me of Hong Kong!  It is fast food, after all, so don't expect a fancy spot. There are 1-2 TV screens playing Cantonese entertainment. It can be loud when busy. Place is not large - may be difficult to fit parties of more than 6-8.  SERVICE: You order at the counter & find a seat. Fast service. There's no table/wait service.  PRICE: Very affordable!  FOOD: Pretty standard fare. Fried dishes are pretty tasty. My family often gets the Singaporean fried noodles.  My fave thing to get is HK-style milk tea and french toast. Which is more of a snack than a meal... BUT their HK-style french toast comes with double-layer of peanut butter! Not, many places do PB in the middle anymore - let alone TWO layers."}
{"text":"Very casual local cafe place.    We have never eaten here before although I come here all the time to just pick up the Hong Kong tea on the go. So one day, the owner asked me why I have never come to actually eat at their restaurant.  I promised her that I will one of these days.    Well, finally we (my hubby, son & I) decided to try this place for breakfast.  Why?  We just felt like an Asian breakfast for once.  Mistake!!!  Lol.  My hubby ordered sausages and egg.  They served him little wieners, the fake stuff!  Haha.  He was very unhappy as he loved his fat sausages.  He totally forgot that Asian restos refer to hot dog weiners as sausages!  Eggs also came over fried and totally dry.  I had satay beef with vermicelli in soup.  Decided not to go for a Western style breakfast in a Chinese restaurant.  Sadly, the soup had no taste and everything was super bland.  I tried adding Sriracha and pepper and still no good.    Combo breakfast were priced at $4.50, including a drink.  So 2 eggs, 2 slices of toast and 2 weiners.  They include a hot drink with the combo but once you change that to a cold drink, there's an additional $1 charge.    Won't be back here for breakfast.  Will just stick to my drive by, regular order of HK tea.  Ugh!  Bad experience!  Although I might try a lunch sometime but won't be too soon as hubby is grumbling a lot that I brought him here.  Lol."}
