{"text":"Dropped in here with a couple friends for a quick bite and a few drinks, but came away wondering how these folks expect to survive.

Our visit went downhill almost immediately when the lone server ignored us for a good 15-20 minutes, despite our best efforts to get his attention. We didn't bother with the food. It's almost as if they don't want you to order it anyway. There is no food or drink menu .... or chalkboard with items listed ... or pretty much anything else designed to illuminate the culinary options. If you're hungry, be prepared to pepper the server with questions. And while there is a fridge full of appetizing craft beer, and several offerings on tap, we left after one drink. Thank God the Wren is only a block away."}
{"text":"Just opened, so it looks like they're still working on a few things (printing a menu would be one), wall decor might be another thing. They have a wide selection of craft beer. It has a great atmosphere when just a little busy. As mentioned before, the haven't printed menus. The bartender or server is your walking menu. If it was my place, I'd type a temporary one up so you don't have to bug the staff with all your questions, and feel less pressure about ordering on the spot.

Anyway, I felt for a new place, the bartender could have been more pleasant and welcoming. Maybe we just showed up on a bad night (everyone has them)

Only stopped in for drinks. We will try the food next time."}
{"text":"I was there this past Saturday (5/6/2017) for my first time, at first I was impressed with the place, seemed clean, lots of craft beers, the dude bartender made a decent gin and soda and that's where things went downhill! The female bartender proceeded to make a drink for a patron... She sat there for 5 mins trying to fish a bug out of the drink, she couldn't get it out with the spoon and that's when she went in with her fingers!! WHO DOES that? I was totally disgusted. I asked for my bill and proceeded to call her out. She didn't seem to think there was an issue with her fishing a bug out of the drink let alone putting her dirty fingers in said drink. I said what if the Toronto Health department came in and seen her do that? She said it's just a fruit fly, I said, bugs carry bacteria  and diseases, clearly you have not taken your food handlers and or smart serve. So, I waited a day and I emailed the bar and got some BS response back, they also didn't seem too concerned this was my first time there and wouldn't be returning, I guess they don't seem to care about word of mouth.. If this sort of thing happens at the bar what goes on in the kitchen?? Here is their response:  

Hi Lori,

Thanks for your email we will chat with the staff member. To insure this does not happen again the drink should have been dumped and the fruit flies appear with the warm weather but they are easily killed when we bleach the counters daily.

Thanks,

The Dylan Team

Sent from my iPhone"}
{"text":"I finally made it to The Dylan last week and we loved it. Between the three of us we had a burger - sooooo good, poutine and I had steak with chimichurri. The only thing I wouldn't have again was my Moscow Mule but I am happy to stick to beer or wine and eat great food. I love that the Danforth is getting so many great new spots like this. It was just full enough, lots of buzz and energy and people clearly enjoying their food and drink. Will add to my regular rotation of Danforth restaurants."}
{"text":"Dropped in for dinner with 3 friends this week and had a great experience. In contrast with previous reviews (maybe they have worked out some of the kinks?) service was attentive and efficient - our server was on top of our drinks, checked in a few times to make sure things were OK, and food came quickly and was very tasty. Veggie burger with fries was really tasty; friends had the fried chicken burger and also said it was great.  An error on the bill was quickly and politely resolved. Great selection of beer on tap and in cans as well. Will definitely be back!"}
{"text":"I'm giving this 3 stars only because the food, when we finally got it, was pretty good. We went in during the Halloween weekend for a quick bite at the bar. Ordered the chicken sandwich with fries. Was told the fries would take a while and could they bring a replacement. Settled on the kale salad and the cauliflower fritters. Around 45 mins later, we still hadnt received a replacement and after complaining was offered a free drink. It was late and the last thing we needed was another drink so no thanks. After another 15 mins we complained yet again. Food finally arrived. We were so hungry at this point that we inhaled it, and asked for the bill to get the hell outta there. They only charged us 9 bucks. Which was pretty nice of them to take all of the food and most of the booze off. For that reason, and the fact that the food WAS pretty good, we will try it again. Hopefully better luck next time. I hate to see a local establishment go under only because they dont know what theyre doing."}
{"text":"You can tell they are trying to settle in as they are still fairly new and rusty. 
The servers are lovely, but the service overall is pretty slow. My friend ordered the Mac and cheese and was told it would take about 45 mins. And then after 45 minutes he was told they couldn't make it for whatever reason. 
Any other time I'd be pissed, but we were just having some drinks and watching the game, so it wasn't a big problem. 

I got the Dylan burger and it was quite good. And I loved the fries. 

Overall, good beer selection, decent food. A little sloppy and slow, which I hope will change next time I'm there."}
{"text":"So, they've been open a little while now so figured time to give it a try, well, maybe we'll try again....

Tonight the taps were out of service, apparently a cooling problem, not all bad though as they have a pretty decent selection of cans as well..all in the craft beer vein, and by looks of things mostly local, as in Ontario...

More of a bar atmosphere then restaurant which is fine as long as that's what you are expecting, little more emphasis on pub then gastro....

Good competition for Sauce which is just down the street, and this is becoming quite the little section of bars and restaurants, so if one is busy there will hopefully be space at the others...

Oh, and a pretty decent soundtrack"}
{"text":"We've tried this place twice, just to give it a chance but I think that we're done trying now. It's such a great spot, with so much potential, so it's a shame that it's just not worth it.
Service is super-friendly, but kind of partially non existent. Walking by the table smiling when there are empty glasses and plates isn't ideal. Want to make money? Ask if we want another drink! Table service 101.
Better communication between server and kitchen might be a good thing, as if there are any items on the menu that are \"out\" it would be better to know prior to mulling the menu over.
Veggie curry - lacking flavour. Mac n Cheese - really yummy. Cauliflower fritters - again, lacking any flavour - spicing or marinating the cauliflower before battering it would go a long way. Fried chicken sandwich - unappealing. It felt like I was eating leftover chunks of dark meat thrown onto a bun. 
It's pricey enough that it needs to be better than what it is. And it's such a shame that we likely won't be back, cause done right, this place would be killer!"}
{"text":"This is probably the worst bar on the danforth. A party of 6 (my group) had to wait 30 mins for our drinks. Not even. It took 30 mis to pour beer. And the still hadn't made the cocktails for our table. It was 1030 on a Fri night and it wasn't even that busy. We ordered food and it took twice as long and it was horrible. 
Will never come back. Don't come here unless you have lots of time and don't mind waiting, and waiting, and waiting."}
{"text":"Really nice little spot. They are just getting on their feet but the mac & cheese was really good, and the burger had a nice spice to it. Welcome addition to the neighborhood. Decor was open with high tables. Lots of screens but you can avoid them if you sit at the front. Picnic tables on the back for groups (no patio in back but a small area in front). It's very new, but I'll re visit after they properly open, seems quite promising. Owner came by to say hi and was super friendly."}
{"text":"As a Danforth resident I came here to support new business in the area. Unfortunately, we left after waiting for 15 minutes after repeatedly asking for service but getting none. We watched the server clean and put away glasses and what seemed to be the owner pacing up and down the restaurant ignoring patrons. 

As an ex server myself I can confidently say this restaurant showed no team work and failed to serve us and other patrons we spoke to on our way in.

I'd love to come back and try again but this experience has turned me off from coming back for a while."}
{"text":"Good little pub on the Danforth with decent beers, great music in the the background and a satisfying food selection. The service is friendly but a little inefficient. That's forgivable because at the same time you are never made to feel like you're being rushed out. This is the kind of bar you you can hang out for hours in and the staff will be cool about it. The food is decent and the vibe is very chill."}
{"text":"Gotta tell you, I love this place! 

Nice decor, loads of beers and drinks, great staff, love the food!"}
{"text":"Myself and two friends dropped into this bar after attempting to find a table for dinner and drinks at the wren and didn't want to wait it out. We had zero expectations and ended up having a lovely dinner, a nice bottle of wine and great service! My group was a bit rowdy and we gave the waiter a bit of a hard time but he handled it and humored us  with our very weird requests as two of us has severe food allergies. We will definitely be going back and making this our new neighborhood spot. Plus their kale salad with goat cheese and chicken is to die for! 

Again I visited the Dylan with a friend on a rainy Thursday night after a rough week at work and because of the great service from the wait staff to the amazing chef from T&T who specially made me gluten free jerk wings, this is now the only bar I'll visit on the danforth. It is quaint and has such s comfortable vibe. If you haven't walked into the Dylan yet, you should! Like right now!"}
