{"text":"Best gluten free pizza. Crust is crisp and toppings fresh. Salads are very large with premium homemade dressings. I've tried both italian & balsamic, delicious! Highly recommend"}
{"text":"OK, they started packaging the onion rings and fries in small cardboard boxes instead of plastic \"clamshells' and the rings and spuds make it home crispy and hot."}
{"text":"A fantastic spot for Italian takeout. They always have wonderful fresh salads... huge pasta portions and scrumptious sauces.  Very quick prep times... speedy delivery and kind service. A locally owned establishment that does things right. Would def recommend their specialty pastas and salads."}
{"text":"Love the Margarita pizza! Such magic in the simplicity. We have order the sandwiches, wings, hoagies and artichokes as well. All were good."}
{"text":"Ordered from here and couldn't be more pleased. Hot food, fast delivery, friendly service! I had \"The Hannah\" specialty pizza with zucchini as an appetizer. Delicious. Highly recommend."}
{"text":"I have had 2 sandwiches from here.  The insanely large and perfectly cooked fish sandwich during Lent.  Bread was fresh, fish was crispy, flaky, and mild. Tartar sauce was perfect, as I do not favor a sweeter sauce.  Then I ventured to tried the muffaletta.  And my world changed.  For starters, it's a $10 sandwich that is HUGE.  It's got ham, salami, swiss, provolone, hot peppers, and something I didn't expect to like: diced olives.  Somehow, the sandwich works, and it works well!  The caesar dressing ties it altogether. It's a bit messy and heavy, but it was worth it. I could only finish half, the other was eaten as a second meal.  I will definitely be ordering them again.  Oh, and try the garlic knots: soft, chewy, perfectly baked with cheese sprinkled on them.  Carbs? Why not."}
{"text":"I thought the pizza was ok, I have had better, but it was a really good deal in my opinion, sauce tasted bland and cheese was not melted enough. I will go back and try again at some point, next time i will get a sandwich"}
{"text":"We always order catering from here for work parties. The portions are great and really feed a lot of people. We love the pasta with vodka sauce and the chicken! The chicken is my personal favorite, never fatty and all chicken!! Very very good. Recommend. The garlic knots were good too! A little soggy because of how much sauce sits at the bottom, but very good still. Pizza didn't impress, won't order the pizza again. Will be ordering again though!"}
{"text":"We live so close to The Other Place, I feel guilty that we only order once or twice per month. Their pizza (and calzone) crust is top-notch and stands up pretty well to the heavy doses of toppings they load onto (or into) them. Their sandwiches, hoagies and pastas are also excellent, and they offer a wide variety of sides, soups and appetizers that allow us to branch out and try something new when we're in the mood. Our seven-year-old would live on a steady diet of TOP's giant meatballs and/or chicken fingers if we allowed it. In case you're starting to think this review is too one-sided ... 

With so many superior options on the menu, I don't really recommend the French fries. If you're ordering fries from The Other Place, you're probably missing out on something better (seriously, just read the menu). Also, the salads are always crisp and veggies fresh, but the house (Greek, maybe?) dressing is a little too oily for my taste. Luckily, we stock a variety of fine dressings at home anyway, so it's no big deal.

If you live in the delivery area, do not hesitate to look them up and enjoy their excellent fare! Even our pickiest eaters can find their favorites on TOP's expansive menu."}
{"text":"Just had the most amazing hot sausage sandwich at Scott Township's octoberfest prepared by The Other Place..... This will be our new go to place!"}
{"text":"This was our first experience with this quaint little pizza shop, and it will not be our last! Absolutely delicious!!!!!! Worth every penny spent and then some. You would think that in an area filled with pizza shops that there would be more good ones, but The Other Place is one of my new favorite places to get a pie and hoagie! Great job fellas! & Thank you for not letting us down!"}
{"text":"i can't believe we waited so long to try this place!  the lasagna trays (for a big family dinner) were in.cred.i.ble. - cheesy, saucy, comfort food and so much easier than cooking for 15 people. just preferred take out pizza and weren't disappointed.  can't wait to order again!"}
{"text":"The pizza was good, heavy on toppings and cheese but the hoagies here are the real winners. Crusty and delicious with fresh veggies on top, I believe they're served on Mancinis bread. What more could you ask for?"}
{"text":"I like The Other Place. It has a large menu with no healthy options but the hoagies and pizza are good.  I was also pleasantly surprised by the fettuccini alfredo. The staff seems to be a family and are pleasant. We usually pick up because they are nearby so I'm not sure about their delivery."}
{"text":"The Reserve at Southpointe had The Other Place cater their residents thanksgiving dinner. Everyone loved their food they did an outstanding job! Thank you very much for making our event a success!"}
{"text":"Resembling a fortress of red brick, The Other Place sits on a knob overlooking the suburban bustle of Greentree Road. Takeout and delivery are your only options as the interiors barely contain a counter, some stools, and a cash register, let alone a kitchen full of diligent, skilled cooks.  As Kay and I awaited an order to eat at home after a session with our chiropractor, I was in awe of these culinary craftsmen, watching them chop, fry, shuffle pizzas in and out of a foreboding, massive oven as if they were pucks, and quickly assemble salads, the flames and angry, spitting grease barely affecting their concentration. These were short order masters at work, and they made their tasks look to be instinctual. 

What we drove back to Beechview with were a colossus of bread called The Stallion and a flat box full of zucchini strips. 

Named after characters from the \"Rocky\" series of films, The Other Place's \"Knock 'Em Out Hoagies\" are all served on entire (!) loaves of Mancini's bread. When I saw them on the menu, I immediately felt challenged by the one made with Genoa salami, baked ham, pepperoni, provolone, hot peppers, black olives, lettuce, tomato, onion, and Italian dressing. 

\"Yo,\" it said to me with a New York accent bristling with belligerence. \"I bet you can't take me.\"

\"I beat bigger sandwiches than you,\" I snapped back.

\"Heh. I ain't no Battleship,\" it said with a casual disdain. 

\"You sure ain't,\" I replied eyeballing it up and down, setting off a chorus of \"ooohhhs.\"

From there, my living room turned into an arena, and soon the Stallion and I circling each other in a tomato-stained boxing ring. 

Round 1 saw me dominate the crowd favorite, crunching through the chewy, tough bread, and into the layers of spice, heat, oil, and tang, savory and sweet colliding like dueling rams. Densely packed with delicatessen meats, the grinder began to wear on my jaw muscles. I felt sore, swollen, like I'd taken too many jabs. 

\"He's runnin' outta gas,\" I heard a grizzled, old voice say after Round 3. 

I would regain my composure after seeing Kay with tears in her eyes upon the conclusion of Round 8 as I contemplated telling the referee \"No mas.\"

Someone sounding like Jim Lampley would exclaim \"This is a war!!!\" in Round 10 when I and The Stallion had to be separated after the bell sounded. My bodyshots were clearly beginning to pay dividends, frustrating the wily veteran. 

With 45 seconds left in the 12th and final round, I would connect with a beautiful haymaker worthy of a highlight reel, giving the referee ample time to count to 10, ensuring that a timekeeper would not save The Stallion from defeat. 

A Michael Buffer figure would appear and announce my win as Kay kissed my cheek.  I disregarded a shady Don King-like person who claimed he'd \"take me to the top\" as well as a typically long-winded Larry Merchant analogue who still refused to take me as a serious contender. 

We would celebrate victory with crispy, wafer-thin boards of consummately fried zucchini. Topped with slightly sharp parmesan crumbles, they were dunked in a tart marinara for maximum enjoyment. 

\"I've fought better. But not many.\" I told the defeated hero as we exchanged handshakes.  

\"Hey, you know, that's how it is, you know, in this game,\" my weary adversary said. \"Yo, meet my wife. Adrian, get ovah here.\" 

Ya wanna eat a REAL zep? Blow off that dorky Fogle kid and head over to that place on the hill. Y'know, The Other Place? 

And now a word from *ahem* The Stallion itself.

\"Yo, Richman. I keep seein' you on TV, you know, callin' out these sandwiches. When you gonna come down here and try me? What? You duckin' me?\""}
{"text":"Good for a NCAA basketball party after baseball practice.  Group just decided to get together at baseball practice to have some good pizza, wings, and a few other apps and watch some BB.  The pizza and wings were good and better than most in the area.  Have order from OP a few times and usually busy...pick up or delivery only.  The guy at the cash register can be really nice if he has a moment but sometimes comes across as a Mad Man Kramer... only short.  

OP does have other appetizers that are good.  Also, have salads and Hoagies/sandwiches that I am told are good but only have had apps., wings, and pizza."}
{"text":"Very good place! We got the spinach pizza, cheese ravioli, and a meatball. The meatball was definitely homemade and very good. It tasted just like a meatball should taste, to me. They did serve the ravioli with a ton of sauce, so make sure you have some good bread to sop it all up. The pizza was very good too, with a lot of cheese on it. I'm looking forward to trying other items on the menu."}
{"text":"My husband and I order food from this shop very often. The food is always very taste and the portions are huge. Our favorites are the steak hoagie, and the chicken fingers."}
