{"text":"Really wanted to like this place but it's been a bit of a disappointment for me..
-really want to try the deerioca (their house made tapioca) but they only serve it on Saturdays and Fridays at a certain time, also sell out really quickly because of this 
-they take a really long time to make your drink (think 10-15 minutes)
-something always makes me sick from their drinks (yet I keep going back)
-customer service quality is hit or miss 

That being said the atmosphere is great for this place, and I do keep coming back to try that one magical drink I hope to find soon... Their garden milk tea is so adorable and really tasty! Keep hoping that one day I'll catch some deerioca too."}
{"text":"The alley is amazing. The royal number 9 milk tea which is subtly infused with blueberry completely changes the traditional milk tea bubble tea formula. It's tasty, it's unique, and it's very difficult to go back to other bubble tea places after the Alley. The only knock against the Alley is that service is quite slow, but it's totally worth it."}
{"text":"Great Drinks, new flavours and sweetness were just right. I am normally a passion fruit tea drinker. I have tried milk tea from other places, but alway went back to the passion fruit tea. 

Thanks to da The Alley, I now have two  favourite tea."}
{"text":"This place is overrated.  I wouldn't go back, especially with Chatime next door, for the following reasons.

1) Expensive (how does a regular drink cost more than $6?!)
2) Deerioca (I'm not a fan of the texture and I don't understand the hype)
3) Names of the drinks (they are not descriptive at all, which leads to my next point)
4) Long wait (probably because no one knows what the drinks are so the cashier needs to explain everything to everyone)"}
{"text":"Mixed feelings. Depending on who makes the bubble tea it tastes different each time. I love the Royal no. 9 bubble tea. Sometimes the bubble tea is too watered down or too much milk in it  and you can't even taste the tea in it. They provide very little toppings in there considering it is an extra cost on top of the bubble tea itself. The bubble tea is pricier than other bubble tea places. It's okay. Depending how much you're willing to spend on bubble tea, this may be a place to try. It's around 5-6$ a drink. As well, it takes really long to get your drink, after you order you'll have to wait atleast five minutes If they're busy."}
{"text":"I was beginning to like this place but the taste of the drinks are inconsistent depending on who makes it. I ordered the same drink 2 days in a row and it tastes like water today. Also service is super SLOW."}
{"text":"Had the polka deer which was apparently only available on fridays (?) and saturday. It was basically sesame tapioca balls with green tea milk tea. The sesame tapioca balls were not chewy and obviously did not have the same texture as their usual tapioca; they tasted like chinese glutinous rice dumplings. The tea lacked tea flavour and the overall combination was just in summary a little weird. Paid $6.50 for this drink and I would definitely not order this again. 

My friend had the dark night that tasted basically like a whole cup of grass jelly, which is great if you like the flavour but if you don't enjoy that I highly discourage you from ordering that drink. 

Went around 12am on a Saturday evening and the line went out the door. Given the choice I would still recommend going to Chatime next door. It's cheaper, more consistent, has more efficient service and the flavours meld better."}
{"text":"I was here last Friday night and there was a bit of a wait (around 20 minutes). I got to try the Garden Milk Tea and The Alley Trio Milk Tea. Both were good but not particularly great. I was excited to try their tapioca made from scratch but it didn't taste much different from regular tapioca. I think my expectations were too high. I would say the bubble tea is on par with Coco and Chatime, though!"}
{"text":"Been here a few times and always get the Royal No. 9 less ice and less sugar. 
Servers are always really nice and smiling which is nice. 
Atmosphere is nice but there is limited seating."}
{"text":"Pretty bad ass milk tea, especially if you really care about the tea side of the equation. Give the Royal No.9 a shot, it's a tea mixed with blueberry, and absolutely amazing. The only bad (?) thing is it takes longer for your tea to be ready compared to most other bubble tea places. It's worth waiting for though, given the quality."}
{"text":"I've only had their Royal No. 9 and it's amazing. You honestly can't go wrong with it. And their tapioca is that perfect level of chewi-ness that I like."}
{"text":"Been here 3 times to order the same drink...all 3 times different taste. Need to
really improve on consistency of product"}
{"text":"I've been here for several times and I really like their tapioca. It's very chewy. 
I tried royal no.9, in love with lemonway and northern lights, etc., but my fav is Apple of my eyes, I think it's taste very \"summer\". 
Mm I also have to say...I don't like the royal no.9. It tasted not special at all and too less tea flavor......"}
{"text":"I tried two of their bubble teas. First was The Alley Trio Milk Tea without and with sugar and the second one was the Royal #9 without and with sugar. The difference between with sugar and without sugar was enormous- I think they use too much sugar in their drinks. Normally, without sugar is good enough for me but their tea base did not have flavour and felt watered down (I did not get ice either). I had a sample of their Iron Goddess and it was so sweet. I am all for sweet but it was too much in my opinion. 

The service was great. The store itself was okay. It was a very tight space and literary had four or five small tables.

I still would prefer chatime and coco tea over this."}
{"text":"first time, went there and tried their flower pot tea or whatever its called, nope, not worth it!
second time, went there and tried their iron godness tea, nope, still not worth it...
There won't be a third time.

Edit:
I need to clarify that i prefer tea that's creamier. Hence, 2 star."}
{"text":"Got the alley trio milk tea here with a friend. Cashier was super friendly and was able to even recommend sugar levels based on what my experience at other places was. Definitely knows their bubble tea inside out. Wasn't a huge fan of the tapoica, which was a bit on the hard end (then again, I always find tapoica to be hit and miss even at the same places). The tea tasted great, more natural than the sugary stuff at other places. Seating was spotty, and with the door right there it got cold at times. Also a bit pricier than other places (my drink was 5.50 for regular size). 
Would come back again if they increased the seating or lowered prices."}
{"text":"would be really more like 3.5 stars. didn't try any of the gimmicky stuff. tried the bubble milk, the green milk tea and the iron goddess milk tea. 

the green milk tea was pretty good. bubble texture soft and chewy throughout but not overly so. the plain bubble milk was fine/good and the iron goddess was ok. but at their slightly higher prices, i don't know if I'd really recommend anything but the green milk tea."}
{"text":"By far the best bubble tea I've ever had. The tapioca is really on point here, and the flavors are pretty unique. Definitely worth a try!"}
{"text":"Honestly nothing special. I got the Garden Milk Tea. Aside from the novelty of it being decorated to look like a pot of dirt, it's really just milk tea topped with a bit of whipped cream and Oreo crumbs. The milk tea itself is nothing special and I don't understand the hype over their handmade tapioca. At $5.65 for a small, average tasting milk tea, I personally have no inclination to pick this place over the other 4 bubble tea places in this plaza."}
{"text":"Originally, I wanted try one of the \"favorites\" drinks but noticed instead ordered the Penguin on Ice. Yes, I'm a sucker for clever names & nice packaging. I love that more and more bubble tea stores have customization now. I got it with 30% sugar and less ice, and it was perfect. The only complaint I have with this drink is that you REALLY have to mix it well. Because the milk sits on the button of the cup, if it's not mixed well, it can taste really milky or really bland depending on where your straw sits. 

Bonus points for the hipster like decor. They have a nice black back drop on one wall and a nice brick wall on the other. Many photo ops. 

Even though I love my chatime, I would come back to try other drinks."}
{"text":"They were out of deerioca so I settled for jasmine milk tea with tapioca.  This was no different than any other bbl tea place.  It was just meh"}
{"text":"Delicious tea and original concept, but terrible seating, and a really slow line to boost.  Definitely a take-out kind of place, but I love how the smell of tea is strong and hits you when you walk in. Would come back to try their Deerioca, the homemade tapioca, which they sadly only have on weekends."}
{"text":"Had the Royal No. 9 which I found sweet at half sugar and has a strong berry taste?? They take quite long to make your drink but I do see it is do to their attention to detail to using exact measurements in making each drink and preparing the tea. Tapioca is quite good. Price I think is a bit more expensive than other bbt chains for similar offerings"}
{"text":"Love the drinks and atmosphere here.  It's a cute little place with wonderful drinks.  I usually have to customize my drinks (sugar level etc) but I found that it wasn't necessary here although they do have the option if you wanted to.  I like the unique choices such as guava lime juice.  I had their signature Royal No ( milk tea and it tasted wonderful.  My friends had the guava lime juice and the Garden Milk tea.  They all liked it and will be our go-to place in the future.  

The atmosphere and decor here is very nice.  Only downside is that there are very few tables, not enough space for a large group but that just means there is potential for expansion in the future."}
{"text":"Social media got me interested in this place so I finally went tonight to check it out. The decor/branding of this cafe is definitely spot on and is just what the bubble tea \"scene\" in GTA needs. There was a line when we went in and we waited about 10 minutes to place our orders. The lady at the cashier offered tea samples of the Iron Goddess milk tea to us just like other reviews have stated. 

I ordered the Iron Goddess milk tea with tapioca in the end, and my group ordered the Royal No.9 milk tea and the cocoa milk tea. Our consensus is that we've had similar if not even better bubble teas elsewhere, and for us personally, is not worth the drive all the way from Scarborough. I know they are most famous for their lovely colourful drinks so this review may be slightly biased as we did not try those. It is true that those drinks ($7.50 each) were handmade to order and the designated person making those drinks put a lot of time and effort in them, so I may change my opinions after trying them."}
{"text":"I went to The Alley during the day on a weekday. The line seems to have died down a bit, and there are more staff members making the drinks in the back. I originally came here about two weeks ago, and the line was out the door and not moving. This time, luckily there wasn't a line when we went! 

I got the Penguin on Ice, and my friend got the Garden Milk tea (the one that looks like a plant). The staff explained that the Penguin on Ice is like milk tea with liquid form of grass jelly. I would say that the Penguin on Ice tastes lighter/ less creamier than other bubble teas I've had - not sure if this is because of the drink that I've ordered, or their milk tea is indeed on the lighter side. I actually enjoyed the lighter taste, as it was more refreshing and not as heavy, but that's my personal preference. 
 

They also let you sample the Royal No. 9 milk tea, which has a blueberry flavour. I think I would try that next time!"}
{"text":"The drink looked great!
The taste was nice!
But 
The service was awful. When I was ordering, the servers was chatting with colleagues didn't pay attention at all. My order was two kinds of beautiful drinks, one is this 'Northern light' the other is 'Morning dawn'. The server just ordered two northern light for me and fail to notice me while I was ordering. 
I saw the brand with Chinese name on it. I'm gonna say, our Chinese people never serve costumes like that. If that cool jean jacket girl doing such a thing in China, she will be FIRED, definitely!"}
{"text":"I think this place is quite overhyped. I had their signature bubble tea and it was okay. I can only give this 3 stars because the tapioca was tough to chew and I don't think this place is worth it for its price. The worker was kind enough to explain what makes their original bubble tea so special but it really isn't all that special. It's just loose leaf tea with blueberry flavour."}
{"text":"After hearing soooo much about The Alley, I finally decided to try it on a rainy Sunday afternoon. To my great surprise, there was no line up and my order was taken the second I walked in. I selected the Deerioca and my partner ordered the Lemonway. The drinks were made fairly quickly and we walked out within five minutes. 

Upon trying the drinks, we were pleasantly surprised by the quality. The Deerioca tastes great at first but once the caramel is mixed into the drink, you are literally drinking plain soy milk. It needs another layer of flavour--some steeped tea would've been a great addition. 

Now for the bad. The Lemonway drink, despite being delicious had a fruit sticker inside the cup. The drink has a generous amount of lime peel mixed in, which I assume is where the sticker came from. This means: 
A. The limes were not washed prior to being zested
B. The employees don't care enough to remove the sticker from the limes they're using

Sadly, I won't be returning to this location due the obvious negligence."}
{"text":"Came in with a group of four guys. It's probably my 5th time here since its grand opening. Although the service has always been on point, the speed it takes them to ship out drinks is still terrible. The fact that it takes them 3-4 minutes to make a drink is the reason why they have a line out the door every visit. The drinks themselves aren't bad, but they really need to either find a better way to do make themselves more efficient or hire more staff."}
{"text":"One of the best bubble tea I have tried so far! Strong natural tea flavor and they have excellent services by letting you try their tea! Too bad I missed their handcrafted tapioca (deerioca), it's only available Friday and Saturday!"}
{"text":"The Alley is one of my favourite BBTs in Toronto GTA. Their drink menus are definitely more unique than the other places. Everyone needs to try the penguin on the ice, it's my favourite one :) the HWY7 Leslie location is really packed especially on weekend nights, definitely can expect the line to hit the door and out. I've been here during day time during the week and it was a lot more quiet and nice to chill."}
{"text":"The Royal No. 9 Milk Tea tastes like blueberry and has a bit too much cream. Not too memorable. Would like to try the more colorful drinks next."}
{"text":"Such a nice modern bbt place!! I came here after seeing it on instagram (being the food junkie i am) and i wanted to try this place out because it just opened. This place isn't just a regular bbt place. It has handmade tapioca, some really unique flavours and the store gives off a really nice vibe. The workers were all really kind and they gave out samples of the Royal No.9 Milk Tea (their #1 recommendation) and it was really good! It has a slight blueberry taste. Compared to Chatime.. What i really like is that the bbt's aren't overwhelmingly sweet (at Chatime i would always get half sugar.. And even then i still thought it was a little too sweet) I got the regular No.9 Milk Tea and i really loved it! My boyfriend also really liked it! Highly recommend this place!!"}
{"text":"The Alley is what I like to call, my diamond in the rough.

My unwavering heart will always be with Chatime, but I'm really glad I gave The Alley a chance!  On first entrance, I got a really hipster, though welcoming vibe from the place. It's not your standard bubble tea place, but I really do appreciate their passion on tea.

The staff are VERY friendly and incredibly knowledgeable, which is always a huge plus in my books! One of the workers gave me a run through of the many drinks they offer (seeing as how dazed i must've looked) and I settled for Royal No.9 tea after having a mindblowing sample of it! It was love at first sip. It's a little hard to describe it's flavour in words, but like everyone had seemed to agree on, it's a fruity, refreshing tea taste with that hint of blueberry at the end. Now that example might not be the greatest, but believe me, it's a great taste! Personally for me, I enjoy it because it's a drink that takes you through different ranges of flavours, until you hit that high note with the blueberry at the end. Like I said, Royal No.9 tea is not an easy one to describe.

Here's my only irk about the place. Even though I will order my drinks with less ice (as i do at every bubble tea shop), it will always taste watered down by the time I'm half way done. It's something that I can't seem to put a finger on. So unless you are able to inhale your drink in record time, it seems that other reviewers have agreed that you will get a watered down taste. Maybe the next time I drop by I will try for no ice and update my recent findings?

Regardless, I'm a fan of this place, and whenever I'm in the Markham area, I will actually go to The Alley instead of Chatime. I'm rarely ever close to The Alley, so I'll be sticking with my Royal No.9 milk tea for a while. Though, when I do happen to try their other flavours, I'll be sure to update my review!"}
{"text":"Happy Chinese New Year everyone! It's time for tea at The Alley in Commerce Gate Plaza, Richmond Hill! The Alley is proof that not all bubble teas are created equal. While I waited patiently in line, I perused their menu and all the different drink variations available. I ordered their signature drink \"Deerioca Matcha\" and \"Deerioca Fever\" (hold the Bambi please ). The combination of cold fresh milk, mixed with quality tea, and warm tapioca syrup will leave you smiling after each sip. Their tapioca is made from scratch and is slow cooked in brown sugar for two hours creating a sweet tapioca syrup that is incorporated in each drink (it's optional but I highly recommend it). What I liked most is that each ingredient is carefully weighed to ensure consistency in quality. You also have the option of customizing your drink with less, more, or regular sugar, and the same option applies for the ice. The drinks are shaken - not stirred, and the ice is always strained so that your drink doesn't get watered down unlike other tea shops. The server was knowledgeable, friendly, and took the time to explain the different teas to me. The next time you have a bubble tea craving, I definitely recommend stopping by The Alley for a true drink experience. Luckily for us, there are now multiple locations across the GTA to get your bubble tea fix on!"}
{"text":"I've been here a few times and their Royal No.9 Milk Tea is great. Compared to all the other bubble tea stores, The Alleys milk tea has a very distinctive taste. It tastes.. strong in tea flavour? 

What I didn't like about them compared to Chatime/Coco is that their tapioca was quite hard. It's still good, but i'd definitely prefer softer. It could just be a bad batch as well.

I also tried the Northern Lights. The beautiful drink that everybody always posts. Although beautiful, it doesn't taste good in my opinion. If you know what Haw Flakes are, this drink tastes EXACTLY like it. Not something I'd want to drink. 

The store is quite small, they have maybe 10 or less seats. Like any other bubble tea place, it's mostly just a grab and go."}
{"text":"Couldn't find the store first time we went. The second time, we got one of their special milk teas. The taste was just okay, couldn't really taste the difference between their Royal No 9 or any other bubble tea place."}
{"text":"The drink names are unique, the place has a modern vibe to it.  The price pretty much the same as other bubble tea shops but the drink wasn't any better or worst.  The reason why I give this place only 2 stars is because they advertise that they make their own tapioca but fail to tell you they only have them on Fridays and Saturdays after 8pm.  I went there on a Sunday.  I was so looking forward to trying this place as I am a bubble tea addict.  It was very disappointing.  If you are going to open up a bubble tea shop and compete with other bubble tea shops then be consistent and advertise correctly."}
{"text":"This is a much smaller unit compared to other bubble tea places in the same plaza and is only good for take-out at best.  The few 'tables' in the unit is practically unusable because everyone is always waiting and crowded around the table area.  For a take-out bubble tea, their prices are slightly higher due to their use of tea leaves and handcrafted tapioca.  

Does it taste better? Yes.
Does it taste a dollar more and a 40 minute wait? No. 

I can see that this is a good place if I can bring my books or laptop to sit for an afternoon, but at this price and with the hype I will be staying away for a while."}
{"text":"Heard about the alley from \"word-of-mouth\" and I was surprised I've passed by it so many times without realizing it.. I mean it's in a petite shop, so that's probably why. 

Anyways, I've been here a number of times and each time the staff have been very nice and helpful! This last Tuesday was my most memorable experience. I was around the area and had this insatiable craving for bbt, so I had to stop by. It was close to 10 and there were only two workers and it was relatively busy. I ordered a total of 5 drinks (yes I know, an a-hole move but the craving was real) for my friends and I. 

So as my friend and I were waiting for our drinks by the side, we see the bbt barista(?) take a look at our drinks in queue and she let's out this animated tired sigh and drops her head back lol. I felt bad at that point bc it was pretty much 4 different kinds of drinks she had to make and plenty more drinks after that.. 

When we got our drinks, she asked us if we wanted a tray to which we answered yes. The tray, to say the least was pretty much falling apart even before we lifted it, but I didn't have it in my heart to bother her for another one LOLL. Let's just say, we managed to make it home with everything intact. 

I didn't catch her name, but shout out to the girl that night who made my drinks and I'm SO sorry for bombarding you with 5 drinks! 

Anyways, you guys should def check out the alley. Definitely one of my fav spots to satisfy my bbt craving."}
{"text":"Great BABY spot. Drinks are good and everything else also. 

BBT: 5/5 Yummy. 
Service: 5/5 Fast and friendly.
Environment: 5/5 Modern and dim.
Washrooms: N/A
Worth it?: 5/5 Great BBT priced well.

Wow, this place is on point. The drinks are good the venue is clean and modern. The service is super fast and friendly. Perfect for grab and go BABY or even seating in. 

On the top of my list for grab and go BABY now! Just like so many other reviewers, I recommend the Royal No.9. I will definitely be back."}
{"text":"First time I had a sip of the royal milk tea. It was so good. I loved the blueberry aftertaste. Second time I got it it was very bland. A little disappointed. I thought maybe it was just an off day. Had it a third time just now, even worse than the second time. Absolutely no taste at all. Such a disappointment and waste of money. I didn't pay for tapioca in water okay. Went to coco to get another drink. Not going to come back here."}
{"text":"Handcrafted tapioca, yummy milk teas and cozy, rustic vibes! What more can I ask for? 

They are known for their deerioca (handcrafted flavoured tapioca), it's only available on Fridays and Saturdays after 8! 
They're while quanitites last, however.
Expect them to be SOLD OUT usually by 10:30.
I've tried - twice. :(

Their drinks are different - it's something to appreciate, when bubble tea is it's own food group to you, but you're sick of the same milk teas.
 
The Royal No.9 is a fan favorite, and I can see why. It's a mix of comforting familiarity, and surprising sweet notes of blueberry. 
It's nice that the flavors are infused in the tea leaves, rather than an additive from syrups and powders.  

Notable mentions:
Guave Lime Juice - with real lime zest
Kiwi Slush - made with real kiwi!

A tad overhyped, but the Alley is worth checking out! 
Their customer service has been consistently amazing! And the quality of their drinks have kept up. Located in a plaza with 2 other bbt joints, The Alley definitely stands out.

*If you go on a weekend night, expect to wait 20 minutes."}
{"text":"I have low expectations for places which are really hyped up and all over social media in general. The employee was really patient to explain what the actual contents are for the drinks apart from just \"garden\" or \"no 9\" or \"northern lights\". I ordered the garden one with half sugar and less ice. It was really bland and tasted diluted. There was nothing much special to it. The oreo bits were kind of extra and drove away from the traditional bbt experience. I could kind of taste the blueberry in no 9 but again, just extra and didn't compliment that well anyways. Also didn't get enough tea flavour. Tapioca was fine but nothing extraordinary."}
{"text":"The Alley is in the middle of the bubble tea madness within Commerce Gate. In my opinion, it is ok.

In general, the tea shop itself is pretty small as there are 4 tables to sit at. When I visited for the first time, they offered me a taste sample of their #1 drink, the Royal No. 9 milk tea. I did not really like the blueberry infused flavour so I opted to order the Garden Milk Tea as a friend recommended it to me. Both the prices are a tad bit more expensive and the waiting time to get your drink is definitely longer than other bubble tea places. They gave me a stamp card which represents their loyalty program.

After waiting for a bit both times, I acquired my Garden milk tea. I love the concept of this drink in particular since they use crushed cookies. However, I thought the milk tea itself was a bit watered down and lacks flavour. 

If I'm sick of Coco or Chatime the next time I visit Commerce Gate, the Alley is the third alternative that I will think of."}
{"text":"I found about this place on Facebook and what caught my attention was the handmade deerioca, but embarrassingly enough I still haven't tried it yet.  They don't offer it everyday and when they do make a fresh batch they usually sell out very quickly. Anyways, the alley has become one of my favourite bubble tea places to go to. The place is quite small, so I wouldn't recommend going with large groups if you wanted a place to sit and chat. But it's a perfect grab and go bbt place. Every time I go, one of the workers offer a sample. It's usually the royal no.9 milk tea, which happens to be favourite drink from their list. It has a subtle blueberry flavour to it, and I thoroughly enjoy it every time I get it. I've also tried the \"galaxy\" looking drink called the northern lights. The drink is definitely aesthetically pleasing, but the taste is average. And the bottle was mostly filled with ice. They also have other unique drinks offered that I've never seen at other bbt places, will definitely go back to try them when I'm in the area!"}
{"text":"I visited tonight for some bbt. I ordered the Royal 9 Milk tea. It was good! I liked it because it had a subtle floral taste to it, which made it unique and interesting. 

The only downside is that it's a small space, it got crowded easily, but luckily we got our drinks to go.

Would definitely recommend this place and would definitely be coming back for more!"}
{"text":"2.5 stars really. Regular bubble tea place.  Nothing stands out.  The person serving us was great, and the workers seem hard working.  

Need to highlight that their 'Fresh milk tea' is milk powder, not actually fresh milk.  Not sure if the powder is fresh or not but to me that's not fresh milk.

Tried the Oreo slushi - was good but it they left large chucks of ice in there

Alley Trio - tapioca was a bit hard, milk tea did not stand out

Royal No. 9 Milk Tea - blueberry flavour tea was the stand out of the 3.  The tea was good but nothing that would make me crave it later.

Didn't get to try the deerioca.  It is only available at 8pm Friday and Saturday.  Waiting in line at only 2 particular times a week feels less special and more like a chore, especially if the drinks don't stand out.

If I return it would only be for the deerioca."}
{"text":"Located in Commerce Gate (right across from Korean Grill House). Plenty of parking available. 

I love their decor inside, a cozy Western style setup that specializes in serving Taiwanese bubble tea drinks. The place however is very small with limited seating, so best idea would be to buy and go. 

Staff are also nice and friendly, so don't be afraid to ask for recommendations and what's popular. 

What I like about drinking bubble tea is that there's always a variety to choose from and each place has their own signature drink. For this place, they have the Alley Trio Milk Tea and a Royal No 9 Milk Tea. I tried both and they have a consistent milk tea taste to it. It's not overwhelming strong, but I feel it's a little watery even when I selected with less ice. I also choose less sugar, so not sure if it will give a refreshing sweet taste if it's at regular level. But I really like their tapioca and royal jelly. 

I would come back again to try their specialized Northern Lights and Morning Dawn drinks, which seems to be a colorful layer drink served cold."}
{"text":"Colour me surprised! Didn't expect the bubble tea here to be this good! The Royal No. 9 was recommended to me. They even let me have a sniff of the tea leaves used for it. After a sip, I can see why it's so highly recommended. The tea was really high quality and had a really nice blueberry aftertaste to it. I'll probably try it with 30% sugar next time (I got 50%), in order to try and get more tea taste in my drink.

The only thing that I have a gripe with is the price. It cost $6 for the bubble tea, which is quite pricey compared to other bubble tea shops that I've been to. Regardless, I'd come back because the Royal No. 9 was damn good."}
{"text":"Don't get the \"Dark Knight\". First of all, this flavour shouldn't exist because it both looks and tastes like medicine. Secondly, I got it in less sugar and it's still very sweet. Overall, the decor was good but go somewhere else for the bubbletea. This place is not worth its hype or the money..."}
{"text":"I came here with a friend couple of days ago, and I was  really impressed by their rustic decor.  The slightly rough wood finished looks kind of like inside a forest but more comfortable.  I tried their Royal no. 9 milk tea by a customer's recommendation.  And the server was super nice to explain different flavours to my friend who came here with me.

After I ordered, I was kind of concerned about the sugar level since I don't like my drink being overly sweet.  I was presently surprised that the sugar level was more like medium low.  And I loved the slight note of blueberry at the background of the milk tea.  It made the flavour a lot more interesting. Definitely like this place a lot."}
{"text":"--- My First Impression ---

I saw tons of instagram pictures about this new bubble tea store at Commerce Gate and decided to give it a try. The store is very dark in general, looks pretty modern. There were not a lot of tables and chairs in the store. The store was very clean and tidy. 

--- Food and Drink ---

Since this was my first time here, I asked the cashier for advice. She gave a sample of the Royal No.9 milk tea for me to try and it tasted very good. It had a very strong tea scent which was not bitter at all. However, when I saw their menu, there was one drink name that caught my eye and I could not find a reason not to order it. 

The drink I ordered was \"the apple of my eye\". It was supposed to be an apple cider drink with some aloe pieces in it. (I requested for tapioca in the drink as well). The drink itself looked very romantic as well. However, I found the apple cider vinegar tasted too strong and overpowered the drink. I would rather have a stronger apple taste than vinegar taste. Towards the bottom of the drink, there was a strong bitter taste. I liked how they used crushed ice intead of ice cubes. However, I won't order this drink again because the flavor combination is weird. 

-- Overall --

I gave 2/5 for the drink and 1 star extra for the service + the decor. I think I will give them a second chance though because the Royal No.9 sample tasted really good. I hope my drink will taste better next time!"}
{"text":"Unique and comfortable feel inside the small bubbletea shop. The baristas are super friendly but the wait for my drink after ordering was a bit longer than expected (likely that they were waiting for a new batch of tapioca). 

Pricing wise, it's a bit more pricey compared to other bbt places. A regular with no topping was $5-5.50 depending on the drink.

I tried the Royal No.9 milk tea and it was quite refreshing! It's your normal milk tea with a strong aftertaste of blueberries...which was super unique!

Definitely will be back to try their deerioca and their sweet dew oolong."}
{"text":"Overall - 3.0/5.0

Another Taiwanese Bubble Tea franchise has made its way to Commerce Court. Decor is rustic and cozy with a narrow layout mimicking an alleyway. 

Had their Royal No. 9 Milk Tea to see where they stand compared to other places. This one had a nice fragrant blueberry flavour but was on the sweet side (ordered with little sugar) - but that's just me as I am in favour of stronger black tea aroma (which was on the lighter side with this drink).

The Apple Of My Eye resembled a refreshing Apple Cider drink with chunks of aloe vera. I would prefer it to be less sweet as well but this one had a fixed sugar content so there was no choice.

Service was very nice and right now they are having 10% off until May 13th as part of their soft opening promotion.

This place has potential but will need to see how they differentiate themselves from the other places in the plaza (there are a total of 5) in order for them to be successful."}
{"text":"Cool small place, I was in the area one night and saw the craziest line! I decided to come back during the day and I got the royal no. 9 and the garden milk tea.

Royal no. 9 was just okay... I like chatime's roasted milk tea better, I read a lot of reviews and I agree the hint of blueberry is unique but it isn't all of that compared to the garden milk tea. 

I really appreciated the work that went into the garden milk tea and TAPIOCA is included in the price. It has the tea, this unique whipped cream then lots of oreo bits. I never had bubble tea that was so crunchy and interesting. On the other hand after a few sips I was bored of royal no. 9.

I was super disappointed to find out the special handmade \"deerioca\" is only available after a certain time on Friday & Saturday night in limited quantities."}
{"text":"Got word that this was a new hip bbt franchise, definitely wanted to check it out.
I wasn't too sure on what to get, name of some of the drinks were too .... exotic (ie. Apple of My Eye bbt... haha not really sure what this is)

I ordered one of the top 6 \"The Alley's recommended drinks\" - Garden Milk Tea.  Esthetically, the presentation of the drink looked unique, please see below image, however, the taste plainly speaking.. was oreo crumbs and milk tea.  Nothing too special... was disappointed actually. Maybe I have chosen a bad drink, then again it was one of their recommended top 6.

 Maybe I'll give it another shot."}
{"text":"Came a while back, but everything should still be the same. Got the Royal No. 9 Milk tea with tapioca. Pretty good...they gave me a sample of it as I was waiting LOL. Nice preview of what's to come I guess. Tasted really good for someone who is used to the regular Chatime, Tea Shop 168 stuff :D. But lines for pretty quickly and service isn't the fastest. If your'e willing to fork over the extra dollar or two for a seemingly more premium bubble tea, you should like this place."}
{"text":"I've come twice but both times their homemade tapioca batch was sold out. I like the Penguin on Ice drink because I like grass jelly and the tea tastes very similar to it (or so one of the staff explained to me). I've also tried their Assam Fresh Milk tea which is fine, but tastes a lot like tea you might get at dimsum. That doesn't mean it taste bad, though, just that it wasn't anything special in my opinion.

The staff are usually friendly if you try to talk to them. The girl on the cash is especially friendly and bubbly, not to mention patient! She answers any inquiries customers may have about the drinks, which can take a considerable amount of time since their menu isn't descriptive about the taste or components of the listed drinks. Although it's great that the person on cash is very patient, it makes the service EXTREMELY inefficient, resulting in the humongous lines stretching around commerce gate. I think they should either post a more descriptive menu or have staff going to the people lining up and answering questions they have before they order.

The space is quite small so it's not good for groups. The decor is nice so if you happen to come when it's quiet, it could be comfortable to sit and unwind with a drink."}
{"text":"Came here with a friend to try out the 'super good new bubble tea place'. Parking was a bit tricky but we managed.

While we were in line, the cashier let us try a sample of some of the milk teas because I had absolutely no idea what I wanted to order.

I ended up getting the Iron Goddess drink. Good drink, decent bubble tea but hella expensive. It came out to like $6 after tax. I like bubble tea as much as the next person but I don't want to spend $6 on average milk tea.

Interior was nice and looked real pretty but too much $$$ for bubble tea."}
{"text":"The first time I came, they ran out of tapioca. :( The second time I came, I finally tried their #1) Royal milk with tapioca but after all the hype, I didn't find it extraordinary. The price is a little steep too. It was $5.50 plus tax for their small (regular) size."}
{"text":"Haven't tried such a smooth milk tea since bubble tea became popular. I have tried 8 different flavours here and found the milk tea to be my favourites. I found their sweet dew oolong a tad bitter and the lomonway was a tad too sour. If you want a good milk tea with an actual tea taste then this place is great. This bubble tea place does not serve slush but only tea based drinks. I personally am picky with tapioca overall however this location managed to win my heart for their handcrafted tapioca balls that are freshly made the day of. I work a block away and am aiming to try out all their flavours eventually."}
{"text":"Favourite BBT place ever! It's a little on the slow side though, but I'm always coming back because the BBT is that good."}
{"text":"Was in the area for dinner, so I figured I would check out the newest bubble tea joint in the plaza. 

As the other reviews may have mentioned, the design and decor inside was very cool. Not sure how I would explain it exactly, but it kinda reminds me of what a cottage would look like if it was dimly lit and was crazy narrow! But along those lines, the establishment itself was hopelessly small. There are 3 tables, but it doesn't really give you the vibe of 'sit down and enjoy'. Very crowded especially when people start coming in and lining up. 

Despite that, the drinks were a little unique, but about the same as any other you could get in the plaza to me. I wouldn't particularly say it was anything special that I would absolutely have to go back for, but I'm not really an avid bubble tea connoisseur, so take it for a grain of salt. Did try their promotion of 2 drinks for $8.85 (before tax), which is decent but comes to $10.00 after tax, so you're really not saving 'that' much. Got the Alley Trio Milk Tea and the Sweet Dew Oolong. Both were just okay.

Service was quite good though, as they gave us samples when we entered, and actually gave us our drinks at the table. With more than enough staff, they definitely had the service bit down. 

Not somewhere I would be crazy about having to go back, but nice to have another choice when I'm there. Quite a bit of competition when there are like 3-4 places to choose from."}
{"text":"I am definitely on the fence. I'm die-hard chatime. But this place definitely has great tapioca. But I find their drinks overly sweet even though I asked for less sugar. Being not a fan of tapioca in the first place, maybe that's why this place didn't appeal to me. Maybe if they come up with a grass jelly drink, I may be won over. I'm sure someone who loves super chewy tapioca balls will love this place!

The place is super small barely with any standing room. But the service was great."}
{"text":"After a second try at the Alley, we decided that it was our last try.   

After a long but somewhat understandable summer line up, we ordered  Royal no. 9 and an oreo devil slush. 

The royal no.  9 was not cold enough as they didn't take enough time to shake the drink and it was very watered down.   There was hardly any tea flavor and none of that special blueberry notes compared to our first try.   I think the newer staff along with the long line up contributed to a less tasty experience. 

The Oreo devil slush tasted of chocolate powder and ice, no cream.   It was layered oddly with Oreo crumbs in the middle and the top which made for a lumpy consistency.  

We didn't know which drink tasted worse, but it was a close tie.   

Due to the inconsistent bubble teas we received from our first (and less busy) visit, we will not be back for more expensive and less tasty bubble tea.   Hopefully they'll find a way to be more consistent with their drinks.  

2.5 stars"}
{"text":"As much as I love BBT,  I can't see myself waiting in line everytime for an hour on weekends.  Don't get me wrong.  I do believe that their drinks are a lot better than chatimes  especially their number 9 royal milk tea.  It's delicious.  Wait time is a little overwhelming though.  I have been here maybe close to 6 times, have yet to try their hand made deerocias.  Will recommend trying!"}
{"text":"Their royal milk tea is a MUST TRY. The aftertaste is to die forrrrr."}
{"text":"Not worth the hype. Everything is just really sweet. (Even though we ordered two drinks at little sugar levels) 

Honestly, it's like drinking candy plastic flowers. I guess if that's your jam, then this would be a 5/5 place for you. 

But in terms of bubble tea quality, nope. Way better places to go for the $."}
{"text":"I've had \"The Alley\" a total of 8 times and I'm a fan. My favourite is the Royal Milk Tea and the Trio (which I highly recommend) They seem to use real milk instead of the watered down stuff the drinks also have a very stong tea taste! I used to go to Chatime a lot but can say with confidence after trying \"The Alley\" several times The Alley might be the best bubble tea I've ever tasted."}
{"text":"Been coming here for a few weeks for my weekly fix of bubble tea! Absolutely addicted to the Garden Milk tea, however my only complaints about The Alley is the lineups, and also the lack or space for sitting around!

Other than that, I definitely recommend The Alley for bubble tea!"}
{"text":"Aha! At last, I've come back a second time on a Friday evening (around 8:30pm) to try out their specialty Deerioca! ..but it is with sadness that I have to say it didn't blow my mind.
I'm sticking with a 4 star review because I like the overall store concept, selection of drinks, and the drink I had last time but reviewing the Deerioca alone, I'd only give it a very mediocre 3 star.

I got to try the black sesame flavored tapioca and I think I was expecting some sort of explosion of sesame filling in my mouth so I was a little disappointed. It's essentially just tapioca with black sesame paste embedded into the pearl. That being said, it wasn't bad! Definitely could taste the black sesame and it was aromatic. However, it made the texture slightly softer and chewier than my preferences. I was also told that the deerioca tasted the best when paired with a specific milk tea that the employee recommended so I ordered it and.. well, I think I would've enjoyed it better if I got to choose my own tea. I believe she just gave me original milk tea and it was so.. standard tasting that I didn't feel like it was worth the $6.50.

It was also a busy Friday night so the employees seemed to be a little exhausted and sidetracked. She got our order wrong, but quickly realized it and rectified her error by remaking us the proper drink. 

I'd come back for the other drinks but I think I'm good for the deerioca."}
{"text":"Love the royal no.9 ... I think this will be my new fav!!! Will choose this place over cha time! However the wait was too long!!!!!!! I only had 2 person in front of me but it still took forever!!!! Seem like the people that were working there took their time. Did not realize that customers who are buying take out wants to buy the drink right away and leave. It took me around 20-30 min to get the drinks. Ridiculous!"}
{"text":"Tea flavor/ base is surprising. I am glad to give a try.

My review is solely based on my ordered drink ~ iron goodness iced milk tea. 

The regular size is good to share with loved one.  I ordered little sugar no ice. Outstanding taste from other bubbles tea. Iron goddess tea leaves fits well with milk, quite unique from green or black tea base

Cons are high price and ling line up on the weekend.
I would return to try other drinks such as winter series hot drinks which I included the picture attachment from my recent visit. 

Time limited winter series is now on!!"}
{"text":"Okay honestly I am obsessed with this place. 

The ambience is perfect, the location is convenient, and the milk teas are AMAZING. If only the price ($5 for a bubble tea hurts my broke college student wallet a little) weren't so high, I'd never go anywhere else. 

Starting off, we were offered a sample of their green tea (yum!). After looking over the menu, I ordered the Royal No.9 Black Tea by accident meaning to order the Milk Tea and the staff actually made both and ended up giving them to me for the price of one even though it was my mistake--still embarrassed but impressed with their customer service. Both tasted flawless with the smooth rich taste of black tea and faint hints of blueberry undertones. I adjusted the sugar to \"less sugar\" and the ice to \"less ice\" and it suited my tastes perfectly (not a fan of sugar-y sweet drinks).

My friend ordered the Apple of My Eye wanting to try something sweet and fruity and was also satisfied with his drink. Thinking it would just be like cold apple cider with aloe vera jelly, we were pleasantly surprised by the twist packed by an addition of what I can only guess to be apple vinegar. Very interesting flavour pairing.

I'm excited to come back to try out more of their drinks!"}
{"text":"Yesterday, went to the alley to try some bubble tea. It wasn't what I thought it would be. We ordered two drinks. The green tea with milk was pretty good. They didn't have the different flavored tapioca, so went with traditional.

The garden drink was something else. It must be an acquired taste, because I didn't like it. There is a layer of cream and then Oreo crumble on top. When you drink it, it taste ok, but when the Oreos sink, the texture was like sand and then mud. Really made me feel like I was eating a garden. I guess I got what I ordered."}
{"text":"The price is more expensive than others but I can't tell the difference. My friend recommended it to me said it's the best bubble tea around highway7. However I just feel like it's a fancy place but the flavor is average. I would go for presotea or coco instead."}
{"text":"Royal No.9 - the one I liked the best. Fruity, not too sweet and doesn't overpower the taste of the tea. 

Deeroica - homemade black sesame tapioca and their tea that goes with the tapioca. Their homemade tapioca was good, a different chewy texture than normal tapioca and you can taste the black sesame (almost like small glutinous rice balls - tong yun). Although their tapioca was good, I was not a fan of their tea. 

I also tried one of their northern lights theme drinks before. It was a pretty ombre drink in a cute bottle. We were told it taste better when it's mixed. In the end, it didn't taste like anything special but a standard mango slush. 

It's a good bubbletea option if you're looking for innovative/creative flavours that is different than other bubbletea places. I have to say their drinks are more expensive than others. Friendly service but on the slower side. There is usually a long line when I come in the evenings and there is only a few tables to sit at."}
{"text":"If I can give this place a star of 10 I would. It's so refreshing that this place actually use tea instead of powder or Watertown tea. I love this idea using real leaves and you can actually see them make it on site.  The staff are very friendly and they always give out free example. 

I've been here almost every other day and I can't get enough of their menu.  I so have to say they have to speed up the process since when you have more than 5 ppl you are looking at 20 min wait. But I guess they are still new and people are asking a million questions when they get to the cashier. *rolls eyes*

Anyhow I have yet to try their coffee jelly. Last time I came they ran out I'm so sad.  

They also make their own topoica.  Loveeeeee.  They are so damn good.  Yes you guys must try out this place.  Actually *don't * I don't want to wait too long for my drink.  Lol"}
{"text":"BEST BUBBLE TEA IN THE CITY. 

This place doesn't feel like a typical tea joint. The decor and ambiance are more sophisticated, the menu is so full of mystery, original recipes, and the service is awesome. 

They have drinks that literally look like pieces of art. Something called \"Northern lights\" looks like another galaxy trapped in a bottle. 

I had a pineapple brulee oolong drink and it had a ring of brulee'd pineapple on top of the drink. It was mind blowing. 

I love how they have drinks listed with just mysterious names. 

I will be back soon."}
{"text":"Decided to give this bbt place a try after reading the reviews and Instagram pic. Unfortunately the milk tea in my opinion did not live up to the hype. We tried the royal no9. Although the the hit of blueberry flavour was interesting, the milk tea tastes water down without any flavour besides the blueberry. Maybe I will go back to try other flavours but the first initial try was not very impress."}
{"text":"As i waited in line and checked in, Yelp told me it was like my 10th check-in here so alright, I guess it's time to write a review.

This was the first The Alley location that I've tried, and I was INSTANTLY hooked. It's priced higher than all other other bubble tea stores around, but it tastes so good that it overrides the cheapass asian in me. I've tried a number of their drinks including royal no.9, Jasmine Green milk tea, garden milk tea, deerioca, morning dawn and northern lights. My favourite go to is the royal no.9 milk tea at half sugar, as i feel like the blueberry black tea already adds a sweetness to it. I prefer the northern lights over morning dawn, and i do want to point out that these drinks takes a little longer to make so expect that :) 

It's a small location but they are as efficient as they can be, so i don't have a sense of line abandonment even when the line goes out the door. They're polite and knowledgeable about their drinks, really showing a level of professionalism.  

I also love that i can redeem any drink/size with my points card - makes me actually feel rewarded. I do hope they keep this policy as they transition over to the app, though."}
{"text":"The Alley is THE place for bubble tea!!

My favorite is still the Royal No. 9. The tea flavor is just so different than your typical bubble tea. 

The new sunrise drink ($7.50) looks very pretty, but the taste is ordinary, just like any other mango slush. 

***Definitely stick with the Royal no. 9!!!***

Seating is limited. But decor is modern and simple. The place is kept nice and clean. Staff is friendly. But be prepare to wait in line"}
{"text":"The service is so slow...it took like 20 minutes to get our boba. And they didn't even have their special deerioca! And in the end, the boba didn't even taste that great. Save your money. Save your time. Go somewhere else."}
{"text":"Cute, trendy little bubble tea spot. 

I ordered their most popular drink, the Royal No. 9 Milk Tea, and thought it was just decent. Despite ordering less ice, my drink tasted watered down. I wish it had more tea taste and perhaps less milk. Trust me I love milk tea but I just hate it when my tongue gets a film of milk on it - gross. I only finished the drink because I didn't want to have wasted money. My brother-in law had the Alley Trio Milk Tea and while I didn't try it myself, he had also said his drink seemed very diluted.

Overall, I've had better in terms of bubble tea. Not awful, not bad, but not great either. I thought their service was quite excellent though. The guy who took my order was very nice and patient even though I took forever to order since it was my first time there and just me being super indecisive."}
{"text":"Top Notch in service and quality. This little shop in the core of Richmond Hill/ Markham area offers a refreshingly distinctive service in bubble tea. I've been quite impressed with their unique blend of teas and mixed drinks, however, their level of service what truly sets them apart. 

My favourite item on the menu is by far the Royal No. 9 Milk tea, a special blend of flavor that hit every good note on the palate-deep and complex in flavor. The fruitiness of the flavor accompanies rather than overpower the tea, the tea flavour is bold and strong. 

A topping that they offer, rarely seen elsewhere, is the purple rice. I was hooked on it since the very first time. The nice texture contrast between the glutinous grains with the hard outer shell satisfy a strange craving. Unfortunately, since the very first time, it's been a bit inconsistent mainly due to refrigeration. If it is fresh, it is definitely a home run. In addition, a big marketing drive for the shop is the handmade tapioca, available only on weekends after 8pm. I have yet to have the opportunity to try it.  

As mentioned before, their customer service level is quite impressive. Each person behind the counter definitely took the time for each customer. That being said, this is not a fast in and out joint, but your patience will be rewarded. I was overly impressed that without skipping a beat, the servers made sure that I was enjoying my drink and offer a replacement if dissatisfied. I appreciate that they put their customers' satisfaction first and foremost. 

The prices here is reflective of said quality and service. It is by no means cheap, however, if a bit pricier means satisfaction, I am quite happy to pay and wait. I would recommend this place to everyone and anyone that enjoy bubble tea and quality. It is well worth the price and travel."}
{"text":"This was like the starbucks version for bubble tea chains. It has a hipster feel to it. Very different and unique flavours compared to cha time and coco. I tried the royal 9 and it was milk tea with a subtle blueberry twist. It sounds kind of nasty, but it was surprisingly very good! 

The downside is that it's on the more expensive side, compared to other bubble tea chains. For a regular, it was $5-6. 

I kind wished they would list the flavours/ingredients of the drink somewhere on the menus. They have fancy names that don't really describe the drink, making it hard to decide on which ones to try. This ultimately slows down the line, because customers are asking the single cash about the drinks."}
{"text":"Cute little place for different kinds of bubble tea than the standard. I got Apple of My Eye, which was very refreshing and apple-y, but too sweet for me. I was surprised that it was a slush, because I was expecting it to be over ice, but that's alright. My sister got a honey lemon tea with aloe and she said that it was good but rather bitter as they blend basically a whole lemon into the drink. It is an interesting place and I would probably go back to try a milk tea."}
{"text":"This is a fairly new location. I love their bubble tea and their selections. It's a bit pricey but it's worth it for the authenticity of their teas! The place is well designed and clean. I would definitely go back."}
{"text":"My husband and I try this place recently, I got the Royal No.9 Milktea and my husband tried the Green Milk tea. I think the Royal No.9 is their most popular one, you can taste a hint of blueberry, not sure why but I find the drink refreshing. There is a hype about the deerioca, which is their handcrafted tapioca, it did have a very chewy texture compare to the other bbt places. But i don't think it's a big factor for me, as long as there is tapioca I'm happy. My husband drink looked like a potted plant, (we didn't know what we were ordering) I believe they use Oreo crumbs and I'm not sure what they use for the green leaves other than it was a plant they had in the store. We didn't really get the point of the Oreo or plant as we don't think it added anything to the taste drink itself other than the \"look\" of the drink. The crumbs takes away the smooth texture of the drink, we didn't really like that one overall. My husband didn't like either drink but I like Royal No9. After ordering I realize they had the Fresh Milk series, which I'm guessing uses real milk which we would like better than the powder stuff. I will defiantly go back to try again! ( they were offering samples of their Royal no9 Milktea...thou I wasn't offered one to try but I mean you could always try it before ordering)"}
{"text":"Was really excited to try this new bbt place at Commerce Gate (so many bbt places there now!), but was let down. :( Just not my cup of tea.

My tastebuds were pretty confused. Was I drinking bubble tea or what? We got the #1 (Royal No.9 Milk Tea) with grass jelly, and #2 (Garden Milk Tea) Alley Picks. #1 was fruity and tasted like something you'd get from David's Tea. #2 was essentially milk black tea with tapioca and Oreo crumbs on top. It tasted like an Oreo frappuccino more than milk tea. It's like I came here expecting to have bubble tea, but somehow ended up with drinks from David's Tea and Starbucks. 

The prices are also slightly higher than Chatime, Coco, and Presotea. Still liking those other places better, so will likely not be back here for bbt. :("}
{"text":"Came here on a Saturday afternoon and the line was long. But I must say it's worth the wait. I ordered the No.9 Milk Tea (made with blueberry tea leaves). I can actually taste the blueberry flavour! And I agree with others... with the amount of money that I paid, I expect a place to sit and chat with friends."}
{"text":"\"Take me out back to the Alley,\" she said with sinful eyes and a dangerous smile. \"And give me something I've never tasted before.\" He grinned mischievously, fingers on his pants. With a flick of his hand, he whipped out his wallet, and bought her a Royal No. 9 milk tea.

No, it didn't happen like this (or maybe it did), but the Alley was so damn good that after the first round on Saturday, my friends and I went right back for another round on Sunday. We were offered samples of their signature Royal No. 9 and a small dish of their tea leaves was passed around for us to sniff. Yes, real tea in a bubble tea. What a twist! They also make their own tapioca, which I haven't gotten around to trying yet. 

Between all of us, we got: 
1) Royal No. 9 - Love it. Milk tea with an interesting blueberry hint. 
2) Penguin On The Ice - Some kind of ombre milk tea, which my friend said was good but nothing special. 
3) Garden Milk Tea - Regular milk tea but with a cool floating surface of crushed oreo and mint leaf, making it look like a \"garden\". Cool for Instagram, not the greatest to drink, as the oreo crumble gets soft and mushy as it sinks into the drink. 
4) Apple of My Eye - Apple cider drink so it's kind of sour, but very sweet and refreshing with citrus flavours. 
5) Citron Soda - Looks pretty neat and apparently tastes pretty great too. 

Space is small and the seating is limited, but the decor is very unique. It's got a steampunk cafe kind of feel with an attachment to horned forest animals, which I can't say I've seen before. My friend's impression was \"try-hard hipster\" but I kinda like it. The prices are comparable to places like Chatime and Presotea, but without the teen attitude (Looking at you, Chatime). The wait can still get pretty long, but the people that work there are just so nice, you can't be mad! 

I think it's too late for me, I've become a fan. Saying goodbye now to the money I'm going to pour into this place. But hey, maybe I can start selling erotic fanfiction to fund my addiction. ;)

(58/100) - 2016"}
{"text":"Apparently some Harry Potter inspired tea spot. They had to rename the place due to the obvious copyright issues but apparently the one in Asia still has the original name as Harry Potter doesn't seem to care as much over there than over here. The milk tea were decent and standard, nothing particularly stood out to me for me here though. If i'm in the area, I might get one again but not a major show stopper in my books."}
{"text":"awesome drinks here! Haven't had one I didn't like! royal no.9 is my fav tho! haven't had the chance to try the flavoured tapioca and don't think I ever will unless it becomes more available... the staff is super friendly and nice, however the lines move slow as they take their time to make the drinks."}
{"text":"Came back for their new flavors northern lights and morning dawn, only cuz they're so pretty to look at ^-^ 

fav: morning dawn

tip: it takes 5mins to make each drink....i waited approx. 20mins+ 

I also ordered the passion fruit green tea, it was a pretty good deal since it came with passion fruit seeds, tapioca and jelly."}
{"text":"Different. The types of tea they offer are not your average bubble tea flavours. The teas are rich and full of flavour. I would recommend the regular milk tea and the garden one (taste like Oreo milk tea). Its very small, would not be a great place to socialize. I also wish I got to try the drinks with tapioca. Try to go in the morning before they run out."}
{"text":"This place confuses me.  I'd like to imagine the founding of this establishment occuring via the following text messaging conversation:

John: What's good brah, I have a few million $ to invest. Any ideas?
Bob: Yea lets open up a new bubbletea place.
John: Sounds good fam, how are we gonna make it diff from Chatime and CoCo?
Bob: Hmm, instead of being all colourful, let's make it more dark and aesthetic themed - hipsters love tht.
John: True, wht about the mascot?
Bob: How bout a deer? Harry Potter's patronus was lit fam.
John: Yeye, let's call it The Alley too.
Bob: Sounds good.  Let's put blueberries in the milk tea, so we can jack up the price.
John: Yeah, ppl love antioxidants and will think they're being healthy. Iight sounds good brah, I'll ttyl pce
Bob: Pce

Forreal though, I'm a fan of The Alley.  I've only had their Royal No.9 Milk Tea so far, but it's pretty damn good - unlike anything I've ever tasted (+1 for innovation).  It's like eating a Dorito Nacho Cheese Flavoured Tortilla Chip instead of a Regular Lay's Potato Chip.  I mean, sure, it costs a bit more than Chatime/CoCo Tea, but you get a unique product/experience.  

Go try this place out and let the blueberry infused milk tea flow over your taste buds."}
{"text":"3.5 stars for the Alley!

Walking in for the first time, their service was exceptional for a bubble tea place! When we walked in, the server asked if it was our first time here, and she introduced the bubble teas, let us have samples and sniffs of the popular bubble teas. 

The Royal #9 tea was a milk tea with a blueberry twist into it - it smelt lovely! However, I really enjoyed the smell of the sweet dew tea. They had the option of having it with fresh milk, which I thought was super interesting! I'm not a big fresh milk drinker, but once you combine it and make it delicious, why not?! 

Their bubble teas a little more expensive, the regular size was $5 and tapioca, or jelly are an extra $0.50. I got the rainbow jelly with it and there was quite a large scoop of jelly, so the $0.50 was worth it! 

A total of $6.22 for one regular sized bubble tea drink seemed a little overpriced though - and the taste was average, I think I'm going to stick with other locations for bubble tea."}
{"text":"My favourite bubble tea place!! I've been here numerous times and many different locations as well. Their royal no.9 bubble tea is to die for. It's a blueberry infused milk tea with tapioca. 
It's a very small area with not much seating. Can be a bit pricey but definitely worth it.
Highly recommended 10/10"}
{"text":"Enjoyed the bubble tea a lot here - came here twice this week. Tried the royal #9 (blueberry infused milk tea) and the polka deer (green milk tea with fresh black sesame tapioca). The tea bases were better than average and fresh tapioca was a refreshing change (soft, chewy and great flavour). In general, really appreciated that the drinks were not overly sweet and I actually enjoyed it from beginning to end. Decor was cool although seating is limited - - overall definitely will be back when bbt craving kicks in."}
{"text":"I came here because my friend suggested it and it's a very modern, rustic looking tea shop. We got to sample Royal No.9 (hot version), and it was delicious!

Me, I don't drink bubble tea, or milk tea at all -- I avoid it because it upset my stomach. But this drink was so delicious that I ended up buying one! (to which, I regretted it later that night because my stomach was in knots and the caffeine kept me up at night but it was worth it!)

The drink is sweet with lots of blueberry taste. Not only was the drink amazing, but the service was too. I was confused on the difference between Milk tea and fresh milk tea and the cashier was so friendly and sincere she explained everything to me.

When she gave me my change, she placed it in a little wooden tray, like in Japan -- how cute! I appreciate the tray instead of dumping change into my hands, gives me time to organize my change ^^

Love this place. Not a milk tea/bubble tea drinker, but I am now! (on occasion, because I my stomach can't tolerate it)

Also, they have promotional events where you get a free drink the first 30 people who come at 3pm on May 14 & 15, 2016. Definitely try it out! It's my new place to rave about!"}
{"text":"I've been here only once and I definitely would return. If only I lived in Richmond hill! 
 
We came here on a Saturday afternoon to grab some bbts to go. The store is cute and unique, I love that rustic feel to it, as well as the cute little drawings of the tapiocas on the wall. Unfortunately the store is tiny and can't really seat too many people. Therefore I would recommend going with a small group (i.e. By yourself or with just one other friend). Customer service was good, they introduced us to their tea leaves and let us sniff a couple of them. This is the first bubble tea place where I'm 100% confident that they use real tea. In addition, they make their own tapioca from scratch.

In terms of their tea, I ordered the iron goddess milk tea. The taste of the tea was rich (might be because I just saw their tea leaves and it's just a placebo effect?) and the milk wasn't overly sweetened. All tapiocas taste the same to me so I can't really comment on them.

My friends ordered the royal no.9 milk tea. It really wasn't my cup of tea. I don't quite get the appeal of adding milk to fruit flavored tea, but since it's so popular, there must be something good about it. 

The price of the bbts are on par with chatime's / goncha's. Who are we kidding, good bbts are all expensive."}
{"text":"New bubble tea place. They make their own sugar which makes the drink taste different than the other franchise. We tried Garden Milk Tea.  No sugar and no ice since the tapioca is sweet enough. Normally after I drink bubble I feel really thirsty(or feel irritating for my throat) and want to drink a lot of water. But for this one, I do not feel irritating and no need to drink water at all. I guess they use better quality of sugar and real tea. I will go to buy again if I pass by."}
{"text":"I finally did it! I made it to The Alley! I had no idea what I wanted to get. With names like bear au lait and no descriptions, I felt quite lost when it came to their more unique drinks. I mean, it's one thing to ask about one drink, but to ask about a whole ton of drinks while there's a lineup behind you? Um...no thanks. Right up until the moment I ordered, I thought I was going to get a garden fresh milk tea because Instagram and all, and something about oreo bits and a little green sprig of mint or something. Then, the girl at the register asked me if I wanted to try a sample. Well, of course I did! She gave me a sample of the sweet dew fresh milk tea. I ordered it. See? Samples do work. In case you're wondering, sweet dew tastes oddly like mild coconut. I have no idea what it actually is, but it was tasty, and after drinking it, I was able to sleep fine, so no caffeine issues plus bubble tea at night is a win in my books. That being said, it's also slightly pricier than other bubble tea places."}
{"text":"This place has a dark Urban Barn kind of feel with exposed brick, distressed wood, vintage clock and lighting, and deer motifs. The Alley seats maybe 11 people so takeout may be a better option for larger parties. 

The cashier let us try a sample of the Royal No. 9 milk tea. This tea has a subtle blueberry flavour as it is steeped with blueberries. Hubby tried the Royal No. 9 half sweet with fresh milk and less ice. He unfortunately preferred it the way it had been sampled, prepared with milk powder and a bit sweeter. The tea became more acidic and less creamy when made with fresh milk.

I debated between the Sweet Dew Oolong (a subtle oolong) and Iron Goddess (a more traditional stronger oolong milk tea, which holds up better to milk powder). I opted for the Iron Goddess since I like my oolong very noticeable. Half sweet was still plenty of sweetness in my opinion. I may try it with even less sugar next time.

I like how they brew tea leaves rather than deriving flavour from artificial powdered flavourings. I also like how they have unique toppings like purple rice, but also make their own tapioca (aka \"Deerioca\").

Will be back to try more of their unique teas. 3.5 stars.

(62/100)"}
{"text":"My boyfriend and I came to The Alley for a bubble tea dessert after eating dinner at Times Square. There was a line out the door and we were approximately waiting for 15 minutes before ordering. Their selection of bubble teas has some unique flavours - Royal Number 9 Milk Tea is one of the more popular drinks, along with their brown sugar drinks, sodas and their Aurora series. Have yet to try their deerioca as it always runs out before the end of the night. We saw their drinks with multi layers of slush being made - that's next to try here. 

Not sure what it is but I find their milk teas pretty watery compared to other bubble tea shops in the plaza. I do enjoy the light blueberry taste of the Royal No. 9 and it's different from other tea shops in the plaza. Half sweet was sweet enough sugar for me. A large Royal Number 9 with tapioca came up to $6 and change. I couldn't tell if their tapioca is supposed to be super plain or if they forgot to soak it in syrup prior to serving it. 

Ask for a stamp card and make your visits worthwhile. I love that their aesthetic is dark, mysterious, and modern. 

Why I rated them a 3/5 you might ask? The drinks here are pricey and the wait is excruciating. It feels like their employees work at snails pace and the work space is so small that they almost always bump into each other."}
{"text":"Such a refreshing place compared to all the standard bbt chains that have been popping up. The place itself is small and pretty much between satan's home (chatime richmond hill) and coco. It's pretty hipster and has a whole hannibal feel to it. I dig the decor and the overall aesthetic - it's pretty much an instagram worthy place, with the deer and the pretty lettering. Even the seating inside is hipster.

The owners, Vicky and Hongki (both who are super young and obviously successful for opening up their own business) are two of the nicest people and they greet and thank every customer coming in and out. The staff are very nice as well and offer you samples of their milk tea when you come in (which I unfortunately could not try). Their menu is vast and extremely different. I've seen flavours that will keep me coming back. I've tried their guava lime juice, which is super unique and flavourful! The lime zest in it makes it perfect. You can't adjust the sugar in it, but I do not think it's too sweet (coming from somebody who always gets zero % sugar in their bbt). I've also tried their sweet dew oolong, which was ahhhhmazing. Such a nice flavour without being too sweet or overpowering (less sugar, less ice is a gem)

The coolest thing about this place is that they make their own tapioca (deerioca) fresh and there is a limited supply so if you want these cool FLAVOURED balls, definitely come at night after 8 on fri/sat. 

I'm a huge fan and I see a large future for the alley; it's definitely a breath of fresh air."}
{"text":"Although I've only been here twice, I'm already a huge fan of the Alley. They definitely have something special going and it's no secret as the place was just packed both times I've been here. 

The Alley's specialty drinks are the stars of the show. I've went with the royal no 9 the first time and was immediately hooked. That deep tea flavour combined with a hint of blueberry adds a unique sweetness to it. I'm also a big fan of their handcrafted tapioca? I went with the apple of my eye the second time and was not expecting a slush at all. While it was good, it was a tad too sweet. I did request less sugar but was told that the sugar amount was fixed (as they use apple cider and that probably would have come at the expense of less apple taste). They probably could have also put less tapioca the second time as nearly a third of my drink is tapioca.

The Alley is definitely a trendy spot for bubbletea. The vibe is relaxed and rustic. Be prepared to wait but it's well worth it."}
{"text":"New bubble tea joint! Loved the interior with its unique design and plentiful decor. I had the Royal No. 9 Black Tea and it was really refreshing. Be sure to tell them how you like your drinks (sweetness/ice). I found that the regular sweetness was alright (a bit sweet for my liking), but not as sweet as the regular sweetness from other places. Definitely will be back for their other drinks and to try out their handmade tapioca!"}
{"text":"I had the morning drawn and northern light two days ago. It was very pretty, but it was hard to drink due to too many ice, when the ice melt it taste like powder juice. I kept the bottles coz it looks nice. I might be back to try the milk tea."}
{"text":"After reading some hype reviews on yelp, I decided to give this place a shot.
I ordered the much hyped royal #9 and I was expecting the blueberry flavour, but it was exactly how I imagined it would taste. Sure, it's a twist on the traditional milk tea, adding a fruity accent to the overall taste, however, with so many choices nearby, chatime and presotea, I would pick either of those before coming here. The Alley is also slightly more expensive than presotea and chatime. The Alley royal#9 is $6.xx with tapioca. Presotea #82 (pudding, grass jelly, tapioca) is $5.xx.

The Alley wins in the ambiance and decor department. Seats about 10 people inside."}
{"text":"Nice cozy spot at the commerce gate plaza. Great atmosphere although a bit small. Love the deer antlers decor. 

Unfortunately, I could not say the same for the boba. Ordered the Royal no. 9 Classic Milk Tea- the drink was a bit too sweet even though I ordered less sugar and the tapioca was atrocious. Felt like I was biting on eraser shavings. 

Atmosphere 5/5
Taste 2/5
Experience 3/5"}
{"text":"They always run out their popular drinks like derrioca earlier than they close because they don't make enough, it's a popular drink they have and they should make more so it doesn't run out so fast, and it's not only this location that runs out early, it's almost all.


I'll be posting this complaint on several sites soon tonight.

Perhaps other bubble tea shops should include this popular item on their list!


They always run out of it, but you can make it at home it's pretty easy! :)

Here you will find my version of the brown sugar tapioca, which I found it to be very similar to the one they have at The Alley, try it and comment to let me know how it tastes! ;)


Buy Large Tapioca from T&T or any Chinese Grocery store.

1. Pour 3 cups water in a cooking pot, Let boil, then add 1 cup tapioca to the boiling water.

2. Let it boil for 30 mins to 1 hour, make sure you keep stirring it every 5 mins.

3. Try a piece of it after 30 mins, if you notice the tapioca is soft then you can move to the next stage, if it's still hard then keep it boiling.

4. Once the tapioca are all soft, drain the water leaving only about 5-7 table spoons water, reduce heat to low.

5. Add 1/2 cup brown sugar, and keep stirring every 1 minute, and let it simmer for about 3-5 mins.

6. Take out the pot from the heat and leave aside.


7. Pour 2-3 table spoons or as desired of the brown sugar cooked tapioca to a cup.

8. Add a little of Ice.

9. Fill the cup with 3.25 Homogenized Milk.

10. And it's ready to serve! :)"}
{"text":"Be careful of the sweetness level, even with less sugar my bbt was overly sweet. 
The Oolong Milk Tea and Apple of my eye were both really good!"}
{"text":"The space was small and the limited seating almost deterred us from coming here (especially with many bubble tea places nearby). Luckily, people started leaving around 2 PM so we were able to sit. Definitely come early in the day our during the afternoon lull, if you don't like people, like me hahaha. The cashier was friendly and when she saw that we were having hard time deciding what drink to get, she helped us and even offered a sample of their newest matcha drink. She also said their most popular drink was the Royal No.9 Milk Tea and let us smell the tea leaves, which had hints of blueberry.

My friend and I both ended up getting the Royal No.9 Milk Tea (despite my lactose intolerance but let's not talk about that) and we can definitely see why it's so popular. You can actually taste the tea flavour and know it's not some powdered stuff. Even with less sugar, it was still pretty sweet. Their prices are comparable with other bubble tea places, and I really like how the tea flavour comes out in the drink. Can't wait to try more!"}
{"text":"My facorite bubble tea is their royal #9 milk tea with tapioca. It has a stong blueberry flavor that does not taste artificial. The milkiness of the drink pairs well with the blueberries. The tapioca is made in-store and isn't overcooked. 
The cashier was thoughtful and suggested i go with less ice seeing as it was so cold outside. She told us that their regular sugar level is pretty light.
My sister-in-law got the t-harmony which is a milk green tea with tapioca, red bean and taro. She suggested no sugar since the red bean and taro is sweetened already.
Their drinks are a bit more expensive than chatime and gong cha, but the unique flavors keep me coming back for more."}
{"text":"During my three weeks vacation, The Alley became one of the biggest hype! From the photos posted on the windows outside, this place is also in Hong Kong. Their selling point is they make their own tapioca and it comes in different kind of flavours such as Black Sesame. So when I returned to Canada, I had to visit this place!  I had been here twice already in a span of a week and I think i'm ready to write a review.

Tried their Royal No.9 Milk Tea (since they ran out of tapioca the fist time i came) on my first visit, and tried their signature Polka Deer (Black Sesame tapioca) on my second visit. The Royal No.9 milk tea was interesting because it had a blueberry aftertaste but wasn't too overly impressive.

The Polka Deer was a total disappointment. How can you not allow customers to add Black Sesame tapioca in other drinks?  Anyways, thanks to this restriction, I had to try their signature Polka Deer. The tea itself was very tasteless (I rather have the Royal No.9) and their Black Sesame tapioca just tasted like black Sesame pudding cut into small pieces. It has absolutely no texture, not even chewy like the regular tapioca. I literally drank half of it and didn't want to finish it.

Decor is very hipster but very limited seating with only two 2 person table and one 4 person table. With the amount of people lining up, sitting here does not feel comfortable at all.

Overall 3 stars for bringing more competition into the bbtea market in Toronto. Royal No.9 milk tea was surprising with an interesting aftertaste and it did taste decent."}
{"text":"We went to try their bbt because of the positive reviews we heard, and maybe it was because we arrived later in the evening, but our experience was pretty bad. We waited in line for more than 15 mins to only reach the cashier to say they had no tapioca or grass jelly. What a disappointment, as we only mainly went for their flavoured Tapioca. We ordered the garden milk tea and alley trio milk tea. Upon waiting for our drinks they told us that they did not have enough black tea for my alley trio milk tea and would replace it with royal number 9. I could see the other guests, who waited just as long as we did, frustrated that a few of their specialty drinks were unavailable because of their lack of black tea and tapioca. However, I did enjoy their royal number 9 as it had a good fruity flavour to it. Their garden milk tea tasted a bit creamy to me and I'm pretty sure it was because they were running out of black tea lols. I'll be back during an earlier evening time to try their drinks again with tapioca."}
{"text":"I was so excited to try their handcrafted tapioca. They have these after 8pm on Fri/Sat ONLY (they should put this on their website). We drove all the way here from downtown just to try this place out (you can tell how excited we were), but we didn't even get to try handcrafted tapioca (aka deerioca). Such a disappointment. 

The staff was friendly and helpful...but it was just hard to understand what she was talking about and she rushed us to try one of their signature drinks (Royal No 9). Some of the names for bbt at this place are rather confusing compared to other places. Wish they had more detailed descriptions for each drink in English. 

I was not impressed with their drinks (Royal No 9 and sweet dew oolong). There was nothing special about them. 

Overall, it was totally not worth driving all the way from downtown just to have regular bbt with regular tapioca in it. Will see if we are around this area on Fri/Sat night and have a chance to try their deerioca."}
{"text":"This is a good hipster alternative to Chatime and it's right next door.

I like that you can actually taste the tea flavours.

I am literally sending my brother to pick up large Green Milk Tea and Royal No. 9 Milk Tea with tapioca and less sugar as I write this review.

I've also tried the Alley Trio which is Assam milk tea with a mix of tapioca, coconut jelly and aloe vera (?).  It was good but I think I prefer more straightforward drinks.

I noticed that they taste test the tapioca pearls to make sure they have the right texture.

1 less star for limited seating and long wait lines -- try to avoid rush hours (e.g. after dinner to late)or weekends if you can.  The last time I tried to go - I ended up going to Chatime because I don't believe in waiting 30 minutes to spend $6 on a drink."}
{"text":"I can't believe I never wrote a review for this place despite me coming here often. I live close to hwy 7 and warden but is always in the area for drinks, dessert and food, even facing countless traffic on hwy 7.

This is the original Alley, the first to open in the GTA. I have here countless time since they first opened at commerce gate and never ever once did I ever received bad service. Even when they first opened and there was a long wait for drinks, there was never a negative impression left behind. All employees are polite, courteous, patient and welcoming. Each time you go to the counter, the employee always ask if you would like to try a sample of their current drink of the day. And once you paid for your drinks, they would ask if you were interested in a stamp rewards card. Buy ten drinks, get any drink for free!

This front store is not very big and there are maximum 8 seats with chairs with table and three high chairs by the window. Despite its small size, this place is always cozy and sleek. Their logo aka the deer is very prominent in each store.

I have tried almost every drink on the menu and my favourite is still their famous royal nbr 9, with a hint of blueberry. Milk tea not your cup of tea? the alley has a vast list of juices drink such as the apple of my eye, the kiwi slush, the guava lime etc. all very refreshing, especially with summer coming. I hope one day the alley offers a mango drink 

The plaza is very busy so sometimes, it may be hard to find parking. No sweat, just park underground and take the elevator or stairs up."}
{"text":"I really enjoyed The Alley! I don't remember the last time I had to line up outside for bubbletea but I really did not mind and the hype for this place is real! I love the concept, decor and vibe. The service was great as they introduce the various popular options and also mentioned by other Yelpers- once you get to the cash, the staff offers a sample of the Royal #9 milk tea. lol..I am sure everyone asks what it is and what it tastes like so it is a great idea to just serve it. 
I opted for the Royal #9 with tapioca (30% sweet and less ice), while the fiancee got Apple of my Eye. I normally get my bubbletea with no sugar when I add toppings in since tapioca is cooked in sugar water but for a new teashop I tried their 30% sweet- it was good but for me, next time I would order the drink with no sugar (FYI..for people who also don't like overly sweet things). The tapioca was cooked perfectly; no complaints:) Apple of my Eye is with no milk and it is made with apple cider vinegar blended with ice.From what I remember it also comes with either aloe or jelly. I would recommend this drink since it is super refreshing and the sourness + sweetness is just right.

Unfortunately, they only have the deerioca on Friday and Saturdays but we visited on a Thursday night. I guess this is another excuse to come uptown for a sweet treat!"}
{"text":"it was my first time here, they gave me samples to try and took the time to get to know what i like. the teas all tasted amazing and I had trouble picking one. I ordered mine and asked for less sugar but when I got the drink i found i wanted it a little sweeter. they wanted to make sure i had the tea exactly the way I wanted it, so they took it back and adjusted the sugar level to perfection. they were so kind and friendly throughout the entire process too. i'll definitely be back to try all their teas!"}
{"text":"Great bbt place in the area! Definitely gonna come back again!! I don't mind wait a bit longer for a quality bbt. It's like getting a handcraft drink of your own, don't compare it with a fast food drive thru. 

The staffs there really know their teas. They are knowledgeable and friendly. They patiently answer your questions about all the drinks!"}
{"text":"The place is rather small and rowdy on a Friday night. However, I find their royal no.9 tea to die for. The cool sensation from the hints of blueberry in the tea work amazingly with sugar and milk."}
{"text":"Good service at all time. It's located near my work place and I go almost every week. Fav: Royal #9 Milk Tea (won me over Chatime's Roasted Milk Tea)"}
{"text":"This one is similar to the Main Street Unionville location. In general, this bubble tea brand is a bit overhyped, pricey, and average at best. I ordered the Garden Milk Tea ($5.50) and it was simply milk tea with oreo crumbs and a mint leaf on the top. To be honest, I wasn't a huge fan of the oreo as I didn't felt it paired well with the milk tea. A lot got stuck to the edges of the cup, and I couldn't even eat it! Like I mentioned in my other review, this place is more of a \"once in a while treat\"."}
{"text":"The bubble tea is average. It's good, but it's not 40 min wait kind of good. If you wanted tapioca it was another 40 mins."}
{"text":"Always been a fan of this place.  Recently tried their Jasmine Milk Green Tea and it was pretty good.  Royal #9 has always been my go to......but after having it every week.....52 times a year........I think it is time for me to pass the consistency to try something new....for the next 52 weeks LOL.  On a serious note, probably one of the best places for bubble tea and pretty much my go to whenever I go with friends and colleagues.

Overall, not much has changed except for lengthier wait times as is the case with any good restaurant/bbt/dessert place within the Markham area, just due to the fact of overpopulated growth and urbanization of city.  The Alley will always have a place near and dear to my heart and will always be my top bbt place within the GTA and Toronto.

On a side note, when I was a kid.......having a meal for $5 was already considered a luxury.  Now I see kids coming out of here like ballers with 5-7 dollar drinks.  Times have changed indeed.  YOLO."}
{"text":"I Like it.

A nice change from your typical BBT. The Royal milk tea is nice and the hint of infused blueberry really does set it apart from your typical milk BBT.

Too bad their Deeriocious tapioca is only available on the weekend. will have to come back and give it a try."}
{"text":"Very good bubble tea, but the menu is unclear. They have cool names for their tea, but doesn't explain what's actually in the drink. Have to ask the cashier what which one is one by one. 

Pretty slow as well, once waited for 40 min cause the workers there tend to move at a glacial pace."}
{"text":"The Alley became my friend and I's new \"it\" spot for bubble tea. It's a small boutique sized bubble tea shop. It is hard to find a seat here. I'd recommend coming on a weeknight if you're looking for a place to sit and chat.

I'd recommend the:

* Royal No. 9 bubble tea
Love this! I came here two days in a row to grab this drink lol.. It's addicting! This bubble tea has a hint of blueberry aftertaste. It's light and refreshing. I usually get this with less sugar and less ice :)

* Garden Milk tea
It looks like a plant because it is served with chocolate deerioca and Oreo crumbles on top of the milk tea with leaves in the middle. Very cute. The taste is creamier than the usual milk teas I get at bubble tea shops, it has more of a milky texture."}
{"text":"One of the finest bubble tea places I have been to so far and trust me I have tried many. The only problem is they have very limited siting but if you don't mind that then it's a great place to go with friends. There are nice resturants around in the same plaza and my friends and I usually come here after eating. Their drink of the month is of great value."}
{"text":"Speed Read:
1) Royal Number 9 is the best tasting drink
2) News drink (sunrise) looks dazzling, but taste only so so.
3) Pricey 

I don't need to reiterate so many yelper's love for their drinks.
The only reason I didn't give a 5 star is the premium price on their drinks, long line up, and limited seating inside and zero seating outside.

The new drinks looks amazing, but it taste ok.  It drive business for them but it doesn't built more customer loyalty.  
I hope they focus more on natural (non-artificial) taste on their future drink innovation.

If you read the review this far, here's one more tip.
Staff are extremely friendly and knowledgeable, and will take the time to answer your question despite the long line up.  Just ask!

If you enjoy reading this review, please like or complement my review, thank you!! :)"}
{"text":"TLDR: Will definitely be coming back to try the other flavours & the specialty tapioca! 

Let's start with the positives shall we? 

The location of this little shop is obviously prime but very competitive. That said, they did a great job of setting up a store that was unique and truly their own. The decor stands out to me because of their location - they chose a vintage theme that you would not typically find in that area. 

I ordered the Iron Goddess and I loved the intensity of the tea. Unfortunately I didn't get a chance to try their specialty tapiocas but I sincerely enjoyed what I had ordered and would be happy to try more unique flavours.

The not-so-impressive part of my experience? This is a very subjective part of the review but I wasn't too impressed with the service that we got. 

Now there are two ways to see this but in essence, the cashier that took our order was a bit too \"over-enthusiastic* about their products. I loved that she wanted to introduce us to the featured drinks, to have us smell their specialty tea leaves, and explaining what is in our drinks but at the same time, I wish there was a little more consideration to time. We were in line for 30 mins and as we were a bit pressed for time, we simply requested for our drinks and gave our requests on how we would like them prepared (less ice, less sugar, etc.). She gave us quite the sour face and continued to introduce the teas without taking our order. We felt kind of bad to interrupt her but we were in a serious rush and when we requested one of the drinks, she insisted on telling us what was inside as to ensure that we \"know what we are ordering so to make our wait worthwhile\". We appreciated the thought but simply could not afford the time to listen to more (sorry but we literally ran late for our father's day dinner). I left feeling as if I insulted her by wanted to place my order and just go...? I sincerely appreciate her taking the time/effort to try to elaborate and introduce the drinks to us but would have simply appreciated that our need for efficiency be recognized at the time. 

Overall though, seriously enjoyed the drinks and would not hesitate to try again :)"}
{"text":"Shop was dim lighted, with a modern decor.  There's a machine to make fresh bubbles.  The barrista offered free samples of the milk tea.  It was flavourful.  Ordered the sweet dew oolong and the garden milk tea.  The garden milk tea looks amazing.  Taste good as well.  The wait time was about 5 minutes to get the order, typical wait time for milk tea shops nowadays.  Will go back."}
{"text":"I've been wondering about this place since it opened. The line up on the weekend was too long so today, when I saw the line up was only 5 people long, I decided to join it. Wow - what a big mistake! 
I walked in at 9:24pm. I ordered at 9:39pm and didn't get my drink until 9:56pm. This is what I have learned - Theres always a line up because they have to take the time to explain to customers what everything is on the menu and because they don't have the proper equipment to make the drinks in an efficient manner. It's in a plaza that also has a Coco, 168, ChaTime, and Presto tea, all of which are a lot more efficient at making drinks. Doesn't look like they thought this through. I know  what you're thinking, \"but their drinks are different and more gourmet then those other guys!\". As fancy as a drink is, people will not wait more then 20 mins to pay these over the top prices and also wait another 15 mins for the drink to be made. This is a known fact and also what makes the other guys successful. Have you ever waited half an hour for a fancy latte from Starbucks or Second Cup? Most likely not, and if you did, I'm sure you got an extra free drink for the wait right? Yup. They thought out the customer experience from start to finish, can't say the same about the Alley unfortunately. 

The drink I ordered was a Wintermelon Punch and it didn't taste any different then the Wintermelon tea from Sharetea. Nothing special, which is unfortunate because I was hoping it would be something special after waiting so long. The menu says things like \"Alley trio milk tea\", \"Penguin on Ice\", \"Garden Milk Tea\". How is anyone suppose to know what these drinks are? There are no descriptions below it and I'm pretty sure no one is going to ask what every single one of these obscure names mean-especially if they're in a rush to get out (because they've already waited 20 mins to order).
The time I waited, and the price I pay was not worth it at all. I could've went to any other bubble tea shops in the plaza and paid 25% less and been in and out in less then 20 mins (even if there was 5 people in line before me).
If you love to wait in line, try the Alley but don't say I didn't warn you."}
{"text":"This shit broke my heart. Super trendy with that college hipster vibe that provided a unique bubble tea experience. I can feel the potential here, I can see all the bills I'd be dropping here, but after a few mins with a drink I was like fuck this shit. 

The royal #9 had a super unique flavour. A black milk tea infused with a fresh blueberry taste. Honestly it was blessed. However after half ur drink that OHMYGOD mouthgasm turns into and *sigh oh my god meh. The iron goddess had a robust oolong flavour that hits you like how Ricegum took a cheap(fake) shot at Fausey. The impact was there but again the end game was week 

The problem with The Alley is that out of the 4 drinks we got, all four tasted watered down. We picked up on that complex and deep flavours they wanted to get at. But in the end it tasted like fucking tap water and skim milk. The potential is there. However they need to realize that in order to keep their fan base, the need consistant quality all around."}
{"text":"Saw this crazy line up and found out a new BBT place opened up. 

The hype was crazy but I wasn't to crazy about the drinks. 

Nothing too special - all the teas are very similar with a HINT of something. 
What they specialize in is the hand crafted tapioca - chewy !
A lot of different  milk teas but missing out on the thicker smoothie type drinks.

But with so many other great bubble tea places nearby this one is double the price.  
If i was ballin, maybe I'd go here often if I liked milk teas. 

The decor and ambiance is absolutely beautiful except for the size of the shop.  Seats about 10 and the shop it self is very narrow - not much room to move about."}
{"text":"I always order the Iron Goddess, perfect strong tea  taste.  This place has very good customer service. Come and get a dose of your BBT during non peak hours to avoid the long line up. One of the best tea places in the plaza. 

The stamp card is a good incentive especially for those who come often. I love the chic decor, although the sitting area is not as big as Cha Time. This is one of my go to places for BBT"}
{"text":"A new alley on the block!  The Alley is making its way into Canada from Taiwan; and the first Alley is here in Markham.  The dcor is cool!  It's rustic industrial style with dimmed lighting; super cozy.  Their tea is aromatic.  I have their Signature Royal No. 9 milk tea; and Sweet Dew Oolong and Lemon green tea to go.  Signature Royal No. 9 is smooth and milky. Sweet Dew Oolong is naturally sweet and without bitterness.  I have been to bubble tea joints for years without tasting the naked brew; and the rounded richness of the tea definitely surprised me unexpectedly.  The richness lingers a while in my taste buds; fantastic iced tea!  The Lemon green tea is a very refreshing drink.  The tea, fresh lime and sugarcane syrup are all well balanced!  Can't wait to return to try more of the menu.  Cheerful baristas; excellent service! Soft opening with 10% off.  Come here and have bubble tea in The Alley's way : )"}
{"text":"Cute little cafe with delicious tea.  Many new kind/flavors of tea available and the ambience is great here. It's a tiny little cafe with a bit of character. This place has a vibe that each cup/glass of tea is finely blended together with creativity and quality.  A surprising gem in the area. Not your ordinary tea shop.  Many people taking selfie and photos here."}
{"text":"1 star for decor and mood
1 star for menu design
1 drink quality

The mood is the relax vibes in which is a good place to hang out with few friends for a drink. I went in during afternoon that, im sure it will look dim during night time which I like.

The menu was about right. They have enough variety to offer to their customer and they seems to focus more on the northern light or the sunrise drink which is beautifully crafted. Price is about average ranging from 5$-7.50$ approx. I got to try the garden milk tea and my friend order passion fruit tea and the northern light as they did not have the sunrise one. Garden milk tea is nothing too special as it taste like any other milk tea, however it has Oreo on the top and a tiny mint leaf which I would give it a good presentation.... I didn't get to sip on the passion fruit but my friend seems to enjoy it as it wasn't too sweet.... I like the northern light one, it has nice presentation and the taste was good as I like sour drinks! The suggestion was to shake it before drinking it but was so beautiful to be ruined just by shaking it lol... over all, the experience was positive, I would recommend it if you haven't try this place. 

What took away the remaining of my stars was that this locale is quite small, so if u wanna hang out, better pray u find a table otherwise take out it is. 

According to review, it seems like they received friendly services, but for me, they weren't friendly enough, was just like what would u like with annoyed face, it could be just bad day. 

Parking was pretty good, pretty spacious. I would come back and then maybe update my review."}
{"text":"This place's royal number 9 milk tea is very very good. However, be aware if you ask for grass jelly they don't really give you a lot. Their garden black tea is great as well, Oreo flavour is not overpowering which can sometimes be. What would be amazing would be their royal 9 milk tea with the garden's oreo on top! I think I'll ask if I can do that next time. They have a stamp card, buy ten drinks get one free. Lastly the pricing is pretty comparable to anywhere around same with topping prices. Overall, great place!"}
{"text":"At the Alley, they have a very interesting selection of bubble tea that is slightly different from what you can expect from Destiny or Chatime of the sort. They say that for their signature milk tea, they use non-powder milk tea ingredients and you can taste the difference in style contrasting from your regular other bubble tea places. The Royal No. 9 was good and I'd recommend to try that if you ever get a chance to go there."}
{"text":"Definitely do not come if there is a line up - they are slow even with a short line up, so I'd imagine a long lineup to take extremely long. Other than this, the service is good as they always have samples and are willing to take the time to explain the different drinks to you.

I've tried several different milk teas here - 

Royal no.9 milk tea  - this has a slight hint of blueberry flavour, which makes it quite unique. Most of my friends seem to like this the best but I found it to taste generic with an added blueberry taste. I am a bit of a tea person so I like my teas a bit stronger. 

Iron goddess milk tea - this is my favourite tea (Iron Buddha oolong tea) so I didn't need any gimmick for it to be my favourite drink. I like that the distinct tea taste came across well and mellowed out with the milk/cream that they put in the drink. Overall, quite good for a bubble tea for someone who enjoys their Chinese tea!

Jasmine milk tea - I think this is the same as the Iron goddess milk tea except they used jasmine tea. The tea is quite fragrant, has a sweet aroma and is refreshing. I think the taste of jasmine comes across the bubble tea quite well. The only thing is I like Iron Buddha Oolong a lot better! 

I've yet to try the hand made tapioca as they only offer it during very limited times and hours but I'd love to try!"}
{"text":"My Order: Northern Lights (tastes like overpriced pop), Morning Sunshine, Garden Milk Tea (yum), Alley Trio Milk Tea (not bad) 

Pros
+ Drinks: great innovative and photogenic offerings
+ Social Media: its not hard to find a gem if they make their presence known :) 

Cons
- Lineup: to be expected"}
{"text":"Had the garden milk tea. Drinks are unique but the taste just wasn't that amazing.  Price is rather expensive"}
{"text":"Busy place with a tiny storefront. I went with the Classic Milk Tea, frankly because I got tired of asking the cashier what was in various vaguely-named teas. Descriptions on the menu boards would be immensely helpful. The Classic, predictably, is quite comparable to other franchises'  basic milk teas. Some of their drinks are very pretty, I'll give them that. Also I love their solemn stag mascot. Maybe I'll give it another try some time."}
{"text":"Bubble tea is great! Fresh take on variations of Milk Tea and very picture worthy! 


Pros: 
- Drinks: Drinks are great! Personal favourite is the Iron Goddess Milk Tea which is like a milk green tea but with a twist. Tapioca (when it is ready) is very chewy and not hard whatsoever. One topping that they have is purple rice, it's chewy and good. I really like that with a warm milk tea. 
Location: Great location as it's located amongst a bunch of other eateries! 
- Decor/Picture Worthy: The decor and drinks are so cute! I love how the decor of the store as it's low lit and has a nice vibe to the store. 

Cons: 
- Service: At times when I go, there are long wait times for an order. This is really discouraging because I've waited from 15-30 minutes for my order and 10-15 minutes in line. It's unfortunate because I like the drinks but the wait time is way to long. Also, maybe I am just unlucky but a lot of times when I've went late at night, they are out of tapioca. 
- Price: The prices here are higher at other places, although not by much but it is still fairly noticeable. I've paid about $6.50-7.00 for a drink which is higher then a lot of other places. I wish they charged same price for hot drinks as it's an extra $0.50. 
- Parking: If your going to go late at night, chances are you won't be able to find parking as there just isn't enough. Parking during the day is fine but just a heads up if your going at night and want to leave right away. 
-Seating: There is very limited seating so if you are going with a group of friends, chances are you won't be able to find a seat. 


Overall, I will be coming back. Even though it is pricier then other locations, I really love the Iron Goddess Milk Tea!"}
{"text":"Tried thier best seller which was the milk tea with a hint of blue berry flavour. The fresh made tapioca pearls were only avalable after 8:30pm which was disappointing. Large goes for $6. The inside has very limited seating and has poor ventilation which made it very hot and stuffy inside. Service was pretty good and they give you samples if you want to try the drink first. I don't think there is much different from other bbt places. If the fresh made pearls were available all day long it would be better."}
{"text":"Normally, this area is a bit far for me (I don't drive), but I heard a lot of hype and decided to come with a group. We came after dinner, and although there was a line, the wait wasn't too bad. The space was small and with the amount of people waiting inside, it was cramped! I don't recommend doing a sit-down because there were few seats and tables. The service was attentive; although there was a long line, the cashier took the time to explain the drinks we were asking about, and gave us a sample of the tea as well. The drinks were sealed with fancy matte black plastic, but weirdly, they were hard to puncture with the straws. Most of the drinks in our group spilled because of the plastic. Super annoying and messy. The drinks themselves were not phenomenal at all... Mediocre at best. I got the Royal No. 9 Fresh Milk Tea, and it was disappointing. If I were to go again I might get the drink without the fresh milk, but the flavours were lacking, the tapioca was a bit soft, and the tea flavour was missing (unlike the sample they gave us...). Overall, this place was underwhelming."}
{"text":"Move over Chatime!

Royal No. 9 - get it! It's so good!

I like how they are expanding. There's one close to my work downtown now which I am very happy about, but yet to visit.

Staff is nice. I enjoy my visits at the Commerce Gate location, not so much the Main St one (slowwwww).

Anyway, Royal No. 9 is the only one I can recommend cause I haven't branched out to try others. It's just TOO good not to get!"}
{"text":"Damn this place is wicked! Even though I only tried the Royal #9 milk tea which I assume is there flagship drink? Correct me if I am wrong. But it was so tasty!! 

I came on the day when they were still having there 2 day promo which was get 2 large drinks for $8.85. I got the Royal 9 with full sugar because the girl was telling me what kind of ingredients they put in what not, so what hell?! Let's try something new. First sip of the milk tea, it was pretty damn good. Most interesting thing is that even though they put in full sugar, it didn't taste at all sweet! 

I was pretty surprised as I never get full sugar for any of the bubble teas I get just because it usually comes out to be extremely sweet. I don't have that tolerance unfortunately. The Alley, promotes natural flavor bubble tea which means they do not use any powders or artificial ingredients and is strictly all natural and with legit tea ingredients. 

I personally, really like the taste and quality of the bubble teas. I had tried this other drink which tasted very much just like tea with full sugar added again but it didn't taste sweet either and only thing I could taste is the tea flavor. They also brew their own tapioca! and they have different flavors too! This place definitely brings bubble tea to another level, a more a quality level than compared to other shops. I suppose I have been spoiled by Chatime for so long until this place popped up. The price for these drinks are very competitive to other bbt shops as well, priced almost the same. Around $4.75 - $5 but you're getting a much better drink compared to other places. 

So it depends on your preference on what you like, for me I actually really like this place now more than the rest. I need to come back again to try more drinks. There is a huge list of drinks on their menu, so definitely no shortage of not being to try something new every time."}
{"text":"The teas are unique, strong, and pleasant. I haven't been anywhere with tea flavours quite like these.
I usually get a Jasmine Green Milk Tea or the Royal Number 9, both with a variety of toppings. 
The service here is excellent. Staff are friendly. It does get busy and they are sometimes short-staffed. The line can get very long. 
Like most BBT places, during the day and around dinnertime (5-7pm) the line is not bad, however later in the evening is when the line gets long. If you're impatient and want to try this place out, go during the day or during dinnertime to avoid the post-dinner bubble tea craze"}
{"text":"Amazing BBT! Certainly not like your chatime or coco or gongcha! It's like a starbucks bbt kind of feel! I've had a couple of the drinks and I would have to say my favorite is Iron goddess and Apple of my eye haha. I would like to try more drinks though as the name sounds interesting haha! A tiny place though and definitely can get really really packed. 
Plenty of parking though which is always a good thing and especially in this area! 
Definitely coming back here!"}
{"text":"Higher prices, average bubble tea, and nice cup design. That sums up my review. While I appreciate new bubble tea shops and trying new flavours and drinks,  I don't like paying for more when I'm getting the same product. Didn't feel like they have anything that's unique. ShareTea probably has more flavours on their menu and more of those colorful bottled tea series. I did like their royal milk tea with tapioca, I thought it was pretty good. But I'm just not a fan of paying more. Some of their other fruit teas were very watery and not very fruity at all."}
{"text":"First time here. Staff are very friendly, even tho my friend was surprised seeing the northern lights and morning dawn drink would cost $7.50... but the staff took their time to explain it to her what was in the drinks and stuff. I ordered a royal no. 9 milk tea requested for less sugar and ice, for $5.65 w/ regular size. The milk tea taste very unique, you will know the uniqueness until you try it. Staff said it was the most popular drink so I went with that. Will definitely return again to try something new."}
{"text":"Garden Milk Tea is the best hot or cold. They sprinkle Oreo cookie crumbs on top of the milk tea and the flavours really compliment each other! Haven't tried many of the other drinks, but 5 stars for the Garden!"}
{"text":"Love the decor.  There is a lot of eclectic decorations which enhances the experience of enjoying drinks and conversations there.

I tried the Royal 9 milktea since they suggested as an alternative to Assam + a splash of milk.  The milk tea ok.  Got a good tea taste but not strong and I prefer it strong rather than a weaker tea taste with lots of milk.

Would I go back? Sure.  Definitely want to try other selections before I know for sure if it is a place to add to my list"}
{"text":"My favourite drink here is the milk black tea no. 9 or something similar to that. You can definitely taste the tea and not only the milk/sugar compared to other places. Their tapioca is also made in house which is a plus! They lose a star due to the taste of their advertised drink the lights (colourful drink), which tasted like cough syrup with alcohol to me."}
{"text":"3.5 stars for this cute bubble tea place! I feel like I may be able to give this place a higher rating when I try more drinks off of their menu since I have only tried their Royal #9 bubble tea and it was delicious! I really like the unique blueberry fusion with the milk tea for this drink and wish I had gotten the large to share with hubs instead of just the regular size! It had the right amount of sweetness and wasn't watery. Other friends have tried the Northern Lights drink here and said it was pretty for photos but didn't taste all that great. Looking forward to trying more drinks from here despite that!

The interior is small with only a few tables but I liked that it had more of a quiet coffee cafe type of vibe to it instead of the typical colourful interior and loud music that bubble tea places tend to have. Service was also friendly enough and efficient but there was also no line up when I came that time. Prices are slightly higher than the typical bubble tea place but I don't mind paying their higher prices for that delicious Royal #9 drink again!"}
{"text":"This tea place is so awesome...we love ever drink that we've ordered. Been here 4 nights straight since we've come to Toronto to visit. The drinks did take a little time to make but it's worth the wait."}
{"text":"I visited twice this weekend- very early Friday evening and again late Saturday afternoon.

Lemon honey tea with aloe- I couldn't taste any lemon in this drink, if there was any lemon or honey then it must have been masked by the intense amount of lime flavor. There was a lot of lime peel in this drink and I found it very weird, taste and texture wise. Not unpleasant but definitely not the lemon drink I wanted.

Royal no. 9 milk tea- I ordered this because it's the most popular but nothing indicated that this is blueberry flavored. The taste wasn't too artificial, but I did not find it pleasant. Had I known it was a fruit flavored milk tea, I would not have ordered it. Tea flavor was very weak.

During both visits, it felt like I had to wait longer than the usual wait time for bubble tea, even with only a few orders ahead of mine. The menu does seem to be slightly more expensive compared to other tea shops.  The lack of description on their menu is really annoying. I might try this place out again but with Coco and Chatime in the same plaza, I don't know why I'd come back. Overall, I don't really think their bubble teas are worth the extra long wait time and slightly more expensive price tag."}
{"text":"Besides the hipster branding and adorable deer motifs, I find it hard to say anything I enjoyed about the place. Their menu overhead and in front of you at the counter had competing prices, so you don't really have a clear idea of how much things are.
The drinks were not that great but quite overpriced.
I got the Oreo devil slush, tasted like a cheap chocolate slush with mix. The royal no.9 tea was acceptable, taste like a plain black tea, nothing special.
It was quite a disappointment since there aren't a lot of boutique bubble tea places that aren't a franchise of some Asian beverage giant. It's a shame that beside the beautiful branding, there's only products not worth coming back for."}
{"text":"I came back a second time on a Friday afternoon (4pm?) and they seemingly hired new staff.

I was not greeted by the person taking my order, was not offered any samples of the Royal No. 9 milk tea (which I wanted my mom to try as I was taking her there!). The staff was half-attentive to taking my order, got distracted and I had to repeat my order 3 times. 

I ordered two Royal No. 9 Milk Teas (large size) with Tapioca and it came up to just under $14. As someone who frequents Chatime and Coco (which I already find pricey)... $7 for a bubble tea is insane! On a side note, the menu has very creative names (ie. Penguin on ice, Apple of my eye) which do not have a description of what they are... so am I supposed to ask what each one consists of?.... I asked about the first and the guy did not seem to know.

After ordering, I had to squeeze my way out to the seating area, as the bar seating/pick up area was extremely congested with a handful of customers waiting for their order.

I waited over 20 minutes for my order in which I later did not receive any apology or thank you for your patronage in any way. My drink was consistent to the first time I had it, so that's a plus.

Would I come again? Probably not anymore... pricey, no rewards system, extremely slow service. I can't imagine what the wait times would be on a weekend night when they offer handmade flavoured tapioca!"}
{"text":"I get this place. It is bubbletea handcrafted and elevated to the level that mixology drinks are. I noticed a few things during the definitely-unanticipated-longer-waitine in line: 1) they measure their ingredients super precisely, they funnel ingredients into cups with great care to not mix layers 2) they are able to provide instructions on how best to enioy your drink for optimal flavour 3) presentstion is beautiful, and the quality and robustness of the tea flavour really shone through

We ordered: 

Garden milk tea (less ice, half sugar) with coffee jelly - contrary to another review I did not find this drink too creamy, although I'm one to like creaminess. The coffee jelly added another flavour profile to this drink that elevated it even more. Presentation was beautiful. 

Some kind of Tea with pineapple jelly (less ice, half sugar) - unfortunately I can't remember the name of this drink but I really tasted the robust flavour of tea.. the pineapple actually tasted like pineapple rather than the artificial pineapple jelly from other bbt places... It was not overly sweet and added a nice compliment to the tea flavour. 

I think the prices reflect the quality of the drinks well, and I would gladly come back.

TIP: they also have samples of their trio alley milk tea for you to try!"}
{"text":"Great bubble tea brewed fresh. No.9 milk tea has a great blueberry infused flavour that adds another level of flavour to milk tea. If you want something other than the ordinary Chatime or Coco this is the place to come.

The space is a bit small but very nicely designed with a brick wall and a few spaces to sit. Wait can be long at certain times but that's what it takes to make a great bbt!"}
{"text":"Similar price for bubble tea in general, two of us got Royal no.  9 milk tea and Citron soda. $5.50 each, the Royal 9 tastes like candy with regular sugar level; the Citron drink is only one can of Sprite with two teaspoon of Korean citrus mix with ALOT of ice to fill up the cup.  It looks refreshing but nah..."}
{"text":"They have the best bbt so far in Toronto, I like they give every drink a name so you will not bore by looking at the menu, also their bbt taste great. The only down side is pricy, but they provide high quality drinks so it's ok."}
{"text":"Gave it another go for a different drink - Brown sugar ginger milk tea. Really good and has a true ginger taste, very soothing for the throat and body especially for that time of the month of the girls. Will re-visit for the Brown sugar ginger milk tea, but I don't think i'll give them another chance for their No.9 Milk tea."}
{"text":"Grand opening today. More delicious teas in my belly! They were making their \"Deerioca\" today--handmade tapioca that comes in black sesame, strawberry and pineapple flavours. Unfortunately they aren't serving it until tomorrow, but their regular tapioca is just as delicious! I love their green tea with milk, although I stuck to my regular order of Royal Milk No.9 milk tea."}
{"text":"The alley opened up recently and I found out of about it through social media. There are 5 different bubble tea places in the plaza, so competition is stiff here. 

I went on a sunday afternoon and there was a line to the door. Probably about 10 people waiting in line. Their drinks are not the easiest to decipher as many of them have unique names that are often not descriptive of the drink itself, unlike other places where you can simply order a \"oolong milk tea\", this place has names like \"Royal No.9 milk tea\". 

I got a lemon honey tea with aloe. It was very refreshing on a summer day. It was very good, though there were lime bits in the drink. Which I thought was weird to eat lime peels, and also I didn't order a lime based drink...or so i thought. Despite this, the drink was very good and I would definitely get it again. 

Prices are similar to other BBT places, but based on their advertising many things including their tapioca are made in house. 

The wait is a bit long for those who are rushed for time. They definitely take more care in making the drinks and aren't pumping them out like their competitors. It took about 10+ minutes to get the drink and I watched them precisely measure portions. After watching them make it, I felt less angry of the wait. 

Overall, its a place I'd come back again, but only if i have the time to brave the wait."}
{"text":"Been an avid The Alley customer for over a year now and figured I'd pop in for a Royal No. 9 while I was at it. Though I was in line, cashier forgot about me so she didn't take my order until 5 minutes of waiting at the till. Offered me a sample of their matcha fresh milk (? New product) which was nice. 

Knocked off a star because they bumped up the price of their drink without updating the menu, so I didn't realize I paid more than I normally do until I got the receipt. Price came to $5.65 for a small drink which was completely over the top. 

Overall, taste is great but not worth the price point (definitely not coming back). Take my advice and head to coco or cha time for something just as good but more affordable, or pay an extra couple of bucks to get a full set meal from the surrounding cafs and restaurants."}
{"text":"I've been waiting for this place to open for a while now. Their Garden Milk tea is delicious. Going to try the Royal No. 9 Black Tea next time as others have recommended. Really nice decor too. Not your typical bubble-tea vibe."}
{"text":"They offer a variety of unique flavours. 
We ordered the royal #9 milk tea, the penguin on ice and the northern lights. 

Drinks took up to 30 mins to make even though they were not that busy. 

Tapioca tasted hard and old. Normally tapioca should be soft and chewy. But they were not. 

Personally didn't really like the flavours of the drinks too much. It wasn't as good as expected.  The royal #9 was not sweet enough even though we ordered extra sweet. The penguin on ice was cool since it was black on top and white on the bottom but it was too sweet when we ordered regular sugar. The northern lights just did not fit my liking. It has a very unique taste to it."}
{"text":"To start off, there are a bunch of bubble tea places near here. The good part, this place has creative and unique drinks with a very friendly staff.

The ambience of this place is one that reminds of a nice first date. You would most likely bring your significant other to this cafe looking bubble tea shop.

The drinks are refreshing and creative (they have a garden bubble tea, personally I call it the dirt in a cup). They use special tea blends that produce nice aftertastes such as blueberries and seem to produce very unique tastes that differ from the normal milk tea."}
{"text":"A new bubble tea addition to the Commerce Gate plaza and will probably be a pretty good competitor among all the choices.

I tried the Royal No 9 milk tea which is a black tea base with milk and a hint of blueberry. Flavour is good and not too sweet (with no adjustments to sugar level). Their teas are brewed with real leaves and not powder which is a plus.

Location is very small and has a few tables to sit.

Staff were friendly and fully explained what was in the drinks we inquired about. Will definitely be back."}
{"text":"bubble tea?
not too sweet, not creamy, fresh green tea flavor. After finish whole cup you won't feel \"heavy \".

Environment:
Small place, not a good place for hangout over 5 person. 

Best bubble tea shop Logo ever! !"}
{"text":"Service was really friendly! Made a bunch of jokes. Quiet and very small shop. In love with the decor. I ordered the Garden Tea, tapioca was great but wasn't a fan of the topping mixed with the milk tea. (4/5) Wish I just got the plain milk tea! My boyfriend got Northern Lights and loved it. Will definitely come back!"}
{"text":"The bubble tea was decent. I came on a Wednesday night with a huge line up to only get to the front and find out they ran out of every topping. And the special tapioca is only Friday and Saturday nights after 8pm. This place is definitely a thumbs down for me. I will not be coming back!

They are very cheap about everything, they measure everything to the T, therefore the service is super slow."}
{"text":"Amazing bubble tea. The deerioca is so good. The staff are really friendly too even though it can get pretty busy."}
{"text":"I make it my mission to try milk tea at every tea place I go to. I've only tried milk teas at Chatime, Coco's, Preso tea, real fruit bubble tea and Gama cafe. Not too many but I loved the Alley's garden tea! Not only is everything they make from scratch AND fresh, it's delicious, super aesthetically pleasing and at a very justifiable price. They make their tapioca pearls on site I believe(?) and I noticed the large drink I ordered was noticeably heavier than other places with similar sizes. Perhaps their tapioca is more dense? Whatever it is, it is honest to goodness great milk tea! Highly recommend! Doesn't hurt that it's so cute and in a great location downtown!"}
{"text":"First time having the no9 milk tea and it's really good! Hint of blueberries which compliments the tea really well. Small place, not much room to sit but good place to grab and go! $6 large"}
{"text":"As much as i like drinks from here, my last visit at this location was terrible. Ive been here before whether the store was super busy or empty. But it was nothing like my last visit was on a Sunday afternoon. The line was all the way at the door. The three tables they had were all filled up on the two sides of the line. The store was so hot and stuffy i couldnt even breathe. The line up was about 20mins, took another 25mins for my drink to be served to us. 45 mins suffocating in a store for a cup of bbt. Not worth it no matter how good it is..... 
i had to walk out of the store to take a breather. The tiny store was packed with people and it def didnt feel like there was ac. Staff looked reli busy but drinks were still served slow af. On top of that, a staff decided to take a break while the floor was that busy. That left them with one on cash and two on drinks. 
On summer days like this, i do expect the store to be busy. But this is prob one of my worst experiences."}
{"text":"Went there after dinner it was surprisingly quiet there..nice environment to spend some quality time with friends..we all ordered the new drinks they have with taro tapioca and red bean..couldn't really taste out taro from that drink but it was pretty good overall :)"}
{"text":"Ordered the garden milk tea with tapioca. Also sampled a bit of their Jasmine Green Milk Tea. Honestly, overall experience I would say it's just 'OK'. The hype about this place was maybe because of the appearance, and the strong upfront taste. I had ordered a large drink, and my friend ordered the Trio. Both really good, but then we both realized that after halfway through the drink, the taste grew bland, and it tasted more like just ... milk. Though I still want to try other drinks, I wasn't an overall fan of both milk teas ordered. 

On the up side, the service was excellent. Explained the bubble teas I asked about very well. Friendly service. I sorta find it weird that they personally tasted the tapioca with a shot glass before making the drink (Quality control, yes), but from the other side of the counter, it looked like they weren't all that confident with the quality of their tapioca being served at the time. 

Verdict - I would go back and try something else that's not milk tea. Great service. If you're looking for flavourful bubble tea, I would just stick with the usual Chatime or Coco just around the corner."}
{"text":"Long wait on a Saturday night. Pretty sure it's like this often until it starts to die down which it probably won't. If you haven't tried it yet - you should. 

The service is good. She offered me a sample of the Royal number 9 milk tea because I ordered it and it was good 

the store itself is small but still has room for small sitting area 

it's right next to Chatime.. so obvs that's competition, along with the other bbt stores but I'd choose the alley now that I've tried it once. & if you're ever debating to go to which go to the alley. 

the tapioca is chewy, and the grass jelly is good 

it's not too sweet or bitter and the taste of the tea is strong 

the sweet dew oolong was good too. very refreshing :) 

I'll be back!!"}
{"text":"4.5 is my rating.
Seems like more people are finding out about this amazing place, I had to wait in line 30 mins for my drink. 

The garden milk tea is made with assam black tea, with milk, tapioca is included and topped with oreo crumbs. The best part is they pulled a leaf off their live plant and placed it in the the oreo crumbs so it looks like a garden. So jokes. Love the drink, it tastes slightly creamy and goes well with oreo crumbs. This place handcrafts their tapioca, which I personally think is amazing. The tapioca are slightly smaller than other places, but the texture is softer and just as chewy. Their bubble tea is slightly more expensive than other places but they use better tea leaves and with handmade toppings, its well worth it.

The royal 9 milk tea is good too. The tea is brewed with blueberries so it has a slight blueberry taste added to the milk tea which is nice.

The wintermelon punch is premixed so more on the sweeter end. Has a strong wintermelon taste along with its fruitiness."}
{"text":"Not my cup of tea. Unfortunately I didn't enjoy their bubble tea as much as other Yelpers did.

First off, I love the interior & vibe of this place ! It's a nice place to chill & have a cup of bbt. They were having the Black x White promo going on - 2 drinks for $8.85. But not just any drink though, it has to be from their Black x White menu.

The staff is super friendly and offered a sample of their Green Milk Tea. If you like Green Tea, this was amaaaazing. I highly recommend you get it. It's too bad it wasn't part of their promo :( Anyways I decided to not get that (wrong move)! I went with their Royal No. 9 Milk Tea with Tapioca & Sweet Dew Oolong with Tapioca. Here is where it went downhill. The staff was saying a bunch of mumble jumble that I couldn't understand :S ... Something about they don't have milk but is fresh milk ok. She asked if I wanted milk with my Sweet Dew Oolong then she said you can't add milk to it. I was sooo confused. I just kept saying ok. 

The Royal No 9 is a hit or miss drink. You either like it or you hate it. The hint of blueberry taste was ok for the first sip then it tasted really weird. I got reg sugar & more ice but it was waay too sweet still. On top of that, the homemade tapioca (which was good) had a sweetness from within. 

Sweet Dew Oolong with reg sugar & tapioca was too bitter for my liking. I love Oolong but the bitterness of it mixed with the sweetish tapioca was too weird of a combo for me. 

I ended up dumping both bbt & wished I ordered the Green Milk Tea instead because that drink was actually pretty good. Did I mention that their prices are slightly higher than Chatime & other bbt places?"}
{"text":"My second visit to The Alley. Ordered the royal 9 drink large half sugar no ice, $6 I loved the taste and the flavour... very similar to the bubble teas I had in Taiwan. The guy serving the drink was super friendly and answered all my questions. There is a small area to sit down but can get a bit crowded when it's busy, free wifi as well. 

It is a bit pricey but will visit once in a while when I am in that plaza for a hair cut! :)."}
{"text":"This is THE PLACE TO GO to for milk tea. Their bubble teas are made with quality tea leaves, which brings out the rich aroma in every sip. My absolute favorite is their ROYAL #9, it has a hint of blueberry flavor in it. 
I also get the chance to try their HANDMADE tapioca or they called it \"Deerioca\". The tapiocas are made from scratch every weekend and available for a VERY limited time. These tapiocas are indeed better than regular ones as they have better texture and each little balls are shaped differently, therefore there's no lie that it is homemade.

However, the only downside I would say about this place is the price. The price is a little pricey compare to other well-known bubble tea places. But I will still go with the excuse of \"treating myself\" to make myself feel better of paying such pricey bubble tea."}
{"text":"I don't need to say anything. Best bbt place. Just go.

Royal #9 and the Trio are my favourites. The theme just looks bomb. And that deer logo is just so tough. Come. Here. LOL"}
{"text":"They have one of the best bubble teas! My favourite and go to is the Royal Tea No.9. I love how flavourful and fruit the blueberry milk tea is. Usually get it with slight sugar as I can taste the tea better."}
{"text":"I've been stalking this place on instagram and I was so excited to visit and try their bubble teas! Like many Yelpers have noted, this place is pretty hipster. The decor is beautiful; it's got a quite mysterious yet relaxing feel to it. However, it was a lot smaller than I had expected. I believe there's only 4 small tables and a long one with tall stools near the window and that's about it. 

We ordered the Sweet Dew Oolong, Royal Milk Tea and Apple of My Eye as many Yelpers have recommended. 

- Sweet Dew Oolong: From the sounds of it, I thought it was Oolong tea mixed with Honey dew however, that was not the case. Prior to ordering, they allow you to get a scent of what this drink might taste like. After smelling these herbs in a tiny jar, it had a funky scent at first - kind of sour with a strong Oolong scent however, upon tasting the drink it didn't taste like that at all. I don't like my drinks too sweet so, I ordered it with less sugar and also less ice. I found nothing really special about this drink. It literally tasted like Oolong tea with ice. It was however, refreshing on a hot summer day and I didn't really mind iit. If you prefer your drink on the sweeter side then definitely order it with regular sugar level.

- Royal Milk Tea: I tried a sip from my friend and there was definitely a hint of blueberry flavour at the end. Again, nothing really outstanding about the milk tea aside from the blueberry aftertaste. The tea taste is definitely not as strong compared to Chatime's and the blueberry aftertaste kind of threw me off. Not sure if I like my milk tea tasting fruity...

- Apple of My Eye: Again, tried a sip from my friend and this is probably my favourite one out of the three. Very refreshing! It reminds me of an apple's Somersby. Love the aloe and toppings in it. 

Quite disappointed that they ran out of tapioca and it'd be a 10 min wait.. Hopefully, I will be back in the area for their hand-crafted tapioca!"}
{"text":"THIS is what other chain stores of The Alley need to follow!
The cashier greeted me with a geniune smile and offered their tea of the day, and gave geniune reccommendations and took time to explain their specialty drinks so I could pick the exact drink I wanted. (even though, I always end up getting the same 2 drinks, haha) 

When offering a sample, the lid of the container was crooked and he ended up spilling some out of the crack but made sure to clean it with care, not just carelessly wiping away. Staff didn't give over-the-top service, which I definitely appreciate. They gave a casual tone but still very polite and servicing. The closing staff of Monday, May 28th (3 guys i believe), were, in my eyes, ideal to creating a comforting atmosphere where I felt welcome. You guys just earned a loyal customer!

All in all, drinks were perfect, I left with the most satisfied and fulfilled feeling. Def wasn't a mistake to go here rather than the other 5 bubble tea stores in the plaza."}
{"text":"Love the White Peach Oolong here! It's odd that my favourite drink from a bubble tea place is a hot drink, but for this drink in particular I have tried both hot and iced, and the flavour is so much more intense when it's hot. This bubble tea shop has more of a hipster vibe with their darker wooden decor and their deer logo, but it is actually another Taiwanese chain that just happens to have only one location in Toronto. Their most popular drinks seem to be the Royal #9 milk tea and the Garden milk tea, which are both good but nothing amazing. I do like the selection here in general more than the other chains, so 4 stars."}
{"text":"3.5 Star - 3 star for the drinks + 0.5 star for the service

The Alley is a little dark but clean. The people working here is friendly and enthusiastic. They sincerely wanting you to have a great experience and enjoy their drinks.

I was offered a sample of Royal #9 Milk Tea (Half Sweet). The tea was aromatic but a little watery milky and sweet for my taste. The Sweet Dew Oolong ???? (Less Sweet) though is something I enjoyed more. A hint of vanilla aroma and a light taste of oolong tea.

The Alley does have a lot of potential and I like their different varieties of drinks. I definitely would be back to try out other drinks. 

Commerce Gate now with 5 tea joints feels like the plaza of Taiwanese BBT. Welcome The Alley to the battle ground!"}
{"text":"Talk about aesthetics - this place has me going back cause lord knows a bougie person like me can't get enough of that decor. Asides from being Instagram worthy, The Alley has the community hooked on their extensive menu. They have got so many different flavours that going once is just not enough. It's a good thing they offer samples though, so the next time you come you won't spend 30 minutes studying the menu and being indecisive. 

We all know places like this can get busy at times, but it's super refreshing to see how the staff takes time to converse with you and explain the vast menu. It's also great to see how the space itself is never left dirty no matter how busy they get, specially since it's small and can get messy fast. 

I know a lot of people go to try their hyped up bottled drinks (The Northern Lights and Morning Dawn), but I highly recommend checking out the menu thoroughly so you see all your options before making a decision. My personal go to is the Hojicha Latte cause it warms me up my heart, soul, and taste buds. I usually don't get any toppings with my cold drinks, but because The Alley makes their own tapioca I can't look past the fresh flavour and always end up giving in. 

I've grown to become very fond of The Alley. I can't wait to see them expand in our community and bless our taste buds!!!"}
{"text":"Not a good experience here, we order 2 milk tea one kiwi slash and it took us 15mins to wait,but the line is not long. The milk tea taste strange, for me is just a cup of milk which can buy everywhere and add some tea. Compare to chatime and sharetea or coco this one is awful! Never go back again!"}
{"text":"Agreed with Jennifer K's review below - good drinks, really friendly and nice service. The place is a bit dark and there is very limited seating, so it's good for a weekday stop if you are one of those blessed ppl have weekdays off ;), or for takeout. I got the Royal No 9 (I think I totally butchered that name) & my companion got this apple cider vinegar wih honey slushy drink. Royal No 9 was great with half sugar and half ice and the apple slush was decent."}
{"text":"Unique taste of its own. Their signature bubble tea Royal No.9, has a after taste of blue berry. The garden bubble tea (Oreo) is my favourite."}
{"text":"This is a review more so to warn fellow Yelpers about my experience.  It wasn't a horrible experience, but definitely not one that I want others to have.

I arrived at about 9:30 PM on a Saturday night and there was a long line going out the door.  We probably waited 25-30 minutes for the line and our order.  The decor was cute with references to Harry Potter such as the subtle link to diagon alley (da symbol on the drink) and the Horcrux of the deer was interesting.

We were offered a sample of the Royal No. 9 milk tea, which was actually very good. The hint of blueberry taste is very refreshing and really makes it one of my favourite milk teas that I have tried.  However, given that it's Saturday, it would be unfortunate not to try the Black Sesame Deerioca (hand-crafted tapiocas) that they offer only at this time.  I was told that you have to order the Jasmine Milk Tea for the Deerioca because it doesn't go with any other drink.  And so, I did.  It was expensive for a small size (more than $7 after tax).

So I got the drink and very excited to try it.  The Jasmine Tea was okay, pretty fragrant - but the Royal No. 9 was miles better.  The tapioca though - while it had a decent taste of black sesame - the texture was not what I expected.  It was more doughy than chewy.  I would have much preferred my friend's No 9 Milk Tea with their normal tapioca.  The texture is definitely not what I was expecting and was quite put off by it.  

I was peeved that the Deerioca - their major selling point - was not able to deliver and made me choose an inferior drink compared to their other options."}
{"text":"It's next to Chatime, but it's quite different. The taste is different, the ambiance is different, and the prices are different too.

I first came in and the lady kindly offered me a free sample of their No. 9 Royal Milk Tea and it was GOOD. I was SO surprised by how different it tasted from Chatime (which I think has a more burnt undertone to its taste). The Royal Milk Tea, in the best words I can describe, is very elegant and smooth. Imagine the spinning porcelain ball in one of those asian fountain things...it kind of reminds me of that!

They have a special promotion going on where you can buy one large drink  from the Black menu and one large drink from the White menu for under $10 (excluding tapioca). If you include tapioca, it's around $11.50.

My friend ordered the Royal Milk Tea and I opted for the Sweet Oolong Tea. Both items were in the Top 5 most popular. The Sweet Oolong Tea was really good, but it was just too sweet for me. The lady lets you smell the tea beforehand to get a gist of its taste. Would highly recommend 30% sugar instead of regular sugar, since there's a lot of vanilla blended into the tea mix which adds an element of sweetness.

The place is pretty compact, but it's very home-y and traditional. Reminds me of the outdoors. 

TLDR: give this place a try! If you don't like it, there's 483290428930 other bubble tea places nearby."}
{"text":"There's already a lot of competition for bubble tea at Commerce Gate. After reading reviews and seeing photos from The Alley, I decided to come here on a Tuesday. The restaurant drops subtle hints at Harry Potter -- the \"da\" (Diagon Alley) stamps on stamp cards and the deer (Harry's patronus) motif. I enjoyed reading Harry Potter and I wanted to try something different.

The restaurant is tiny, with only about 3 tables, so don't expect to find a spot when it's busy. For a Tuesday afternoon, this place was busy! The drinks don't come with photos or descriptive names, so I kept having to ask what's in each drink. I ended up getting a Trio, which is their traditional milk tea with tapioca, aloe, and jelly. It took a while since the staff was preparing all of the drinks, not pre-prepared like Chatime. I really liked the Trio. It had a nice flavor and I enjoyed the aloe and jelly."}
{"text":"I came here to try out the hype of the Alley. I saw lots of pictures on instagram and lots of good reviews from them that I felt I had to try it out. 

I got the royal 9 milk tea (their #1 recommendation), and I must say, it didn't meet my expectations. The milk tea was way off. It was too milky, that it overpowered the tea flavor. I didn't like the taste of it either. For some reason, it tasted like perfume. Not the usual milk tea I like. The tapioca was a bit too soft for my tasting too. Seemed overcooked.

Overall, there are so many other bbt places that I wouldn't choose to come back here unless a friend really wanted to come."}
{"text":"The interior is dark and hipster like. Only had 3 tables so not good for big groups to sit down and enjoy your drink. Today I came in at after lunch and there was no lineup. When I walked in the girl at the cash was super nice and helpful. This first impression and experience I received when I entered this place was different then other places. She offered me a sample of their most poplar tea the #9 milk tea which really did have a hint of blueberry in it. She also explained the drinks, let me smell their tea leaves and offered recommendations. I noticed that these drinks are a bit more expensive then other tea shops. There was only 1 person ahead of me and it took 10 mins from when I ordered my drink to when I got it. Can't imagine how long it would take during a rush. I got the sweet dew oolong drink with less sugar and ice with egg pudding. I liked that they offered options on the amounts of sugar and ice we want. My drink had a very strong tea flavour but other then that it wasn't that special that I would go out of my way to come here. I recommend you to get at least half sugar."}
{"text":"Not worth the wait. 
The drinks took up to 40minutes to make. 
I ordered a royal milk tea with extra sugar but it came regular sugar level. 
The tapioca was hard and taste old. Not the regular soft and chewy tapioca."}
{"text":"Another bubble tea place in this plaza. It's located a few doors down from Chatime. I decided to give it a try as many have rave about their bubble teas and tapioca. 
First of all, the shop is very TINY. Nice decor, however, for the price that they are charging , I would expect some seating areas to hang out with friends. They only have about two small tables. 
I did enjoy the Royal milk tea, very good flavour. I didn't care that much for their tapioca though, not that great. Jellies on the other hand were quite delicious. 

Would I go back? Maybe if there's no line up. Not worth waiting 30-45min for IMO"}
{"text":"3/5 because the prices are more $$ than other places in the area. They do have really creative drinks and great presentation which is perf for the insta, but other than that I think the tea is okay. I'm willing to go back and try a different drink just to see if it was the particular milk tea I had that was off. I personally didn't find anything spectacular or special about this place. It's also a little small with limited seating. I prefer bbt places that have enough space so I can come with a laptop and work but I can see that being a problem here."}
{"text":"The classic milk  tea is one of the best one I've had in Toronto. They really need to speed up the process when there are 10 ppl waiting, the cashier ask each customer if they want to try out the tea and explain each tea. Are you serious??? I get they want a great customer service but it seems like they actually want to slow down the flow on purpose so the place always looks crowded. I probably won't come here on a weekend."}
{"text":"The Alley is an urban, hipster, woodsy themed bubble tea place that is refreshing visually from the ChaTime, Coco, and TenRens that are literally two steps away. The problem? It's just not my cup of bubble tea. 

Interior is small. You have to enter one way and will probably exit through the end of the store into a hallway. There's only about 3 tables. If you manage to nab a seat, it's definitely a cute place to just relax and study. The decor is very sleek, on theme and not cheap looking. 

Service was quite friendly, albeit slow. The front girl was cashing out, labelling, giving out samples, but also pouring the toppings and handing out the drinks as well. Therefore orders came in very slowly and we were slow to receive our drink which was just sitting on the counter for 2 minutes before I asked her if she could give it to us. 

The main factor: The bubble tea... It's... Different. It's a peculiar taste. I love the roasted milk tea at Chatime and love It at Coco as well. In my opinion it was watery and not silky smooth like CT. It was an ok bubble tea but what bothered me was that it was more expensive too. I had to add tapioca and my drink came out to $7 which is kind of ridiculous for a liquid. 

3/5. Love the Alley for the decor, but I would rather take my money to chatime a few doors down for better Bubbletea."}
{"text":"One of my new favourite places for drinks. I've came here a few times over the past 2-3 months and the service speed has been consistently fast every time. I normally come Friday nights and there is usually a line but the line moves fast and drinks are made according to your order. Prices are similar to most bubble tea shops."}
{"text":"I love walking into The Alley because the decor sets it apart from other bubble tea shops. It also makes a great background for photos. I've tried a handful of items from the menu and I feel that I can finally give The Alley a proper review.

It's not an Alley review if I don't mention the Royal No. 9. I was told that this drink has a hint of blueberry as it's made with blueberry tea. I thought this would taste weird but it was actually really good. 

I wanted to try the Garden Milk Tea mostly for the presentation. How cute is the little leaf?! Unfortunately when I got this, there was no leaf. Apparently the plant died : (. The actual taste of the milk tea was still good with less sugar. I mixed the drink with the Oreo (the dirt/soil) but I think this is purely for aesthetics as it doesn't add any special taste to it : P. 

Be sure to order the Lime Honey with Aloe drink on a hot summer day. This drink is probably my favourite for the hot weather because it's so refreshing. The honey and citrus taste balance out perfectly. The only thing I didn't like about it was that there are bits of lime skin in it. It looks great for the pics ; ) but in reality I was spitting out lime peel with almost every other sip (quite inconvenient, actually). I don't suggest swallowing it as the pieces aren't cut small enough and it's also very bitter if you bite into it. I actually wondered if that was a mistake! Haha. I would still order it again though.

If you're looking for a warm and toasty drink, the Brown Sugar Ginger Roasted Milk Tea is another good choice. The ginger was stronger than I expected but the sugar evens it out. I got this half sweetened but I would actually opt for less sweetened next time (and I'm someone that usually puts a lot of sugar in milk tea).

I normally don't eat tapioca from any bubble tea place but their housemade tapioca is actually really good. It's not overly sweet and has the perfect amount of chewiness to it."}
{"text":"My very first visit didn't go too well, maybe because I just didn't like the drink (trio milk tea). But after visiting The Alley on several occasions, I'd have to say, it's great and it can't go wrong! 
It offers a variety of unique tea flavours (iron goddess, Assam, etc.) unlike other bubble tea places that stick to just a basic milk tea!"}
{"text":"Usually I'm not a huge fan of milk tea unless it's cut with coffee. However I can honestly say I enjoyed the the royal no. 9 milk tea. The blueberry  really gives it a kick and you still get that tea flavour from the drink but it's not as strong as I was expecting. I also tried the iron goddess milk tea is a really creamy tea flavour that is also enjoyable. 

The staff are friendly and help you decide by having you try the samples of tea or smelling the tea leaves to get a sense of what the flavours will taste like. I found it helpful that they offered to get you something you like. I found this very helpful as I normally don't have this type of drink.

The place itself has a few seats inside and has a cabin feel to it with the paper deer head on the wall. 

Overall had a pleasant experience and will be back"}
{"text":"I have seen the light with the Royal No. 9. I was wrong. So wrong. The trick to avoid the blandness is to order it WARM. That's right folks. The ice in a cold Royal No. 9 just dulls the blueberry aftertaste entirely, but if you have it warm, you can taste and smell everything this drink has to offer. That is my new favourite drink here, and I will definitely be back for more. 

Their promotion for Morning Dawn and Northern Lights was also interesting. I'm not sure if that's still going on, but their Morning Dawn was very pleasant (they take 10 minutes to make the drink though). The aesthetic though! In the end, you have to shake it to get the desired taste, so that aesthetic goes away."}
{"text":"While expensive, really good bubble tea! The customer service is great, as long as they can actually speak English well enough. My favourite thing to order is \"the garden.\" They also have a stamp card, so you get one free bubble tea after you buy 10."}
