{"text":"Ok we were in AZ visiting our kids and stopped in for the free wings on Thursday night, that's right you get 6 free wings with the purchase of a drink. Don't order water, it's $5!! The wings were pretty good. On Sunday they have all the football games on and a bloody Mary bar!! Seriously loved that. We love the Packer's and apparently the owner does too because when they got a touchdown, bottle beer was $2. Fun atmosphere. Only other food I had besides the wings was the onion rings, they  were awesome. Oh, all ages too not just the retired clan. Check it out, it's fun!"}
{"text":"This is a great sports bar and grill. The food and drinks are excellent and very reasonably priced. The bar and waitress staff are super friendly and very attentive to our needs. (Especially Mark, Chelsea and Christa) Great place to watch football or any of your favorite sports on the many TV sets. People there are also so friendly and we have made many friends there in the past few years."}
{"text":"Comfortable, food is great, Mark rocks! I am not a nighttime customer, so no idea what the evenings are like. I'm probably in bed by then. OTB available, restrooms have always been clean."}
{"text":"My buddy took me down here the other day to catch a game and have a few beers. Once our first pitcher was finished, we were out the door. Customer service lacks to the extent that I would have been better off getting my own beer and ringing myself up.

First, you are required to seat yourself (not really a big deal). 

Second, the waitress we got (she has braces) asked what we'd like to drink. I ask, \"What do you have on tap?\" She replied, \"What are you looking for?\" I replied, \"Nothing in particular. I just want to know you have.\" Her response, \"We have a lot of beer.\" We settled on a pitcher of domestic instead of continuing with the rhetorical conversation. 

Third, we couldn't decide on what food we wanted. The boneless wings come by the pound, so I asked about how many wings came in a basket. Apparently the answer is \"more than one.\" When we decided we didn't want any food, this seemed to make the waitress even madder than she already appeared.

Lastly, after finishing our pitcher, we asked for the tab. The waitress (again she has braces) went and grabbed the ticket, placed it in the folder, and walked by our table and proceeded to toss it towards me without saying a word. It slid across the short end of the table and hit my glass (which luckily did not spill). I promptly placed my credit card in and waited for her to return, where I handed her the folder. Again, she ran the credit card, got the receipts, and threw the folder back across the table at me. There was no eye contact or any \"Thank you for stopping by\" comment to be had. She literally threw the folder with the receipt in it at me and walked away. 

All-in-all: Service like this is the reason that people do not return. I gave Brookside a try and I will never be back. The customer service is about as rude as it gets. A smile or \"Thank you\" would do wonders for this place. My advice would be to skip this place entirely and hit up Buffalo Wild Wings."}
{"text":"Moved here from cali been trying a few spots out with the wife been to a few places in Peoria and Glendale decided to try Surprise, this place will definitely be our spot to come eat and drink food was good appetizers were amazing. Staff was awesome first couple time we sat at the bar forgot the gentleman name very friendly, our server April was amazing super friendly and she was fast didn't wait long for food or drinks. This will be our go to spot."}
{"text":"I came here for dinner. Since, I was not super hungry, I order the apple salad. The salad was delicious. The reason I am giving it 3 stars is because of the price of the salad for what I received. I get more salad from Wendy's."}
{"text":"The food is pretty good but not too fond of the waitstaff. Most were snooty and unfriendly until we had Nikki, who was awesome, sweet, and had a bubbly personality. Will definitely try it again to give em the benefit of the doubt and hope for better service next time."}
{"text":"Wow-  came here on a Saturday night.  Wish I stayed home.  Place was dead and music was just ok.  I people watched ( about 6 on the dance floor) not the place to be on the weekends.

If you want a good spot with music and more people I say take a drive outside of Surprise."}
{"text":"The bartenders here, including the \"manager\" Chris, are EXTREMELY rude and disrespectful! They used very derogatory words towards us, which was completely unnecessary. They are very unprofessional and do not care about losing customers. I suppose this explains why the entire bar was DEAD on a Friday night. The DJ was awful also. The only people who get treated well at this bar have that \"drunk/entitled\" attitude, and must be friends with the staff. Stay away from this establishment if you want to enjoy some good music, dance, and have a good time. Luckily, this isn't the only bar in Surprise!"}
{"text":"He/she said the rain won't leave
And the pain won't ease
And the sun don't wanna shine
And there's something in the bottom of this drink I just got
And it don't look like a worm to me

I got a bug in my margarita
Seems bad luck won't leave me alone
I got a man/woman I'm tryin' to drink away
And I got a long, long way to go
Yeah, I got a long, long way to go

Lyrics from Alan Jackson's song 'Long Way To Go'

Just stopped in for a drink. Not much in the mood for anything or anyone. Woke up and stopped here on the way to the gas station. Nice staff. Clean establishment. OK for a person like me that simply wants one drink then to move along. Nothing bad to say."}
{"text":"I've only come here about 5 times and I'm so impressed with this place. Mostly the staff. Everyone has been so friendly! I walked in on my 3rd visit and the bartender John already knew what drink I wanted. I left my iPad at the bar and realized I few days later I didn't have it. I used my find iPad app and realized it was here. When I walked in, john had it ready and said, we fully charged it for you:) Danielle has also been a great hostess. Your all doing a great job and it makes me want to continue to come back. Thank you! The food is also fantastic."}
{"text":"This place was close for an out of towner after a spring training game.   So disappointing .... Favorite of the waitress was the pastrami sandwich and it was just short of being inedible.   The bread was hard , pastrami in chunks and over cooked.  Burger was decent and the fish and chips ok but the size of an app.  The cheese sticks were straight out of a box served on a huge plate and looked as though someone had eaten half the  serving before being brought to our table.  Never again and would never recommend !"}
{"text":"Ive been coming here for years and its definitely had its up and downs but I come here for decent price drinks and good music. Dj paulie is awesome and will always take suggestions on what to play if u want to hear something! Some of my friends don't like it here because it can get \"thuggish\"but o well, at least I can people watch"}
{"text":"I love the Brookside 2... Staff is excellent... Food is consistent. It's A+ bar food. Mark, the daytime bartender is a true professional. He is there to work... You can barely get to the bottom of your drink before Mark has another on the way... The one thing that NOBODY does as well as Brookside... Draft beer... You haven't had a draft beer until you have had it at Brookside... It is hands down the coldest beer in town... Not even close!! Very impressive!"}
{"text":"What's wrong with the DJ? DJ E tripping. My teenage daughter at would at least try to mix... the dancefloor dying early for a reason!"}
{"text":"Meh! Just another watering hole. I could swear the booze is watered down. Have been here more than half a dozen times and disappointed every time."}
{"text":"Danielle our waitress ROCKED!  Couldn't ask for a better waitress.  My husband had the bone-in wings - not meaty, not happy.  I had the boneless with Brookside BBQ sauce.  I was happy with the wings - crunchy on the outside, saucy and nice but the minimum serving of boneless is 1 pound for $10.00 .  I couldn't believe it. I asked Danielle she said that is the minimum serving .  We got there after happy hour and cheap beer on draft did not exist.  I loved Danielle but I was disappointed in the qty of boneless wings I had to purchase and at that point who cares about ordering a burger.  Brookside perhaps you should consider a 1/4 pound serving of boneless.  My husband and I frequent another place 1/2 miles to your west and we each get an order of wings and then a burger.  but if I've already sunk $10 into a pound of boneless wings I can't eat...I'm not going to have room for your expensive beer and a burger.  Sorry probably won't return.  Might be a great fit for other folks, had electronic dart boards and billiards.  Music was light rock until someone hit the juke box up for MANY 50's country ballads.... I can handle 3 of those but he had more coins than I had patience."}
{"text":"Worst music!! It made me so annoyed and wanna die.. Like wtf? How is this a dance club with a dj??... I dont get it.. Its says dj 9-close and they claim to be the hottest club on the westside hahaahah what a joke! Ill never be back ever"}
{"text":"I'm sad that this is my first review, and it will be bad. My only hope is that the owner or management will be able to see that this business is in need of change. Call in \"bar rescue\". 
Honestly, when you first walk in the place looks like a class act. But that's where it ends. 
We were a party of 8 or so on a Tuesday evening, we ordered appetizers stacked nachos, terrible. Mozzarella sticks (not easy to screw up a mozzarella stick) they were hard and under cooked. Had to be sent back. 
We ordered a couple rounds of drinks from the waitress she seemed friendly enough. Until she stopped coming over at all. Even to clear the table.we went to the bar. John the bartender, was, the only thing that is worth saving in this service industry catastrophe. He took care of us. When I asked the waitress why she stopped coming over. She had no answer. Clearly when we were going to the bar for our drinks and watched her standing around doing nothing but chatting. We had our answer.
With only about 30 people on the place, there was no reason for us to wait on ourselves. Being in customer service I would not recommend this place to anyone."}
{"text":"was here this past saturday for ufc 148, place was very nice inside and the projection screens were awesome, we got there early to secure good seats and it did fill up pretty quickly after, my wife had a burger and she said it was good, just a basic cheeseburger and i just had beer. my only complaint is the service was terrible, there was a point where my empty beer bottle sat for 15-20 mins without our server coming anywhere near our table, it was busy so at first i gave her that but then she would come and check EVERY table around us except for us. otehr than that i really liked the place and may return for future ufc fights."}
{"text":"Service wasn't the greatest but not the waitresses fault. She had more tables than she should. Food was good. Had a burger and meat was quality. Clean, nice environment. All kinds of tv's so it's perfect for game day!"}
{"text":"Really bad customer service. I had to wait over 10 minutes for a drink. The pool table was missing a ball and no one came to help after I notified one of the waiters. I do not recommend this nor would I never ever ever GO BACK!!!!!"}
{"text":"Okay. Me and my dad went here to watch a UFC match and let's just say we will never come here to eat again. We both ordered items with grilled chicken that tasted like it was cooked in dishwater. Disgusted, we opted out and I decided to give them another shot so I ordered your standard run of the mill burger in replacement of our previous order- it was decent to say the least, nothing special. I wasnt even asked how I wanted the burger to be cooked. I also ordered a lemonade. BAD IDEA one sip and I had to spit it out o my mouth, I had my dad taste it and he was as revolted as I was. Not worth the money or time...unless you want to lose your appetite."}
{"text":"Like the band's, but the bar caters to a few of the same regulars every weekend. No where to sit and very few tables. When they reserve for a birthday party, they reserve tables they aren't even using."}
{"text":"Over all great place for gaming have great live bands! The buffalo chicken wrap is great, appetizers are cooked to perfection, very clean and tidy. Over all great time so 5 stars here."}
{"text":"We tried this place when it first opened and had a horrible experience with the then owner, he was an A$$ Hat!

We went back last Saturday to watch the UFC fight and we had a great experience.  They have good drink prices on their \"specialty\" drinks and the menu is vast.  After the UFC they set up the area for dancing but left plenty of seating around the dance floor and also additional seating in a raised up area.  The music mix was great, even for us middle 40 kids.  On the other side, by the pool tables, they have karaoke.

They have someone outside BBQ'ing carne asada for street tacos and we heard they are delish.  OH and they have 3 Olives Sweet Tart vodka that you have to try.

Service was good, no complaints and we'll be back."}
{"text":"Great place Thursday nights! Free wings 6-7, live band 7-10, karaoke 7-close. Great service and every game you can imagine on a TV. I will certainly be back!"}
{"text":"I would like to update my review on the Brookside.We had a dart league here for about a year and a half and the bartenders were always fantastic, as well as the owner. I cannot speak to the food, as I typically just had drinks. 

We have since moved our league to a different location (no fault on the Brookside's part). The bar seems to be getting into the swing of things and a lot of the earlier issues have improved. Good place to watch a game, have drinks or enjoy the fights. The random switch to night club is not really my thing, but other people seem to enjoy it. To each their own, I suppose."}
{"text":"This place is great. During Sunday's and weekdays it's a nice quite bar. And on the weekends it turns into a club like place. This place has pool tables, darts and karaoke. The best part is that the bartender Jon is the best."}
{"text":"Nice , big sports bar with pool tables, dart boards and plenty of TVs. 5 stars if the bartender was a bit more pleasant, but everyone has a bad day and I will return."}
{"text":"I been to this place a few years ago and had a great meal, watch a game and good service. Well that has changed. We sat down and the waitress came and got our drinks. No draft beers for some reason witch was OK. At least she mention that first. After that one beer the waitress seem to disappeared. Final got a menu (just one, guess they were short) and place an appetizer. Got that fast but when we wanted to order a meal we had a very hard time to get her. When we were done and wanted the check she disappeared again. Terrible service! Maybe it will be better next time..."}
{"text":"Fish was burnt and barely edible. Ordered bone in wings instead and got tenders. Ordered a light beer and received a heavy. Didn't get my coleslaw which was supposed to come with the meal. Waitress ignored us nearly the entire time we were there to watch a fight. Drunken belligerent patrons screaming and stumbling everywhere. The only positive thing I can say is that there were 2 seats available to watch the fights. I would never recommend this place to anyone nor ever return."}
{"text":"Wow! We have been here twice now for drinks and munchies and let me say, the service was absolutely outstanding both times.  Great drink recommendations and the munchies were totally on point.  We are moving to the area soon, and will be regular visitors here! 

And by the way, fantastic music selections!"}
{"text":"Absolute worst bar ever. Bartender is all about trying to get laid and ignores normal customers. I think this place should be shut down as fast as possible. And a new establishment put in place."}
{"text":"Horrible food even for bar food. Service is so so. We decided to try Brookside at night because the lunch was so bad but nighttime turns into a strange night clubish kind of place. Lot's of Mexican music which we though was strange because it wasn't a Hispanic crowd. We got our bar tab and it way higher than it should have been. Turned out that someone else's drinks had also \"accidentally\" been put on our tab. Check your bill BEFORE you leave because I'd been told this place is known for over charging. Glad I got the heads up!"}
{"text":"This place has so much potential... 1st-I have never been here for a meal and can only speak of coming after 11 on weekends. I do like that they have videos to go with the music and I have usually received pretty good service from the staff. They have a spacious dance floor, pool tables, an outdoor patio, and a large bar. This place is a recipe for success. What are they doing wrong especially as they really are the only bar of its type in all of Surprise? The music caters to a college crowd-loud, contemporary, and marketed to somewhere else. The DJ seems totally out of sync with Surprise. Prices-they are really proud of their drinks and the prices will break the bank. They have few incentives to bring women in-yes, if you can get women into your bar you will bring in the men and make money. Sports-many live showings but nothing to engage the crowd and keep them coming back for more. This really feels like a college bar better suited outside of ASU Tempe than the heart of middle class suburbanites out for a good time."}
{"text":"Come Thursday nights for wings and live band starts at 7:00. Love the people and atmosphere ."}
{"text":"This was my first time here. I must say service and food was great. Our server Chelsie did a great job. Everything was on time, I drink a lots of tea, my cup was full non stop. This place is clean, fri fly and good food."}
{"text":"Karaoke and a dance floor in a town where the average median age is 76. Oh wait, we're not in Sun City anymore! Score! It was somewhere to dance and sing during our bachelorette party so I was happy. There were even people under 50 here, they must have been shipped in from a neighboring town."}
{"text":"Thursday night wings! Yes! The service is half ass. Some of the servers could care less about the customers. Beer is cold and the atmosphere is so so on what time your there. Ill definitely go back but i dont expect an awesome experience with service.  I will suggest the pretzels appetizer."}
{"text":"This place was awesome!!! I arrived at about 10:00 and it appeared to be a lively sports bar with some pool tables and good looking security guards. Being that I am from California, and I was in 90 degree weather, the patio with the water misters looked appetizing, so we sat outside, enjoyed a few margaritas, cigs, and water misters. At about 11:00 this place was packed, no more sports either, every tv, which is about 10, some small and some big, were all turned to DJ Lisa, an outlined girl dancing along with music which played outside and inside. From a sports bar to a popping club, this place hit the spot!!! Too bad I was with my mom and older cousin, otherwise it would have been party time!!! They do serve food as well, which looked very yummy, but I was there just for the drinks."}
{"text":"Good place to dance on Fridays and Saturday, Dj has recently gotten new music lol, go with groups too. Good place overall"}
{"text":"We came to watch the Kentucky derby on all of the big screens and enjoy the betting. When we arrived the hostess did not have our reservation and we were quite disappointed but we're going to just place your bets and leave and find a different place to watch the race. However, as we were standing outside the owner came outside found us and let us know that a table had cleared off and that he had his wife holding the table. This made our day and we had a wonderful time!  The drinks were good as well as the food- despite being completely packed the service was prompt and accurate.  They have multiple large screen TVs throughout the bar as well as pool tables.  We will be back."}
{"text":"Tried calling this place 5x they pick up and hang up. Tried messaging, no answer, never experienced such rudeness. Home bar has pool league,that plays there, will try to convince them to find another place. Must be a bunch of assholes that own or run this place. Would encourage everyone to skip this place, they obviously don't need or care for your business!  Lol Ed"}
{"text":"Terrible service! Brookside has been one of my go to places but no more. Ordered a few beers and mixed drinks, our waitress paid little to no attention. The waitress would pick up our empty cups and bottles but then would never return. To top off the bad service when we got out bill there was no break down. When we asked for your bill break down she said it could not be done. I had to ask the manager for a bill break down. Once we did pay our bill, the waitress charged my card I had to keep a tab open twice even though I paid cash! I understand having to keep a card on file for a tab but charging it twice before cashing out??? Come on! The charges were reversed after about a week but not worth having to deal with the situation. Honestly the best part is always the tacos outside. The taco guy is hands down the best thing when it comes to Brookside."}
{"text":"My wife and I walked in and sat down at a table. I know that the blond bartender saw us. I know that a waitress in the back saw us before she disappeared. Let me add that this place was virtually empty with maybe six-eight regulars sitting at the bar that the bartender was yukking it up with.

As we sat without getting a pulse from the staff I pulled up Yelp, saw the reviews about poor service and walked our asses out.

We found a sports bar in the area called Tailgaters. We could barely find a parking spot. The place was packed and there were few places to sit, But the wait staff was friendly and busting ass. The food was merely average, the beer was good, we watched the games and had a good time. Maybe the owner of the Brookside should poach some of those employees."}
{"text":"We've gone to Brookside a handful of times over the years, mostly for their UFC fight nights (best in town, in our opinion).  Service can be so-so on fight nights.  We did have one specific waitress that we had three times in a tow that was just hands-down awful, that the next time we got her we were going to request someone else. Thankfully, we haven't seen her in a while and haven't had a huge issue with service since.  So on Father's Day my husband wanted to go to Brookside with his dad, who has never been.  We ordered the 50 wing deal and a few appetizers, along with a couple of beers for the dads.  We played pool as well.  We had a really good time, the waitress was attentive and kept the refills coming, food was hot and delish, and overall we had a really good time.  One of the best Father's Day my husband said.  So thank you Brookside and see you at the next UFC!"}
{"text":"This place is extremely \"ghetto\" No attractive people there, crappy food, and zero entertainment! Don't waste your money!"}
{"text":"My sister invited my partner and I out to have drinks here last week... 

I was pretty disappointed with the whole thing.  

Maybe cuz it was a Thursday night.

Maybe cuz both me and my partner have shaved heads (a friend has breast cancer people!) and the waitresses kept staring.

Maybe cuz it just sucked.

Not many tvs, and definitely what was on the tvs wasn't interesting.  The waitress clearly wasn't interested in serving us, but finally eventually asked what we wanted.

The woman looked like she was drunk herself.  Or needed a line.  Maybe it was a bad day for her.

So I order my black and blue, my sister orders her Blue Moon with a shot of OJ in it, and my partner orders her black tire. (Guiness and Fat Tire)

Drinks show up fairly quickly, and then it seems the waitress never comes back.

Finally we order our food.  I order the fish and chips... which was subsequently disappointed in.  Too greasy... nasty.  Fries were ok dipped in ranch, but how do you mess up fries when they are cooked all the way thru?

Wings were ok... nothing to scream about.

There is a huge dance floor in there and my sister says they have dancing on friday and saturday nights... I think I need to come back and try this place one of those nights to make a final decision on this place.

For now... no way."}
{"text":"Worst bar in surprise. The crowd here is awful, they try to start fights and steal from people. The management is completely incompetent, lousy beer selection and even worse food. Over the last 8 years I've been here many times and each time is a worse experience than the last. There are many great alternative choices for your night out. Despite the convenient location, you may want to pass on Brookside."}
{"text":"I'm not sure what people are rating for bar/restaurant. I've been going there for quite some time. Great staff, great selection, pool tables, darts, off track betting, what else could you ask for! Best spot in Surprise!"}
{"text":"The staff here was super friendly and the drinks were a reasonable price. 

Met up with some friends there and had a little fun mid afternoon.

I can't complain."}
{"text":"Okay. Had medium wings and pretzel bites. Wings are okay and pretzel bites were good. Good service and decent section of beers on tab."}
{"text":"Stopped in for a bite.  Food was OK.  Beer selection OK but we were not told of all beers on tap.  Super weird guy at the bar talking on his cell phone (we think) the entire time.
Won't be going back."}
{"text":"Dead crowd but everyone was friendly except that karaoke host.
The music was a mix of everything.  I showed up after the band finished so can't comment on that.

The bartenders were Chris & Tyler.  I've only been to this place like 6 times and Chris is always there.  He knew my friend but was friendly with both of us.  Very welcoming & knew his drinks.  He even called a cab for a drink tourist.

So I'd go here more but that karaoke guy will NEVER get my endorsement.  This is the second or third time I've seen him there & each time he's been rude.  He showed favoritism to regulars.  I was asking him a question then another guy walks up, whispers into his ear & the karaoke host turns his back on me.  Did i mention I was sober?  Not an annoying drunk.
The entire night he was drinking.  
At least two to three times there was technical difficulties and was no where to be found.  

What a great job!  Get drunk, treat people poorly & make money.  I need that job.

Would I return, yes!
 Would i refer friends for karaoke, no no no!"}
{"text":"they do not care about veterans that served their country. they didnt even ask....... all they said was no head bands allowed ( I came in on a bike with a sweat wrap) ,,, after telling them I spent  15 years over seas Just came to AZ. (told the Bar Tender I purchased a house in the neiberhood, you would think they would at least THINK that they give a damn or whatever....... they told me to leave.... For the record, I have been married for 36 years and always represent myself in the best way, but they do not care or even give it a thought..... I recomend that any and all vets do not go there............................."}
{"text":"The positives: Plenty of TV'S to catch games and they had the appropriate games on without having to ask. We were able to play darts with no wait....several boards. Nice atmosphere to hang out. Quality beer selection. Waitress was great once we attended to. 

The negatives: The Reuben sandwich I had was a sloppy mess. The meat was extremely fatty. The curly fries were bland. After sitting down we said hi to a Waitress three times before we finally had to ask for a menu. A different Waitress ended up as our server and she did a good job and was pleasant.

The neutral: Cheese sticks were good. Prices are ok."}
{"text":"My son was visiting us from San Fran. for Thanksgiving. So we decided to stop here on Thanksgiving night, since I don't have NFL network, and he wanted to watch the 49ers. We had a great time, just had a few drinks. Probably will eat there at a later day. Seating were very comfortable, service was very good. I have no problems here, going to come back!"}
{"text":"The Brookside is a great place to go to get out of the house and meet up with friends. (Or maybe make some new ones if you are single.) Its a simple little place in a simple little town. Don't be mislead into thinking this is ANYTHING like a Scottsdale nightclub because it isn't. It's just a great local place to enjoy a few cocktails, do a little noshing and get your groove thang on. The seating inside can become nonexistant FAST on the weekends but we always manage to find seating outside on the patio which I prefer.  

With cool misters when the weather gets hot and cautiously cool cocktails ...its a perfect receipe for unwinding after a long week!"}
{"text":"It's hot as hell inside even after asking them to turn on the A/C. Very uncomfortable. Plus they should rename the \"Basket of Shrimp\" to \"5 piece Shrimp tray\"... Just sayin'..."}
{"text":"Decent bar. The age is variable in age from young to old. Very nice people. Music and live dj with pool table and darts.  They need to keep up in the service of the place. Darts were all over the floor and broken. It takes only a few minutes to walk around and see what's going on. Servers were slow but the bartenders were good. Drinks were good too.  Fun place to go and hang out."}
{"text":"Stopped in for a bit with a small group of friends, it was a Thursday night and pretty much empty, save for a few guys playing pool.  Can't really say much about it, we all ordered drinks and they were fine, delivered quickly.  Our server was nice enough.  There was old school rock playing in the background, I believe.  The place seemed pretty big...though that could have been for the lack of people filling it up.  The kitchen was closed for the night by the time we got there, so none of us ate.  All in all, it was fine for a weeknight, but nothing super special."}
{"text":"After being a (somewhat regular) customer for just over a year - we encountered a really poor experience....  Now that the snowbirds are mostly gone  - we went for the wings and music Thursday - which normally is a good time,  We drink and the girls \"try\" to dance and all is good. The band is usually really good and some of the servers are really great. Well, Tonight we went in (3 of us this time) and were told we could not sit a particular table as it is only for 4 - \"reserved for 4 people not 3\".  Keep in mind the place was empty - really empty.  Then we move to a bar top table set up for 10. I ordered a beer and a shot and our friend ordered a beer - which was just going to get us warmed up for the drinking... then we were given 2 plates - not 3 for the wings. When I asked why not 3 plates for the 3 of us - I was told due to the fact that my girlfriend was drinking water and not alcohol or soda - she could not have a plate for wings..... Well my girlfriend does not drink soda or alcohol.... and this has me a bit steamed now... Then I was then told this rule has been in place for a long time, yet being we have been there over 40  times in a year and never heard of this \"rule\" until tonight... we decided to leave.  
We will not go back - they obviously do not need the money so I guess both sides are okay with this decision.  
Brookside should be named Badside - seems to bring that out in both of us."}
{"text":"Nice and clean sports bar, TV's O' plenty. Crowd is quite a bit older and I'm late 40's so they are real old. Couple of pool tables and dart boards. Long Island was 6$ and the best I've had hands down. 

Give a nice long look at the crowd and see if something about them doesn't catch your eye, besides their age"}
{"text":"Good place to grab a beer for happy hour, decent prices. Ordered food here for the first time. Horrendous sums it up. I had the giant quesadilla. It wasn't very giant, it was mostly tortilla with nearly nothing in it, the tortilla was still raw because it wasn't cooked long enough. My friend got a dozen wings which came out cold, tasted disgusting too. The ranch was like water. Couldn't even figure out if the dressing was ranch or not. Stick to drinks here. Do not make the same mistake as we did and get food from this place. I'd be hesitant to go back again. Thought I'd give them another try after a few years had passed. Just as bad as before. I'll pass on that place from here on out."}
{"text":"Ok...2nd review. After coming back a few times, the place doesn't seem all that bad. Bartenders are cool and can make a good drink. Plus street tacos on the patio on the weekends. Karaoke during the week is fun.Could still do without the club/ dance music though."}
{"text":"Went to watch and bet on the Belmont Stakes, place was packed, additional seating had been set up, we were able to get two seats.  The service (Chelsea our server) was EXCELLENT cold beer and good food served very quickly despite the crowds.  Love the pretzel appetizer !!!!"}
{"text":"DJ Pauly was awesome, the bartender messed up on check though so watch out on your bill. Otherwise, they do have a dance floor, good dance lighting, sit down areas to people watch, nice bar area, pool tables (3/4). Good local spot overall!"}
{"text":"This review is strictly about the food. When you order a club sandwich, you've grown to expect three layers with loads of meat. Brooksides idea of a club was meant for a kids meal. Two slices of bread, a piece of bacon and a piece of Turkey. What a joke! My 5 yr old niece could make a better club."}
{"text":"One of the only fun places to go out in Surprise.  They have dancing, pool, and karaoke.  I appreciate that they don't ask for a cover charge.  I never understood paying to just go into a bar.  I don't mind paying a cover charge at all when there is a live band .  They grill tacos outside and they offer all the yummy toppings for your tacos!"}
{"text":"This is a great place to just hangout and have a few drinks....and on Thursday night's...karaoke is awsome....Matt the guy who runs it...is an awsome dude...and runs karaoke very well...we were able to sing every song we requested...thumbs up in my book"}
{"text":"Finally made it back to the brookside after it reopened, met up with the wife and her coworkers there on friday for happy hour and a light dinner.  I admit I arrived a little later than the rest of the party but it couldn't have been more than 5-10 minutes.  Upon arrival I found out there was only one waitress for the entire floor which was probably 4000 sq ft and 20+ tables, and it was reasonably busy.  The rest of my party had already ordered food and had drinks. Wow this awesome GM must not grasp the concept that on friday afternoon's starting around 3-4ish mass amounts of people tend to like to drown away their sorrows. I ordered a fried shrimp basket and after about 5 minutes got my beer,  then after another 20 or so minutes the rest of my party received their food.  I proceeded to wait what felt like an additional half hour or more to get my food, and most of my party was finishing up their food.  (this always bugs me being the last person to get their food, you have the feeling everyone else wants to leave, but you're still hungry)  I'm not sure of the exact time but I recall checking the time and it had been around an hour.  to their credit the shrimp was pretty good, and the beer was very cold.  The menu a shadow of it's former self looks like a Fortune 500 company after it's latest quarterly earnings meeting. all in all a bit of a disappointment, being that the original incarnation of the brookside had it's share of unresolved problems to begin with.

I wouldn't say I wouldn't go back, but I don't think it's something I would suggest when asked."}
{"text":"What can I say? It's a bar and grill. We came here with a couple of friends and had a good time. Drinks were decent and food was pretty good. Hubby really enjoyed the fries smothered with blue cheese and wing sauce! Seemed like a nice clientele and a fun place to meet friends. We would go again."}
{"text":"Typical bar food. The bartenders tend to over charge people in general. A few of my friends have also  noticed this. The only positive thing about this place is there's always dancing on the weekends."}
{"text":"We love coming here for lunch when we travel to spring training. Mark (who works there during lunch most of the time) is amazing."}
{"text":"What has happened to this place?  This was my go-to happy hour bar in Surprise for the last 6 times I've been down this way.  It's not the same.  It's near dead, on life support.   It can't be just because they've raised their draft beer happy hour prices. Change some things or you'll soon be another real estate office!"}
{"text":"While I was visiting my Cousin Gwen who lives in El Mirage, my husband sent us out on a Girls Night Out. Yay! Since Gwen is new to the area, this was a first for both of us. We decided to head into Surprise and see what we could find. The Brookside was open, and it was a bar. OK, good so far. We walked in and sat down at the bar. The rest of the place seemed to have that feel of a concert venue after they turned the lights back on and only the stragglers were left. But, they had Guinness on tap, so it couldn't be all bad, right? So, of course, I had a Guinness, and Gwen ordered a Frozen Almond...something yummy looking. The bar tender was quick and efficient, and we had already had dinner, so we weren't interested in food. 

As we chatted and caught up, we became aware of something of a spectacle going on to our right. A girl was flapping her arms, waving her hands and shaking her head faster than I though possible. It looked like she was trying to take off and fly. When she started walking to a table full of people we saw her teeeeeeeny tiny feet with blinking light up silver shoes flashing in the moderate dimness of the bar. She talked and flapped for a few more minutes before seemingly storming out of the bar. 

Check please! We decided to move on. These guys definitely need to work on their ambiance here. It's Saturday night folks! Not Monday afternoon! Liven the place up a little! 

The check was a pleasant surprise, however. $8.50 for both the pint of Guinness and the Pint of Frozen Almond goodness. Thumbs up on the prices, now lets work on the rest of it, folks!"}
{"text":"Hit this place when I feel like going to a bar Sunday's for football. Perfect vibe, loads of tvs, and projectors. Constant service dispite being busy, great food along with drink specials when the Cards score. Win, win."}
{"text":"I like this place, trying to figure out the other reviews since none fit my experience here.  Bar staff are friendly and quick to serve. If you are there late the soft tacos outside are well worth it when you have been drinking ."}
{"text":"Wings were better than some places but were undercooked (rubbery skin, not crispy). Flatbread pizza was an insult to the word pizza. The pizza here used to be fabulous but old owner must have taken it with them when they sold it. Waitress hated to be at work and it showed. With the plethora of sports bars and based on the fact that I didn't leave anything behind, there is no need for me to return."}
{"text":"Bouncers are friendlier than the waitresses. It is a cool vibe and that is the only reason they are getting 1 Star. Pretty bad service. Waitress came around and checked on us 3 times in 3 hours. The DJ they have is mediocre at best. I can play better music through Apple Music. #SorryNotSorry"}
{"text":"They don't check ID's. My husband CLEARLY has an alcohol restriction stripe on his ID because he's an alcoholic and was ordered to not possess or consume alcohol or enter an establishment that serves alcohol. But they don't give a shit who's life they ruin. As long as they get paid, right?"}
{"text":"OK, I would like to first start off by saying if a business is going to put fake reviews up for themselves, at least say something different each time. I do not think a GM has been mentioned this much, ever, within the same day by people with stock Microsoft photo gallery images. 

Secondly, I gave Brookside II a chance and it made me miss Brookside I- big time. My beer was still cold (a plus) but the menu is severely limited (compared to the novel and diverse menu of the first Brookside) to whatever they can purchase in bulk and deep fry. I could understand this choice if our food was served quickly and it tasted decent, but they failed in both of those areas. For fried mushrooms, chips and salsa, and chicken tenders the members in my party waited probably about 30 minutes. The advertise fresh made tortillas chips but serve it with pace picante. Their nachos were cheese sauce, lettuce, tomatoes, olives, and jalapenos, served almost 30 minutes after ordered) for $6.99. My friend ordered the fried cod (see the fried theme) and took two bites and decided to be done. 

I am not saying that the food at a sports bar should be top notch, but at least good enough to satisfy the need/craving for bar food. Also I think if your menu is going to be largely deep fried based then the food should at least be prompt. Our waitress was the only one on the floor and she was spread too thin and it was obvious. 

I might go back to grab a beer if I had to meet someone, but as for making an appearance on my own initiative, probably not."}
{"text":"Went for lunch today with 2 friends, one who drove all the way from Buckeye.
I have not had a bad experience at Brookside, until today. I've been here before at night, on weekends.
Today the service was atrocious! Our server was April. She was rude from the moment we gave her our orders. My friend ordered her burger w/o onions because she is highly allergic. She ordered tots. Her food came with onions and French fries. 
When my friend pointed out the errors, Aoril's rude behavior escalated to the point where arguing  occurred.  This was all happening in front of my friends' 5 year old son.
Both myself and my friend have worked as waitresses in the past and would never treat a customer this way.

My friend spoke to the manager, Mark, he apologized and gave us all %10 off our bills.
While this was a nice gesture, it didn't make up for the fact that our lunch experience was ruined.

After this experience, I can honestly say, my friends and I will not be back.

I am hoping that April, at the very least,  is reprimanded, so that this does not happen to any other customers. 

I am hoping that the owner of this establishment reads this and terminates April."}
{"text":"I like this bar, casual, large bar, good service with smiles and the food came out hot and good."}
{"text":"Nice little place to have a company party."}
{"text":"Great drink specials. Great draft selection. Great bar tender. Great wings (try the Brookside BBQ.) Great amount of TVs with games on. Darts & Pool. Love seeing Snow Birds pound beers!"}
{"text":"We went to lunch at the Brookside after baseball games a couple days ago.  I ordered their stacked nachos as an appetizer.  When it came out, I thought they were putting a salad in front of us.  Seriously...who piles iceberg lettuce on top of nachos?  Perhaps they put it there to hide the fact that they use artificial cheese whiz from a can.  We all ordered sandwiches and burgers, but nobody thought their meal was good.  A lot was left on our plates when we left.  In my opinion, there are other places in the area where the food and ambiance are much better."}
{"text":"Service was great- Chelsea was attentive.  The DJ!!!  Isn't a DJ's purpose is to have everyone dancing?  When nobody but 1 drunk guy is on the dance floor- there is a problem.  He said he would take request- never played anything my friends and I requested.  The DJ's choice of music is not very danceable and it was obvious with no one dancing.  We left by 11:30pm"}
{"text":"This place is a joke. It used to be a decent restaurant with a full menu selection. However, it has been renamed to the Brookside II and has only a handful of lame bar fare on the menu. Nothing even remotely like what the restaurant used to serve. Stay away!"}
{"text":"Decent sports bar for NFL Sundays. Wings are better than average and they have curly fries which tips them up into the 4 star range. I have had solid service here in my four visits. 

Great deals on Sunday game days, $1 drafts and $2 bottles after touchdowns.

Nothing to complain about, yet nothing to get excited about either."}
{"text":"We had drinks and food and they were great. The drinks you could taste the alcohol and the menu for food had a good variety and was well prepared.  Our waitress was busy but always was there when we needed her."}
{"text":"What an unexpected wonderful heart warming welcome this place provided my family and friends yesterday. After a let down with prior arrangements at another local establishment, we were forced to find another location to come together as a family who were grieving the loss of a beloved man. This turned out to be the best redirection by misfortune ever. Chelsea greeted us and was top notch in caring compassion, professionalism and skill. She took care of every member of our group as if they were her only patrons. I feel I left Brookside with more friends and will be returning often. This is what we needed Brookside, and you went over and above in every way. Our sincerest thanks from Chris' Family and Friends."}
{"text":"Lame.  The menu was extremely disappointing (I think we may have been given the bar menu and not the regular menu, or maybe that's the only one they have?)  No drink menu either.  The salad was mediocre but nothing I couldn't have created on my own at home for less money.  The dressing was bland. The place was completely empty except for my table around 4pm..."}
{"text":"The night started off ok. Not many people for a New Years Eve. Band was excellent!!! Towards the end of the evening 2 senior friends unexpectedly arrived. We asked management if we could get 1 chair for the one senior woman and the man who claimed to be the owner said real nasty like \"No chairs and if you don't like it you can go somewhere else.\" He was extremely rude and disrespectful. Now we know why there weren't that many people there. Our large group of friends won't be going back again to be disrespected for no reason. We'll take our money else ware."}
{"text":"We stopped in last night prior to going to hear a local band. The space is neat and tidy lots of TV's, dart boards and a couple of pool tables. Overall, the ambiance is welcoming.

I ordered the Cubano burger, which has their smoked pulled pork, a hand made hamburger patty topped with ham, spicy mustard and pickles. This thing was perfectly cooked and the pulled pork was moist with a nice smokey flavor. 10 out of 10...really good and the prices are reasonable.

My wife ordered the soup of the day, which was crab chowder. Sounded like a great soup and she says it was tasty...however, it isn't made on the premises. It is heated from a bag. She discovered this because the soup wasn't hot when it came out, which if it is in a soup warmer, would not be the case. So, she asked if it was canned and the bartender said it came in a bag,

Even though I love the burger and the soup was good, can't give five stars for reheating food."}
{"text":"This used to be to be a favorite hang out for my friends and me. But tonight the service my friends received, or should I say didn't receive was pathetic. There are plenty of places for us to have out that don't have rude waitresses. 
Definitely do not recommend."}
{"text":"Finally a fun place to go on the westside! First time going there and I didn't know what to expect, but was pleasantly surprised at how much fun I had. Diverse, super-friendly, mix of people: 20 somethings, 40 somethings, white, black, hispanic, singles, and couples. Good music. (top 40 mostly hip-hop, pop, and dance.) Big screen tvs surround the dance floor playing music videos. Attentive DJ that doesn't act too busy to take requests. (he played both my requests in the following 20 min.) Large dance floor, bar, and patio. Bbq being cooked on the patio throughout the night. Drink specials announced throughout the night (dollar mixed shots). HIGHLY recommend this place if you want a fun place to dance on a weekend night and don't want to drive to Westgate or Scottsdale. Bravo Brookside!"}
{"text":"As other reviewer have said, the DJ's they hire aren't the best but they do have a big dance floor and a decent sized patio.

Some weekend nights they have the taco guy set up his cart on the patio, $2 for a drunk taco at a bar? I'll take that any day!

Cops are always hanging out at the entrance, 21+ venue only, they card everyone"}
{"text":"My wife and I just moved to Surprise Arizona from out of state and have been here about 3 weeks.  We have gone out to a few places to eat and have asked the locals where's the spot to go get some drinks and have a good time, so since a few people keep mentioning Brookside we decided to give it a try.  We went there last Saturday night at around 9:30pm and as soon as we parked the car we turned around and never even went in, the place was empty with more Security than anything walking around and we would have been one of the only people sitting in there.  We thought to ourselves \"this place can't be so good if it's empty on a Saturday night\", and now we see why.  We decided to give it another chance and went there again last night.  This time we actually went in, it was Saturday night again at around 10:30pm and again noticed that the presence of security was a bit overboard....What is this a Biker Bar where there's constant brawls??  I mean geez were in Surprise AZ..lol  Anyway the security guard was nice and we went inside and sat at the bar.  This time the place was busier but the atmosphere was....\"Lame\" to say the least.  One side of the bar was playing music and the other side wasn't, everyone was sitting down except for the people playing pool.  After a couple of minutes both of the bartenders came towards us at the same time, one male and one female.  The female bartender looked at the other one and pointed at us and asked him \"you got them?\", he replied \"No\", so she looked at us and with a \"stank\" tone of voice said \"What can I get you?\" I asked her if they had Chivas (Chivas Regal) she didn't even know what is was and she said \"no\"  the other bartender said \"hold on a sec\" and as he looked he found it.  He gave it to her and I told her that I wanted it on the rocks.  The girl proceeded to pour me an ounce in my glass and put it in front of me.  A bit confused since I used to be a bartender myself and know that in every book I have ever read and bartending class I ever took a standard \"on the rocks\" pour is 2 ounces, I looked at her and said \"um excuse me but this should be 2 ounces\".  She then told the other bartender and he told me that for on the rocks they do an ounce and quarter.  I then replied that it should be 2 ounces and he replied back \"well our general manager says that its 1 1/4 so\"  I then said \"ok well i don't want it, I'm not going to pay for something when I'm not getting the full amount\" and we walked out.  I understand that employees are only doing their job but there's always a nice way of letting people know that hey they understand but that's what they have to do. Needless to say we will never go there again and feel bad that that's what people around here think is the spot to go to."}
{"text":"If your looking for a place to shake your booty on a weekend with super loud hip hop and rap music.. this is the place! Huge tv's displaying crazy music videos, strobe lights rocking the dance floor and a rowdy crowd. I have to be in the right mood for this (because Im more of a country girl) but I do think that alot of people in Surprise need this kind of place to unwind without having to head to clubs in Scottsdale etc..This is probably the closest thing to a \"club\" you will get in Surprise. Not everyone that lives here is a senior citizen.. lol There never seemed to be any other type of music played though so I got a little bored with the same beats. The drinks were good though and I love playing pool which is located on the other side of the bar somewhat away from the hustle and bustle of the dance floor. They have a patio outside where someone was grilling some smell good food. Ive only been here on the weekends at night and have never eaten here so I cant really give a review on the food. But for good drinks and a great place to dance on the weekends with a \"club\" type atmosphere this is your place. Thats enough to earn my 4 stars. :)"}
{"text":"This is my first visit and the waitress was very attentive and nice. Prices were reasonable for a bar. We arrived on a Saturday at approximately 7pm. It was pretty amazing how it went from an active living retirement community to a young \"I'm on my first marriage and first child\" crowd within a couple hours. I would return no matter the age of the crowd...cold beer and decent prices and wait staff seemed nice"}
{"text":"They OVERCHARGE your card! 

Ok food and service. Venue was good with all the TVs, pool tables, entertainment, etc. 

But its not worth being charged a 34% tip without your knowledge and having to find out on your credit card statement three days later! 

Beware of what this business is charging you, keep your receipts, and double check your statements."}
{"text":"I'm looking for a comfortable environment, close to home (b/c I hate driving the distance to Phx & Scottsdale), where I can have a few drinks with friends, listen to music, & maybe dance.  I was hopeful that Crookside would be that place but I'm gonna have to go against the grain on my review...

Layout/Amenities--they have a couple pool tables on 1 side, the bar sits in the middle and on the other side is a large area with pub tables.  A raised platform with additional seating caused my friend & I to debate whether this place was a former strip club.  All that seemed missing were the poles...Lots of flat screen tvs & projection screens tuned to ESPN and various sporting events.  A definite plus.  They even had a flat screen mounted in the ladies room.  But the best thing they have goin for them is the 'Free WiFi' notice etched in block lettering on the tinted window out front.  

Food--is so-so.  I haven't had many meals there but the quesadilla I had was a little on the greasy side, directly correlated to the cheese quality (or lack thereof).  The Italian wedding soup was decent but they could've scaled down the sodium content.  Food prices were reasonable despite my assessment of the quality of the food, especially if you're ordering during happy hour.  And if you stick to beer, there's no way they can screw it up (which has happened to others ordering off the drink menu).

Wait staff--were decent.  They made sure we had drinks and checked on us several times.  

Crowd--a mix of older adults on double dates and single males.  I haven't been there @ night to assess the 'club crowd' so maybe the crowd is a little more balanced but after feeling 'leered at' during my few visits, I'm not convinced I want to check it out.

...And so, the search for the local 'hot spot' continues...."}
{"text":"Pretty decent sports bar. Several tv's to watch football, typical bar food. We watched a playoff game and ordered wings & nachos. Loved the wings. We did have to move tables because the horse betters kept getting in out way, but other than that, really liked the place. Our server April was very nice and friendly and constantly asked how we were. Hard to find a good sports bar, so I would recommend it."}
