{"text":"I rarely give out 5 stars. It has to be incredible food and drinks or something so new and delicious that nothing else compares. With that being said, the Naked Grape was very good time, the place is intimate (maybe 10 tables total?), and also has a decent wine list for the Burgh.  The food was fresh and good, although portions were a tad on the small side, so we ended up sharing plates like a tapas bar and kept ordering until we were full. I would definitely go back for more.   As others have mentioned, you can sit and eat at the bar, which is not a typical bar used to serve customers drinks before they are seated - it is definitely meant for dining and you can even reserve seats at the bar.  The owners, who were inspired to open the place after a few trips to Italy, were working that night and service was pleasant and attentive. It is a hidden gem and not your typical restaurant in the Burgh."}
{"text":"I'm a young guy and I'm brand new to wine.  I've done a few tastings, but I really don't have a developed palette.  So, when I walked in to The Naked Grape, I was expecting to feel out of place and maybe a little bit embarrassed about my lack of wine experience.  Boy was I wrong.  We sat at the bar and started looking over the wine menu (it's a pretty extensive list - at the time of this review, they had over 75 wines, which change seasonally).  Within minutes, the owner had approached us and was politely chatting us up.  He asked us a little about ourselves and we told him how little we knew about wine - he seemed very happy to answer all of our questions and to help us choose the right wine.  He made us feel completely comfortable there.  He made a point of speaking to almost every customer, to see how things were going.  To me, this is absolutely crucial - and the fact that he took the time to speak to a young, scruffy looking, know-nothing like me tells me that he really must care about his business.  To top it off, he and his wife seem to hold the philosophy that people shouldn't be afraid of wine.  This is evidenced by the menu, which makes wine and food pairing a cinch, by giving good suggestions.  They also do some of us a favor by including an \"Americanized\" name under each of the always-hard-to-pronounce Italian dishes in their food section.  The price was right.  I think I paid $7 for my glass of wine, which is about average for their menu and seems on par with other establishments I've visited, but you can almost certainly go higher or lower.  I would strongly suggest bringing several friends and splitting a few bottles - this way you get a variety of tastes without breaking the bank.   It was a really great experience, unlike anything you can find in the area.  If you're interested in wine, be it beginner or wine connoisseur, I would highly recommend The Naked Grape."}
{"text":"This place was great!  Very friendly staff, the owners actually came over at different times to check in. The food was delicious. It was a bit tiny but it gave it a good feel with lots of people. Can't wait till the summer when I can go and sit on the outdoor bistro and have a nice glass!"}
{"text":"The food was outstanding!  Although not real large portions, the quality of the food was superb?  The filet was like eating butter....so moist and tender.  And the desserts.....I died and went to heaven!  The wine list is great too.  The atmosphere is Old World and can be quite noisy.  The staff is very attentive and friendly.  I had such a great time here.  I highly recommend the Naked Grape!"}
{"text":"When this place opened I thought I would have a new favorite spot. They wine was delicious and the food was fabulous. Unfortunately they stopped serving dinner and are now in the process of just becoming a wine bar.   Best of luck."}
{"text":"This place is a wonderful date place, celebrate an occasion or enjoy a night out with the girls. I have visited The Naked Grape a few times and loved the food, the wine, the atmosphere and the people. The owners, the cook and the servers are all very personable. Love them :)"}
