{"text":"They are really bad. Staffs are incompetent, screwed up my order, food took forever to come (we probably sat there for an hour and a half), the servers straight up ignored us when we wanted to ordered food. Like honestly, how can you screw up on a order for burgers...it's really not that hard..... I would not recommend anyone to go to that place as you can probably find better food elsewhere. Their poutines are decent tho, the server (well... the tall dude) is rude. I don't think they got the hint that we wanted the bill until they saw us standing there with our coat  for good 10 mins with my credit card out."}
{"text":"So happy to have The Works in the neighbourhood! 

Navigating the menu is a bit daunting - the amount of options is overwhelming. The combinations are very unique and the combos that you kind of say \"really?!\" actually work.  Lots of choices for meat options too.  The prices are a bit high - but I tend to share my burger anyways because it's quite large. 

The staff here are amazing. Friendly, great with recommendations and you can tell they like being at work. I brought my 10 year old niece here for dinner one night and the waiter burst into song for her - really sweet gesture to put a smile on all of our faces."}
{"text":"The Works is one of my regular stops for a spontaneous restaurant meal on the Danforth. Solid beers (I like the Barking Squirrel), ridiculously good fried pickles with spicy mayo, and a great selection of burger toppings. I always order one of the pre-selected combinations (usually something spicy) rather than choosing my own toppings. Poutine for a side is also great - better curds than many places. Did I mention that I'm not watching my calories when I come here? The veggie burgers, which my wife gets every time, are also apparently great - I haven't tried it yet though.

Every time I've been, we've been seated quickly and service has been good, even when in a big group.

Being located near Donlands, The Works is easily walkable from the Danforth/Greenwood area or Greektown. Highly recommended for nights when you just feel like a great burger and appetizers!"}
{"text":"Food is ok, looks like a pub or a restaurant but expensive if u go by pub style & cheap  in terms of restaurant but then food is not that great"}
{"text":"The Good:
-Nice atmosphere
-Nice staff and management
-Great onion rings !!(must try)
-Nice fries
-Tasty poutine, huge serving (a little too much gravy for me though)
-Beechouse sauce is AMAZING! 

The Bad:
-Dry burgers, not juicy enough in my opinion
-Soggy bacon
-Cheese on burgers weren't fully melted 
-Boring bun
-Too many burger menu choices

I go to school at GBC which is right down the street so I've been here for lunch about 5 times since starting school this year. I tried a burger once and wasn't happy so haven't eaten one since. I do however love their poutine, I just ask them to go easy on the gravy. Also, the star of this place is the \"TOWER-O-RINGS\" it's a huge tower of onion rings served with two dipping sauces, they're so good!"}
{"text":"Excellent food. Variety of options and they're all delicious. The only issue I have is that I tend to over eat when we go there."}
{"text":"I absolutely loved the option of having so many burgers to chose from! I tried the Nacho libre burger with onion rings, and Chipotle sauce it was to die for. If you haven't ate here before I highly recommend you try it"}
{"text":"I love burgers so I'm always looking and eager to try new burger joints. My favourite thing about this place is the variety.. So many different types and ways to spice your burger.
 I had a Brie, bacon one which was delicious ( I unfortunately can't remember the name of it) but there is definitely something for everyone here. Our server was also really accommodating with altering  the toppings which I appreciated.
The downside was my fries were cold and  my friend ordered the side of veggies and it was a measly serving of celery and carrots.however, I think everyone needs to at least try this place at least once and get creative with your burger choice!!"}
{"text":"Wow. First time, and last time.

Got the Dead Ringer (beef). Awful patty. Completely dry, flavorless, and *loaded* with gristle and cartilage. Got pretty tired of chewing on rubbery nuggets held together by 1 tablespoon of bone-dry beef, so I gave up and went to Harvey's.

Tips on making a better patty: go to No Frills, buy some Extra Lean ground beef, shape it into a patty, throw it in the oven for 30 minutes, and eat."}
{"text":"Hi, 
Firstly, I shouldn't even have given a 1 star rating to a restaurant with as bad service, staff and kitchen as this one. 
We entered Works around 8.20-8.25pm for dine-in - saw the sign 'Please Wait to be Seated', so just stood around and waited for a bit. There was one girl at a cash register, one taking an order and another one who was taking an order but then proceeded to fill some drinks. We stood there for more than 5-6 minutes with none of them bothering to come towards us (although all 3 had seen us) or welcome us or ask us what we wanted (dine in/take away).Finally, my friend walked towards the cash register himself and asked the girl if they had a table (we saw that nearly 4 tables were empty - one of them big enough to fit our party of 4 adults and 2 kids). The girl answered 'ok but you will have to wait 10-15 minutes' to which my friend asked why (since there was a table available) and she said because it will take us that much time to clean it. Though taken aback he just said ok and we all just continued to stand around with the 2 kids and wait. Another 10-15 mins passed by but none of the 3 girls went to clean the table in question. After 15 mins we asked the same girl again what the deal was. She replied 'Well it will take you an hour to an hour thirty minutes' Flabbergasted we asked why since the table was there. She replied 'Well the kitchen is working to capacity so it will take you at least that much time to get your food'. We could not believe what we heard. Never had we ever gotten a reply like that from a restaurant which WAS NOT even full to capacity (by that time another party had left so they had close to 5 tables empty). Disgusted I just said that we would leave right then. She didn't seem sorry or apologetic. 
Needless to say, this has been the worst experience ever for us of going to a restaurant. Never have I ever been to a restaurant where the staff completely chooses to ignore you and then later doesn't even bother to inform you what the situation is. We were just left standing there for all that time with two kids, in the middle of a (not-so-big) restaurant feeling like fools. Seems the kitchen staff is as incompetent as the dining room staff if they can't even cope with a restaurant running at 60-70% capacity. I am sure the owners are happily keeping the restaurant under-staffed and the prices as high as possible. Completely disgusted. Will NOT be returning to the WORKS and will make sure we discourage as many people as we can from going there."}
{"text":"One of my favourite places to come in downtown Brampton. Great spot right down in the downtown square, overlooking the giant screen. The location is well designed, funky, and the food is great. Always get great service here and will be coming back many more times!"}
{"text":"I LOVE this place!! I come here at least once a month. The service is excellent every time I go here. 

My favourite burger is the Son of a Beech. The Beech house sauce is to die for!!! It's a must try. The side sauces are unlimited for free!! The die cut chips are really good as well and goes perfectly with the beech house sauce. 

I once had an issue where they put the wrong topping in my burger and the manager was nice enough to give the burger as a complimentary even though I did not complain!! 

I will keep coming back to this place! And always remember to do the survey on your receipt to get $5 off your next meal!"}
{"text":"First time being to this location ( been to the one in Oakville). There menu doesn't have all the flavours I'm use to but the plus side is u can make your own creations. Staff is really friendly and attentive. My fiancé and I decided to take out. Didn't have to wait to long. Food was really good. I had a chicken burger and it wasn't dried out. I had byob ( Build Your Own Burger), he had the Smokey Mountain on beef and loved it, just wished he got lettuces and tomato as well.  If u order a specialty burger just ask them to add more topping if it doesn't already have. Over all a great experience."}
{"text":"Service and food couldn't have been better. We found this place, thanks to yelp, and so happy we did. Our server Julia and the rest of the team, including the GM who stopped by and chatted with us, was on point!  We shared the poutine as an appetizer and ate every last crumb, and the burgers were great!  Loved the sodas and water served in measuring cups which was different.  Leaving very fat and happy:)"}
{"text":"Horrible service.  10 minutes for a hostess, 45 minutes until food arrived after sitting (it's a burger, c'mon).  I understand being too busy and short staffed but check in when you pass my table 15 times.  Mediocre burger, poor selection of beer.  Cooks eat and touch their mouths while they work and prepare bus food."}
{"text":"The burgers are good.  The variety of toppings make it unique.  The beef could be juicier but I'm assuming that's because they use lean ground beef. The quality of the burger is great. I can taste the beef. Go for the white bun. It's much tastier. I'd eat here again."}
{"text":"Been there a few times. Got lucky with the same server/crew!
Place is a delight for Brampton. 

Take your time to review the menu choices. The appetizers are fabulous too. 
The tower of rings are an incredible feat!

Milkshake anyone?   Use a spoon too..."}
{"text":"Went on Works Anniversarry... Surprise!!! $5 for gourmet burger with sides..... Really??? After getting get deal i cannot complain... finall bill 25 for 3 including tax and tips..."}
{"text":"I love this place, it never stops impressing me. though the menu admittedly is really annoying even with that the Quality is there, every bite is perfect. these guys even now have Caribou and it's Great!
My Suggestion Go for the Caribou with Layton's Legend on a White bun with Bold Slaw on the side, Top it off with One of Those.  EPIC!

Expect my direct return."}
{"text":"There is absolutely nothing special about The Works (on Danforth). Burgers are okay, service is good -they convinced me to get deep fried pickles (wasn't a fan); small beer selection. All in all, 2 burger combos, deep fried pickles and 4 bottle beers...70 bucks later...won't be going back."}
{"text":"The burgers are frozen and the fries aren't that good. You're much better off going up the street to Smoke's."}
{"text":"An all-around fantastic experience. We came with a large group and were quickly seated together. The service was excellent and we even had a visit from Zaki, the owner. A very cool guy.

Most importantly, the food was delicious. The burgers are fresh, made with care and cooked properly--not frozen and reheated to the point of flavourlessness like you often get elsewhere. The fact that you can choose between chicken, beef, turkey, or even elk is pretty cool. The also have a portobello mushroom and veggie burger option for vegetarians. Unlike a lot of Toronto burger joints, the Works is table service and licensed. No waiting at a counter and it all goes down better with a pint of Hop City beer. 

Finally, there's just a ton about the place that's quirky and in the spirit of good fun. The menu includes a Stanley Cup burger that's been unavailable in the GTA since 1967 and the atmosphere is great for anything from a group of friends to dates to families with older children.

Highly recommend."}
{"text":"The food here is so delicious! There are sooo many choices of toppings and interestingly named combinations. The burger was very flavorful and juicy and the restaurant has a really great atmosphere! I will definitely go back."}
{"text":"Went twice and I loved it. Great selection of burgers. I never know what to choose! Service is great and I just love those damn measuring glasses they use for drinks!"}
{"text":"Visited this place during Burger Week, but decided to give their lunch rush menu a try. Had Sk8er Boi as I was interested in the combination of peanut butter and bacon. The combination was tasty and the bun was delicious, but there was absolutely no meat flavour in the patty. I was disappointed by the tiny 4oz patty, which was both dry and flavourless. The fries also tasted like the frozen variety. So sad this overpriced burger joint is just not up to snuff -- cool decor though -- no more hipster burgers for me."}
{"text":"Extremely slow service for an empty establishment.
Menu was awful to read. 
Thanksgiving turkey dinner burger was unimpessive as was the jucy lucy which was dry and tasteless despite its name. Buns were thick and stale which was the nail in the coffin for these already disappointing burgers.
To top it off a bill of $50 came for 2 burgers and 2 beers plus tip for bad service.
I would not recommend this place. Try squareboys across the street for a tasty inexpensive burger."}
{"text":"I find this place overhyped. 

It is really busy during lunch time and it is certainly not cheap, so I expected better.
The food took forever to come out. Service was slow.
The burger had absolutely no veggies...maybe I had to ask....not even a leaf of lettuce. No tomato. No sliver of onion. Just overcooked patty, and cheese, and some sauce on some mass-produced buns.
I get that this is a gourmet burger bistro so they have some interesting burger creations, but I did not find mine interesting. I found it lacking, in many aspects.
Fries were a little cold, which is disappointing. If the food took so long, I would have thought it was because they have so many orders and they are cooking fresh batches. 
Yes, they give you your drink is glass measuring cups, and they have lightbulb salt and pepper shakers, but all that is smoke and mirrors to me if your core products are lacking.

Will never come back."}
{"text":"Staff was fine, not a professional kitchen you could obviously tell. I normally dont eat out for burgers considering I can make and grill a great burger at home, so why pay close to $20 for a mediocre burger with bland toppings.  Toppings not fresh, save your money and buy a nice steak at a   butcher for that price and grill at home. Remember if it's not a chef cooking , dont eat it."}
{"text":"Ok so let me start off by saying that I NEVER order burgers from a restaurant because I don't like frozen patties. So for me to go to a \"burger\" place was a bit of a thing. These were not frozen patties, they were burgers that you would make at home from fresh ground beef. My husband and I both ordered the \"Gettin Piggie with it\" burger and it was amazing. So tasty and juicy and the amount of fries you get is pretty reasonable. Let's just say we ate at 2:30 pm and were still full after the Jays game at 10 pm. 
The actual restaurant is in a great location walking distance to the financial district and even the Rogers Centre which is where we went afterwards. The market district is also considerably less busy than just a few blocks Down the street.  We sat on the patio upstairs and it was very nice. The decor reminds me a lot of the patios here in halifax. And yes the salt and paper shakers are pretty cute. OH MY GOSH I almost forgot, we also ordered the fried pickles. They were awesome too. How could I forget those??  I highly recommend this place for a laid back lunch or dinner.  The price is a little high for a burger joint but this is a pretty awesome place with amazing food."}
{"text":"One of the better new age burger joints I've been to. The promotional bacon menu was incredible."}
{"text":"I was in the area looking for a good burger. Decided to visit here after reading good reviews. We immediately liked the decor and ambience of the restaurant. Extensive variety of burger toppings. They tasted pretty good. It was a bit pricey for me for a burger though. After tax and tip, one burger will cost you about 20 bucks. The quality was very good and did not disappoint."}
{"text":"Great concept,  great service, burger was pretty good kind of under seasoned was very heavy on peppercorn but that is because I ordered the cracker jack,  the beer pairing complimented the burger. Had a great time here stopped in for lunch between shifts I wasn't completely blown away but I will definitely go back and try something else."}
{"text":"First time at this place.
I really enjoyed my Smoky Mountain burger was fantastic! With a poutine and a Jones rootbeer. The poutine gravy was very salty, altogether great location."}
{"text":"I came here for lunch when working.  I thought it was more of a fast food place.  Defiantly not a good option if your on a schedule. I waited over 15 min for my lunch. The place was pretty slow. There were about 5 other groups.  The food was pretty over priced.  It came out just over $25 for a burger with fries and a pop including 15% tip and tax  

The burger was ok.  Nothing special.  Defiantly not for the price.  I could have gone to South St and had a burger with extra baccon for $10 less."}
{"text":"The food is good don't get me wrong but $22 for a burger with onion rings and a drink? Get outta here. Rather go to 5 guys instead.

And why do i need to drink out of a measuring cup?"}
{"text":"It is not worth it. People talk about this place like if it was the next greatest thing...but it is not. Service is slow, the place is usually packed (expect a line), and the product is not what you would expect for that price. The concept is well-thought, but the burger is not great. Mine was greasy but not juicy."}
{"text":"My first visit to the works gourmet burgers and after hearing good things about it I decided to give it a try... 

Items purchased:
Kamakaze burger 
Oreo cookie milkshake
Pulled pork poutine

Rating:
Burger was on the spicy list of burgers and me being a Lil panzy with spice it was pretty spicy...  But very tasteful and filling

The milkshake was awesome due to the fact that it had a lot of Oreo cookie bits in it...  The bits kinda get stuck in the straw but with a little forceful sucking u can enjoy the cookie goodness!!! 

The pulled pork poutine was delicious..  Probably one of the better poutines I've had.. 

All in all good experience here...  Service was good with friendly waitresses...  And decor was unique... 

To sum up... TooTuff approved!"}
{"text":"Went here for lunch recently. The burgers were \"A-OK\" (I've had better - but they certainly aren't bad). They have some nice options for the burgers.

The staff here were great - very friendly and always timely with refills ,etc.

It has a pretty unique theme to it  (your drinks come in a measuring cup, and the salt and pepper shakers are lightbulbs). 

I would come back here."}
{"text":"Overview: I have gone to The Works twice. First time when they had their free opening night with some friends and second time last week with my boyfriend.
Usually on the opening night service is amazing, so I gave it another shot to see how it is going to be on a regular pay for your food people night :)))
Both times service and the food were amazing.This is a perfect place for burger lover who wants a bit more sophisticated options and HUGE variety of gourmet choices. 

Good:
Details: Quality of food is plain great, from the fresh meat patties, variety of cheeses, buns, and of course absolutely crazy amount of toppings.
Drinks come in glass measuring cups, onion rings is a candle holder tower, food itself comes in a metal square tray. Salt and pepper shakers are in a shape of light bulbs. All of it fits the theme,decor and works quite well.

Atmosphere: One of my favorite parts of this restaurant (and yes I would definitely call this a restaurant not just a burger joint you drop into) that it has all the details of an actual sit down dinner. I do not feel like I am in dirty, grimy burger joint.
Their pick up door/line it tucked away in a smart way so it does not disturb actual patrons who came for a sit down dinner. Low level of music also brings a nice change from usually blasting tunes of other burger places.

Food: Decadent mushrooms, crispy onion rings that come with most creamy chipotle mayo( you can choose from a variety of dips), HUGE juicy beef patty that smells and taste like a real piece of meat. Perfectly fried sweet potato strings (no dirty oil smell or burned pieces). Melting in your mouth cheese (brie in my case), fresh crunch of vegetables or smooth feel of avocado it all is plain amazing! Incredible 6!! strips of crispy perfectly smoked bacon with cheese melted around it like a blanket...

Bad:
The only thing I did not like were dill crisps (deep fried pickles). They are usually my favorite item on the menu, and I gladly pay an upgrade price for them. But they were just plain awful :(

Ordered: Onion ring tower, Leaside Burger, Lipstic on a Pig, Sweet Potato Strings, Smokey Mountain"}
{"text":"When the toppings are better than the burger itself, you know you've got a problem!  This place has everything going for it - great roof top patio, impressive menu, adorable measuring cup drinkware, prime location.  It's unfortunate that on the day we went, our burger patties were extremely dry and the service was slow.

I'm all for a lazy Saturday, but we ended up waiting a long time for our meals.  I'm pretty sure I could have walked home and made my own burger in less time.  Our patties were both really dry.  I ordered a veggie burger, and you can tell they just buy frozen patties from somewhere and throw them on the grill.  My boyfriend's beef patty was also really underwhelming.  Overall not horrible, but if that's all you do, it better be good!"}
{"text":"After my wife recently discovered the Works expanding to the Toronto area, we knew we had to go.  I was nervous about it not meeting the very fond memory of my first visit in Ottawa, and I am glad to say that the Danforth Works lived up to my high expectations.

I ordered the \"La Ultimate FLAMME-grilled\"  (gouda cheese, crispy bacon & fresh avocado - but I swapped my gouda for cheddar), and my wife had the \"Benny Piggenbeef\" (caramelized onions, bold BBQ sauce, jack cheese & crisp bacon).

Both burgers were very large, and cooked about \"medium\" with a little bit of pink in the middle.  I think the beef is unseasoned, leaving just the natural flavour of the beef to enjoy.  The bacon adds a little of its own flavour and saltiness, and the avocado gives it a little freshness.  The cheese is cheese, maybe I should have stuck with gouda for something more \"special\" but I was happy with the cheddar.  
The bold BBQ sauce in the Piggenbeef was really good, and there was a lot of it.  The only thing I wasn't crazy about were the caramelized onions, which were maybe too fat, maybe overdone, but they didn't add much in this case and the Benny would have been just fine without them.

We had an order of fries, which I think they do very well here.  Skin-on, NYF style, and cooked to a dark golden brown, not light and greasy like many places.  The side of onion rings I ordered was good, but at an additional \"upgrade\" cost of about $3 bucks, I'd stick with the delicious fries next time.

After having experienced some more of the other high quality burger places recently, I think I would give an overall score of 4.5 to the Works, but if they changed the style of the rings from breaded to more battered style, and got rid of the upgrade charge, I would give the full 5 stars.

It's still a great meal, and you will not leave the table hungry.  No tiny burger for your money here.

I haven't really discussed the atmosphere or service, probably because both were just fine.  Polite, friendly servers who did their job with a smile, and a kind of fun industrial style theme for the decor.  Really, unless the service is exceptionally bad or I'm being asked to sit on a milk crate in the alley, I'm mostly just concerned with the food, which is the main reason I'm there."}
{"text":"Love this place. Great service! Our server was personable and attentive. I enjoyed the decor and novelty of the light bulb salt and pepper shakers and the measuring glass servings of drinks. Food was delicious and adequately portioned. I had the \"Son of a beech\" burger with a veggie (soy based) patty and a side of spicy die cut chips. The burger had avocado, sun dried tomatoes, feta cheese and a garlic mayo; it was not greasy at all. Overall good location, great variety of items to choose from on the menu and delicious burgers. They also have gluten free options and free wifi. I will be back!"}
{"text":"I always come to this location to get my burger poutine fix.. Today however I came because they had a special for $5.15 for any of their burgers including a signature side... This was reason enough for me to come and indulge... Even with the large volume of customers,  we managed to get a spot within an hour for a large party of six. I got the chicken burger and the burger was juicy and the veggie patty was really delicious as well."}
{"text":"When this place opened, I was pumped. Finally, a burger joint not named Square Boy that is within walking distance from my home!

Of course, it had to be a disappointment.

It was extremely busy at lunch and dinner times in the opening weeks, so I went in the middle of the afternoon when it wasn't as busy. Staff members were just lingering around in the back, looking for something to do.

The first thing that annoyed me was the waiter, who sat down across from me to take my order. I get it, you're trying to be different and you want to have a cool, laid-back approach. That doesn't work for me. It was lame, tacky and uncomfortable. I don't want to be his friend, I want him to take my order and bring me my food when it's ready.

I kept it very simple and ordered the Leaside burger (beef) with fries for $14. The price is comparable to the city's best burger joints, but in terms of taste and quality the burger didn't stack up. It was thick and a bit pink in the middle but it didn't taste as fresh as it should and it had the shape of a frozen patty from the grocery store. Average at best, but it was filling.

I'll give The Works another shot, but I'm not holding out much hope."}
{"text":"Love the decor and selection. Rise theatre location is great for people watching.  Couldn't finish my fries since the burger was so big. I had the Crappy Tire and loooved having pineapple on a burger. Kids menu was a bit odd to me. They could probably cut the portions down to what normal kids eat and then cut the prices some. Good experience though,  I'll definitely be back."}
{"text":"ohhhhh so delicious!! probably the best burger i've had and amazing service!
I had pesto pizaz omg sooooo delish!! you need to go!"}
{"text":"Back again and I  certainly don't regret it. For those who haven't tried the Hangover burger, you are missing out on a real treat. 

Service was great and staff super friendly. Despite being super busy, we didn't have to wait very long and the food arrived hot.

I also think someone has changed the music selection, awesome! Found myself bobbing my head and tapping my feet with the music while we ate LOL!"}
{"text":"Place has been open a couple of months and already it has 46 reviews.  Holy, holy!  Well for good reason, no doubt.  I live in the hood and I thought this place was just going to be another fast, crap food joint trying to look cool with sub par ingredients made out to look cutting edge.  I could not have been more wrong.  

Cool decor, apparently it is one of those chain things though and it has to be uniform in all the works restos.  What they need are carriers for the ketchup, mustard, vinegar, etc., so the waitresses don't have to carry the whole lot from table to table in the crook of their arms.  Apparently, individual restos can't just come up with such a thoughtful and useful accessory, unless it comes from the head and everyone does it.  What is this, communism?   Can we think outside the box please?  Well, in this case it would be inside a box!  ha ha

One of the things that I really liked, was that they served the drinks in measuring cups.  I happen to have a measuring cup collection.  Weird, I know, but I forced myself to stop because of space.  I wanted to take it home, but, I already have one of those ones.  :)  Thoughts of slipping that cup in my bag danced thru my head, oh no!  It is not like I am lacking in measuring cups.

The burgers.  What can I say.  They have about 50 ways to top your burger and if that don't suitcha, you can just put some ingredients together yourself, no prob.  That is what I did.  There were so many things I wanted to try but they were all on different burgers.  First choose your bun, then your patty and then your toppings.  I had a gluten free bun and an elk patty  with mushrooms, goat cheese, eggplant and some sweet and sour sauce.  This isn't a burger you can just pick up and eat.  I sliced mine in half first and then in order to actually eat it, i had to shove it in my mouth as it way too big for my  mouth to fit over it.  And I have a big mouth.   Lots of sides to choose, I tried what are pretty much, chips.  Crisp, warm and yummy.  I am going to try a different side each time.

Now, I could SAY the service was slow, but it took me so long to choose and the wait staff came by frequently to see if I was ready.  Once i did order, it was not fast food.  It was normal, like any resto.  This is a good thing, in case you are wondering.  If you want 'fast' go down the street to McD's.   I like to eat and not worry if i am going to have bowel issues the next day.  Happy to report, no issues the next day. 

Classic rock was the tune of the day. And a bit too expensive for me, but I will go again.  Everything tasted great."}
{"text":"The location is beautiful and there's lots to do around the area. The food was great and there was a lot of it. The inside is so cool and the drinks are served in measuring cups, which I found amazing. There was a lot of choices of burgers and I would highly recommend going."}
{"text":"I've been to this location lots of times since it opened, but it seems to have recently changed.

I ordered a Ho Hum #2 (cheddar & bacon) in the Works-size - two 4 oz. patties instead of one - plus fries for take-out. The Works sized option seems to be a new thing, as I don't recall seeing last time I went (a few months ago), but maybe I just never noticed. I could swear the burgers used to be 6 oz. - when I looked at the patties, they seemed comparatively small (as least in my memory). The burger was fine - the cheddar and bacon were good quality, but the overall impression I got this time was of diminished value. I was a bit surprised that the burger was completely plain - no lettuce, tomato or any other toppings (I just assumed those are standard - or that they would have offered any of the toppings they have available).

The service at the take-out was friendly, but not very good. My burger and fries sat on the line for more than a minute - it seems that only certain employees can pack up a take-out order and hand it to the customer, as I saw several people walking back and forth, looking at me and going on.

My fries were cold - though that has always been a bit of an issue with The Works - and it isn't because I ordered take-out. I started eating them right out of the bag on my way out, and they had definitely had been sitting for a while before being loaded into my order. And I am sorry if I sound like a whiner, but my Coke Zero was syrupy and flat - I overheard the staff talking to each other about problems they were having with the machine that night, but I guess they didn't think to check it (I went out for a cigarette while I waited for my order - that's when I took a sip and noticed it was bad. I was going to ask for another once I finished (my cigarette) and went back inside, but by the time I got someone's attention to pack up my food that was sitting on the line, I didn't want to wait for them to change the CO2 on the machine, so I didn't say anything).

Although this experience left a bad taste in my mouth, I still think The Works is one of the best options in St. Lawrence market for a burger. If they improved either their service and quality, or their prices, this would rank much higher.

A new burger place is opening up on Front Street East sometime in August (real food co or something like that), so I will definitely try that and review in comparison."}
{"text":"I'm so glad to see this place replace the Pizza Pizza that never suited this corner of Toronto - Welcome to the Works!!
They've done a great job renovating, the interior has a trendy atmosphere. The staff appeared a bit inexperienced, but the place has only just opened, and honestly I'm happy to see a place give some inexperienced people some training and opportunity.
Now, $13 felt a bit expensive for a burger with fries. And hopefully being an eat-in style restaurant will help to build the value into that. I was a little disappointed with my choice though - a burger involving peanut butter and bacon (entitled the \"Sk8er Boi\"). And when salad isn't listed as an ingredient, it means it isn't on the burger (they do state this on the menu pretty clearly). Now it's probably because of the wacky fillings I chose, but I just didn't enjoy anything beyond the delightful first bite. 
I would give the Works another try, to have one of the more standard burgers they have available on the menu. It's great to have the place upgrade the atmosphere of the flat-iron corner at Church/Front."}
{"text":"Ordered the hipster burger with Elk meat that tasted amazing!!! Thank you for the gracious service Asha!!! All your recommendations and knowledge of the menu were on point."}
{"text":"There was nothing to dislike about this place. The burger were enormous and the variety was great. The wait staff was attentive and the decor was original. However I found the food a little bland and lacked inspiration.

Their are better burger options around town!"}
{"text":"We walked in an hour and a half before closing time. We were turned away because they said they ran out of ingredients in the kitchen and were having mechanical problems. Then they recommended McDonalds to us instead. I guess their quality is on par with McDicks burgers then, if their own staff suggested that would be a better option for us. It's a Saturday night, how do you run out of ingredients?"}
{"text":"Consistently great experiences here. Sometimes I have to stop by just for the sweet potato fries. Can't beat the selection here for the burgers themselves, buns and contents."}
{"text":"This place has THE WORST service! Went there on Saturday for lunch and even though there were only a few people in the place we still had to stand around while ignored by 4 waitresses who clearly had no interest in serving customers. Took 10 minutes before anyone took our order and then another 45 MINUTES to get two beef burgers. We're told by manager that beef burgers take longer to cook ?!?!?!  Food was bland, dry and overpriced. Watching the kitchen staff stick scratch their heads and then stick their fingers in the customers food was GROSS!"}
{"text":"The works. The only word to describe this restaurant is phenomenal. The overall theme of the restaurant was greatly conceived. A construction zone, where the salt and peppershakers are light bulbs, your drinks are served in measuring cups, yes that's right measuring cups, and your food is served in what can only be described as a trough. The menu is another masterfully crafted piece all by itself. With what seems like a million options, they are all very unique from any other burger place I've been to and very different from each other.
I had the \"Sk8r Boi\"; beef patty on a white bun, with blue cheese, bacon, and peanut butter. It doesn't sound like the combination would work, but it worked so beautifully! Between my burger, the tower of onion rings, and a maple smoothie (also served in a 16 oz measuring cup), it was a meal to remember and I will definitely be bringing all my friends here to have \"The Works\" experience. 
Ontop of great food, and a fabulous atmosphere, the staff was great!"}
{"text":"Went here for the first time today. I'm not a meat eater so only commenting on veg option. It was ok, toppings are unique but the patty itself was dry. Maybe because I had to wait over an hour to eat due to quite possibly the worst service ever. 

My friend and I arrived at 11:55, were seated right away and informed our server we were in a rush. What followed was our \"10-minute\" options taking over 40 minutes, we had to take our food to go, forfeiting our sides as they weren't ready and we were going to be late. i didn't even have time to eat the burger until 2 hours later. Try this place if you have tons of time and like mediocre food, (definitely not worth the $16 I paid to get just the burger). Honestly I think Harvey's veggie burgers are tastier than these."}
{"text":"A local of the Danforth/Greektown strip, I have relished in the proliferation of new, unique, and international eateries offering high quality eats at reasonable prices.

Watching the Works throughout it's construction, I celebrated the possibility of a local gourmet burger eatery, in the style of Burgers Priest and GBK, nearby, but not a quick walk.

Upon entering, I was puzzled because (no offense intended 905'ers), the decor seemed like it was the May 1993 edition of Oshawa Restauranteur.

No matter, I thought, it's the food that counts. Next up for trial was the service, which, while pleasant enough, followed the decor with an overtly saccharin kind of placation.

The menu was akin to some sort of Jackson Pollock collection of random words and locations and ingredients sprayed on a page, for which 2 Excedrin were scant enough to relieve the head pain inflicted from trying to read this mess.

The drinks (soft) were served in Pyrex, and were highly awkward and top heavy.

The specialty appetizer was an oxymoronic cream cheese concoction, with a name reminiscent of a Cleveland Steamer.

 Having given up on the complex menu, I acquiesced and said \"please just give me a burger containing this...\" which was executed in a friendly enough fashion.

The saddest thing was the result of \"handmade to order in our downstairs kitchen\" cooking. Apparently even though it's \"all prepared in house\", the Elk was shipped in preformed patties, and tough as if molested for too long prior to being put on the grill. The bin was stale and I would have preferred Wonder-bread.

The bill for 2 amounted to a disgusting $48.00. Upon sharing our findings of the meal with the manager, we got the brush off.

Apparently the original location in Ottawa was a great success, but after being purchased by Cara foods, things have gone horribly wrong.

Please, do us all a favor, stop posing, and leave our fine neighborhood!

And, do yourself a favor, and never eat here.

If you are in the hood with a burger craving, try Square Boy across the street for an authentic in house tasty, inexpensive burger."}
{"text":"the food is great well prepared and lots to choose from ther service is alright"}
{"text":"The burgers are great exceptionally well prepared and the quality is over the top.  The chef was personable, caring and really went out of his way to ensure a fantastic experience.  Best burger in a long time, I will be back.

Ask for Jason, he runs the kitchen and is awesome, never seen anyone chef in a burger restaurant care as much as he does!!!  Well done whoever hired him."}
{"text":"I love me a good burger. I have seen The Works popping up all over the place and thought that this must be a sign of something different, something mmmmazing.  Mmmmazing it was NOT. A whole lot of selections on the menu that are mouth watering to read, but the burgers we received were average at best. The spinach dip was super salty. Dinner for two cost us 60 bucks with tip. Needless to say, not worth a return trip."}
{"text":"Quality: 9/10
Service: depends on patronage
Portion size: 9/10
Environment: 9/10

I don't care if they take a long time to cook the burgers. I can get almost anything I want on my burger, with delicious fries or any kind of sides. Their menu variety is amazing. Just ask the server if you can't decide, but for Pete's sake just order fast and let the good times roll.

Been there at least 5 times (danforth location only), plan to continue going. I like getting bacon and eggs on mah burger :D

This + The Burger Priest = my fav burger joints :)"}
{"text":"Love this place. It may be a little pricey but its worth your money. I usually end up getting the sweet potato fries along with my main course and the chocolate milkshake. I am absolutely in love with the fact that most drinks come in measuring cups it adds a cute touch to the restaurant. The staff is amazing, portion size is amazing and worth every penny."}
{"text":"Ugh....I am extremely disappointed with this location. I have been to The Works in downtown Brampton a few times and always had a good experience. Yet today, when I came to this location, I'm just sad. I had been looking forward to coming to The Works allll day and all I got was a poor excuse for a Crappy Tire burger and an undercooked poutine with cold curds and lukewarm gravy? The crappy tire burger has grilled pineapple, sweet and tangy sauce and Brie cheese...I just feel like there was no effort placed in preparing my burger. I got the littlest amount of cheese, pineapple and sauce that all I could describe the burger as is sad. And when it comes to the fries, how dare you serve undercooked/cold fries to your customers. The server said it was cause they don't have a heat lamp but that shouldn't matter because the fries should be made fresh to order and not sit under a heat lamp either way. Overall, I will never come back to this location and I hope they take the negative reviews to heart and do something about it! 

Ps. The server (cute with silver hair) was really nice and attentive and dealt with our fry complaints well so the service was the only good part of the whole experience."}
{"text":"I would find another place to go. Service was very, very slow. Not staffed for dinner and a large event in town. Got carryout, tipped waitress. Asked for shake when it was ready got it 29 minutes later with order to go. Asked for fries well done and they were soggy. Asked for manager, no manager on duty. Gave phone to kitchen manager (after I could here them all talking about the person wants a manager so he got the call) he said the fries were soggy cause i walked 6 blocks to hotel.
I travel and order food out on a weekly basis. If fries were well done they would still be firm.
I also watched a couple come in and wait almost 10 minutes. No one even acknowledge they were there. They were discussing going some where else, then the women had to walk to the back and ask to be seated and still had too wait.
GO SOMEWHERE ELSE."}
{"text":"Passed by Wellington one day and saw long line up for the take out burger at The Works.  Hmm thought is to give it a try one day.  So finally get a chance, no line up, great!

So order a Ho Hum #5 - Fried field mushrooms, cheddar cheese & strip bacon.  The mushrooms add a unexplainable taste to the burger.  The beef texture definitely is high end.  Each bite of it turns juicy and smell of beef - I mean real beef.  The rings are so large and wide you need at least 2 bites to finish it.  They are crispy, yummy and delicious.  With a drink, I still feel it's a bit expensive $16 for a take out!"}
{"text":"We went here for a quick lunch I just shared my husbands burger cause I usually hate beef.  Well we got the sum yung guy burger and well I devoured it lol. 
I really enjoyed this place. I am actually going back tomorrow for my husbands birthday! I also had the  poutine with the chopped up onion rings I really enjoyed it to the onion rings add a bit of salt so I enjoyed it !"}
{"text":"Ok that sucked! Nothing gourmet about their burger experience.  Dry burger and poor service.  Won't be back."}
{"text":"We went to \"The Works\" on a Friday evening to check out their Gourmet burgers. The place was fairly full but our server Cookie was great and super helpful in helping us select what to get. 

We got a milkshake to share and 2 burgers. The first burger had 3 onion rings it and the other burger came with a peppercorn crust. Both burgers looked really delicious but were severely lacking in flavor. We got the die cut fries and cole slaw as sides. 

To make matters worse, both of us got really sick once we got home. We'll never go back to the works again. 1 star for our excellent server and 1 star for the milkshake. Don't bother with anything else on their menu!"}
{"text":"Great place, great food and great service! The prices are pretty good and they have a huge menu ( I love the fact they have some really healthy options) The staff are easily some of the nicest I have came across in Toronto.  It is a great place to check out and they have something for everyone."}
{"text":"Finally got the chance to visit this place. Their menu is way more creative than I thought and the decor fits perfectly with the theme of the restaurant. Although we just built our own crispy chicken burgers and ordered a side of poutine which was amazing, I will definitely go back to try more options. Also to go in the summer for drinks and outside chilling with a huge tv. Best of all our server was so nice and helpful even though we paid for our order ahead of time assuming we will take out but ended up staying. He still made effort in showing us more options on the menu and asking if we needed anything. Love the creativity of this place."}
{"text":"Went with the family for lunch on a Sunday. Got there at 12:30 and were seated immediately; wasn't busy at all. My husband and I both got the lunch special which includes a 4oz patty burger, 16oz pop and fries. For the lunch special, you have 6 options to choose from for the burger. Hubby had Ho Hum 2 and upgraded to poutine for a couple of dollars. I had Sk8r Boy. The burgers were disappointing. After waiting 30 minutes for our food, I would have at least expected the food to be hot. Everything was room temperature. Patty was dry. Cheese was already congealed. Gravy on the poutine wasn't hot enough so the cheese curds weren't melted at all. My son had the children's special with the die cut chips. We also had a chocolate milkshake which was probably the best part of the meal. Bill came to $43. Unfortunately, we didn't think it was worth it and probably won't be back."}
{"text":"This is the best burger in Toronto. Very casual and comfy. Nice interior with garage door front windows to open up in the good weather and huge patio on the roof!

The servers were super sweet, friendly and efficient.

The menu is exhaustive. You can have a beef-turkey-portobello-veggie burger with their suggested (cutely named) toppings and /or anything you dream up. They encourage substitutions! They also have choices for buns - something for everyone.

I had weeds (aka salad) with mine, but the fries and onion rings looked great and I'll try them next time.

I was really impressed with the food and service and I felt the price was extremely reasonable for the quality.

The Works is 2 blocks from my apartment. I am going to be a regular. I predict my cholesterol is going to be going waaaaaaaaaaaay up in the near future."}
{"text":"This burger place is only for the hungry . The patties are thick and tasty. I started with their Deep fried pickles, delicious ! I ordered a burger with Cheese and bacon with fries. The burger's doneness was on the mark, the taste of the patty was good and the bun was fresh, the bun seemed to be on the kaiser side of definition, it was good. The fries were fresh cut and I enjoyed them hot. The service was timely, friendly and attentive . I enjoyed a nice pint of Sam Adams with it to wash it all down. I would recommend this burger place for someone who is searching for a heavy duty burger and is hungry for a proper burger . The restaurant's cleanliness was good and I used the facility which was in tip top shape. I will definitely return."}
{"text":"I came here with my husband and kids because we were going to see a show at the Young People's Theatre on family day. When we arrived around 12pm, there wasn't too many people, however they started to trickle in, filling up the space around 12:30pm.

The menu is a little overwhelming with so many options, which isn't a bad thing. They also have a lunch menu (4oz burgers) for about $12 that includes a drink and french fries. The kids menu value is so fantastic ranging from $7.15 to $8.76 that includes a selection of 4oz burger, a drink, and ice cream. They also have vegetarian option.

I love that the free water comes in a measuring cup. The french fries was tasty, similiar to Swiss Chalet fries. We ordered the 8 oz Elk burger for about $18 from the main menu, in which I recommend. The Kamikaze burger from the lunch menu was spicy as expected that came with their yummy house hot sauce. Also, you can choose to have plain or multigrain bun.

At the end we had to doggy bag half the kid's burgers and plenty of fries because it was too much food. It was definately a filling and delicious lunch.

The place is also clean and well kept with a hipster kind of vibe and the service was good."}
{"text":"Restaurant: The Works
Cuisine: Burgers
Location: St Lawrence Market
Address: 60 Wellington St E
Price Range: $10~

1: Poor 2: OK 3: Good 4: Very Good 5: Excellent

Food: 3
Service: 3
Ambiance: 4
Overall: 3

Extra information:

* Open for lunch and dinner
* Gluten free friendly
* Vegan friendly
* Serves alcohol
* Rooftop patio
* Lunch special

The Works Gourmet Burger opened up near my house awhile ago and I've been meaning to check it out for awhile. I've been obessed with Five Guys Burger and Holy Chuck for awhile so that's why it took me awhile to drop by.
I dropped by for lunch on a weekday to find the restaurant almost full with financial crowd. They have a nice rooftop patio that is open during summer which is worth checking out.

Once we walked in, we were seated immediately and were given a menu that was couple pages long. They offered so many options for the burger itself that it took me awhile to make my decision. All of their burgers are made with 100% Canadian beef and they take pride in all the fresh ingredients that goes into their burger.

Ordered: Hamburger Mary 3/5

* Served with mayo, egg, tomato, cheddar cheese and bacon for $14.77
* Ordered with sweet potato fries and diet coke
* You can choose your own artisan buns from white, multigrain, bunless or gluten free
* Burger patty was cooked just right
* Overall I found the burger to be under-seasoned even after I added extra ketchup and relish
* We had to add extra salt and pepper to have some flavor
* Sweet potato fries were probably one of the worst I had
* They were soggy and limp, even the spicy mayo dip couldn't save it

Ordered: Three Ring Binder 3/5

* Served with fried mushrooms, chipotle mayo, gouda cheese and 3 O-rings for $13.97
* Ordered with french fries and ginger ale
* I personally enjoyed this burger more than 'Hamburger Mary'
* Onion rings added nice crunch to the burger
* Again, the burger wasn't seasoned right and I had to add quite a bit of salt and pepper
* I personally like crispy fries and wasn't a fan of these, they were soggy

Summary: Overall, I wasn't too impressed with my meal at The Works Burger. I could tell that the burgers were good quality and all the ingredients were very fresh, but I didn't like the fact that I had to add so much extra condiments on my own. If they worked on their limp fries, I am willing to go back for another try though."}
{"text":"This place was by far the best burger place I've been to! Great service! Great patio! Great burgers! 

The burgers were perfectly grilled! The patties were really fresh and such a great selection of toppings. Also, the fries were really crispy - none of that soggy stuff. 

Service was also amazing! I highly recommend checking out this place!"}
{"text":"Decent for a burger joint. Not cheap for what you get. Average price is 14.00 for a burger. The toppings are great. For 9.00 you can get a tower of onion rings or fried pickles. The poutine was great and comes with a veggie gravy so vegetarians can enjoy. They have options like elk burgers so if you want to be adventurous then you can. The toppings on the burgers are creative and I would say are tastier than the burgers themselves. I tried the pineapple, hot peppers with a sweet and sour sauce."}
{"text":"I had the lean beef burger and was not overly impressed. The size portion was good however the meat was kind of bland. However, the onion rings were excellent. I will definitely return to try the poutine as I have read the reviews and would like to try. Service and atmosphere was great as well. Actual rating 3.5. One tip to keep in mind. Every meal comes with a side. Be sure to ask which side is an additional charge. Our waiter did an amazing job of upselling us :)"}
{"text":"Prior to your visit, I suggest checking out their website which displays delicious looking pictures for all 71 types of burgers on their menu.

Despite previous poor reviews, I came to The Works hungry for a nice burger. The menu may seem like a mess, but walks you through step-by-step on how to construct your personalized burger. 

1. Bun options: white, whole wheat or gluten free (97 cents extra)
2. Patty options: ground beef, ground turkey, chicken breast, gourmet veggie, portobello mushroom cap and even lean elk for around $3.39 extra
3. Side options: French fries, sweet potato fries, steamed broccoli, celery, cucumbers, weeds, spicy chips, lumpy mash or the bold slaw 

I tried the \"Three-Ring Binder\" - sautéed mushrooms, chipotle mayo, gouda cheese & 3 crunchy onion rings for 13.96. This combo with with ground turkey was surprisingly good - the turkey patty was not dry at all as I expected, but instead the juice was dripping at the bottom of my burger. I should have worn a bib because I made a mess of myself. 

\"The Big Smoke\" - Montreal smoked meat, sauerkraut, Swiss cheese & mustard for  12.86 was also extremely tasty. The boyfriend boldly states that this is the BEST burger he's had in the GTA, and he's a burger fanatic. 

We also tried the pineapple banana milkshake, which was an extremely rich blend, but too thick for my preference. This was served in a pitcher as seen in my picture, for $4.91 (8oz).

The \"Tower-O-Rings\" didn't come out as tall as I thought it would,  but the breading was in perfect proportion to the onion inside. It's extremely crunchy and comes with two dipping sauces (garlic mayo & spicy mayo) for 9.88. 

They also have a nice rooftop patio and a separate take-out section! I'll be back! They've got themselves a new fan!"}
{"text":"Works doesn't work for me.

My friends just hated Works Gourmet. I thought my burger was awful, and the menu seems hilariously overpriced to me. This is not a serious burger resto as you might hope from the food item descriptions, I think it's pretty bad. They make what seems like pre-fab takeout food in a sit-down with service, presenting the complete 'sucker deal dining experience' in my view.

We need to have standards based on how a place sells itself, and its prices. This is just another mediocre, mercenary 'gourmet' burger chain sucking on to the public's new interest... and forgetting that being trendy without being good makes the sham seem even worse. Many have come to Works, and many more still will leave disappointed... and feeling robbed.

OK I warned you."}
{"text":"I came here once with a friend when the place we intended to go for lunch was closed.  The menu is extensive with several different burgers, sides, shakes, appetizers, and toppings if you want to put together a burger yourself.  They also have the option for an Elk burger, chicken, or veggie.  I elected to have the three ring binder which included three onion rings stacked on top of a large burger pattie smothered in gouda, chipotle mayo, and fried mushrooms.  This burger did not disappoint, it was delicious.  The side of fries was lackluster but you can upgrade it to poutine which I should've done.  I had an enjoyable burger experience there and will definitely try to go again.  I'm anxious to get one of their 32 oz milkshakes and take that whole bad boy down myself."}
{"text":"I tried the Dead Ringer this time without the cheese. The barbecue sauce is smoky and strong, but they don't put too much so it isn't overpowering. The burger bun is perfection. Light and airy. Dry toasted to a nice golden colour (I love when restaurants dry toast or grill the buns - I don't want my bun soaked in butter). The burger patty was well seasoned and cooked through but still juicy. 

Their sweet potato fries are very good and I love the Dijon-Haze dipping sauce."}
{"text":"First off, love the atmosphere and the theme of the place. The food is always good although more pricey. Ive been here a few times and for some reason my burger always seems as if it was sitting for a bit. They've been skimpy with the slice of Bree cheese they put on my burgers which is really frustrating when you order a burger such as \"The Crappy Tire\" which contains few things on it. Regardless the burgers I've eaten have always tasted great. I just wish they got the cheese to melt and it was delivered to me early enough that it tastes right off the grill. Although, it's diversity with the burger items definitely make it worth going. It's a unique burger place with good food."}
{"text":"Fresh cut fries, gluten free burger bun and chicken burger atop avocado! Who can say no to this deliciousness? Came here with my boyfriend and we both chowed down on our burgers and fries. The salt and pepper shakers are old light bulbs - super cute in here! Great for a cheap date night. Drinks come in measuring cups as well."}
{"text":"The burger but good but the service needs work.  We were seated and waited for at least 15 minutes for someone to come to our table.  The waitress happened to be walking by and asked if anyone had helped us.  She took our order and we waited again. The burgers arrived.  We ordered Poutine on the side which was kind of a disappointment because the fries we so dark and it seemed to be recooked.  The burgers were delicious."}
{"text":"They now offer Monday to Friday, burger of the day with a side (any side you want), any burger you want beef, turkey etc. with an unlimited pop refill for $10 includes tax.  OMG what a great deal."}
{"text":"Not overly impressed with the service ( slow) or the food. Definitely not the best I have ever had or close to it.  Unfortunate"}
{"text":"Awesome food, good beer! My order took a little longer as the waitress made a mistake, so she gave me a free pint! The free beer more then makes up for an extra 10 mins wait for food. Got the Blue Jays home game burger, not to shabby, good quality burger regardless of the toppings, and there we're a ton to choose from. Definitely going back. Maybe trying the elk burger."}
{"text":"Fun atmosphere, really nice servers. I believe we met the owner.. really nice guy.

Wasn't a HUGE fan of the burgers until my last visit.. burger was cooked perfectly and very tasty. It's really all about the toppings at this place I think. Tons of options.. make sure to try to beech house sauce. Hope I spelled that right!

Great place for a group or date night."}
{"text":"After walking out of another restaurant due to a rude server and shadiness surrounding their vegetarian options we were wandering around Front street hungry at 10pm on a Saturday when we found this place.  After such a bad experience only 20 minutes before we were pleased to be greeted by the hostess with such politeness and willingness to help.  Before we sat down we wanted to confirm that their veggie burger was vegan, which is was.  Yeah!  The menu is a bit overwhelming for a first timer, but it's also exciting.  The server explained to us our options for substitutions to build our perfect vegan burgers.  The atmosphere was pleasant and the place was clean and fun to look at.  The burgers tasted good, as did the fries.  The price was pretty good to for the hardy sized burger.  I would recommend eating at this place."}
{"text":"Have visited a number of times and generally found the food was good and service reasonable.  However, visited today with family (granddaughter wanted to go there).  Arrived at 12:55 and was told we would have a 10 minute wait.  We were finally seated at 1:40.  During that time patrons at one table were moved to allow for two Royal Bank employees to take a table for 4.  We were a party of 5.
At least three groups of 3 were seated while we waited.
After being seated it was a full 5 minutes before we saw a waitress.  Having waited so long we knew exactly what we wanted, hey we could have probably quoted the menu verbatim.
Three soft drinks arrived and then 15 minutes later the two milkshakes arrived.  Delay was no doubt in part due to waitress taking an order from a couple seated after us, getting their drinks, then drinks for another table, a bill for a third (followed by getting a debit machine) and checking on a third person who had joined the bankers' table.
When the food arrived were we surprised or what.  Only a handful of fries versus the significant order received previously and black lettuce on three of the burgers.
No sign of a waitress until we were almost finished our meal.  Mentioned the lettuce to her and were told she would show it to the Manager, then she promptly placed three other trays on top of ours and handed that pile to another waitress.  At this point we had ordered another order of fries which took quite some time to arrive.
At this point my wife asked the waitress how she could have shown the lettuce to the Manager considering she did not deliver the empty trays.  Waitress said \"well I told him about it\".
Manager came by and did not apologize just stated he understo we had a lettuce issue and to make up for it we could come back another time and get one burger free.
Service of Manager doing seating was unacceptable. 
Service of waitress serving our table was unacceptable. 
Waiting 15 minutes for two milkshakes was unacceptable. 
Waiting 30 minutes to receive five burgers was unacceptable. 
Having to ask for condiments (salt & pepper) unacceptable. 
Only thing good about the experience was having a meal with our daughter and her family. 
If this is what The Works has become, see no reason to return there or downtown Brampton for that matter.

Update July 2 
Received call from the owner today at 4:15 pm.  He sincerely apologized for the bad experience we had on June 24th. Stated he had recently hired the manager and himself had been away and just opened our note.  He made it clear that the experience would not be repeated should we return to his restaurant. 
Based on our discussion both my wife and I agreed to give The Works another chance.
At least the owner was concerned enough to contact us, something his staff did not appear interested in doing, that's a start at trying to earn customer loyalty."}
{"text":"I received a buy one, get one free ad in the mail, so I decided to try The Works. It is the best burger joint that I have tried in Brampton. It is also the most expensive. There are other options in Brampton that are cheaper and almost as good."}
{"text":"Used to go there quite a bit until late last year. We ordered a burger that comes with a fried egg on top, and oddly the egg yolk was half cooked, half raw.  When we inquired about this, the waitress said it's because the microwave doesn't work as well anymore.  A microwave??  For eggs???  It also turned out that the broccoli was undercooked.  Oh, turns out they nuke the broccoli too.

Any goofball can cook in a microwave.  Never going back.  Oh and the burger meat is bland.  They just throw different toppings on the burgers so I am convinced that they are not making the burgers to order.  Sad."}
{"text":"Burgers good, fries terrible, waitress didn't bring water when asked even after meal. Got it myself and was told I should ask. Bar tender great with customers."}
{"text":"This place took over the old Pizza Pizza on the corner of Wellington and Church St.

I have been walking by here for weeks in anticipaction after I found out that it was going to be a \"Burger joint\" ressurected here. Burgers are one of my  true weaknesses and I am salivating just thinking about them.

Anyway, the place finally opens and I wander in all starry eyed with my Gf. The place seems pretty cool with a faux industrial decor and cool music playing in the background. The place is packed when we get there.

After studying the extensive menu I decided to go with the Smokey mountain burger with a side of poutine. My gf ordered the Teriyaki melt with a side of onion rings and of course we shared. We also added an egg on both burgers just cause we can. They have several other add-on options to maximize the gourmet burger feel.

My burger was really good! the poutine was also done to my liking. It wasn't the greatest burger I've tasted but I'd say in Toronto standards it would be one of my top 5. My gf's burger on the other hand was boring as hell. LOL . they mixed up our burgers at first and placed mine in front of her. She was laughing at mine becuase it looked so plain and unappetizing. Then I asked the waitress to clarify which burger was which and she apologized about the mix up. MY gf was so sad when she found out hers was the crappy one. LOL. The onion rings were ok I guess nothing too spectacular or different from any other onion rings I've tried and they were crispy. 

We ended up coming back here 3 times. Ordering the Smokey mountain burger with egg and poutine for a side. You cant go wrong with this order IMO. The last time we did go though my burger was undercooked, and my Gf's was overcooked. but 2 out of 3 isnt bad. I will keep you guys updated on our next visit.

Toronto needs decent burger places where you can sit and enjoy them.

The service was good each time I went.  

This place is on my will visit again list. Hope they keep it up!"}
{"text":"We enjoyed some quality burgers at The Works. We tried the beef and the elk. We tried Elk on the Beach and Smokehouse BBQ. Both were different and good.  The elk was light tasting and not too different from the beef.  Toppings were fresh and flavourful. As a side, we had a fresh garden salad with balsamic vinaigrette and tasty spicy diecut chips with dip. The seating is limited, so be prepared to wait a short while for a table. The wait staff was friendly and attentive. They did mix up our order a little but rectified it quickly. It's a little pricey, but the food was good and there was plenty of selection. We'll give it another try the next time we have a craving for big meaty burgers."}
{"text":"- Huge burger menu
- Service is good
- Manager came to check up on us which was thoughtful
- Serves alcohol.
- Burgers are great
- Bottomless fries
- Some of the best onion rings I've ever had"}
{"text":"Disgusting service! Both waitresses that we were served by were rude, impatient, and just overall disrespectful. We asked for some of the specials/best-sellers from the menu and the waitress hastily mentioned some of the most popular burgers, with minimal description and walked away - note: we went in at around 3pm... legit there was only one other table aside from ours. After this waitress told us she's going on break, the other waitress served us the food. 

But it gets better. 

When receiving our food, we expect the waitress to put down our food in front of us onto the table, just common courtesy & waitressing etiquette. Rather, she holds out the tray in a pushy manner and expects us to receive it, almost making me drop mine by how fast she let go without making sure I had it in my hands. 

What else? Upon paying for the bill, we gave her enough to cover the tip and told her to keep the change. She didn't even bother to say a simple thank you. Never greeted us on our way out. This is not how you run a restaurant folks! 

The \"gourmet\" burgers were pretty mediocre. At least in this franchise location. Surely they are a notch higher than the burgers you get from fast-food chains. But our burgers were quite bland - lack of sauce? And the fries were soggy, onion rings over-cooked."}
{"text":"The poutine was so good I am starting a religion in its honour.

Bit pricey for burgers at first glance but it's worth every cent. 

 The onion rings are better than a child's love.

Only criticism is that they could use better seating and more space.  Go early, this place is always packed."}
{"text":"Been looking forward to trying this place out. Very disappointed. Which is actually a good thing because there aren't a lot of branches near our place.

Had the la ultimate flamme. The burger and the whole sandwich was very dry. Very mediocre and with that, I found it overpriced. Definitely did not taste gourmet. If there's anything good that came out of the meal I'd have to say it was the fries which were pretty good.

The pictures look a lot better than the real thing."}
{"text":"I've been trying to find my way to a location of The Works since last years Burger Binge Week. Time and time again on the day I made a mental plan to visit and try one of their seemingly endless lineup of burgers, something got in the way or a meeting happened, etc, etc. Damn you life for getting in the way of my burger addiction.

Truth be told if you are a Burger-holic like me, this place is the equivilant of a Colombian drug lord. With more \"premium product\" than you could hope to consume in one sitting without killing yourself.

This year, The Works Brampton came back in for Burger Binge Week and brought out a big gun from their top secret menu - 6 Degrees of K'Vin Bacon. Holy hambone batman! Bacon and Bacon and Bacon and Bacon......zzzzzz.....  Oops I fainted there.... and more bacon and more bacon. How many more bacons was that? because there are 6 in this bad boy! BOOM

Made with a signature 8oz bacon and beef patty, grilled and piled high with Canadian bacon (pemale), smoked bacon, bacon ketchup, bacon roasted garlic aioli, and bacon sticks, with fresh lettuce & tomato. And with Yelp Check-in during burger binge week, this bacon beauty was only $5.00 (plus you got a choice of side!)

I honestly didn't even have a chance to truly appreciate how cool The Works looked inside because I was too busy with my eating, but rest assured this prime location next to the new big screen in downtown brampton is awesome and with more seating than you might give it credit for!

Looking forward to more Burgers at the Works soon!

Eatcrest Out"}
{"text":"Good place for some junk. Place is always packed as the prices are reasonable. Servers are very obliging."}
{"text":"This was my first time at this location and the services was great. I was with a friend coming from Bier Market craving a burger after all the beer we had drank. This time it was an easy decision as to what I was going to order. I saw the Chick n' Waffles and was instantly sold. I added beechhouse sauce to the it and went with the usual substitute for onion rings and a side of chipotle sauce for dipping. I love their onion rings and I think they are some of the best in the city. Oh wow, it was amazing! I loved the sweet taste of the waffles mixed with the flavours of everything else. I will definitely come back specifically for this. The only downfall is that the waffles don't hold up as well as buns do so half way through I had to start using a knife and fork, but that was fine with me. My friend opted for the Smokey Mountain with chicken and fries as the side. He said his option was really good except the fries were too salty so I tried one and I agreed, way too salty for my liking. And we washed everything down with two bulldogs."}
{"text":"We love the works! This place has ruined me for all other burger joints!

Some say  its expensive, but we find if you stick to drinking water that helps keep the bill down a lot. The water comes in humourous large glass measuring cups with a straw, my toddler loves it.

The patio is dog friendly, they bring fido a bowl of water! The inside of the restaurant is very kid friendly and is usually jam packed.

The burgers are home made thick patties and you may select which type of meat and bun you prefer. There are also gluten free and vegetarian options.

The patio is the best in the summer especially during the rose theater concerts and outdoor movies, biker mondays, the farmers market. Seated right in the middle of the action.

The works has an awesome selection of beers on tap,our favourite is a dark red that kicks you in the butt, I think it was called Boundary Ale. Its about $20 for a pitcher of beer, kind of expensive, but like I said if you want to save money drink water!

The kids menu is a bit weak, the hamburger is not a homemade patti, so I dont like to order it for my son, because if he does not want to eat it, neither do i!  I suggest they improve their kids menu with smaller portions and cheaper. I would like to see $5 kids menus or free like in the usa.   The kids do get a sundae, which is also in the glass measuring cup, its large and delicious! 

The service is hit or miss at this location. Sometimes we luck out and get a really good waitress and other times the service is terrible."}
{"text":"I've been to a few locations of The Works in the past and I'm glad to see that they've mastered a fairly consistent aesthetic and theme as well as the level of customer service. This was my first time at the Port Credit location. This one is a touch smaller than some of the others I've visited but with several sections as well as a great summer friendly patio there is no shortage of seating.

No issues with service and pricing as it's what I've come to expect from this company and it's fair and consistent.

I think my issues today lay with the quality of the burger. With so many varieties I feel like it's difficult for the kitchen to perfect any one burger truly well. My biggest pet peeve is a dry burger patty and even after making that clear today it's exactly what I got. I was told that the burgers are cooked to a standard medium well, and there is no variance on this unless you want it cooked more. The server assured me that even at that temperature it was going to be a super juicy burger - it wasn't sadly. Charred and bone dry inside. 

The burger was the  Gettin' Piggy With it, which is on their Top Ten list, so maybe I expected more? 

I don't think this is true of the brand as I've been to the Brampton and Toronto locations and always had an exceptional burger experience. This one was actually a hard sell for me and required a lot of ketchup to get down. 

Why did I not send it back? Well given what the server said to start I figured that this wouldn't change based on who was cooking it and how they are required to cook it and I was too hungry and in too much of a rush to wait for a fresh burger with potentially the same result.

I'm definitely not writing them off because as I said, I know they make quality products (like the onion rings I had today with my burger - awesome!).

I'll try them again and see if anything changes

Eatcrest Out!"}
{"text":"I went here for my lunch break and received my order 5 minutes before I had to leave. This was around 1:30, so it was the tail end of the lunch rush. There were enough people there to make them busy enough to be late with my order, but it was not fun to wait and watch the clock and calculate how fast I'll have to eat and how fast I'll have to drive to get back to work late. 

I ordered a quesadilla.  A $12 soggy, slim quesadilla full of cheese and nothing else, and, not to mention, made me sick. I know it's a burger joint and their star attraction is burgers, but if they're going to have it on the menu, it should be decent, not swimming in oil, and a size befitting the price.  Made in Mexico has quesadillas to DIE for, and they're worth every penny. 

Won't return for lunch break or any time I'm on a schedule. Two stars because they offer a side of steamed broccoli and their takeout containers are biodegradable. My server was very nice, too.  Cool atmosphere."}
{"text":"It took them over an hour to take our order and come out with 3 burgers!!!! There was only 2 other tables with people present but it still took so long. Nonetheless, the burger was absolutely scrumptious!"}
{"text":"Came here on a Wednesday for lunch. 

Pros:
- Patio 
- Great servers (Katie was awesome) 
- Tasty food

Cons:
- Pricey 
- Burgers take a while to make."}
{"text":"In the mood for a good burger around Port Credit? Drop by The Works! I'm pretty sure they have like 30 different burgers to choose from, so you're bound to find something you like. I've been here a few times and have generally had good experiences.

THE GOOD: The burgers are great! A few of my faves are the Juicy Lucy (my go to), Son of a Beech, and Nacho Libre. You can customize your burger in a variety of ways, including patty, bun, toppings, as well as gluten-free and vegetarian options. Waters come in measuring cups (ooh!) and salt/pepper shakers are lightbulbs (ahh!) The spicy die-cut chips are a great alternative if you don't want fries.

THE BAD: Despite the food being great, the service can be a hit or miss. On two occasions my bf and I have had to wait 15+ mins despite there being several tables open around us. People behind us (also pairs) got seated before us despite us waiting a longer period of time (????) A few of the waitresses seem like they don't know what's going on. So you might be stuck waiting for a seat or your bill. 

If it's a hot summer day, try to go for the patio or a seat near the window, otherwise you will likely die of heat stroke because the restaurant gets super stuffy and humid inside. 

3 stars for great food, -1 star for hit or miss service, -1 star because it's quite expensive for what you get!"}
{"text":"Im not really a burger person but I wanted to try anyway. Appetizer was great got the onion rings probably the best one ! Until I got to the burger and poutine . Nothing special about the burger or poutine . Actually for me the burger I couldn't even taste the bacon and I looooove bacon !! Anyway poutine didn't like much . But again as I said I'm not a burger person but I had better ones ."}
{"text":"Loved this place. A bit confusing at first since there's steps involved but nonetheless the variety is nothing short of limitless since there's a wide range to choose from and even a portobello cap version for the less carnivorous. The look of the restaurant ties in with an industrial look complete with fencing and light bulbs as salt and pepper shakers. Its all about marketing here and the staff are very friendly all the while helpful. However I wouldnt give it an extra star not pertaining to any food reasons other than its a bit filling but because their flooring isn't as heel friendly since both my friend and I slid a couple times walking down the aisles. Anyway definitely would come by again since my friends moving in the area so great for some hearty meals and good company."}
{"text":"Amazing and Unbelievable burger !
I rarely give anything a 5-star, but I have to say that the burger was so good!
Fresh ingredient, fresh meat, fresh bun + their bacon was wonderful.

*Wait-time: 20 mins (A couple sitting next to my table left because of waiting for too long)

*Price: 2 burgers, 2 bottomless pop, 2 premium sides = $40 + tips

Once again, TOTALLY FRESH BEEF. I am an experienced burger eater :)"}
{"text":"This was my first Works Burger I have been to and it was sooooo good (I made an instagram video with my food).

Thought all Works Burger would taste great but the location on Lakeshore was pretty bad so I wanted to give this place a 5 star! 

Food was fresh and service was great! Great environment to be at!"}
{"text":"The best way to describe this burger is \"average\". I didn't hate it but didn't really like it either. As a result, I'm going with a 2.5 rating.

It's located in the old Pizza Pizza location by the St. Lawrence market. They do have a cool patio on the top floor. Service was polite and efficient on a Sunday afternoon. 

Some of the reviews suggested going online to do some burger research before you arrive. That was a great idea since they have over 70 different pre-set burger combinations. I already knew exactly what I wanted when I sat down. 

The burgers are organized into various categories like meat lovers, hot/spicy, saucy, \"born to be wild\" and the \"top 10\".  

I went with the \"Big Smoke\" burger. It included smoked meat, sauerkraut and swiss cheese. I must confess, I really enjoyed the smoke meat & sauerkraut toppings. Unfortunately the burger patty was completely over cooked. I found it It dry with no real flavour beyond basic ground beef. A good burger should be juicy. 

I had a side order of fries with my burger - They were also rather average. The onion rings and poutines looked much better. 

The milk shakes also looked interesting but I figured I had enough calories already with my burger / fry combo. 

I doubt I will return. 

BK"}
{"text":"I was told that this place was good. And to get the deep fried pickles (I love deep fried , well, anything, but in particular, pickles).

Honestly, I don't even remember what I ordered now. It was that unimpressive but luckily, it was also expensive. 

The only good thing was the tower of rings. 

Would I go back when Square Boy is across the street and even a burger from Hero Burger is better? Nope."}
{"text":"The food is really good (except for my naked burger that comes with lettuce instead of buns. The lettuce was totally wilted and old). 
But the service was terrible. Went with 3 other people and when the waitress took our order she didn't write any of it down. And sure enough she got our orders wrong and it took forever to even flag someone down to get the right order. 
Nobody checked on us and we had to keep craning our necks to try to get a server's attention to get our bill. All the servers were busy talking to each other by the kitchen."}
{"text":"I'm really quite surprised at the amount of good reviews this place has recieved. I suppose if your experience with hamburgers is with fast food joints like burger king, mc Donlads an hero burger etc. then you will probably really enjoy the burgers here.

My experience with this place was diappointing to say the least, I guess I fell for the word \"Gourmet\" which led me to believe that these were fresh, handmade burgers with gourmet toppings. The reality is, the only thing  \"Gourmet\" about this place is the selectuion of premium toppings, which are impressive. But that's where it all stops, what I got was a dry, over cooked, chewy and quite flavourless beef burger which tasted and looked like a prevously frozen and very likely manufactured beef patty that  was very likely made in a factory somehwere. 

There was absolutely nothing gourmet about these burgers. especially for that price... My experience was was total and utter disappointment if i wasn't so hungry i would have thrown out the burger.I just didn't have the mental energy to complain, so i just ate, paid my bill and left. Noting that i was duped and that this was a place i was sure i would never return to.

For any of you foodies or real burger lovers out there that are looking for a real homemade/handmade \"gourmet\" burger, stay far far far away from this franchise, 

But If you're looking for a high end Harvey's? then you have found it, you'l likely love it.

I personally won't be going back"}
{"text":"The Works is interesting. The chain is originally from Ottawa but the original owner sold out and now they are franchising like crazy. Being from the Otown originally I still remember the lines and novelty of a gourmet burger joint. I was kinda surprised to see them open in Toronto with so much competition (five guys, hero, acme). 

In any case I was here last night for dinner. I had the No' cho burger (clever eh?) Which came with some fried tortilla rolls and a big piece of avocado. I got mash with gravy on the side. All in all the burger was pretty good as was the mash though I felt like the portions have gotten smaller since they franchised. My buddy was happy he could get a gluten free bun. Service was good and attentive and didnt mind we had brought cake from home for a birthday party. All in all a decent place but not the best burger in the city."}
{"text":"I'm really quite surprised at the amount of good reviews this place has received. I suppose if your experience with hamburgers is with fast food joints like burger king, McDonlads an hero burger etc. then you will probably really enjoy the burgers here.

My experience with this place was disappointing to say the least, I guess I fell for the word \"Gourmet\" which led me to believe that these were fresh, handmade burgers with gourmet toppings. The reality is, the only thing  \"Gourmet\" about this place is the selection of premium toppings, which are impressive. But that's where it all stops, what I got was a dry, over cooked, chewy and quite flavourless beef burger which tasted and looked like a previously frozen and very likely manufactured beef patty that  was very likely made in a factory somewhere. 

There was absolutely nothing gourmet about the actual burgers. especially for that price... My experience was was total and utter disappointment if i wasn't so hungry i would have thrown out the burger. But I just didn't feel like complaining, it wasn't worth it as it was nothing they could change without changing everything they do lol, so i just ate as much as i could, paid my bill and left. Noting to myself that i was duped and that this was a place i was sure i would never return to. This place is all about the toppings, smoke and mirrors really, they hope you won't notice the crappy chewy burger under all those \"gourmet\" toppings.  

For any of you foodies or real true burger lovers out there that are looking for a real home-made/handmade \"gourmet\" burger, stay far, far, far away from this franchise...  

But If you're looking for a high end Harvey's or a hero burger that also sells booze? 
Then you have found your utopia, you'l likely love it.

I personally won't be going back, really over priced and incredibly disappointing..."}
{"text":"Burger was decent.. everything else was contrived and subpar. Ya know those cool places that are sort of grungy but the food and vibe are still spot on so you enjoy the experience? This place trys to be like that, except it seems like they think it means they have an excuse to put out a generally shitty product. 

While many of our interactions with other servers were cordial, our server James was surprisingly unfriendly, borderline rude.

You can be the judge of the cleanliness and everything else.. 
with all the great restaurants in this area of Toronto, I don't know why you would ever choose to go here.

Giving it 2 stars to not appear unreasonable."}
{"text":"Craving a massive burger? This is the place to go.

PROS:
The menu is almost overwhelming with how many choices there are. We arrived one Saturday evening around 11:00pm. A fat burger was our late night craving, and a friend of ours recommended The Works. She raved about their burgers and since we never tried The Works before, we were willing to give it a shot. Best decision of the night.

CONS:
Maybe it was the hour, but even with an empty restaurant, it took us about 15 minutes to get seated and over 20 minutes to get the burger after we ordered. Despite the slow service, the food is amazing. It's a bit more expensive that your average order, but worth giving it a try!"}
{"text":"Been meaning to try this place for a while.  They did a good job turning the old pizza pizza into a restaurant/bar/takeout.  The upstairs patio is covered and quite cozy with a separate bar.

The menu is huge.  They must have 30 different burgers you can order. Salads too!  I ended up with the la ultimate flamme grilled.. gouda cheese, bacon, and avocado.  You can choose what type of meat you get.  Either ground beef, elk, vegetarian, chicken or mushroom top.  One thing to note is the burger didn't come with lettuce or tomato.  Basically, just what is on the menu.  I'm not even sure if you can get these as a topping as I heard someone else ask the same question - so you may want to order some extra toppings (lettuce and tomatoes are not on this list).  I think my burger would have tasted a lot better with some more garnish.  There's a number of side orders you can have ranging from fries to celery.  The chips are quite good and have a bit of spice.  My colleague had the poutine and it was massive (came in a bucket!) with a generous amount of cheese curds.

I would say overall, the burger was good but not amazing.  There are better burgers to be had in the city, but add the seating area, nice patio and bar, and makes it a lot of sense."}
{"text":"The Works is a chain, so there's a chance you already know something about them, but if not, they're known for an extensive (and creative) burger menu. The prices are about what you'd pay for a good burger at any other sit-down spot. Some of the prices go a bit higher, but with toppings such as really good cheeses and meats, I find the prices reasonable. 

I usually get the blue cheese burger with a peppercorn crust which is phenomenal, but I have tried some other things that worked nicely, too, such as \"Gettin' Piggy With It\" which has bacon and back bacon and crunchy onion bits. Oh, I am also a fan of the Love Goat (goat cheese) and the Kamikaze (spicy happiness). You even get a choice of several types of burger patty, so it's good for the vegetarians, too!

They have fun appetizers, though I've only tried the tower of onion rings, which is tasty business. 

Oh! And I appreciate that they have a couple of local brewery selections on tap and not just the usual Blue and Molson thing. 

The service is decent, but far from perfect. The servers have all been friendly, but I find attentiveness can be a bit lacking. Our last time there they forgot our appetizer; however, were appropriately solicitous about apologizing and compensating us for it. 

I definitely will return, and again--as with lots of places slowly starting to crop up in downtown Brampton--I hope it stays around for a long time to come!"}
{"text":"Great burgers and atmosphere. Better beer list and this place is 5 stars. Unbelievable menu and topping combinations. I had the Hamburger Mary, egg and bacon on a beef burger (you get to choose your patty type) because I love breakfast on my burger. Haha. Mac 'n cheese was a perfect combination. I had the Hop City Barking Squirrel with dinner and finished it off with the Hop City 8th Sin. The Squirrel was good, but the 8th Sin is Awesome!!!  Yes, 3 exclamation points. Come here to eat a great burger, drink a good beer, and have fun. One of the best things was their attention to the inside temperature. It was mid September in Toronto so it was warm out. They had the garage doors open, but it wasn't THAT warm so they had the heaters on also; mmmm.  Oh yeah, free wi-fi is great!!!"}
{"text":"Had the man cave: caramelized onions, bold BBQ sauce, jack cheese and bacon. All these, on a 8oz patty. It came with fresh cut fries. 

Overall a very good burger but it'll awards only 3 stars because the price you'll have to deal with in the end, isn't as good as the burger is. Circa a 15% less would make it a splendid deal!"}
{"text":"The Works works. *3.5 stars.

With old faithful Square Boy staring at me from across the street, I'll admit that I felt like a little bit of a traitor eating at the works, but it only hurt until I had my first bite. 

It was nice to finally have a burger which actually had flavour in the beef itself, let alone with the bazillion topping choices. The patty itself was delish and cooked properly - some nice pink in the middle! Who knew? Unfortunately, the burger was a bit dry on my second visit, thus the 3.5 stars.

Though I appreciate the 75 types of burgers, I think the differences between most are so subtle that it's a waste of print. However, points for creativity.

The service was fantastic on both of my visits as well. Ice cold beer in the summer in front of me within minutes is the way to win my heart and loyalty and though the restaurant was jammed, we had lots of attention from various staff menus, all polite and all friendly. 

It certainly isn't cheap, like Sheila B mentioned, but it can be a pretty damn good burger; definitely worth a visit if you're already in the hood and haven't been."}
{"text":"We went here to get a burger and boy did we get burgers! The choice list is INSANE and almost overwhelming. I did find a burger that fit my needs. There were many protein options all with calories listed. We ordered drinks and my ginger ale came in a measuring cup which was super cute. Overall good experience."}
{"text":"We are on the hunt for the BEST BURGER in Toronto! Stop #9: The Works Gourmet Burger Bistro

For our last stop of the hunt, we headed to The Works. It's a sit down restaurant, with a bit of a bar feel, though no bar. It has a pretty relaxing atmosphere, and is a good spot to bring a small group of friends for a casual dinner out.

The Works is a chain of restaurants with a staggering amount of burger choices. To be honest, it's an annoying number of choices. After you've finished your research on their menu and picked a burger, you then choose a number of specifics: your choice of bun (whole grain, white, no bun, etc.), your choice of side (endless fries, spicy die-cut chips, steamed broccoli, etc.), and the kind of patty. Amoung the normal choices like beef, and chicken breast, they have some standouts like a cheese stuffed beef patty, a portobello mushroom cap for vegetarians, and elk if you can believe it! I wanted to compare apples to apples here though, so I went with a classic beef patty.

On the delightful waitress' suggestion, I opted for the Dead Ringer. I get the feeling that this burger was made for some stereotypically manly man's man, like a firefighter/lumberjack, because this bad boy is filling and damn savoury. It's served on a rustic looking, firm bun, and features plenty of jack cheese, a thick onion ring, BBQ sauce, and smoked beef brisket. You pretty much don't notice the onion ring, but past that, this burger is super satisfying. It's flowing with jack cheese, melted all over that tender beef brisket. The BBQ sauce has a nice welcome tang, though it isn't mind blowing. I should say that though they do fashion the patties in-house, while eating it, you sort of get the impression that it could be prepackaged. And oddly enough, the bun, which they do purchase from elsewhere, could be more easily passed off as made in-house.

As a side I got their spicy die-cut chips, which are essentially thick cut chips, with a pleasant amount of spiciness, a satisfying outer crunch, and (depending on your preference) a nice soft inner core.

All in all, I can appreciate why someone might think of the Works as a top burger spot, considering their massive selection, and quality delivery.

This being the last stop on the hunt, let's cut to the chase and rank these bastions of burger artistry.
    1) Toma Burger Addiction
    2) Bestellen
    3) Holy Chuck tied with Wahlburgers
    4) The Burger's Priest
    5) The Works Gourmet Burger Bistro
    6) The P&L Burger
    7) The Burgernator
    8) Big Jack's Burger Shops
Bestellen shook up the game and actually forced me to consider giving it the top spot, but Toma swiftly reminded me of their masterful bun, delectable toppings, and sinful kobe wagyu beef patty. Thanks for the burgers Toronto!"}
{"text":"The Works is an incredible restaurant. Being an Ottawa native, I was stoked to see one of my hometown faves in Toronto when I moved here. Hands down the best veggie burger I've ever tried! I always get the Son of a Beach, which has feta cheese, sundried tomato, avocado, and their house-made  beach house sauce. Flippin unreal!

The burger combinations are endless - and I've loved everything I've tried. It's so simple to customize the burger to your liking and the sides are very creative. I usually get some broccoli to make sure I have room for a milkshake as well!

My *only* complaint about this particular restaurant is that it can get freezing in there. If you are easily cold (and planning to visit during the cold months), do request a booth or table far away from the front doors. They only have 1 set of doors instead of 2 (like The Works restaurants I used to frequent in Ottawa), so you are not shielded from the cold air. The last time we were there I ate with my coat on, zipped up, the entire time. They didn't really have other seats - but we had to eat!

For the most part, the service here is pretty good. Food arrives in a timely manner and the servers are friendly. There was only one time I took my husband there for his birthday - we ended up with a server who seemed like she just didn't want to be there. Odd for The Works!

Oh, and did I mention the music is always great? Like, always?? :)

I will go back to any Works location, over and over, until forever. If you haven't tried it - you must!"}
{"text":"We decided to go to the Works for mothers day, even though some of the other Yelp reviews were so good. But mama in our house wanted a gourmet burger. Overall we had a good time everybody enjoyed their meal. Our table had a peanut butter burger, a KD Burger, Blue cheese and walnut burger, and possibly the best turkey burger I've ever had. It was crusted with peppercorns and topped with Swiss cheese and Dijon. The whole wheat buns were good. Our table had a tower of onion rings which were well cooked standard onion rings with some interesting dipping sauces like curry. 

If we had to nit-pick, the sweet potato fries were not very hot, but they were tasty. The atmosphere is a bit rowdy with rock music on the sound system and industrial decor. Our waitstaff was enthusiastic and very attentive. The works is not a bargain place, but it's not really all that expensive either. You have a huge menu of possible topping choices to deal with. But that's part of the fun. I'm pretty sure we'll go back because almost everybody had at least one other burger choice they also wanted to try in the future."}
{"text":"The server was very friendly, but service was ok. I had to ask for napkins and cutlery twice. 

Decor: 3/5
I did like the cute touches like the measuring cup as a cup and the smaller measuring cup for my hot tea. The light bulbs as a salt and pepper shaker was neat too. 

Food: 2/5
I was disappointed. The burger patty was super dry and didn't really have a lot of flavour. I got the dead ringer, which had smoked brisket, BBQ sauce, jack cheese, and an onion ring as toppings. The smoked brisket didn't really have a smokey flavour and was dry too.

The portion size is good, and it's a lot of food. But I couldn't get over the dry burger. I won't be back."}
{"text":"Another place I've been to a few times and finally getting around to reviewing - thanks in part to this week's Burger Binge Week.

The Works has their name for a reason, since you have several dozen burgers to choose from. There's a number of sides as well, and they've covered about every base when it comes to burger/pub fare.

Layout is nice, and they've tried to incorporate a couple elements from local history. They're also located in one of the best spots in the city given their centrality and have one of the best patios being right on the city centre plaza.

Each time I've come here, the service has been great and food has always been fresh and timely. I was served today by the manager, who was very friendly and proud to showcase the place and know about my previous experiences.

This year's offering to the Binge Week is the 6 degrees of bacon burger. If you're reading this anytime after a week from the time of posting, you're not going to find it. There's 6 types of bacon, though the most obvious bacon would be the bacon slices and peameal bacon. Everything else is pretty subtle - in a good way. I also liked how the patty was a mix of beef and pork, with the pork adding a nice juiciness and sweet flavour to it. The peameal was the hit for me, and perhaps the regular bacon was not needed for my tastes at least. The aioli and special ketchup were great enhancers to the burger and no other toppings were needed.

Give them a try. They have about every conceivable toppings and combos you can imagine and execute it well."}
{"text":"I've been to the works burger in Hamilton and was really excited to come here. I was not disappointed.

The place itself is unique, drinks served in measuring cups, salt and pepper in light bulbs. I have never seen a set up like that anywhere else. 

And then there's the burgers. I've never seen such a flexible burger menu. There was just so many ways to construct things. Everything was so unique. It had catered options to almost everyone, vegetarian, gluten etc 

I got the sexy burger, it came with banana peppers and honey. I thought it would be weird but it was absolutely delicious. All the other burgers which was at the table was also very good. 

The service was friendly and quick. Will definitely come again ."}
{"text":"This probably one of my favourite fast food restaurant in Toronto. Their menu gives you many options to choose from."}
{"text":"I tried this place after hearing a lot of hype but left a little disappointed.  I feel like the draw is that there are a ton of different varieties of burgers but ultimately the quality doesn't live up to the price tag.

I started with a small strawberry cheesecake milkshake.  This was outstanding!  It was thick and tasted fresh and delicious!  This was definitely the highlight of my dinner.  5/5

I had the man cave burger, which was a pretty safe and conservative choice from the dozens of options available.  Onions, cheese, and bacon.  While the burger was a nice size, I felt it was a little dry.  Not a bad burger by any means but just didn't live up to the perception I had.  3/5

With the burger, I upgraded to onion rings.  The rings were cooked perfectly, with the outside providing a fantastic crunch.  I thought they were a tad bland though.  I think some seasoning of some kind would have perfected them.  4/5

The server/host that greeted us was a little rude and I felt we were inconveniencing him by making him seat us.  Our server on the other hand, was great.  Checked up on us just enough during the meal and was polite and attentive.  4/5

Overall, the meal wasn't bad.  It just wasn't as outstanding as I had hoped.  Along with the premium price tag, I feel there are better options around downtown."}
{"text":"Many, many  flavor combos, and where else can you get an Elk Burger? Best if they just list your options (meats & toppings)  instead of making up a hundred different combo's when after all you can pick your own. Trendy and over priced, but my burger was good, not FAB! Great place to try but it's $$$ for what it is. Burgers.

The girl beside me was eating her burger with her pinky finger raised, all fancy like, she must have loved her meal :)"}
{"text":"Not much of a burger person but when I am craving for a burger, I definitely recommend coming here. The restaurant is small but cozy.. The take out area has bar stools to sit on while waiting for your food, which is nice. I first got introduced to The Works when the boyfriend had a coupon for a free appetizer and we ended up trying their Tower-O-rings. They were delicious and crispy. I don't usually like anything with onions in it but for some reason I was able to devour these, no problem. I have also tried the Born To Brie Wild burger, which is everything I love. Anything to do with brie cheese, has got me salivating! This burger has bacon, brie cheese, mushrooms all melted nicely onto the beef patty with toasted burger buns.  I'm a sucker for poutine which is what I tried the next time I went to get food from The Works. My co-worker warned me about the portion size for their poutines. They are humongous, so you definitely get your money's worth. I've tried The Longhorn, which is a poutine with cheese curds, gravy, brisket in a bold bbq sauce. I wasn't a fan of since it was drenched in BBQ sauce.. But I still ate half of it in one sitting before I stopped. I've also had their Get Baked poutine, which is amazing! It's like a baked potato on their fresh cut fries with gravy, shredded cheese, bacon, sour cream & green onions. I definitely recommend this poutine. Everytime I've been here I had the food to go and in most cases I've called prior to picking up the food and everyone who works there are extremely welcoming, enthusiastic and friendly, whether on the phone or in person, which is another reason I always go back. Next up, I will definitely be trying another poutine and maybe Kamikaze burger if I feel daring enough."}
{"text":"The table was sticky, the washroom tap was not working, the napkin didn't come on time, the hipster burger was not seasoned, no salt or pepper.

For the price paid for a burger it was big and toppings were nice but 18$ is not regular for a burger so it was not a bargain. Fries had no sallt or pepper and the weeds salad was very simple.

I loved the theme and  didn't take  their humor saying \"waste removal zone\" aka washroom."}
{"text":"I finally got to try this place out. On my birthday my cousins and I went for dinner. We had our reservation for 8pm. Since we were getting late, we called them numerous times from 7pm to 8pm and they never picked up our call. It would go to voicemail every time. At this moment we were extremely annoyed. We stopped calling and arrived at the restaurant about 15 mins late. As we walked in it was pretty busy, but I told the lady that we had tried calling you for an hour to let you know that we were running late. She ignored the fact I told her about the calling and told us she will look into getting us a table. We waiting for about 10 mins before we were seated. Our waitress was really sweet but she was very slow. They had about 3 waitresses working that night. Anyway, we went over the menu and I decided to grab the Bacon You Fancy Huh?. The waitress had amazing memory, and got us exactly what toppings we wanted. She did this without writing anything down. The food was sooo delicious, so it made up for the service. I will definitely come again to try other options from the menu."}
{"text":"Amazing burgers. You can go veggie, turkey, beef and more patties to choose from, they have different types of buns, sandwiches and more. Their fries are piled high and when you add their gravy you will be in burger and fries heaven.... I could gladly just eat their fries and gravy!!!
I always get the burger with brie and pineapple  my husband gets the juicy Lucy. Never a complaint with the food! 
Four stars because they never seem to have enough staff in and it can be rather a lengthy wait for refills and cheques. Their staff is always cheery just...there should be more. Nice patio too of you like that. during events it's super crowded but you're in the midst of the action. You won't be disappointed in their quality"}
{"text":"The WORKS Gourmet Burger Bistro is just one of several The WORKS burger joints in Ontario. 

I really liked the interior decor of the restaurant.  It was apparently styled in the looks of an old car junkyard with authentic metal fences and a brick wall near the entrance of the restaurant as well as using toolboxes for storing crayon packets for kids (this place is kid friendly!) and their salt and pepper shakers were light bulbs!

The service here was really friendly and our server particularly cheerful.

We ordered the \"Three Ring Binder\" to share (the server gladly brought us a sharing plate as well as a knife to split the burger up without us having to ask).  This gourmet burger comprised of sautéed mushrooms, chipotle mayo, gouda cheese, and three onion rings.  Giant crispy onion rings are kind of a feature item here at The WORKS and there was a particularly outstanding item of a TOWER of onion rings!

The onion rings definitely were crispy and done really well.  I liked the burger too.  It was a solid satisfying burger patty and the gouda cheese and sautéed mushrooms especially made the overall burger a tasty one. 

We also had a Works Caesar that was pretty good!  It was a tad spicy and a solid Caesar."}
{"text":"I love Burgers and I can happily rate this place the best burger I have had in Toronto so far, the dark beer they have is also really great. I went with my Brother and he was also amazed at how dam good the burger was, great selection of patties, nice big menu, something for everyone! To make matters better, by accident I tipped the waitress way to much and she responsibly came to my table to let me know and fixed it, the staff are very attentive and this place deserves all the credit it can get. Oh a bit more about the patties, I had a turkey burger, it was cooked so perfectly I was blown away at the taste."}
{"text":"I had lunch here yesterday. The food was filling and good but patty was a bit dry. Wasn't juicy enough if it wasn't for the sauce it won't have been as good

I do give them credit for the recycled decor. The lightbulb salt and pepper shaker was the highlight of it all. 

This won't stop me from eating there again I just got have so more sause to it. The chippolle mayo was insanely good

Pricing was a bit high for beer but food it was decent given the size"}
{"text":"Whoa burger options! The selection is huge and it can take a while to choose! With 50+ topping combinations, some are very similar and I would prefer the menu narrowed down to 10-15 done amazingly well. I tried asking for a recommendation, but the server opted to give us more time with the menu - they were busy/understaffed. Drinks could've came a bit faster seeing as we ordered them right when we were seated. However, the kitchen kept up and the food wait wasn't long.

We had the Crispy Dills to start and they were quite good! Nicely breaded and fried. I had the Surf 'N Turf beef and shrimp burger with green and red onions, arugula, and goat cheese. My friend had the Babewatch chicken burger with avocado and Monterey Jack. Both burgers were good, but missing some flavour. Perhaps more sauce, or a better sauce, to give it a kick and make it stand out from burgers you can get at any other restaurant. I added the chipotle sauce that came with my onion rings and it made a positive difference.

While my experience wasn't anything to rave about, the location is great and I imagine it would be a nice patio spot for beers and appetizers during summer nights in downtown Brampton."}
{"text":"The outside is a little bare, with greyed out windows. I wasn't sure if it was open as I drive up.  Inside its another story, creative atmosphere and great for the kids.  While waiting for the hostess, my son and I admired the various toys and other objects half cemented into the brick wall.

I was a little overwhelmed by the menu and I'm not a big fan of design your own type menus.  So instead I choose one of the specials which had pulled pork, onion rings and a pretzel burger.  It was as good as it sounds.  My son tried it and was mad I made him order the basic kids burger."}
{"text":"Came here during Yelp's Burger Binge Week and got the Smokey Mountain with fresh die cut chips for $5.  What a deal.  I also got bottomless pop for around $2 and it was in a measuring cup, so cool!

I had a sample of this burger at a Yelp event but they were using a portable grill and it was decent but I figured I should give them a try on their home turf.  Oh boy, it was amazing with jack cheese melted on top of the fresh ground beef patty topped with bacon in between a multi-grain bun.  The texture of everything was perfect and appreciated that the burger didn't fall apart. For my side, the die-cut chips were so good too.  They are using fresh potatoes.

In addition, the server (Alex according to the bill) recognized me from that Yelp event so points for that.

Verdict: will definitely be going back once I find out how to work those tricky parking machines."}
{"text":"Great place. Good value.  They have gluten free and healthier options this was My main reason for the 5 stars. 
Service and location is perfect right in the centre of the city. Sit on the roof top. Especially on a nice summer day.  Portions are huge !   Recommend the chips and the lean elk burger.  Will be returning."}
{"text":"I have been going to work since I lived in Ottawa. Not one complain about this burger place from my past experience. Until today, one of our friend from another office came so went for a group lunch. We were a party of 7 people, since we were not crazy hungry, we order from the lunch menu where it came with pop and fries. 

I was getting ready to eat my burger, I decided to go wash my hands. I came back with no menu nor forks. So I figured, I will just borrow one of my friend's menu. As the meal progressed, it got even better, we asked our waiter to bring us our pops. He mentioned something along the line that we didn't ask for it earlier on.. anyways. I did not think the comment/attitude was necessary. He lands the food in front of you without helping you move things around, the friend beside me ended up with three condiments placed right in front of her. 

As I watched her squeezing out some ketchup on her burger, the ketchup was runny and explodes in your face. Basically, after one squeeze, the burger was drenched in ketchup. Meanwhile to the right of me, my friend wanted napkins, we waited too long that she end up getting it for herself. And last but not least, when we were ready to settle the bill, again, we waited and waited. I sat at a spot if I turned my body around to hope that I will get lucky and will be able to someday flag our waiter down, the traffic light will be in my view. Multiple times, the light went from crossing to you cannot cross, the waiter still did not arrive to help us with our bills. Yet again, my friend got up to ask for the bill, by then, we were all annoyed. One of my friend did not tip, it was an extremely disappointing experience. The patty was dry for mine, others did not have much complain about the food. One complimented on the veggie burger. Today changed my experience with the Works and I won't be back for a long long time!!! Extremely disappointing, actually if I can mark 1.5 stars above. I would. This is all that this location deserved for my overall experience. 

One final point to make is that if one franchise runs like this, it will negatively impact the image of all the other ones eventually. Just my 2 cents opinion."}
{"text":"I love this place. I expected on of those pretentious gourmet burger joints, but it's just plain great. I've been back 3 times and can't get enough. The longhorn Poutine is super Delish. My daughter and I are splitting a side size of the Poutine as a snack. Burgers are great. Staff is friendly and helpful. Can't go wrong for a laid back guilty pleasure meal. 

If you are a diet, try somewhere else."}
{"text":"It was late and we were hungry. I had heard amazing things about The Works and I wanted to give it a try. The only problem was I wasn't in the mood for burgers. 
Unfortunately for me I was craving chicken. Fried chicken. I told the server that I had come into a burger joint not wanting burgers...she laughed and then let me in on a little secret....

I cannot explain the excitement I felt when I was told that their deep fried cajun chicken could be placed in substitute to all the burger selections. Oh the possibilities!
 
What do I want in my chicken sandwich? Sweet and Spicy sounded amazing and my mouth was watering. So I ordered the \"au couture\" Fried Chicken Sexy Burger sans burger. The man had a Juicy Lucy because cheese.

We started with beer (Moosehead lager to be precise), pop and deep fried dill pickles. They were incredibly good. I would go back just to eat that appetizer again! Perfectly crunchy and juicy...and the \"Beechhouse\" dip, so delicious, you HAVE to try it!

When we got our entrees the burgers came with decent sized sides (his: fries mine: salad) The portions were large and the food was great. 
His burger was indeed juicy, and cheesy and he loved it.

My chicken was juicy but if i'm going to be honest I like it crispier than how it was coated. The mixture of the sweet and spicy was good, but not life-altering good. The insides blended well but became very boring: Sweet & spicy sauce was good and the pineapple gave it a unique kick but the banana peppers were over-powering, and the cream cheese kept clumping/breaking and it was very VERY messy to eat. I had to pull out half the sandwhich worth of peppers. That were not spicy, just very vinegary. I ordered the \"burger\" in an upgraded gluten-free bread and it was awful. I had to just remove it and eat the rest with cutlery. 

The service was great, our server was very friendly, attentive and prompt.
The venue itself is interesting and well kept.
The pricing was the only issue we had with this place. After all it's a burger joint. You wanna call it a gourmet burger?...throw some caviar, fois gras and truffles and then maybe you can call it gourmet. What we ate was not gourmet, it was very good, but not gourmet. Our bill after tax and gratuity was $70+

1 Moosehead
1 Ginger ale
1 Pickles
1 Juicy Lucy
and a Cajun Chicken Sexy Burger on gluten free bun.

I can't see us going back unless we both crave those pickles really badly....and happen to have the same craving at the same time, which in actuality is quite possible."}
{"text":"The Works Gourmet Burger Bistro has been a staple when it comes down to satisfying your deepest beef patty cravings. The menu is impressively (or ridiculously) large with burger choices, at least 20 to choose from. If you are indecisive, this maybe a bit overwhelming but your burger has to be here, somewhere...    

More than that, it offers a huge selection of other favorites like wraps, salads, sandwiches along with their respectable sidekicks like poutine, onion rings, fried pickle spears, gluten free items, milkshakes and of course booze.  

What propelled me to visit was their Baconism II menu offered for a limited time only. So to answer the question, \"is bacon a dead trend?\" I had everything bacon for lunch.

Starting with the classic Works usual suspects, I tip-toed in to my meal with crispy fried dill pickle spears. Dipped in buttermilk ranch, they were crispy, dilly and very satisfying. Best fried pickles I've had so far!

The Six Degrees of K'vin Bacon is one of 3 limited burgers on the Baconism II menu. A bacon and beef patty, Canadian bacon, smoked bacon, bacon ketchup, bacon roasted garlic aioli and bacon sticks sandwiched between two buns. 

One bite will make you squeal and remember why bacon is even a thing. I've never had something with so much bacon in it that it made me forget what bacon tasted like. That's what being overwhelmed with bacon feels and tastes like.

To balance the piggy goodness, I sampled The Hipster Burger as well. Topped with caramelized onions, avocado and Havarti cheese, it's certainly a more tamed experience which was also very enjoyable. You have the chance to taste the quality of the patty in this one, I like that.  Medium rare, a bit pink inside, at least the option was there and makes for a better burger eating experience.  

As sides, I had fries and onion rings which were both deliciously crispy and ideal versions of themselves. Nothing is worse than soggy onion rings or a fry that leaves you wanting another from somewhere else. These don't force you to cheat on your food, I guess you call them guilt free...?

Last, I destroyed a Bacontella Shake with Nutella, Canadian ice cream, smoked bacon all topped with whip and more bacon. If you like thick creamy milkshakes with the undeniable combo of sweet and salty, this one's for you kid.

Overall, I liked the location and space. Having a window seat was nice as the sun poured in and having a nice view of the busy streets in front. The service had nothing to complain about and the food was reasonable for the prices. I didn't have the best burger here, but it definitely was better than average."}
{"text":"Had a great experience here. The service was super friendly, someone checked on me every 10 minutes, the waiter was great made a recommendation to try the elk burger, which I loved. 

I really enjoyed my first visit and will be back."}
{"text":"Works Burger is another in the long line of \"gourmet\" burger chains popping up all over Toronto; I recently had a chance to visit after a few drinks at a nearby bar. 

It was close to closing time but the waitress assured my friend and me that it was no problem to serve us. The restaurant was basically empty save for a handful of patrons so we were seated right away. The first thing you notice when you walk in is the industrial, construction worker theme of the restaurant; this is a cool theme for a burger joint. Taking a look at the menu can be a little overwhelming; they have what seems like a hundred different combinations of burger. I decided on the \"Beverly Hills Lawsuit\" which came with spinach, an egg, havarti cheese and bacon strips, my friend feeling a little less adventurous went for the \"Smokey Mountain\" which had BBQ sauce, jack cheese and bacon. Our waitress warned us that they cook their burgers to juicy perfection so they may come out a little pink, this made me more excited although in my head all I could think was \"can I get it medium rare?\" sadly we live in Toronto, so no such luck. 

Our burgers came out fairly quickly, my friend and I decided to cut the burgers in half so we can get a taste of both combinations. The \"Smokey Mountain\" was ok, the BBQ sauce had a nice smoky flavour with just a little bit of sweetness, the bacon was crispy, although the patty was not as juicy as advertised by our server. The \"Beverly Hills Lawsuit\" was a train wreck, the patty was sooo dry, I was expecting an over easy egg but I got a scrambled one (menu didn't specify),  the patty in addition to being dry did not have great flavour and got lost under all the toppings. The best part of the meal was the sweet potato fries which were thinly cut and very crispy. Considering the price tag of $12-$15 for a burger and 1 side I was bitterly disappointed, the patty lacked flavour and although there are many cool combinations if you do not execute a delicious and juicy patty the burger is ruined no matter what you top it with. 

Our server was ok; she checked on us regularly and helped guide us through the menu. One nice touch they do have is that you can choose your patty, meaning you can get turkey, elk, veggie patty or even a portobello mushroom instead of beef (they have halal options as well), its nice to see a burger place cater to more than merciless carnivores like myself. Potion size was average, definitely not huge (I was expecting huge when I saw the price) but I had no problem finishing my burger.  Overall this place is overpriced and serves a mediocre product, considering the slew of other options available on the Danforth you'd be better off going elsewhere. 

*They serve your drink in a measuring cup, it's always good to know how much fluids you're taking in after a night of drinking ;-)"}
{"text":"So, I'm starting to wonder if the recent addition of approximately 6 pounds to my scale is a result of its mechanical malfunction or whether it correlates with the fact that a large percentage of my reviews on Yelp show me reviewing burgers, poutine and milkshakes. Yikes. 

On with it. 

The Works is two blocks from my house. DANGER BAY. But really, they have an extensive menu of burger offerings, similar to the Yellow Griffin's offerings in Bloor West Village. You can presumably get the toppings on any type of meat or veggie option. Then they have onion rings, fries, abundant and decadent poutines and like 6,000 milkshake concoctions (including a peanut butter chocolate milkshake). File that under \"this is why your ass jiggles\" and keep organized. 

I started (yes, started) with the Varsity Poutine, which is a poutine larger than my son's head (99th percentile a birth) and boasts a significant amount of the squeakiest, freshest, Quebeciest curds I've ever sampled, delicious gravy, really good fries and, the amuse bouche, if you will- bacon. 

How I ended up with a 2,500 calorie starter I will never know. But then my burger came, a standard cheeseburger. Also delicious. And I don't usually like burgers when served to me. I like them in theory the same way I like cable TV and e-Books but the execution is often unsatisfying. And the chocolate milkshake was fantastic. And huge. And then my heart exploded. 

Try it, it's fantastic. It's a bit industrial inside, with lots of tables, a big patio outside and an open kitchen which is quite loud and equipped with staff who loudly and unabashedly sing \"Bohemian Rhapsody\" in unison somehow. I thought for a second it was all the people I went to high school with, working in one small kitchen, but it wasn't. They have high chairs for the little ones and if you go (anytime) you'll probably be faced with a short wait. And Lord knows your poutine-eating, milkshake-guzzling ass can handle a short wait."}
{"text":"The food is okay, the service is great. I had a problem with my food and when I mentioned it to the waiter he immediately apologised and right away sent the manager to handle the situation. I really appreciated that."}
{"text":"I have tried many burgers places but this place I must say is the best by far so much to choose from. Hand pressed beef. Good portions friendly staff great location. The service and food is amazing can't wait to go back."}
{"text":"The sauce is what really made the burger for me, the patty and bun weren't anything to write yelp about. I will go back so I can say I tried 2/50 of the burger options, if I ever find a date in Brampton to go with or something. Not inexpensive with sides and drinks."}
{"text":"After watching football all day my friend and I were desperate to get our husbands off the couch and out to spend some time together away from a tv. 

We stumbled up The Works after looking for restaurants in our area and reading a few online reviews. The menu is super intense. We were overwhelmed with the choices at first but the waiter was very helpful in explaining the steps you go through to pick and create your burger. 

Overall we had two elk burgers- one with caramelized onions, havarti and avocado, one with bacon and eggs! There was one beef burger with beef brisket on top. Lastly, a chicken burger with eggplant, cheese, onions, pickles, tomatoes and probably even more I can't remember. The sides were all good as well. Their spicy coleslaw is not as spicy as expected but I really liked it. The sweet potatoe strings are also really good.

FOR DESSERT we all had milkshakes (big fatties I know). Chocolate orange, Oreo coffee, Strawberry creamsicle and Chocolate peanut butter. They were delicious. AND we ordered 8oz but they accidentally gave us 16oz. I like when that happens!

Overall it was a really fun dining experience and I really enjoyed the food. The washroom is even called \"the dumping ground\" haha.

Next time we will try the tower of onion rings- comes free if you complete an online survey found on your receipt!"}
{"text":"My family went to try this burger joint that is all the rave in Ottawa & other parts of Canada I hear. It smelled so good. It's a full service super casual burger restaurant. Which is one of the twists in a burger joint so expect to tip for service. We got there & the place was packed! But we just managed to avoid the next slew of waiting diners & thankfully got seats for 5 of us. The servers are really dressed down in casual tshirt & jeans, that's ok it's a burger place after all. Our server was very knowledgable & suggestive to the numerous choices of burgers and the swapping & mixing of ingredients to your liking. For example I had the \"sum yung guy\" burger with a turkey patty instead of beef. Note all the beef burgers are 100%hormone free of antibiotics and are handmade on the spot to order; this is one reason I suspect it took a long time for our burgers to come. The burgers are amazing and priced to reflect freshness & quality, so in my opinion not overpriced but is pricey due to all the above mentioned. They have veggie & portobello burgers for vegetarians. Burgers are priced anywhere from $12-15 but can add up quickly with the various add ons. I had onion rings with my burger which are breaded type, I usually prefer batter but they fried them to crispy not greasy perfection. We also tried the pulled pork poutine -yummy! They also have Kraft Mac & cheese as a choice for a side which is the only thing that is a little off putting for me. The drinks come in a Pyrex glass measuring cup which I do not like cause I found it hard to hold ( maybe I'm too refined) here's where you can start to add up extra dollars on your bill: you can have alcohol in your drinks or shakes. I tried the orange crush shake which is all fruit & water,it was ok. Im cutting short this review cause overall my entire family enjoyed their works burgers and would definitely go back. Oh quick note the Elvis Pressley burger sounded weird but tasted amazing cause the peanut butter was just the right amount. 
We spent for a family of 5 ea of us ordered a drink, no booze & 5 combo meals $130! Yes I had a little sticker shock because the whole place is like \"yin/yang\" you are in a casual place that serves high end burgers that takes awhile to cook so be prepared to wait for your food to cook and also wait in line for a seat. 
I can't wait to go back and try a different burger!"}
{"text":"If you're looking for a great, unique burger, look no further than The Works. With a massive menu of 50 different burger choices, and the option to completely design your own, it's got something for everyone! 
Every burger order allows you to choose your meat (I tried turkey which was phenomenal!),  and let's you choose a side. I went with the Hipster Burger, and a side of the spicy chips, both were perfect!  
Sitting on the roof patio overlooking the street helped make for an awesome experience. 
Ou, and cool to note, they serve water in measuring cups haha!
After tip for 2 meals, we ended up spending $36.00, which yes, is a little pricey for burgers, but the quality made ut well worth it!"}
{"text":"I recommend this place if you really want to get a good burger. In this place you can find a lot of types of hamburger or you can build your own hamburger. Overall, for American food this place is very good."}
{"text":"We had a good experience at The Works! It was quite busy even for an early 5pm dinner.  Service could have probably been a bit faster.  The burgers were definitely very good - they didn't disappoint on that front!  However,  we found it to be a bit on the pricey side and probably won't be back.  Still gave this resto 4 stars though because the quality of food was excellent."}
{"text":"So my friend and I came by here and try to look for the place for quite a while we finally were able to find it and realize that street parking was incredibly difficult so we left. I was super excited to try this place but after realizing how difficult it was just to find parking and find the location we left. I wish they had access to parking or had some sort of an arrangement with the parking garage that we could easily park at so we wouldn't have to worry about this each time we visited just looking for parking and finding parking streets away and then walking all the way over in different weather conditions is not necessarily the type of experience I'm looking for when I come to a place such as this. Well the food may have been amazing unfortunately I was not able to try it due to the logistics"}
{"text":"When I lived in Ottawa I ate at The Works twice a week.  I would leave satisfied and stuffed at a reasonable price.
Now that I've eaten at the Toronto location on Front Street I am disappointed.
The menu seems smaller.  The quality of the food is lacking and the service is bad.
It's not as if the place was crowded either.  It is a prime location but lacking.
The server seemed as if she felt that she not really there.  The table could have used a good wipe too.
My burger just seem blah.

All in all I will skip this place in future."}
{"text":"Visited for the first time a few weeks ago. We had veggie burgers as our mains and the spinach dip to start. 
The spinach dip was very tasty but we found that there was not enough dip and too many chips/flat bread, which in my experience never happen...it's usually the opposite!! 
My veggie burger was delicious, a little dry because it was a little burnt but the yummy toppings made up for it. Oh and the French fries were pretty good too!
My boyfriend loved his veggie burger as well. He also had a Caesar salad with his burger. The salad was disappointing as it barely had any dressing on it, I remember even commenting on how it looked dry. 
I thought the measuring cups for your cups was a cute idea, very different. 
The service was okay, we both found that our waitress was a little rude, but maybe she was just having an off day.

We will definatly be back to try again!"}
{"text":"After receiving a two for one coupon in the mail, my partner and I decided to give the neighbourhood's newest burger joint a try. The decor is a shabby take on the set of p90x, however the menu was impressive even with the punny item names.  The counter attendant was very friendly and helpful when my partner asked about the different  bacon choices on the menu. He ordered the Smokey Burger with fries. I ordered the La Flamme and was not offered fries. The attendant joked that she sometimes calls my burger choice \"la phlegm\". I should have taken that as a sign. Besides being duped out of my fries (which the menu clearly states are included in the $11 burger cost), we got to observe the cooks prepare our order as the kitchen open. And what we observed was that the  burgers start life as a solid frozen brick. So there was no surprise when we bit into our tasteless burgers. The bun, however was tasty -- not enough to save the meal though. My dining companion said the BBQ sauce was good, again not $11 good, or good enough to make up for the tasteless grey meat.  He was nice enough to share his soggy, cold, \"fresh cut\" fries with me because I was still hungry after my disappointing \"burger\".  If I am forced to find a silver lining, it would be that at least we had a coupon. This place is just horrible. Dissatisfying. Just because you top a McDonald's burger with a slice of avocado doesn't mean it's gourmet or worth $11, I means you put lipstick on the pig. A dull, dry, small, overpriced, flavorless pig."}
{"text":"Place has a lay back feeling. Food was good we ordered the full mountin which has poutine on the burger messy but so worth the mess. And my partner got the son of a beech  which had avocado, sun dried tomato and feta cheese all so good and we got the sides of sweet potato and onion rings.like I said the food was excellent but the pricing is a bit too much for two burgers and add on sides and one soda came up to $40. And the service they need to work on it a bit more there were only three tables and took a long time to get the waiters attention. Would I go back? I don't know just because it's expensive"}
{"text":"Been to the Newmarket location with my daughter twice and we love the burgers! The gourmet toppings and endless fries are great but the milkshakes are the best I've ever had! Barking at my Cow is my favourite so far..."}
{"text":"I had a horrible experience here last night (St. Lawrence, Toronto). The service was rude, dismissive, and judgmental. I tried to address it professionally with management today over email, only to receive a sarcastic one word reply. Not cool."}
{"text":"Wanted to love it, and honestly, the quality of the food was fine, but as other reviewers have mentioned, overpriced like crazy for what it was. 2 burgers, 2 kid burgers and 2 beers came to over $80 with tip. And the service was fine, except at the end we had to go find staff to bring us the bill because it was starting to feel a little like we were being held hostage. Five Guys is a better burger, for less, and you get buried under a mountain of fries. I doubt we'll be back."}
{"text":"Tried so many different types of combinations of burgers here and never disappointed. Food is always the best and service is number one!"}
{"text":"Hubby and I came here for what we thought would be a quick bite before a 7 o'clock movie. Wrong. The service was sooooooo paralyzingly slow that once our burger and salad finally arrived almost an HOUR (!) later, we had to wolf down as much as we could in about 5 minutes and then run out the door with the leftovers so we could still try to make it to our movie on time. It wasn't even that busy in there and in fact we had arrived before there was much of a crowd. The waitress took our order quickly so I think the kitchen staff were the cause for the long wait. I had a view of the kitchen from where I sat and I can honestly say that I have never seen kitchen staff move so slowly. That definitely needs to improve. 

By the time our food arrived we were ready to eat the placemats so pretty much anything would have tasted good at that point. The food was just ok and not worth the wait. I did think the measuring cup glasses and the decor were kind of cute. Our waitress was very friendly and helpful. 

Not sure I'd go back unless I had loads of time on my hands. Overall, a disappointing experience."}
{"text":"We came here on a Friday night. I had a burger. It was ok. Staffs were friendly. Price was reasonable. We would go again if we are in the area."}
{"text":"Love love love tihs place! So glad that sketch mcsketchyson pizza pizza is GONE. 

I'm not going to comment on the decor, because everyone already has.

I must say though I was wary about this burger joint phase that the world seems to be getting into. The burger's priest, the burgernator, gangster burger, etc.  

Haven't tried any of them, so i never really got the groove. 
But now i'm totally into it!!

I had the kamikze burger w/ the chips instead of fries. 

My friend had the piggenback burger (I only remember the names because of the receipt)

The mash he had on the side wasn't that great. 
The dranks came in these cute measuring cups.

I will defo defo defo be coming back here again.

Only issue:

Maybe they should trim the menu. I spent a good half hour trying to figure out wtf I wanted. I find it hard to chose anyways, and this place made it waaaaaaaaaaaaaaaaaaaay worse.


Next time, I wanna do the Kiwi burger"}
{"text":"heard so much about this restaurant and finally i had to eat here.

first impression: loved the water measuring cups! i even thought of doing that in my own home but they don't stack too well and takes a lot of space in my cupboard. loved it in the restaurant tho! also, loved the lightbulb salt and pepper shakers! so cute and unique!

okay here comes the food part of my review: i had a super spicy i forget what's it called jalapeno and banana pepper burger - holy moly it was spicy heaven i was crying and stuffing my face the same time. AMAZING! the fried chips were really good and oily - loved them very much. we also got a pulled pork poutine since i was really craving poutine that day. omg the poutine was served in a bucket. the pulled pork was a bit on the sweet side - but the rest of that poutine was ultra-delish!

sunset+patio+summer+burger+beer+poutine : life doesn't get much better than that.

nice burger joint. will def come back!"}
{"text":"3.5 stars.

Stumbled upon the place while exploring the area. While the burgers were good, I didn't really have a \"wow!\" moment. Maybe it was the choice of burger that I ordered? The Dead Ringer did lack in veggies and to me, a good burger has a good balance of vegetables within it. Overall, I like that The Works distinguishes itself from other burger joints by its variety and the use of ingredients that are not usual of burger joints (like blue cheese and avocado)."}
{"text":"The aspect of the restaurant I enjoyed most was the theme. They serve water in measuring cups and their salt and pepper shakers are old lightbulbs. 

I visited The Works with a couple of friends who had been there multiple times and guided me throughout the experience. Luckily they were there with me, as there were over two pages full of burger options which fit into different categories a la the wing flavours at Wild Wing. 

I ended up ordering the Kamikaze Burger with the Tower of Rings to start. The Tower of Rings is basically just a tower of deliciously fried onion rings. Great way to start the meal. 

The Kamikaze, as I was told, was one of the hottest options at the restaurant, and they weren't kidding. I downed over 48oz of water while eating it (the water was served in measuring cups so I could tell). The burger itself wasn't amazing, though. The selling point of this restaurant is really the variety of choices they offer.

As popular as The Works is, it's definitely deserving of a visit. However, with all of the other burger joints in the city, I don't know if I'll be coming back for more."}
{"text":"Massive selection of undreamable burger concoctions. Definitely try the Elk patty, delicious, lean and full of protein. They also offer Gluten Free buns."}
{"text":"Went to the Works yesterday and there are so many burger options that I wanted to vomit.   I got a chicken burger (black safety meat) and it was so delicious!! I want to regurgitate it just to eat it again!  I got the sweet potato fries as my side dish, but they did NOT provide chipotle dip or mayo so, that pretty much killed my buzz with those. Their regular fries are titilating though.  The only thing I didn't really care for was the measuring cup water glasses.  I mean, I know these are hipster times, but just gimme a regular glass, not a wide hipped beaker  I DID enjoy the light bulb salt shakers tho.  The burgers are like, $12 so you can't really eat there everyday, but you know what?  My mouth is watering as I write this.   I can't wait for an appropriate time to go back. I also used their washroom and it was clean enough to consider \"covering\" instead of \"hovering.\"  I like to put the tissue on the seat regardless, in case I lose my footing as I hover. FIVE STARS!!!!!!!!!"}
{"text":"The Works ALWAYS works for me !! If your looking for a casual setting with amazing food, you should definitely try the works. Its a great place to have a burger made to your perfection in an atmosphere where you can kick back and relax. 

The great thing about the works is that they have so many options, so if your a picky eater or like to try new things you will definitely find something suitable to you. They're also great at making the changes you want to your burger (add ons, etc).  

Im typically a picky eater when it comes to eating meat but they're chicken, elk and beef live up to my high expectations. 
Iv tried the \"Cracker Jack\" burger with a chicken patty on multigrain bread. The chicken patty was coated with peppercorn crust and topped with banana peppers and jack cheese, served with a hotter than hell sauce. If your into spicy food i recommend this. 
Another one iv tried is called the \"Three Ring Binder\" which is fried mushrooms, chipotle mayo, gouda, and 3 onion rings on your burger, I also added the peppercorn crust. Theyre burgers typically range from $12-$15 which includes a side but no drink.

From my experience you will love whatever you order ! Not to mention the service has been great."}
{"text":"My husband and I are always walking by so we decided to give it a shot.  

Good Points
-Lots of options
-nice and attentive staff
-Cool decor 
-Mushroom gravy

Bad Points
-DRY DRY burger.  I almost choked on it. We ordered veggie burgers so we figured they weren't aware that they do not require a long time to cook.  After reading the rest of the reviews I think this is something the company should seriously consider changing.  

-Long wait.

-Mediocre poutine

-Expensive for what you get.  (2 burgers, upgrade to poutine on both was $44 after tip).

All in all, I'd go back but I'm not in a hurry."}
{"text":"The WORKS, a burger joint turned franchise that redefines what a true burger with \"the works\" on it really means. Offering over 30 burgers with all the \"works\" toppings you could ever dream of, The WORKS puts their money where they beef is by offering 100% Canadian hand-made fresh beef, that is flamed-grill to your liking. And if beef ain't enough, their selection of chicken, elk, turkey or veggie burgers might just also hit the spot.

But before stepping into their world of burgers, I'd suggest you check out their hand scooped shakes. Made with real ice-cream and served on big and fun measuring glasses, so you never ran out of the good stuff.

Or just default to their appies and venture into the new Baconism II menu items. Like their Bacon-Wrapped Wrecking Balls, a succulent and mouth watering starter that is made with cheddar and potato, wrapped with juicy bacon and deep fried, then served with a roasted bacon garlic aioli for dipping pleasure.

Now onto their succulent burgers. Following the Baconism II tune, the Gettin' Piggier With It WORKS new addition is their signature 8oz bacon and beef pattie, loaded up with Canadian bacon, cheddar cheese, smoked bacon, bacon ketchup and crunchy onion strings. Sorry, did I mention this burger had bacon in it?

Another favourite, and part of their top 10 favs, is The Hipster. Now, don't confuse this for a white millennial  in an urban area. This burger stands on it's own with Havarti cheese, avocado and caramelized onions. The beef pattie, avocado and onions are all covered and wrapped in the Havarti cheese, making this burger one of a kind in their menu.

Buen Provecho,
Foodies Inked."}
{"text":"It was my second time eating at this location. They send out these coupons with good deals (e.g. free starter, buy 1 get 50% off etc.). With the promotion, it is a good value for the price you pay for. 

In the summer, they have a patio on the roof of their building. I like how it is above the ground so that it is not too close to the road or the sidewalk. Very friendly staff, so I am giving 4.5/5 for the service. I love how you can customize your burger with SO MANY different topping combinations! And they have healthy toppings like grilled veggies with goat cheese and stuff. My favorite part is their extensive side menu!! I always get healthy ones like steam broccolis or cucumber and celery sticks to balance out my greasy burger.

Overall, I recommend this place for people who are looking for somewhat healthier burgers/sides. If you have coupons, try this place out! It is worth it!"}
{"text":"Really good burger  Food was excellent, burger fresh, fries steaming hot.   Great place for a burger!"}
{"text":"A lot of variety of burger toppings and also the type of meat you want.. 
Like turkey, beef, veggie or elk.. 
The toppings I got were good but not amazing.. 
Very expensive for what you get that's for sure...."}
{"text":"OMFG! The food is delicious!! The buns and the fries are some of the best we have ever had!!! The burgers are juicy and cooked to perfection! We loved the decor! Especially the bathroom doors LOL! Will definitely come back!!!"}
{"text":"Hard to believe I haven't heard much about this place on blogs. They serve one of the best burgers I've tried in Toronto. The are huge and filling. They have over 50 options. I had the piggy burger which came with bacon, ham an bacon ketchup. It also came with a side of fries which weren't anything special.

The burger was great and I'd highly recommend trying this place if you love burgers."}
{"text":"Not keeping up with the Joneses. Been here a couple times and things keep slipping. This time, we were seated near a freezing draft coming from the leaky garage doors. After a 45 minutes my burger arrived, but the patty was stuffed with-surprise-peanut butter!  Glad I'm not allergic, this could have been tragic. Need to get back to 5 stars!"}
{"text":"My go-to burger place in Toronto. I am gluten-free and also a vegetarian, so coming here has always been great for me. Their veggie patties are gluten free and really tasty. The gf buns are some of the best gf bread I've ever had. Love love love this place!"}
{"text":"YUMMY YUMMY YUMMY!!! don't make this a habit or you will get FAT but for sure try this out and go back once in awhile just to tame your crave.  

the ring tower or tower of rings....ya get it it comes with 2 dips you get to choose and it is so yummy.
Milkshake...get it, you can choose 2 flavours!
The burger..DUH order it but get something unique and original.  The burger is actually really good and the staff is knowledgeable."}
{"text":"Service is garbage. Never once had an experience to speak otherwise. Burgers are decent and it's fun to try different toppings and patties but when you feel like you're scum, I don't care what I've ate/am eating."}
{"text":"I don't know if Bramptonians even know what a good burger is judging from the 5 star reviews. I've eaten gourmet burgers all over the world and this is 2 star at best.

 The 15 dollar \"Ho Hum\" burger I was given was on pár with food truck 6 dollar meal deal. The burger was underwhelming, quite dry and uninspired overall.

The French fries were SOAKED in OIL and limp, but well seasoned. (Look at my pictures if you think I'm lying, I took these photos 5 mins after I got home with the takeout box)

**tip for the owners***

Before offering 30 different burgers on your menu as well as a build your own option. First focus on cooking 8-10 different burgers well.

I visited this place thinking 5 guys might have some competition. How wrong I was. 5 Guys don't have anything to worry about.

5 stars? Laughable..."}
{"text":"LOVE LOVE LOVE LOVE LOVE! I can't say enough about this place. They have a great menu with several options for both the meat and non-meat lovers. The burgers taste amazing, the sides are great and consist more than just fries and sweet potato fries..take a dig in at the the fried pickles for a change! I haven't had a milkshake yet from here although they look just delicious. Salt and Pepper shakers in lightbulbs? yes please...my coke in a measuring cup? Why not! You will definitely leave this place with a full gallery in your phone and several new followers on instagram if you are taking pictures of your food/decor. 

I recommend this place to anyone and have brought several friends to try this place out - all have loved it! I will be coming back with more friends and hope this establishment never leaves. 

Oh..and if you come in the summer time they have a great patio up top on top of their restaurant."}
{"text":"Very good burger, not amazing but still very good #Yummy

I visited on a Friday evening. I was surprised to find out that this was a full service restaurant I thought that it would be more of a fast food joint where you order over the counter.

It was not busy at all the staff was very friendly and helpful there are so many choices of burgers that you can get as well as a different types of patties they have something for everyone if you're vegan on a diet meat lover they have something for you.

I decided to go with their son of a beech burger with a beef pattie.  The toppings complimented each other so well it tasted very fresh the toppings included sliced avocado and sun-dried tomatoes with feta cheese. Burger prices include a regular side there is about 4 regular sides you can choose from and then 4 to 5 you can upgrade to you will definitely be full it is very filling I was full halfway through. 

Next time I will definitely try the turkey burger because it's a lighter meat and I probably won't feel as full"}
{"text":"On my quest for gourmet burgers, I ended up one day in the Works. I liked the whole theme they had going on there, the environment was good, but the food was OK, nothing outstanding or very \"Gourmet\".

They tried to make the burgers really tasty but it just came out normal (i.e the two burgers that I had). Moreover, their ordering system is HORRIBLE, it is a \"4 step ordering system\", ordering can't get any more complicated than that. The burgers are a bit on the pricy side, which would have been ok if they actually tasted good."}
{"text":"Soda was flat and there were some uncooked fries thrown onto my plate. Too many good burger places around to settle for this."}
{"text":"Great burgers. Too much barter in the onion rings.

4 out 5 stars overall
Love the cups"}
{"text":"Für uns die besten Burger, die wir in unserem Urlaub gegessen haben. Freundliches Personal, riesige Auswahl an Burgern, die Entscheidung fiel uns schwer. 
Etwas teuer (Burger inkl 1 Beilage ca 15-20$), aber lohnenswert! 
Klare Empfehlung!"}
{"text":"I just ate here, my first time eating Elk and it was delicious Without the usual heaviness other burger places cause when ur full. Im full but i was able to walk 4 km homes with ease and without any discomfort after eating a massive burger 3 refills and sweet potato fries which was delicious as well. My only complaint was the ice tea, on this occasion it was a lot more watered down than i have grown accustomed to."}
{"text":"Ordered to go from here a few days ago. I had the Notorious PIG and my friend had the Kamikaze. The burgers were massive. That's the only good thing I can say about them. The meat was flavourless and dry. All we tasted were the toppings and in both cases the burgers were overloaded with the cheapest topping and that accounted for 99% of the taste. Mine was overloaded with caramelized onion to the point that about 3 tablespoons full of the stuff had dripped out of the burger by the time I was done eating. Also, the caramelized onion was extremely oily. The fries weren't fresh.
In terms of taste, some fast-food joints taste better. But, this is made from real ingredients so you won't feel sick after eating it. All the makings of a good burger are here; but the execution is terrible. Go to Burger's Priest, W Burger Bar, or the Burgernator. 
Overall, a real disappointment. Not worth the price or the wait. The kindest thing I can say is that I would choose it over McDonalds if it was the same price."}
{"text":"What a place!  Great cool atmosphere. Great selection of beers on tap. Service was phenomenal. All round - great lunch!

I have the \"porkgasm\" based on another yelpers review and it was awesome. My wife had the \"son of a beach\". She enjoyed it equally. 

We shared an order of Poutine and onion rings. The Poutine was incredible. You can really tell that the fries are fresh. Well worth it. The gravy was a little salty - but I'd order it again. 

The onion rings were ok. Not nearly as good as the fries. 

Overly friendly and proactive staff - this one is a keeper!!"}
{"text":"Burger craving satisfied successfully with an amazing stuffed burger. Staff are exceptional and friendly, food is superb. Pleasant location, in  the heart of downtown Brampton near the rose theater. We have been back and plan to continue to do so. Adore the pan like serving trays and the measuring glass drinks. It's creative and pleasantly different."}
{"text":"We came here for burger week last night, and really wanted to try the Grid.  Sadly they were all sold out.  I think burger week was a bigger promotion than they intended.  The communication was fairly poor, by the time they came to get our food order, at least 20 to 30 minutes after we were seated, we were told it would be at least an hour for our orders to come out.  That's a crazy long wait time for a burger.  They ran out of bacon, cheese and something out.  Craziness.  I'll think about coming back.  Maybe."}
{"text":"I loved the upper patio! It was cool to be able to look over the street while we were having dinner. Drinks are served in measuring cups which was different and unique. As far as the food goes, it was reasonably priced. The juicy Lucy
And born to Brie wild with beef were good. The three ring binder with a turkey burger was unfortunately dry. Fries were good and so was the bold slaw. We could have done without the attitude from the waitress when we asked her to clean the bird poop off our table though."}
{"text":"Overpriced for what you get.  Burgers are delivered lukewarm.  Feels like you're dining in a car dealership with the constant pressures to up sell by the wait staff.  Owner is a bit of a jerk. 

Despite this, the food is reasonably tasty.  Wouldn't recommend frequent visits."}
{"text":"Just had a great dinner at The Works. There were so many different combination of toppings to choose from. The wait staff was also very engaging and eager to help. This is definitely the place to go if you want to sit around with friends or family and have a great burger."}
{"text":"Not only did my friend get a chunk of plastic in her food (from some kind of dressing bottle)
But the burgers themselves were extremely greasy, and there was a lot of grizzle! Yuck!!!
The poutine was good, but after finding a chunk of plastic in the salad, I was worried about eating that too.
They didn't offer any compensation for the choking hazard that was in the meal. 
Had to ask for a fork, had to ask for toppings on my burger, twice! Even had to ask for napkins! Clearly needed a stack of napkins for how greasy the burger was. 
The place was empty, other than my table and one other table, and it still took 40 minutes to get our food. Unbelievable!!
The bill for three burgers was $80. Sadly enough the burgers were not even eaten. Should have went to Wendy's, or A&W or even McDonald's..."}
{"text":"Love the selection and variety that The Works offers. 

I visit this location every single time I'm in Toronto (3 times in the past year).

The service is consistently superb and I always look forward to dining here. My partner and I have made it our mission to try every single item on their menu. 

Most recently, I had the Six Degrees of K'vin Bacon Burger, which was tender, juicy, and satisfying. It is definitely a must-try for any bacon connoisseur!"}
{"text":"Great food, great employees, great service. I've been here numerous times and have had a positive experience every single time. I can't recommend any specific burger because they're honestly all good but the spicy die-cut chips as a side are amazing."}
{"text":"Eh. Been here for so long. The menu. No pictures. The service. Apologizing. Waiting. For some sign of food. Other patrons seem to have what I lack. But alas I will wait. For what. I can't seem to remember anymore. This place. Isn't. \"Working\"."}
{"text":"First off, I really enjoyed the decor of this establishment and their menu!
There were all types of burgers with all sorts of toppings and sauces! Each one of them had their own cute little unique name to it. For example there was a burger called the \"Hunka Hunka Burnin' Love\".

If you're a first timer, you will definitely be overwhelmed for the first time when you look at the menu. It has so many options, it's so hard to choose what to try! You might have trouble ordering your burger but the waitress/waiters will take you through a mini lesson on how to order. 

There are four steps to ordering your gourmet burger. The very first thing you do is choose the toppings/burger that you want and then you choose your patty. Then you choose the type of bun and then finally you get to choose your side dish. You have the occasional fifth step, where you can get extra add-ons or upgrade your side dish at an extra cost.

Let's get to the food, I ordered \"The Beach Boardwalk\" burger with a ground beef patty on a whole wheat bun with a side of sweet potato fies. Some of my friends ordered poutine and the others also got burgers. The wait for the food was long so be warned!

I really enjoyed my burger but I just wish that the burger patty was a little bit more juicy and not all dried up. The toppings definitely enhanced the flavour of the burger but when you're eating a burger, the patty is the most important part. I mean, what's a burger without a patty, right? I was a little disappointed but the toppings really help fixed that. The sweet potato fries were just your average sweet potato fries. I tried a little bit of their poutine but I didn't really like the taste of it so try to avoid ordering it or if you want to give it a shot, go ahead!

Overall, it's a nice cozy place to just kick back with some friends and eat some burgers. Nice decor with funny signs placed all over the restaurant but my favourite thing about this restaurant is that they serve their drinks in a cute little measuring cup. I would definitely come back to try their other toppings."}
{"text":"Came here on a Saturday evening, expecting that it could be really busy, was ready to wait.  Instead, there were still a handful of tables available. We were seated by a very friendly (what I thought was the host).  She then later was our server for our table. 

I had been to a Works Burger in Ottawa, so I was familiar with the menu and the way the ordering works.  I went with the Crappy Tire burger (Teri Sauce, Grilled Pineapple ring and brie cheese).  Also had asked about the milkshakes and as I was requesting something that wasn't on the menu, our server told me that it was unfortunately not available, however she agreed it was a flavour that should be available.  When I suggested she make that a suggestion to the manager, turned out she was the manager of the store as well (Host, Server and Manager).  I ordered a milkshake anyways.  One our party wanted coleslaw and it turned out that they had run out but were getting some in shortly.  She apologized for this and said that she would discount our meals.  However, 2 minutes later, she said that the coleslaw had just come in.  

The meals were delivered and they all tasted very good !  Burgers, Buns, coleslaw for some, fries for others, were all very good.  

At the end of the meal, we asked for our bill and sure enough she had discounted where she said she would, which she didn't have to as the meals that we wanted were delivered exactly as what was requested.  And she also gave us coupons for milkshakes for next time !  How fabulous is that ?    Thank you Emily (Host, Server & Manager)."}
{"text":"We dined here for their 15th anniversary on April 5 2016, where every burger was priced to $5.15. (Regularly $15).

- Large portions, 8oz patty
- Gigantic menu, vegetarian/gluten-free options available
- Friendly staff and service, we were seated immediately and food arrived in a timely manner
- Deliciousness.... perfectly cooked, succulent beef burgers. It got a bit messy, so keep napkins handy! Or use a knife and fork if you'll like.
- Also, they were collecting donations for the local food bank

Conclusion: OMG so many options to choose from!! Some really creative ones (peanut butter and banana?) -- we'll be back to try other burgers for sure! 
And yes I would pay the regular price for it.
And yes you should give it a try.

Tip: Weeds = salad!!"}
{"text":"I ordered the the hipster burger came with avocado and I got an egg on in. The burger bun was stuck to the bottom of the take out container. So the bun was completely destroyed. I could not eat the burger properly. The egg was under cooked.  It looked disgusting. The burger patty was tasteless. Literally no seasoning in it.  They could have at least added some salt and pepper. It was the most bland meal I have ever eaten. I got a poutine as a side which was the only thing I was able to eat. Check out the photo you can still see bit of the bun stuck to the container and the raw egg."}
{"text":"Wahhh :(
I wanted this place to be good. But, the burger was a huge disappointment. 

 I got a good vibe from the place when we initially walked in on a sunny, but cold Sunday afternoon around 2pm. There were quite a few people siting and eating at tables, even at this time of the day. Good sign ...

The servers were super nice and attentive, and kindly sat us (bf & me) at a table, even knowing we were getting take out. They explained out the menu worked:
Step 1 - pick a patty 
Step 1 - Burger toppings 
Step 3 - Bun option
Step 4 - Side dish
and then optional Step 5 of add-on's.

Wowwwie. 
That's alotta choices. Especially when you see how many burger combinations they have. The names of each burger are totally gimiky and well ... made me feel like I was more at a Jack Astors', then I realized The Works is a franchised resto, and it all made much more sense.

After getting a good explanation of the monster menu, I chose the \"Get in my belly'; \"caramelized onions, sour cream & bacon chunks.
$12.93, includes a side; i chose the fresh cut fries.

Nothing was great."}
{"text":"I have always wanted to pay a visit to this burger joint and finally got to try it last week. No disappointments there! Though, I think I was most fascinated by the glass measuring cup that held my diet coke. Wow. What an idea!

If you are indecisive, The Works' menu is your worst nightmare. There are enough menu items to make your head spin. But I have to give it to this burger joint for coming up with some pretty fun and pun-filled names on their menu (my favourite is the Six Degree of K'vin Bacon). You can either build your own burger or choose one of the signature selections on the menu. I had the 'Son-of-a-Beech' burger with avocado and feta cheese, and a friend of mine had the 'Notorious P.I.G.' with strips of Bacon, which looked (and I'm sure tasted) better than mine. 

The patty itself, I wouldn't say, is anything groundbreaking, but it does taste very genuine, which is what you would expect from a place like this. However, my friend and I did not end up finishing the entire burger mostly because the patty was monsterous in size. Therefore, I would recommend to just order one burger to share between two people (particularly if you are not a big eater)."}
{"text":"I was very skeptical about this place as it seemed to be in the tourist trap area and my bus driver recommended it to me.  We started with the Bacon wrapped cheddar tutor tots with more dipping sauces than we could imagine.  Very unique appetizer placed on top of bacon chips ( never heard of these before) but the taste and portions are both very good.  I like the fact they don't charge you for every single sauce either.  Then the overwhelming task of finding a burger begins.  I just decided to go with one of the top 10 they recommend and went with the lucy juicy which is filled with cheese.  Again the burger had great taste and cook very well.  The cheese inside is flaming ht and comes squirting out with eat bite.

Great food 
Great Service
Great Vaule
Greta Portions.

I would definitely recommend when I'm back in the area.  

Thanks double decker bus driver."}
{"text":"2 Stars is for the service as the waitress and waiters were excellent. 

The food however was just Eh I ordered a beer, Bloor West Elk Burger and fries and my wife ordered the KD Dinner burger and fries.

The quantity of food they give is impressive however I found the burgers to be overcooked completely. Although the concept of having 101 types of burgers is impressive I found it to be a little overwhelming and Gimmicky.

Burger restaurants are popping up all over Toronto these days but I just would go here to say I have tried it but a return visit is unlikely....

It was overpriced as well save your money and your appetite and go to Capitano on Yonge south of Bloor you will not be disappointed."}
{"text":"the works?! in Brampton?! whaaaat? I never knew this place existed in btown but it does and it's amazing as always! the menu is huge, loads of options (sexy burger is a top runner in my books), the poutine is always perfect and the service is on point."}
{"text":"I came here at lunch time during burger week a few weeks ago. 

The special was the War Pig on for $5. This came with fries which were nice. But the burger and the patty itself was pretty dry and didn't come with toppings. That was a little disappointing. Normally, their burgers run for $10+. Not really worth it in my opinion. There are definitely better burgers out there.

The decor of this place is pretty cool, they had light bulbs for salt and pepper shakers and they used measuring cups to serve their drinks in. They also had some random bras drapped over everything.

A nice touch to this place is they have a rooftop patio and a seperate take out section (great for the area with lots of 9-5ers)"}
{"text":"Visited this restaurant with a group for lunch.  The menu is creative with some really good burger combinations.  I had the 3-ring binder that came with fries, I added an order of onion rings, and my girlfriend ordered the same burger. While the burgers were good they certainly weren't $13.99 good.  Dinner for two was $45...   For burgers!

While the food was pretty good I can't justify paying so much for something that's so easy to make at home.

First and last visit for me, the consensus was the same within the group."}
{"text":"I came here for a quick work lunch. Overall food and service was good, so I will come back here again.

We came a little earlier than 12 (since we had a big group) and we were quickly seated. Our waitress was very attentive and knowledgeable about the menu. I ordered the \"Smokey Mountain\" from the lunch menu, and it was very filling even if it was a 4oz. burger. We also had their awesome milkshake, it is on the sweet side, but it definitely was delicious. My co-workers also had great experience with their food, and we were all very satisfied at the end.

One note though, it tends to be jam packed quickly around lunch time, so one recommendation is arrive a little early to avoid waiting in line for seating. I personally will return again for lunch!"}
{"text":"OMG I love this place

If you are hungry try the Hangover burger with poutine. 

Guaranteed it will be the only meal of your day 

Amazing burger"}
{"text":"I had a burger with avocado and pineapple slice.( I couldn't remember the name)
But to me it just the best burger in my life. 
If you want to customize your burger, 
There's no better place than this . 
I love their sweet potato fries too."}
{"text":"Great service, amazing food and cool atmosphere. 
Went with my mom, wife and kids. Had the juicy lucy, first date and cracker jack. All solid. Hearty poutine and rich milkshake.
Definitely going there again. Two thumbs up."}
{"text":"#YELP #BURGERBINGEWEEK #BURGERSTO #SMOKEYMOUNTAIN

Like Bernie, I came here during Yelp's Burger Binge Week (TWICE) and got the special - Smokey Mountain with a side for $5. What a deal, I'd totally dump a hot date for that. I got the Die Cut Chips as well, and that's a perf non-boring pick. So let's rate.

The Bistro:
Not a huge area inside, and I would only suggest sitting indoors during winters. This place has an AMAZING patio that shouldn't be missed. One of the best patios in Brampton, hands down. The place is always abuzz, so even if you are by yourself, you can steal some Starbucks wi-fi (next door) and people-watch whilst enjoying your burg burg. 

The Burg Burg: 
I can only comment on the Smokey Mountain. That's the only one I've tried. It's a massive burger and it feels like a really good heart attack. You get to choose the bun - multi-grain is a healthier choice. The beef is cooked to a sizzling medium well that's still pinkish inside. And the melted jack cheese adds a nice flavor. Unfortunately, I don't think they have add ons - mushrooms, onions, lettuce, etc - like the other places do. But even without, and with just ketchup, mayo and mustard, this burger surpassed my expectations. 

The Die Cut Chips? 
This is a must try side. It's not spicy as it claims to be, and I am totally okay with that (not huge on spicy). I wish we could pepper it with a choice of our flavoring - sprinkle some BBQ powder or cheese. That would be a nice add on. 

Price: 
Obviously, I got a fantastic deal. You... probably won't. And will have to pay that $13 something for the burger. I say, it's worth it. My boyfriend doesn't agree... but hey, if you've never tried The Works before, spend that money and get yourself a burg. You won't repent it. 

Verdict: 
Can't wait to come back on another summer night. 

ANKIE TIP: 
You'll have to pay for parking around this area during the day. Call them up at The Works - they usually know some free parking around the area and will try to hook 'em up. Otherwise, after 6pm is usually free."}
{"text":"I've been here a few times now and I've enjoyed the burgers both times. I kinda wish that they have in the middle size for the patty. People there seem to be friendly over there. I look forward to visiting these more in the future."}
{"text":"Service = A+
Stephanie, our server was excellent. She explained all parts of the menu to us Yanks. She accommodated all requests and made sure everything was good. Checked on us frequently.

Food = A+
Had the 3 ring binder (with ELK MEAT), mary burger (stuffed), and soprano (veggy) were all delicious. Well cooked, perfect portions. Wonderful introduction to poutine.

Prices = B+
Well worth the price even though it is a touch high. But the price is justified with how good everything was.

Ambience = A-
A whole in the wall feel, but very casual and ra.. Decent music."}
{"text":"Came here for lunch on a Thursday & although we made reservations, you could've easily gotten a table if you walked in off the street. Because its a \"gourmet\" burger joint, we figured it'd take a while to make,  & pre-ordered via phone at 12:45 pm. Food was ready & waiting by the time we got there at 1 pm.

I ordered the \"Man Cave\" burger with fries & I have to say....it was one of the *BEST* burgers I've ever had! =D The smokey jack cheese and *SWEET* caramelized onions complimented the amazingly seasoned, beef patty soooo well!

The fries however....& this could have been due to the fact that we pre-ordered & they were sitting around for at least a good 5 minutes, the fries were soggy. =( Soggy from sitting around, getting cold, & having its own oil soak into it. The only good bits were the fry \"crumbs\" that stayed crisp & crunchy, because they're so small. But those were crumbs!

Service was very friendly from the Hostess to the Waiter. Although we kept trying to get this Waiter's attention for glasses of water, this didn't happen til we were halfway done our meals. And water or drinks of some sort WILL be needed as the food is laden (tastily) with salt. So make sure to order liquids as soon as you sit down. Very cute how their drinks come in Pyrex measuring cups btw. =)

Overall, 4 Stars because while it wasn't the optimal dining experience, it just about was. I would definitely come back for sure.  =)"}
{"text":"Way overpriced for an average at best burger.  Fries I liked, also had some good beers on tap that was about it.
They have plenty of options and some of the specialty burgers sound good, but you can get a better priced and much better tasting burger lots of places now which offer huge range of toppings.  Really no reason I can see for the price.
I don't think I'll be back"}
{"text":"My favourite summertime burger.   Or get the Nacho libre with chicken. It is a bit slow in terms of service but it's good food."}
{"text":"burgers are very big portions here.

definitely order the onion ring tower to share...

Milkshakes are tasty! My personal favourite - the vanilla one."}
{"text":"Oke here it is
2 burgers with fries for $40.00.
The burgers should of been tasty right? wrong! Juicy right ? Wrong! Dry as can be!! The coleslaw was bitter! I sent it back for fries that were oke..... But come on 40 bucks!
We will go to 5 guys next time for half price twice the taste half the grease and no attitude! Plus the are no waitresses to tip.
Plus free peanuts.
Think twice before you blow your burger budget here. Don't know how long they will last.....
I got home with a sick stomach. Heart burn."}
{"text":"Heard about the joint , so decided to try it out,.....ok so I love burgers , watch EAT street all the time , and they had raved about his spot , especially Juicy Lucy burger with stuffed cheese ....loved the jugs they served the pop in that was cool , music was good ....but let me say if to I hungry don't go here , it took them 45mins to get out order to our table and it wasn't even busy at all , fries were not that tasty , felt as if they were rushed .....as for the burger , cheese tasted good , but the whole damn thing fell apart as soon as I took one bite, spent most of the time arranging it , need to put a stick , pick or something to help hold the damn thing 

So why 2 stars , well service was slow and didn't enjoy the burger , as soon as the cheese popped out , it was a regular burger ...."}
{"text":"So in the spirit of burger week in Toronto, I decided to visit a brand spankin' new burger bar in the hood that's NOT offering the $5 burger specials.  It was storming all day and I was too lazy to hit the gym.  That's when I decared I was going to go all out and call it a \"fat day\"... and a fat day it was!

Arrived at 8:30pm, this corner block restaurant is a lot bigger than what it seems from the outside.  The two of us were greeted and sat by the host.  Right away, I concluded that it had a good vibe with some background music and friendly staff.  But wait, something was missing.  Why do they NOT have TVs?? I was really hoping to catch the NBA playoffs!

If you have read my reviews before, you probably have noticed how difficult menu-ordering is for such an indecisive food-lover like myself.  The Works decided to make it even harder by having a million choices on the menu!  I hate it... I love it!  

Butterscotch Chocolate Milkshake: $3.97 Kid size (4.5/5 stars)
In addition to a beer, I've really been a sucker for milkshakes lately, and since it was a \"fat day\", I went for it.  SO MANY to choose from, but this one hit the spot!  Oh, and all drinks are served in a measuring cups! TOO CUTE!

Tower O Rings: $9.69 (3.5/5)
A little pricey, but the portion is fit for 3-4 people for appetizer!  Huge onion rings stacked on top of another!  You get 2 choices of dipping sauce and we got the chipotle mayo (ALWAYS get chipotle!), and the curry mayo (ACTUAL curry flavour!!).

Sk8r Boy burger +banana: $12.78 (4/5 stars)
I really wanted to get the Hunka Hunka Burnin' Love, which is peanut butter with bacon and banana on your choice of patty.  Can you spot what is missing on this? CHEESE!! How can you have a burger without cheese?!!? Then I saw the Sk8r Boy, which is the same thing but with jack cheese instead of banana.  I did what Superwoman would do: get the Sk8r Boy, and ADD BANANAS!! Oh I am a genius!  Only criticism is the thick beef patty was done med-well to well, so a bit dry for me. 

Dead Ringer burger: $12.89 (4/5 stars)
BBQ smoked brisket, bbq sauce, jack cheese, and a onion ring.  I was a little hesitant with this one at first 'cause I don't like the sweetness of bbq sauce.  But then, who doesn't like meat on meat?! It actually wasn't that sweet at all, but again, a bit over done for me.  Definitely asking for a medium patty next time.

Service: (5/5 stars)
She's awesome! Patient, friendly, and attentive.  Extra star for sharing the same great pb and banana burger taste as me!

I love the menu, although a little overwhelming.  With all the choices, it brings out the worst in me.  But it is so descriptive and funny to read!  Salt and pepper shakers are in light bulbs, the decor is all construction-themed.  I also noticed the front wall is a garage-style door that opens up during sunny days.  They definitely need TVs, but either way, I am coming back as many times as it takes me to go through the entire menu!!! Sponsors? (If serious, send me a msg! haha)"}
{"text":"Just like the name, it's a \"gourmet\" bistro, so stop complaining about the price. If you aren't willing to spend $25-30 at a burger place, then go somewhere else cheaper. 

We ordered a Turkey burger, Three Ring burger (beef with onion ring), fried pickle and a kid sized oreo mocha milk shake. Everything was absolutely amazing, especially the turkey burger. It's the most juicy and tasty turkey burger I've ever had. 

Be aware of the large portion sizes they serve. We were way too greedy to order double turkey patties and extra mushroom topping for the beef patty =P"}
{"text":"We went for lunch today. The service was very friendly. It took 30 mins to get 2 burgers though. My husband's burger was good. He got the Jamaican jerk burger. 
I got the feta burger (can't remember the name) but it was super dry."}
{"text":"I finally decided to make my way down to The Works Burger Bistro in Brampton on Sunday July 6th.  After tasting a great burger from The Works at the Burger Binge Kickoff party up at Hole E burgers in Bolton, I wanted to get the whole experience of the restaurant and the menu.  I am almost sorry that I went there.  Having worked in the hospitality business for 15 yrs in almost every role, I was quite disappointed. 

Location: 
Centrally located on the corner of Queen and Main St in downtown Brampton.  The restaurant has a great view of the city square and the Rose Theatre.  I went on a Sunday, so the absence of foot traffic was evident.  I could see on a busy workday or Saturday, the restaurant could be filled quite easily.  Parking is ample in the area, with lots of public spaces within a 5 min walk.

Restaurant:
The restaurant has been built along the side of building in the Brampton City square, thus the shape of it has an oddly triangular feel, the indoor seating I would suspect fits around 20-25 tables ( I am guessing as I didn't really sit indoors that day).  The patio has about 8-10 tables (40-50 people) and sits along a public pathway.  There are enough umbrellas for the amount of tables, but there is no covered areas (natural or man made) if you are looking for shade.  The restaurant looks clean and kept up.  

Staff:
I was greeted at the door promptly by either a hostess or server (within 2-3min) and I asked if the patio was open.  I was informed that it was and I was escorted to my table and given a menu.  I was told that a server would be by shortly.  This is where my excitement for eating there would slowly turn into a service issue.  From my experience, there are Steps of Service that should be followed in order to give a great guest experience.  Unfortunately, the only thing that was prompt was me sitting down and me paying the bill.

 During my visit, the restaurant had 3 servers and 1 host.  There was total of 5 diners on the patio and 6-8 in the dining room.  It was not busy, by any means.  I arrived at 1:15pm and a server did not come to my table until 1:30.  I ordered an Ice Tea and placed my order at the same time (I had waited 15 min for someone to come to my table to take a drink order, so I might as well have ordered everything). After my order, I proceeded to wait another 15 min for my drink to arrive. I actually got so fed up that I asked another server on the patio to go find my server and ask what was taking so long.  I noticed that my server was very chatty (which can be good, but if your going to chat with the regulars for 10 min while I am looking at you to bring a drink, there is an issue).  My food finally arrived at 1:50 pm (40min for a Burger and fries).  I was going to start eating, but again...no cutlery, no napkins, no condiments were brought to the table.  I had to wait till my server came back and I asked him for all the above.  I ate my food and asked for the bill (which came promptly).  The total time spent at the restaurant for a burger, fries, gravy and a drink on a Sunday afternoon with a total of 12-15 people in the restaurant 1 hr and 10 min. I left with a bitter taste for the service at The Works in Brampton.

Food:
Great selection of burgers and tons of options.  I was quite excited at the variety of burgers.  They also have a great idea of unlimited fresh cut fries, but after eating the \"Getting Piggy with It\" burger I was full. They also have a gluten free menu and other meat options if you don't like ground beef.  I was quite intrigued by the \"Elk burger\".  The portion sizes are generous and the non-alcoholic drinks come in 2 cup measuring cups. I was convinced, that coming back may be an option..if I don't get the same service like I did at the Brampton location.

Overall:
Great food! Great selections for kids and adults.  They put a spin on some old classics and make it fun to order.  You will leave full and happy on some Burger goodness.  The service is what makes me not want to come back here.  I might try The Works in Burlington."}
{"text":"Amazing place! i love the atmosphere and the staff. I love that the patio opens up during the spring! its a cool hip place to be"}
{"text":"I went here hungover, so take this review and my impressions with a grain of... well... hangover.

I had been meaning to go for quite some time, and decided it would be the cure for what was ailing me.  Ate on the patio for lunch, which has a lovely view of the area.  I would say that the ad/wrap they have around the railing kinda blocks of the view, and would recommend they do away with that.  Seating-wise there were lots of options, as it was maybe 1/2 full (1pm on Sunday).

My server (Jessica) was awesome from the get-go.  Water (in a measuring cup no less) right away, plus a prompt drink order of a Caesar.  I asked beforehand how their Caesars were, and she said they were great.  She was right.  One of the best I've had.  Just a straight forward one with celery.

Asked for a recommendation on a burger, which she offered a couple of choices but that her favourite was the Juicy Lucy.  Cheese stuffed burger patty?  Nnnnnice.  Paired with some delicious onion rings with chipotle mayo on the side.  So. Damn. Good.

The only knock I will give it was the price.  All in for the burger/rings/drink+tax/tip, I was out $32.  Ouch.

This is one of those instances where I wish I could give an extra 0.5, as the price hit shouldn't take it down a full point in my opinion.  

4.5/5"}
{"text":"Came in for a poutine, yes my poutine, and left with a take out container. The portion was massive, even for me. For under $10 it was very filling. My water came in a measuring cup. 

The ambiance of The Works is grunge meets modern. It has a fake electrical pole, painted on art of gauges and some other stuff. Pretty cool. 

The service was top notch. I also enjoyed the subtle reggae music coming from the kitchen. The chef had his own beats happening in there. 

I would return, maybe with a bigger appetite or someone to share a meal with with. 

OH THEY HAVE ELK BURGERS!!! Didn't try it, but it'll be my excuse to return!"}
{"text":"Best burgers ever! They are delicious and you cannot find something that won't suit your taste! They have all kinds and some might even seem a little weird but hey, who am I to judge! They do warn you it takes about 20 minutes to cook their burgers so if you are in a hurry, you are warned. The staff has always been very friendly with us and we enjoy going back whenever we feel like having a good burger. They have an original concept! I love it!"}
{"text":"Glad that The Works has come to Toronto ! More are coming to Toronto; locations in the Beaches and Leaside are going to soon open.

My pal and I walked in at around eight o'clock on Saturday night. It was really busy so we had to wait for about fifteen minutes before we were seated.

The menu is really, really, really long. You have a variety of burger toppings to choose from. Once you do, choose the type of meat you want (veggie, beef, chicken, ground turkey). Each burger comes with a side.

KD Burger (Kraft Dinner) on ground beef with onion rings was what I ordered.

Delish !

Drinks are served in a measuring cup, which is cute. Service was great! I was really thirsty so was drinking a lot of water - our server was very attentive so my glass was filled as soon as I was done.

I want to try the other burgers so I'll be back!

Solid four star."}
{"text":"I do not remember if I have ever reviewed another \"The Works\" franchise, I've only tried this restaurant once and it was somewhere in US on one of my family's already forgotten (by me) car trips with the kids.

This Port Credit restaurant is surprisingly amazing for a chain, I usually avoid chains when possible but being a herbivore it's not always easy to pick and choose.

Both, my hubby and myself ordered the veggie burger, he got \"The Son of a Beech\" topping and I of'course, ordered the spiciest thing on the menu, the Jamaican Jerk and asked for hot sauce just to make sure my throat burned enough to make me happy.

I also ordered fries with their vegetarian mushroom-based gravy.
Our kids ordered Sophia's K.D. Supreme, which is basically Kraft dinner with a side of your choice.

Our waitress was super sweet, courteous and fast, loved her!

Ok, my burger! This has to be the best veggie burger I have ever tasted, the texture is just right and not at all chewy, dry or weird like other restaurants' veggie burgers, this one is rich, moist and filling, the jerk sauce has a nice aroma and flavour and not at all wimpy spice-wise! Not bad! The vegetarian gravy is perfect, not too salty and had enough flavour even for my taste, it was so nice to have gravy again!

 Why only 4 stars? The music was so loud that I could barely hear the waitress."}
{"text":"3 weeks ago
My fiancé and I came here for our monthly date night... Huge mistake
We were sat down on the patio and our drinks came quickly. We placed our order and for an hour didn't hear from the servers. No drink top ups, no check ins, etc. After an hour and 15 minutes of waiting I told my fiancé to go get money from the atm so we can pay for our drinks and leave. Someone came by with food that wasn't ours and seemed frustrated when it wasn't. By the time he got back, two other tables that came after us were served. Our food came out when my fiancé came back and sat down ....:it was COLD... I can't justify paying our hard earned money for a cold dinner. How long was it sitting there for it to get that cold? It's a burger and fries people....We left 10 bucks and our cold entrees. Thanks for wasting our night. Super disappointed."}
{"text":"A bit of a let down. Burgers were pretty mediocre for the price. Burger patty was overcooked and toppings were bland. Much prefer Big Smoke or Priest Burger. However, decor was interesting and service was really great (the only reason why I gave this review two stars)."}
{"text":"I used to eat at The Works in Ottawa once or twice a month and I would be satisfied with their portion size and the quality of the taste.
I have not been to The Works for over 3 years.
I've decided to eat at the restaurant yesterday, but this time in Toronto. I was not satisfied with the quality and quantity of the food in comparison to my experience in Ottawa. The waiter I had did check up on us from time to time and was nice and apologetic, but it took long for everything to arrive."}
{"text":"Really good burgers. I gave it 5 stars because of the decor. It's a really cool space. Next time I will be trying one of their milkshakes."}
{"text":"We decided to come here for lunch on a Sunday in June. It's 2 blocks from our hotel room. We got there and waited a few minutes to be seated. We got a table at the booth. The menu has variety of speciality burgers served beef, elk, wagu which cost more.  They also have lunch specials under $12.00 which comes with fries and soda.  Then the waitress mentioned the burgers have to be cooked medium well. Also our drinks were served in measuring cups. We didn't wait too long. I chose multigrain bread which was toasted and no condiments like mayo or mustard or ketchup. Once I took a bite, it was dry. Only good thing was crispy fries. My brother was the smart one and ordered poutine fries. Refills were slow at first or hard to get the waitress attention."}
{"text":"Came here to kick off the Burger Brigade! Oh yay, this is my first summer doing this and what a kick off it was. Although we were given the burger from last year and missed out on the Kevin Bacon for now (will be back dun dun dun), it really was the service that made this afternoon all the more enjoyable. She was so sweet and attentive but giving us our space to chit chat at the same time. The burger we had was pretty ordinary, juicy, with two strips of bacon and an all beef patty, nothing to brag about but still a great burger in the end. 
Sometimes less is more. 
Happy summer burgering everyone!"}
{"text":"I have to say that the food is incredibly delicious. Unfortunately The service I got was the worst I have ever experience with a restaurant. I would understand if it was at least busy when I went but it was so slow. Never going here again 


Server : Hannah"}
{"text":"We had an amazing experience here! The food was delicious and unexpectedly good. Boyfriend got the loaded Reese burger and we didn't expect it to actually be good. We were scared at first that it would be weirdly sweet, but it worked out well. I got the sexy burger and damn it was sexy. Get the 2001 space Odyssey milkshake... it'll take you out of this world. Hehe."}
{"text":"This was my first time at the Works and I always love the idea of being able to customize your burger to whatever your tummy's desire. I settled for a 100% Canadian beef patty with the hipster topping (caramelized onions, avocado & Havarti cheese) on a multi-grain bun with a side of fries. Overall, the flavours worked together and was delicious and satisfying! However, the only thing I would change is the beef patty could have used a little more seasoning as without ketchup, it was on the bland side even with the toppings. Paired it with a pint of Barking Squirrel and I was in heaven! I would definitely come back!"}
{"text":"Service 5/5...great people here.

Burger 2/5...I order the veggie burger...hadn't been here in a while so forgot how much I don't like it...but it was good enough...the bread was the problem...multi-grain bun was dry, dry, dry

Onion Rings were the best I've had in a long time...

Also seems like a place that should have TVs so you can watch some football...but no...

All in all ok for Brampton, but much better out there..."}
{"text":"I've eaten here twice in one week. The service is awesome and the food is great. The wait staff are friendly attentive and the food was perfectly made to order. I highly recommend you trying the restaurant."}
{"text":"The way I review it is if you are better value for money in all criteria, then you have 5 star. If you are value for money but good - 4 stars, if you are AOK then AOK.
This is  Good ingredients and choice dont make up for bad service. Overstaffed and empty 4 waiteresses for 10 customers but no one came to us for 10s of minutes to check. The coleslaw was not very good and when I didnt eat it, the server didnt offer to replace it. 
I will only come back here, if I am in a rush and want a good burger - or have a coupon."}
{"text":"Great location, nice to take a walk around Brampton City Hall after. 
Personally, I found the food bland. Went there on Saturday and ate the \"Babewatch\" burger.
I got it with the side of spicy cut fries and dipped in the chipotle sauce (REALLY GOOD!)

The burger however was lackluster. Avocado, jack, and some sauce of theirs. I added extra jack, and upgraded the patty to cheese filled and still found it SO BLAND.

Second time at The Works - thought we'd give it a second chance, but no chance of us going there again. First time there was a hair in my burger (they compensated for it of course), but we felt it was unfair of us to judge based on one experience.

Prices are good, but the food is not worth the hype."}
{"text":"I really like this franchise! 

They offer different burger combinations you may never have thought about. I was nervous but thought \"what the heck!?\" and ordered something so out of the box for me... and I LOVED it. Who would have thought peanut butter & bacon go hand in hand with a beef patty. Another fave is the beach house sauce so really, any burger you get with that sauce is going to be unreal. 

I've tried their tower o rings, poutine chez guy, a pumpkin pie milkshake during Thanksgiving (Barrie location), sweet potato fries, Johnny be goat burger, man cave, man-o-war, sk8r boy (10/10!), son of a beech, and the sweet ride burger (Barrie location). I can't recommend sk8r boy more!

Next time I'm there, I'm going to sample either the babewatch burger, the Beverly hills lawsuit or the gotta be KD burger.

Another great thing about this particular location is that the manager interacts with his customers, on multiple occasions! He often recommends craft beers and can pair your beer with your burger choice. He also orders kegs based on his customer's preference so if you're thirsty for something, speak up! He just might be able to help you out. 

Will be back!"}
{"text":"The Works is another \"upscale\" burger joint that has been taking Toronto by storm, which originated in Ottawa. They have a ton of options for burger toppings, and type of burgers (you can even get elk!), but where they lack in options is the appetizers. Although when I went, we got the crispy pickles and I did enjoy them.

The most important part of a burger place is the burger. The burgers at The Works are a great size and are very filling. But the downside is that when you bite into them you will see that they are completely brown, as they are well done and not all that moist. I had to add extra ketchup and mustard to my burger to bring it to an excellent level of moisture. One of my friends said it best, \"Extra toppings shouldn't be the answer at a \"fancy burger place\", as the burger patty should really sing.

One of the stars at The Works is the milkshake, and it was the highlight of my meal. Overall it's a good place, and there isn't anything bad about it. It could just be so much greater."}
{"text":"The service is is always good and the price is fair considering what you get. But be warned, this place is not exactly great for their quality or taste of beef...it's more so to try some crazy burger combinations and toppings. So far I've quite enjoyed this place every time I've gone."}
{"text":"It doesn't take a brain scientist to figure out that if you have to come to ask your customer 3 times that it's their first time here. A good waitress would take a few minutes to explain haw things work. Maybe even give some suggestions. 

Face it the place was empty. The staff was scratching themselves. But our waitress was not happy because we were taking up her precious time. So precious that when it came time to get our food she was nowhere to be found and another waiter had to bring it to us.

The burger was good and the onion rings were good too. Then the Bill came $50 with tip for bad service. And over all leaving hungry. 

The worst part is after reading the reviews we realized that our waitress never bothered to tell us we had a side order coming or even offered refills on our pop.

None of the staff took time to thank us on the way out. Guess they were in a bad mood since there was no customers that night. Face it with that kind of attitude you normally get no customers.

Your best bet is to go elsewhere there's plenty of choices on the Danfiorth i bet any is better that this one!"}
{"text":"Tried the Hipster burger and the waffle burger. The Hipster didn't have much in there so we weren't expecting much but the waffle burger was AMAZING. They used waffles instead of buns and topped the burger with maple syrup. They had dozens and dozens of different burgers on the menu and I will be back to try some more."}
{"text":"Like many other yelpers, I had a just-OK experience at The Works.  Toronto's a tough town for burgers when you've got A1 newcomers like Burger Priest & Capitano, and institutions like Allen's and The Pilot, to compete.  My previous experience at the Danforth location taught me that these patties are drier than the Serengeti in a drought, so I opted for the Jamacian Jerk with a thick layer of spice, cheese and chilis, and asked for relish on the side just in case the toppings weren't enough to spice things up.  This round, the patty was admittedly a little juicer, but I found the Jamacian spices barely came through at all and I was highly tempted to just drown the burger in ketchup and eat it the ol' fashion way.

The verdict: OK burger if you're in a \"whatever, I need something to fill my belly now\" kinda mood, otherwise give it a pass. There's so many other fantastic burger joints in town that deserve your dollers."}
{"text":"Amazing burgers with a wide variety. Friendly staff. Highly recommend the get baked poutine."}
{"text":"The burger was good although a little on the small side. The fries were good and the unlimited dipping sauce was great (especially the garlic aioli). Service was great as well.

That being said: 

I was charged for a 20oz pint of beer which I found suspicious because the glass looked too small to be 20oz. Now the works are kind enough to provide your water in measuring cups so I decided to do some science(!). Sure enough the \"20oz\" cup only fit about 18oz when filled to the brim.

Moral of the story: don't give clients measuring cups if you're going to lie about the quantity of beer you're serving them."}
{"text":"decent but nothing amazing

Had the Brie and mushroom burger, toppings were fine the burger was fine. 

The onion rings are pretty good and so was the vegan gravy. If you are looking for something quick and easy in the area then go for it otherwise meh I wasn't overly impressed."}
{"text":"I got a burger with nachos and salsa on it. god damn it was slammin. this spot knocks red robin on it's ass. the burger patty has way more flavor and the bun was fire. huge waters and I think pops in measuring cups is some quirky hip shit but I'm always pretty thirsty so I'm backin it. pretty nice place. they got a burger with poutine on it too"}
{"text":"Way overpriced and the burgers were dry and tasteless.  The best thing we had was the fried pickles and even those tasted pre-made from the freezer.  We won't be back...you're better off just going to Five Guys down the road.

Service was fine, but the place feels run down and it's way too much money for lousy burgers."}
{"text":"This place is definitely a 4.5 star kinda place but yelp only gives you the option to make full stars. Okay so service was friendly and attentive even when it was hectic and busy. Food was nicely portioned and presented. My only negative was the burger was a little over cooked for my liking. .. and they didn't ask so I guess they don't ask you how you like your burger cooked so my hubby and I both got well done burgers."}
{"text":"This is an awesome burger joint. Try the Hot Magma, it's delicious. Service is great too and if the weather's nice they have a good patio you should definitely check out."}
{"text":"Fantastic food, but grossly overpriced. 

Went here for the first time yesterday with my wife and brother-in-law.  Bill came to $70 for 3 people.  A bit shocking. 

However, putting the price aside the food was really good.  One of the best burgers I ever had.  Tasted so good, and the best part was I didn't feel like crap afterwards.

Will probably visit again."}
{"text":"I can't believe it's taken me so long to review this place! I'm a HUGE burger fan, and this place rocks. We ordered the Belgian Frites (fries, onion rings and sweet potato fries) with curry mayo, chipotle mayo, and chipotle ketchup as our dipsticks. The curry mayo was incredible, as were the sweet potato fries. Somebody else ordered the deep fried pickles and loved them. There was elk, chicken, and beef burgers ordered at the table, and there were no complaints on any. I myself had the pure ground beef patty and the \"BT Breakfast Burger\" topping choice: it was amazing. I had poutine as my side, which was very, very good, and for dessert? A milkshake. Honestly, I have to say the milkshake was what really blew me away. I got the 2001 Shake Odyssey (peanut butter, caramel, and oreo crumbs) and it was to die for. I've been craving one ever since. I do however, agree with Alex S. in saying that I think I would go back here just to try the sweet potato fries with other \"dipsticks\" and have another shake. The burger is an after thought for sure, even though it was very well done. Our server was very helpful, and the staff is super nice and funny (we had a debate going on at our table which they willingly provided input on). The industrial look is so well done, everything from the pipes on the wall to the open garage door looking out in the street, I loved right away. Would definitely go back here again!"}
{"text":"I'm really quite surprised at the amount of good reviews this place has recieved. Its ok but over priced and menu was giving me a hedache. Two stars becuase its bad value."}
{"text":"It took awhile to get a table since we had a big party but all the waiters were very considerate and gave us updates during the wait. We went during burger week for the 5$ burgers+side and many of us upgraded to elk to try it for the first time. I've had elk hot dogs before but the elk here was amazing! I would definitely come again!"}
{"text":"I was impressed w/ the menu as there were so many gourmet burgers to choose from.  First you pick which burger (choice of beef, chicken, veggie, portobello mushroom), bun (white, whole wheat, gluten free or bunless), sides (fries, poutine, salad, etc.). I liked the many options & great for vegans/vegetarians & those w/ dietary restrictions. 

I ended up selecting the Grills Gone Wild (Grilled eggplant, avocado, salsa loco & feta cheese). Had this bunless & replaced the meat w/ portobello mushroom instead w/ sweet potato fries and it was quite good & juicy. But honestly, it's a burger. I didn't expect this to be holy sh*t so good 5/5. My hubby picked the War Pig (Mushrooms, smokey BBQ, cheddar & bacon). Hubby's burger was only $5 cuz it was burger week ! What a sweet deal! However it was very dry. Perhaps that's what happens when you order during burger week? hmm..

Service was great & our waitress was very personable & friendly. We don't mind coming back another time. But would prob. avoid any specials."}
{"text":"First time trying this place.
When you enter the restaurant you do not get a warm welcome at all , after we ordered the food we had to ask for our drinks 2 times before anyone brought them !
We orders a Poutine for the whole table as they come in buckets and are too large for one person we had to ask for side place so many times and we kept on being told they are waiting for the dish washer to finish we eventually have up and all eat from the bucket ! 
It took a little whole for the staff to warm up to us but once they did it became a better place .
Our orders arrived all correctly even though we were confusing the staff a little ! Lol 
So we end up getting the onion tower , the martini Poutine , the KD burger and the Sexy burger,
The Poutine was a little dry at first so don't 
 Forget to mix it!
Both burgers were excellent defiantly recommend the Sexy burger"}
{"text":"Top Ranks for this Burger Joint.  The staff is super friendly, and the Burger is superb.   I highly recommend coming in whenever your around downtown Brampton area"}
{"text":"My friend and I bumped into this while wandering around the city. We picked the seats on the rooftop patio and the view was amazing !

I love all the selections that The Works offers. It took me a good 20 minutes to finally come to final decision. I ordered Elk on the Beech which is lean elk patty with avocado, beechhouse sauce, tomatoes and feta cheese, and onion rings on the side.

It was amazingly tasty! The burger was huge and filling and juicy. The onion rings were pretty good. Oh well, let's not kid ourselves, everything tastes better deep-fried!

The server was pretty good! Even we sat on the rooftop patio, the server didn't forget us. She kept checking on us if we needed anything. She was also very friendly and gave us suggestions after seeing the confusions we had about the menu.

Forgot to mention, we walked in there with Starbucks drinks and the Works doesn't allow outside food and beverages. The server was kind enough to give us their measuring glasses (which was very interesting) to pour our drinks in there so no one can give us trouble. And I fell in love with the Works at that moment.

The decor is creative and I had a good laugh after looking at their washrooms' signs. 

It was a nice burger experience and I will definitely come back here again. It's a bit pricey but worth every penny spent!"}
{"text":"I love this place.  I can't fathom why there are only 3 stars!  The atmosphere is cool, the food is amaze-balls and the service is always very friendly.

I travel to Toronto often for work, and typically make The Works one of my first stops.  I LOVE the gravy they serve as part of the Poutine - but I just get the gravy on the side and dip my fries in it!

Also, they are very good at running gourmet specials - new offers - bacon extravaganza - stuff like that.  

I highly recommend The Works - they are slightly pricey, but for a gourmet burger in a cool atmosphere, it's worth it!"}
{"text":"Good service, great food. Elk burger was awesome. Fries are bottomless if you aren't stuffed by the time you finish the burger."}
{"text":"We love the fresh lemonade the milkshakes and the burgers are all very goodand the outside patio seating is beautiful and has a great view"}
{"text":"Came during burger binge week n got the 
'6 degrees of k'vin bacon'. It was baconlicious! You got 6 types of bacon with a burger! For 5$ this was an awesome burger n came with fries. You got a huge selection to choose from!

Nice concept: you choose the style eg: 'down under' so that comes with carmalized onions, egg, pineapple, purple beets & gouda. Then choose your patty (beef, chicken, turkey, or elk). Then choose your side n type of bread. Its like a mix n match. They do have a few suggestions regarding which protein to use. Also i saw on their menus bottomless fries. Plus their drinks come in a measuring cup! 

Its a good place to come back again n again with friends to try different burgers."}
{"text":"Loved it!!  Very cute restaurant! The details are very creative and unique. Everything from the measuring cups for beverages to the lightbulb salt and pepper, to the decor on the walls. 
The burgers were delicious. Notorious P.I.G. is very tasty with a little spice. 
Definitely a good choice (as suggested by our waitress).  We also has the famous onion rings and one order of fries. Both were good. All in all a good choice. We will definitely be back in the summer to sit on the upper patio!"}
{"text":"YUM YUM I AM FULL FOR DAYS.
I came here on a business lunch which was a bad idea since my work slacks are restrictive in the stomach area (!)

I got the Juicy Lucy which is a beef patty infused with delicious and nutritious CHEESE. This burger lived up to it's name and caused me to look like a messy child in front of my work colleague but luckily she ordered the same thing!

You can get your burger cooked LESS than burnt here, hallelujah. It was wonderful tasting so much that I couldn't stop eating it even though I was stuffed to the gills. THEN I had the fries! OOF. Fries were good/standard...I'll try something different next time. 

The place is pretty small inside, smaller than I'd realized, but I didn't feel cramped even though there were quite a few diners. The service was great (it was only her 2nd day) and attentive. I will definitely come back!"}
{"text":"For those who won't be able to experience frank honesty, I give you fair warning.
The food is absolutely terrible and served in a trough.

If you are hell-bent on trying it anyway, avoid the meat."}
{"text":"I liked the Elk burger and there's one burger I tried with a good BBQ sauce. Other than that, the food is average and the fries are forgettable. The last time I went, it was lunch time. My two friends and I were the only people there. We were there for an a hour and our food was still not ready. When we asked the waitress, she said it takes 45 minutes for them to cook the burger. We canceled our order and I went without a lunch. Don't recommend."}
{"text":"Their fries and onion rings are delicious. I could probably have an entire meal out of them (& end up with a tummy ache b/c let's face it, it's unadulterated grease!). But their burgers too big and there is too much choice. You know the state: Analysis paralysis. I could not decide what to get b/c each one was different and I could not find one with all the ingredients I specifically wanted. Different burgers had some of these ingredients and other ones I did not want to taste. In the end, I ordered the monterey jack and avocado burger: the Wolfman.  I wish I could say I enjoyed it but unfortunately, I ended up with a bloated stomach and a general state of unease.

Good layout, fantastic patio and it does seat groups of 9."}
{"text":"O.k, so far I have been disappointed with several of the restaurants and cafes that I have visited in this area and these disappointments have been reflected in my reviews.
The 'Works' on Wellington Street is a gourmet burger joint with a beer and wine license. 
They offer several great options and whether you are craving a traditional burger or something with kick and spice you will find it here. The sides here are very good as well, and I think their onion rings are the best in the city. The poutine is excellent here too (try the Margarita Poutine (crunchy onion pieces on freshly cooked poutine was a brilliant idea and very tasty)
I have never been a fan of chain restaurants (Hero Burger's for example) but this place delivers!
Definitely stop by here if you are craving a gourmet burger."}
{"text":"I would have given it 4 stars but anyplace that takes 40 minutes to get you a burger after you place your order and then does nothing to make up for the wait loses at least one star. The burger (Leaside with guac added) was excellent, and the shake was very good. That and a pint of beer, which I stretched out for the 40 minutes the burger took. The place is very small, expect to wait if you are with a group of 3 or more."}
{"text":"Came here during lunch hour for takeout. 3 of us were the only ones in line and it took 20 minutes before we got our burgers. The Elk burger was pretty good but definitely not worth the $13. Overall, I'd rather eat boiled tripe off the floor."}
{"text":"Actual rating 3.5.

Went here today for lunch.  I would give this place 5/5 for service because our server was really really nice and another employee even came over to make sure we were enjoying our meals.  So for that reason, I think this place is good.

I got the special of the day - a Kamikaze burger, fries, and a drink for $10 which I feel is very reasonable. However, burger wise, I have had better.  It was a very generous portion of meat, but it had very little flavour. The burger was seriously leaning on the toppings to make it interesting.  The fries were prepared well, but again, not a heck of a lot of umph.  I wasn't too inclined to finish it all.

Honestly, I found the menu overwhelming too, but lord have mercy...if you want a zillion options, this is the place."}
{"text":"Interesting setup on the corner there, looks unusual, almost popup, from the outside but once inside it's very pleasant and standard. I highly recommend the onion rings, they were supremely delicious, and the Greek Goddess burger was great too. Highly attentive and friendly service. If you like good burgers and infinite variety of choice in what goes on it, this is the place. Wide variety of burgers available for vegetarians too."}
{"text":"This is the first time we are there since the location changed from pizza pizza.  There are many choices including side, the bun and even the burger."}
{"text":"I could be funny and use the opening line of \"The Works need some work\"  but I think the 2 stars really highlights how it wasn't a great experience.  I had a friend come in from the prairies and he wanted a gourmet burger but hates the city.  Burger Priest and Holy Chuck seemed to be out of the question... The Works seemed like a potential place for him to find it.

We went for lunch and it wasn't very busy but the service acted as if each and every table they had required so much work.  They were not happy to be there and it really showed.  We waited for everything... being acknowledge, menus, cutlery, refills, getting sugar for the coffee, napkins.  It was a service disaster.

As for the menu, it's enormous and very overwhelming to read.  Some of it almost seems like a joke as the topping combination was hard to imagine (caramlized onions, egg, pineapple, beets and gouda... what?).  My friend settled on the Man Cave (lol at the name) and I had screaming goat wrap.  The verdict was that it was ok... nothing really about it made it memorable.  If anything, because it was so delayed in coming to our table, I suspect it was just cooling down sitting at the pass instead of being freshly served piping hot.  The fries were definitely limping even though they had a nice brown colour to them.

Overall, I think the service really killed the entire experience... if only they have attempted to actually want to have customers, I think this would have an A-ok place."}
{"text":"Quirky atmosphere and eye rolling decor are the best ways to describe the overall impression of the place you get when you first walk in. It sort of screams style and no substance, but I was still curious. We ordered two burgers and two floats and the bill was WAY TOO MUCH ($41). Our server was great, very friendly and helpful. 

Our food was not so great. My fiancé ordered the Superman burger and I ordered the Leaside burger and subbed chipotle mayo for the BBQ sauce. We also got the floats because on their print menu I didn't see shakes anywhere :( Boo, they had shakes...should've asked! I somewhat enjoyed my burger but can't understand why it is priced at ~$13 and I really don't understand why my fiancé's burger was priced a dollar less than mine because it looked substantially less.

Annoying things about this place include the silly measuring cups for water - it's kind of cute for floats but completely unnecessary for water and the fact that their washrooms are all the way in the basement - which is annoying when you're enjoying the nice weather on the patio.

I might return for just a shake or beer and something light but their main menu item, the burger, has seriously left me wanting."}
{"text":"Pretty good food, quick service. We thought it was funny that you get drinks out of a measuring cup. We got a regular old cheeseburger and a chicken Caesar salad. Both entrees were flavorful, the chicken was moist and blackened, and had nice sized portions."}
{"text":"Ive been here a few times and finally decided to do a review... would I come here again? Yes. The burgers here are different than your average burger joint, theybhave \"wacky\" burgers which I love to try. The environment is cool looks different. They serve drinks in pyrex mugs.

Ive given it 4 stars because they have some really good food items (the premium limited menu) and when you go back again its not on the menu. Because its gone. (To try new items)...

Good service and good food."}
{"text":"Nomnom nom just finishing my last delicious bites of my nacho libre burger with a poutini martini. First time and it won't be my last. The gravy was on the salty side but other than that its was yummy. I'll come back to try different burgers next time."}
{"text":"James is obnoxious. Great food and service but if you have to deal with James the supervisor I pity you"}
{"text":"First, just wanted to say the service on my latest visit was amazing. Katie was informative and cheerful and we never felt rushed during the busy lunch hour. Menu is extensive (love all the clever puns though!) so took some time to go through all the delicious sounding burger options. So many choices it's a little overwhelming and then there's the option to add more toppings for an additional fee of course. If you're not into beef, each burger can be substituted for a different meat, and a different bun of choice. 

We ended up splitting our meal so we had a taste of each. Decided to try the new burger on the menu \"Obi-wan Kobe\" which had caramelized onions, bacon, bbq sauce, and jack cheese on a Kobe wagyu beef style patty and a sesame bun. The bun didn't do a great job of holding the burger together and there was way too much bbq sauce but the combination of toppings was delicious. Had to balance out the meal with a salad and it was fresh and crisp. The second burger was \"Born to Brie good\" which was excellent. Burgers are cooked medium, and very juicy. I liked that a dollar of the burger goes to local charities, in this case it was going to the new hospital that just opened up. Got a side of fries which the menu mentions is bottomless but we were so full after we didn't get a refill. As mentioned in other reviews, water comes in measuring cups so you can track the amount you're consuming throughout the meal (almost three cups for me!) Overall solid burger joint in downtown Brampton. A little pricey but satisfies the craving."}
{"text":"Way too expensive for what you get.  Burger was ok but at a price of $18 a burger, I expect it to be amazing. Portions are nothing great either. My daughter had carrots and celery as a side and no dip was given, like a ranch sauce to dip it in.  
We used to eat at the Milton location and that was much better. I never felt ripped off or disappointed like I did at the Mississauga location."}
{"text":"Located next to the glorious Gooderham Building, this place has a good reputation for a large burger menu. I was with a fried and we waited for around 20 minutes till when we got a table. I ordered the Three Ring Binder which was a burger with sauteed mushrooms, chipotle mayo, gouda cheese and 3 onion rings(haha get the pun?). The burger took awhile to come since it was really busy. To me, I thought the burger was okay, nothing special but I did like the fact that they have unlimited fries!! Also, the idea of drinking out of a measuring was interesting. I shall return again to see if there is a burger better than that one."}
{"text":"My girlfriend and I have been to a few burger places downtown but the works has to be our favourite, we are now regulars here. We have ordered many different types of burgers off the Menu and they have all been excellent. Sure this place can be a little pricey but it is worth it! The service is also great, I've been here many times and the waiter/ waitress have all been very friendly!

Ps The wrecking balls are a must try!"}
{"text":"I may have just found my new burger love in Toronto. It took a while to find you but you were worth the wait my darling. I'm really worked up for The Works!

The menu here is like a mail-order bride catalogue for hamburgers. What isn't on the menu here? Yes they have a burger with peanut butter on it. Actually two of them; one with bananas also. Kraft Dinner you say? Yes. Avocado, onion rings, pineapple, or tzatziki? Check, check, check, and check. They even have a burger for the Stanley Cup. Oh wait a second, the menu states that \"The WORKS would like to apologize as this burger has not been available in the GTA for 45 years...but there's always next year!\"

There's over 70 choices of burgers, 13 sides, plus starters and salads. Flip to the back page and there's an endless list of drink options, the bulk of which is milkshakes. Normally menus are are nicely spaced with a hefty sized font. Not this one. The pages are crammed from top to bottom in sans-serif with a point size of about 10. Frankly, the menu can be a little overwhelming. If you get lost or are a little indecisive, just flag down your server, tell him or her what you would like on your burger and they can make a couple of suggestions. If all else fails there is a top 10 list of their most popular choices.

The motif here is industrial. There's metal siding, diamond plated signage, painted brick walls, copper tubing, and some parts and pieces hooked together that don't even make sense. Seriously. On the side wall near the front there is a fluorescent lighting ballast connected to a pressure guage. Why? Beats the heck out of me. But it looks cool. Earlier reviewers complained about loud music. This wasn't the case on my visit.

The Works has been around Southern Ontario for a while but they're just breaking into the Toronto market. They're doing it with a bang too. This location is the first to open but there are three more on the way soon.

Their patio isn't up and running yet (waiting for their licensing) but the front of the restaurant has a couple of big roll-up doors to let in the sun and fresh air. Because of that the front area can be quite busy with everyone requesting to sit there. The staff was ready for it though by first warning us that the service might not be top notch because we requested to sit in the busy section. They did however do their best to compensate for this. When the hostess wasn't busy she was refilling water glasses, or should I say measuring cups that they serve water to you in.  We had two or three ladies helping us to answer our menu questions, getting our orders placed, and delivering our food to the table.

Let's get down to business and tell you the story of how I found my true burger love. After perusing the vast choices I settled on the Dirty Snake. That might sound bad but keep in mind that there are menu options like Sum Yung Guy. The Dirty Snake consists of caramelized onions, avocado, and Havarti. All of their burgers come with lettuce and tomato and because I was feeling extra meaty I added some bacon. You're given the choice of ground beef, turkey, or a vegetarian patty along with white, whole wheat, or gluten free bun. I chose red meat and a whole wheat bun. From the selection of sides I went with the Bold Slaw, a coleslaw with kick.

The burgers take 20 minutes to cook so the table ordered a Tower O Rings to hold us over and I had a pint of Barking Squirrel to wash it all down. The tower is a spike of onion rings that are stacked according to size from largest to smallest. It comes with two choices of dips. We went with their house dip and a chipotle mayo. The house dip was good, but not really a fit for me with the rings. It comes as an option on some of their burgers which would be a much better place for this concoction. The chiptole dip had a nice smokiness to it. The rings themselves were good; fairly standard, nothing above and beyond.

Minutes later my new love was delivered to me in a stainless steel tray and served open faced. After adding some mayo and ketchup I bit into her. That's when it hit me. I fell in love with that first single kiss...err...bite. The caramelized onions were done to perfection. They were nice and sticky from the natural sugars brought out in the cooking process. The avocado and melted Havarti slow-danced on my tongue like two horny teenagers at a high school dance. The burger patty itself was very straightforward, not stealing the show from the toppings, but it was cooked exactly right. Just a slight hint of pink in the middle.

You know a burger is good when it's dripping down your fingers and trying to escape the bun at every bite. A burger that won't be contained by a mere bun is a burger you want to eat. While I enjoyed the bacon I had added, it was unnecessary. The burger was perfect just the way it was stated in the menu. 

Sadly, I must end the story short because I'm hitting Yelp's character limit. Go here and start your own love story. To Be Continued........"}
{"text":"Went back  to see how things were.  A great improvement. 

Had the dead ringer to see if was better, different or the same. It was the same as in Ottawa, which is good. Just the way it  should be. 

I'm glad the growing pains of the Works are done with and improvements have been made. 

Don't have to go to Ottawa for some great burgers. We can have them in T.O.

Thanks"}
{"text":"The place never ceases to amaze me. This is gourmet burger on steroids. I had a really hard time deciding what to order as everything looked really tasty. I highly recommend you guys to try at least once."}
{"text":"Being a burger chain, we had doubts about this location at first. Dinner on a weekday was quiet so we had no trouble getting a table. Our server was incredibly friendly and approachable. However, we did find it a little bit difficult to flag her down since we were seated at the far front of the restaurant with the rest of the customers.

We ordered the Getting Piggier and Baywatch burger. It took about 20 minutes for our order to come out. The Piggier burger was nicely done, not dry and there was a generous portion of bacon. The Baywatch burger was ordered as bunless so I was expecting a salad wrap. Instead, the patty and toppings was placed on a green leaf lettuce without any lettuce to top it off. It was pretty awkward to eat the burger like a pizza so opted to deconstruct the burger and eat it like that. Also to note, there was a generous portion of thickly sliced avocados which made the burger taste creamy and delicious!

Would I come back again? Yes, but only if I wanted to try their limited time burgers. It's pretty expensive as two burgers with sides and drinks came up to about $60 with tax and tips."}
{"text":"a tad overwhelming at first because you are literally getting the works on your burger. takes a while too as it's freshly cooked to your liking. I'd return ans recommend this place if your looking for a simple. tasty burger joint to a gourmet burger IT'S ALL UP TO YOU. Parking I found was a little tricky but public transportation was easy and near by. as for any bikes. prices will vary according to your customization"}
{"text":"Quite disappointing.  Perhaps the management was new, but the service, while friendly, was very slow.  They didn't bring us water, forgot the kids desserts and one of burgers (the easiest one to make) arrived 10min after the others, which were also slow to arrive.  Food was mediocre.  Definitely not worth the money."}
{"text":"I felt in love with their \"hotter than hell sauce\" and knew I wanted to try this place along Port Credit in Mississauga. I've tried the ones in Brampton, Oakville and Toronto (Bloor/Runnymede). 

It has similar decor to the other locations. Rustic and construction feel, with a wooden touch. It was nice and clean since they just opened this month (Aug. 2016). 

I ordered \"Son of the Beech\" and sub the cheese for eggplant. It was definitely yummy!!! The downside was that they run out of ground turkey burger, so I opted for a veggie burger since I had a great experience last time. This time, I paired it with their spicy coleslaw which was great. Less sauce at the bottom would be better. 

My partner's fries weren't all fully hot and crispy, but we didn't complain. They do have unlimited fries for the person who orders them. However, by the end, one can be truly full and happy. 

The service was wonderful as it was packed with people that attended the Buskerfest. 

Verdict: Of course I'm going to go back!! The price is right too!! Oh yeah, they have lunch deals for $11 which is fantastic (a burger, a side, a drink)."}
{"text":"The burgers here are fantastic. Whatever you get is going to be delicious so don't fret about the giant menu. I was very hungry, but I was still paralyzed by indecision with all of the choices. I went with the special, that's a combination of beer and smoked meat and bacon on a burger. delicious as always. Staff is so super friendly and the service is always very fast."}
{"text":"My husband has been looking for the perfect burger joint for a while now and I think we found it. Excellent atmosphere and decor. Went with my 9 and 4 year old and they were impressed as well. Kids menu was excellent with large portions for price paid. Kids dessert was included and just right. We all got a kick out of the measuring cup glasses :-). Our burgers were excellent.  The options are endless and adult portions were huge too! Paid $80ish for a family of four but did have alcohol and adult milkshake. (Stick to a medium or small - 2 cup vs 1 cup measuring cup respectively). Will definitely return...with an appetite ;-)"}
{"text":"I like it here...but I'm not sure if it's because of the burgers.  

My friends and I were back-and-forthing on email all day.  
\"Is tonight good to head to that burger place?\"
\"yea, that...Works*\"

*BAM.  Restaurant wordplay*

So, off to The Works we went.

We were seated right away, and service was amazing.  Friendly, helpful, attentive (like: \"just took the last sip of my drink and a server/ninja pops out of the woodwork to ask if I want a refill\" attentive).  

I'd been to the original location in Ottawa years ago, so was ready for the reading that comes with a menu at The Works.  The server assigned to our table was at the ready with recommendations for the group vegetarian, and assurances that the elk burger would be cooked carefully to ensure it kept its moisture.  I trusted her, and locked in my choices.  

We ordered a tower of rings with two dipping sauces while we decided on the main event.  
We drank beer (The Works is licensed).  
We tested gravy (vegetarian, but still delicious to meatatarians).  
We ate Kraft dinner, we dipped sweet potato fries into punchy curry mayo, we fought over mashed potatoes.  

Y'see...the burgers ended up being kindof an afterthought, though I will give props to them for offering both a veggie burger and a portobello mushroom cap option (the latter was delicious, and I'm a meat-lover).  

Next round I'm skipping burgers and heading direct for ice cream floats and poutine!  

Yelp note(s): I'm no pro at Finite math, but I'm pretty sure you could eat here (roughly) a bajillion times without repeating a topping combination.  It's a little discombobulating to me (those similarly paralyzed by choice can read up on the menu online in advance), but it makes for some fun table-side discussion either way.

Also worth mentioning: the server told us when we were seated that burgers take at least 20 minutes.  She was lowballing the time.  So: take it easy, kick back, and don't expect to be immediately in and out."}
{"text":"I used to love The Works for their veggie burger, but I have absolutely no desire to return.

I went on a Saturday night and got my usual (Son of a Beech veggie burger with spicy die-cut chips). Service was slow, but that's expected when it's busy on Saturday night. My burger finally came (after about 30 minutes), and starving by this time, took a large bite only to realize they served me a beef burger... Not a great revelation when you're a vegetarian. 

Thankfully, they acknowledged their mistake and put in an order to get me my proper order, but then proceeded to take another 30+ minutes to get my veggie burger (as I watched other people get served). By the time I got my food, my boyfriend, who was waiting to eat his meal with me, had a stone cold burger on his hands. Needless to say, neither of us enjoyed our meal and we will not be back. For such an expensive burger ($15-20 before tax), I would expect better service, a real apology, and some actual compensation for making a terrible mistake."}
{"text":"They have great beers on tap and unlike mad brew hops, they don't over charge for the beer. Offer a high protein, lean elk burger and some pretty crazy topping-combinations. I had peanut butter on my burger.

Service was quick and friendly, atmosphere was great. Losing a star on location as it is slightly out of the way and in a bit of a corner of an odd plaza.

Will definitely go again!"}
{"text":"What to try?

Their gourmet burgers and their dipstick (their signature sauces)! If you're around the area next week, then you can take advantage of checking in with yelp and then unlocking a $5 burger deal! 

Update: Pretty sick deal. The six degrees of Kevin burger is to die for. You really get a juicy burger packed with ingredients from the 100% Canadian beef patty to peameal bacon, maple glazed bacon strips (3 strips!!), some shredded barbecue chips, chipotle mayo, tomato, lettuce...mouthful of goodness!! Had the tower of onion rings for free too because I joined their loyalty member club and as an appreciation, I got it free! So it was definitely a big meal. 

I went with the intention of getting that burger but realized it starts next week so most likely I'll be back next week (yelp burger week special). I went there for lunch and they have lunch specials for just over $10. You get to choose from 10 different options which is pretty sweet. I picked the onion ringer burger because it's not just an onion ring but also topped with smoked beef brisket. Unreal! The burgers come with condiments like lettuce, purple onions, tomato and cucumbers. With a side of your choice, I chose the sliced potato cuts which is basically fried potato slices and the lunch special comes with a drink too! What a combo deal! As expected, the bun was fresh (you get to choose between whole wheat or white bread) and even though the patty may look small, it was quite filling! The bowl of sliced fried potato slices was crisp and crunchy, and was overfilling the bowl! Really liked the decor of the restaurant because it makes you feel like you're in a construction site and it represents the \"works\" of the restaurant. I also liked the creativity they added with how they served their drinks in measuring cups. You definitely are getting more than 16 oz of a drink because you can see it!! Pretty neat.  Definitely will come try here again. 

Last tip?

Join the loyalty program and you can get some free food items from time to time from them. Also if you provide feedback to your experience after each meal by answering their survey, you can $5 off of your next meal when you spend $20."}
{"text":"First discovered The Works in Ottawa and just had to find one in Toronto. Since then I've come back numerous times. Love the whole atmosphere with the measuring cups and quirky menu item names. These burgers are definitely something you can't find at a fast food joint. There's so many options and you can put just about anything on your burger. It is quite pricey but the quality makes it worth it. This location has a nice patio if you don't mind hearing all the downtown traffic buzz."}
{"text":"Always a good place to get a real quality burger. I tried the new burger Obi-Wan Kobe Man Cave burger, and it was amazing. Great service at this location, friendly staff. Definitely recommend the visit, even if it isn't for this burger, they have a large variety of gourmet burgers. Plus craft beer on tap is a bonus, I tried the Barking Squirrel Amber Beer."}
{"text":"I showed the waitress a yelp pic and said I'm new here can I get this please? She said they are all different what do you want? Very rude. I stuck around as I didn't want to ruin the mood of my friends. Food was decent at best and then they 20$ bill for one burger and a drink."}
{"text":"The burgers here are great. I had the Olyve Oyl with a mushroom cap instead of the beef, and it was delicious! I'm trying to eat healthy so this was a good choice (their nutrition info is online). My husband had the Burgeroni and enjoyed his too. There are so many options to choose from that it's great for everyone. I will likely be back soon."}
{"text":"I have frequented the Ottawa location several times and really enjoyed the experience.  When I saw this location I was eager to bring my partner to enjoy the unique burgers available BUT it was a huge disappointment!  

The notion of a \"gourmet\" burger is lost on me since it was clearly processed with perfectly formed pre-packed meat patties, processed toppings and our burgers were so dry and tasteless I could not finish it.  Seriously, how difficult is it to make an tasty gourmet burger for $15?  

The next problem was the service or lack thereof.  Once our food was brought to the table we were never asked if everything was satisfactory...20 minutes later after our server helped other tables and ignored us did he finally come over to clear our unfinished meal.  Still we were not asked about our meal so we spoke up and told him it was not good only to get a sheepish apology.  I spoke with the franchise owner, Zach, so he had feedback to improve future customer experiences.  He did apologize and comp'ed the food. He offered a coupon for an additional two burgers so we could come back again and give them another opportunity to meet the standards I have come to expect from \"The Works\".  I will consider it...

Bottom line...there is nothing gourmet about the food, the service is lackluster and you can get better burgers for less elsewhere."}
{"text":"Usually come here in the evenings and the place is always busy - good sign for me. Tried the deep fried cheese curds and onion rings side, so good! Loved the Gettin Piggy With It burger, and Sum Yung Sun burgers! Nice decor too. Service is always great, always attentive and cheerful and helpful :)"}
{"text":"With over 50 gourmet burgers to choose from, I was really excited to finally check out The Works (@worksburger). They first opened in 2001 in Ottawa and now has 26 locations, they have also won many awards, including Ottawa's best Burger for the past 13 years in a row.

It's a full service gourmet burger restaurant unlike many other burger places in Toronto which is self served. All their burgers are made with fresh Canadian beef and hand press daily. Not into beef, there's 6 other patty option on top of the standard beef and cheese stuffed beef which include elk, chicken, veggies and mushroom.

Bacontella Shake
~ Everyone's favourite Nutella blended with smoked bacon and creamy Canadian 
~ Ice Cream topped with whipped cream & even more bacon
~ This was the regular/medium size and the 2 of us couldn't even finished it since it's so thick and filling but be warned, it's super addictive.

Kamikaze Burger w/ side of Spicy Die-Cut Chips + Gravy
~ Jalapeno, chipotle & banana peppers, cheddar cheese & hotter than hell sauce
~ Although the description sounded really spicy, it was actually not that spicy and I somehow wish there was something extra to it... maybe the standard lettuce & tomato or even avocado maybe?!
~ Although love the pickled peppers and the juicy patty, I wasn't a big fan of the combination and the excessive sauce.  
~ But let's move on to the Spicy die-cut chips, it was the highlight of the meal for me and I can't stop eating them.
~  Super thin slices of potato with crispy edge and soft center (yes it's possible even if it this thin) and even you don't see any peppers or \"red\" to indicate it was spicy, it does pack some kick to it. 
~ Plus the recommendation of gravy on the side by our waiter was spot on. Would come back just for them and I would be a happy girl 

 Six Degrees of K'vin Bacon Burger w/ side of Onion Rings
~ 6 types of bacon including a signature 8oz bacon & beef patty, grilled and piled high with Canadian Bacon, smoked bacon, bacon ketchup, bacon roasted garlic aioli, bacon hickory sticks with fresh lettuce & tomato
~This was their \"Believe in Baconism Part 2\" menu and I think it's for limited time only since I don't see it on their menu online, so better go get it know or else you would regret it. 
~ Love every part of this burger from the mix of bacon and beef patties to the crunch of the bacon hickory sticks. 

Verdict :
~ Really enjoyed the burger here and love love love the spicy die-cut chip
 ~ Would love to come back for the patio when it's warmer
~ The place was packed when we went on a Friday, so be ready to wait for a table."}
{"text":"There seems to be a lot of mixed reviews about this place. I loved it they make a darn good burger, the beef patty is absolutely delicious. I ordered the \"Juicy Lucy\" which lives up to its name. Did I mention that there is cheese stuffed into an 8oz 100% fresh beef burger. It comes with lettuce, tomato, pickles, red onions and mayo. The french fries are perfectly salted and fried to perfection. I would recommend try this place if you consider yourself a burger lover."}
{"text":"Came here with the gf for a weekend lunch.  We were excited after reviewing the large variety of burgers online on their website.  Once we got there, we knew exactly what we wanted.  I got the Grid (beef patty) and she got the Ho Hum #34, but with a beef patty as well.  She also upgrade her side to a Delhi-licious poutine.

We got their real fruit shake, me strawberry and banana (yes you can mix the flavours) and she got the pineapple shake.  Her shake was pretty watery... mixed feedback.

Once we got the burgers we dived in immediately.  The burger patty was definitely a little more char'd then we would have like.  And we found the patty to get dry pretty fast.  It wasn't that moist after a few bites.  I mean, after all they define themselves as a \"gourmet\" burger joint, so our standards were a little higher.

The sides were done well.  My sweet potatoes fries were crunchy and definitely fresh.  Her poutine was her highlight of the meal.  It's unfortunate as there's soo much buzz with The Works coming into Toronto.  But to be honest, close to $50 later, we weren't really all that impressed.  I rather take my $50 to burger's priest and get a burger that's done REALLY well.

The burgers were closer to a 2/5, and the sides 3.5/5.  If you're downtown, there are just too many options, this probably shouldn't be one of your first."}
{"text":"Only great thing is the wide range of menu selection. Other than that, the food is pretty bland... the patties are so dry, not moist and no sauce to help with that. The patties are also so huge probably why the prices are ridiculous... my nephew got the Ho Hum #1 and it's just a burger with cheese and it cost $13 price not including fries or a drink.
The works seems like it would be a fun resturant to try with family or friends once a month but I don't think I'll be coming back."}
{"text":"Burgers: 2 stars
Poutine/milkshakes: 4 stars!

The veggie burger here tastes like the exact same frozen patty served at both the majority of restaurants in Toronto and my college cafeteria. My girlfriend ordered one of the beef burgers and it was also mediocre. I never order the burger here anymore because it feels like a waste.

But the poutine and milkshakes are amazing! The poutine happens to be vegetarian and literally comes in a huge bucket with lots of choices of toppings. (I can't finish it so I take it home and eat it all week.) The cookie milkshake tastes like drinking a chocolate chip cookie and comes served in a measuring cup, which is cute. 

Oh and regular fries have bottomless refills!"}
{"text":"Five stars for menu items and potential options for a burger. 1-2 stars for the actual food served. 

I was salivating at the thought of getting an amazing burger here. Sadly the burger I was given was greasy, chewy and not very flavourful. Liquid oozed out of it when I took a bite, and not in the mouthwateringly good way.

As for the fries, it still amazes me how an establishment whose main business is burgers and fries manages to screw up cooking fries. Yet they succeeded in serving over-cooked, tasteless fries.

For the money they charge it is not worth it."}
{"text":"We had a great time! My husband and I went here recently for a date night and were greeted with the most pleasant staff at the front.  A great start, especially after the service we recieved at the works in oakville. Katie was our server and she was absolutely amazing. Her friendly personality and smile contributed to a great evening.  Our orders were 100% right and the wait for the food didn't seem so long because Katie would check in on us with drinks, etc. We love the portebello caps as a substitute for burger patties and they were so mouth watering and just right. I usually take a pic when it looks that good to add to my review but I ate it too quickly.  
Definitely recommend the works in Brampton.  If you get Katie,  it'll make the visit so much better!"}
{"text":"YUM!  What else can I say?  Great service and decent food.  Can't go wrong."}
{"text":"Pretty satisfied with the lunch special ($10.95) which includes a burger, generous serving of fresh cut fries and large drink served in a Pyrex! I had the Blue Burger with was enjoyable if you like blue cheese with bacon but the patty was somewhat dry. On the other hand, the Death Ringer burger was quite juicy and crunchy with the onion ring. 

I also liked the construction ambiance, theme, and decorations. Remember to check out their washrooms as it was quite unique as well!"}
{"text":"It's fine, not great but Ok. For the price I wouldn't come back. There are better burger places in Toronto for less money. $14 for a burger and $7 for a beer. .. step it up a bit. Don't get the gravy on anything,  it's gross."}
{"text":"Delicious food and variety for vegetarians. I can't wait for patio weather to enjoy their rooftop patio!"}
{"text":"i enjoyed the theme of this place, and the sidewalk view, sitting right by the window. there are some unique quirks about this place: water served in gigantic measuring cups with straws for one, interestingly named lavatories, and expansive, paralyzing menus.

first of all, don't fret over the menu. the burger selection is massive, yes. however, it's a burger. there's not really a lot of \"action\" going on. if you fail to spot something that piques your interest, you have the option to build your own. that said, the burgers are above decent but nothing mindblowing. most of the flavoring of the burger comes from what is stacked on it and not what goes inside it. it's a lot of burger and a lot of fries, by the way.

i had the spicy cole slaw. too much vinegar for my taste but a decent kick in it. on the other hand, the onion rings? DIVINE. intensely delicious. dipping sauces included are great for them, your burger, your fries, your fingertips...

my suggestion? stop in. give it a try. it's a bit on the pricey side so be prepared to splurge a little. if i were going to do it all over again, i would get a tower of rings, split a burger, and have a barking squirrel beer."}
{"text":"So many different styles of burgers and their poutines are HUGE. I cannot remember what type of burger I ordered but I remember being pleased with this place. I will definitely be returning back!! Service was excellent"}
