{"text":"Have seen this place many times, and passed it many times when it was called Betty's Nosh. Based on having what we thought we no options, we decided to drop in. The menu looked promising. The service was, meh...I ordered a meatball sub that was bland. Wife had the buffalo chicken wrap, which was just shredded chicken with sauce doused on it. Won't go back. The service is a zero and the food was just above the edible baseline."}
{"text":"We went there for a date night night expecting the fun atmosphere and good food of Betty's Nosh and left extremely disappointed.  We ordered fajitas and kickin' chicken- both were very bland and the portions were small for the price. The menu seems all over the place- a combination of Mexican food, with some sandwiches (which are only available before four pm) and then a few stuffed mushrooms.   We both left feeling like we overpaid for what we got and definitely miss the old Betty's Nosh!  Will not be going back."}
{"text":"When it was Betty Nosh I couldn't get enough of their eggs benedict, unfortunately the quality has not been the same but I hope that with time things will turn around. The building is beautiful and the staff is great. Can't wait to try it again after some time."}
{"text":"Went to Nosh for lunch today since we like to try out new (to us) places in our neighborhood. We were sat immediately by a guy who didn't seem real friendly...OK.

Started to look at the menu and there are a handful of things that looked good. The main thing I noticed was that a sandwich was about $13 and that didn't include any side. Fries were and extra $2. Kind of pricey for lunch I thought. 

 ordered the French Dip and it was a good looking sandwich. i dunked it into the au jus and it was really salty. This is one of my pet peeves about french dips is if the au jus is salty. It takes away so much from the taste of the sandwich. The fries were good and the service was fine.

I just don't think it was $30+ good for two sandwiches good. Don't think we'll return."}
{"text":"I had a Groupon but was dreading trying The Nosh after reading the reviews.  To my delight the food was delicious, the service was great and I would definitely go back.  There was no issue with using the Groupon either as some others had reported."}
{"text":"I met one of my friends here for happy hour on 1/31; it was the first time I have been in since the new ownership.  We asked to share a cheese and meat plate.  The cheese tasted like it had been left open for weeks in the fridge and was very low quality, the meat tasted like crap also.  The wine was ok but that's hard to mess up.  Very pricey!!!  Won't ever go back, I can find better cheese at Fry's."}
{"text":"This place is great! We came here on a whym and were very impressed. Ask about the items not listed on the menu. The French mini and the corned beef Eggs Benny."}
{"text":"Our first time at Nosh (thank you Groupon).  We had the shrimp nosh (superb) and the Reuben (excellent) and the creme brûlée trio (vanilla, chocolate and butterscotch) was to die for!!  We'll definitely be back!"}
{"text":"I have to say again how much we love this place (previously reviewed under Betty's Nosh). The food and wine is wonderful, and our favorite waiter Aaron is very attentive and definitely the best waiter we've had at any restaurant in Arizona. The new management is making sure that their customers are happy. Please try Nosh, you will not be disappointed!"}
{"text":"Ambiance was good, waitress was nice but seemed inexperienced.  My salad was good, but the flatbread was a cheap knock off of warmed up pita bread with low quality ingredients that did not match what the menu said.  The sandwich wrap we ordered was lunch meat and buffalo sauce (not good at all).  Fries and drinks were good. This was our 3rd visit - the first two visits were a couple years ago under different management and the service was horrible. We decided to try one more time and this time it was better, but the food was not up to standards.  Probably won't be back at all."}
{"text":"We liked the NOSH. The new owner stopped by our table to see how we liked the \"new\" Nosh: we commented on the need for better seats on the patio (we bring our own pads), but liked our server, the service, the adult beverages, and the food! So we'll be back!"}
{"text":"I saw Nosh on Groupon and realized they changed ownership. I wanted to like this place because its close to home and work. Unfortunately I won't be going back. The atmosphere is great, but our server wasn't. All we ordered was chips, guacamole and salsa. The salsa was very sweet and the guac was already turning brown when we got it. Not very fresh for $12 dollars. The mojitos were really good! 
The thing is, when we got our bill, she rudely said the drinks are not included. Which is fine, we weren't going to argue. The groupon clearly says FOOD and DRINKS. She didn't offer to let us use the rest of the groupon. When she delivered the paid bill she tried to be all nice, almost realizing, \"Oh yeah, these people are going to tip me\". While we stayed for a while she never once tried to refills our waters. I felt some Groupon discrimination that I'm sure your all familiar with. I gave them 2 stars because the Mojito was good as well as the atmosphere. I do wish the new owners luck!"}
{"text":"Went to The Nosh for dinner last night after reading the horrible reviews. Bad idea.

Food was HORRIBLE and the prices outrageous for frozen reheated food. I got the \"roasted chicken\" Ceasar. The \"roasted chicken\" had a funny color and was tasteless and a weird texture. The server said maybe it was due to the chicken being roasted. Umm...I know roasted chicken when I see and taste it. This wasn't anywhere near a roasted chicken, more like frozen and microwaved. The dressing was tasteless as well. The bf had angry salmon. Again, tasteless salmon. Neither of us finished our meals. Will not be going back."}
{"text":"Very average food for above average pricing. I wanted to try this place because of the stuffed mushrooms...but honestly nothing special. The best part of dinner was the martini- still more expensive than what it's worth. I would only reconsider returning for happy hour."}
{"text":"Had an AMAZING time at the Nosh!  The owner was extremely courteous and the service was impeccable.  Our server, Taylor, recommended a fantastic wine and the food was delicious. I will be back"}
{"text":"So happy with the new management! After a bad experience over a year ago, this was our first time back. We were totally won back with the great service and food. Marty, the restaurant's manager, was extremely attentive, friendly and professional. Being Sunday evening on a holiday weekend, it was quite slow. I really hope that the others that stopped going here due to the last management gives them another try. I sure am, because this was one of my wife's favorite spots. I had the French dip and it was delicious. I ordered the sweet fries with it and they accidentally made me regular fries. But they had realized the mistake before even bringing it out and gave me both kinds at no additional cost. I was sure glad they did because they were both SO good! The trio of creme brûlée was a perfect sweet ending to a nice dinner with my wife. Thank you Marty for your great service and we will see you soon."}
{"text":"Go for brunch and get the chicken and waffles. Its a total game changer! They have a sriracha syrup that is delicious (I always ask for more!) and the chicken is the perfect amount of crisp! Paired with a Bellini and you're good to go. The bloody marys are also delicious but I would certainly add on the antipasto skewer - I think its mozzarella, olive artichoke, and pepperoni (may have changed since then). Another solid choice are the stuffed mushrooms-yum! Cant give 5 stars since we cant bring the pups on the patio (last I checked) but other than that we always have a great time and great service up at the bar."}
{"text":"Updated Review...
I went from 4 stars to 1.  DO NOT get a groupon for this place. The first time we used a groupon and went during happy hour.  We purchased 2 full priced entrees as well.  We were able to get happy hour priced drinks with no problem.  That is why my first review was good.  Got another groupon.  Apparently..now they don't let you use a groupon at all during ANY happy hours or specials!! Sunday was half price beer day.  We also thought it was half off a bottle of wine day...since it was advertised as such in one of their mailers.  We were told it was not half off wine day (I even showed the server the mailer...that DOES NOT state it was for a limited time)...so I bought 2 regular price glasses of wine instead.  My husband got 2 of the half off beers. We also spent 25 dollars for regular priced menu items.  All together...we spent 14 bucks for my wine...25 for food and 5 for beer.  We give the groupon to our server.  He says..uh you can't get the half off beer with this.   Seriously..you can't give us 5 dollars off after we spent 10 on a groupon..plus 44 at our visit!!  We were like...seriously?? Server went to talk to the manager and they did give us the 5 dollars off...but it's totally insane that we had no issues during our first groupon..and now groupons aren't good with happy hour or specials!  Beware..cuz they have specials everyday!  You might not be able to ever use your groupon!!!

Older and now insignificant review:
We used to go here when it was Betty's..and were skeptical about going back after the management changed.   We were pleasantly surprised.  We went during happy hour and had their flatbreads.  They were really tasty.  They did keep some mushrooms on the menu...especially our favorite braised beef and blue cheese. Yes there are some Mexican food items now on the menu...but who doesn't like Mexican food?  The only issue I had is that certain sandwiches are only available during lunch hours..those should be on for dinner as well.  The prices are a bit high..but so was Betty's.  This is why we go during happy hour...cheaper wine and beer!"}
{"text":"This place is nice to grab a drink  but the menu is so limited. You can only order parts of the menu at certain times throughout the day and it's really not accommodating. Their chocolate martini was so yummy and for brunch I really liked the option of a pitcher of mimosa. Definitely a good hang out spot"}
{"text":"Bring back Betty's nosh! So sad this place changed ownership. Removed all the great items from the menu and jacked up their prices.. kinda deceptive to with the slight name change with such a drastic difference to the food in taste and price.. won't be coming back."}
{"text":"This place is a lot worse now that it's changed management or ownership or whatever. The only reason I am going to give it 3 stars is because of the scalloped potatoes they still have. Move this place to Scottsdale and let those yuppies have it. My wife and I used to love this place. Now not so much. It's an every one in a while when we are craving the potatoes that we come back. And also, chad was a great server! Try to get him if you come."}
{"text":"If I could give 0 stars I would, walked in was greeted very nicely and started to move to a booth when either the manager or owner stopped her and said that we either need to sit outside or at a high top table? Even though there were plenty of empty seats? This so called manager or owner was rude and did not seem to care one way or the other whether he wanted our business., we took the high top table yet waited ten minutes and never got waitstaff to ask about drinks or orders, even though there were 3 waitresses standing at station talking amongst themselves? Got up and left and Mr Rude gave us a sarcastic \"have a nice day\" at that point want to emphasize we did not raise a fuss or say anything to warrant this type of response from Mr Rude and would not want anyone to waste their time or money going to this place when there are so many other great places for breakfast"}
{"text":"I love Nosh, the staff is amazing especially Aaron and Susan. The food is exceptional. I love the \"Nosho\" , Kicken Chicken & the Mango Salmon. I'm really excited about the new wine bar opening soon. This is my go there place for great food and fun."}
{"text":"The atmosphere is amazing. Great people and awesome service. Food is delicious. Can't wait to bring my wife here. She will love the outside dog patio."}
{"text":"We ordered spinach artichoke dip to start then shared a gorgonzola pear salad and an order of fish and chips. Our drinks were weak. All of our food, minus the lettuce was obviously frozen and reheated. The fish was straight out of a grocery store freezer aisle. Our drinks were very weak. We were one of two tables at 6:30pm on a Sunday night. That should have been our first hint. The atmosphere and location were very nice. The server was attentive but not overbearing and very friendly. I really wish the food and drinks had been palatable even as I felt it had potential, but we won't be returning to find out after the unbearable food."}
{"text":"If you like mushrooms like I do, plenty vatiety on the menu. They were yummy. Staff can be improved though."}
{"text":"STOP! DON'T GO HERE!  We tried this place twice.  We believe everyone could have a bad day.  Well not here.  Everyday is a bad day.  They are very rude and condescending and they act like they are doing you a favor by waiting on you, that is if they wait on you. They can see you there but the staff is too busy gossiping and the owner/manager is a snob.  There are so many place to spend your hard earned money, this is not the place!"}
{"text":"Love there new menu, drinks are delicious and the atmosphere is great. Beef enchiladas yum and they make there own sauce."}
{"text":"My husband and I used to love coming to this restaurant free wine tasting Thursday happy hour and good food. Then management changes then ownership so now they've changed everything the food is okay, although the martinis are disgusting I didn't finish it and I'm not known to leave a drink.

The staff is friendly the place is well kept and well decorated I will give it that. It just changed so much so fast and not for the better. We will no longer be returning."}
{"text":"Excellent service and food. I would give it a 10 out of 10, but the highest is 5. The pasta gamberi I have had three times in a row. Their bread pudding is awesome."}
{"text":"We've visited this place twice during our visits to Glendale and absolutely love it! Great atmosphere to have wine and dinner and the staff is friendly. They have a great menu but are known for their mushroom bar. We were just there on March 20th and enjoyed their Shrimp appetizer and the Mushroom Taster. 8 buttons and you choose 4 Flavors. It was great as usual. Alas, we were just told that Betty's Nosh is to be no more after April because they're becoming a Mexican restaurant. I guess there aren't enough Mexican restaurants in the area. I hope this isn't true but if it is, too bad!"}
{"text":"New management needs a little more time to work it out. My excitement about being able to return to Bettys Nosh or the new \"Nosh\" was cut short. New management is getting some things right. However my second breakfast here was anything but worth the price. A very greasy veggie omelet for $10, $2 for \"fruit\", well at least the cantaloupe and pineapple I got, and bitter coffee. My husbands scalloped potatoes did not look appetizing so for now I would say choose the other potatoes. Others seemed to enjoy the chicken and waffle. And I hear the crab cake Benedict is great. The positive...although the bellinis went from $3 to $4, JT is the best bartender and really the reason anyone comes to The Nosh. He makes a mean Bloody Mary too. Improvements to be made but it is still early for new management and hopefully they can get it right."}
{"text":"Went for brunch and the food was delicious- tasted very fresh and not ordinary like other breakfast spots nearby. We sat on their patio which was nice and their service was attentive. Would like to try the dinner soon..."}
{"text":"We stopped here for a date night by accident - my husband wanted to go to a sports bar, I wanted to go to a restaurant where he wouldn't be staring at a game. This was the perfect combo! We were literally walking by to go to another restaurant and the vibe through the windows drew us in.

The ambiance was great for a date night, they did have a bar and tv's, but we grabbed some drinks and apps for happy hour and were able to have a conversation without having to shout over the noisy background. The server was friendly without being intrusive (he knew when to chat and when to go away so we could spend time with each other) - the owner even stopped by and got to know us a little before we left. 

Everyone was very friendly, the fish tacos were super fresh and tasty, we had a very nice time and will definitely be back. Especially for their great happy hour!"}
{"text":"Nosh Eatery and Wine Bar Newly Opened in the location of the Shuttered Betty's Nosh. The atmosphere is modern and attractive. They offer private dining and have an indoor-outdoor bar and an interesting indoor-outdoor dog friendly patio. The menu is traditional American Cuisine. 

I ordered the Roasted Chicken Arugula Wrap with a side of House Made Cole Slaw. I was expecting the wrap to be made with a tasty sounding sundried tomato basil mayo and cheddar cheese. Instead someone concocted a sauce that tasted similar to French Dressing mixed with Wing Sauce and the cheese they gave me was processed American Cheese. We also shared the Signature Macaroni and Cheese. This dish had promise because it was made with real cheese but unfortunately the sauce lacked any seasoning and was so watered down that it was weak.

 My husband ordered the Signature Cheeseburger. Unfortunately the management didn't remove the Betty's Nosh Menu items from the computer system and our waitress accidentally ordered an incorrect burger with American Cheese instead of the Signature Burger with Gouda, Havarti, shoestring onions, fried egg on Brioche Bun. My husband alerted the waitress right away that she didn't bring him the burger he ordered. She brought it back to the kitchen and the cook recycled the burger scraping most of the American cheese off and then doctoring it up putting back on a regular bun instead of a brioche. But the worst part was that in the process the medium rare burger that my husband ordered turned to a well done burger. 

To the management a professional cook would never do that to a burger. The sauces were very unprofessional The egg in the burger was also over cooked. I feel sick and very sorry for the new owner of the restaurant. He needs to hire someone who can cook or get help from someone who can cook NOW before it's too late.

 This pains me very much because this place has such a lovely atmosphere and with a better cook this restaurant could be a hot spot in the area.

Newly opened and not ready for prime time but I do HOPE they get it together."}
{"text":"I was hesitant to try this restaurant after reading all the terrible reviews but we had already planned to meet a couple there and didn't want to change it. Very pleasantly surprised. Ambience was great, food was delicious, prices on the higher side but that was expected and definitely worth it for good food. My advice is don't let other people's negative views prevent you from trying this place!"}
{"text":"Guns Not Allowed.  Patrons are not allowed to carry their legal permitted firearms.  

Food is 3 on a 1-5 scale but way over priced.  Even with a Groupon or discount the food was over priced. First Chicken Parm they brought was burned the second not much better.  I think they were trying to pass frozen cutlets by as fresh made.  Only way I could explain the thin and burned chicken."}
{"text":"Was at The Nosh yesterday for a lunch meeting with friends. I thought it was very pleasant. The decor was contemporary, the service was good, the food was very good and it was a great place to meet with friends. I read some of the reviews prior to going and I did not know what to expect, I was pleasantly surprised. I looked at the food everyone ordered, it looked good and everyone said it was indeed good. So, my bottom line is that this place is a good one to go to for food and meeting with friends,"}
{"text":"I LOVE this place! We had our work Holiday luncheon there today, and it was Amazing! I cant wait to go back. Michael, Susan and Lawson treat you like family! Great wine, atmosphere, yummiest food ever, with a dog friendly patio! A must to try! Tell them Brenda sent you!"}
{"text":"We used to come here often when George was here and still come to see Jt now and again(which we love). This could possibly be the worst bartender my husband and I've ever had.   Food was decent but bar service and crafted drinks were awful.  Nosh or whatever you're calling yourself these days get you're old crew back or at least someone that knows what they're doing behind that bar!!"}
{"text":"Not a great place. Fish and Chips are Frozen fish planks.  Burger is flavorless, green chilies on top were out of a can.  We ordered a mushroom sampler for $29 8 white mushroom caps that can not cook long enough to be cooked through.  Figured like the single mushroom they would be Portabello, I was wrong.  Only one or the mushrooms had enough flavor to enjoy.  All and all a less then average restaurant at best."}
{"text":"Tried Nosh because it's close to home...

We had the most awkward server ever. In the history of servers. In the entire universe. Dropping items, coming back over and over asking the SAME question within a five minute span. Forgetting silverware, then bringing too many and leaving them all over the table ( there were 2 of us), asking about 10 times in 10 minutes if my husband wanted another cocktail (NO!..& guess what, the answer is STILL no 60 seconds later). No side plates, asked.. he forgot . No water .. then literally standing over us watching us drink so he could refill. I'm just going to go out on a limb and say this server was seriously baked. I can't think of any other excuse for being so terrible at serving. He was so painfully awkward and awful that it ruined my meal.

Well .. the prices didn't help. We had a friend tell us the stuffed mushrooms we're really good. These bad boys cost $29/4! Oh snap! You can get a smaller plate for less, which we did. The mushrooms were ok. Nothing to write home about. Just stuffed and good. The burger- I did not like the green chili burger at all. My husband did.. to each their own, but I'm going to judge him on it;) I personally cannot handle dishes that have both a warm/hot element paired with cold. Nope nope nope. So burger with its warm meat and ice cold pico de Gallo was created just to annoy me. The meat was cooked well.. decent burger. I did not find one green chili on the burger despite the name.. interesting...Not the restaurants fault cold/hot foods freak me out.

We spent close to $50-burger was $14, 2 orders of shrooms@$9 an order and a cocktail $10+ tip. I left feeling pretty \"meh\" about the experience."}
{"text":"The food was good, the waitress did a great job.  The food all came out in a weird order leaving us eating separately rather than together and the stereo was up so loud that everyone was screaming so the restaurant was incredibly loud and I couldn't even hear the person sitting next to me unless they yelled."}
{"text":"Casual experience. Friendly staff, went on a midday Saturday.  Easy going. Food and drinks are good. Decent happy hour."}
{"text":"Terrible service. Lawson the bartender was cordial at first, but then turned awful when the lady's complained about the lemon drops. Very inappropriate service. He cut them off, rather then seeking a remedy. The new decor looks like a cross between a bad airport bar and a porta John. This place will fail within months with no decor and no customer service."}
{"text":"To be honest we were really glad that we had a Local Flavor coupon to use because this place is not worth the amount of money they charge for their food. I'm not saying that it was really horrible food - but it is just your average food you could throw together yourself at home with nothing special about it. We started off with the Italian Sausage stuffed portobello mushroom for $12. Granted, we are used to the ones at Oregano's that knock your socks off so maybe we were a little biased going in. But not only was it luke warm to cold, the flavors just did not meld together like they are supposed to. It simply tasted like a cooked portobello mushroom with some cooked Italian sausage sauce thrown on top with some cheese (not even melted) strewn over the top like an afterthought. It did not taste like it had been baked together so all the flavors could develop as one. I ordered the chicken marsala and just as other reviewer's have commented, it was definitely not homemade. The sauce definitely tasted like it came out of a jar and the potatoes tasted like they had been frozen and reheated. Hubby had the Reuben sandwich and although the flavors were good and the meat tender,  the bread was soggy and the french fries (which definitely came out of a bag) were cold. The highlight of our meal was the chocolate martinis that we each had as a dessert and we got those at the bargain price of $8 each due to it being reverse happy hour.  I do have to say however that our waiter was really great and you could tell he was working his butt off trying to take care of the entire place by himself but you would have never have known with his great attitude and always friendly smile. So I don't think that we will ever be back to this place and we probably would not recommend it to anybody either."}
{"text":"This place is awesome! Had a fun time with friends I had not seen in a while. The food was excellent, the drinks were cold and made to order!  The staff was fast and courteous!  I highly recommend this place! I can't wait to go back! Too bad there is not a 10 stat rating!"}
{"text":"We had a very pleasant brunch last Sunday, so we brought our daughter, who happens to be vegeterian, to dinner tonight.  We had a small issue with the server, but the new owner came out and spoke with us to make sure that everything worked out."}
{"text":"The location and overall vibe is really great. Our server was kind and attentive. Other than that this isn't a place I will return to. We were one of two tables, which should have been our first clue. Everything we ordered, with the exception of the lettuce on my salad was very clearly reheated from frozen. And the drinks were weak. It just was not a $60 meal."}
{"text":"Best burger of my LIFE here, look for Aaron. Sensible portions, great appetizers, good drinks. The cheeseburger portabella mushrooms are fantastic!"}
{"text":"Just had a corporate lunch for a team of 15.  the service was excellent and the variety of food we ordered doesn't match earlier reviews of \"nothing on the menu\".  I had the Beef and Blue mushrooms and they were done perfectly.  My wife had the cheese burger mushrooms and loved them.  

We will definitely head in for Wednesday 1/2 off bottle sale.  And whoever said their wine wasn't that good doesn't know wine.  They have everything from Ballistic Zin up to some nice bottles of Plumpjack Cab!"}
{"text":"This is a great little place to grab a bite! Yummy food, very friendly staff! I'm going back!"}
{"text":"I used to enjoy going here for the music on Weekend nights.  On 2 occasions, I have watched and heard the owner/manager be SO rude and disrespectful, that I will no longer frequent this spot.  The first time, I thought he must be having a bad night.  The 2nd time was the last time for me, there are too many other places that will appreciate their clients."}
{"text":"I'm not a culinary expert but I do know frozen food. I had the artichoke spinach stuffed mushrooms and the very expensive 2 mushrooms were very disappointing.  I sampled  a pasta dish and the sauce tasted canned. As a sidenote I had coffee and the refill was cool and very old. Cost wise, 2 small stuffed mushrooms and coffee came to $10.00!"}
{"text":"I tried to eat here Saturday night, but the staff had closed the place more than an hour before the posted closing time. Thanks for wasting an hour of my time."}
{"text":"The staff was very great! I ordered the fish tacos and they where pretty good! My daughters ordered the crème brûlée and brownie with ice cream. The butterscotch crème brûlée was our favorite! The staff is why I will be back again!!!!"}
{"text":"Great Crab cake dish for brunch on Sundays. New owners but place is about the same however no wine tasting on Thursday anymore."}
{"text":"I was trying out Nosh at the potential of it being a spot for a family event I was planning. I thought it had a nice, intimate atmosphere and a well rounded menu. I love mushrooms, so the stuffed mushrooms are what I was drawn to. I love the blue cheese and steak stuffed mushrooms, and the other varieties they have are good. Everything else on their menu seems average, and what you would find at several other restaurants. It lacks a bit of authenticity and originality. The mushrooms are good, and Nosh used to be referred to as a mushroom bar, which is totally fitting and great, but they have since erased that title and have seemed attempt at being known as a well rounded restaurant and to me, it doesn't have enough for that."}
{"text":"This place is now rebranded as Urban Margarita. Different menu (they kept a few select Nosh items) but same owners and staff."}
{"text":"Wowzer!  When I got here this place was dead! It made me kind of happy because that means better service for me (yay)! And I was definitely right. My brother and I got free samples of certain drinks to see if we liked them enough to order them. Some were good and some were not. But the fact is, it was an incredible experience. The food was great and spicy. The shrimp mushroom thing was excellent and the alfredo sauce was perfect. I would definitely go back if in the area"}
{"text":"We had the chicken fajitas and the French dip sandwich .Both were very good.Fajitas were much better than other Mexican restaurants we have been to.Lawson was an excellent waiter.Had a mojito,wasn't very good.House margarita was good.Would definitely go back.Great daily specials."}
{"text":"I was on a show called Check Please? and this was one of the places someone picked. I really enjoyed it. Since it has been awhile, I went back this week and found it was under new ownership. The mushroom small samplers seemed more expensive. $4 a piece. I had 4 and it would be nice if they came with a side salad or crostini or something. They are the size of a large aspirin lol. I was hungry when I got there and hungrier when I left. Like someone giving a man dying of thirst a sip of water..."}
{"text":"Menu is all over the place, doesn't fit a wine bar whatsoever. There are fajitas, burgers, spaghetti and meatballs, nachos, chimichanga.  Oh, and their famous mushrooms!  Ordered a flat bread which isn't even on the menu but they suggested it.  Had a hair in it so we got it for half off. Yippee!  They were out of regular crust so only had gluten-free but we got up charged three dollars for the gluten-free crust without being told in advance. The chicken on the flatbread tastes and looks like frozen, re-heated lunch meat! Also the tampon applicators were overflowing out of the little metal container on the wall in the women's bathroom. And they charge $14 for a glass of Kendall Jackson Chardonnay. Come on..."}
{"text":"Friendly bar staff but that was the only perk of the place. Food was AWFUL. Happy Hour for drinks was 3-7pm during the weekday but it's $2 off glasses of wine that were $9-15 so it's still not a good deal - especially for the cheap quality of wine they have. The only good on HH for food (3-6pm) was 2 small cheeseburger sliders for $7 and they seriously should've cost $2. Super poor quality. Same goes for the 2 pulled pork sandwiches for $7. Definitely do not recommend.
We also ordered calamari and crab cakes off the regular menu and extremely disappointed yet again. The calamari ($14) was the cheap sticks versus the rings and could only taste the deep fry way they cooked it - and the crab cakes ($15) were a weird old grey color. Yuck. 

$90 tab before tip and walked out hoping that old food I just ate wasn't going to make me sick. I don't mind paying extra $ for good food, but I have to reiterate how terrible the quality was. 
Not one single food item I would recommend from here and I will definitely not be returning."}
{"text":"Have been waiting for awhile before trying Nosh after it changed management. The only think suggestion I can make is that they are over-priced for the type of food they serve and for the area. $10.00 for my cocktail is what I expect to pay at slightly high end establishment, not a place in a strip mall with typical food selections. Their prices for their food are too high also and I do not think that will do well to entice customers. I wish them luck, but, if they lowered their prices, they might be more successful."}
{"text":"Used to be good but not so much since new management. BRING BACK THE GOURMET GRILLED CHEESE!!!!

P.S. Chairs are too short for tables"}
{"text":"Not sure why so many negative reviews. The food was great.  Good wine discount Wednesday. The owner came over to say hello, such nice people. I had the salmon, my husband had a burger. Really good food."}
{"text":"No longer dog friendly which was the last reason I had to even go there.  Has never been the same since the new management.  When it was Betty's Nosh I would always go there since it is in the neighborhood and I would take friends when they came to visit, but not anymore.  Food not very good, service terrible.  When I asked the young waitress if they had Chianti, she said she didn't have any idea what that was.  I said Italian Red Wine, nope she never heard of it.  It's a shame that it has gone so downhill. Was such a nice neighborhood place when it was Betty's Nosh."}
{"text":"Came for Happy Hour; 
Appeared they changed names from Betty Nosh to \"The Nosh\",  had not been to location in while so didn't realize until we got there.
Location; right off the 101 and 67th ave.
Restaurant; Appeared to be same as Betty Nosh, so not sure what changed. 
Food; We were not that hungry, so just ordered the Chips and Guac which is one of our favorites,  upon receipt we dove in and something was off.  I was thinking maybe my taste buds were just off, but my Daughter said it tasted funny.  So we didn't eat much.
Service;  Our server was sweet but took a minute to receive my 2nd glass of wine.  Finally requested our bill and paid, she removed our dishes and came back not to long later and apologized.  She stated that it appeared the Guac was bad and took it off our bill.  I guess that explains the odd taste.
Happy Hour;  Not sure it was extremely cheap as Wine was $2 off but original cost seemed high 7-15 for a white wine. The food price was similar to stated price; Chips and Salsa on HH menu was $5.00 but on regular menu $5.95.  

Might try again and it appears they have a Dog Friendly patio."}
{"text":"Limited menu, food was not very flavorful and a tad boring. The name and decor are very cute, however the good doesn't measure up. Servers were friendly. Potentially a nice place just to grab a glass of wine."}
{"text":"Well I stopped in tonight for a glass of wine and sat there for four minutes with no service because the bartenders putting glasses away. Another guy walks in and the bartender rushes over  with a of glass water starts chatting him up. 

So they really weren't that busy tonight and I won't go back for a way long time if ever  because of NO service."}
{"text":"A little overpriced and service isn't always the greatest but good food and drinks overall"}
{"text":"New management sadly does not mean new and improved. Brought the pup's out with us for some patio lounging. The waitress was not happy at all from the moment we arrived to the moment we paid and brought up our groupon deal. She told us we weren't allowed to have our dogs on our laps- when they were both laying patiently on the floor...not a good vibe. She never offered water for our pups, thankfully we had some. She didn't offer suggestions for the new menu items. When I asked for them her reply was \"everything is good.\" There was only 4 other tables occupied while we were there including one right next to us on the patio. This table also agreed she was rude after her comment about the pups. Lack of customers could possibly be indicative that this restaurant isn't doing well since it changed owners. It took us 40 minutes to get our main entrees after we ordered (we only had 3 people ordering fajitas and pasta). Our glasses were refilled maybe twice. I'm sadly disappointed in this place. Also, management may want to consider new staff members as the one who served us was crass and gave the worst impression of this establishment. Working in the service industry myself, I don't know how this waitress thinks her attitude is acceptable when it directly affects her financial outcome. I would avoid this place if you can."}
{"text":"all i have to say is good riddance betty!! bye bye biotch!!! this place is finally good. hubby & i came here like 4-5 times in the last couple years under the old management and it sucked big balls. so today we are here at the nosh for happy hour and we're happy! the food, service and everything was great. thank u zack for being a super bartender and overall helpful sort :)"}
