{"text":"Best Fries I have had in a long time! Can't wait to get them next year! My daughter and I split an order of bacon and cheese fries since they were so big. SOOO worth the $8.00."}
{"text":"I'm sorry to go against the grain here, but we really didn't enjoy the fries.  We were looking forward to trying them because of their acclaim on the web.  Relatives spoke of the fries in terms of \"must do.\"

We had a reasonable wait, but were surprised as our cashier voiced his displeasure with his supervisor about having to work.  I assume this was an isolated occurrence and unlikely to be repeated.  It was great to see potatoes being sliced right there (these are not frozen).  We got the $6.29 plain and the $6.29 with onion salt (just from a store-bought season container) and an unreasonably priced $3.79 Pepsi.

Disappointingly, the thick-cut fries were oil and heavy with little taste beyond the oil.  Counter areas looked pretty messy at 4:00 in the afternoon. We ate the fries quickly enough, but afterwards, everyone from the kids to the parents and grandmother thought they were anywhere from \"just OK\" to \"not worth it.\"

I'm glad that many people seem to enjoy them more than us.  I wonder, though, if the reputation of these fries has gotten ahead of the fries themselves."}
{"text":"Ok the most popular place for French fries in the burg- not anymore for me~!! I have visited the potato patch hundreds of time in the past.  You do expect to wait because there is always a line - maybe 10-15 min wait.  Yesterday when I visited the park I chose the shortest line all the way to the left.   Ordering and paying before you get to the counter is a great enhancement to the order process.  This particular visit to the potato patch was the longest wait I have ever encountered.   It was almost 30 minutes. 

So finally get to the counter to pick up 1 order of fries and a pop  - small- simple order.  The young man that waited on me confirmed my order while looking up at the monitor and I repeated it and confirmed.. not a second later.. he asked me again after looking at the screen - again - what it was after getting the fries.. then he was preoccupied and I had to tell him a third time what my order was? Someone else even got my drink so was puzzled at why he couldn't remember what my 1 order of fries was?  Maybe the new ordering system is confusing to the workers getting the fries?!   Finally leaving with my order and pop - off to get napkins/forks that are available alongside the potato patch building.  No napkins or forks - everything was wiped out.  The dispensers were even opened - everything was gone. It was like a bomb went off.  Ok folks.. it wasn't the end of the day - it was 1:00 in the afternoon.    I would think there should be staff that checks on theses supplies a few times a day? Its the potato patch .. you know ahead you are getting a crowd.

I was so tired at this point of standing for 30 minutes for the fries we just sat down at the closest bench to eat without napkins. I noticed size of the fries were the same - but the small cardboard container that holds them is definitely smaller than what I remembered and for $7.00 + this was a very disappointing trip to the potato patch.  I really think I might just bypass it next time I visit the park.. it's just not how it used to be and definitely not worth it."}
{"text":"A Kennywood must try!

These are the best fries ever! Eating Potato Patch fries and going to Kennywood is part of the Pittsburgh summer. It's almost worth the price of admission to Kennywood alone!

Yes, the lines are long, but they do go fast. They are always cut fresh right before being fried, unlike the fast food chains that  double drop their fries. 

I always get the bacon and cheese fries and add ranch dressing and ketchup. Other available topping include beef gravy, garlic salt, seasoned salt, and bbq salt. 

You will defiantly need a hand full of napkins as you are going to get VERY messy!"}
{"text":"Just not good. Tried several times. I wanted to like them but greasy and soggy."}
{"text":"Super long wait no matter what time you go or how busy the park is. It is totally worth the wait! A kennywood must! Don't forget the cheddar and bacon they make it! I always feel bad for the guys having to slice the fresh potatoes and it is so amazing!"}
{"text":"I know this is a \"beloved\" Kennywood classic, but I just cannot find reasons to love it.

First off, the wait was dreadful, but I'll overlook that because it is located in an amusement park filled with hungry people. I ordered right off the menu--fries drizzled in cheddar cheese and loaded with bacon. That sounds delicious right? Well, what I got a pile of soggy fries drowned in grease and cheese with pieces of stale bacon on top that literally tasted like salty cardboard. Goodbye appetite, goodbye $7.  

Final verdict: It was a $7 poorly spent. I am a huge french fries fan, but I am definitely NOT a fan of the fries at The Potato Patch."}
{"text":"Literally everyone said this place was AMAZING. Best thing at Kennywood, which probably is true. But the fries was nothing special. Just some cheese and bacon,  but it does look delicious though. Just try it just so you can say you did."}
{"text":"If you live in Pittsburgh, you have to visit Kennywood and you have to eat at The Potato Patch at LEAST once. It's just one of our rules. But why you'd stop at just once I don't know, because these fries are great! They're thick-cut, fresh, and will be piping hot and covered in the toppings you want when they're served - so as far as I'm concerned they're everything you'd want from a really good batch of fries.

It's not uncommon to see a line as you walk by The Potato Patch, but usually it moves very quickly so don't let it scare you off! If you're ready for lunch, just step in behind someone and start thinking about what you want on your hand cut fries. I usually just go for cheese and gravy and add some ketchup on the side, but they'll also add on some vinegar and a few other ingredients if you want them. Once you order you'll just have to wait briefly for the staff to hand you your container of fries and a fork, and from there, it's chow time! There's some seating available right next to the stand, although depending on the crowd that day you may have to eat while standing. 

A few other notes from me about the Potato Patch: they just serve a standard sized order, so depending on how hungry you are you may want to share it with a friend. (Or not!) I also know from experience that sometimes the gravy isn't particularly thick, resulting in most of it sliding to the bottom of the bin. Personally I'm fine with this, since it means the last few bites of fries are soaked in gravy and it's absolutely delicious, but it may be something to keep in mind based on personal taste.

Overall though, 2 big thumbs up from this gal! Now when do I get to go back to Kennywood and get more of these fries?"}
{"text":"4 stars for tradition, 1 star for service, 3 stars for quality.  The lines are long, the prices are expensive, the service is crappy, but it's a tradition and they are pretty tasty after a fun-filled day of rides."}
{"text":"Literal best fries in the US. Try them with vinegar! A PA favorite!"}
{"text":"here's the deal: this place is a pittsburgh institution.  you to kennywood, you eat potato patch fries.  that's just the way it is when you're born & raised in the 412.  if you don't give this place 5 stars, you're definitely not a true pittsburgher.

for those out-of-towners: the fries are hand-cut, like steak fries.  toppings include cheese (lots & lots of melted cheddar cheese that comes out of pumps but is still somehow delicious), beef gravy, garlic salt, seasoned salt, and bbq salt.  oh yeah, and bacon.  actually, fried bacon -- perfection!

right by the thunderbolt & noah's ark, it's almost worth the price of admission to kennywood alone!

ps - i saw a guy buy baked lay's here.  at the potato patch.  really?!"}
{"text":"I wonder if the recipe changed because, while the fries are still good, I remember them tasting a little better when I was a kid; however, it was nice to be able to eat here despite being gluten free. I asked at the counter if the fries were gluten free and was told everything but the gravy is."}
{"text":"Still the best thing to do while at Kennywood.  Yes, I did say THE BEST THING to do.  I mean yeah there are rides at the park and shows, but everyone, and I mean everyone, comes here for the fries to be had at The Potato Patch.  Not just any of the fries, but the cheddar bacon fries.  They are so damned good that you don't mind if you burn your tongue with eating them.

I also have to say that I enjoy that they streamlined the way to get your order here.  Instead of bum rushing the counter you stand in line to pay and then head up to pick up your order.  So much easier and there is no evil eye to be given to the person behind/next to you because you think they are trying to jump line.  

It is a total must to come here and get these fries.  If you come to Kennywood and do not partake, you are not getting the full effect of Kennywood."}
{"text":"The best summer and school picnic memories are the Potato Patch Fries. Who hasn't gone to Kennywood and not tried the fries?  You either love them or hate them, for me I am a LOVER. It is a must visit, when at the park. Thick hand-cut fries with the skins on, covered in a choice of toppings. The family love's their fries smothered in gravy. I prefer the garlic or season salt. Potato Patch Fries are a meal in itself. 

YES!  the lines can be long at times and dreadful, as some have comment, especially during the lunch and dinner hour. If you know what to expect and can plan accordingly, it is so dreadful a line or a wait.  They are well worth the it !!!. Kennywood has opened more lines so that the line moves more quickly. They understand how popular the fries have become, and how important a favorite they are to Kendywood park goers. There is also plenty of seats or wall area to sit on. I cannot comment on the service at the window, I am always the one searching for a seat. I have not heard any complaints that people have made around me or my family has comment on during any visit."}
{"text":"If you go to Kennywood, The Potato Patch fries are a must! They're always fresh and hot. The only downside is the line is always long, but it's worth it."}
{"text":"I stopped by the Potato Patch while visiting Kennywood last Sat.  Given that the Potato Patch is the most famed food stand in the park, I had to pay it a visit.  Since I had a picnic lunch at the park, I waited until dinnertime, when I was sufficiently hungry to justify getting an order of the famed potato patch fries.

At the time of my visit, there was hardly any line, which was likely due to the weather, which had been threatening to rain all day.  Even if there is a crowd, there are ten lines to order from, though, so I imagine it moves pretty fast.  The way it works is that you put in your order and pay first, and then you step forward to the window to receive your fries.  AFAIK, only fries are sold at this stand, so if you want something else, like a drink, you'll have to get it from a nearby stand.  (I hit up the nearby fresh squeezed lemonade stand.)

At the Potato Patch, a regular order of fries comes with one or more toppings, except for bacon, which is an upcharge.  In keeping with tradition, I ordered my fries with cheese and bacon ($8.20).  If you order cheese sauce, it will be poured over the fries unless you specify that you want it on the side--for my part, I wanted to enjoy the fries in their ooey, gooey glory, so this was fine with me.  As for the fries themselves, they are of the boardwalk variety--thick cut and with skin left on--and come in a medium sized portion (there's only one size), which was more than filling enough for me.  I am something of a fry connoisseur, so I can say with some authority that while they weren't the best fries I've ever had, they were quite good, and are definitely a cut above the usual theme park fare.

If it's your first time visiting Kennywood, as it was for me, be sure not to miss the Potato Patch!  Just make sure to go when your stomach's settled, so you can enjoy the fries in all of their crispy, topping-laden glory!

Note: I took a photo of the fries, as I usually do, but lost my phone before I could upload it.  :-("}
{"text":"As someone who didn't grow up in Pittsburgh, I wondred if the legendary Potato Patch fries would live up to expectations.  After all, every single person that knew I was going to Kennywood said that if I ate one thing that day, it had to be these fries.  They had a lot to live up to.  I heard stories of waiting up to a half hour (or more!) for the fries, so I was worried that I'd wait a long time and be disappointed.  

During our visit, there was a downpour and thunderstorm.  All the rides were closed but the area where we were seeking shelter a quick jaunt from the famed stand.  My husband braved the rain and got me an order with cheese, bacon and garlic salt.  It was love at first bite.  The fries were perfectly covered in warm cheese and an ample supply of bacon.  They were HOT and had just the right amount of crispness.  An awesome treat.  I was tempted to get them again before leaving the park but decided to save the treat for a repeat visit later this summer."}
{"text":"One the \"must do\" things at Kennywood is to get the Patch Fries. I always preferred getting the cheese on the side so my fries would not get soggy. I was a bit disappointed recently when we were given cold fries. Not sure how this can happen when the lines is continuous. My expectations are high from the Patch because of my memories. Make sure to visit this place while at Kennywood."}
{"text":"This is painful for me to actually post this but I am giving the Potato Patch at Kennywood Park 1 star of 5.   I grew up going to Kennywood Park and the Potato Patch was always something to look forward to with perfect fries and toppings like malt vinegar, gravy, cheese or just good old fashioned Heinz Ketchup and salt.  When I went to Kennywood this past summer I stood in line for 30 minutes and the fries were horrible and VERY soggy with old hot grease (and perhaps the worst thing that I have attempted to eat in a very long time).  I know that a lot of kids work at these amusement park stands but someone with a little more experience or seniority needs to put in some standards and return The Potato Patch to it's glory days."}
{"text":"I like cheese fries. Don't get the bacon. It's too greasy and will make you sick. I will be back here."}
{"text":"When spending the day at Kennywood, The Potato Patch fries are an absolute MUST!

One of my favorite Kennywood memories is The Potato Patch fries. These are thick, hand-cut fries that are served very hot and fresh. You can order a variety of toppings. My favorite way to eat these fries is with cheese, vinegar, or ketchup. But honestly, they have such an amazing flavor that you could just eat them plain if you wanted to. The lines are pretty long here, but don't let it scare you away. They move quick, and it's totally worth it and so satisfying after walking around working up an appetite all day.

I recommend The Potato Patch fries 100% - they're an essential part of the Kennywood experience!"}
{"text":"One of the best parts of Kennywood! Whether you eat the fries plain or you smother them in that amazing cheesy bacony goodness, you just can't go wrong. Can't leave visit Kennywood and not visit Potato Patch! Also heard they added poutine and burgers last year, I will definitely need to check those out!"}
{"text":"Definitely one of the main reasons I still come to Kennywood! Their fries make every trip worth it. Came here on a fright night and as expected the lines were ridiculously long, but moving. They had four different registers. They don't have many options but they don't need to. The fries with bacon and cheese are $7.99 and the best. 

They always give a hearty amount of fries topped with copious amounts of their cheese sauce and bacon bits. Their cheese sauce is rich, creamy and cheesy and does not taste artificial and their bacon is fatty and crunchy. All together with the fresh cut fries makes an amazing meal always. It was perfect on a chilly fall night to warm me up. Make sure to stop by here if you're at Kennywood! A childhood favorite that still makes my stomach happy!"}
