{"text":"My friend and I really enjoyed the food here. And we came here during the kit kat pop up store period, which was literally right around the corner.   From favs to not-so-impressed:  1. The Holy Crab: soft shell crab fried rice. The portions here are very decent and this dish could have fed 4 of us. So instead, one of us doggybagged it home. This was very flavourful, we both love the crab. Didn't really like/need the sauce that it came with.   2. Crab Bao. And why wouldn't we get more crab :) this was equally delicious cause again, more crab. See a trend here? We didn't realize there was spicy sauce in this and we would have asked for it on the size of we knew.   3. Aburi chirashi. Basically a deconstructed chirashi made into a torched sushi. We weren't that impressed given all the hype and the price point. Probably would have skipped this one and opted for dessert instead."}
{"text":"One of the best value meals in the entertainment district. Crab fried rice is a must try!!"}
{"text":"Went here for weekday late night dinner. Between two of us, we shared the Soft Shell Crab fried rice and the aburi chirashi.  Both were delicious & flavourful and very filling! The aburi chirashi felt like a deconstructed roll while the soft shell crab fried rice felt closer to a thai fried rice.  They were also having $5 sapporo specials.  Will definitely come back to try other dishes."}
{"text":"Some of the best wins in life come after having input little to no effort, and especially without you deserving it. A couple days ago I not-so-earned one of these wins by having dinner at The Haam.  The Haam is a two month old Asian fusion restaurant located in Toronto's Entertainment District. What is it fused with? You tell me, but whatever it is, all fusions should take note. The restaurant is somewhat small, though it is setup for small group dining. Its warm lighting complements the rustic brick walls, and the choice of Korean & Japanese art fill the space well. Overall, it seems like a great place to bring a date, or just drop by for a relaxing bite.  But a great dining experience isn't won on decor alone. Things started off with a bang with their unimpressively named Spicy Fries. These fries are far more than simply spicy. To be honest, I can't do their seasoning mix justice, but it should suffice to say that these beautifully crispy fries will present you with a combination of unexpected flavours that you'll seldom find elsewhere. Try a couple of them naked first, and then take a ride into flavour town with their ingenious pairing of wasabi mayo.  We kept the party going with their Spider Bao. For the uninitiated amoung us, bao is an open Chinese bun, with a variety of potential fillings. Haam's Spider Bao is filled with deep fried soft shell crab, guar, picked red onion, sriracha, and hoisin. You'll be served two of these large baos, which isn't quite a meal on its own, but is a great addition to an appetizer. All of the fresh ingredients are sandwiched in between their wonderfully fluffy bao bun, which despite appearances, does a pretty good job encasing the mildly spicy filling within. This time around, the flavours are somewhat simpler, but many of them are powerful enough individually that the whole bite makes for a fulfilling experience. The one area where this bao might do a little better is finding a way to not mask the pickled red onion as much. It was tough to notice amoung the rest of the strong cast.  To not make this a novel, I won't dive deep into describing their Popcorn Shrimp, but know that this was hands down the most bizarre and fulfilling part of the meal. The killer combination of deep fried tiger shrimp, sambol, and chili oil is killer on its own, but they have the audacity to add actual popcorn (green apple flavoured) to the dish. It had us laughing and loving it at the same time.  Other items worth mention are their unique mac and cheese, their oh so comforting takoyaki (with bacon, kimchi, and bonito flakes), and their variety of atypical teas. I washed most of the meal down with coconut tea.   My only real complaint is that sitting in the aisle leaves you susceptible to the always annoying occasional shoulder bump. Aside from that, these guys are on to something special. To be honest, I was surprised how reasonably priced their food is. The cheap old man in me doesn't want to admit it, but I would certainly pay more. I often say that I'd be happy to go back to certain restaurants, yet never do, but you can bet your ass that I'm heading back to The Haam. Great food."}
{"text":"Noticed this spot pop up on my walk to work. I tried the Spicy Pork Bowl. It had a generous portion of perfectly spicy bulgogi pork mixed with greens and rice and glass noodles. I will definitely be back for more."}
{"text":"Amazing food, and a unique twist on their fried chicken and Mac and cheese  Their menu constantly changes however, I would recommend their Mac and cheese. (It's their popular dish)"}
{"text":"A lot of things wrong with this place. On a hot summer day, the LAST thing I want is a meal consisting of fried food and mayo. The menu descriptions really did not convey what the dishes were....The macboki had maybe three pieces of cauliflower and the rest was macaroni soaked in cheese and grease. The ramen salad was pretty much ramen with mayonnaise and a small handful of leafy greens on top. We also got an octopus dish that was...wait for it...deep fried octopus balls. So why don't you say that in your description man?! The service was very subpar...they need to work on a lot of things if they are planning on staying open for longer than 6 months. Go to ema-tei...crazy good and service is excellent. Hamm needs to go HAM to get more people walking through their doors...otherwise, peace."}
{"text":"Ordered: - Macboki - Okonomiyaki bulgogi - Holy crab  All three were delicious! Flavours and presentation are great. Would get all three again and come back to try more.  They also have drink special $5 for pint of Sapporo, not sure when the promo is on but we came here on a Monday night for dinner if that helps :)"}
{"text":"First of all, wow.  This place was so delicious, I was happy I actually came here. The holy burger wasn't my favorite because I personally dont like those spices but my friends loved them. The macbokki was so flavorful and the cheese combination was perfect. I dont even like mac and cheese but this was good. Chicken Karaage different from other places! Unique and delicious flavor w. a curry dip. Not oily at all. Lastly, the Aburi Chirashi was so delicious, i usually dont like smoked fish on top but Haam did it perfectly, all my friends loved it. The fresh and fatty fish on top mixed perfectly with their flavored rice that is mixed with seaweed. I am dreaming about the Aburi now while writing this, even if it is quite expensive. Prices are a bit steep but the food really made up for it. Cute place and food came in a reasonable time.   Would definitely go again to try everything else!"}
{"text":"Fusion food can be really good or really bad. Luckily, they've seemed to have gotten it right here. Expect similar quality food to Saku Sushi down on Queen West.   My favourite was the Mac and cheese! It's a bit sweet, cheesy, but didn't feel overly indulgent. I'd give the takoyaki a skip, but I just got back from Japan so maybe my standards are a bit high. Although the bacon bits on top reminded me of the fake bacon you buy at grocery stores. I also tried the ramen duck salad which was a-ok.   It's a great location, especially if you're catching a game or concert at the Rogers Centre."}
{"text":"3.5 stars..slightly above average.  Got ceviche..makbboki ...aburi ...bulgogi burger...crab fried rice ..and brulee  Ceviche...good touch with the squash puree  Crab fried rice...nice sauce   Bulgogi..meat was a bit dry   Anuri....too saucy ...overpowers everything ...rice easily broke apart    My wife and I thought it was Ok ...nothing mind blowing   Service was good ...hard working (sooyoung) girl who was all alone covering nearly 30 guests at once   I say try it once...for us..not good enough to return but you may like it better than we did"}
{"text":"Excellent Asian fusion cuisine - I had the Holy Crab and it was delicious. I highly recommend this place!"}
{"text":"I went here on a Tuesday night with 4 people and I was blown away by this place. They definitely do the \"asian fusion\" title justice, everything we tried on the menu was presented beautifully and tasted delicious.  We had: Takoyaki, Holy Crab, Macbokki, Chicken Karaage, Spider Bao and the Smoked Duck Ramen Salad. (Also $5 Sapporos!) Between the 4 of us, we were all stuffed after eating our own dish. Even my friend who normally eats huge portions found himself satisfied by the Macbokki.  The prices were quite fair for the portion and presentation, also the service and atmosphere is fantastic. The food is so fresh, which is important when there are so many seafood items. They take reservations but it wasn't too packed when I went. The waitress is lovely and was very attentive and knowledgeable in referring vegetarian options for my other friend. I would definitely come again!"}
{"text":"I had saw the review of this restaurant done by blogTO and definitely wanted to give it a try after seeing what was offered.   There were 4 of us and we just walked in on a Saturday night around 8:30pm. The restaurant was empty which was pretty surprising for a Saturday night. But shortly after we sat down a few other groups showed up.   We were greeted and sat right away. Water came right away and we were informed right at the beginning that they are in the works getting their liquor license so they don't have any alcoholic drinks.   The menu was one page, seemed like mostly shareable dishes, but also big enough to be for one person. The portions were definitely very generous.   We ordered the scallop ceviche, fried chicken, holy crab, macbokki and aburi charasi.   Scallop ceviche - they gave a very generous amount of scallops and it tasted very fresh. The flavours were refreshing with the different elements. The sourness of the sauce and sweetness of the purée created a good balance.   Fried chicken - crispy on the outside and juicy on the inside. The chicken had good flavour itself and had worked well the sauces it came with. It came with 6 big pieces of chicken.   Holy crab - fried rice was fragrant and loaded with seafood. It was a very good size and the soft shell crab was fried nicely. The sweet and spicy sauce added a nice touch. I think it could have used a little more acidity to balance the flavours. They did give a lime but it was dry so didn't add much flavour to it. But overall the flavours are very good.   Macbokki - cheesy saucy goodness! It was delicious and had the Korean flavours but fusion with the macaroni noodles. It was nice and smoky flavoured with a hint of sweetness. Also came with some crispy taro chips which was a nice touch.   Aburi charasi - was not what I was expecting. It came as a aburi roll. The base of the roll was rice and topped with maybe 4-5 pieces of fish, topped with sauce and then torched. For the 4-5 pieces of fish was definitely NOT worth $25. It was so expensive for what you get.   Overall the flavour and portions were very good. It's a fairly small menu but it was enough to share a few dishes with a group. Service was fast and friendly and the restaurant itself was very nicely decorated. I would definitely go again when they have drinks available! Would also like to see some desserts."}
{"text":"They do Asian fusion really well! I love all the flavours in each dish.  We got the Duck Bao, Aburi Chirashi and Holy Crab. The Duck bao was probably be favourite! I'm surprised how jam packed they can make one Bao!! It was juicy and super delicious.   The other two dishes - Aburi Chirashi and holy crab was a bit too salty for our liking.  Service was pretty decent! They were attentive and wanted to know how we felt about the food.  The restaurant is small so make sure to get a reservation during those peak hours."}
{"text":"While I usually don't like Asian fusion, this place was amazing and the quality of the food was up there. Portions are also generous which can sometimes not be the case for downtown tapas-style places.  Everything was plated beautifully and extremely tasty. My fav was the okonomiyaki bulgogi. The holy crab and truffle aburi chirashi were a close second."}
{"text":"Came here on a Wednesday night around 730pm, although the place is considerably small, we were able to be seated a table for 2 fairly quickly. However if you are deciding to come for a party larger than 4, reservations are highly suggested because they restaurant sits less than 50 people.   For a fairly compacted menu, we ordered 4 items to share upon the 2 of us. We ordered:  Macboki -  which was like a mac and cheese with small elbow macaroni with a sweet rather than savory cheese sauce, baked and topped with taro chips. There were 3 or 4 pcs of cauliflower in it, however I didn't quite understand the concept of adding that, it wasn't to add texture or flavor and only such little amount of florets. However I must say, it was pretty cheesy and quite surprisingly it wasn't heavy unlike most cheese sauces. Overall 4.5/5 *Definite must try*  Smoked Duck Ramen Salad -  quite interesting I must say, it was cold ramen tossed in a wasabi Japanese mayo, so it was on a sweeter side with the taste of the wasabi radish but not spicy at all. The smoked duck was flavorful as well, tender and well seasoned. The mixed greens which came in it didn't quite really go with the dish, so I ate the ramen by itself and the greens by itself.  Overall 4/5  Immortal Burger - not quite what I imagined to be honest. I thought more of a slider size however it's an actual burger size cut in half. Spicy pulled pork at the bottom, I didn't really feel like it was spicy, bulgogi patty which was quite interesting and delicious, topped with coleslaw and kimchi. It definitely tasted better than its presentation. A little messy while eating it due to the height of the burger. Overall 4/5  Spider Bao - deep fried soft shell crab with guacamole spread on the inside, stuffed with pickled onion and hoisin and sriracha. The bao was soft and moist which went well with the crunchiness of the crab. The soft shell crab was battered in panko which made the legs way too crunchy and hard.  Overall 3/5  Interesting experience overall, food was good as well as the atmosphere, however nothing too wow for me to come back a second time but would definitely recommend friends to try this place out!"}
{"text":"Had the chicken Katsu, sous vide eggs and gyoza for lunch. Ordered on ritual and saved 6 bucks on first visit with 500 points. Big portion. Satisfying. Katsu is fresh and flavourful. Paper container is environmentally friendly. Self serving sauces. Love that the eggs are free ranged."}
{"text":"Went here yesterday with my mom and sister for some food; we had there lunch menu ; the food was really good !! I recommend the spiced fries !  Everyone was so friendly and service was great ; also chicken and waffles are good too ( spicy but good ) . Check this new spot out ! It's a little bit hard to find as it's in a small spot, but they deserve more attention !"}
{"text":"Atmosphere: Quite good.  Food: Bad. Their foods SEEMED great, but its quality and attitude is really bad. First, I doubt they used good quality ingredients. I orderd Macbokki, Holy Crab and some others, and they were all not good. They looked good though.  Service: Bad. Server was very rude.  Price: Highly over-priced.   I guess they need to lower the prices in overall."}
{"text":"I've only ever gotten take out and it was the chicken katsu and add gyoza. It is such a nice dish. The chicken is crisp and moist. The sauce is very tasty. Glass noodles and rice as well as sweet potato, edamame and lettuce. Topped with a sit poached egg. Such a filling lunch. AND if you get it through ritual right now for the first time you get 6$ off"}
{"text":"Because of the not so great experience I previously had, the owner of the restaurant reached out to me directly and apologized for the experience and asked that I gave them another chance.  I revisited with the same group of friends and we were much happier with the overall experience this time. The first thing I noticed was the soba was removed from the menu. This showed to me that the restaurant cared about feedback and customer satisfaction.  We ordered the MacBokki and Holy Crab again as we knew those were good dishes. We tried their Aburi Chirashi and chicken karaage this time around as well. Both were delicious and I would recommend both. The chirashi is a bit on the small side though so you may not be full having just that as your main course.  We finished our meal off with their Earl Grey Creme Brûlée which was interesting. It had a bit of cream cheese in it which made it a little different. Still good though and worth a try.  The restaurant is fairly new and trying to find its ground. The owner of this restaurant is the same as Saku Sushi on Queen St.   Based on this revisit, I'm bumping my review up to a 4 star as the food was good and the speed at which they came out improved.  Thank you for reaching out."}
{"text":"This new Asian fusion restaurant has a lot going for it. Dishes here are familiar, yet different in a delightful way. While flavours are Asian-fusion, it leans towards Korean flavours.  The place itself is small with a modern decor, but arranged in a way that it doesn't feel cramped.  Ordering and sharing a bunch of dishes is the way to go here, and believe me, you'd want to try everything because everything is so tasty.  During our visit, we had:  Seabass crudo - with chojang (Korean sweet & spicy sauce), EVOO, crispy fish skin. A great starter!  Scallop ceviche - with ikura, red onion, yam, avocado and shallots. Very tasty, though I wished they used diced big scallops instead of the small ones.  Macbokki - with Gochujang, cauliflower, smoked cheddar, provolone gruyere and za'atar (middle eastern spice mix). The presentation was on point with yam chips on top, and I have to say that I prefer this over a traditional mac n cheese  Fried chicken - with curry, ssambal and mint. This was probably the least exciting dish of the evening, though still quite tasty.  Holly Crab - with deep dried soft shell crab and a friend rice loaded with scallop, shrimp and squid. I found it a tad salty but not overly so  Aburi chirashi - with uni, tuna, salmon, shiso, ikura, garlic mayom, truffle paste and truffle oil. This was fantastic and a must-get IMO.  Service was friendly and attentive throughout the night.  Recommended!"}
{"text":"Saw that the restaurant was featured in BlogTO and decided to give it a try while visiting Toronto. Macbokkee (mac and cheese/ddokbokee sauce fusion) was delicious!! It's a good mix of cheese/gochujang, not spicy at all. I definitely recommend if you love mac and cheese. Holycrab/fried chicken were pretty good as well."}
{"text":"Great example of east-meets-west fusion food. I shared three dishes with two of my friends: the macbokki, the soft shell crab rice (I think it's called Holy Crab!), and the aburi. Macbokki was not really spicy, but pasta was perfectly al dente and deliciously cheesy. The star of the Holy Crab! is, no surprise, the crab and, surprisingly, the sauce that comes with it - rice itself was lacklustre. The aburi was creamy and rich; I would definitely order it again. However, portions are quite small - more like tapas than mains. We were satisfied with the dishes split amongst us, but not quite full (we got fried chicken just a few hours later lol). Also, sorry for the shit photos - I took them off my Instagram.   As for ambience, the place is quite cramped; try to get a reservation. Also, no drinks as of yet since they don't have their liquor license yet."}
{"text":"I came here 3 weeks after their opening and I loved it here. I usually don't like to drop money on Asian fusion but no regrets this time. We ordered the unagi tacos, crab fried rice, ceviche, seaweed sashimi salad, Mac and cheese cauliflower, and omakase sushi.  Our favourite was the crab fried rice, so delicious and flavourful! And soft shell crab is always great when done right.  Their omakase sushi was really fresh considering it wasn't expensive sushi either! Another item that stood out was the ceviche with yam purée, it was sour and acidic but the yam purée really complimented the whole dish. Everything else was also good and I would definitely come back."}
{"text":"I don't think my friend and I thought it through what we were ordering. We got the macboki to start and each got a spider bao and holy crab.   The macboki was very different from what I had imagined it to be in my head. Perhaps I didn't thoroughly read the description in the menu. I thought it was mainly cauliflower and didn't even know there'd be macaroni in it. We were pleasantly surprised when it came to the table. I thought it would be spicier with a gochujang sauce but I could hardly taste any spiciness. There also wasn't much cauliflower.   I didn't expect the spider bao to be spicy and had to take off some of the sauce in order to enjoy it. The holy crab was a bit on the salty side but delicious.  The spider bao and holy crab may be too much for those that don't eat a lot. We found ourselves packing up a lot of the food to go.  I don't know if it was just us but we were exceptionally cold in the restaurant."}
