{"text":"The reviews have made this a \"must-go\" destination for some time, and finally made time to stop in today. I had the Wild Shrimp Burger a la Swandri with Spiced Jack Cheese, and a side soup and was not disappointed!  Everything is hot, fresh, made to order, and you can taste the difference on the first bite. Highly recommended to enjoy an amazing lunch or dinner with quality ingredients and top notch service. I will be back"}
{"text":"I am constantly amazed at the number of fantastic eateries in and around the Marlbourough area.  Today, needing to take a break from slaving over the computer all day, and getting tired of mall food fare, I decided to take a walk around my neighborhood with the vague notion of grabbing lunch somewhere.  Vista Landing has many wonderful eateries, although they tend to change every few years.  For example, when I was in elementary school, Burger Inn had a location in this place, as did the infamous (but now long gone) Tiger Billiards, and later on, Taketomi Village actually was a Japanese restaurant that served very delicious cuisine.  As I was walking down the strip, a new restaurant caught my eye: The ROCK.  Living here in this area most of my life, I had never heard of this place before, and for the life of me, I can't remember what used to be there.  Checking out the menu outside the door, and noticing that a review by local food critic John Gilchrist was also posted, I decided to give it a try.  Immediately as I entered, I was greeted by the chef and owner Swandri, where I learned that this establishment had only been in operation for four months.  He asked me how I heard about the place, and while I longed to say that I heard about it on Yelp, realistically, I just stumbled upon it in my daily adventures.  I had gotten there in the late afternoon; too early for the dinner menu (which seems to be their specialty, although as I was the only patron in the place at the moment, I'm pretty sure I could have ordered whatever), I decided to pick something from the lunch menu, although they also have breakfast and brunch options as well.  I ended up having the New Zealand Lamb Burger with House Salad and a cola.  Now, I love lamb, and this burger was excellent.  Grilled to perfection right in front of my eyes (the grill is in the main restaurant area), the savory smells definitely whetted my appetite and left me wanting for more.  As such, I decided to go for dessert.  On special and not on the regular dessert menu, I went with the White Chocolate and Green Tea Mousse.  Topped with four maraschino cherries, this thing was rich, but so tasty.  While the entire dessert was coloured green, you could definitely taste the white chocolate with just a hint of the green tea.  That said, even though the tea taste was subtle, I'm definitely a caffeine virgin, and I was feeling it shortly after I left.  It was delicious though, and the portion was huge; it made me wish I had gone with a friend to share.  All-in-all, my bill came up to around $22 or $23, which was more than reasonable for the portions I got (without dessert, it probably would have come to less than $15 for sure) and the quality of the food beats most places downtown or in the beltline for sure.  I definitely plan to come back to sample the dinner menu, and places like The ROCK make me feel proud that I live in a neighborhood with so much diversity in food choices, with quality that can rival any of the gourmet places in town, any day of the week with prices that don't hurt the pocket book.  Very impressed."}
{"text":"This tiny little restaurant has no frills, but they are trying really hard to please their customers.  The food is fresh and delicious, I highly recommend the shrimp burger, and the creamy tiramisu.  The chef (who is quite young I might add) took the time to chat with us for a while,  asking how things were, and told us about all the home made items on the menu. Im hoping for big things for this little place, it has so much potential!"}
{"text":"On a recommendation we went to The Rock. Don't let the location or outside of the place fool you. This restaurant is top notch. The food is amazing fresh, local and put together wonderfully. The lamb shank and beef short ribs were the BEST we ever had.  Not to mention Tiramisu that is out of this world and SEASONAL.  That is if the chef cannot get the fresh ricotta cheese he will not make it - wow talk about quality!  The big surprise is the price, expect to pay about 50% LESS than any other high quality restaurant. This restaurant though small (7 tables and 22 seats) will become a favorite for all Calgary Foodies after one visit."}
{"text":"This place really is a little gem. We went there as a group of eight and the service was fantastic. They had a special lobster shrimp burger with homemade rice patties as the \"bun\" and a really interesting sweet potato side salad. Delicious with fresh, unique flavours. To start, I shared braised escargot with my man.  It was bacon-y tomato escargot goodness with really neat flavour and texture.  The place is a little \"out of the way\" and the decor is a little lacking. But the points it loses for that are totally made up by the passion the chef has for  his food. He came to take our order and described the food with so much love and enthusiasm you wanted to try everything he offered. He also was quick to counsel one member of our group that she might be ordering too much which was nice (she still ordered it all anyway!). A couple of us had dessert and the chef brought by a taster tiramisu for the table to try as well.  At the end we had to go up to the counter to pay (no bill brought to the table). She had separate checks already done up for each couple which made things super easy. They do only take debit or cash - not a problem but something to be aware of.  All in all it is a unique, tasty experience that I would recommend. You would be hard pressed to find better food quality and service for the money spent-the prices are far less than you'd find in a comparable restaurant."}
{"text":"After reading some glowing reviews of this place, I was very underwhelmed. Like previous reviews, the interior of this restaurant is very simplistic. I'd even go as far as to say that I've been in nicer cafeteria's. I don't know if it's what I ordered, or that I came in with high expectations. We ordered the calamari to start. Th rings of calamari were pretty big and chewy. My son had a hard time swallowing them. Also we ordered the basic burger, with fries. The burger was good, but certainly not awesome. The fries were alright, somewhat wedge shaped with a coating of some kind on them. Maybe I should've tried the shrimp burger, that everyone had raved about. Also I didn't order anything off the entree side of the menu. I saw the prices and opted out. I wasn't going to spend $30+ dollars per entree for my two boys who are 4 and 10 years old. I have to say that the people working inside were friendly and attentive enough.  We were also the only table being served when we arrived, and by the time we left.  Would I try this place out again ? Probably not,  I've been there done that.  Nothing in my mind really stuck out enough to make me return"}
{"text":"My sister read about this place in the paper and saw how high the ratings were, so we decided to take the family there.  Our dad didn't want to go because of the location (he thought it would be a hole in the wall). Everything we ordered was SOOOO GOOD and everything exceeded our expectations.  Amazing and friendly service, and really delicious food. We ordered the shrimp burger, rack of lamb, duck breast, chicken supreme, and the salmon...all of them were excellent!! We will be coming back for sure."}
{"text":"Finally after reading so many reviews I had the chance to check out this restaurant. Not once but two times on two different birthday celebrations meaning it would be at least a party of 12 x 2 which is my favorite thing to judge how a restaurant operates.  Walking into the restaurant you would never guess the kind of food that is served in this establishment. The decor is very mediocre but the food you receive gives you a pleasant surprise thereafter.  Our table of 12 was set with water ready for us. The owner of the place had requested we all put in our orders the day before since they always buy everything fresh at this place. We didn't mind at all and it makes the food even better that way.  We all sat down and the server took our names and the owner immediately gets cracking. Before you know it all the entrees are starting to come out and you can see how excited everyone is getting to taste their food.  I can't really recall what I had the first time but I do recall the tomato soup. This was the best tomato soup I have ever had. Loved it had somewhat of a kick to it. It was so delicious I wanted to order a second serving.  The second time going to The Rock I ordered the duck. Man, I love this meal because it isn't too heavy or too much food. I thought it was the perfect amount for how hungry I am usually.  There's so many more items to choose for dinner and I need to really hit a couple of the specials and I definitely need to go here for lunch."}
{"text":"Wish they would open the hours that they advertise.  Tried on four separate Saturday mornings, after 11am and they were closed. We called today before driving there....no answer. Guess they do not want new business!"}
{"text":"Passionate about his food.  That's how I would describe Swandri, the chef and owner of the Rock.  Looking for \"something\" a little different for dinner, I did a quick search on Yelp and came up with this little gem.  If it wasn't for the couple of mentions that the decor left something to be desired, I may not have gone, because the place is small and out of the way, not to mention a little mom and pop diner meets dingy cafe sort of place.  But please DO NOT let this put you off!  One day you will see this guy on Iron Chef or something on TV, his food is that good, and he is heading up to much bigger things. One day you will see him owning the best restaurant in Calgary.  When you walk in and sit down, you will see right away, the way he presents his specials and talks about his food, this guy has class and passion about what he does.  The newspaper clippings on the door show he's won several awards and recognitions. Others have said now i am, Trust me the food is worth it! Go!  We lucked out and had a night where he made a beef wellington, it was awesome! The meal and the presentation looked as if it would have been at home at some snooty 5 star high end restaurant, and yet it was only 24.00 well worth it it my books.  We had a little tiramisu for dessert and I think it's the best I ever had!  I hope to return soon! This place totally rocks!"}
{"text":"I didn't have a good experience as other reviewers maybe it was my mistake to order the duck. It was so chewy and very bland. and the decor and the atmosphere were just very strange for me"}
{"text":"Review #3 of Yelp's 30 Day Challenge 2012  You there. Yeah, you. The one reading this review. Go directly to The Rock. Pass by all of the other restaurants. Do not collect goodies from anywhere else.  The ROCK has been on my Yelp bookmark list forEVER. But the time has come that I officially crossed it off my list of places to try. Like so many restaurants in Calgary, it's in a strip mall. And it's not exactly got the most inviting exterior.  Inside, The ROCK is itty bitty. 8 tables in all. For a Friday at lunch, I thought it would be busier. Though we got there at 11, we didn't leave until nearly 130. And in that entire time only one other table came in. WTF North Easterners? How do you not know this place is here?  Most of the food is made from scratch. And, holy toledo, Yelpman, it's tasty. We started out with an order of calamari. It's breaded and fried in house and comes with a delicious mayo-based dipping sauce. Just crispy enough, not overly greasy. If you like calamari, you'll like it here.  I kept reading about the New Zealand lamb burger. (You do know, by now, that if there is lamb on the menu, that is what I'm going to order, right?). I picked the in-house made fries as my side. It was big, it was filling, but the burger itself stayed together. No sauce dripping down my hands, just a little extra saliva flowing every time I took another bite as my mouth's way of saying it was a happy camper. My lunchmate was most intrigued with his shrimp burger and at how well the patty was staying together. No mess here either!  Did we have room for dessert? Nay. Oh, but when Chef Swandri offered us a free little sample of his tiramisu, how could we say no? He brought out a little cup of it for us to taste. Also delightful. And also made from scratch. Note: The cheese he uses is flown in from Vancouver. If he's out, sorry, no tiramisu!   Chef Swandri was the only one working yesterday. Both host and chef, he was awesome! Bonus points for geeking out over my new iPhone with me. I love it when I find kindred spirits beyond just a common love of food.   One thing to note about The ROCK. It's a destination for the foodie folk. As in, not as much neighbourhood traffic, but plenty of people driving from all over the city just to come try it. When it's busy, he's turning people away at the door. But when it's slow... man oh man, you can sit there for two hours chatting and getting to know the man behind the business and eating all of his yummy creations.  He's got dreams of expanding to a bigger location so he won't have to turn those customers away on the busier nights. So, like I mentioned at the start: Go. Go now directly to The ROCK. Do not collect noms from other restaurants along the way. At least not until you've been here first."}
{"text":"I bought a coupon deal for $15 to get $45 off my dining bill and based on diner reviews, I must agree this little cafe in the strip mall is indeed good. My husband had a steak and enjoyed it quite well.  The side salad was crispy, fresh and had a homemade raspberry drizzle on it.  Quite tasty. I had the large prawn in penne and it too was very good.  We shared a chocolate mousse for dessert together and had a nice chit chat with the owener and his wife.  Such a lovely couple and I wish them the best in their new business. Very good food, homemade everything and although a small dining place , it had good atmosphere and great service.  We will have to come back for the fish & chips here and try the mango mousse or the other homemade desserts !"}
{"text":"A tiny little place where the owner is the chef and greets you at the door. Everything is cooked right in front of you and the smell is AMAZING!! But the taste is even better!!  BEST burgers in town!!!"}
{"text":"The ROCK gets an upgrade to 5 stars because my second visit this weekend bestowed another incredible meal at an economical price with even better service (food was delivered in a timely fashion), despite the fact that the restaurant was busier than the last time I was here.  The chef remembered who I was when I made the reservation and called me by name several times throughout the evening.  I had the special for the weekend which was cream soup, stuffed chicken (spinach, cranberries and herbed aged cheese) with caper white wine cream sauce and yam fries.  Some sort of crunchy coating was put on the fries (not excessive, but just enough to partially cover each fry) which made them a bit unique and definitely delicious.  I burned my mouth because the soup was so hot, which I wasn't expecting.  I'm not complaining because I find it really nice to get piping hot food for a change.  The soup serving was large and loaded with a variety of vegetables.  So good, as was everything else.  My friends raved about the escargot they had.  I overheard other patrons talking about how much they love the food here and I actually engaged in conversation with people at the next table, as they asked my friend and I what we were eating (we both had the special).  They were sold on ordering the same meal by the time we finished telling them how awesome it was.  I'm glad I signed up for the weekly email newsletter, as that is what enticed me to return so quickly.  It was the photo of the weekend special at a price of $19.50.    Less than stellar bathroom aside, this place ROCKS."}
{"text":"This place has some awesome, kick-ass sandwiches and appies from what I have tried! I love how this place, in my opinion, is sort of like an under dog restaurant and has not sold its soul to the business devil. The dishes taste original and authentic. The prices are highly reasonable. And the owner is super friendly and is very thankful for your business. I would recommend this joint to anyone and everyone!"}
{"text":"The food was sooooo good. The restaurant is located in this ugly little strip mall next to a laundromat. The decor leaves much to be desired but the food was worth it.  I had the mushroom and cheese ravolis. They were rich and flavorful with handmade dough. My hubby had the ribs which were moist and flavorful and lots of them. We also had the cream of mushroom soup was was so right on!  The prices were so reasonable, I almost felt guilty. Make sure you come with cash or a debit card.  The owners could not be any nicer or more humble. You can tell that he loves to cook and really cared if you liked his cooking. He came around to each table when he had a minute to genuinely see if everything was alright.  Come for the food, not for the decor. We came all the way from California and were happy we did!"}
{"text":"I decided to call in an order to go since I thought it might be too crowded in the small restaurant based on reviews - it was ready in 15min. Thursday evening at around 7 - completely empty inside. Oh well... still got it to go.  Ordered the shrimp burger and tiramisu (they didnt have any cheesecake, which was my first choice).  The burger was really good... never had a shrimp burger before. All the ingredients played well off each other. The fries were just standard, but it could be that they got a little cold by the time I ate them. The tiramisu was AMAZING. Wow. I didnt even think I liked tiramisu because the ones I had in the past had way too much of an alcohol flavor overpowering it. This one was amazing and done perfectly. When I am back in town I'll have to swing by just for some dessert.  What I didnt realize was that it was cash or debit only, so crap... being from the U.S. my card wasn't going to work and I didn't have any canadian dollars on me. Luckily they were really nice and easy going and broke my U.S. $100 bill for me. Sweet. Definite bonus for understanding and being flexible so I didn't have to starve."}
