{"text":"It's a lovely place to stop for a salad and sandwich or even just for a slice of cake and coffee.  Very European, good service and quality baked goods.  Kind of reminds me of Vienna."}
{"text":"This place, is by far, the best European bakery in the city of Toronto. I would honestly compared to some of the best bakeries and I've been to in southern Germany Austria and France. They have a excellent selection of pastries, and fine cakes.  They really have no comparison when it comes to pastries and cakes.  Esterhazy tortes, ischeler tortes, Hungarian style sachet cake! I met with the owner who once trained in St. Moritz at the famous Hanselman bakery. Truly world class desserts."}
{"text":"Quiet little café looks really awesome it also has a lot of really great suites to try the location is different, but they've created a great atmosphere! Definitely worth checking out!  Great looking patio"}
{"text":"While this place is known for its cake and pastries, their ham quiche was the best quiche I have ever eaten. It was soft, moist and extremely smooth. I would come back again and again just to eat quiche."}
{"text":"Today, we drove 50 km from Pickering to Etobicoke to visit this Pastry shop and it was really worth it. The shop is not in a fancy or luxurious neighbourhood but the decor is elegant , clean , simple and the ambience is bustling. You can find European cakes, Viennese cakes and other fine pastries here . They have been in the business since 1974 and we had the chance to see the second generation owners Gordie (son) and his wife ( Angie). They are very nice, kind and sweet couple. The ingredient of the food and pastries we tried were fresh and of good quality. Their top sellers are the cranberry apple squares, German cheese squares, Strawberry Romanoff. They also have a nice cafe that you can sit and enjoy their coffee and delicious foods. If you buy six and more pastries you don't pay Tax. This coming valentine's day, treat your loved one to a sweet date and visit this place and as Angie will say 'have a sweet day\"."}
{"text":"I was here for lunch and found it quite good. It's in the middle of a really run-down industrial area which is a little weird given that the atmosphere of the restaurant once inside is that of a quaint European Bistro. But once inside it's really cheerful and the dessert case is really a sight to behold.  For lunch they mostly seem to do soups, salads and sandwiches. I had what was called a burek which was phyllo pastry filled with cheese and spinach. So the place is good for a light lunch. Now after the light lunch I indulged in what else but a piece of one of their many delicious-looking cakes, along with a cappuccino.  You can get a little out of control here given the amount of dessert options that they have all staring back at you from their glass case. I forget which cake I had but it was of the rolled variation and it was absolutely scrumptious.   If you are in the area and craving some dessert, I highly recommend this place."}
{"text":"I always pass by this place going home from Kipling, but today I stopped by.  I'm so happy I did.  I had a slice of their torte (cake) for $5 and it was the most amazing slice of dessert I've ever had.  So much better than $7 slices at the cafes downtown."}
{"text":"After I saw the ad for this shop I decided to try it. It sure wasn't worth the drive to Etobicoke. I don't know if the waitresses were having a bad day BUT no one was friendly. I felt like it was a chore to serve me. She dropped off my cake and coffee and left. When I went to pay I wasn't asked how I enjoyed it or if everything was to my satisfaction. She took the money and gave me my change without a word exchanged. I won't be going back that's for sure!!!"}
{"text":"I fall in love with the look of the pastries and cakes!!!  I don't consider myself like a girly-girl. But I did like the look of those shinny and fancy chandeliers; and the feeling of being hanging out in a place in where Marie Antoinette could appear...  There is a terrace, and the street is not busy, so is ideal for chilling while enjoying some delicious snack.  The ladies working there are polite and helpful. I really recommend to pass by."}
{"text":"I've been going to the sweet gallery for years I'm just sad that the location on Bloor street west has been closed. Walking into the cafe greeted by the rich aroma of European cakes, pastries and coffee never lost it's appeal. There's nothing else like it in the city!"}
{"text":"Lovely pastries, and a nice place for lunch, but a bit pricey."}
{"text":"I'm sitting here drooling, just thinking about this place.  When living in Etobicoke, this was a hop skip and jump away...it's a wonder I wasn't 600lbs!   This is the main store, and it is a wonderful place to pick up a little something out of the ordinary.  They will do phone orders  - which I recommend if purchasing whole cakes.  In the fall they do a to-die-for chestnut roll.  A large one will feed 10-12 people, or a seriously deprived sweet aholic like me!  Go out of your way and try this place - real European bakers, not the sickly sweet stuff you get at the grocery store.....real ingredients.  Their tart cherry strudel is wonderful and crispy as well as their Lemon rolls.  Tender sponge cake filled with a delicious light lemon filling   YUM!    I dare you to get a better Sacher Torte, or Dobos Torte .     ENJOY AND WIDEN OUT!"}
{"text":"I heard this bakery serves authentic European cakes so I popped in just to check it out since my colleague's birthday is coming up.    They were a few people in there eating but it was really, really quiet.  They had beautiful cookies, pastries, cakes, etc. but prices were not marked.  I felt like the lady behind the counter was pushing me to make a decision so I just ended up ordering a Burek (spinach and cheese filled pastry) to go for $4.15.  She warmed it up for me and I ate it when I got back to the office.   It was really, really flakey with lots of filling but I thought it needed a bit of salt.  The pic I posted doesn't do it justice as it weighed a ton; I couldn't finish it.  I'm definitely going back to pick up cookies when it's my turn to bring treats into work!"}
{"text":"I received a box of cookies from this bakery as a thank you gift and they are amaaaazing! Filled with different types of jam and dusted with powdered sugar, these cookies are just soooo good and addictive. Made with butter, they just melt in your mouth; just be careful not to make a mess as you enjoy them!"}
{"text":"Great place in the great of an unassuming area. Walked in and it was like stepping into a nice European cafe. Delicious food, friendly staff."}
{"text":"Wonderful decor inside very traditional European luncheon spot.  Food is more geared for Hungarian, for the goulash which is pretty good, served with crispy crust French baguette..  Sandwiches are more what you find in These places, crab salade, egg on crossai nt, chicken schittez,"}
{"text":"The desserts here are spectacular, everything looks good and taste good! Very Authentic!"}
