{"text":"Great \"biker bar\". Smaller--but that's good. Cool folks.. pool table, jukebox (with great tunes, thanks to Bruce). You'll usually see at least 4-5 Harley's out front. I ride my Blackbird there and haven't gotten into a fight yet so it's not too crazy. The food is pretty decent, considering. Cheap beer. It's no Hyde Park but is a great place to go when you've been on the bike or just want to have a burger & beer. Well if you're on the bike then just a burger."}
{"text":"Have been to the Dougout twice now. Both times, consistently good, inexpensive food and a small town atmosphere. I was skeptical at first, but it's a nice little local watering hole with friendly service and something for everyone. I will definitely go back."}
{"text":"Worst service I have ever experienced.  We walked in having a good time because we just got done cleaning and were ready for some drinks and she wouldn't serve us because she claimed we were drunk.  We hadn't even had a drink yet.  She was so rude and started cussing at us. I have been bartending and managing for years, and couldn't believe how she was acting.  I will never be back even though it is around the corner, and I will continue to tell everyone I know not to go.  Don't waste your time it's a pathetic excuse for a local watering hole."}
{"text":"Excruciatingly slow kitchen.  Got there at 6:30 to order a pizza which is their Tues night special. They said they could not put the order in for 30 minutes because the dough had to rise, and then at least another 30 min for the order.  So we ordered off the regular menu, burgers, kids grilled cheese and a wrap.  7:40 rolled around and they said it would still be a while because the kitchen got slammed.  What?  There was nothing coming out of the kitchen?"}
{"text":"The Dougout is a great corner bar. It's a dive bar, be sure about that. The drinks are cheap, the food is decent (their pizza is much better than decent), and the servers are friendly.  I think it's difficult to enjoy your time here if you are worried about what other people are doing or what other people are thinking about what you are doing. I have had a great night here countless times, and I wouldn't say that I am the typical demographic.   If you are looking to be in a place where others care and think more (or less) about you based on your beer choice, jukebox picks, or profession keep on driving.  This is a place where all kinds of people are welcome, the servers learn and remember your name, and it doesn't matter if you put makeup on or not."}
{"text":"It is what it is! Cheap drinks...cheap/great wings on Sundays...plenty of couples enjoying a cold beer and something to eat on a scenic road. Roadside bar atmospher.  If that is what you like...9 of 10!  If not...or loaded with aditude...please go somewhere else!"}
{"text":"Always love this place! Great pizza on Tuesdays and never miss the great wing deals on Sunday. It's a little small but its an older bar so don't expect fine dining. Just a great place to grab some food and a beer."}
{"text":"For the record:  I have been to this hole hundreds of times.  Never again.  How many ways is it possible to despise a bar, or in this case a bar that pretends to be a restaurant, in that they serve \"food?\"  Let me count the ways:  Filth.  Noise.  Odors.  Creepiness.  Clientele.  I really should write my congressperson re: shock parole.  Service.  Just what DOES it take to attain a .30 blood alcohol content, Mr. Bartender?  And how do you sleep at night?  That is the first of many layers of decrepitude.  Do I really need to scrape away more?  Really?  \"The truth is incontrovertible, malice may attack it, ignorance may deride it, but in the end; there it is.\" -Winston Churchill"}
{"text":"Not very happy with the way i was told about the special for Sunday wings. I called and asked what the special was for wings. I was told 3.99 a dozen, which is a great deal. The only thing is that they failed to mention that's for dine in only, so my take out order came to 18.50 when i picked up my order. Wings are good but communications need improved."}
{"text":"Lunch!  They have a lunch steak special so stay tuned!   Guuuh...Steak chewey but what do expect for 6 bucks... OMG the bathroom...I won't go into details but imagine the funk of a college bar mens room... One bright spot...The server/bartender- she handled the lunch crowd pretty well with no help... We were there longer than necessary but considering how many tables she had plus the sitters at the bar.... She was really quite good  Believe it or don't I will go back to try their wings some sunday.... Wish me luck!!!"}
{"text":"Nice little hideaway in the center of historic Richfield. They have the best specials! Sunday: $1.99 for a dozen jumbo wings! Monday: $4 Burger special Tuesday: $7.99 Large 2 topping pizza's Wednesday: $6-7 Steak special And more!  the place is classic.  Has a pool table. Friendly service. AND YUENGLING! Yes, I said it.  The only bar in Ohio that I have found Yuengling at!  It went great with my ham and pineapple pizza!"}
{"text":"Finally went after many said to check it out for Sunday wings and not too shabby!    Local dive and good people.  Plus it was pre game of the NBA Finals game 7!  Seem to have good deals all week, I just live to far away to enjoy.  But my post CVNP bike ride stop now!  Check it out!"}
{"text":"I've been to the bathroom in some bad spots before but that bathroom is by far the most disgusting one I have ever been in. They should provide goggles so no one gets pink eye as soon as they walk into it."}
{"text":"This Bar may not be much from the outside but the location is great. The food is very good and the atmosphere is very entertaining. I believe this bar to be kind of a biker bar minus the fights and such. Is a great place to sit at the bar and have a good conversation with a local that you have never met"}
{"text":"Although the wait and bar staff were so nice, this bar leaves a lot to be desired. They were out of so many items on their menu and the good quality is not that good.   The space is odd and interesting and it is definitely a more dive-y bar. Go for a drink or two, skip the food."}
{"text":"My favorite place to have a drink.  It's defiantly got a townie only feel but I've been going there forever so that's what I love about it. Food is good, people are fun and prices are great. Bathrooms have been updated and i don't think it's smelly anymore."}
{"text":"The Doug Out is the kind of place Hunter S. Thompson might go looking for a gang bang and a cheap steak.   I don't have anything personal against motorcycles, apart from the fact that they're constantly rolling down Rte. 303 to-and-from the Doug Out, past my house. It's a leather-clad asshole parade down my street every weekend in summer in Richfield.,..the price of living somewhere that qualifies as \"scenic\" by Ohio standards. Sure.....somewhere deep beneath my layers of education, domestication, and gentrification, I might acknowledge that motorcycles are pretty cool, but I still prefer to exchange hard looks with the grizzled bikers and their disturbingly masculine women from my fuel-efficient foreign car every time I drive past the Doug Out.  So hence, I've been boycotting this place ever since moving to Richfield six years ago. My boycott was part indignation, part fear. And yet, there is one thing that will motivate me to overcome these fears and petty objections.....karaoke!  I learned that the Doug Out offers karaoke (that noblest of art forms) on Friday nights, so I walked through the snowstorm last night to have my moment with the mic, and put an end to my boycott. I am a terror when it comes to karaoke. Let me introduce you to my set list from last night:  Devo - Whip It Red Hot Chili Peppers - Give it Away ( you need an extra pair of lips) Robert Palmer - Addicted to Love Prince - When Doves Cry Doobie Brothers - What A Fool Believes  Warren Zevon - Werewolves of London (as performed by Scooby Doo)  (all sung with both gusto AND irony.)  I know, I know...an awesome selection of tunes, right?   In conclusion, the Doug Out is not so scary, and maybe even fun. Sure, some people threw shit at me from across the bar, but that is to be expected when you're publicly mocking a revered vocal talent like Michael McDonald. The good thing is, I'm 6'7\" , 230 LBS, and perfectly capable of defending myself. And plus there was some other guy at the bar with immaculate grooming habits and a pricey-looking argyle cashmir sweater, so I figured he would be the first victim if any violence erupted from the mongrels lurking in the bar-room shadows, allowing me sufficient time to retreat to my Toyota and get the hell out of there."}
{"text":"I am not sure why the Dougout gets such poor marks with people-- I can only assume that most people only review a business when they are unhappy with it.   We live in town, and though we don't \"hang out\" here, or any other bar for that matter-- we have gone with lots of friends on many different occasions-- sometimes we use it as a meeting spot before a concert, and sometimes we go to karaoke because some of our friends like to sing. There is a mixed group of husbands and wives, and a few single friends, and no one is ever uncomfortable. We also are not youngsters-- maybe that makes a difference.   The food is decent and cheap here---and we have NEVER had to wait a long time for it. Drinks are reasonable and the bartenders pretty good. Also, the customers are all pretty chill--- yes, some of them ride motorcycles, so what?"}
{"text":"It is what it is.....nothing more.....nothing less.  Used to frequent the place 30 years ago and yet nothing has changed.  Kind of a dump but the food was good as was the service.  Burger was good."}
{"text":"Great pizza, good service and comfortable atmosphere but don't play music they don't like or they'll cancel your songs......."}
