{"text":"Having lived in a predominantly Hispanic neighborhood in New York, the thing I miss most after moving back home is a good, crispy, flaky empanada! Alas, after visiting the Empanada Company, my quest continues.  We went there on a Sunday evening. It's a tiny little place with limited outdoor seating...maybe 4 tables. We got 4 empanadas - chorizo, green apple and bacon, lobster and braised beef. The chorizo was bland and lacked seasoning; our least favourite one. The rest were ok...more like a pizza pocket than an empanada. The dough was pretty inconsistent. Very thick and doughy on some and thin and crispy on others. As far as satisfying my empanada craving...these didn't. I welcome any good empanada spot recommendations!"}
{"text":"Ordered the avocado fries which were really good, six different empanadas along with the Nutella Banana Smores empanada which is to die for!! Yes, you do wait quite a while for it and there is limited seating. Overall, a pretty good experience."}
{"text":"Great service , supper yummy food - can't go wrong. my favs are avocado fries  & chicken curry Empanada !"}
{"text":"Just finished trying my first sampling of their empanadas. I had the braised beef short rib, seafood, chicken and their curry coconut chicken empanada along with their avocado fries.   It was defiantly a hit and a miss. Like other yelpers, I was stoked to try this place out and it met my expectations. The braised beef short rib was bomb! Super moist and just falls apart. I will most definitely be coming back to purchase more of these.  The seafood on the other hand was a disappointment. For the price, I obviously wasn't expecting anything too extravagant but it tasted awfully like instant noodles that have those pink imitation crab pieces. You know... the little florescent pink flowers floating in your noodles. Correct me if Im wrong but I thought I actually saw one in there. It wasn't dreadful but wasn't my cup of tea.   The chicken and curry coconut chicken was also very delightful and a must try! The avocado fries were delicious but a little bit too salty for me. It had a little kick to it as well, that just sneaks up on you!   All in all, it was a very delightful experience. They had a hilarious slogan: \"Put them in your mouth\", and I really do encourage you all to put them in your mouths because you'll keep going back for more!"}
{"text":"When I lived in the west end of Toronto, I'd go in every couple of months to get my empanada fix. Now that I live on the other side of town, The Empanada Company is a destination that I plan west end outings around.   Tasty, filling and a crowd pleaser, empanadas are my favourite hand food. I prefer them baked instead of fried. The Chilean Chicken is a fave at our house but all the fillings are good. I buy a mixed dozen and freeze whatever we don't eat immediately. They also sell mini empanadas that would be awesome for parties and picnics. Warm or cold, their empanadas are wonderful and I just adore the pastry cut-outs that indicate the different fillings.  This is definitely a take out place, with only 3-4 seats in the front window for eat in. They also do delivery within their area.   Tip: call ahead with your order and it will be ready by the time you get there - less than 15 minutes!"}
{"text":"Simple and delicious. Service was great as well as was the food. The empanadas are quite big to be honest and extremely flavorful. The menu is simple so you won't be confused at all. Enjoy!"}
{"text":"Love love love this place, we buy empanadas from here often. The chicken Tamales are delicious too! Hubby says the chicken and chilean beef empanadas are authentic. I personally go for the leek and proscuitto! The mini empanadas are great for parties... we bring them along and they are always a hit.   Keep doing what u do guys! Its great!!"}
{"text":"Came here for the Chilean empanadas. Tried the Chilean beef, the pulled pork, and the cheese empanadas.   The Chilean beef empanada used cuts of beef instead of ground beef - my girlfriend was the first to point out this is not how it's done in Chile, so I wouldn't say these are \"Chilean\" empanadas, just beef empanadas. there were also pieces of beef fat in it which made my first bite into them kind of off-putting. They really need to use some quality ground beef and put a bit more beef into it.   The chorizo was quite literally cuts of cooked sausage in there... I was expecting the ground pork from a chorizo in there, not slivers of pre-formed sausage. The rest of it was not that memorable.   The cheese empanada was actually stuffed with a lot of cheese - which I loved. The only thing wrong was the texture of the cheese - this wasn't the right cheese to use - it had the grainy texture of Emmental or havarati or some other hard cheese rather than a velvet smooth cheese or a melting cheese.   I spent about $24 for 6 empanadas but it's only for the novelty of empanadas. The counter is small and the place doesn't have an indoor counter, only an outdoor patio which is not viable in the winter. This place seems to be a sister location of the burger joint next door.   My thought on it: meh. Nothing great or outta-this-world. I can think of much better ways to spend my $24 in Etobicoke."}
{"text":"Don't feel like cooking and want dinner quick?   The Empanada Company  Tasty choices.  We enjoy the pulled pork, beef or chicken. The cheese is too cheesy for us.  Usually we call in our order and pick it up. Mostly because the place is small.   I won't give them five stars because their sauces are over priced compared to how much you spend on the empanadas. The chimichurri is quite good."}
{"text":"I gotta update this review cause the last few times I've been here getting my order is such a hassle. The food is good but the service is very slow. They'll tell you the order will be five minutes or so but it's always much longer.  That's when they don't forget to prepare your order all together."}
{"text":"This place is nice. I've been there twice. The first time I was a little bit disappointed with their big empanadas as found them a little bit dry however went back and bought the small ones and we were WOWed by them.   Highly recommend the small sizes!"}
{"text":"The only empanada place I know of in Toronto. Not only that though, but the quality of the food is beyond delicious. Try the specials, try the dips, but most importantly, eat in and note the attention paid to presentation. All around a great experience. Will be returning many times."}
{"text":"Delicious. I can't attest to the authenticity (because I don't know) but I can say that they were really really tasty. I had the Chilean beef, chicken coconut curry and braised short rib (special, not sure how long it will be around).   They were all awesome, the coconut curry was AMAZING, Chilean beef awesome and braised short rib was really good. My partner had the Philly cheese steak which was also great!   Small place but great decor, clean and nice patio (too late now but oh well). We got them for takeout and they were awesome when we got them home 15-20 minutes later, they really held their crispiness and heat very well.   Great dips on the side and what I felt were really good prices, you could get a combo of two empanadas (which are a really good size) with a dip/drink for $5.50."}
{"text":"The Empanada Company has great reviews, which is why I was excited to try it out. Unfortunately, it was pretty disappointing. I had the bacon, smoked gouda, and green apple empanada (fried) - I could taste the apple in that one so it was the better one but I couldn't really taste the bacon. I also had the cajun pulled pork empanada (baked) which was incredibly bland for something that is supposed to have jalapeños AND habanero BBQ sauce in it. I was glad I got their spicy chimichurri sauce so I could add some flavour to it but I'm surprised it's even advertised as spicy - it was more a strong garlic flavour than anything. I might try this place again for the avocado fries because people say those are really good; maybe one of the traditional empanadas are better. I'm in no hurry to go back. If you like food that is advertised as spicy to actually be spicy and bold flavours, I wouldn't recommend The Empanada Company."}
{"text":"We went in tonight to try this place. Waited at the counter for a couple of minutes. We could hear some commotion in the background, suspecting prep work. We called out to let someone know that customers had come in and no one responded. I guess that the vents and other kitchen noise was too loud. However, after another couple of minutes, a guy came to the front and put something in the fridge. He acknowledged us and said hi and then walked away to the back. We decided to give it another couple of minutes and a girl came to the front and put something in the fridge. She looked at us and said nothing, walked away. We stood there in shock for a minute (yes, we timed) and just called out that we were leaving (maybe some naive faith that someone was really going to try to serve us). Will definitely NOT be returning to this place. No customer service and they have lost potential customers forever."}
{"text":"Yum! Lots of options & varieties.  Next time, I don't think I need a dip.  What's great is that they have reheating instructions and they still taste great the next day!"}
{"text":"I finally made it to The Empanada Company!!! The first time that we went, it was closed. We didn't know that they are closed on Mondays. So take note. I bought 1 dozen fried empanaditas which consists of 6 braised short ribs 5 stars; 3 creamy spinach 4 stars and 3 smoked chorizo 2 stars .  Plus an order if avocado fries with artichoke dip 2 stars, which was alright to me. I loved the empanaditas and will surely come back to try the other assortment. I will definitely come back for more especially buy the empanada size. The place is small and only had a few tables but it was buzzling. Will I recommend this place? Yes! Oh one more, the man who seved me was helpful and friendly!"}
{"text":"Best Empanadas in the city ! Will be making frequents trips here all summer"}
{"text":"Tried this place for the first time and we were pretty happy!  It is definitely a take out only joint. We purchased 5 empanadas, 3 of which were the basic offerings (cheese, chicken & beef), and two were the fancier ones (bacon/apple, and pulled pork). The total came to $22.  The portions were quite generous - essentially they are the side of an adult's hand. The meat filled empanadas were very full. The only feedback I have is that it was hard to tell which one was which. We basically had to guess through cutting them open, but you could have a worse problem :)  I would definitely recommend checking this place out."}
{"text":"This is the FIRST TIME EVERRRRRR I have been impressed with non-Filipino empanadas! Even my NYC experience wasn't impressive!   The taste of the dough and it's texture was perfection. YOU MUST GET the braised beef short rib! The beef was very flavorable and ridiculously delicious! My only complaint about their selection is the traditional meat empanadas have raisins (EWWW) so we didn't bother with any of those. On the plus, they sell mini empanadas by the dozen which means I will be the most popular person at the next get-together I'm attending!  P.S. two more words for you, AVOCADO FRIES!"}
{"text":"The guys at work decided on empanadas for lunch a few weeks ago.  I had a curry coconut chicken empanada (= sautéed chicken, caramelized onions, curry-coconut sauce- on curry pastry) and it was quite good. Additionally, I had the chance to try a Philly Cheese Steak empanada (= seared steak, sautéed mushroom, onion and green peppers, provolone cheese sauce) and I found this one very yummy a well. We also got a dozen of chicken empanaditas, however I found those a tad try.   A big hit were their 3 dips: Artichoke & asiago (my favorite!), spinach & chipotle and salsa.  The prices are reasonable. Empanadas are between $2.25 and $2.75. A dozen chicken empanaditas cost $6.99. And a dip is $1.19.  We called our order in and then went to pick it up, but apparently they also do delivery on orders over $100."}
{"text":"After sampling nearly every empanada on the menu I can say there's not a bad choice available, but their appetizers and desserts shouldn't be passed up either! The avocado fries are a necessary part of any order and the churros too it off for dessert."}
{"text":"As I was walking  along Lake Shore, I noticed the flyers for this company.  I was curious to see where it was and out of the corner of my eye, I saw it on a quiet street a few meters from Lake Shore.  It is a small take-out shop that specializes in empanadas.  It is nice and new from a recent renovation, but apparently they have been there forever.  I had the Smoke Chorizo empanada, which is full of meaty flavour and spices.  The flavourful filling is enclosed in a tasty and non-greasy dough.  You have the option of having it baked or fried.  The fun part about this shop is that they have a dozen empanaditas (smaller versions) for $6.99 and you get to try all the flavours.  Each one is shaped in a cunning way to differentiate one flavour from another.  They are flavourful and fun to serve and eat especially with a nice Chilean wine.  This is a great place to go for an inexpensive but Old World treat or appetizer.  The service is quick and they are very pleasant and accomodating.  I will visit again when the weather is warmer and get a few empanaditas for a little picnic."}
{"text":"Try the chilean beef!! This place is great for a quick meal or order lots for a party.  Great food and friendly service."}
{"text":"If you frequent Woody's Burgers you may know of the little place right behind if you've ever had to park on 40th or nearby when the angled parking on Lakeshore is full.  This place is basically a counter where your order and can possibly eat your treat inside or if you prefer more room you can go to the deck right outside and have it there.  The Empanada Company has quite the range of flavors and ingredients which basically make it so they have something for everybody.  Like bacon or chorizo or something traditional?  The menu has what's traditional and what are more diverse choices for Empanadas.  What's that?  You ordered 4 different kinds and you don't know which is which?  Look on the Empanada itself.  I had one with chorizo and it was \"marked\" with a spade so you can tell which is which.  Others have other symbols on them so you can tell.  I sort of wish the Pie Commission did something like that because taking home frozen pies and not knowing which is which is sort of a bummer.  My Empanada was ordered with about 3 minutes to close on a Friday.  It was served steaming hot with a flaky crust and a nice taste.  For about 4 bucks it's not exactly good bang for the buck but they do have Empanaditas (mini) that you can order by the dozen for about a buck each or so.  Also on the menu they have chicken tamales and churros. Overall I like Empanadas as a snack but if you're hungry this place won't fill you really unless you have at least 2.  Still they well constructed, not overly crusty and taste great.  All around this little place has a lot to offer if you're taking it out or taking to go.  They recently had a Groupon offer as well which looks interesting."}
{"text":"This is my absolute favourite empanada place! I've pretty much tried everything. From empanaditas to tamales, churros and empanada dessert! I love them all.   I've been coming here for years. The place is really small and it has limited seating place a bench and stools inside and a tiny patio out in the front.   The only thing I will complain about is that it does take a bit of time to get your food - that's why I give it 4 stars. So if you want your food right away I would suggest calling before hand and placing your order."}
{"text":"After spending some time in Argentina at the end of last year, I've been desperate to track down quality empanadas. I discovered this spot after a quick trip to Woody's and finally ventured out there on a Saturday.   I'm not a fan of black olives so unfortunately the traditional styled ones weren't overly appealing and there's no modifications so I went with a pulled park, the braised rib, tamales and churros. Pulled pork was definitely my fav, the tamale was really tasty and the churros were amazing!   There's 3 small tables on their tiny patio and a small table inside -- take out is best for this spot.   Also, they are open on Sunday, despite what it reads on Yelp but closed on Mondays."}
{"text":"Amazing empanadas, especially the Buffalo wing one is to die for! Great for a cheap quick meal!!"}
{"text":"This is a cute little place tucked in at Lake Shore Blvd W & Browns Line (behind Woody's Burgers). I ordered the veggie & goat cheese empanaditas and chicken empanaditas for a party, and everyone at the party loved them! The veggie and goat cheese ones were amazing and definitely went the quickest, but the guests also really enjoyed the chicken ones!  I will definitely go back and try other empanadas/items on the menu :)."}
{"text":"Delicious! The three sauces are all great though I love the green spicy one the most.   I had the mini-empanadas assorted selection and they were ALL delicious - had to guess what some of the fillings were but all good. Tasty pastry. They give you great instructions on how to reheat or cook at home."}
{"text":"Great mini empanadas for parties. So good with dips. They are always a hit, just make sure you get the deep fried ones. You can reheat them at home . I am not a fan of any of their baked empanadas but that pretty much applies to all baked empanadas I've had elsewhere , dough is always too thick and hard. Tamales and churros are good will eventually try more of their menu."}
{"text":"The Empanada Company  Combo 1. ($4.99) 2 Empanadas, 1 Dip or 1 Drink  Traditional or Contemporary         Baked or Deep-Fried          Eat-in or Take-out              Dip or Drink  Sweet and Spicy Beef Empanada - Pan seared Beef, Sugar snap Peas, Broccoli, Water Chestnut, Red Pepper, Baby Corn, Sweet and Spicy Sauce  Curry Coconut Chicken Empanada - Sautéed Chicken, Caramelized Onions, Curry-Coconut Sauce    3.5 *Star*  Freshly Made Salsa(Daily) - Chimichurri  My only complain on the fresh tasting Chimichurri.... GARLIC me!  My only complain on the flavourful Empanadas.... SPICE me!  MIA  -  Pico de Gallo (mild), Med Green Tomatillo, Hot Salsa I can see why they might not provide these sauces. I'm just too use to having HOT Salsa available table-side."}
{"text":"Omg avocado fried ....... Do I need to say anything else. I found this place on Yelp and decided to try it based on the good reviews. It did not disappoint.   The place is a bit small and not on the main road. There's not much seating inside just a bench table along the front wall with stools. They have a large selection of different empanadas to chose from.   I ordered a regular empanada (beef rib) and the avocado fries. The empanada was a bit doughy but taste okay. The avocado fries were the star; they were crispy on the outside and soft on the inside. They taste even better with there artichoke dip!   The order was made fresh and took about 7 minutes to wait for.  The front server was super friendly and very helpful with the menu. He also gave me a free dip to try! Definitely will be coming back for more fries."}
{"text":"Discovering avocado fries here a couple years ago was a bit of heaven. It was a special item of limited availability at the time, but great to see it on the regular menu.  Fried empanadas always taste better than the baked ones. Shortrib and seafood are my favorites choices. Great presentation when eating at the location, but really limited seating.  Most recent visit was a bit disappointing, where the staffer was less than polite, the avocado fries really salty and we ended up eating on the curb outside since we were asked to vacate their patio before we even got our food since they were closing soon."}
{"text":"LOOOOVE IT!!! Decently priced, delicious, lots of different options, fun to eat too! Wish they had better hours/stayed open later....friendly staff. Great addition to the neighbourhood!"}
{"text":"decent...okay.. not as enticing, enjoyable as i considered it might be. was kind of slow, food was average; uneventful. i cycle past it a lot, don't have any urge to return after initial visit; try woody's (attached to it), way better!"}
{"text":"I've been to this location before because of it's empanadas and liked it but recently I visited and the love was not there. Unfortunately the beef empanada flavour is not their anymore anf the seafood empanadas were very dry compared to the ones I had before. Also asked for half a dozen of them and paid almost $25.00 for six tiny empanadas, not a good value for the buck. Regularly oven made Beef empanadas are not this small.  You would expect at least something dicent for $3.75 plus tax. I don't think I will visit again, so said."}
{"text":"This is a really cute little place on Fortieth Street just south of Lake Shore.  I actually don't know a lot about empanadas but I'm told by our neighbours that it's authentic.  We usually get the Chilean Beef Empanadas and they are outstanding!  They are not stingy on the fillings and the meat has so much flavor, like it's been slow cooked.  Love the dipping sauces too.  Super friendly staff that know their stuff and are willing to accommodate.  All the empanadas are made fresh to order so there's a bit of a wait but so worth it.  If you're not from the area, there is street parking on Fortieth or any of the little side streets."}
{"text":"I would go back for the rooted veggie empanada. It had an amazing flavor. Also they bake their empanadas so they are not greasy and you can eat a few large ones."}
{"text":"Just tried their Queso Fresco Tamale: \"Pockets of corn dough stuffed with queso fresco, roma tomatoes, corn & baby spinach. Served with Chimichurri sauce. This dish screams fresh flavour and their chimichurri sauce is the best I've ever tasted, now I'm craving it again! This dish is vegan and Gluten Free , the only vegan option on the menu but I think I'll be back and order it again and again, it was so satisfying!  I hope one day they'll make vegan empanadas, would love to try them."}
{"text":"Delicious empanadas, but the shinning star of the place is the avacado fries.  I don't know how they do it but they are delicious.    We had the curry, braised beef, and buffalo wing empanadas, all every good."}
{"text":"Ok.  Just read my last update and you will know why I am being harsh.  Was there 25 minutes ago, and once again no tamales.  That was the last time I try."}
{"text":"Good empanadas... I don't know many empanada places so I can't compare.  But, there's are very tasty... avacado fries are good too.   More of a snack place than lunch / dinner though."}
{"text":"Yet another spot that I revisited since it was still cold out, but I'm only now writing a review for.  The Empanada Co. is located right 'round the corner from Fair Grounds/Woody's Burgers.  So if you feel like a snack or light meal pre/post coffee &/or burger...you may have a tapeworm!  Anyway, I noticed that they got rid of their \"combos\" since my last visit.  They no longer have 2 Empanadas + dip/drink for $4.99.  :(  Now most of their empanadas, depending on their filling, are in the $2.75-$3 range, with the lobster one at $3.75.  You only get a \"deal\" if you buy like 3+.  They also added tamales for $4.75, but I wonder how big those are??    Empanadas come either baked/fried and they're slightly smaller than a beef patty.  I guess they're cooked beforehand 'cause when I asked for my Smoked Chorizo empanada baked, guy behind counter said it was only available fried.  Friend ordered Pulled Pork.  Although both empanadas tasted fresh, we both agreed that they were a bit bland.  Lacked SOMETHING along the lines of spice or other seasonings.  Bonus for hypertensive/obese peeps tho'!  Pastry is more or less tasteless.  Minus stars for removing the combo deals.  I understand slight increase of prices, but it irks me when restaurants take away deals completely...at least deals that make sense.  I am not buying another empanada just to get $0.75 off!"}
{"text":"I'm hooked....! Great flavours, great variety! Love the lobster empanada...and the short rib, smoked chorizo, and queso fresco minis are amazing....all 3 sauces too!   Go. Try them. You will be back."}
{"text":"This review is really for the churros only, which are very tasty. The place is very small though, and I'm guessing it is a bit better if there are seats outside when it is warm out. So we waited outside while our churros were made fresh.  Will definitely return for empanadas, but great to stop for dessert!"}
{"text":"Great value , quality and variety. A refreshing alternative to the pizza burger chicken franchises. Lobster as a $3.99 special, braised short rib in a reduction of merlot and avocado fries. Take out was performing well. The counter is a bit tight. The chirros with a caramel dip makes for a     Perfect finishing treat. Try it for something better than different!"}
{"text":"I went for the first time ever. I'll be honest, the hype got me too excited. The food was decent with lots of different flavors. You can get most empenadas baked or fried. The fried ones tasted better if you're on a diet go for the baked.   The place is tiny. 3 bar stools I think. It was cold so no patio yet.   I would go again but I'm in no hurry."}
{"text":"The empanadas aren't cheap, $3.50 each  but they are delicious. The buffalo chicken wing and coconut curry were the best out of the 4 we tried. We also tried the mini combo empanadas which were a little too much dough for me. Definitely get the avocado fries. They are so well made, crispy on the outside and soft on the inside. They also reheated really well. However the empanadas were a little dry when reheating. I like the option you can request them baked which made me feel less guilty."}
{"text":"Good authentic flavors. We had a number of empanadas (braised beef, curry, gouda bacon Apple, and buffalo wing) empanadas and all of them were fantastic! The real show stopper was the avocado fries which were light flavorful and everything you think they are....we WILL be back!"}
{"text":"If youre trying to be healthy, but looooove fries - you should visit Empanada Company.  Their AVOCADO FRIES ($6.75) ARE TO DIE FOR!!!! They make this fresh to order. They do have variety of dips to choose from - i.e. chipotle, and chimichurri dip (which I definitely recommend)   And if you wanted to try their empanadas, you shouldnt miss out on the empanada that has BASIL, PROSCIUTTO & MOZZARELLA !!!!!!   All of these together with PHILIPPINE MANGO JUICE in can ($1.50 each), and you got a perfect afternoon snack!!!   Their located 2mins away from Marie Curtis Park so you could enjoy eating your empanada there too!!!!"}
{"text":"So I absolutely looove this place. The empanadas are so delicious and full of flavor. They do not skimp on the filling which is great. My favorite would be the seafood, lobster and vegetable and goat cheese.  All the flavor is pack on the filling the pastry seems to be more \"healthier\", not much salt or butter. You do have the option on most to choose baked or fried. You can also get dip with it, they have two options for dip. My personal fav is the spinach one which is more orange in color, it has a bit of spice/kick to it. They aren't as filling as i would have hoped , so you end up having to buy a few to feel satisfied. Which ends up being quite pricey, i ordered 4 and costing me about 20$. If you think about it thaats quite steep for a few empanadas.  The restaurant itself is quite small. Just 4 bar stools and about 3 tables outside on the patio. i'll definitely be back as the food is great but not on a regular basis"}
{"text":"beware of garlic breath and prolong bouts of gas. these empanadas are packed with amazing flavours. loved the chicken and beef but seafood not so much. they have combo deals where you can try the different types along with your choice of dips to go with it. The place is tiny with only small window size looking into the kitchen area. its also where they take your order. the service was friendly and knowledgable. street parking can be tough but should be able to find a spot on the side streets. a must try when your in the lakeshore and kipling area."}
{"text":"I was just thinking about this place , cuz it's been so long since I had the empanadas here.  We ordered 6 different types of empanadas and all 6 were amazing.  They have different types to choose from and I think there were only 2 that we didn't try.  Got to go back and try them."}
{"text":"This is one of those times I don't care how authentic these empanadas were, all I have to say is the empanadas from The Empanada Company were just so tasty!!!   Choices if you want traditional: Chicken, Seafood, Cheese and Chilean Beef or if you want to have something with a twist: Curry Coconut Chicken, Grilled Veggie/Goat Cheese, Sweet and Spicy Beef or even Philly Cheese Steak or Pulled Pork?!   Baked or Fried??/Dips on the Side?   I left all these choices for my Yelp Friend while I just relaxing on the patio...daydreaming..... I want one of those houses down by Lake Ontario... 2 cute fat little empanadas just appeared in front of me!   Sweet & Spicy Beef and Curry Coconut Chicken both really tasty!! Baked or Fried whatever but the fillings were so tasty! Freshly made and pipping hot!! especially the beef, I still could not get over that it has sugar snap peas, water chestnut, baby corn and broccoli inside!! They are just like little pocket of goodness and wholesomeness!!   Hey!! But where is my Churros?? someone didn't get me Churros? How can that happen!! I felt so incomplete without my dessert........... now I have to come back for more!!"}
{"text":"This little gem us awesome!  Tiny place with a   Pretty great menu of empanads , empaniditas, sauces and churros!!  Price is very affordable and the dollar menu was crazy..lamb emoanadas for ,$1???  I wish I bought more!!"}
{"text":"Wonderful little spot in the Long Branch area. We found it through an article on Blog.To and didn't even realize it's steps away from where we live. We swear by their take out menu ever since and take any opportunity to share these chilean wonders wherever we go. Our favourite are chilean beef, lobster and curry chicken empanadas/empanaditas.  And...avocado fries are a must do accompaniment! Trust me - you will salivate just at the sight of these!"}
{"text":"This place rocks. Service was quick and super friendly, the front desk guy was great. He answered all our questions and seemed to be very patient. The empanadas were great even though my favorite ended up being the regular beef. Cheap and tasty. Parking and location isn't the bes but still great to go and check out!"}
{"text":"I had walked past the Empanada Company and was curious- I hadn't had any empanadas since going to Chile years ago!  I ordered the braised beef short rib, and coconut curry chicken empanadas as well as a side of avocado fries.  All were delicious and perfectly seasoned!  The baked empanadas were especially delicious.  I am looking forward to trying the rest of the menu!  My only complaints about this place are that it is a bit small- not a lot of room to wait/eat, and it can take awhile to get your food (best to order in advance).  Parking cam also be challenging due to the restaurant's proximity to woody's!"}
{"text":"I am halfway torn on writing this review because I don't want the rest of the GTA to discover how amazing this restaurant this is and have them raise their prices... but as soon as we finished our meal, my fiancé and I both agreed this review had to be written!  For $15 downtown, you can maybe buy a personal size Neapolitan pizza at Queen Margherita and leave unsatisfied. Not so with the Empanada Company. Appetizer, two entrees for myself and a guy with a large appetite, and dessert came to $30.  And they didn't scrimp whatsoever on the food. We finished very happy and thinking we had got amazing value for our spend.  The appetizer was one of the best things I have ever had. Crispy, ever-so-slightly spicy and salty, creamy, warm avocado fries. I just can't. It made me want to buy a deep frier, something that has never crossed my mind before. It made me want to melt into a bed of Empanada Company avocado fries and never wake up. I now know how I want to leave this world. A quicksand of avocado fries.  Next up was the classic empanada - a crusty, traditional corn empanada blanketing a bed of monterey jack, cheddar, mozzarella, and jalapeño. It kept coming. It was literally like a geyser of cheese. I didn't want it to end.  But it did, and then came the chorizo empanada. Here, I think the resto could increase their price slightly and offer a larger amount of traditional chorizo, rather than sliced - but the effort was apparent in this yukon gold mash that was steeped in spices and flavour.   My fiance got the classic chilean beef empanada and indulged me with a bite. It made me wish I had not ventured into \"contemporary\" category and played it safe with those guys in the traditional section. Empanada Company hits a home run on these. Buy them all.   Then he got the gouda and bacon empanada. The bacon taste was even better than you'd expect in its new empanada home and Empanada Co. melded it perfectly with the gouda. He has a huge appetite and when we got the smallish delivery order we were concerned it wouldn't cut it. Our fears were quickly abated. By his second empanada we were actually stuffed. The cushiony memory foam mattress avocado fries and their deep fried crusty exteriors probably helped that along somewhat.  Of course we had to squeeze in room for the airy, just-sweet-enough churros that were lightly, delicately studded with the perfect amount of cinnamon sugar, and dipped in homemade, thick, rich, dulce de leche. We had THREE each. All for $30.  I am in heaven. I want to eat at this restaurant every weekend for the rest of my life. I am not particularly prone to hyperbole so please take this review as exactly what it is - a completely honest, disinterested and unbiased review of an amazing establishment that is a total find.  Standing ovation for The Empanada Company!! Thank you for being you! This is now one of my favourite go-tos in Toronto."}
{"text":"The Empanada's here are superb!....and oh the avocado fries, it is a must try.  Although the location isn't to appealing and there is only street parking, this company really specializes in what they do best.....Empanada's!  There menu is full of unique gourmet stuffing's for their thick and crispy pastries which you can get either fried or baked.  We ordered the buffalo chicken (tangy) and lobster (fresh tasting) empanada's fried with the fries and our order only took 8 minutes.  As for seating...there is only a side bench along the window since the size of the place is rather small but there is a patio for the summer time.  I would recommend going for take out here since there is no alcohol served here and their is nothing really to see when on the patio.  The avocado fries are well breaded, soft on the inside and have unique dipping sauces.  This place is a must try and the avocado fries was a delightful surprise."}
