{"text":"Was shopping at VF Outlet at Power Square. It was lunchtime, so I decided to take a chance on the little deli there. Was very pleasantly surprised that the sandwich they made was fantastic! A simple chicken on marble rye an it was very satisfying. And there were many desserts that looked great, but I had to pass today."}
{"text":"Ate there for the first time today, and boy was I pleased!

I got the Cairo sandwich and it was absolutely delectable. They take about 10-15 minutes to make it, but it's 100% worth the wait! 

The flavors were perfect, the texture was good, and the fries were just right. 

I will be back, no doubt about it!"}
{"text":"Love this place, they have the best sandwiches around. Definitely recommend the Cairo, delicious every time."}
{"text":"Great croissant sandwiches! Great value for  the price! It was the perfect stop after church even though they weren't open exactly at 11, it was a good time to shop for a few things. The sandwiches were made to order and served with a wedge of watermelon, which was a nice touch."}
{"text":"I found this little place on Yelp today and what an awesome lunch. They are in the little mall. I had the chicken avocado croissant and my date had the Burger, both were outstanding. We will be back. Oh by the way, the fudge is delicious."}
{"text":"Had the yummiest ice cream sundae ever! Lots of toppings... Marshmallow was my favorite! Was so glad they were here!"}
{"text":"I came to this place due to yelp reviews. I was disappointed by the place, and I do want to forewarn you that this place is more of a food stand rather than a restaurant. This place is located in the VF Factory Outlet. They sell food and have some seating space at their counter. It's almost a cart but larger than a cart. They have a back area where the cooking is done.

The service was extremely slow. As far as I could tell, there was one person cooking AND taking the orders, although I'm not privy to the staff in the back. Regardless, it took about 20-30 minutes to get our food once we ordered. They serve omelettes, burgers, usual foods and pricing is comparable to food at restaurant. The food itself was pretty decent good given the whole feeling of this place. I ordered an omelette, and its perfect shape made it pretty obvious they used a special pan or cooking item to cook my omelette.

Based on previous yelp reviews, I was expecting a nice place to eat. This whole experience felt a little cheap and honestly, this place was less than impressive. I would recommend trying it if you were already here shopping. If you're 10 miles away, like myself, I wouldn't recommend a special trip to come here."}
{"text":"Wonderful sandwiches and sweets.  My personal favorite is the Cairo Sandwich.  They have a special where you get a 1/2 sandwich, chips, and a drink for a little over $7.00.  The sandwich is very filling and this is well worth the price.  They have several other sandwich specials as well.  Just be warned that the Cairo is very messy so you'll need lots of napkins.  The 2 people who are usually behind the counter are great.  Sometimes they get backed up but it's worth the wait.  

This is located inside Power Square Mall on the corner of Power and Baseline.  It is located right next to the Vanity Fair Outlet."}
