{"text":"went there 3 weeks ago with wife, mother in law and toddler -  despite the restaurant being 3/4 empty, dinner took almost 50 minutes to arrive from the time ordered.  When it did, potatoes and veggies were cold and the promised juicy pork chop was dry.   When we complained, the manager removed one of the entrees (this is the reason it is not getting a one star -- at least they tried to compensate). 
Can't understand why a dinner would take so long in a 3/4 empty restaurant.
Nice looking place and comfy as well, but will think twice about going back."}
{"text":"New restaurant that I just stopped by today! The beer and wine selection was good, and everything we had tasted amazing. Service was very friendly, and the decor was relaxed and modern. Definitely a non-formal dining spot that I would recommend to anyone in Toronto! Check it out."}
{"text":"Horrible. Simply horrible. The Steak Frites was inedible and the wine list anemic at best. What was once a charming and delightful culinary experience has been reduced to that of a sub-standard road house. Do not waste your time or money on this place. Massive disappointment."}
{"text":"So sorry but I'm just not impressed.  There really isn't much on the menu. I spent a lot of time trying to figure out what to order.  There needs to be a little more choice when it comes to appetizers.  I had the chicken drums and was almost inedible.  Soups were adequate.  Everything needs to be seasoned.  Very disappointed. I also expected  more on the wine list.  I know it might be growing pains so I'll try it again in a few months and re-review it.   Hopefully they will have a new menu."}
{"text":"Very nice decor and very helpful staff. The menu was very standard, nothing special. Considering the name I was expecting a huge wine list, there were maybe 10-12 options in red and white , at least 4-5 domestic Pellar estates type stuff nothing really that special.

Considering the decor, location, and very helpful staff, the right chef could really set this place apart. The menu was very lacklustre hence the 3/5. I really hope once they get over the startup cost hump they will start adding some more imaginative and flavourful food and wines to their menu. The best part of the dinner was the desert, everything else was pretty boring. I may try it again in  a month or so.

Waitstaff and decor were the two most enjoyable parts of this restaurant."}
{"text":"My family and I decided to try out this new upcoming restaurant at the start of the week and we were quite astounded. I had the Steak Frite which was perfectly seasoned and grilled to perfection, the fries were golden, crispy and to die for. My wife had the fish and chips which I managed to steal a bite from when she wasn't looking and it was one of the best bites of fish and chips I've had in a while. My kids had the Chorizo burger and the Pie of the day and they ate them to quick for me to try but I would take that as they were as delicious as the rest of our meals. The service was excellent they weren't slow nor were they around us to often is was a perfect balance and our drinks were never empty. My wife and I plan on coming back soon with all of our friends to show them the amazing experience we had because everyone should be graced by this amazing place. I highly recommend this restaurant to everyone who reads this review as well as bad reviews do not do this place justice nor are they accurate in my families opinion."}
{"text":"After a pleasant experience last time we returned for Saturday brunch with 3 friends. 
Instead of ordering wine like we did last time, we took advantage of the $5 Ceasars - with what I believe is Steak Spice rim & our friends enjoyed the $5 Mimosas. Three of us ordered the Gourmet Grilled Cheese- today's was cheddar with bacon jam on the most amazing bread. Half salad, half fresh cut fries were the perfect accompaniment. 
Hubby opted for the Chorizo burger and one friend chose the Blackstone Benny with chorizo sausage. 
All meals were delicious. Perfectly sized portions and excellent presentation. 
Service, again was excellent! 
We will definitely return and take advantage of special drink prices, including $5 corkage Wednesday nights where you can bring your own wine."}
{"text":"Wasn't bad, but wasn't great either.  For what we paid, I was expecting something pretty great.  Pepper sauce on steak was off somehow - burnt maybe?  Ribs were fine, but the sauce tasted like something out of a bottle.  Fish and chips were ok.  Went on a very quiet night and somehow service was still very slow.  Waiter was sort of awkward and didn't seem to notice when we wanted to order, when we were done, time to pay. etc.  Might go back someday to see if it's any better."}
{"text":"I have tried this restaurant a few times and have enjoyed everything I have had - from the appetizing mahi mahi bites to the steak frites and have tried all three of their burgers! Everything has so much flavour! Comfort food with a little twist! 

The staff was lovely and both the inside and upstairs outdoor patio have great seating options! 

Great spot for a date, a family gathering with the kids or a quick stop in for a drink! 

Love this place!"}
