{"text":"My kale salad ($7) was delicious. The dressing was fantastic.  However, I did not enjoy the tacos. Lack of flavour and something was off with the tortillas."}
{"text":"Where do I begin.  Having to enjoy trying new places, I decided to take my friend to The H.H.  We entered, seated ourselves ... (not that we we instructed to do otherwise) and realized o.k. we order off the blackboard menu above the cash area.   We decide on the surf n' turf, which is I believe 2 thin sliced... and I do mean THIN sliced pieces of steak with 2 grilled shrimp in it, pesto with some mesclun greens on a chewy type ciabatta-like bun. (bun ratio to filling...too much bread).  Also could 've worked better if the bun was toasted, because the greens simply caused the extra sogginess within the sandwich. The hot sauce didn't work for me, just tasted the heat & not much of other flavours.  As a side, it came with fresh cut fries, nice thickness, BUT soaked in oil (note what I have always said about getting the fries right in my previous reviews), a few pieces were uncooked in the centre...complain? why bother, when they were having enough trouble controlling the large cloud of smoke coming from the kitchen, which also meant we weren't getting our shrimp corn dogs that they said would be ready in a 1/2 hour, (which we waited for), apparently the hood vent went down.  Everyone had to get a refund on this.  The owner?/chef was very apologetic though. The second item we tried was the Cali Baja, they were done nicely, light & crispy nugget- like fish pieces in a tortilla.  Enough said about t he food. Just a few tips to the owner/s...four men working the kitchen back there, NOT one with a hairnet or a hat, and when my server happens to have blue hair AND blue nail polish with the large earplug, the staff should really consider taking that food handlers course.  Thank-You. Secondly, why is it that restaurants always tend to run out of their \"best sellers\"?, i.e the shrimp corn bread.  \"HELLO\"!, it's gonna be your money maker, possibly  your most memorable dish, the talk about the town... get it out there!... keep patrons happy, make money ... Will I ever return to try those shrimp corn dogs? ...maybe when I end up in the neighbourhood on an errand run. Good Luck to them though, I hope they are able to sort out those so-called \"kinks\"."}
{"text":"Well priced, yummy and they have coke in a glass bottle, which makes everything better.  Fish and chips are great and so are the tacos."}
{"text":"This place was ok but I was really hoping it would be a great take out place near us. Unfortunately it didn't quite live up.   The shrimp corndog was the highlight. It was delicious and the sauce it came with, a kind of mustard dill tartar?, was great.   The tacos were ok, nothing too exciting. Our fish tacos (the grouper and the baja) tacos were a little fishy tasting and the shrimp taco was a little bland. Given so many delicious taco options in the city these seemed like they weren't quite up to par. Nothing really wrong with them but nothing very special either.   The most disappointing was the oyster slider. A few people commented on loving it so we ordered it. It was good size but didn't taste like much. I wouldn't order it again."}
{"text":"Really cute place with amazing atmosphere. Had the gumbo, a shrimp taco, the nacho-fries thing... It was all exquisite. Oh. And the best part - lobster poppers with spicy tartar. I hope they never take them off the menu. The service was swell, and it was decently priced for what we consumed. Mmmmm."}
{"text":"If you did an internet search for \"The Happy Hooker\", you might get some pretty risqué search returns. But don't worry, this seafood-centric establishment is more than family friendly. They are Ocean Wise certified, and serve up a small menu of affordable tacos, seafood sandwiches, and sides.  Notable orders:  Shrimp Po'boy - Lightly battered shrimp, and a nice chewy bun. The sandwich is loaded with habeneros, giving it a prominent spice not for spice intolerant. We had lots of these sandwiches left at the end of the night, and they tasted just as good the next day!  Lobster Roll - Dare I say this is the best lobster roll in Toronto? It's definitely up there. A fluffy, buttery, brioche bun, jam packed with a generous heaping of chunky lobster. I am literally drooling just typing this. Run, don't walk.  Baja Fries - crispy russet potatoes, cheddar cheese, adobo chiptole sauce, lime crema, onion, cilantro, and housemade guacamole. Enough said.  They also have daily specials and promitions, like $2 fish sandwiches and buck-a-shuck oyster nights."}
{"text":"Love this place - the shrimp po'boy is the best I've ever had - hands down, and the Baja fries were awesome!   Watch out for the awesome deals - seriously$2 fish and chips if you're quick and $1 oysters, there's always something during the week - follow them on twitter to get ahead of the deals.   Only negative is it's pretty tight in there and serious shortage on seating. If you order to go you have to squeeze yourself standing in a corner somewhere and likely wait 20 mins."}
{"text":"I read many reviews about this place before visiting and while I'd like to say that I'm extremely satisfied, I'm not.  This place was average.  The fish tacos, like the Grouper, Cali Baja and Shrimp tacos are each decently priced, YES! BUTTTTT the adobe sauce, lime creme, cabbage and slaw that come on top, overpower the taco.  You can't pick up the taco and chow down everything in a bite.    The fish is grilled but soft, not grilled with a hard exterior and juicy interior.  Overall, I'd give this place a 3/5. Would I go back? Maybe because the prices are affordable but not for taste."}
{"text":"We have been to the happy hooker for a couple 2-3 times now and the first couple of times were decent, but this last time was totally disappointing and I'm not sure if we will be back.  Had ordered pick up and they said the order would be ready after 10 mins.  Walked over after 15 mins - still not ready and had to wait 10 more minutes, and the place was empty.  Also they had said the order would be a certain price on the phone, but they were wrong so I was short $2 as they only take cash.  Pretty annoying, but they made it seem like they were doing me a favour.  Well it turns out they decided to only give us 1 shrimp corn dog instead of the 2 I had ordered, which was pretty much the only reason we would even want to go back to them.  The brutal thing was that in the end they basically over charged me because they decided to short the order.  Truly a great example of \"awesome\" customer service.  As much as I love supporting businesses in my neighbourhood - honestly can't say I will be back given this last disappointing experience."}
{"text":"Went there with the wife to check out what the hype was all about, and was VERY disapointed. The tacos were all bland (we ordered 3 of them but forgot which ones), the baja fries was tasteless and a bit soggy (costco fries was MUCH better for a fraction of the price), and the pho-boy shrimp was just ok.  For the money that we spent (a little over $30), we definitely expected something much better then just a bland and below average quality food. To add insult to injury, we waited around 15 minutes for the food (and there was only 3 other patrons at the time).  The only thing that I kinda liked was the ambiance of the restaurant, it was very classy and hip, but that's about it, nothing else.   In closing, we would definitely not coming back to this establishment. Would go to Seven Lives Tacos or Banh Mi Boys whenever we crave for some good tacos."}
{"text":"Before I start, a caveat: the owner did not seem to be around, so I wonder if some disenfranchised staff just didn't care about their service/food.   We had 3 shrimp tacos, a grouper taco and a fried oyster slider. First, the portions are SMALL. For 3.50/shrimp taco, I was not impressed. Not only are these corn tortillas which are small to begin with, but they were actually not the standard size (around 6 inches in diameter). They were smaller, with about a 3.5 inch diameter.  The toppings (slaw, hot sauce) were underwhelming. Overall, the shrimp tacos were in need of more flavour. On the grouper taco, the fish was good, but again, all things considered, pretty bland. The fried oyster slider was the worst of the bunch, with oysters that tasted like they were straight from a can.  Finally - the service was competent, but quite unfriendly. We did not once get a smile from the person at the service counter. I wonder if this would have been different had an owner been present."}
{"text":"Lured by the signboard advertising a shrimp corn dog, I went in for a quick bite.  Decor is fishing shack chic.  Grouper taco was delish, nicely buttery beneath a crispy crust with a dollop of mayo.  Top it off with their homemade chipotle sauce, and a splash of lime, as they suggest.    There was something wrong with their deep fryer, so a bit of a wait for the corn dogs, but they comped me a free one with a coupon for the next time, and on a Saturday afternoon I wasn't in a hurry.  When it arrived, it was decent.    I'll definitely go back, as it's a nice place for a tasty bite.  So I guess they landed me."}
{"text":"I have always walked passed the happy hooker, but I'm glad I dropped in for lunch. I had one of their sandwiches, I think it was called black fish. It came in a toasted bun with ailoli sauce. It was delicious! The fish wasn't deep fried, it was broil and also moist.  The dish came with a small side of coleslaw. I like that it was crisp and not too tarte.  I recommend dropping by this place on a Tuesday for their Tuesday taco specials"}
{"text":"Love that this spot specialized in fish tacos and another plus that they're ocean wise certified. Their fish tacos are super delicious (especially the grouper taco - breaded & deepfried atlantic pollock  w/ Cheddar cheese, lime crema, pineapple habanero salsa, pickled red cabbage, onion, cilantro) at only $3.50!  Compare that to other restauranst offering their versions of tacos at a dollar or two more than that.  Another favourite was their shrimp po-boy with some kick from the pickled habaneros. Super delicious nonetheless.  Definitely a must visit in the queen west neighbourhood!"}
{"text":"Extra information:  * Specials throughout the week * Lobster roll over weekends * Buck a shuck oyster * Serves alcohol * Open for lunch and dinner  I love seafood, there is no doubt about it. After all, I am originally from Westcoast! However, there are only so much salmon sashimi and fresh oysters I can eat. If only seafood was cheap in Toronto...I'd eat it everyday, with my steak of course. A lot of the times I find seafood restaurants a little too pricey for me to be visiting as often as I would like to. So guess how excited I was to read about Stella's post about Happy Hooker that offers fresh seafood at such a affordable price! I was sold on the spot and Happy Hooker climbed up my never-ending 'go to restaurant' list.  Few weeks before this media event, I actually dropped by to pick up one of their Double fish fillet burger that was offered for a $1. It was amazing, and the special price didn't hurt either- so I was super excited to go back and try other items off of their menu.  Kale salad: Organic kale, baby arugula, watermelon radishes, cucumber, pickled cabbage with house made red wine vinaigrette. Even before I took a bite from this salad, I just loved all the vibrant colors in it. All the vegetables were crunchy and pickled cabbage added extra texture and flavor to the salad. House made red wine vinaigrette complimented the salad but didn't over power all the healthy goodness.  Baja fries: Crispy russet potatoes, cheddar cheese, adobo chipotle sauce, lime crema, onion, cilantro topped with house made guacamole. I thought this dish would be nice to order as a side to share among 2 or more people. These reminded me of healthier version of New York Fries 'The Works' with all the toppings on top.   Shrimp Po Boy: Cornmeal breaded shrimp, lemon aioli, baby arugula, sliced tomato, pickled habaneros, kosher pickles all wrapped up in butter toasted portuguese bun. This was something I really wanted to try and it did live up to my expectations. Because shrimps are breaded with cornmeal, it gives a crunchy texture that works well with all the fixings. I found pickled habaneros to be really spicy so ended up picking some out..don't way I didn't warn you.  Cali Baja Taco: Breaded and fried alaskan pollock, melted cheddar cheese, shredded romaine lettuce, diced tomato, lime crema topped with house made guacamole  Grouper Taco: Beer battered grouper, melted cheddar cheese, pineapple habanero salsa, lime crema, pickled red cabbage, onion and cilantro  Shrimp Taco: Grilled shrimp seasoned with cumin salt, adobo chipotle sauce, lime crema, pickled green cabbage and habanero pico di gallo.   Lobster roll: East coast lobster, mayo, celery, celery salt in butter toasted top slice bun. Do I dare and tell you guys I had a change of heart and found my new favorite lobster roll at Happy Hooker? These were SO.DAMN.GOOD I want one right this second as I think about it. Filled with so much lobster meat (you can def find chunks of lobster in there) with just the right amount of mayo and celery, I was in love with a first bite. This is a must try if you check out Happy Hooker.  Summary: I had high hopes for Happy Hooker and they didn't disappoint. I knew when I first tried their Double Fish Filet burger, that they don't joke around with food. Happy Hooker takes pride in serving Ocean Wise certified seafood in the best way possible for affordable price and you can't go wrong with that. I will def go back to Happy Hooker and trust me, you don't want to miss out on their food."}
{"text":"This place seems to have shut down, yet the sign in the window says they're reopening in the new year. Slightly irritating because they were good.    Update: they're open again and all is right with the world. Fish sandwiches are more delicious than ever."}
{"text":"Delicious fish sandwiches and tacos. Worth a visit. Actually, worth repeat visits. Very fresh, lean and tasty fare."}
{"text":"I am a huge seafood fan and recently moved one block away from this place. Unfortunately, I've given it two chances and probably won't be returning now. My wife and I each ordered two tacos. I think these tacos may have been made for people from gulliver's travels. For a fairly expensive price, we finished each taco in 2 bites. We were both starving. The second time i went, we had sandwiches with over-buttered white bread. The service was also not very friendly. We will be taking our business elsewhere..."}
{"text":"Nice to see a Fish n Chips shop on the Dundas west strip and a great addition to having Chippy's down on Queen St. I bolted out of bed and went down for their FB discount event - $2 fish and chips Friday, yay! Driving by this small shop I hadn't noticed it before, but now I know they have $4 beers and interesting soft drinks for just $1.50. With a rustic wood interior and a hint of diner mentality, the small layout can pack in many people when it's busy with shared table space and plenty of stools so you're not forced to stand. Cool that they deliver too. Service was pleasant and prompt and the fish was perfect! Lightly battered, not too greasy with the best tartar sauce I've ever had. Fish n Chips all the way!"}
{"text":"Good to the ears: decent hip hop.   Good to taste buds and nose: simple, fresh, flavorful.   Good to the eyes: fun decor, setup, food presentation.  Good to the wallet: lots of specials depending on day, very reasonably priced.   Good to the psyche and heart: pretty cool vibe, but also neighbourhood/family-friendly feel which means it's not annoyingly cool or anything.  Seemingly paradoxical proverbial verdict: Off the hook and I'm hooked.  Bonus: Watch my favorite sandwich cam boy, Jesse checking out the pacific cod sandwich ($9) many moons ago - https://www.youtube.com/watch?v=4M19Qyj_-Hs"}
{"text":"I was pleasantly surprised by the food here.  We were trying to get into Saving Grace, which was packed. I'm glad we came here instead.   You buy the food at the counter and then go sit down.   We ordered mahi mahi and shrimp taco along with the basa fries. The tacos were tasty and delicious. The proteins were cooked nicely. The shrimp had a lot of flavour and was nicely spiced. I enjoyed the tang of the lime and the freshness of the guacamole. The cabbage made the taco seem light and gave a nice crunch to the taco. The tacos are small enough that you can order different ones to try.   I highly recommend getting the Basa fries. They come with sour cream, tomato, and guacamole. They are well priced at $5. Even the small Basa fries portion is pretty big. The sauce they had on the fries adds another depth of flavour.   I liked the decor. There are a lot of wooden elements. The are some fishes on the walls, which works well with the theme of the restaurant. The exposed piping and chandelier also creates a modern industrial feel. I thought the \"outhouse\" sign for the washroom was cute.     I liked the food and our experience here. I'll be back try out their other menu items."}
{"text":"Honestly one of the best seafood joints around!   Had - lobster roll (weekends only apparently) & surf and turf sandwich.  Lobster roll seems simple, but the attention they put into it pays off. Don't know why it is so good but hey, that's why you'll keep coming back.  The Surf and Turf rocked my world!"}
{"text":"Stop 5 on #AdasFoodCrawl  I think $3.50 for a small little taco is a little much. Although very good, its no something I'd go back for. We got a sharing platter of 8 tacos and split them. At least we got to try a bit of each, but they were super tiny.   There is seating in the restaurant, but seems like there could be more and the space was wasted a little. We were lucky to have grabbed the communal table.   Careful, the shrimp taco already has hot sauce on it."}
{"text":"Craving Tacos? Like delectable, fresh, fish tacos? Well, that really isn't a problem in Toronto. There are plenty of taco joints to choose from and many are notable. I personally value variety and choice for a taco place, it shows craftsmanship and style. I appreciate that, I appreciate creativity. The Happy Hooker does it right, and I'll be going back for another catch! (Too much? I thought so).  It's a small but hip little joint that sports the common natural wood decor and is fisherman's wharf/dock-esque. Makes sense. The menu is simple, everything is fish or seafood influenced. You have the classic fish and chips (9.50) and sandwiches, tacos (3.50), and deep fried oreos (3.00). All categories with your choice of fish and slight price difference respectively. I suggest three or four tacos.  I tried the oyster slider, the Baja Cali taco and the Mahi Tuna Taco.   I hesitated on the oyster because I though it would be small and dinky, mostly bun and lacking flavor, however I was pleasantly surprised. The oyster was large, peaking out the sides of the bun, coated lightly to a crisp and flavorful while being juicy at the same time. The tacos were good, tasty but small. The Baja was fried fish nuggets while the Mahi was grilled. Both good, once again small, with good flavor and texture.   Overall, I liked eating at the Happy Hooker. The wait time isn't bad, the food is fresh, the atmosphere is encompassing and comfortable, and it's really affordable. Last touch, the pop is in bottles, that's pretty cool."}
{"text":"I was really excited to try this place after reading some of the great reviews, but after eating there on Saturday, I would never go back.  There was music blasting on a speaker when we were there and after asking the server to turn it down, she grudgingly did so but the music was still at a blaring level.  I was willing to forgive the rudeness of the server because I was sure the food would be good, but it turned out to be very mediocre.  We ordered two cod sandwiches and while they had a pleasant taste, they were really thin and had maybe 2 ounces of cod.  The hot sauce had heat but not much flavour.  The corn/shrimp dogs had a chalky texture, were laden with salt and really had a very bland taste.  The 3 sauces that came with it were about the size of a quarter and I guess you were to imagine they were very special because of the size, but they were very ordinary tasting.  The only thing I really liked was the coleslaw, but for $28 we were really wishing we had gone a bit farther and landed in Kensington Market."}
{"text":"Amazing sea food. Fish and chips were not as amazing.  The lobster roll was absolutely amazing and the slice of pickle is juicy. Lobster rolls offered Friday to Sunday only :( Service is very friendly and prompt. It was 2 pm though.  The Shrimp Po Boy was heart stopping.  Quite small space though.  I will definitely do it again."}
{"text":"You can't serve gourmet sized portions when your food is sub-par. There's a lesson to be learned here: either serve excellent food, or give people massive portions for the price. This place does neither... this is the kind of local business that really doesn't deserve to survive. If you're into fish, this place ain't for you. If you really like bread or vinegar, this might be your speed. At almost 20 bucks for lunch, with this grade of food, you might as well walk to mcdonalds and get a fillet-o-fish combo... At least it will fill you up."}
{"text":"I like the tacos!  Also the fish and chips are great.  Mahi Mahi!    I would definitely recommend this place to friends and will return.  I have been here 3 times now but for takeout only.    Get the hot sauce with your tacos."}
{"text":"Amused by the name and victim to my weakness for seafood, I tried the Happy Hooker a few weeks ago. We knew they didn't take reservations so we showed up around 6ish, just before the dinner rush. We were seated very promptly as there was space at a communal table. The space is VERY tiny so it filled up quick. I also noticed that many people come for takeout. The line got to be so long at one point that it went out the door!   The waitress who served us was new and had very little knowledge of the drinks or exactly what was on the menu but she had a good attitude, a big smile and always went back to ask if she didn't know the answer to something.  Now onto the most important part... the grub. It was OKAY. We got the baja fries, which were good but had very little toppings. The top layer was slathered nicely with sauce but then they piled the fries so that once you ate passed the top part, there was very little sauce for the remaining ones. We had to ask for ketchup. Then we got the tuna burger - which was on special that day. That was definitely one of the highlights of the meal. It was canned tuna that was breaded and then deep fried and served burger style. The tuna was seasoned well and was delicious. Next we got the shrimp po'boy and lobster roll. Both were good but not amazing, and not good enough for me to go back for. Overall, it was a good meal but we were left wanting more.   There's a green p very closeby across the street and lots of street parking."}
{"text":"Ok. Aside from the fact they ran out of shrimp. Ran out of soda and basically everything we wanted to order- it was good.   Nothing to rave about. Just good."}
{"text":"This can honestly be my go to spot on Thursdays and Fridays.  They have buck a shuck on these days and I think we polished off a good 35 oysters haha  The place is small but feels like home.  They have daily specials for drinks/food and top notch service.  Highly recommend going early to get the lobster roll and Mahi Mahi taco.  My favourite is the Black Cat sandwich paired up with the Baja fries.  They use TAB here so if you have it use it and if not get on it #paywithtab  Let's just say for 3 people we split: 3 tacos, 2 sandwiches, Baja fries, 35 oysters, 8 beers and 2 shots of jameson for $52 each including tip....heard me right."}
{"text":"My partner and I dined at Happy Hooker last night (Feb 28 2014). The ambiance was unexpectedly dark and rustic with loud music playing, but not so loud that it prohibited conversation. In short, the place has a bar vibe that isn't unpleasant. They have a decent drink selection for such a small restaurant but I wished they were all $1-2 cheaper. We ordered a cod fish 'n chips and a cod sandwich. The fish 'n chips were perfectly cooked, with a thin, crispy and flaky batter. The fries were tasty, with a nice seasoning. The sandwich came on a very fresh roll. The fish was slightly over done. The sandwich came with a very tasty, vinegar coleslaw. The only disappointment was with the tartar sauce which had no tang. Our entrees and 3 beers came to $45 with tax and tip. Overall it was a pleasant experience but a little pricey."}
{"text":"First, being a new business I imagine is very hard and many things to sort out. This place is no stranger sorting them kinks out. I'll get to that.  However, the service was splendid, very courteous, respectful and not pretentious one bit. You walk in and it's bright in a boathouse kinda way, wood boards as panels on the walls, an arcade game near the door, some fish paraphenelia on the walls. And an ancient registrar on the counter that is not used, instead an iPad mini is used to take your order.  The Oyster Slider for $4 is worth it, it taste very nice with just enough Oyster flavor that doesn't make it too fishy. And just a bit of their custom hot sauce adds a little kick.  The shrimp corn dog, 2 for $6, another worthy eat. It's mashed shrimp beneath a not so thick layer of corn bread on a stick. It comes on top of three dollops of sauce: wasabi, cocktail and what tasted like a mayo. I really liked the wasabi flavor as I like that kick, but the cocktail was nice too.  The tacos, three kinds: shrimp, grouper and baja fish. I'd say my favorite of the bunch was the shrimp as it has a nice smokey flavor that you can taste right away. It's suggested with a squeeze of lemon and two drops of the hot sauce. The grouper, another nice one as you can taste the ncie fish but the baja style, I'd say lags a little left to be desired. At $3.50 a taco, i felt a bit expensive though.  They could use a few more drinks as they have a small selection.  As for this hot sauce, appears to be for sale and really has nice kick and flavor. So yes, they are new and sorting out the kinks. But they were nice to admit they have some problems which I respect, as many restaurants wouldn't even admin their faults. They were so nice they offered patrons their money back for an unacceptable wait time and still gave them their food. Plus it sounds like they ran out of food. So good on you for doing that nice gesture and I'l give you an extra star for it!"}
{"text":"Service was good,food was not. the fish tacos had a foul sulphuric taste. they were covered in guacamole,presumably to cover up that awful taste.  I have had authentic fish tacos in San Diego, and the sloppy messes that we were served are nothing like the fresh and simple fish tacos from southern California. I can not recommend this place."}
{"text":"Yet another disappointment. I messaged what seemed to be the owner that said he'd take care of us if ever wanting to return. No reply at all! Not worth going somewhere where they themselves don't seem to care about their customers or food. I would give ZERO stars if I could."}
{"text":"I have been so excited to come to Happy Hooker - all the great reviews, the mouth watering photos, I had to experience it for myself first hand...  Finally I was in the west end and I set my mind to make it over there for dinner after a business meeting. When I first walked into the restaurant, the space was larger than I expected and there are waitresses who serve you. I honestly thought that it was more of a take out counter with seats for you to sit and eat.  The service was great and the two ladies always made sure to check on us, making sure our experience was a good one.  It ordered the cocktail special - a tequila sour and it did not disappoint. Shaken nicely with a nice garnish to finish it off, you could taste a good kick of tequila combined with the ample amount of tartness in every sip. I could have drank at least two more!  It was also buck a shuck on Wednesday so I ordered a few oysters which came with an awesome portion of spicy horseradish.. Just what I needed! I was very excited to try the Baja Fish taco, having read some great reviews about it. Unfortunately, I was saddened because it wasn't what I thought it was. I am only realizing this as I write my review, by the way. What I had imagined was a large piece of battered fish ejecting our of each side of the taco shell. Instead, I had several pieces of lightly battered fish pieces. After reviewing the photos, I now know that I should have ordered the grouper taco instead. I had set my expectations a little to high, nonetheless, the Cali Baja was still flaky and loaded with flavour. Sasha ordered a shrimp and mahi mahi taco that was loaded with punch and spice.   We also shared a small Baja fries to share, which was a great portion for its price. Loaded with toppings - cheese, sour cream, salsa, onions, the works, every fry was packed with deliciousness. I pretty ate much most of the fries and did not want to share with Sasha.  All in all a very tasty dinner and I cannot wait to go back to try the Grouper and Lobster Rolls.  Thanks for the smiles ladies :)"}
{"text":"Really enjoyed their shrimp burger special for burger week. Friendly staff and nice seating space. Not too busy today considering the special, but it was raining. Will come back and try their other food items next time."}
{"text":"Food and drink disappointing.   Both beers on tap taste and look exactly the same.   Waitress up sales on order.   Baja fries......nachos w fries....guacamole bad   Ordered all tacos...all frozen fish and seafood...smelled bad....flavor so bad..   Please don't waste your money....go y To grand electric for fish tacos!   Are bad."}
{"text":"One of those places you really wish there was a 3.5 star ranking...  But! Food leans me towards 4. We had the baja fries and the toppings were generous and deliciously gluttonous in the best way. Oysters were served on ice with lemon and horseradish to taste, as per usual. Lobster roll and Shrimp Po' Boy were both very, very good and fresh. We will definitely be back to sample more of the menu and try the specials. Wait staff and decor were both fun and accommodating!   Couple things lean me more towards 3. Music as Too Loud (I'm a senior citizen apparently), but mostly the beer menu. VERY SMALL selection. There's a hoppy local brew and Creemore Springs... maybe a couple more but nothing spectacular. Could stand to see a few more options but I'll round up."}
{"text":"Had dinner here with my dad because he read about their fish & chips on-line. Early 90's rap blaring, arms with heaps of tats, toques that sit on one's head, skinny jeans. If it wasn't so dark, I would have taken a photo of my father eating his dinner among the sea of Hipsters. The cool kids that we were sharing a table with must have been wondering who this old man was !   There are some places to eat, but seating here is quite limited. It gets super crowded so prepare to wait for a solid 20 minutes - it was so cold that I was going to leave if we had to wait a minute more. Service was excellent - it was packed, but staff came around often to see if anyone needed water, cutlery, napkins, etc. The menu isn't too large, but there's something for everyone. I'm not a huge fan of fish and chips so I opted for the Shrimp Po Boy. It was super tasty (and really spicy as well... be prepared, get yourself a bottle of water). I also had the Baja Fries - a house special, fries with the works like lime, guacamole, salsa, cheese. It was a great combination of ingredients.  Good for: fish and chips, fried fish"}
{"text":"Came for the $2 Friday fish and chips deal, was able to get seats. The fries and fish batter were good but the fish itself was mushy and very thin. I'm sure the regular menu items would have been better. Service was friendly, but seats are limited"}
{"text":"I was very happy with the customer service.  I probably gonna go back again."}
{"text":"Happy hooker, what a catchy restaurant name.  It's also a great kick to ask the cab to take you to \"The Happy Hooker\" and he gets confused that it's a strip joint.  I know, I'm childish.  My friends and I went on a taco hunt recently and The Happy Hooker was one of the places that we hitted up as part of our taco run.  It's a great stop on a taco run as the service is very fast and the vibe is very casual.  It was an in and out stop for us and we were happy for that!  The tacos were delicious, the fish was fresh and it wasn't too heavy.  The tacos were a nice 2-bite size (3 bites for me) with lots of flavour and depth.  I would recommend the happy hooker any day!  I also think that it could be a nice place to grab a quick bite before heading somewhere else.  I only wished that it was closer to where I lived, then I can be happy eating tacos more often!"}
{"text":"The soup is excellent here. I've had both the mushroom and the clam chowder. I've been a couple of times when they were out of the clam chowder, which is a disappointment. Both highly recommended.   The service is usually friendly, if a little slow. I agree with another Yelper who said the music is too loud. It's hard to hear your dining partner, but I guess that's the nature of these trendy places.  I've also been before when my battered fish (and chips) was a bit undercooked, which was a little gross."}
{"text":"Hands down the best lobster roll in the city. I've eaten lobster rolls everywhere and at the happy hooker they do it best big chunks of fresh lobster crammed into a little bun nice and soft on the inside and nice and buttery crisp on the outside. Just writing this is making me want another one. Just wish they served it everyday. Everything on the menu is delicious I've been there numerous times and the service is always nice. Girls in the front are killer. Go here eat enjoy it won't disappoint"}
{"text":"Having gone last year and enjoying myself thoroughly, I passed by the Happy Hooker recently, and was surprised to see they were open again after a brief hiatus. I didn't notice much in terms of changes, but the decor is nice and a bit homely, with wood panel walls and a few nautical themed paintings for ambiance. I also found that the staff were really friendly, but some items do take a bit longer than others, so be prepared to wait and have water served to you from used liquor bottles.  The menu items are standard fare for a seafood restaurant, the lobster rolls and fish/chips are alright and they don't really stand out too much. But when we get to the taco's, things get very interesting very quick, they were amazing, and if you're not careful, you can inhale 4-5 of them in a few minutes. If you come to the Happy Hooker, go out of your comfort zone, and get a roll or some tacos, and you'll be glad you did.  Recommendations: -Cali Baja Tacos"}
{"text":"Get the mahi-mahi fish tacos! I've tried all three types here and others all over the city. Mahi-mahi or bust baby! Le best.   I also enjoyed the 90's era throwback tunes that were on while I was in and the atmosphere was very \"Dundas West,\" for now that's still in a good way. Haha. Just kidding.   Loved it."}
{"text":"Came here to try the tacos. We ordered the Cali Baja tacos on recommended and it was indeed very good but maybe it lacked a bit more flavour.  We also ordered the Buttermilk Oyster Slider and this was actually better than the tacos. They were much more tastier and the size was more like an actual sandwich than a slider. It also came with som green salad. This place also has Sumol pop, a popular pop amongst the Portuguese. I highly recommend the passion fruit flavour one.   Would definitely come back here to try other items on their small menu."}
{"text":"Service was slow even though the place was less than half full. Ordered the buck-a-shuck oysters (), shrimp sandwich, cod taco, and mahi mahi taco. The sandwich was okay but got too soggy and almost fell apart after two bites. The tacos were bland and tasteless. All I could get from it was the taste of the batter. Tortillas should have been warmed up but were served cold. Caesars were good. I might return but only for oysters."}
{"text":"Clever name, and an even more unique establishment.   ATMOSPHERE:  This place is definitely successful in creating that warm feeling old-school vibe, complete with nostalgia-inducing items decorating the whole place (e.g. dated furniture, decorations, newspapers, and OH YES a Pac-Man Arcade machine!).  SERVICE:  Our waitress was quite friendly, cheerful, and attentive. As strange as this might sound, her whole demeanor kind of fit well with the previously mentioned old-school vibe of the restaurant.  FOOD:  The Baja fries were more bland than expected, but filling nonetheless - they don't skimp on the fries. I was initially disappointed with the large plain bun used for the Lobster Roll (overpowered the meat at first), but after eating away at it a bit, the flavour of the lobster really came through. The size was better then some of it's seafood competitors as well.  SUMMARY:  If you're looking for a fun trip down memory lane, or a good lobster roll, check this place out!"}
{"text":"The shrimp tacos, the cali baja tacos, the tequila sour, the service, and ambience were all delicious. I will be back."}
{"text":"The Happy Hooker (@happyhookertdot) have been on my to-eat-list since it first open but never got the chance. Last week I was lucky enough to be invited to their media tasting by my favorite food blogger Stella (@foodieyu).  The Happy Hooker is Ocean Wise Certified, providing sustainable and ocean friendly seafood.  Their one year anniversary is coming up on March 5th and they are offering specials regularly for this occasion, so make sure to follow their Facebook and twitter. . Dark & Stormy    Coco Peno $10 ~ rum, coconut, ginger syrup, jalapeno ~ This cocktail does pack some heat, love it and it was so refreshing perfect with the food.  Caesar $7.50 ~ This was my least favorite of the night, nothing special  Paper Plane $10.00 ~ Very citrus-y and on the tart side which was a rather nice palette cleanser in between bites.   Kale Salad ~ organic kale, baby arugula, watermelon radishes, cucumber, pickled cabbage,  house made red wine vinaigrette ~ Love how it was lightly dress and isn't this beautiful with the watermelon radish. Love the different levels of crunch here and the pickled cabbage added the much needed pop.     Baja Fries ~ crispy russet potatoes, cheddar cheese, adobo chipotle sauce, lime crema, onion, cilantro, house made guacamole ~ Party time, perfect with Love it especially the adobo chipotle sauce but not a big fan of the guacamole presentation.   Shrimp Po'Boy ~ cornmeal breaded shrimp, lemon aioli, baby arugula, sliced tomato, pickled habaneros, kosher pickles, butter toasted Portuguese bun ~ My fave dish of the night, love the crispy shrimp and the bun was toasted perfectly which also have been able to hold up all the ingredients (hate when it gets all soggy but that didn't happen here).  ~ Also love the pickled habaneros which packed a punch of heat which I love but be careful if you can't really take the heat.   Shrimp Taco  ~ grilled shrimp seasoned with cumin salt, adobo chipotle sauce, lime crema, pickled green cabbage, habanero pico di gallo    Cali Baja Taco ~ breaded and fried alaskan pollock, melted cheddar cheese, shredded romaine lettuce, diced tomato, lime crema, house made guacamole ~ There was way too much guacamole with the smaller pieces of fish here.  Grouper Taco ~ beer battered grouper, melted cheddar cheese, pineapple habanero salsa, lime crema, pickled red cabbage, onion, cilantro ~ This was my fave taco of the night, love biting into the big piece of fish and the batter was perfectly crispy light.   Lobster Roll ~ east coast lobster, mayo, celery, celery salt, butter toasted top slice bun ~  Def the best for last, it's now my favorite lobster roll in t.o. with big chunks of lobster and barely any fillers.  ~ The roll was perfectly toasted buttered yummy goodness. Meaty, rich, creamy, buttery goodness that I am dreaming of as I am writing this.  Verdict : ~ Will definitely be back for more of the lobster roll & shrimp po'boy, would also love to try their fish sandwich (Filet-o-fish is my fave after all). ~ Great affordable cocktails all under $10 and with great selection of local craft beer. ~ Great spot to hangout but also very convenient for takeout"}
