{"text":"The breakfast is always great. But the new angus burgers are superb. I have been coming here for years and I don't see that changing. If you want to relax and watch the world fly by you should take a seat by the window and enjoy the food and service."}
{"text":"12/15/12 Worst lunch I have eaten in years. Won't be back.  $43.00 RIP OFF.  Food was bad and uneatable."}
{"text":"Awesome food and view. I go here about 3 times a week because it's that good. Also the food is at a really good price which is really nice. And the waitresses are also very nice and attentive"}
{"text":"Thought it'd be cool to have our 3 little girls enjoy the view of the planes while having breakfast. Greeted and seated right away. Sunday 7:45am with 2 other gentlemen in the restaurant. Took her forever to see what we wanted to drink. Ordered 1 orange juice and water. Took her even longer to return. We decide to up and leave. Walk by the kitchen and she's just standing there. Didn't even notice 5 people walking out of her restaurant. I wonder how long until she sees we've been gone. So sad. Wish I didn't have to rate a star at all. Wow how terrible."}
{"text":"Not very good.  Soup was cold,  Chicken strips very low quality and not very tasty.  Most waitresses would notice if you didn't eat your $5 bowl of soup and ask if everything was okay, especially if they recommended it.  She didn't.  The vending machine downstairs would be a better choice for lunch."}
{"text":"I really enjoy watching the planes come in and out in this nice cafe spot. Food is decent and service is always prompt."}
{"text":"Get place for breakfast, lunch or to have s special party.  Always great food, clean and a great staff.  Reasonable prices.  Excellent view of the strip and with the planes parked outside are an additional plus. The owner is on site the vast majority of time to visit and make sure your dining experience will be acceptable."}
{"text":"Stopped in Sunday Morning to check out.  Service was very slow and all food taste like it was cooked in the same bacon grease. Waited forever for our food and it was horrible. First and last time for this place !!!!!!!"}
{"text":"My wife found this restaraunt online and it is close by our home so we tried it. I'm glad we did! Food is good and reasonably priced. If you like airplanes, you'll love the atmosphere. We have eaten inside because of the heat but gone out onto the patio to check out the planes. Good for families. Our new breakfast spot."}
{"text":"My husband & I have been coming here for breakfast for over a year & enjoy not only the food, but the view of the airstrip & Julie the server! She seems to know almost everyone who comes in & is always welcoming & attentive. My husband usually has \"the perfect landing\" & I have the breakfast burrito or skillet. My special pleasure is watching the \"Ace Combat\" planes fly-especially the red one!"}
{"text":"Awesome view, great food fantastic company!  Highly recommend for brunch any day of the week.  Great for kids too...."}
{"text":"My boyfriend liked his breakfast.  Great view watching all the planes take off.  Patio setting is great.  My food and coffee was cold.  But then it's an airport.    Prices are very reasonable. I'll eat before I come next time."}
{"text":"My wife and I have been coming to landings for around two years and could not be more happy with it.

Food: The food is so fresh and of the highest quality. You can tell they care about every plate that leaves the kitchen and I have never been disappointed. My wife has some more unique requests when ordering her food and they are always so accommodating , if they are able to do it, they will do it. 

Staff: The staff is really the shining star at Landings. I feel like I am eating with friends every time I go there. Every time we walk in we are greeted warmly with hugs. They will have small conversation with you, but will not interrupt the pace of your meal or be  overwhelming. 

I would recommend Landings to EVERYONE. They run a great business and everything is working together. The cooks, servers, management all work together and are all excellent. This is truly a hidden gem of Henderson!!!!"}
{"text":"Tucked away on the second floor on the Henderson Executive Airport is the Landings. It's open for breakfast and lunch, and it has a bar, in case you'd prefer to go for a drink. This quaint restaurant is serving up solid eats at reasonable prices, with a view. The service is friendly too. It was a welcome change from the long waits, $10+ entrees and spotty service at neighboring breakfast hotspots. This is one airport I don't mind eating at."}
{"text":"We love coming to this place! It's like your favorite diner but much nicer and my kids have loved this place since they were babies! I love to hear my boys say \"Mom, look at that plane take off\". The view of the runways at the Henderson Executive Airport is awesome so you either want to sit by the window or outside on the patio. This is a breakfast place favorite for our family!"}
{"text":"Very cool little place and something very different from a traditional breakfast/lunch time venue given the atmosphere of all the departing and arriving helicopters and small planes, especially for out of town visitors.  Food was very reasonably priced to boot."}
{"text":"Extremely slow service. Slow to take orders, even drinks, slow to refill, slow to bring food out, bring the check is slow. 15 min has passed and I'm only one person at the bar, not even an opportunity to ask for glass of water. Nice view of the airport although not nice enough to wait that long"}
{"text":"Heading home from Vegas to San Diego and this was a random pick for breakfast as we wanted to avoid fast food. 

Excellent food, fast service and VERY reasonable prices. 

Cool atmosphere and worth the couple minute drive off the freeway. Even though this is an executive airport there is easy parking by the entrance and open to the public."}
{"text":"Lunch is better than breakfast.  Breakfast should be easy to get right, but here it is not.  The first two times I had a lady chef, this time it was a large male chef.  I don't know his name, but all would've been great except that he stood in the kitchen doorway picking his teeth w/ his fingers in his mouth.  Gross!  Did he wear gloves to make my Pastrami Wrap?  The wrap was good, very bland cole slaw, but seeing this was a turn off.  The kitchen & bar are super clean, but what if I was a food inspector seeing this??  Sheesh!

Ingrid is here on the weekend so I've only been in when she was working.  Service has been great every time, but I need more consistency for five stars such as breakfast & latest the chefs mannerisms.  I can only recommend The Landings for view of their planes. 

Falls short every time in some way.  I even gave them two chances before leaving another review cause I thought maybe today they are off... 

Best thing I can say is that Dad enjoyed the view & model planes."}
{"text":"A really nice spot to enjoy a relaxing, quiet breakfast while watching the airplanes take off and land. They have a balcony area outside, however it was too windy outside, so we ate inside. We still had a good view of the planes, as this place has floor-to-ceiling windows all around. I had the Eggs Benedict and Sriracha bloody Mary. The bloody Mary was good and spicy and the eggs Benedict was good as well. We received prompt service and the staff was very friendly. I'd consider coming here again."}
{"text":"This place has good food but a great view of the airfield. I had a Ruben wrap. Never even seen that done before but it was really good. I was impressed with the flavor and I really liked it in the wrap. Also was a nice option of getting a side of fruit rather than just fries. My date, the pretty pilot, got chicken tacos but apparentl they dont have chicken so they brought beef. Was weird they never mentoned it but eiter way she was happy with it. Great place to eat and watch the planes coming and going before you hit the skies!"}
{"text":"The best burger and fries I have had in a LONG time! Kristin delivered the best Bloody Mary this side of Eastern Avenue and in record time. I love this place!"}
{"text":"Gulf Stream G650's, AA-5 Tigers and UH-60 Blackhawks...Oh My!  

Went with my brother to meet a childhood friend at the Henderson Executive Airport to enjoy to of my most favorite things...Breakfast and watching airplanes.

The Landings was wonderful experience!  Situated on the second floor of the main terminal one cane drink, eat and watch things that fly.

Our waitress was awesome and kept a keen eye on my G&T..Yes, my G&T that I was very much enjoying pre-meal and again while I ate a delicious omelet called the \"PBY Catalina\" stuffed with breakfast meats, cheese and topped with avocado.

I look forward to smell of JP5 and extra crispy hash browns in the future."}
{"text":"Saw mixed reviews about the food so really didn't have high expectations. But our breakfast was delightful! I had the perfect landing-2eggs, hash browns, 2 slices of bacon,2 sausage patties and sour dough toast. My friend had French toast. Eggs were cooked perfectly light and fluffy. Hash browns delicious and not greasy. Loved the bacon and gave my friend the sausage as there was just too much for me to eat. He said it was very good as well as his French toast. Both of us had coffee and liked it too. I had the sriracha Bloody Mary too. While it was advertised as coming with a big chili pepper, mine was missing. It did come with celery and olives though and that was plenty. It had just the right amount of spice and I highly recommend! Enjoyable morning on the patio watching the planes and the people come and go. We are definitely coming back!"}
{"text":"I've given this place too many opportunities and just made my last visit.  The service is terrible.  Try to go on Sunday and you get lucky and get the grouchy one server in the entire restaurant.  Went today and there were two tables sat and my party of 5 we had to move because a chair was added to the end.  Rather than the servers assemble another table to accommodate 5 people they complain about us encroaching on the aisle that nobody was going to be affected by.  Then my daughter orders off the kids meal and they cancel her order because she was too old rather than offer to still make it and charge the difference.  Seems like a good idea to generate revenue versus worry about her being a year past whatever the cutoff age was.  This place is terribly mis-managed and could use some serious service training.  Save your money and go somewhere else."}
{"text":"Great breakfast. It's cool small hole in the wall with a great view of the henderson airport and Vegas. Patio is very nice to sit on in the am. Coffee was great and my omlete and hash brown were also great. I would have taken pictures but I ate them first they were so good. We will definitely be back"}
{"text":"Service was good. We had breakfast dishes, and they were yummy. After some issues, they let us outside for drinks. Only 3 stars because it's a nice place for the views and drinks. The food is good, and a great accompany to the drinks. I will return to sit outside and enjoy the views. If they let me."}
{"text":"Food is great, ambience is superb, & service is par excellence. My boyfriend is a pilot, so we love breakfast here, talking planes, & watching perfect take-offs & perfect landings."}
{"text":"I highly recommend this restaurant for any pilot or aviation enthusiast who may be through the area.  The food was good, the restaurant carries an aviation theme throughout, and you have a great, elevated view of the entire airport.  A perfect place to grab a bite to eat and watch the aircraft come and go.  There is some outdoor seating as well!"}
{"text":"Mediocre food and horrible service. Love the location but just can't get over why they can't hire more help to allow people to get better service. Took about 20 minutes just to get the lady to take our drink orders and another 20 to get the lady to take our food order. Won't be back!"}
{"text":"Neat location if you're out that way.  Nice little outdoor patio. Located on second floor of the terminal.  Not a ton of flight activity but got to watch a few jets come in and see the whale's deplane.

Friendly attentive service. Not crowded. Group of 5. Everything got a thumbs up except the burger expert in our group gave the burger (the \"$100\" burger w/cheese) a thumbs down.  So don't expect gourmet on their burgers - just average. Sandwiches are well crafted. Great Reuben. Good salads.  A nice casual place to grab lunch at if you have a casual attitude without pretentious expectations.

SOLID 4 STARS"}
{"text":"Really unique spot overlooking Henderson Executive Airport.  Outdoor and indoor seating; both with good views of the small airport and planes taking off and landing.  Good food and great service."}
{"text":"Great food and view. Our waitress was fantastic, she took our table of 9 sixth graders and their moms with patience and kindness."}
{"text":"Been coming here a long time, and it seems the place has recently gone down in service and quality. Low staffing, cook not in, shut down the fryer early, charging for splitting plates and $.50 for a lime wedge...how tacky! I guess I'll just take my business elsewhere where they're smart enough to price their food so they don't have to nickel and dime you. It's always been one thing or another the past few months. Lots of new help recently too. :-/"}
{"text":"This is like the classy Denny's of the airport. It gave me a similar vibe to the cafes at your favorite off-strip casino. Obviously, the most interesting feature is the giant windows on three of the sides which allow you to see the private jets land and take off. I happened to try this place out at a fairly random time, about 10:30am on a Thursday. Due to his, we were the only people there and there wasn't much activity on the runway. Which was fine because it was still a nice lunch. The only thing I sincerely hated was one fly who would not leave me alone. At one point in landed on my forehead and I almost died inside. I don't know how it got in there, but I am sure this is not a usual feature. 

I got the grilled cheese and pulled off the crust like a child, and it was glorious. It came with potato salad. Neither of these were spectacular, amazing feats of culinary excellence. They were, however, perfect for what they were. Slightly greasy (but not too much) diner food that hits the spot. As the three-star description on Yelp states, this place is A-OK!"}
{"text":"I love a great FBO restaurant!!  This place has great food for a better deal and an even better view of the airfield.  They had me at \"Breakfast All Day.\"  I will certainly be back!"}
{"text":"This is a solid breakfast place, i like it because the food is worth the money, the service is nice and friendly and my kid can watch the airplanes right outside.

Feels a little like a cafeteria inside and thats ok, the breakfast is just that and good, and as i said already i do like to come here."}
{"text":"Probably the best lunch I've had in a long time. Kristen ( who served us) was amazing. Just all around great experience. Will definitely be coming back, and recommend to others."}
{"text":"The restaurant environment was a very nice cafe looking directly onto the airfield, so that was nice.  As far as the food, it was perfectly fine.  Basically your standard short order kitchen.

We went for breakfast on a Sunday and it was not crowded at all.  The coffee was very good.  I had the eggs Benedict and they were acceptable...nothing to write home about.  My wife had eggs and bacon and really loved the home style potatoes and cinnamon toast.

We'd likely go back, perhaps in the evening, just to watch some planes taking off and landing while we eat."}
{"text":"Thank you for your response but what Ingrid told you was not 100% accurate. When we walked in, there were about 3 other tables and a larger party that the bartender was taking care of. Ingrid was focused on the 3 men that walked in right after us which she knew by name (obviously regulars). She was a awful server and had no personality... Idk why she said we were unhappy as I was never rude and still tipped her because I hoped she might be having an off day. Also, you order drinks prior to placing a food order, had my husband known that his came with coffee he wouldn't have ordered the $5 glass of OJ he got. The server should've also said \"YOUR meal also comes with coffee or tea would you like a cup?\". At the top of your menu it says breakfast will include hash brown or fries and toast... Maybe that needs to be re-worded if not the case. I said \"I'll have the biscuits and gravy with the hash browns\" not knowing they weren't included. All of this could've been avoided had things been worded different, if the server took an extra second to ask a couple extra questions or if I actually recieved my check. Although the charges are small I just feel like it's really shady for a company to be ran this way. We won't be back as the food was beyond bland and overpriced, pair that with horrible service. No thanks"}
{"text":"I love this place. The food was good. Service was great. The view from the restaurant of the planes was awesome."}
{"text":"this was a great little restaurant! super small and cozy. we went there for mother's day brunch. the food was great and the staff was so friendly and amazing. my boyfriend and his father love planes, so this was their dream come true. we got to watch all the jets take off and land and see all the flight memorabilia while doing so. very unique."}
{"text":"Ok food. Average Prices. Great Location on the second floor of the terminal. Floor to ceiling window views of the ramp and runway. Outside covered patio and a very nice bar. Its a nice place to go if you like watching airplanes and need a bite to eat.

I should add that we were served by the most Friendly waitress Las Vegas has to offer. She was awesome, a person that just makes your day."}
{"text":"Went back today and Sherri was awesome as always! Soon we should be able by saying \"the usual\" Ok maybe a few more trips to get to that! I have the Denver omelette...it was cooked perfectly! They even accommodated my pregnant friend with French toast and peanut butter! LOL Def recommend!!!!"}
{"text":"Great atmosphere here, Marie the owner is usually there and great to chat with. Food is awesome too! I feel like i'm out of town at a great little secret place when i go here."}
{"text":"The landings has great food for excellent prices. The view of the restaurant makes it very fun to see airplanes land and takeoff. Kristen THANKS once again for you're excellent service. We will be coming back for sure!"}
{"text":"I'm a sucker for a random breakfast place. It gets me right in the feels.

Landings is a prime example of this; small, a tad outdated, and the aroma of hash browns hangs heavy in the air. I chose this place based strictly on the randomness of it, not the food pictures or reviews. This place could of had a 2 star average rating and I still would have eaten here. 

I sat on the outdoor patio hoping to catch a glance of a few planes landing and maybe Danny Zuko himself, John Travolta, walking out and joining me for a cup of coffee. This didn't happen, but some food did. 

I went crazy and got the Chicken Fried Steak with eggs and hash browns. Pretty basic carb filled breakfast. Steak was cooked right, the eggs were fluffy and the hash browns to seared to a crispy perfection. 

I really can't complain about anything. Landings is a greasy spoon, but disguised as a nicer and cleaner eating venue. Great place for a low key meal and view of the strip. 

PRO TIP: Sunday is the only day they serve Eggs Benedict. Nummers!"}
{"text":"For the general aviation pilot, there are few airport eateries that really impress, but this place is one of the better ones I've come across.

The food is surprisingly high on the quality. I had the club sandwich which was, as club sandwiches go, quite excellent. My buddy had the pastrami sandwich which he swore was one of the best he'd ever had.

The service is good and usually quite friendly. The prices are pretty reasonable. The place is clean and nicely decorated, and the view is awesome."}
{"text":"We've been wanting to come here so the kids can check out the view and watch the planes depart and land. On this day, it was windy so the patio was closed. Very unfortunate on the day we finally decide to check this spot out, we can't sit outside. The interior space is old and outdated. The service was mediocre. The food was terrible for what they charge. 

What completely turned me off was when we got our bill and they automatically added a \"Split\" fee. I asked the server about that and they charged for an extra plate. An extra plate!!! I didn't even ask for the extra plate. It was for our kids. Ridiculous. I'm not a fan of places that are sneaky about adding \"fees\" to your final bill. Not gonna lie, this irked me and put a bad taste in my mouth. They got 2 stars only for the cool concept of eating on the patio and watching the planes. Which we didn't even get to do today. The view inside is not that great. 

Well we won't be coming back here. It's pricey for simple Denny's quality food. As a matter of fact, Denny's is way better. They had the audacity to serve us burnt bacon and tried to get away with it by flipping it over. Who does that?!? Our final bill was $53. This lunch was not worth $53. This place is overpriced. At least if they served good food, it would be worth it with that view. Love the concept but they fail on the food quality."}
{"text":"Nice, quiet little restaurant.  Sit back & watch the planes take off & land.  Food is pretty good.   
Staff is very personable."}
{"text":"With floor to ceiling window views of the ramp and runway, this eatery, located on the second floor of the terminal at Henderson is a great place to dine before catching your flight. 

Inspired by everyday family cooking, the casual restaurant carries a friendly atmosphere, wanting their customers to feel at home. 

One can watch planes take off and land while eating a \"Glide Slope\" or \"Spinner\" omelet. Try a \"B-17\" or \"Bomber\" sandwich for lunch. You'll have a great time just reading the clever names on the menu.  

Enjoy a glass of wine while sitting on the outside veranda overlooking the lights of the nearby Las Vegas Strip and breathe a sigh of relief and gratitude for a relaxing time without all the hassle and bustle of Sin City."}
{"text":"Oh my. It's been a very long time since I've been to such a nice facility with such rude and short service. 
Used to eat here frequently and disappointed with what we saw today. 
Advertised hours are 7:00-4:00 but apparently the wait staff today decided to stop at a little after 2:30. 
We had our food (which wasn't even average - turkey sandwich very dry and tasteless, hamburger very dry) and I noticed two other tables of guests come in and then leave after waiting for a member of the staff to even acknowledge them. 
Had to flag down server for beverage refills and she walked past is several times doing other things before we got refills. 
They were more interested in cleaning up & closing down than taking care of customers the last 90 minutes. 
And, we were denied a take-out cup for the remainder of my drink. Said they'd have to charge me for another drink. 
Just wrong. Don't plan to com"}
{"text":"Really nice folks and an excellent view, you get to enjoy a very good meal with airplanes flying around! What more could you ask! We eat there almost every time we fly into Henderson. As well when we stay overnight we drive to the airport and have breakfast there! 

Best to call for times, as I believe that they close at 4 pm on some days."}
{"text":"Very relaxing and quiet because there are no big jet planes. Great views of the planes and mountain. Food is great and service is friendly. This is a hidden gem."}
{"text":"We decided to try a different spot for b-fast.  So we went here, it's on the 2nd floor.  We were greeted right away!  Ohhhh, I forgot our waitresses name.  But she was so sweet, she seemed like a southern gal!   We both ordered steaks, with eggs, hash browns, and toast.  We were not in a hurry, but I did notice another gentleman ordered after us, and his food came out first.  I think the steaks take a little longer!  It's all good we had no where else to go!  And it was a nice place to watch the planes take off.  I would say the food is pretty good!  I should have read the reviews though, I think I would have gotten the burrito.  Next time!  We really enjoyed the service and the fact it wasn't crowded.  The place is really cute and you can see in the kitchen, it was nice, one of the waitresses was wiping down the chairs, like all of them!  I've never ever seen anyone do this before!  So I like the fact they take pride in there place being clean!   Check it out for yourself!  I might see you there!"}
{"text":"It's cool to find a place that not everyone knows about. Who would have thought that there was a restaurant on the second floor of the Henderson Airport (which has no traditional security gates by the way) with a stunning view of the valley and scores of private jets. I discovered The Landings during a business lunch and while I was there, we got to talk at length with the owner Marie. It's a special experience when you get to meet the owner of a small business and see the passion and love for what they do every day. Although she had some great celebrity stories to share, she explained that most of her customers are local patrons. I was so eager to show off this hidden gem to my friends & family, that I brought all of them down for Marie's Sunday Brunch the following weekend before seeing a show at the Smith Center. Yes, it was a little out of the way, but it was worth the drive.

A couple of things to know is that there is limited signage, so you just need to go the Henderson Airport. I learned this the hard way. LOL. They are only open until 4pm, so don't come for dinner, but the venue is open for private parties in the evening to enjoy views of the incredible LV valley sunsets behind the variety of private jets. Surprisingly, they have a bar with beer, wine & liquor."}
{"text":"We dropped in here yesterday about 2p for a quick bite.  We were seated right away and the food was delivered quickly. The thing I really want to say is our waitress was outstanding!  Friendly, responsive, professional. I wish I got her name. Think I'll take her home with me :)"}
{"text":"Sherry was just an amazing waitress from the Midwest with lots of warm feeling.  I love my bacon extra crispy and without telling them the chef creates an awesome PBY Catalina omelet.  Overall, the restaurant is super clean with fantastic view of Vegas local neighborhoods.  A Gem!"}
{"text":"After my thrilling airplane ride with the nearby Sky Combat Aces, I stopped at the Henderson Executive Terminal to treat myself to breakfast at the Landings, the second floor restaurant in the terminal.

I walked up the stairs, turned left, and there it was a few steps in front of me.  It was about 11 AM, and it was not at all busy.  The waitress told me to sit anywhere I wanted and since the patio was open, I went outside and sat there.

The menu is extensive for breakfast.  I opted for the day's special, Eggs Benedict.  You have a choice of home fries or hash browns.  I opted for the home fries.

Coffee was brought soon after I sat down and I was asked if I wanted something to drink.  It was refilled quickly, too!

The Benedict was good except the eggs were a bit on the hard cooked side rather than soft cooked.  The Hollandaise was probably purchased rather than made on premises, but it had a good flavor.

Service was excellent!  Denise was my server and she was a cheerful server who was very capable.  

Sitting outside and having breakfast with a view of Las Vegas to my left and the Henderson Executive Airport and the McCullough Range straight ahead made a great breakfast stop!"}
{"text":"After waiting for 12 minutes and being ignored I was finally seated. They brought me a flat Sprite and it took a while for my food to arrive. The taste was sub-par and would get a better view of aircraft and more quality food at Vegas International Airport Denny's."}
{"text":"Our NFR gang had breakfast here this morning and everything was very good. Beth and I both had pancakes. No waffles here however. Need that to be on menu...I would like. Real good bacon here. Others had a variety and all was excellent. Nice view of the airport ramp area too."}
{"text":"If you want a good view of the planes operating, I can recommend the location, that's about the only good thing I can say about The Landings. 

I have enjoyed many airport cafes over the years, unfortunately this location needs someone here that knows how to run such a facility. 

Service and food very inconsistent, under staffed and bad attitude. I don't recommend this restaurant to any of my friends. Terrible place."}
{"text":"Absolutely amazing service and the food is even better! I love coming here for breakfast & lunch. They have a beautiful patio that you can watch the planes take off while you eat. The house made cheesecake is the die for literally melts in your mouth."}
{"text":"This place was terrible and I was so excited to try it. I ordered an iced tea and it came out already flavored and sweetened, apparently a premade mix. I asked the waitress for another ice tea and if it were homemade, she responded yes. She brings out another tea that is now black but also sweetened and clearly a premade mix. It was terrible. The menu is a greasy spoon diner type of menu. The views are not all that good, sideways to the landing strip so it isn't like you're looking straight out. It's kind of dark and not at all what I expected. I've no desire to return."}
{"text":"Wow, we are sitting here now, 20 minutes no drinks. Waitress took our order after we were here for 15 minutes and she was a rude B....
Save your time save your money eat somewhere else."}
{"text":"Update 8/13/2013

Adding another star. I went back again recently and enjoyed an excellent meal. They still need to learn more about what \"well done\" means with respect to French fries. 

******

Wow, how sad. :(

This place was fantastic when it first opened a couple of years ago, but I thought I've noticed a steady decline. 

Today, I ordered a soft omelet, and crispy hash browns. Instead, I got a torched omelet, and flaccid hash browns.

Just do like George Costanza, and order the *opposite*. Hopefully it will work out for you. 

The \"extra\" star is for convenience and ambience. 

I'm done.

5/4/2013 - Not quite done. I was back a month or so, and had possibly the best Reuben sandwich I've ever had.  They didn't get the art of the well-done french fry down quite yet. I am raising another star because the owner had the class and professionalism to reach out and sincerely address my gripes. She really did care. Maybe another star in their future? I hope so; like I said, it was GREAT when they opened."}
{"text":"The view from the patio is awesome! Watching planes land or take off was fun! The food was good as well as the service.  Great place to \"getaway\" for a bit."}
{"text":"I know other reviews have already said this, but wow, what a hidden gem!!!  

Located on the 2nd floor at the Henderson Executive Airport, the view to the air strip is a rare find.  

We sat out on the patio.  The area is a bit tight, but that's understandable.  Everyone wants to sit outside and who can blame them?  The weather is beautiful and the view is spectacular!  

The food was quite delicious.  Everyone in our party enjoyed their food, so nothing to worry about there.  We also ordered the onion rings and they were soooo good!  This is coming from someone who usually does not like onion rings.  Try them! 

The fiance had the bloody mary with sriracha, and that was really yummy! 

Plenty of airplanes and helicopters took off from the airport while we were there.  It was definitely a fun and delicious experience. 

The patio would also be a great place for an intimate party. 

We are adding The Landings to our go-to breakfast place from now on.  Bring your family; bring your out-of-town guests; they will love it!"}
{"text":"Yelp find. Thought it would be a cool spot for breakfast for my son's second birthday since he is showing interest in airplanes now. 

Upon entering we weren't sure if we had to wait to be seated or seat ourselves. There were no signs. Standing there looking like idiots much. Room had about 3 tables full. The lady comes out and she looked like she saw a ghost with her half ass smile. She said inside or outside and we wanted outside so baby boy can watch the airplanes. The shades were down inside. 

The food was mediocre. Came out lukewarm. Portion was small. At least my chili tasted home made. Lol I ordered \"The Tower\" omelette and my husband got an omelette too but I forgot which one. She didn't bother to give us or offer a kids menu (according to yelp they are kid friendly and with a kids menu) not even a drink for him. 

I would assume it was the owner everyone speaks of but I don't know why she was booboo face. Only about half way through our meal she tried to have some small talk/interaction with us and that was when she finally brought out our cup of fruit. I'm also going to say that the food took a little long but maybe not because we were so occupied watching the planes. It doesn't take that long to make an omelette. 

Maybe she was not receptive of us being there because we didn't fly in or out of the airport?!?! We live in the neighborhood and they had good reviews that's why we came in. 

Well, my son definitely enjoyed the view (so did my husband and I) and did not act up or run around like a crazy kid. I wish the restaurant itself was a lot better to go with the view."}
{"text":"Ready for something different, a bit say, average, but with a great view and great lookout for planes, try this place.

Food - Had their breakfast , really nice and tasty. Great fruits, and all the healthy bits like cottage cheese and etc.  

Lunch - Also had their sandwiches for lunch. Nice selection of breads. Not fancy, but pretty good overall.

Drinks - Beer on tap. Nice. Didn't try one, but love restaurants that have bear on tap....

Service, the team here is really great. They are high on service.

Overall,  I plan to take my kids here. They will find something they like, but the view will be cool, and the odd solitude of the place will be actually fun too."}
{"text":"Great place for breakfast and lunch. Perfect location for airplane watching and viewing the Las Vegas strip."}
{"text":"Can't recommend this place enough! Definitely try to sit at a window table because it's worth the wait. Seeing the planes take off and land is a fun experience. The food was good and worth the price. Ingrid our waitress was very attentive and made sure we were taken care of and had everything we needed. We will make this our regular spot when we come back to Vegas!"}
{"text":"I liked the location, the service, and the view.
Sadly, I was not a fan of the food - so much so that I can't even bump up to 3 stars.  

I read previous reviews and decided the reuben was the way to go. I was disappointed. The Reuben wrap was extremely sour, nearly inedible. Even after removing the sauerkraut - something unidentifiable was horribly sour. My husband even tried it and he spit it out. I probably should have said something but I just wasn't in the mood to have it taken back. My husband's country fried steak was extremely small and the grey gravy looked right out of the can. The breading to meat ratio was a little off and it just wasn't what he expected. The prices were great but still -- our food was not worth the money. It felt like our bad visit was a fluke because there were quite a few regulars there that came in and chatted up the waitresses.

Maybe it was an off day, maybe we it was our luck. Whatever it was I honestly can say it was not a good meal. My husband and I decided that if we do come back it will be for drinks by the window to take in the gorgeous view again."}
{"text":"A cute little place with a sweet staff! We had breakfast there this morning and we were very happy with our experience. 

The view of the runway is very neat. You literally watch the planes go by your entire meal, and they have a nice view of the strip as well. 

For breakfast I had the short stack of pancakes with a side of fruit. The pancakes were so good it tasted like I was eating a slice of birthday cake without the frosting. I did however, wish they offered other flavors for the pancakes (our waitress did say the have them on special once in a while so hopefully they have them next time we visit). My boyfriend had the biscuits and gravy along with the rest of my pancakes, all of which he said were very good. We like that they make everything fresh here. We will definitely be back to try the lunch sandwiches!"}
{"text":"I am definitely a fan! My hubby found this gem while we were searching for a new breakfast spot near our casa, and it didn't disappoint (high five, hubs!!).

The Landings is located upstairs in the terminal at Henderson Executive Airport. The view alone is worth a visit, especially if you are an aviation nerd. The airport doesn't have a ton of activity, but you can get a birds eye view of take-offs and landings from your table in the restaurant. 

I had my old stand by meal, chicken fried steak. It was delicious and they didn't skimp on the gravy. I also ordered a special blood mary, which was a bit of a disappointment for how much they charged for it (more than $10). The service was fast and friendly and I disagree with others who refer to this a a bit of a greasy spoon - I thought the restaurant was clean and nice and not a dive at all.

It's definitely a hidden gem, providing a great view and decently priced eats. We look forward to making this a regular stop!"}
{"text":"Great food. Great service. Super fast. The server Kristen is so friendly fun and Nice! Nice view of the runway and fancy planes."}
{"text":"Hell heaven, all the food is legit!!! On top of the relaxing spirit, there are the Great view and welcoming service!!! The waitress Sherry is so friendly and attentive. The best omelet ever, the PBY is a must if you like crispy bacon. I am not a fan of turkey, but the turkey here is just juicy and tasty. Onion rings are so sweet. Feel like on vacation again!"}
{"text":"I ate at The Landings today everything was fantastic.food was fantastic and so was the service.Beautiful view.great visit at the landing will for sure be back."}
