{"text":"I love this place. Amazingly fresh and light food with incredible flavours. The staff is wonderful too."}
{"text":"This is a great place for Thai on the Danforth. Affordable and tasty. We get take out often but it's a clean open space to dine in as well. Extra friendly staff and always consistent."}
{"text":"I got take out last night. I ordered Curry Shrimp Pad Thai, Coconut Lemon Grass Soup w/ Shrimp and Fried Wontons.

Pad Thai: Flavor was ok, came with THREE shrimp, THREE! It is Shrimp Pad Thai. The THREE shrimp it came with were overcooked.

Soup: Tastes like \"dirty dish water\" horrible! This soup came with SIX overcooked shrimp.

Wontons: The texture was off, microwaved perhaps? The dip tasted like bubble gum.

When I called to complain about the amount of shrimp in the pad thai they argued with me so I hung up. Never going back there again."}
{"text":"We have been to The Family Thai many times, dining-in and ordering, and we have been pleased with the food they are offering there. Maybe we are not the right people to rate it, as we only have the Pad Thai there, as it is the best from all the other we even have tried. It looks so wonderful on a plate placed in front of you, topped with fresh onions, salad leaf and orange-lemon. It makes me drool just talking about that.
It it the best Pad Thai we have ever had.

The place had gone through a renovation and is now white-lime and very modern-looking all-family place to eat it. At 5 PM there were seven people altogether eating while a smooth and calming music was stroking our ears.

They have specials on Tuesdays for Seafood section and Wednesday's for Pad Thai, when all the prices are 50% off. Suggest!"}
{"text":"Great service and excellent food i couldnt believe how cheap it was plus we got free dessert it was so amazing"}
{"text":"Nice and clean location, but that's all.
The Coconut Soup was more a floating mushrooms soup with 3 small pieces of defrosted chicken on the bottom of the plate.
The Ginger Chicken was, in fact, an aggressive onion stew with red peepers, and not so much chicken. I detected 3, 4 surviving pieces of the same defrosted poor chicken from previous soup... 
FT is expensive with no reason or justification for what you get. sad way to fool people.

Creamy soup? no, watery soup. 
A couple coming after me start asking so many details about their food, like they were in some high class Michelin 3 stars restaurant: \"it is spicy, it is hot, can you bring the spring rolls right now\"...kind of spoiled kids / so called \"artists\". I did not said a word, just let them eat and we'll see after...at pharmacy.
The owners seems to be Chinese. If they can fool you, they will.
Terrible food, small portions. I got food poison right away, on the spot. 
I will not come back."}
{"text":"I am giving this a five from my lunch time experience when i was passing by and saw a really good priced lunch time special for under $10 I had a starter spring roll and a malaysian curry (which is what drew me to the place originally)

Unlike the previous reviews I am not an expert on what thai food should taste like....because im not thai but the portion was more than enough, the taste of the curry itself was awesome with freshly boiled rice and nice cuts of chicken.

It was not busy when I went so service was quick and efficient so no complaints on anything from me. 
If i pass by again I would definitely go in again and perhaps try something else on the menu."}
{"text":"I keep ordering from this place forgetting the food isn't that great.
The curries are too sweet, bland, and one-dimensional. The pad thai is tomato-y and flat. Soups and salads are bleh. I can make better mango salad and lemongrass broth at home. It's not the worst Thai I've ever had, but it certainly isn't worth the money or calories.
All dishes are missing that unique complex flavour that Thai food is known for."}
{"text":"We always order delivery, so I can't write as to the dine-in experience (or if they have one). Our food is always exactly as we order it. It takes a bit of time to get here (usually around an hour) because it is made fresh. My favourite dish is the red chicken curry and I get a side of coconut rice. The coconut chicken soup is also deeeelish."}
{"text":"I ordered the glass noodles and green mango salad to eat in. It was a Saturday night and the place was empty. I should've seen that as a sign to dine elsewhere. 

The food was ok, especially the salad. About halfway through the meal, I felt a small stone rolling around in my mouth!  Thankfully I didn't break a tooth!  I pulled it out and called the waiter over. He took it from me, looked at it, apologized and said he'd give me a discount. He went to the kitchen I assume to talk to the cook. 

As I prepared to leave I heard some yelling from the kitchen.  The waiter came out and charged me  the FULL PRICE. I didn't want to start an argument. Maybe the cook didn't believe me.  I paid and left.  Terrible experience. 

I will never eat there again and recommend that you don't either."}
{"text":"So this joint has got a single, very personal review so far. It's around the corner from where I live so I thought I'd bravely venture out to see what all the bad was about and maybe offer some impartiality.

I ordered some rolls, which came a little cold, which was fine, and pre-cut, which was not. Rolls are all about packing everything up into a tiny little biteable container. That's the whole idea, no cutlery wanted or needed!

Then my chicken satay with mango salad arrived. The chicken was perfect. The mango salad complimented it very well. I would return should I ever get a thai craving. 

The biggest detraction is that The Family Thai is surrounded by some truly awesome Tibetan/Himalayan restaurants that simply cannot be ignored, especially to those making the trek all the way out west."}
{"text":"Okay.
So this place used to be Lee's Thai Spring Rolls - with faded bamboo cuts shaped like a curtain outside and a burgundy curtain at the door. It had a nice decor and fairy authentic menu. I even worked there for a little while, so I can get free food.  It had some authentic items on it that made the place special ;it was very ambient inside with candle lights, making it a great spot for an intimate dinner with a friend or ...\"friend\"  and the place had been my favourite for YEARS. 

Then one day it changed to Family Thai and the bamboo was painted green - then it came off altogether and was replaced with  green paint and new tacky signage.
I went there a few times in good faith - and to my relief the menu was the same - or so I thought. All the little menu items which made it special were gone - whhhy would you get rid of Thai iced tea iin a THAI place, I dunno, but there was some business logic I'm sure.

There is 3 beef I have with this place.
1. the price went up; I used to recommend Lee's because even though their price was $1 more than most, the flavour and portion was so awesome that it was worth the extra dollar. There is an additional dollar added I realized, but they are using less variety in ingredients - I mean the stuff they use is now sort of the generic ones you'd find in a grocery shop or in any Chinese restaurant - like Bok Choy, carrots and cabbages. I dunno - it was just not the same.  What's worse, the plates are smaller and so are the portions.

2. Service? what service?
So, my expectations are set rather high since I'd been a fan for years - so you're already treading on thin ice. But dammit, when I rest by bottom on that uncomfortable chair, I expect you to acknowledge that within a reasonable time. Possibly bring me some water even, as you bring me the menu. In the last few attempts for me to give this place a chance I waited 10 minutes before they brought water for me. My friend ordered beer and it took another 10. My appetizer came WITH the entree - but wouldn't you know it , the bill came as soon as I was close to finishing my food.  NO TIP FOR YOU.

3. I mentioned that it was an ambient place before. It's less so now because the burgundy curtains that gave privacy is gone as well as the candle lights and dim lighting - fine, whatever, but do you HAVE to have an infant balling in the restaurant?! I am trying to enjoy an overpriced meal here with wailing baby.  As I eat I frown and wonder WHY I didn't buy these cheap ingredients and stir fry it myself at home, where I can eat in peace without a wailing baby in the background.d

So there.
Otherwise it's a great spot. -_-"}
{"text":"To be honest - the pad Thai was just like every other pad Thai I've ever had. Boring."}
{"text":"Big mistake, I thought I was ordering from another restaurant. Portions are minuscule, food is tasteless, wasted my money."}
