{"text":"this was a great little diner type place. you order at the counter, take a seat, and they call when your order is ready. the menu consist of hot dogs (obviously), hamburgers, gyros (surprisingly), grilled ham and cheese sandwich, and the necessary onion rings and fries as accompaniments.  i gave this place 5 stars, because it is that, for what it is. a tiny diner style place that men who do blue collar work eat at. my husband ordered his hotdogs with chili, and i ordered mine plain (well, with jalapeños). the hotdog chili is mushy hotdog chili (this is a compliment). i stole a swipe with my fry before he devoured it.  anyhow, if you want an easy nostalgic diner style place to enjoy a hot dog or hamburger, this is your place."}
{"text":"Hot Dogs and Hamburgers with some Greek food thrown in to boot?! Not expensive- and the food is good. Decor is lacking. A local place where locals eat in a hurry. You get fed and get to talk to the locals basically."}
{"text":"Not far outside of Asheville. Very friendly staff and ample portions. The dogs were hot and tasty. They have a substantial menu of other foods that all looked good!"}
{"text":"Possibly the most disgusting hot dogs I've ever eaten. Honestly, I'd rather eat hot dogs from a random gas station than eat here again.   We stopped here while on vacation on our way to Chimney Rock. Big mistake. The cleanliness left much to be desired in the cafe area as well as the restroom. That should have been the first clue. But my husband really wanted to try the hot dogs, since he used to live in New York and is always looking for good hot dogs. So we both ordered.   The hot dogs weren't anything special, they tasted like boiled ball parks. I ended up with a stomach ache about an hour later that lasted the rest of the day - thankfully we werent too far from our destination. Had to take Imodium so our trip wasn't ruined.   This place caused me to institute a \"no more road-hot-dogs\" rule."}
{"text":"When I want freshly cooked grill food this is the place I go to. The location I fluent and is in my neighborhood is the Swannanoa /Black Mountain one. Neat, clean restaurant with nice, friendly service always!!!! Their hot dogs are great and inexpensive too. The chuckwagon Sandwich is a must!"}
{"text":"Granted, I was starving because I just hiked 7 miles up and down a mountain, but these were the best hot dogs upon which I have ever feasted. The chili, mustard combo really hit the spot. You owe it to yourself and your family to make a stop here if you are visiting the Asheville area."}
{"text":"Totally boring, plain hotdogs! Seen better made hotdogs with more flavor at 7-11. Chili dog was mostly hamburger (no chili??) and the buns tasted stale. Take your hotdog craving a few miles to Celebrity Dogs in Asheville..... A much better experience there!!"}
{"text":"I got food poisoning here on their plain hot dog! It tasted microwaved because they didn't cook it right and served luke warm.This was on November 19,2014. I though that i got sick from something else.Well,i can forgive the bad meal because it can happen to anyone.Well,i also been here a few times,before the last day that i got sick on."}
{"text":"Great service small place but busy. Very fast friendly service. Delish Gyros even my picky eater loved them. We will be back ;) great place for a quick meal."}
{"text":"This is a dicey joint that throws down some serious food!!! All cooked to order.  Fries are thick cut.  Burgers are juicy and packed with sides that we all love.  It's a blast from the past but worth a visit if you are in the area.  The hot dogs looked amazing too!  Country fast food!!"}
{"text":"Perfect hole in the wall spot!!!  My whole family loves Hot Dog King!!!  They have some of the best gyros around, and everything else is wonderful as well.  No, it isn't gourmet food, but if you want diner grub that is always hot, fresh, and made with a smile, this is the best spot in town :)"}
{"text":"If you've been out sampling organic and farm-raised food all afternoon, then you may just be ready for something different. How about a hot dog? How about a foot long hot dog? Whatever your choice, this could be your place.  Now to warn you - there isn't anything fancy here. It is quite possible that the Hot Dog King has only been here for a couple of years, it may very well have been here for decades instead.  The one good piece of news is that they will make you feel welcome, and they will fill you up, with the food coming as long as you keep ordering (and, well, paying). So enjoy, and get back to the farm-raised stuff tomorrow."}
{"text":"Stopped in for lunch.  We had hot dogs with taters. Also had fried grits with cheese.  Food tastes fresh and clean. Service was great and so was the whole experience Was delightful.  Price was right. We will return."}
