{"text":"We were a table of eight.  We noticed right away tables and shakers were sticky.  Some food items like fish and chips are obvious pre-bought and cooked.  Kids Mac and cheese was literally KD that cost $6.  Soup and a spinach salad looked good.  There was a positive response from the person who had the philly cheese.  This place is more sports bar/pub then restaurant.   Overall not somrwhereni would look forward to trying again."}
{"text":"Great ambiance, great food and service.  It was a Friday night and I was surprised that it wasn't busier.  My partner and I shared the Calamari appetizer , which was the 2nd best Calamari I had ever had.  I had the special, which was a pound of mussels in broth and garlic toast as an entrée.  It was excellent, hot and tasty.  My partner had the Irish Stew and he loved it, very tasty and filling.  The service was prompt and very helpful in accommodating regarding my pea allergy.  I would definitely return.  My only complaint....the lighting is a little low."}
{"text":"Great burger and chicken curry. Decent prices and good service. We keep returning every other week."}
{"text":"Felt like an intruder, wasn't paid much attention to. Any time I had a question they were very blunt, answered my question then would walk away. The bartender was more concerned about socializing with regulars than ensuring that a new customer was comfortable enough to come back. Food was decent but with that service I would rather go somewhere nicer."}
{"text":"Our burger was over cooked. The waitress apparently did not like that we shared our meal as she kind of threw our silverware in our direction. We had to ask to get the water refilled. We did not get asked if we wished to get a second beer or if we wanted anything else. The noise level was very high and it was difficult for us to hear each other."}
{"text":"Ehhhh.  I'm here for business and this place is ok at best.  They had a pretty cool atmosphere with live music, but here are my issues...
- the tv's are few and small.  I was hoping to watch a little bit of sport while and for a pub they really did not serve that up well.  Yes one TV was a cathode ray tube based set.  Sweet!
- they had a less than impressive beer selection
- the fish & chips were sub par, and the fries were a bit soggy.  Given I only can comment on this as it's all I had there.

I feel this place can do much better w/ a few relatively minor tweeks."}
{"text":"Good food, many dishes to pick from, like the Guinness pie, wraps are good too. Hit and miss with the music selection, Dj not always great."}
{"text":"I'm picky about food and I eat here. 

The food is better than most bars. The fish and chips is a good choice. I haven't had anything bad here. 

Beer wise there is nothing new here. It's the same old domestic stuff with a few different things thrown in. 

The patio is always nice. 

They often have live music. It's very fun. My only complaint is the music is way too loud for such a small place."}
{"text":"Ordered a steak, medium. Got a an overcooked piece, 1/3 fat! 

They waisted 8 minutes of my time to give me a disrespectful $1.60 discount , that i never asked for!!"}
{"text":"Walking distance from hotel but worth the trip, live music, Guinness was just ok but homemade soup and pizza were very good. The pizza sold out which I think is a good sign. Bar tender was very good, def worth a stop if in the area"}
{"text":"I have been here twice in hopes my first visit was just a bad fluke and my second would show that this is a great place to eat. It didn't work out and it's not a great place to eat.

Both times the food was mediocre. Example: I ordered a pulled pork sandwich. It was dry and not flavorful. there was very little sauce on it. What made it worst to the point I lost my appetite completely was there was a massive fat ball in the middle of it. 

I was so grossed out I couldn't eat anymore.

Both my husband and friend who were with me also didn't like their dishes (burger with fries and pasta).

The overall space of the restaurant is not well thought out. Its very tight and uncomfortable. I know they want to have lots of seats for customers but its to the point you cant even walk to the bathroom without bumping into someone or a chair.

They should have kept to the booth design at least that way there would be walking room for customers and servers.

The live music would be nice to hear but both times they had different bands that seems to play way to loud for the space they are in. You cant even talk to the person your are sitting beside because it is so loud. 

Oddly enough you cant really hear the person singing the band is playing that loud, just so you have an understanding of the level of noise.

Overall I will not be going back and I wouldn't recommend it to anyone.
Which is sad because this place had potential."}
{"text":"Do not go here for dinner. Fruit flies everywhere. Burger was burnt and overdone and missing cheese. They fixed it but it was still overdone. Never asked if it was ok. Nice that they gave us 10% off for those staying at a local hotel but did they really need to charge a buck for extra 1 ounce salsa?  Never heard of such a policy."}
{"text":"Would not recommend. Place was dirty,  bartender was not really all that friendly. Seemed like it had its regular's that hung out there. Definitely did not get that warm and fuzzy feeling being in there. Once again pretty dirty inside"}
{"text":"Girlfriend wanted to try this place. Didn't think much of it.was a little surprised that the lot was almost empty and I he place too at 7.30 on a Saturday. 
Happily found l'abattage 50 on tap(my dad s fave) decided to order wings and was very happy I did. Tasty, hot, and a good portion. Good fries. Veggies were a little tired. Good service. Friendly. Good food. Will go again for sure. Will bring the daughters too."}
{"text":"So it was a Tuesday night, slow and maybe that is why it started poorly.  I walked in and sat at the bar, sat for ten minutes as several servers walked by without noticing me.  I wondered if the bar was self service.  Finally the bartender came around, she ended up doing ok, it took some time for her to warm up.  I hate sitting at a bar and having to ask for a menu, why is this not an automatic ask at all bars that serve food?!?!  Anyway, nice music,salmon was good, bartender got better(if only young people realized how easy it is to win people over with eye contact and a smile)...was a decent Tuesday night experience."}
{"text":"Good spot, bad lighting!

Good live music, food and drink. But why so bright?  It's like being in a cafeteria. Irish bars should be dark and a bit shady. The lighting was so bright I couldn't stay. Felt like I was under a spotlight.

Owners please turn down the lights and watch people stay longer to enjoy the space!"}
{"text":"I am not a local,and was in toronto on business. I was looking for something  close to the Hampton airport centre. I am pleased  to report, I discovered  a true gem. This place is awesome by any measure. The food was flavorful and creative - A reflection  of the talented chef that prepared  such an amazing dish. The great food, coupled with a full bar selection made the evening memorable. The bartender/waitress, was plesamt and attendant. More importantly, the kitxhen is open until MIDNIGHT!  DON'T DRIVE BUY THIS PLACE WITHOUT STOPP9NG BY. Old reviews need to be discarded in your analysis. Great vibe."}
{"text":"Wow the second best thing about this place was the Kilkenny the best thing was leaving. I ordered the pork tenderlion @5:30 and they did not have it. So I ordered the brisket. It was days old, dry, chewy and not a good flavour. The mashed potatoes had some sort of kale but looked and tasted like grape leaves to me. Would not return."}
{"text":"We stop at this Irish pub on our way to Toronto airport, it's located in business park close to airport, we tried their onion soups which was amazing followed by pizzas, Great Irish pub with great service.
Our waitress Amanda was truly genuine Irish girl with Beautiful smile. We highly recommend this place, just ask for Amanda to serve you."}
{"text":"Service is less than average. Had to get myself a menue, after asking for one and never got it. Quick to get you drinks but had to wave to get attention so the server could come get my food order. Don't go there if you look for a meal, go there if you want drinks I guess."}
{"text":"Drinks are okay, the wins are not that great. Ambient os Kay for local waterhole!

Recommend this place!'"}
{"text":"This place is absolutely average. You won't find a great selection of beers, just the big brands. The food is pub mediocrity but a lot of people like that. All that said, it's exactly what I expected."}
{"text":"This is my go to bar in Mississauga where I work.  It's funny cause it's not rocket science why. Most bars have a patio in the summer (duh).  But some of the bars on the same street have patios that face north west (ie no sun after 2pm).  The Irish Shebeen faces south west, so it's perfect for after work. 

The one thing I don't really like about the place is the fact that they don't really have daily specials. Everyone likes deals... Why can't you offer any?

I've only had the wings here, and they were decent. I can't really comment on the on the other food though."}
{"text":"So this place was a Honey's Beestro, then it was some crap pasta bar briefly. Now it's a good Irish pub.

I came for drinks with some co-workers on a Friday after work. The place is pretty nice. Fully renovated with exposed brick on most of the walls. The space is broken up into a few areas so you could easily have a private function and be separated from the rest of the bar.

The beer selection isn't super great. Keith's, Stella, etc. on tap. It would be nice if there was a little more variety. The food is pretty standard pub fair. We ordered some appetizers which consisted of chicken wings and a mixed plate. The plate had jalapeño poppers, mozza sticks, potato skins, cheese toast, and spring rolls. The wings were good, the mixed plate was a little hit and miss. Hit: potato skins. Miss: jalapeño poppers.

Our server was great to begin with but as we stopped ordering refills of our beers she soon forgot about us. She disappeared right when we were looking to clear up our tab.

Overall I would come here again as it is a better option than most of the bars in the area. Unless you live or work in the area though, there's no reason to make a special trip to check this place out."}
{"text":"We loved the seared Salmon! The apple crumble was the best dessert I have had in many years. We loved the service and it was a fun spot. Check it out!"}
{"text":"This place is disgustingly bad.

Arrived at the door, sign says way for server.  No hostess simply waitresses gathering drinks at the bar right beside the door.

Walk over and sit at the bar, worst layout possible, their beer taps are right in front blocking all visual lines between the bartenders and patrons.  Eventually dude comes over, clearly he hates his job by the tone and lack of interest.   I order a Jack Daniels,  couple minutes later he comes back, they are out of Jack,  WTF it's 6:30pm how do you not have a very common premium liquor.  

As I'm trying to see what else IS available (did I mention you have to crouch down and look between the taps?) He's growing increasingly more impatient.  I am clearly bothering his main task of grumbling to himself. 

Now for the truest discussing portion and the end of my time there.   I observed a waitress deliver 3 dishes of food to a table just down from me.  Confused she leaves with 1 of the plates back into the kitchen.  4 minutes pass and she emerges from the double doors with the original plate, makes her way back to the table and collects the apparently wrong servings.   She then wait for it, proceeds directly to another portion of the pub and drops off the plates.   Hello you just left unattended food for a duration of time with someone else.  Did they have a cold?  Flu?  Worse? 

No wonder people get sick these days from eating out.

I paid my tab (7.75 for a pint, and I thought sporting events charged high prices).  I then walked out never to return, unless of course I need to take a couple days off and want the stomach flu."}
{"text":"This was a business lunch with a very important client. We decided to stop here cause we had limited time & many places were full being lunch time.

I was wondering why the place was so empty for a workday lunch...now I know. To start with the tables were very sticky. In fact my shirt was sticking to them! I would have asked to wipe the table off but I had a feeling that this was a permanent stickiness. 

The food was Fish & Chip...how can one mess this one up. They did...I asked for crispy fries, they simply re-fried old fries & called them crispy. The fish was one of those preformed frozen patties that you get from a box. Nothing original or tasty. Our servery Kalie was pretty good. Too many restaurants around to waste your time on crappy food. I'd go somewhere else!"}
{"text":"The service was what stuck out to me after this visit. The place was really not busy at all (~10 tables) but we did see a lot of staff leaving throughout the night so it might've been understaffed. Our waitress was not very happy to be there, it seemed. When we asked for the drinks menu, she hesitated and said there was only one menu. Not to her own fault, but what kind of pub doesn't have a drinks menu? Again, it wasn't a be-all-end-all, but just sort of odd and had me thinking that this place is a little mismanaged. 

She finally did produce a drinks menu after a little bit of digging. It was pretty out of date - maybe 60% of what was listed was in stock. The waitress was not very informed about the menu or their drinks as well - think she mentioned a Stella was a domestic or something, but oh well, here's not the place to get fancy. Patio nice, the faint live music was pretty good although we were outside so we didn't get to experience it in totality. 

The food itself was fairly good; no one had any qualms with their dish. We ordered bruschetta, chicken fingers (noted as \"better than average\", fish and chips, Philly cheese steak, and a salmon wrap). The beers came slightly temperate unfortunately and the wait staff checked in on us very infrequently (pretty much every 45 minutes, and we even had to go in and find her). That was probably the worst part of the service, since we were waiting to take our drink orders and then our meals and then the next round for 30 minutes pretty much every time. 

One more thing will forever remain in my memory: their sangria (had the white) was amazing - the best I've ever had!!! I still dream about that sangria. I remember surreptitiously sniffing my empty glass after we were done... even the smell was intoxicating. It was absolutely perfect and I almost don't want to go back in case it was a fluke (unsurprising, given the nature of the restaurant). I'm giving +1 star for the sangria alone."}
{"text":"I am giving this pub 3.5 stars.

Way back in January 2015, I had a hectic time training a new employee and greeting to guests from Sweden at my workplace. During that first week, we all went to The Irish Shebeen, which is a short drive from the office, for lunch.

I like pub food. I always have. I don't know why.

I ordered bangers and mash. The bangers were tasty and done properly. The mash was wonderful in the gravy. I didn't like all the sauteed onions, though. There were too many for my liking. Still, the dish was yummy.

Service was speedy and pleasant. I need to return and sample other items on the menu. Hopefully, that will be sometime this year!

(60)"}
{"text":"I was looking for something close to my hotel and this place came up on yelp.  Not horrible and would have been 4 stars if they had wi-fi.  
It was decently busy when I was there and the servers and bartender acted as though they were slammed beyond belief.  Service was slow and the Bartendar had no idea what a \"stout\" beer was when I asked her if they had any.  I had the Shrimp appetizer, which was awesome and super spicy. 

Overall, I would come back.  Just wish they had wifi."}
{"text":"Not bad selection of draught beer. dessert surprisingly good. But Tv quality poor, especially for a sports bar!"}
{"text":"Clearly a softball place but the food was good and the Guiness better."}
{"text":"In town for business. Walked over to this place from my hotel. After a long day of travel I just wanted something good and quick. 

First, it took about 10 mins for anyone to acknowledge me at the door. There was only 2 ladies working and they were taking care of the entire place. The place was pretty full. 

I sat at the bar in hopes it would be quick. Not so much. The lady behind the bar was friendly, and when she was able to pay any attention to me, she did a great job. Unfortunately for her, she was the hostess, the bartender, the waitress, and running food from the kitchen. The other waitress had the same work load. 

It took about 15 mins to get my first drink and another 10 to place my meal order. Based on my experience to that point I kept it simple: a soup and sandwich. 

I ordered simple whiskey/coke and it was fine. More ice and soda than anything else, but hey, that happens in a lot of places. 

My soup was a French onion and the sandwich a Philly Cheesesteak. When it finally arrived (+/-30 min) it was gross. The soup had clearly been sitting reducing all day as it was more like nasty bread soaked in concentrated salt water with onions. The cheese on top was a half inch thick and cold. The biggest problem was the salt. Soooo salty. I couldn't eat it. I literally ate a spoonful and set it aside. 

The sandwich was allegedly a Philly Cheesesteak. Having been to Philadelphia many times, and eaten countless of these, I can tell you it was anything but that. The beef was thick and cold, the cheese was Swiss and the onions and peppers were raw. The promised mushrooms never arrived, and it was absolutely flavorless. Not pretty either with the insides and oil pouring out the sides. 

Against my better judgement, I ate it cause I was starving, a  decision I would regret. The next morning I was so sick to my stomach. Really bad. 

Probably the worse part was an extremely drunk woman sitting at the bar. I guess she worked there since she knew all the staff, especially the cook (yes, the cook was sitting at the bar, which probably explains the food), and she walked in and out of the kitchen several times. This women was absolutely blasted. She kept messing with patrons and slurring her words. She was upsetting one guy at the bar when she kept making fun of his rings. I was so put off that I asked my check and left. 

Overall, the waitress and bartender were nice, but clearly overwhelmed. The food was disgusting, service slow, and the dunk employee and her cook friend were an embarrassment. It was kind of a \"Ramsey Gordon: Kitchen Nightmares\" experience, to be honest. 

Won't be going back."}
{"text":"Just went here for a quick lunch run with a friend. Thought I should east a bit healthy this time and I got a mediterranean pizza sans olives.

Their pizza is quite good, but does not have as much herbs and spices as Sorento's, but for $13 it is not too bad.

I've had their carnivore delight pizza and that one was better. They also had a chicken wrap, but that one is too much food for me at lunch time."}
{"text":"Irish pub in Toronto but they have scotch whisky. Their selection of Irish whisky is decent.  Overalll interior is like you are in Ireland with great large tables and stools to sit on.   Service was fast and how can you not love whisky in the afternoon."}
{"text":"I'm not sure if the waitress was having a bad day or not but she was not very welcoming when my friends and I came in. We wanted to sit on the patio since they had the A/C blasting inside and asked her to seat us as there was no hostess. Her demeanor was not very nice. She seemed very rushed. My friends and I weren't impressed with her. We sat down and I asked for a drink list and she didn't want to give me the list. I am a visual person and like to read menus or see pictures. She just asked if I wanted wine or something like that. I just chose a pinot grigio.

We got wings, fries, and chicken strips. They were all pretty tasty. Wings were done well and were decently sized.

As we were leaving when we were done we saw that the drink menu was at the POS station right by the door... She could have just brought it for me. It would not have impeded her by any means.

I probably wouldn't come back here on my own free will."}
