{"text":"Just had lunch here. Potato vegetable soup, hummus with house made flat bread and the local cheddar bake. Friggin outstanding! Loved every bit of it. Vegan and gluten free options available . You should eat here. Really."}
{"text":"This is my absolute favorite café ever! I wish I lived closer to Lakewood - I would go all the time! I LOOOVE the espresso drinks here! Also - I love the vibe of Root - it's warm and welcoming."}
{"text":"A good place to try if you are looking for something a little different. Yes, most of the people who frequent have a hippy vibe and you feel that when you walk in but everything in this place is delicious. Most of the food is vegetarian/vegan but it is high quality and I have never had anything to complain about. The coffee is amazing (but a bit expensive) and the inside is large enough that you can grab a table and hang out for awhile. I suggest to all of my friends to give it a try before passing judgement."}
{"text":"I LOVED the Root Cafe (apparently so does everyone else, because it was packed on a weekday afternoon). The food was delicious, and we tried a ton: vegan burritos, several sandwiches, salad, smoothie, and a fantastic white bean soup. Everything was flavorful and nicely seasoned (you do have to like sweet potatoes, which seemed to be in everything; luckily we do). Service was moderately slow, but that was understandable given the big crowd. It was also moderately pricey but again, we had a lot of food, and portions were generous. We even tried four of the sides: red potatoes, sweet potatoes, cabbage salad, and beets. You know it's good if your not super adventurous husband tries the cabbage salad (weirdly, he is NOT a cabbage fan, but wanted to try something different) and your teenage son tries the beets (and same - not a huge beet fan, but wanted to try something different). They both ate every bite of their sides (the sweet potatoes I ordered were very good, but a lot for a side). If we had been in the area longer, we absolutely would have gone back. It was fantastic and I highly recommend!"}
{"text":"I don't really like the staff here. They aren't that nice , and some are just not good communicators. The food is okay and is overpriced for the quality. They almost refused to serve me a medium sized cold brew, telling me its too strong to serve a medium, until I reassured them I drink iced toddy regularly. Parking sucks too. I'm just kind of let down by the place."}
{"text":"When I mentioned to friends that I had lunch at the Root Cafe most didn't even know that they served food. It must be known for it's coffee because the food was terrible.  I had the tomato bisque which tasted like someone took Ragu sauce out of the fridge and poured it into a bowl. It was cold and bland. The roasted potatoes were dry and inedible. We also had a salad that was way too sweet with way too much sauce. I couldn't even finish my food, that's how bad it was."}
{"text":"If your a Vegan, a Vegetarian, or just enjoy locally grown healthy and organic food you'll love this place as much as I do.  When I eat out I'm always looking for something different or unusual, rest assured this is something different. I've been here about 4 times, usually on Friday nights.   One dish that I've had twice is the Burrooto which is house beans & rice with root vegetables and sharp cheddar cheese in a whole wheat tortilla with cream infused garlic enchilada sauce. The wheat tortilla is grilled giving this an extra level of taste. The carrots are still a little \"Al dente\" which reminds me of eating a meat burrito. I have to remind myself there is no meat in these. So if you're really hungry this will hit the spot even for you meat eaters.  I've also tried the stone oven pizza, vegetable pot pie, and some of the Bakery items which were great also.   Ok a little comment about the entertainment. I'll just say it's odd, different, quirky, and entertaining. I will make one exception to what I just said, poetry night is NOT for kids! It is adult themed and NOT appropriate for children. Before you take your child here on a Friday night check the web site don't make the mistake I did and bring your 13 year old daughter.   Over all this is a great place to eat or listen to the entertainment."}
{"text":"I stumbled across this place right after flying in from Jersey and boy was I Happy!!! I had the Vegan Power Bowl and it was absolutely DELICIOUS. The blend of the vegetables and the sauce was nothing short of miraculous.   The team there was friendly and efficient & the atmosphere was artsy and relaxing. I may be back to tonight, good Vegan food is hard to find!"}
{"text":"This is my favorite place to get a healthy bite to eat and a cup of coffee or tea. The staff is always warm and inviting. The food and baked goods are so delicious that you can't believe that they are vegetarian, vegan and or gluten free!  My recommendations are their detox tea, any one of their scones, and the Square Root Calzone or Vegetable sandwich. No matter what you choose you can't go wrong at The Root."}
{"text":"Some of the best huevos rancheros I've ever had...great, friendly atmosphere.  Perfect Sunday brunch:)"}
{"text":"I live in Lakewood part of the time and used to patronize the Phoenix.  The Phoenix has now morphed into the Root Cafe, located two doors from the old Phoenix location and in a bigger space.  Even though I liked the Phoenix, the Root is a significant improvement because:  1)  The larger space is much more comfortable than the old Phoenix, which had almost no room for live musicians and often made you feel like you were sitting in your neighbor's lap - I usually ended up getting my coffee \"to go\".  The new place has more room to sit, more wall space to display art, more room for a stage on which live music takes place a couple times a week, and more space for waiting at the counter and deciding what you want.   2)  The new location of the Root, which takes up two storefronts and is proximious to the lawn of another building going around the corner, provides more parking options (since you can park on the side street and have an easy walk round the corner to the place) and also has eased some of the congestion caused by people wanting to hang out, smoke, etc. in front of the building.  I am not against kids hanging out in front of coffee shops or people smoking outside them - in fact, I tend to regard hanger-outers as the sign of a good coffee shop.  However, the previous location mid-block only had a small space for these folks to congregate and at times, trying to get into the store for your coffee was like pushing through a concert crowd.    The Root serves all the same great coffee and even some beer.  It's very awesome to be able to have a beer without needing to be in either a noisy bar (Lakewood already has about 125215 bars) or a sit-down restaurant.  I understand there is also more food available, though I have yet to try it.    My only complaint is that on show nights, they should find some way to allow the people who are truly interested in the music to sit or stand closer to the stage.  It's disconcerting to go down there specifically to see your friend play and find every table occupied by people who are chatting with friends or using the wi-fi to check their Facebooks and seemingly couldn't care less about the musician playing a set, while the 5-15 people who stopped by specifically to see the music show have to sit way in the back because there isn't any place closer."}
{"text":"Awesome cafe, great atmosphere, and INCREDIBLE food! As a gluten free vegan, I ordered the Root Wrap and I love it! I will definitely be back again. It's so warm and tasty, with a little bit of spiciness too! The Kale Chips are also outstanding and made in house. I ordered an almond milk latte as well, which included their handmade almond milk (definitely worth the extra money). For dessert I has a Lemon Ginger scone which was light and crumbly and soooooo tasty! I'm glad this cafe is in Cleveland and I can come in for this amazing food anytime! :)"}
{"text":"I can only go to The Root on days that I have off or weekends when I have time to putz around, but I have to say that they make the PERFECT dirty chai for me each and every time. It is just the right temperature to start drinking, beautiful and tasty. I also feel like I'm back in Berkeley when I go, and I miss Berkeley terribly. Thanks rooties!"}
{"text":"Everything about The Root is excellent.  Local and organic high quality ingredients and surprising inexpensive. Staff is always friendly.  Also, a very nice atmosphere.  One of my favorite places."}
{"text":"We love the cozy atmosphere.  The staff is very friendly and helpful.  We split beans and rice, very tasty!  We also split a Fun-Guy pizza.  We loved it!  We are going to be there a lot in the future!"}
{"text":"I just love the root. For breakfast or dinner. Delicious coffee and super delicious smoothies.  The ooooonnnlllyyyyyy thing that I don't like is the dirty spoon container right next to the clean spoon container in the coffee prep area. I feel like that shouldn't be there. Other than that-5 stars for you, Root!!!"}
{"text":"Delicious vegetarian fare. Great place to hang out and people watch."}
{"text":"i love the root cafe!!!! best place in lakewood hands down. fresh vegan delicious + awesome atmosphere. friendly folks working there, too. tons of kale + kombucha = you can't go wrong! good vibes all around. makes me feel like i'm back in calfornia! LOVE IT! thank you for being in lakewood!"}
{"text":"My favorite place to get great food and coffee. Wonderful staff. Awesome variety with menu items so go often and don't be afraid to try new things. Best selection of gluten free cookies around although I'm addicted to Marc's Cookies sold there. Proud to be a regular!"}
{"text":"In a world where quality takes a backseat to cost and convenience, The Root Cafe stands above the crowd. Organic/Local produce, Local flour's, Direct/Fair Trade Coffee, Gluten Free options, appropriately sweetened bakery, wholesome Raw fare and a capable and friendly staff to metaphorically massage your daily woes. (Actual Massages sometimes offered by a earnest fella in a purple jumpsuit. ) The Root has plenty to offer at a fair price. Get free. Support places that give a damn. I dare you."}
{"text":"Hands down the Root has the best vegan menu in Cleveland. Amazing vegan and gluten free bakery, knowledgable and friendly baristas, killer daily specials, and chef created soups that rotate almost daily. This slow food cafe and coffee house is an excellent place to study during the day or to enjoy local music and conversation almost every night of the week. This is a local business that truly strives to keep it local sourcing their produce and essentially every product they can locally. It's an incredibly welcoming atmosphere and the owners are incredibly involved in the business even picking up both barista and kitchen shifts on a weekly basis. If you are visiting Cleveland, make the trip to Lakewood it is well worth it. Thursday night is raw night which entails a new menu each week that is completely raw, vegan, and gluten free. Menu highlights: sweet potatoes with a side of house made chipotle aioli, the fun guy pizza, and the sunburst salad. Beverage highlights: Mayan mocha and any of their crafted herbal tea blends. Ps: house made almond mylk is a dairy alternative and it is TAY-STEE."}
{"text":"Not gonna lie to you, I basically live here. If my friends and I are bored, we usually end up at the Root. The ambiance is ideal and we fit in very well. I frequently run into more friends there because it is such an ideal hangout spot. Some other friends even work here.   The atmosphere is so great. There's usually music droning above you at a comfortable volume high above you. The place is decorated to be a shabby chic. The tables look like they came straight out of a forest. The biggest wall is decorated with local artists' works that you can purchase. There's usually plenty of table space, but sometimes so many people are here (it's gaining popularity with a variety of crowds) that table space is hard to come by. However, if worse comes to worst, look for people who are willing to share their table with you. Maybe you can score the awkward table by the bathrooms.   The coffee is fantastic. The coffee is very well liked in the area. I frequently get a black and tan and it's very easy to drink. Their black coffee is fantastic, too. The Root has a lot of presence in the community and frequently donates coffee to local events. It's plenty strong and best of all, organic. There's plenty of vegetarian or vegan dishes available to complement your hot beverage. The pastries are so good, I nearly married them. If I ever get a meal at the Root, I like to split one of their pizzas with someone. It's amazing what comes out of that kitchen.  The staff is very friendly and very knowledgeable about the menu and the providers of the food. The owner of the cafe is characteristic of Lakewood and the cafe as heavily ingrained itself into the community. I love it here, and I can't complain about anything. It's exactly the kind of place I like to spend a lot of time at.   Do go during their events such as Open Mic Night, and do go during the lunch rush to see the Root in full swing, but it's really great to go during their off hours. You can get yourself the table of your choice and the atmosphere is at its calmest. Always a great time!"}
{"text":"I don't understand how The Root Cafe isn't more packed all the time--I love this place. It's sunny, homey, and fun, and their menu is always full of delicious, vegetable-heavy foods. From their sides (which can be as inexpensive as $1.50) like beets with basil and roasted sweet potato to their pizzas and sandwiches, everything is wholesome and incorporates fresh combinations of flavor. I haven't tried any of their baked goods, but they always look picturesque behind the counter.  The people at The Root make the atmosphere so comfortable. I've seen the owners' children there several times, and when they're playing in the cafe it feels like you're in someone's home (but in a good way--the children are well-behaved and charming). And I love that they have discounted pizza (the good kind) and beer for cyclists on Wednesdays; really, how could a cafe be more wonderful?"}
{"text":"Ambiance is welcoming, coffee is fair trade, food is FANTASTIC, and desserts are balanced and so very delicious. Vegetables are locally farmed, ingredients are FRESH,  and the staff is friendly. This place is a must try."}
{"text":"Coffee: I usually get the tall, rich, smooth, and dark (kind of like the type of men I like---I'm joking)  I only drink black so I can't give inputs on the other choices.  Oh, they also serve craft style beers, organic tea & tisanes.   Foods: It's a vegetarian haven. Love the \"roasted, baked & toasted\" sandwich---consist of: roasted zucchini, portabella, eggplants, hummus, and melted sharp cheddar. A hint of lemon and strong rosemary flavor between two slices of toasted bread. Do try the sunburst salad!  Local & organic  Atmosphere: they play pretty awesome indie-punk-rockish kind of music, a little too loud; this isn't B&N. It varies from young to old hippie-sh carefree attitude, yoga loving, weed smoking crowd---ok I made that last part up but I did eavesdrop on a yoga conversation. It's not my fault the tables were too close.   Overall: There's a creative energy that works for me. I don't go here when I'm in the mood for Bach.   Note: This is one of my spots; may be somewhat of a bias review."}
{"text":"I drive back to Cleveland every summer and I start thinking about the Tempe sandwich about 10 min after I cross the Ohio State line. I have been fortunate to sample Vegan/Veg fare all over the country and the Root remains at the top of my list!!!"}
{"text":"Cozy place with nice vegetarian/vegan options. Very poor service. My wife and I ordered food, and only her order came out. Five minutes later when I asked after my order they said it didn't print out in the kitchen and wasn't made. No apology or offer of refund or anything. I've worked in restaurants and know that the ball gets dropped from time to time, but at least apologize and, better yet, offer to compensate the customer."}
{"text":"This place is amazing everytime I go. Coffee to die for with homemade syrups. Great salads and I love the balanced equation calzone. I love that they support locally and make everything fresh in house!"}
{"text":"Went in for Sunday brunch and ordered the huevos rancheros, basically eggs with rice and beans.  It was awful!  It came with 2 eggs that look as if they had been cooked sunny side up.  However, they were slightly cold, and tasted like plastic.  It was if they cook the eggs the day before and heated them up in the microwave. They tasted like plastic.  I could not eat them they were so bad.  It is hard to mess up a fresh cooked egg, but these were not fresh cooked.    Then the rice and beans were lacking in any flavor.  I asked if they had any salsa, thinking I could salvage my lunch by adding some flavor, but they did not have any.   All in all, it was one of the worst meals I have had.  I was very disappointed, because I have heard such good things about this place and all the other reviews were so glowing."}
{"text":"Overpriced food that was rather bland. We got the pizza, soup, tea and kombucha. Will not be coming back, you could make this at home for better quality and price and taste!!"}
{"text":"I was a little skeptical of this place at first since I'm not a religious vegetarian/vegan, but I have to admit, this place is pretty darn good.   I knocked off a star because sometimes service is a little slow, and the folks taking orders don't always appear enthused to be there...but the food is really good.  I've gotten the (giant) calzone, which was incredible, and the burrooto--cute name and very delicious. I believe they make most things from scratch, so bonus points for them!"}
{"text":"First time there today.  Casual. Simple. Anyplace with beet and orange salad deserves high marks in my book.  Young and old enjoy this lively place. From a green perspective, excelent- with the exception of having too many light on. Also great espresso and beautiful coffees with fancy heart on top."}
{"text":"Great coffee, excellent vegetarian food and the best scones! I don't usually like scones, but their savory scones are wonderful! Lots of food and bakery options for vegans also.  I've ordered from the menu and had specials and have never had any bad food here.  A nice place to work on projects, with reliable Wi-fi and good lighting. Diverse crowd of various ages and ethnic groups, both as customers and employees. I love this place."}
{"text":"been here three times now - each dish I ordered delivered interesting combinations of flavors and ingredients - it is clear that a very gifted chef is at the helm here!! And the bread is fresh-baked, and wholesome. A real winner! I will enjoy many repeat visits - and my 20-yr-old could happily live here!  Ambiance is very casual, local, folksy and music abounds!"}
{"text":"What great food and staff! The atmosphere is nice. Yes there is a definite hipster vibe but take things for what they should be, good food, great coffee, and chill atmosphere. The root hash was out of this world!"}
{"text":"Incredible veg/vegan food spot! We split the sweet potato Sammy and the local cheddar bake and both were wonderful! That atmosphere is adorable and I'd come back again and again to try all of their sandwiches and breakfast options. They also had unique kombucha  flavors and yummy sweet treats!"}
{"text":"Amazing scones. Great coffee and friendly faces. Great for a quick cup before work or hanging out to read or play a game with friends."}
{"text":"I'm not vegan, but this place is still good to help with those morning hangovers. Excellent coffee and breakfast and worth the price if you're looking to upscale from MCDs."}
{"text":"Great food & superb coffee in a cafe with a nice vibe.  Kind of funny--as we were leaving, some people passing by were complaining about all the \"hippie places\" popping up. Whatever. I'm not into some of the trends like raw food, either, but I do love fresh vegetables and whole grains! I enjoyed the On the Road sandwich with sweet red beets, goat cheese and onion. Coffee was rich and smooth. Not from Cleveland, my family and I enjoyed the Lakewood neigborhood. It's pretty convenient to I-90, if you'd like to take a break for an hour (or two)."}
{"text":"No place to sit! this due to the number at the table doing wi-fi not eating. The food was ok not great and the service simply waiting in line and ordering. Not for the casual dinner since no effort made to provide seating.  We will not return. We were there about an hour and not one table was either cleared or cleaned."}
{"text":"oh no.. went to the root for another pizza and it was just not the same, at all.  not sure if they started out full of fire but it looks like they have cut back in a big way.  the first pizza that i had was covered with big veggie chunks and this one had a very small amount and was mostly sauce.. not sure i will be going back for awhile.  hope they get some feedback and stick to the original pizza plan."}
{"text":"The owners are wonderful people. I used to patronize the Lakewood Phoenix, owned & managed by the same person. They go out of their way to create a welcoming environment for everyone (except maybe people who would try to disrupt that). I love their food & the simple ingredients. A couple years ago, I got sick of the the same menu (before they changed it up a little), but then I realized the baristas & kitchen staff are really nice & will put up with me modifying things a little so, that hasn't happened since then. Sometimes I feel bad, but it seems like they really want to make what you want. They also have a lot of different daily specials & have added vegan cashew cheese & regular raw items in the last 12-18 months. The baked goods are usually pretty solid and sometimes absolutely amazing w/ tons of gluten free & some lower sugar options. They use/ sell Rising Star & other local coffee."}
{"text":"I went in here based on the great reviews. I'll give it a strong MEH... The coffee was nearly tasteless, and I had to add sugar like you do with bad hotel coffee. I had the Wet Burrito for lunch. The sauce was WONDERFUL, I'll have to say, however, the beans and rice interior didn't seem to be seasoned at all, and was very dry. The overall effect was not tasty, and the portion was too big for me to eat, even if I had wanted to. The atmosphere inside was great, just what I like in a cafe: old building, high ceilings, and very large and hospitable. The staff were very nice. There is a large selection of pastry items in the counter by the cash register. However,  based on this experience, I probably won't be back to try them."}
{"text":"This place is great! The coffee is amazing. BUT they need to learn how to hustle. I've heard alot of people complain about this and I've also seen people leave multiple times. All and all a great cafe!"}
{"text":"If the idea of vegan/gluten-free/no-oil muffins and locally roasted coffee beans appeals to you, then you will absolutely love this place. There is a fabulous selection of organic, locally sourced meals that appeal to pretty much every kind of foodie.   If that doesn't appeal to you, then there's a chicken wing place down the street. ;)"}
{"text":"I was so happy to have found this place and now I go about three times a week. The menu is healthy and diverse, always some unique dish, especially on raw food night. Coffee is great, the people that work there seem to enjoy it and each other's company. If they have music playing it is never loud or obnoxious so its a good place to get work done or meet with friends. I hear they have live music some nights (with a banjo!) -- I'll need to go back for that. Overall, couldn't be better."}
{"text":"High vibrational food, beverages, atmosphere and staff. I can't wait to return! The root wrap came highly recommended and I was pleasantly surprised that it was warm. Yum!"}
{"text":"For those with a hipster deficiency, you can take care of your credentials at The Root.   Unlike the old Phoenix, there are waaaaayyy fewer wayward \"Taco Bell Gang Teens\" hanging out.   I love that this local coffee house is always packed with Lakewood's literati.     I've only had coffee here, but the bakery case will wear me down one of these days.  Open Mike Night on Tuesdays = fun stuff.  Get your guitar and come on down."}
{"text":"I had one of their antioxidant smoothies no. 4 {whole ginger, pineapple apple, strawberry + detox 1 & hubs had one of their Plant Fix juices no. 8 {spinach, kale, pear, lemon + ginger. Juice was good, mild in flavor. Smoothie was excellent but wished mine was served in a glass bottle as I am not a fan of the plastic cup/straw mine was served in."}
{"text":"So this one time, I tried to go to Melt...they had a 2 hour wait...so with the only iPhone in the group out of commission due to a dead battery...our only real option was wandering to see what else was in the neighborhood...  And that's how we ended up at Root...an accident, but a blissful one at that. When you walk in the door, it just smells organic..you know, that tantalizing aroma of coffee and tea and something herbal (no not THAT!)  The service is a bit quirky, when you order you get a stack o plates and an ice water for each member, oh and forks, and a little table sign so they can deliver your food to the table when it's ready. So you'll have a handful of stuff to take to your table but really not a big deal  Fresh squeezed lemonade...Very good! It's more tart than sweet...which in my opinion is perfect.  I had the #3 sandwich...crusty wheat bread topped with hummus, sharp cheddar and nice big hunks of roasted veggies (squash, eggplant, zucchini)...very tasty and a good portion for only $4.50!  Friend #1 got the #1 sandwich...roasted tomato, sharp cheddar and pesto. She really enjoyed it, and also got roasted potatoes for about $2 extra (no side is included with sandwiches)  The Best Friend got the same sandwich as me, but they forgot to bring it out with the rest..it eventually came after we asked about it, and she loved it  Friend #2 got the String Theory calzone..it was whole wheat and he was not thrilled about the crust (he's a whole wheat bread guy but likes white crust/pasta ) he said the filling was really good...and from the bite I swiped I agree!  The \"troubadours of divine bliss\" trio were playing live folk music, and the back courtyard hosted a rummage sale (scored a viewmaster for $5! Yeah!) which is something they said they plan to do on occasional weekends. If I'm in the neighborhood again, I might just skip Melt and go here instead!"}
{"text":"the Root Cafe has constantly given me good service and good food. The staff is usually pretty friendly too. Lots of seating too. Their veggie soup is very good!"}
{"text":"So far I have been here twice and was not disappointed. The coffee is as good as Erie Coffee, and the food is healthy. Any of the Pizzas sound tasty, so I had to have the Fun Guy Pizza, and I enjoyed it thoroughly. Even the crust is tasty. The Sunburst salad is very satisfying and could be a dinner itself.  I am a raw food chef, so I want to find the time to go here on a Thursday night   I live 40 miles away and I will be back for more."}
{"text":"Amazing coffee. Fantastic lattes. Delicious breakfasts. Crazy amazing sandwiches and lunch items. I wish we had one of these places in my town!"}
{"text":"I've been coming here since it was called The Phoenix, and I will never stop loving it. The place has definitely improved in the last few years and gets a good amount of business from all types of people. One reason I really love The Root over other cafes in the area is that it is very welcoming and comfortable. I can spend a couple of hours there reading, writing, or working on my computer, and I never feel like the staff wants me to leave for being there too long. The staff is also very friendly / adorable, and I've never had a bad service experience as far as I can remember.   The coffee is delicious. Its the kind of coffee that you want to drink black with maybe a splash of flavor. I usually order a hot coffee with vanilla. Not expensive, and good for the price. I'm not a very adventurous coffee drinker, so I can't tell you about many of their other drinks, but their Mexican Cocoa is to die for. It's been on the menu for a while, and I finally decided to try it a few weeks ago, and now I'm hooked. It's a good alternative to caffeine if you're just trying to relax.   The food is also fantastic. My favorite on the menu is the \"Roasted Baked and Toasted\" sandwich, along with the \"On The Road\" sandwich. Definitely worth trying both of them. Their pizzas are also pretty good. Also, if you like molasses cookies, I recommend you try theirs. Sometimes they will have them on display with their baked goods. Holy s**t they are delicious.   The only negative thing I have to say about The Root is that it's a little pricey. I get it, though - their ingredients are organic and come from local farms....so that's cool....but I'm a poor post-grad, so eating a meal there is definitely a little splurge for me."}
{"text":"I think it is quite possible that I am not cool enough for this place, but the food is so gol darn good I'll keep going back. And it's super cozy on a rainy day. In the meantime, I'll work on my slouch, swagger and lopsided grin. I was going to put a smiley face right here to signal the end of my review, but that would be so not cool. peace out."}
{"text":"I know it seems that I give every place a 5 star, but I've been horrible about actually reviewing places, so I'm starting w/ all my faves.  I adore The Root Cafe.  Those adorable, sanitary, art/books/games lovin hippies!  The food:  yum.  I've had some chick pea salad concoction w/ feta cheese on it, & a cheese pizza.  I loved the chick pea salad thing.  Need to try more of their food, but have heard good things.  Esp about the cookies.  Now I really want a cookie.  The drinks:  They have a decent beer selection, so you can take your beer snob friends there.  I love their coffees & ice teas.  The coffee is SO GOOD.  It's never over roasted or bitter or gross.  Always perfect.  I went on a hot summer day once & got some weird concoction.  I think it was ice tea w/ some lemonade & a shot of something in it.  I forget what the shot was, & I'll update when I think of it.  It was like \"maytay\" or something, def started w/ an \"m\" & they said the FDA classified it as a stimulant b/c it has caffeine or the same effect as caffeine or something like that.  Anyway, it was smooth, not too tart, not too sweet, just perfect.  The ppl:  The ppl who work there are absolute doll-babies.  They are friendly, helpful, & patient.  They are good at suggesting things, if you ask.  The patrons are a mix, but again friendly.  Everytime I've gone, I've met some random person there.  The atmosphere:  Every month, they display artwork from 1 or 2 local artists.  Obvs, the art's also for sale!  They have live music there & it's just a laid back place to hang out.  I've never taken Fernie (my laptop) there, but I hear they have wifi that's easy to connect to & fast."}
{"text":"DO NOT EAT HERE IF YOU HAVE A FOOD ALLERGY. Terrible service and RUDE staff. I have a nut allergy and attempted to order an egg and tomato sandwich. Like I do with every restaurant I eat at, I informed the barista of my allergy and asked if the sandwich was nut-free. She glared at me and proceeded to say she \"wasn't sure\". She then told me she would check if the bread was safe, but then seemed to remember all of a sudden that it didn't contain nuts and told me I was fine to order the sandwich. I thought nothing of it, trusting that if I took the responsibility of informing her of my allergy, that she would make sure it was safe.  Once my sandwich arrived at the table, I noticed the bread had some small things baked in it (which I figured were oats or some type of seed). I was about to take a bite, when I had a bad feeling that I was about to bite into bread filled with nuts. I walked up to the counter, only to be ignored for a good five minutes. Perhaps I wasn't worthy of their attention because I wasn't \"hipster\" enough. Once I got someone's attention, I nicely asked her if she could double check if the bread had nuts in it. She came back and told me that the bread did in fact contain nuts, and walked away. Nobody seemed to care that I had initially been lied to, and could have had a severe reaction or even died if I would have eaten this \"nut-free\" sandwich that I paid for."}
{"text":"The Root is a coffee house and vegetarian cafe located in a great little business district in Lakewood. It gets fairly busy on the weekends and you can expect to be jockeying others for the 2-3 tables that are not occupied by the hipsters permanently camped out with their headphones and laptops. (Sigh). My first visit here was divine!  During my second, however, the coffee was off somehow...it just had a strange taste and  I just couldn't do it. My tofu burrito was passable but in the boring side...it needed done kick."}
{"text":"The Root is a cozy little spot to grab a bite at, whether it be something for on the go or while you kick back to get some work done. One of my favorites in Lakewood, big bonus since it specializes in vegetarian and vegan eats."}
{"text":"I'm so excited to have found yet another great food establishment. The food is exceptional, with great spices and flavor, There are also fantastic desserts. I had a banana cake with blueberries and cranberry, it was moist and tasted great especially considering it was vegan and gluten free. The atmosphere was casual and relaxed. Wonderful place, I can't wait to visit again."}
{"text":"Food was quite good.  Had a savory stew/soup that had deep flavor and was very thick.  Would definitely eat that again.  Their toasted cheese sandwich is another winner which I would have again.  All in all, the food was quite good.  My friend had the same soup, but opted for the wrap instead of a sandwich.  She was very pleased.  The place is very informal and pretty much Lakewood chill.  The only thing that stops me from rating it higher is that the person we ordered from was not very knowledgeable.  Very polite, but a bit lost.  If you are gonna work in a place like Root you need to know things like whether the flour used in the breads is 'stripped' (bleached/enriched/bromated) or real."}
{"text":"I had really high hopes for a vegetarian safe haven in the midst if hearty Middle America.  But i was painfully dissappointed with this spot. The good: the ambiance, attitude, and a delicious iced chai. The bad: a fly in my dressing, \"roasted\" root veggies that were still hard, reheated bread that was still ice cold in the center, they brought the wrong soup, and it took 30 minutes to bring soup and a salad with no wait ahead of me.  Overall: Good concept.  Bad execution.  A solid 3 stars because the chai was fantastic, but the soup and salad were mediocre."}
{"text":"Yummy vegan hot chocolate and a nice place to chat or catch up with friends! The owner is super friendly and it's just adorable what they did there. A place I will definitely support :)"}
{"text":"Best coffee in town! Always packed. Cool bohemian atmosphere. Reminds me of Brady's in Kent before the corporate takeover. Great customer service. I even heard through the grapevine that Scarlett Johansen stopped in while shooting The Avengers in Cleveland (mush to my boyfriend's dismay he missed that sighting ;)"}
{"text":"Omgsh! I have been here plenty of times so I dig their food. The vibe and atmosphere is smooth and the staff are pretty cool as well. Ok so let's talk about the Vegan Lemon Poppy Seed Muffin... Absolutely delicious! I devoured it within mins but not before I snapped a pic. (Sshh the other side of the muffin is missing) it had a smooth flavor, not too sweet and the texture was great! I wanna call up and ask are they sure it's vegan because it is banging! I'm so tempted to go back and get another one but I will eat my Vegan Almond Sun Butter Cookie that I also picked up and behave... Kudos to the creator of this tasty treat! Same Day Update: I called to see if they had more of the delicious muffins and they did! I told them to put them aside for me and bought the last 4 they had. When I arrived they had the boxed up and ready to go for me!"}
{"text":"I'm a fan of root vegetables. This place uses plenty of them in their food. When I eat here, I don't feel guilty. Super healthy and tastes oh so good! They have plenty of gluten free and vegan options which is challenging to make tasty but they do an awesome job. This is a really cute place to hang out, journal or read too, has interesting decor. I came for lunch and ordered the root pizza, the coconut carrot lentil soup and the salad special, all which I would recommend and order again. I was sad that I didn't get to try the brunch options as those looked really tasty as well."}
{"text":"It's a vegan restaurant alright!   The whole serve-yourself and bust-your-own-table were something to get used to.  The food was tasty and presented well, it just was not delicious.  I would have like more explanation of a few of the dishes.  Who would have guessed the beans and rice would be serviced super spicy?  Two of the dishes were very spicy, even though nothing is mentioned on the menu about their spiciness and one dish was very bland.  The staff seems overly aloof, not engaging at all. I love the rustic, bohemian look and feel of the the place.  My sister who swears she is a vegan but sneaks a barbecue rib one in while, loves this place.  I overall thought the visit was interesting and nothing else.  I won't be back."}
{"text":"I know that around these parts, it's practically Yelp blasphemy to disagree with Amy T. However, Amy knows I love her. Anyway, the part about the Root Cafe that I disagree with Amy about is the coffee. I was not impressed. Blecch! I don't know what it is about it. It's bitter, for starters, and/or too strong. I don't like knowing what the coffee tastes like for an hour after I've drank it. Both times I threw out the cup before I finished.  To be fair, I haven't had the drip, just the espresso drinks. But both times I've had a latte, it just didn't measure up to what I've come to know as a great cup of coffee. Maybe it's my salt-of-the-earth, Dunkin' Donuts-loving upbringing, but this coffee was way too pretentious (as is the staff) for my liking. Every time I go in there, I feel like I'm going to get in trouble for not ordering correctly, or for not being \"green\" enough, or for not having ample studying materials, or what have you.  The food IS delicious. I just won't order coffee again."}
{"text":"Delicious breakfast and a great cup of coffee.  The energy bowl was generous and an amazing blend of spices and veggies.  My new go to restaurant in Lakewood."}
{"text":"I came into the cafe on a late Saturday afternoon. The place was pretty packed for the time of day, but feel like that's the case most of the time and I can see why. Very attentive staff and wonderful chill atmosphere. I only ordered the Root Wrap to go because I needed something quick, but it was SO GOOD! I need to get back there more often for the vibe and to try other things. I'm not even vegetarian/vegan but eat healthy most of the time so this place is definitely a spot to go to if you're into a healthy lifestyle."}
{"text":"Unexpected find in Lakewood.  On a mission for a Sunday afternoon lunch and my wife had been dying to give this place a shot...the food was surprisingly tasty!  My daughter and I decided to split a dish, and we chose the Quadratic Calzone.  It was full of fresh ingredients (mushrooms, spinach, broccoli, sauce, mozzarella cheese) and although the outside appeared charred it was actually quite moist and chewy inside.  The accompanying marinara dipping sauce was served cold, however (the only \"ding\" against the entire meal).  My wife settle on the Clevo sandwich which was nice as well...served open faced with hummus and sliced mushrooms (had an great earthy taste to it).  The small side salad that came with her sandwich had a wonderful bright / fresh dressing (which she took home it was so good).  Daughter and I finished off the meal with a chocolate chip cookie that was moist and not overly sweet.  Not a place I'm going to come back to over and over again (just because this is not really my style of food), but so glad we gave it a try and discovered a new option for us to add to the rotation while in the area."}
{"text":"I stop in here for a hot drink before my hair appointments over at Teased. They have a great tea selection and the best Mexican cocoa I've ever had. The place is honestly so hip it hurts, and the batistas don't seem to smile much, but I'm not exactly looking for an experience, I just want something tasty and warm. If you're into super organic and non GMO everything, this place is certainly for you. They have a pretty good looking food menu that I'll have to make a point to try sometime. But seriously... Get the Mexican cocoa."}
{"text":"The Root Cafe is more than a coffee shop. Their food is top notch, focusing on organic, locally sourced (when possible) ingredients, made fresh. The gent behind the counter was extremely helpful when I asked about the menu. He was more than willing to give the chef any special instructions, offering to change the dish any way I wanted. It turned out he didn't need to do that, but it made me feel very welcomed.   The interior is inspired, and inspiring. Whenever I think of the Root Cafe, the word \"rainforest\" pops into my head. Situated on the corner of a busy Lakewood intersection, the large picture windows overlook both a sidewalk, and a leafy church lawn. Some ivy even creeps up the side of the window. wrought iron is used throughout the space to create leafy, organic functioning structures, like branches that are actually stools. The Root Cafe serves Phoenix coffee and has live music often. They also serve beer!   Free wifi"}
{"text":"I have come to really love this place.  Great salads and pizzas. Love the Fun Guy mushroom pizza and the sunburst salad.    Almost anything baked good here is great too! Great laid back atmosphere! Check it out.  Feels like eating out of the garden."}
{"text":"Great vegetarian food. Love the rice and beans. They also brew Rising Star coffee which is amazing."}
{"text":"I think they are now serving Rising Star coffee instead of Phoenix coffee which is great.  But I secretly wish they would put a small stash of Splenda on the coffee bar for me to use in my coffee..."}
{"text":"I must preface my fair-and-balanced (and not at all biased) review by disclosing that my first memory is in a coffee shop. I was three, my dad and I were up and out of the house before my mom was even awake, and he was sipping black coffee and reading the paper. I was diving into a chocolate croissant and pretending to read the paper, because I was three. I think this makes me an authority on coffee shop ambiance.  The Root, formerly the Lakewood Phoenix two doors down, is the heart and soul of our community. I say that from a lot of personal experience. I practically lived my teenage Friday nights there, stunting my growth with copious amounts of mocha. Their coffee is incredible. I have tried every beverage on the menu, and never been disappointed. My top two are their black and tan (like a mocha but with a kick of espresso), and their mocha (the best I've ever had). The baristas are like a family, and many have been there for years. I've grown up with their faces and their expert barista-powers.  This establishment is committed to being environmentally friendly, with their ever-improving recyclable cups. They are a place where the community gathers together and celebrates great coffee: writers for the local newspaper doing interviews, my wedding quartet meeting with potential clients, open mike nights, folk music nights, bicycle enthusiast meetings, meetings of those interested in urban farming...the list goes on. On any given day, you will see people there reading philosophy, working on laptops, writing screenplays, and studying law, all fueled by a coffee that claims to cause \"unfettered optimism\" (it says so right on their compostable cup).  Their pizzas are fresh and delicious and made-to-order, with locally-sourced ingredients and innovative flavors. My recommendation is the Root pizza, covered in root vegetables and a wonderful house tomato sauce. Another great one is the Purple Haze, the pizza that taught me the miracle of roasted kale. It is piled atop the fresh, whole-wheat crust, and paired with a garlicky sauce.  ...why are you still reading this? If I have not convinced you to patronize the Root, you either:  (A) hate delicious coffee  (B) hate supporting local businesses  (C) are a spambot  Get thee to the Root, STAT!"}
{"text":"Worth the trip to Lakewood. Great food, great variety for vegan, vegetarians and all other eaters. Super local feel. I grew up  in Lakewood and now live in Chicago - I have yet to miss a chance to visit whenever I am in town. It's more than a coffee shop.   My only gripe is that the seating is often monopolized by a very intense, devoted group of domino players. I love that Root embraces the culture, but there is a fine line between being accommodating and letting guests take over."}
{"text":"Closest thing to a Cleveland Heights/Coventry type coffee shop on the west side.  If that is your thing, you will like this place!  Natural baked cookies, a large selection of coffees and teas...with beer for those who want more than a shot of caffeine.  Definitely not a \"bar\"."}
{"text":"Don't understand the hype about this place. It has a strange, uninviting vegetarian-based menu (I'm not vegetarian, but frequently enjoy vegetarian meals). Moreover, the staff is arrogant without warrant and the whole vibe of a bunch of people who seem to have never left the place makes its allure all that more perplexing."}
{"text":"Such a great, informative, and welcoming staff!! So many vegan options, including treats! Also, the majority of the food is organic and local.  The atmosphere is one I wish I could capture in a bottle. One of my favorites."}
{"text":"Went to The Root Café for the first time tonight and as soon as I walked in I loved the atmosphere. There was a live cover band playing soft rock. I ordered a smoothie with peanut butter, banana and coconut milk and it was amazing. I honestly didn't expect it to taste as good since it's all organic but I was very impressed and will be going there more often."}
{"text":"Good food in a relaxed environment. Their black beans and rice are fantastic. Burritos are sublime. The kombucha is keen. I do get a little of the snobby \"we're regulars and you're not\" vibe from some customers, but not the staff, who all seemed really friendly."}
{"text":"It's a nice place, I come here with my friends to talk or sometimes I come to study. The coffee was fine and the decoration is very comfortable."}
{"text":"The Root Cafe features local musicians and artists. I love Open Mike Night. You can stop by and have a fresh brew of local-accessed Coffee.  My fav is theMexican Cocoa made with cinnamon, cayenne and and vanilla.  Has a bold flavor with a contrast of spicy with a zip contrasted by sweet vanilla.  Similar to Horchata!  I love it.  My fav pastry is the Expresso Cream Cheese Brownies or the Anise Biscotti! Great for dipping in your coffee.  Also has gluten free bakery items!  Also has a plethora of vegan dishes, soups,salads, and pizza!  I love the Chef Nonni - Fresh Artichoke Hearts, Goat Cheese, SunDried Tomatoes,  Rosemary, and Roasted Garlic!"}
{"text":"Vegan heaven is what I believe they call it. Walking in, it screams hipster all over it and I love it for that. The aura of the place is great - whether you've come to chat with a long lost friend, read or study. Plenty of room in the front of the cafe or in the back for more privacy, yet I have seen this place packed. I'm pretty certain its the best coffee shop in Lakewood and their prices make me love it even more. I'm used to Ohio City where one cup of coffee is $4 when I'm pretty sure I can get a large coffee for a cheaper price here. I've never eaten here but I've seen their menu and everything sounded so good. During some of the days of the week, they have a guitar singer that really makes it entertaining when people chime in and sing classics together. I'm far from vegan but coming here, I don't mind acting like I am for the day."}
{"text":"Good food and people. I'm not a vegan or vegetarian and would happily eat almost anything on the menu. Don't leave without a cookie."}
{"text":"I tried this place after reading Kate B's review and I have to say this is a hidden jewel. It is more affordable then the big chains, service is great (please consider tipping since workers are volunteers), and a wonderful atmosphere. The baked goods are wonderful."}
{"text":"Stopped in for Sunday breakfast. There were four of us and we we lucky enough to get a table (it's seat yourself and tables can be scarce). Being a local hangout, lots of folks were doing just that. Ordered The Working Man's Burrito. Took awhile to get it but we weren't in a hurry.  It was delicious and very filling. A little heat in there as well. The coffee was excellent and is a specialty here. The scone we ate with our coffee was also delicious. There are very few restaurants that do vegan food well and it appears they may know how (we'll have to try it again)."}
{"text":"The Root has great food.  It's delicious and doesn't make you feel bad about yourself afterwards because you know it's made of good stuff.  Like organic and unprocessed and shit.  Like this food is definitely not going to give you cancer. They are one of the few places that know how to make vegan pastries palatable in this area.  I would come here more often if it didn't give me such anxiety just thinking about walking into the place.  You typically have two seating options: 1) the largest table in the world that you look like an asshole if you sit there by yourself 2) the tiniest, most unstable table in the world that your cup of coffee will surely not fit onto and your soup and salad most certainly will not fit into.  Don't even think about trying to balance your laptop on it. Just don't.  It will be a disaster and you will be so embarassed.  Also, how do we as a people vote that large group of Eastern European men playing dominos in the middle of the cafe off the island??? They take up so much space.  How many chairs can they fit around that one table??  The answer: too many. I'm sorry The Root had to inherit this group.  I remember them from my Caribou days.  I just want to say GO HOME, WE HAVE A BUSINESS TO RUN HERE!  Can't you play dominos and chat about big breasted women somewhere else?*  Also, open mike night just , no.  I'm too old for that shit.  That said, I love the Root.  Dont ever leave me.  *not sure if they are actually chat about big breasted women as I do not know what language they are speaking but I can only assume all they talk about is big breasted women.  It seems to make the most sense."}
{"text":"Came here with two friends, one of whom knew the band that was playing tonight. The band-Questionable Attitude - was fabulous. They played a mix of original songs and covers of classics. I got the plain cheese pizza, which was fresh and simple. And piping hot out of the oven! The hummus starter was fabulous, and I'm picky about my hummus. It was a generous portion and served with veggies and homemade pita chips. Chill, indy atmosphere in general."}
{"text":"Great Staff, Great coffee.  Great vegan baked goods.  Love this spot!"}
{"text":"If I lived in Lakewood, I'd be at The Root Cafe all the time eating their tasty light vegan meals. Love the sunny, spacious interior and smiling servers. The only thing missing is a fresh juice/smoothie menu -- Root seriously needs to introduce one."}
{"text":"Such yummy food!!   We waited a while but it was worth it, I think. Even my boyfriend, who eats a lot of meat, liked his vegetarian sandwich. Really unique ingredients and a very cool conept. I hope it's around for a while so I can go back a lot!"}
{"text":"The coffee is amazing and the salads are always on point. Make sure to check out the raw food night if you're into that sort of thing or are curious about it!"}
{"text":"Just had our brunch here. Firstly, it was crowded (may be its because - Sunday). After we ordered our food, we had to wait for at least 15 mins to find a place to eat, and then 15 mins more to get the food on our table. It took at least 30 mins in total...  What we ordered? a) Stir vegetable ($10) b) Scrambled egg ($12)  a) Stirred vegetables - It is written on the menu as Broccoli, Kale, Zucchini, Potatoes,  Peppers and others -- but, all I got is Potatoes (90%)... I don't think it matters if the food is organic or non-organic, if the food has 90% of potatoes?  b) Scrambled egg -- It also has potatoes, and ONE sliced bread.  I have not tried their coffee, so I can't comment on that. I felt that it was way over priced. I am afraid that I may not recommend it.   Thanks,"}
{"text":"I stopped in for the house made chai, returned for the in house green tea, and stayed for the brown rice and kale stir fry. Life is good.   I love chai and when I want one, I want a real one. At Root, like other Phoenix coffee locations,they make their own chai!! They don't pour it out of a vacuum sealed box. It's takes a few minutes, but it's worth the wait. It's perfectly spicy. It's just plain perfect.  Their green tea is delicious, but don't let the tea bag sit in your cup too long. This is real green tea and it will lose it's delicate taste when brewed too long.   I've been meeting my sister here for tea and dinner on Monday nights. My sister loves the Cleveland. I am loving the brown rice stir fry with local veggies (Hello Kale!)! Last week I enjoyed the curried lentil soup. This is real food, not McDonald's and it's why I love it. There's a great selection of salads, sandwiches, and desserts. Vegetarian and not. It's made to order. It's fresh and organic. They have a great list of the farms they work with posted right beside the specials.  I love FARMS. They serve beer too. You get 10 cents off for bringing in your own mug instead of using a disposable one. (If you eat in they give you a real mug). I'm interested in trying the Mexican Hot Chocolate and would really like if they added rice milk to their menu.   The place has a cozy and lively  vibe and it's recommended if you are staying to grab a table before you order. The place has large tables for 4-6, small tables for 1-2, and a bar along the window.  They also have Table Share signs to use if you don't mind sharing your table,   It's a wonderful place to catch up with friends, read, Internet, or sit back and listen to live music. The place can get pretty noisy. It's an active place, full of life."}
{"text":"The Root is just one of those one-of-a-kind coffee shops that develops a following and a sort of \"culture\" of its own.  They come for the fantastic eats, which will satisfy anyone although The Root is definitely a vegan/vegetarian restaurant.  As a non-vegetarian, I still swoon for the many desserts in their case, especially the spice cupcakes and pumpkin whoopie pies.  Their occasional raw food options are delish.  And they serve the truly unusual in the realm of veggie options--root vegetable cheese-free pizzas, tempeh biscuits and gravy, BBQ raw vegan lettuce wraps, and more.  Also, the many coffee and tea drink offerings go above and beyond.  Beyond Starbucks or even their locally owned competition, that is.  This is one of very few coffee places I know of that knows the difference between wet and dry foam (on a cappuccino or similar drink, this means a heavier, creamier foamed milk or the light and airy foam most are used to), serves unusual tea lattes, and can modify herbal tea blends, since they have the loose leaves right there.    Obviously, this is going to attract an eclectic, indie, alternative crowd (whatever your preferred terminology is, you know what I mean).  And if you're part of that, or peripheral to that, this is where you'll meet awesome people, attend open mic nights, and run into old friends that just happen to be meeting up here.  It's a very lively atmosphere in that respects, and attracts young and old.  Rarely do I care about the social dynamics of a place, but I've grown to realize how nice it is to go be among like-minded people in a vibrant setting.  This is it."}
{"text":"The Root Cafe is a gem for veggies in the Cleveland area! The food is amazing, with equally awesome people and atmosphere.    The menu is pretty extensive, with salads, soups, sandwiches, wraps, burritos, breakfast/brunch items, stone oven pizza, calzones, and numerous side dishes. I tried the Root Wrap (I'm a sucker for anything with avocado) and it was delicious! The combination of veggies was very tasty, with everything tasting so fresh. My friend was a fan of the Hummus Wrap. Most of what they prepare is house-made, from scratch, and locally provided. This is a great spot to grab a good cup of coffee and delicious bakery as well!     There is a decent amount of tables and seating but it can get crowded, so I wouldn't suggest Root for large groups but it is perfect to meet a friend or catch up with a smaller group."}
{"text":"An amazing cafe all around! Great food, great atmosphere, and awesome service! Try the iced mocha and hummus wrap!"}
{"text":"Not a coffee house guy. Not sure what I wanted other than \"the iced drink with the most caffeine\". Was given a bunch of vapid answers and no suggestions, they served a total of 3 customers after my mate whom I ordered with. I was given the wrong size, but at that point, \"oh well\". If you frequent coffee shops, this is your spot. If you're a novice, stick to a chain. Tasting what I have..... not even good."}
{"text":"Really cool place to catch an acoustic set and grab a coffee. The menu is small but is vegan friendly. The prices aren't bad at all. If I had one complaint it would be the fact that they no longer sell beer. I know it couldn't have been a great seller but it was one of the few quiet spots in Lakewood to grab a brew and use wifi."}
{"text":"I love coffee houses!  This place has open mic days and other events.  It's in the Lakewood area.  The coffee is delicious.  I haven't tried the food but I hear its really good.  I'm def going to be a routine customer."}
{"text":"At first, the Root Cafe may seem like a coffee shop with a small cafe, but it's so much more! Their menu includes many gluten-free options and most items use locally sourced ingredients. In addition to the many splendid sandwiches, salads, and wraps, the Root always has a hefty array of vegan treats!  The Root Cafe is certainly on my Top 10 vegan-friendly place to try in Cleveland! http://veganhostess.com/vegan-cleveland-restaurants-coffee-shops-more/"}
{"text":"Great tasting food and drinks. A lot of vegetarian and vegan options.  Friendly staff. Will visit again. (Mexican hot chocolate is incredible!)"}
{"text":"Root Café I love The Root.  It is always filled with an eclectic crowd.  If the food and coffee weren't so good I might just come for the people watching. The root used to be Arabica...back in the day, a dark and dank hole in the wall with weird smoking kids out front, a few tables and chairs, and some meandering people working.  I went because it was darn good coffee, and yes, we know...I'm a snob. Now The Root, in its new, shiny space next door to the old hole-in-the-wall (now a fancy-pants salon) is jiving and hoppin'.  There is more space to sit but still too often not enough.  I've been known to share a table with a stranger or two but this does not bother me.   Because they have expanded, there is now a kitchen.  This is to my great pleasure because the chefs at The Root have a passion for tasty food that is natural and often vegan or vegetarian.  They offer a vegan dinner menu once a week, Thursday if I'm not mistaken.  While I have not been, I do get the menu each week and my mouth waters with desire.  The pastry case is drool-inducing.  I especially love the Sun-butter cookies, which are green due to the sunflower seeds in them.  Don't let the green deter you...they are wonderful, and I've tried to replicate them at home to no avail.  The menu changes with the season so stop in often and try something new. Back to the coffee.  Well, let's just put it this way.  I love it.  'Nuff said.  Okay, maybe I need to say a bit more.....they know a traditional macchiato, and I don't have to tell them how to make it! The Root Café is full of weird, quirky people, but it is oh so good.  Go there.  Now."}
{"text":"I've been to The Root Cafe twice. The first time was a few years ago when I played a show there and more recently was this past weekend, when I actually ate there. When I was there the first time, they served beer. Not sure if they do now. I didn't see a beer menu, but I was there in the afternoon. Surely the afternoon isn't too early for a drink on a hot Saturday? Anyway, to the actual review.  The Root Cafe is a nice little cafe/coffee shop in Lakewood. It's got a cozy and quiet atmosphere inside and seems to be a popular hangout for hipsters. If you didn't know, it's a vegetarian establishment. I was invited there, and I did not know that it was vegetarian. And I am not vegetarian. But whatever, no big deal.  I ordered a bbq mushroom fake-burger, only to find out later by an employee that they had made a mistake and they just ran out of mushroom patties. So, I asked for the cheese pizza, which was a bit more expensive, and they put the order in and told me not to worry about the price difference. I thought that was very nice of them. In fact, the whole staff was very friendly, from the cashiers to the gentlemen who would walk by our table and fill our water and asked if we needed anything else. They were very attentive without being overbearing.  My pizza came out the same time my friend's mushroom burger came out (he was in front of me in line and got the last one). My cheese pizza was quite good and it was a big portion. I didn't even finish all of it. Their pizza was kind of similar to the pizza at Pickwick & Frolic's (in Cleveland), which I adore. I didn't try the mushroom burger, but my friend said it was good. I suppose he may have lied, but I don't know.  I got a Rwanda coffee, which I enjoyed. Wasn't burnt or over-roasted. Nice bold, earthy flavor to it. Wasn't great, but it was good.  Overall, I think The Root Cafe is a nice hangout to relax and grab some lunch. I don't know that I'll be going back any time soon, seeing as though that not many things on their vegetarian menu were appealing to me, but what I had was good and I really liked the atmosphere and staff. Their pastries look fantastic, but I didn't have the pleasure of trying one. I definitely recommend The Root Cafe."}
{"text":"I enjoy The Root Cafe in general, and have been enjoying it since soon after moving here in May 2011. I found out about the place through a cop. I was shopping or something in Lakewood and figured if anyone knew where the good coffee was in a particular area, it would be a police officer. I asked an officer who was standing around the stores where the best coffee in Lakewood could be found, and he directed me to The Root Cafe. Originally he directed me toward a fancy kind of coffee, I was thinking, because of the way he described this special filter for the coffee--a cone-like object that some people will be familiar with or know what I'm talking about--like the thing that you put the coffee filter in on a coffee maker. Not a french press but a more regular-looking thing. Anyway it turned out when I went to The Root Cafe and asked one of the employees about which kind of coffee the cop might have been describing that was so good, she told me he meant just their regular coffee--less expensive than the kind prepared using the special filter thing I described before. So I got a cup of regular. Indeed it was good coffee. Not necessarily the best, but good.   I also enjoy the food at The Root. They have delicious molasses cookies, and the vegetarian dishes--they are all vegetarian--are satisfying enough that one might think there was some meat/protein-based item snuck into their sandwiches. After I eat something there, I am full.    The only downside to this place is if you want to have an audible conversation and you go at one of the times of the week when they have a band. I went with a friend one time when they had what I thought was a sort of bluegrass band playing, and I could not hold a conversation so we ended up leaving pretty much upon arrival."}
{"text":"This place rocks!!  I was visiting from Chicago and I love little coffee places with great coffee and amazing service!   I was blown away!  I had a mocha with brown sugar and a brownie.  4 shots of espresso kept me going for the 6 hour ride home.  I'll be stopping here again on my next trip thru Clevland"}
{"text":"This cafe is a hidden gem of Cleveland and Lakewood. Offering an awesome selection of vegetarian, and organic soups, sandwiches and pizza. They also have non-vegetarian options, and they also have great smoothie, and coffee options. Such an adorable cafe with absolutely delicious foods. I had the Sweet Potato Sammy and loved it!"}
{"text":"I almost never leave reviews, but I really do love this place and the people who work here. I recently had to adopt a new diet due to health reasons, and it's pretty restrictive. I'm so happy I can come here to find things to eat that are good AND good for me. The entire atmosphere of the Root is cheerful and relaxed, and the employees are helpful and kind. Thanks for the great food, great service, and making my adjustment to a new diet much easier!"}
{"text":"This is my favorite spot for coffee.  I am not a vegan but I really enjoy their vegan pastries.  I try something different every time I go and am always pleasantly surprised.   I prefer to get my coffee and go because the restaurant can get quite noisy."}
{"text":"This place was busy! Root Cafe is getting more and more popular.  I had several meetings on the west side, so I popped into Root Cafe to do some work before heading over to the Cleveland Public Theatre for a show. The inside is very open with modern, rustic urban decor. There is free wifi as well as lots of seating and outlets. They also serve great vegetarian and vegan food.   I had a coffee and pastry, which were pretty good. Later, I ordered one of the rice bowls (rice, beans, avocado, yum!) While I was waiting and working, more and more people piled into Root! Eventually, I went to go ask about my bowl since it had been about 30 minutes. They checked and apologetically let me know that they were using a new computer system and that the order never went back. They came over to where I was seated and asked me if I wanted to expedite the order... I was in somewhat of a rush to leave, but I decided to expedite it anyway. They brought it over in the next 10 minutes.   One of the girls sitting next to me said that it was the first time she had ever seen an order get messed up, and she seemed very loyal to Root! That helped my perspective a lot. Also, the girl at the registrar later came over and actually gave me my money back. I thought that wasn't necessary since I had already eaten / gotten my bowl, but she told me to just keep it. I thought this was really great - it showed me that Root keeps their customer at the center of their business. I am a fan!"}
{"text":"I have been frequenting this lovely place for about a year now and have enjoyed every single drop of coffee ordered. The first couple times I had it,I felt like taking my shirt off and running down the street yelling wooo. I don't know if its their excellent beans or the preparation methods but the caffeine content and flavor are high. The Peacemaker is my favorite brew. As far as their food, I have only tried the hand rolled granola and its fantastic."}
{"text":"i'm completely head over heels about this place. They offer local coffee options, an amazing menu that caters to a vegan/vegetarian lifestyle (I'm not but I try to avoid indulging in dairy and animals), and fresh baked goodies everyday. I come here quite often so I've tried almost everything on the menu (The root wrap is my FAV) so I've started to order from the menu on the wall that's updated daily and I've never been disappointed."}
{"text":"OK, I am not a Vegan or Vegetarian.  However, this place has the best coffee and breakfast menu in OHIO.  When you taste the food, you would never know its vegan.  They have all sorts of great desserts and assortment of sandwiches.  When I am nearby, always pop in to Root.  Last thing I forgot....they server BEER!  WIN!"}
{"text":"This place was amazing. The food was out of this world. The atmosphere was in point. Just a little hole in the wall with chill music playing, good food and good people. I got the Vegan Burrito and it was amazing, you got a ton of food for your money, I took half of it home. I also got a side of the cabbage with cashews and sesame dressing and that was also amazing. Will defiantly eat here again."}
{"text":"Good coffee and food, the wait can be a little long but the food is worth it. Another super vegan friendly spot!"}
{"text":"Love it!  The Root has got to be one of my favorite places on the Westside.  The food is good, the coffee is amazing and the prices are not too bad.  I like the atmosphere and they actually have decent hours.  I am here at least once a week and it's just not enough!"}
{"text":"Best vegetarian food in Cleveland. With local & organic ingredients and with love."}
{"text":"The only thing not to like is that its hard to find. Look for tease hair salon and its the cafe with hte black unnamed awning ( or maybe it was named but i couldnt see it). I got their chocolate chip scone and soothe your throat tea. Their tea was amazing. I didnt add anything to it but it had sweet hints of strawberry and spearmint which was great. A small looks like a 6 oz cup. I kinda wish they would have given it to me in a mug, after all i was sitting in there. Scone was pretty good- it did have a raw vegan taste to it. Not overly sweet but great with coffee! Wifi was really fast and the password was vegetable when i was there. not sure if they change it constantly. Bathrooms were clean- one male and one female. Ample seating and outlets. A good place to come and get some writing/reading done. They have a vegan pizza menu that seemed to be pretty popular. Also pour over coffee- two different types ( Cant recall names at the moment).. but one was 3.00 and the other was 3.50.  Id definitely return to try their pizza and coffee."}
{"text":"Had the ROOT pizza...omg, so delicious!  The place has such a great vibe and there are all kinds of people who go there!  I can't wait to go back, there are soo many choices and all are healthy!  Yummm!!"}
{"text":"I keep coming back to this gem. All vegetarian. All good. I like to come here after a morning hike/bike ride and get some good healthy food and maybe an Oberon.  The huevos rancheros is to die for. The pizza with artichoke and goat cheese is very good. The boyfriend really like The Root pizza, you have to really like root vegetables to like it - lots of sweet potatoes and carrots."}
{"text":"Lakewood beer festival - goat cheese balls and foccacia.  Yum!     But the sweet potato fritter with salsa and cilantro crema will knock your socks OFF!!!"}
{"text":"I had a cappuccino around 7:30pm at The Root Cafe in mid October, 2016.  Loud music filled the air, ordinarily a negative for me, but somehow, the music seems ok in this place.  The evening was warm and the doors were wide open which was really enjoyable.  There were lots of younger people here and it was a friendly, good vibe type of cafe.  It looks like the floors were original, old wood planks, full of character.  It's a cozy space and a cafe that I will definitely go to again.  Next time I will try a lunch or dinner here.  They specialize in some vegetarian specials as well as pastries and desserts."}
{"text":"This place is awesome, and I am not even vegan. I can eat here and feel satisfied. The food is awesome and I keep coming back time after time."}
{"text":"Over priced for organic. Their menu used to be affordable but then I guess cabbage must be at an all time high. It's a blend of organic hipsters and old people that clutter the place and if you're lucky enough to find a self servicing seat you might find yourself on a random open mic night that totally kills your one on one time with anyone you brought there. Yeah its organic and all that fancy stuff and it is good but unless you are going for coffee and happen to be there at the same time for lunch then take your ass somewhere else down the road."}
{"text":"Root cafe always has the best healthy food the most creative recipes for vegan and vegetarians. The zuoodles was so hearty I could only eat half I was so full the zuchini noodles were steamed with a wonderful raw parmesan cheese that was almond based the earthiness of the mushrooms and the balsamic glaze was perfect with pesto. Tuesday night is open mike night it was fun to sit at the window listen to some jokes some music and have a great dinner and people watch at the same time"}
{"text":"The food is great, the environment is great, and the coffee is great. However, this place is getting three stars because the past two times I've gone they got my food order wrong.   The first time, I ordered for myself and my boyfriend and only my boyfriends food arrived, even though the cashier confirmed the order with me. They didn't offer to make it up or anything and it had taken over 20 minutes for it to come so I just didn't eat. This last time, we ordered and got the order confirmed but the kitchen still sent out the wrong order. This time, they did actually offer to let us keep the old food and get our correct order which was an improvement.  My advice is to ask them to show you the square thing, because it seems pretty likely they will mess it up.   The food really, really is good though as well as the coffee, so it's worth it to come for that. The brunch menu is also pretty delicious, particularly if you like veggies."}
{"text":"official redemption! food was delicious loved the iced green tea. maybe she was having a bad day...."}
{"text":"Never did I expect to find such a vegan and vegetarian friendly restaurant in Cleveland!! The Root Cafe has the best tempeh reuben (or any vegetarian reuben) I've ever had and the selection of tea was fantastic! Plus the team working here was super friendly, and there was live music on a week night! I'll definitely be back every time I'm in town."}
{"text":"Local food from local farms, at its best. Staff is friendly and very accommodating. But the people that hang out here always look pale and grey. Can't win everything I guess."}
{"text":"The best vanilla latte I have ever had! The coffee can be a bit different at times and depending on the night your in here it can be a little overwhelming with the live band or open mic. I wish it was more chill... But for coffee shops in the area I think it's great! The people that work there are usually always really nice and helpful.   The food is actually pretty good! I usually stray away from \"vegan this and vegan that\" but I manned up have tried multiple things here and have loved just about everything. My favorite is the cheddar bake sandwich! I gotta be honest when I eat here I feel healthier... Its most likely all in my head but who cares! :)"}
{"text":"Food and beverages are good and the staff is friendly. The drawback here is its popularity which translates into--no place to sit.  Probably will only return if I'm in the neighborhood and have to kill some time."}
{"text":"I love the Root Cafe.  It's a great place to hang out with friends, play cards, eat awesome healthy food and drink fabulous coffee drinks.  The staff are also very friendly, personable, attentive and go beyond what is expected.  Great customer service.  I have also had the opportunity to meet some of the chefs.  They are just as sweet as the front of the house staff!"}
{"text":"This is a good place if you want to chill, have some coffee and use their WiFi. The food is decent, too. They're also super bike friendly, which is a high point for me. My only annoyance with it is that they seldom carry any Splenda-type or other non-sugar sweetener for their coffee, so I usually either just have to take it home to add that in or remember to pack my own. Either way, cute place, good bike rack, decent coffee and food and they have WiFi."}
{"text":"What does hipster ambiance mean? Water in mason jars. A very distinguished interior, The Root Cafe resides across Detroit from Caribou Coffee. Large windows in the front with bar seating make the happenings of the street easy to view, although the people sitting there unfortunately fogged up the glass.   Only got coffee but would definitely go back for food. Cute menus with cutesy order names, e.g., i am the eggman."}
{"text":"This coffee shop & cafe is such a hot spot in Lakewood! The inside is filled with life and character as are the baristas and its a guaranteed delicious cup of joe!! My favorite is the latte, it has such a pure & organic taste. They serve breakfast & lunch items including sandwiches, soups, salads, pizza and baked goods and have a great selection of vegan options. Ive even noticed that they have open mic night which is something I still need to try out. The wifi is a little spotty (although that is usually because there are so many people especially on a Saturday) but make it a great place to get some work done in a cool environment."}
{"text":"I'm fresh off my trip to NYC and this place had a Williamsburg hipster trendy vibe going on. The latte was really good and their chipotle aioli sauce was on point. I work from home so this would definitely be a cool place to frequent for some coffee and email answering time."}
{"text":"I have no idea how this is possible, but it appears that I'm the first on Yelp to review The Root Cafe. Centered centrally in Lakewood, I can't imagine any reason why this place won't catch on and build up a loyal following.  Now...this is VERY important...I'm giving it five stars, but this is not an official \"Brandon's Five Star Rating\". They're getting an incomplete for now, as they're eventually going to have food...but I couldn't see to it to give it four stars, because the way the place looks, its location, the internal coolness and the fact that it's not a chain puts it in a prestigious position with me.  The chocolate chip cookie DID kick ass though.  So...this was the Lakewood Phoenix, moved a couple doors down into a bigger space. The Lakewood Phoenix, aside from its name, had no tie to Phoenix Coffee aside from using their product.  And, that they still do, utilizing coffee beans roasted right here in Cleveland. I'm all about the \"local\", so this is aces with me.  The atmosphere is really nice, with very high ceilings, big front windows to people-watch or daydream out of...the walls are green and orange, which nicely contrast the light wood floor. Exposed brick, wood finishes and track lighting all come together to make the spot very inviting.  The owners and baristas are all the same crew as the previous location, so they're well aware on how to make coffee. I had my usual first-time-in-a-cafe fare, a cappuccino and chocolate chip cookie. The drink was expertly made, perhaps the best I've had in Cleveland, served in a nice ceramic mug. Again, cool...as I try to throw away as little as possible.  Holy shite...I just asked the cute dark haired barista where they get the cookies, as they're equally awesome (though..a BIT expensive for their size...$1.75)...  ...THEY BAKE THEM HERE. RIGHT HERE. All their goodies are baked here, except for the croissants. So, if that's any indication, the food should be awesome.  Actually...you know what? Screw it. This is being upgraded to a famous \"BRANDON'S FIVE STAR RATING\". So suck on that.  (Hey...I'm in a good mood...I got paid today, forgot that I hadn't even deposited my last check, and will possibly get to geek it out and play Dungeons and Dragons next week...so give me some slack)  So, that changes everything.  I'm writing this on their Wi-Fi, it's fast, and easy to get on.  Eventually, they're going to have live entertainment as well.  I'll absolutely be back...this is definitely the most put-together cafe I've been to in Cleveland, and given that it's new, it'll have the momentum and drive to stay hot.  Peace!"}
{"text":"Root now gets there coffee from Rising Star in Ohio city... everything about this place is now perfect. I started drinking a lot of tea, and their selection is outstanding!! Cookies and pastries are always yummy, so is their pizza!"}
{"text":"The best! Love the salads and soups, the sunbutter cookies and raw night! The sandwiches on the gluten free wrap are to die for! Try the Culture sandwich on a wrap. You won't be sorry!"}
{"text":"Just moved to lakewood and stopped in for a bite.  Had a great Burrito with lots of fresh veggies, brown rice, and primo black beans.  The garlic enchilada sauce added a nice touch, and you could tell the sauce was fresh made in house.  Reminds me a lot of the food at Casa Nueva (one of my all time favs) in Athens, OH.  Would go back, only complaint is wish the mexican inspired portion of the menu was larger!  Good eats, great atmosphere."}
{"text":"I love The Root mostly for their food menu.  The staff here is hip but friendly.  The place is often packed around midday.  I would not recommend studying/doing work here because the noise level is HIGH. Also, be warned that if you eat in you have to nab yourself a table which can be difficult when they are busy.  We like to order our food to go usually.  I've eaten my way through most of the menu here and these are my favorites: -Root wrap -Tempeh reuben (woah!) -The Balanced Equation calzone  From the bakery, you can't go wrong with a chocolate chip scone or sun butter cookie. They have a raw food menu on Thursday nights too which I'm super excited to try."}
{"text":"The Root Cafe is the best of the best when it comes to service, food, coffee, and hospitality out of cafes. The vegetarian/vegan food here they have is surprising delicious and not as bland and dry as most places I've had. Many options from sandwiches to pizzas to soups and whatnot. Great coffee menu, many options, great service, very very fresh. Friendly environment, only concern is that it's always decked during peak hours."}
{"text":"Excellent espresso drinks, nice atmosphere, good service.  This is a spinoff (?) of the old Phoenix location in Lakewood, and they seem to embrace the Phoenix principles of quality espresso and excellent drink preparation.  On par with other Phoenix locations and Erie Island for coffee quality.  I'll update this review after additional visits (haven't tried the food)--but so far, so good."}
{"text":"Amazing ingredients for really some fresh and tasty fare. Organic vegetarian and wholesome. The people are very welcoming and warm. The guests seem to be very diverse and enjoy a good read. Anytime we want to Eat out..the wife just thinks of this place first. May appear  slightly expensive ... But it's worth the quality."}
{"text":"I have mixed feelings. I love the food and like the drinks. But the atmosphere? Well, it is less than to be desired. No where comfortable to sit, tables are hap-hazard, service is kinda spotty. Food is also really priced on the high end.....would I come back? I do every now and then....but not a regular spot for me."}
{"text":"I've been here 3 times now. I love the vegetarian options and this place definitely turned me on to tempeh sandwiches. My parents are vegan and this is probably the only place in Cleveland that cators to they're every need. The mocha is to do for as well. Only complaint I think I have is when I got borsch one time. I'm polish and borsch is my all time favorite soup. This wasn't borsch at all. Borsch is a beet soup and I'm pretty sure there were no beets in this soup. If you guys make it again I would suggest getting an authentic polish recipe and add some little veggie filled dumplings to it. If you do, let me know when you have it!"}
{"text":"Everybody egg sandwich is the best egg sandwich I have ever had in my life. Also the coffee and atmosphere is wonderful."}
{"text":"No, I'm not vegetarian, but there are just some days when I feel like I need to eat green and veggie things.  I decided to stop here because I was starving after rummaging through Chelsea's. It has the typical vegetarian look. Friendly staff, cool art for sale on the wall, everything eco-friendly.   First off, everything in the menu looks freakin' amazing. It was really tough for me to make a decision. I settled on the \"on the road\" sandwich. The food is is so fresh and the flavors are out of this world.  I took a  vegetarian friend here when she came to visit me, and she also gives it 4 stars. We had a pizza and a salad. I love this place and it will probably be a mainstay restaurant to keep in my menu of choices. It's definitely worth the drive."}
{"text":"Visited early afternoon on Saturday. When you walk in, you immediately feel like you're in a downtown cafe, very cozy! Great atmosphere but they are limited on seating. You order your food with the cashier and find a seat - they do bring you your food. My friend and I sat at the bar and I enjoyed a local strawberry Kombucha while waiting. Being vegan for 2 years, I was very excited to have lunch here. I was a bit disappointed in the food- was not nearly as flavorful as I had expected. I ordered one of the featured soups, black pepper spinach artichoke. It was very spicy- and the mock tuna boats. The soup had great texture but the black pepper overwhelmed all other flavors. The tuna boats were a bit dry and bland.. my friend ordered the rice and beans. The beans were flavorful but unfortunately she didn't finish her food as there was a hair inside the beans.... when we mentioned this to the staff they did give her a complimentary item from the bakery, however I don't plan to return."}
{"text":"Can't say enough good things about this place.  Best cafe in the greater Cleveland area in my opinion.  Atmosphere is wonderful.  Vegetarian food options are all great.  Their sweet potato fries....YUM.  Coffee is nice and strong.  It's a great place to open a laptop, relax and get some work done.  Or a great place to meet up with friends and hang out.  The workers are friendly, and great customer service.  Every time I go here I leave feeling creative and refreshed- just something about the vibe of the place!  Check this place out and you'll be back again and again!"}
{"text":"I used to come to Root at least once a week to work and enjoy the breakfast. The food is still really good but every time I come now, even if the place is empty, I'm waiting an eternity for them to make a latte or food. No one ever seems to change their slow preparation even when it's busy. I tried to give them multiple chances but it's getting worse."}
{"text":"I've been to Root a couple of times now and I've never been disappointed. I almost always opt in for one of their specials so I am always getting something different. Today it was a vegan scramble with tomatoes, onions, avocado, black beans and more. It was incredible as always. I also decided to get one of their fresh juices. It had beets, cucumber, apple, and a few other things. The juice was really balanced and so refreshing!   The only thing keeping Root from getting a 5 star rating is that the prices are a little higher than they probably need to be. At the end of the day though it's really a phenomenal option for vegans/vegetarians/health conscious Clevelanders!"}
{"text":"i've been to this place four times now.  It's really good quality vegetarian and vegan food.  It's all locally sourced as well.  I've had two of the different breakfast sandwiches, a calzone and a tempeh reuben today.  Everything I've had has been delicious.  First time I tried tempeh, and I was really happy with trying it.  I've also had the Mexican hot cocoa and cafe mocha, which were both amazing.  The cafe mocha is a must try if you drink coffee.  The only downfall is possibly the prices.  Breakfast is the best value, and there are variety of more choices as well."}
{"text":"Chill atmosphere, delicious quality coffee, and amazing vegan/vegetarian local foods.  A great cafe style place to relax for the health conscious and coffee enthusiast. I have yet to be disappointed by my order of coffee and food. The food is always fresh and tasty. The staff are friendly, easy going, quick to serve, and very helpful. The facilities are clean, but can fill up quickly so be sure to grab a table if you see one open.  If you haven't been here... You must try it at least once. You'll sure to come back."}
{"text":"If I lived on the west side, I would be here all the time.  I won't bother repeating all the great things everyone else has said about the ambiance and great service here - I'll just talk about the amazing food that I ate. I came here on a Thursday, their raw food night. We ordered a ton of things to share - the \"nrg\" soup (from their raw menu), as well as the sunburst salad, on the road sandwich, and fun guy pizza. Every single thing was SO good. I was a little bit nervous about the raw soup, but it was delicious. I'm a sucker for beets, and the salad and sandwich were both amazing. The pizza was incredible too - it was obviously a lot heavier than the other things we got, but it tasted great as leftovers the next day. We also took home a piece of their raw samoa cheesecake, and I couldn't believe that it was raw - it tasted decadent but didn't give you that heavy feeling you get after you eat normal cheesecake.  Overall, I wouldn't hesitate to come back here. Even if you feel a little bit unsure about their raw food night, I think it's definitely worth a try - I ended up loving it so much more than I was expecting!"}
{"text":"I just LOVE THE ROOT!! whenever I am in the area or even around I make a stop for a coffee specialty or not (my fave is unsweetened almond milk chai tea latte) and pick up some baked goods-vegan and gf. I haven't had a chance to sit and eat lunch or dinner but I did have some to go food which was amazingly delicious. Can't wait to eat on raw food night and finally get some raw cheesecake!!"}
{"text":"This place is not your typical Lakewood joint, but soo worth going to! It is a vegetarian/vegan café/restaurant. They make one of the best, authentic cups of joe in town. I tried their cappuccino a couple weeks ago and was thoroughly impressed. I've also tried a few of their teas (both loose leaf and in the bag). I prefer the loose leaf. They have specials for soups, salads and pasta each week. I've tried the vegetable stir fry over rice with a peanut-sauce that was scrumptious and made for great leftovers the next day.  I've also had their wrap with avocado, roasted red potatoes, roasted red peppers...ahhhmazing! I have not been disappointed by anything I've ever gotten here thus far. Neat atmosphere. Love that they offer free wifi."}
{"text":"When I get a touch of the homesick, I head to The Root. Actually, when I get a touch of the travel-sick, I should say. It reminds me of a small handful of shops in Chicago but also a few that I've encountered throughout the country. It feels familiar because it has everything I want in a great coffee shop - excellent music, lots of outlets, no pressure to finish up and get out, friendly counter help (but for one time and I chalk that up to a fluke), delicious coffee and the strange ability to suck me in, force my watch forward by three hours and not make me feel like I've wasted my time.  The last sandwich I had involved beets so how could it be bad? The side of potatoes were a little underdone but everything else made up for it. I do wish they had some non-pastry breakfast options but for all the things I love about the place, that's not a detraction.   Did I mention the music? Ok, good."}
{"text":"Aaaaand, I'm back!  Yes, I couldn't stay away! I just had to come back to for a workday at The Root.   For a Thursday morning/afternoon, it was pretty busy. Just like me, many folks were posted up working for the day and enjoying all The Root had to offer. We decided to grab a table and immediately head up to the counter to get some noms.   I opted for an unsweetened hot chai latte with skim--which I've only ever been able to get at Phoenix Coffee. I know they use PC's beans, but I was elated to find out they could make my drink just the way I like it! My first sip was as good as my last, and let's just say it didn't last long. I was even tempted to get a second, but I'm watching my caffeine intake.   It wasn't long afterwards that our tummies started talking to us. We grabbed a build-your-own pizza to share with provolone cheese, traditional sauce, extra mushrooms, basil and garlic. To supplement our pie, we also both ordered their side salads, which you can pick your choice of greens and dressing. Romaine and balsamic it was for us! Everything was superb and perfect for a fulfilling, healthy, light and satisfying lunch. The pizza was thin crust, crispy and fresh. You could tell the dough was made with whole grains for added benefits--melikey. The salads were obviously freshly prepared and cut right before serving.   Not only was the food great, but the service was equally awesome. With no shortage of smiling faces and helpful suggestions, these folks know how to treat newbies and regulars feel welcome.   The Root is definitely going to be in my heavy rotation for second offices."}
{"text":"I love this little cafe in Lakewood. Tons of healthy options and very laid back atmosphere.  I enjoy their salads and sandwiches. They are made fresh when you order and include a good mix of fresh veggies with tastier ingredients like cheese and yummy dressings.  Their desserts look good too, but I have yet to try them. It's a fun people watching place too.  My main complaint is that there are often smokers right outside.  For a place that has a focus on a vegan lifestyle, it's just surprising. It won't keep me from going back. It's a great place for a healthy affordable meal where you can catch up with friends or go on your own to get some work done."}
{"text":"The experience I've had here was one of the worst. I ordered an extra large mocha and after about ten minutes of sitting down, I realized no one was even preparing my drink. I went up and waited until an employee asked if I was waiting on something, and was appalled when I found out they forgot my order. It was prepared much faster than how long I waited and when I finally received the drink, it was a large, not an extra large! I was very disappointed and  although the restaurant itself offers decent food and drinks, I wouldn't recommend it because the service has been cut short. Who forgets their customers orders- especially as something as simple as a drink!?"}
{"text":"Gluten free & vegan fig & orange muffin was so so. Hummus also was not so good either... Last visit I got a muffin that was literally too hard & gummy to even eat. Every time I've been here I've been let down by the food. Will probably continue trying to support this restaurant so I will keep updating this review & hopefully add a few more stars if I find a good reason to."}
{"text":"This place is amazing! Delicious coffee with house made almond milk AND house made syrup. Delicious actual food options that are both began and gluten free. Plus yummy sweets."}
{"text":"This place makes being a vegetarian or vegan supper easy!! I got the taco salad which was awesome and my boyfriend ( whose a meat eater) got a calzone.  He loved his calzone, it was really good and I would get it next time I'm there!  Loved how fresh everything was too.  We also got 2 iced green teas which were nice.  I also liked how eco friendly this restaurant was.  They try to make as little waste as possible."}
{"text":"Great coffee and tea. Very friendly staff. I've been here a few times and haven't had a bad experience with food, coffee, or staff! I'd recommend it for a nice sit down meeting or just a nice little date spot. Not much background noise and lots of options for seating. Check it out for sure!"}
{"text":"This place has really great vanilla lattes and sandwiches. Granted I got the most basic sandwich you can get: the local cheddar bake, it was still super delicious and was made out great bread. Bottom line you don't need to super into eating super raw or healthy but still enjoy  the food here. I came here as a study break from the Lakewood library and its a nice place to just eat by yourself and study or come with a couple friends. The whole place is very unique and has a very relaxed vibe."}
{"text":"Amazing restaurant. I was at the airport and wanted some good vegetarian food. I read good reviews and decided to go out of my way to get something there. I asked the guy on the phone for a salad recommendation and he suggested their special mock tuna salad. I read great reviews about tempah sandwich too, so i wanted that too. I asked for a half-and-half option and he cheerfully agreed. They decided to go out of the way and make things work! Kudos to them!  Mock tuna salad was the best salad - I have had this year! It was amazing. I loved it! It was filling and yet light. I am a fan and I will definitely be back! :)"}
{"text":"This place is great for vegan and non vegan, healthy and yet outstandingly delicious food! They have this lemon water that is amazing and keeps me coming back every time!  Every Saturday when I'm in town, I'll be there for breakfast!"}
{"text":"Love!  Although I've only made it here for breakfast or brunch this is a place with awesome food, a cool environment and a real sense of community.  Love the idea of putting a small sign on your table if you are willing to share the space with another diner.  In a world where we are all disconnected, texting and barely making eye contact this is a wild and crazy idea that works.  They create great food with fresh ingredients, locally sourced when they are able (yay!).  I always love what I order yet I'm also looking longingly at what others are served and resolved to order that on my next visit. A gem in our community!"}
{"text":"The Root Cafe is an interesting place. My Fiance recently started working here as a Barista - hopefully this does not skew my review. Root is a Cafe - but its nothing like you're used to.  Food:     I hope you're not a carnivore... else you'll be wondering: \"Where's the beef!?\" Root only serves Vegetarian options. Don't worry, though! I am not a Vegetarian and I LOVE Root's food. These are not your bland 'tastes like grass' type Vegetarian options. Each and every entree that I have thoroughly enjoyed at Root is both delicious and nutritious. They have Gluten Free options that are available in most cases for no additional up-charge (i think they're all free, just not 100% on that). They also have specials almost every day! I really enjoyed the Reuben that used mushrooms instead of Tempeh. That was fantastic.  -Tempeh Reuben: My (current) favorite sandwiches. On rye, this sandwich is better than any other reuben I have had. If you're a reuben fan - just try it! -Culture: My fiances favorite sandwich. I am not really a fan of Pesto but this unique sandwich is quite delicious. -Hoffman Bicycle Pizza: Kind of like a culture pizza. Delicious, unique, filling. -String Theory (calzone): SO. Much. CHEESE. -Sweet potatoe fries w/ aoili: These are fantastic. The sauce really makes them! -Burruto: Fantastic! Very filling...  Drinks:     Fantastic coffee choices. I believe all are fair-trade and local. They do carry Rising Star - Cleveland's premier roaster. Right now I am enjoying some of the Costa Rica coffee. Their Barista's know how to properly pull espresso. Don't try to compare Root to *Bux and their burnt beans.  Atmosphere:     There are so many regular customers that if you, too, are a regular you can really feel like you are family. At times it can be difficult to find a seat. Most customers are kind and will share their table with you. They have paper signs by the espresso machine that you can put out to signify to other customers that they don't mind if you share the table. There are multiple power outlets for laptops and they provide free wifi. They play music loud enough that it doesnt feel creepy but soft enough that you can still have a conversation with your friends.  Tuesday: Open Mic Night Thursday: Raw Food Night (5-9pm)  Cons: -Sometimes it is hard to find a seat. Ask the employee's for help, though. They can usually get you a seat. -Food can take a while to make - but its fresh and made to order so... this really isnt a con? Just relax and wait for your food! -They run out of Kombucha quite regularly. You're probably not going to Root just for a Kombucha, though. -Drinking their coffee will make it difficult to go to the big name coffee places that just dont have comparable quality."}
{"text":"Such a great place to go to get work done, to catch up with a friend, or just grab some caffinee on the go! I love having a place close to my office that serves all of these purposes. The staff is super friendly and efficent, despite the crowds that swarm throughout the day.  Added bonus, I work for a non-profit and was pleased when the manager donated some gift cards and some surplus mugs to an event (I give any business that supports local community good karma bonus points, and I feel happier giving them my money)."}
{"text":"The employees can look a little stanky sometimes (grumpy but not outright mean), but the food is pretty damn good. Unfortunately the tables are often taken by 1 or 2 people so coming with more than 2 people is a gamble depending on the time of day."}
{"text":"After months of ogling this cafe on Facebook, namely their Raw Food Thursday posts, I cleared an evening and made the drive to Lakewood with a friend.  What we thought would be a two hour meal, turned in to a four hour love affair with this corner coffee/art/music/organic/veggie-loving bistro.    We had our share of the main menu and raw food menu items, filled with fresh from scratch options, including raw dessert.  We're not talking about a side of fruit - this was far more serious.  It was a raw version of cheesecake.  Hands-down the best I've ever eaten!  Next time, I'm starting with dessert.  As much as I love stuffing myself, I was able to do so here without feeling like I had to be rolled out the door.  It was the perfect balance of everything."}
{"text":"I rate the coffee as 5 but the food as 3. Meh.   The frittata was okay - a light, whipped egg with salty red skin potato cubes and kale, topped with swiss cheese. I also tried the plain cheese pizza. A very bready crust; the thick tomato sauce was the best part, methinks."}
{"text":"This place is delicious and super vegan friendly. Everything from their menu - food, salads, desserts, smoothies, juices, etc. - is healthy and great. They take great care in the preparation of their food.  Their raw night on Thursdays is fantastic. I would definitely recommend this place to a friend :)"}
{"text":"Update: Get the Tempeh Reuben.  Whatever you do, get this sandwich if they have it.  If all vegetarian food was this good, I'd say goodbye to meat in a heartbeat."}
{"text":"One of my favorite cafes but most definitely my number one favorite place to get Mexican hot cocoa. If you're anything like me order it extra spicy. There's open Mic on Sundays and the overall environment is very \"grandma's kitchenesque\""}
{"text":"Hadn't been to the Root Cafe in a while so stopped by for lunch today.  Forgot what a complete odd mash-up this place was.  It was packed.  We stood in line in front of this guy wearing a moo moo and those shoes that have the five toes in them.  However the shoes were made of leather to make it more casual.  My friend said when he looked at her it felt like he was looking right into her soul.    I had an orange iced tea and it was pretty darn good.  They can turn any tea they have into iced tea.  I also had the #4 sandwich.  It was perfect for today's weather.  It had beets, goat cheese and spinach.  My friend, who is gluten free, had the same thing minus the bread.  They cut up her beets for her and gave her a larger portion.  That was a nice touch.  I've never had their coffee but everyone I know seems to like it.  My sandwich was only 4.50 which was a great price.  I've had a couple of their sandwiches and have liked each one.   This place is perfect for people watching.  However, I did see a guy that works at the coffee shop in my neighborhood hanging out here.  Don't worry though guy, I won't tell."}
{"text":"The Mexican hot chocolate is a must-have, or so I was told. Completely true! This place is funky, I love that its floor layout seems so much more open than it was before. Art on the walls, coffee, even GF baked goods...yes please!   As for the bad bits? Well, I'm not a huge fan of people using coffeeshops as their office, as so many people seemed to be doing (one even stuck her political sign to the side of her table -- that's a little rude to the people who are going to have to clean up after you later, and besides, you've already got a giant candidate sticker on your laptop, I'm sure your fans will be able to find you). That's not really the Root Cafe's fault, but it doesn't exactly make me want to stick around to drink there.  However, the Mexican hot chocolate, with a little bit of a kick, will have me coming back -- even if it's only for takeout."}
{"text":"Upon entering this \"quaint\" cafe, I was greeted by a friendly barista named Evan. He proceeded to instruct me on the nuances of the different coffees I was to order - a true \"expert\"! Suffice to say, I will be visiting the Root from now on, during my daily stroll through the neighborhood."}
{"text":"Stopped in for breakfast. Staff was not welcoming and seemed annoyed when I asked questions about the menu. Ordered a pastry and a latte and waited about 10 minutes to have it made. Seems like a decent place, but probably won't return due to staff and service."}
{"text":"The Root is a cool cafe! I came here for lunch with a friend last week. I had a special salad that had Mediterranean style feta and zatar and a cappuccino that had a good milk-foam-espresso balance. My friend had rice and beans, which had a nice tangy taste and molasses cookie, which was spicy and tasted like fall comfort food to me! What I enjoyed most about the root was the ambience. It had artsy-earthy flair!  The only drawback of the Root is that I don't live close enough to go back on a regular basis!"}
{"text":"I only came here from for a hot chocolate. It was very good, but you get the pretentious vibe from this place. It feels like everyone there is looking down at you. I've heard good things about their food and I would definitely give it a try but I would probably get it to go so I don't have to linger around judgmental eyes."}
{"text":"Love this place! Fresh food, delicious house-made almond milk. Yes!! My favorite place for a chai latte"}
{"text":"My wife and I shared the poor man's burrito. It was excellent .the flavors were blended well , a bit spicy yet enjoyable. The coffee was very good and my cranberry orange muffin was  delicious!. It was a lakewood coffe shop and cafe .... a bit noisy and not what we would call cozy,but the hipsters were loving it."}
{"text":"I love root cafe! I've tried over half the menu and everything is delicious. I love that they offer new deserts everyday and the staff is a cool group of people.  The restaurant has a good vibe and I always enjoy stopping in for breakfast/lunch/dinner + desert especially!!!!"}
{"text":"Earthy and a bit disorganized, this place felt like a throwback to the 90s coffeeshops of my teen years.  They put out a good product, albeit a bit slowly.  I especially recommend the house-made brown sugar cardamom syrup in your coffee beverage.  Delicious."}
{"text":"I love to love places like these.  Organic, local, vegan.  I was super excited to try it, but had problems finding it.  When i finally gave up looking, i found it--right across from Peets coffee.  I really wanted a sandwich / soup combo for lunch, and was surprised that is not an option here.  I cannot recall any restaurant that offers soup, salad, sandwich, that does not offer such a combo. . . until now.  So, this means I ended up spending a great deal on soup and sandwich.  OK.    Service was sweet, and the food was tasty.   I like the idea of placing the markers to share a table.  I think America needs more of this.  I realize Americans need their personal space and ownership (trust me, I am American, and I will back up and possibly wave my pepper spray if you get too close), however, it just makes practical sense.  Why leave unused space when someone else can use it?  Let's just be a little bit more friendly and resourceful at the same time.    While I was not blown away by my experience here, I would definitely return to try other items."}
{"text":"The Culture sandwich is amazing!!! It's my go to vegan lunch. The atmosphere is chill. Plus, they make their own almond milk."}
{"text":"Hi my name is Daniel and I am a coffeeholic. I love coffee. Plain and simple. And I like my coffee with just non-dairy creamer (half and half will do too as I am both diabetic and lactose intolerant). No fancy double whole milk macchiato order from me. So with that being said, am giving Root Cafe 4 stars. Brandon  was dead on about the ambience of the place. It's spacious and well decorated. I sat at the bar tools facing Detroit and was people watching. Saw someone drove up on a convertible with top down and try to hide things in the car. I think they even locked it. I ordered their Bali and was pleased with the brew. It was better than the cup I got a few days ago from across the street at a business whose name rhymes with \"whorareyou\". Coffee is serve in a mug for dine-in customers and metal spoons were provided for stirring your cup of joe. All to be more ecological (and economical too). I didn't eat anything as I was looking for a pick me up (besides cookies , scones and sweet treats are a no-no for me) so I am grading this based on coffee and ambience.  I understand they serve samwiches so I'll have to update this when I give it a try."}
{"text":"Root has a loud, ragged, but welcoming vibe. I haven't made my way through all of the menu, but what I have had has been very good. It's a great downtown Lakewood option for a lunch that is good, not too expensive, and often very healthy.  Root, however, features Northeast Ohio's most acidic coffee. The drip coffee has the taste you get when the carafe of your Mr. Coffee has been sitting on the burner for a few hours. If you like your coffee bitter, this is the place for you, but you might want to bring a few Tums just in case."}
{"text":"Growing up in lakewood, there was one coffee house that was always the standard. The phoenix. And now, living up to it's namesake, the phoenix has been reborn in the form of the root cafe.  While I've seen coffeehouses come and go (arabica anyone?), this is definitely the solid choice for lakewoodites for years to come.   The new space is comfy and accessible, and quite larger than the phoenix."}
{"text":"For those looking for a place to sit and work while eating some great food, Root Cafe is a great option. Plenty of seating, classic coffee shop vibe, and a menu that will work for any part of the day. All organic, and a lot of healthy options.  My wife and I came to Root on a Saturday for lunch. Busy, but I thought that was part of the charm. Lots of people meeting and playing games. Maybe not great for someone trying to get work done, but for us - it was perfect.   I'm a sucker for a good grilled cheese, and their local cheddar bake is delicious. Perfect amount of pesto and slices of tomatoes. Pair this with one of their incredible soups which change daily (and made from scratch). SO good!   My wife had their Sunburst Salad. Incredibly refreshing with so many fruits and veggies. Topped with this tangy house dressing. She said it would have been even better with some grilled chicken.   I have never been one for fancy or sweet drinks. Black coffee/americano's brewed well are my jam. Root didn't impress me with my coffee. It was bitter and I didn't want to drink the whole thing. They use my favorite brand of beans (Rising Star) so it should have been smooth.  However - my wife had the Mexican Cocoa and gave it a 4/5. Hot chocolate with cinnamon, cayenne and vanilla. Again, I'm not a huge fan of sweet drinks, but if I was, I'm sure this would be a great option.   Overall - I know I know... I'm a coffee snob. But It's the main reason I came to Root and it didn't meet my expectation. I will definitely be back to try more of their organic, health-focused menu and to play board games with friends."}
{"text":"Okay Root Café, I see you.  The minute you walk in, it's a comfy vegan haven. The walls are lined with portraits of peoples dogs, they have handwritten chalk menus, and plenty of table and chair options. Did I mention they feature works of an artist that will DO A PORTRAIT OF YOUR DOG??  I'm not vegan but like pretending I am from time-to-time. The lovely gal behind the counter helped me pick the Root Wrap, filled with avocado, kale, sweet potatoes, roasted red pepper, cilantro and chipotle aioli. Its served warm, and even has a little spicy kick to it... it legit melts in your mouth. They also have a killer drink menu, and my mate peppermint iced tea was beyond refreshing.  The only reason I gave it four stars: the wi-fi. It's pretty unsteady. I'm not sure if too many people have their password, but it was nearly impossible to send a tweet out (which is only slightly problematic when you work for a social media site). Otherwise, my vegan alter ego loves this place."}
{"text":"Yeah, I dig me some Root Cafe. When I was a teenager and desperately wanted older artsy women to hit on me, this would have been my dream place to hang out. I could have brought my acoustic guitar along with me on summer days, sit outside, make a small lemonade last for hours and hours, loiter with the best of them, and have all kinds of college girls fall in love with me. That said, I'm now a grown-ass man and appreciate a nice, cool, home-y place where I can grab a good coffee & snack, sit around for a while reading a book (or more likely fucking around on an electronic device) and take in the hipster bonhomie of Lakewood."}
{"text":"Great espresso, good baked goods, very slow drink service. When I say slow, I mean, I won't return unless I have ample time. The weird thing is that when I walked in I walked straight up to the counter and ordered.  Then somehow the guy behind me walked out with his latte before me.  Then the place filled up and there was a line of 7-10 cups on the counter and still no extra barista. If it took that long for my drink I can't imagine how long customer #7 waited.  They could have used another barista and/or someone with front-of-the-house managerial experience."}
{"text":"Pretty tasty, fresh food, great for vegetarians/vegans, fun vibe, but terrible WiFi.  Is always going in and out and having authentication problems.  Be warned!"}
{"text":"This place has a really hipster vibe to it. As a first timer, I appreciated the commitment to local products and the prices -- I didn't try the food but likely will next time! I was not as impressed by the options or the coffee I ordered. I'm hoping to try it one more time and have a better experience!"}
{"text":"I was wary of The Root Cafe because I'm, like, the only Jewish person in Cuyahoga Falls; it's based in a Methodist church, so it felt like a place where I might not be welcome? Fret not: The Root is just a normal coffee shop that happens to call a church its home base. It's open to the public & anyone is welcome, truly. In other words: Consider The Root your local Starbucks with cheaper coffee, more flavors, & an extra shot of faith values - the unobtrusive, \"do good in the community\" kind. And this place is definitely worth community patronage.  I work from home & am always on the lookout for new coffee shops to work from. Lately, Starbucks has been disappointing me, so I looked for new options, which let me to The Root Cafe. I've been three times now & definitely plan to return. It's enormous - like, surprisingly so - with two room, lots of board games, & plenty of couch & table space for those wishing to either catch up with friends or get in some quality time with their laptop. On top of that, the wifi is reliable & fast, which can't always be said of big-name cafes (lookin' at you, Panera).   A note: Their baristas are church volunteers & thus not technically paid. There's a tip jar, though, so show some love & leave a buck or two in the tip jar. At prices like $2.25 a latte, you can surely afford to spare a little bit extra to thank your barista for volunteering his or her time to keep The Root in operation!"}
{"text":"My fiance and I stopped in for a small breakfast while visiting family in Lakewood.  It was our first visit, we were hungry, and there was a long line - so I'll keep my whining to a minimum, and just give you the facts:  - Excellent savory scones and a lot of other tempting baked goods.  I had a hard time making my selection, but olives + cheddar won me over.  - Good coffee from a local roaster served in a styrofoam cup that can supposedly be recycled - but really, how many people are going to get their coffee to go, then come BACK with a dirty styrofoam cup to have it recycled by The Root on some later occasion?  - Our server wasn't particularly interested in answering our questions or engaging with customers at all.  We've gotten spoiled by the array of quality coffee options in Ann Arbor, but even with that caveat, I expect more from a place that has big piles o' locally roasted beans just to the left of the counter.  - Heavy hippie vibe.  Not that there's anything wrong with that.  I can see how this place is popular, and I bet we would've had an even better experience had we not been there during the hungover and/or post-church Sunday rush.  They're on to a good thing.  ---------------------------- Back to update with another star for a great breakfast on Memorial Day - it was quiet, our scones were great, and the barista was very interested in the Mason jars we've been using for iced coffee.  If we lived in Lakewood, we'd probably be regulars here.  We haven't found a place like this where we do live, and that makes me kind of sad, dubious recycled styrofoam or no."}
{"text":"The coffee and bakery here is excellent with a really relaxed atmosphere for hanging out or getting work done. However, the customer service is pretty consistently terrible. Baristas are rather unfriendly, well they pick and choose who they will give good service to and who they will all but ignore. One time, my iced coffee was watery and visibly so. Instead of apologizing and replacing it, the barista just stirred it and handed it back to me, saying that's how it was supposed to be."}
{"text":"I walked here for coffee while I was waiting at Melt. Why? Because, it was a coffee shop I hadn't been to yet and that's not an acceptable thing. I need lots of coffee. Correction: I Like lots of coffee. These guys offer local Rising Star Coffee and local Duck Rabbit Coffee, which is a rising star itself.   Now The Root is a root in the Cleveland coffee scene. Most such roots have lots of good ole' sentimental value but lack a bit when it comes down to solid quality. This is a place locals go to hang out with a henchfriend over a cup of Sumatra with cream along with a vegan wrap. Not a place that hipsters experiment with a refractometer to discern the barely measurable differences between a washed and a natural Yirgacheffe from the same lot. I tried a Duck Rabbit Ethiopian pour-over which was actually not too shabby.   Presentation and appearance goes a long way in a specialty coffee environment. But it looks like The Root is stuck in the previous decade, genuinely and non-ironically. It's one thing to be stuck in a previous decade or two or three on purpose; that usually means that you're hip. But clutter and poor design is a bit unappealing. I'm not complaining. (Wait, maybe I am.) Because the fact of the matter is that eclecticism and such is the charm of the Root."}
{"text":"There isn't anything I don't like about The Root Cafe.  I've been there more times than I can count and have had excellent food.  Sometimes the staff seems a little aloof, but that's ok.    Important to note is that there's now a raw food night every Thursday.  The menu changes weekly and is posted on their facebook page. I've been there a couple times for raw food and everything has been excellent.  Especially the nachos!"}
{"text":"I've only ever had their Carrot Muffin, as I am not a coffee drinker, but it's amazing!  Check them out :)"}
{"text":"Gosh I love the root. It just has such a relaxing non judgmental or pretentious vibe to it. I am by no means vegan or vegetarian, but I love that I can come here and experience wholesome and delicious vegan food. Everything I've had has been delicious including pour overs, chai lattes, pizzas, scones, and the taco salad. I just love how different this place is. If you need an hour or so to sit and reevaluate your life I'd probably come here    Service is kind of a mixed bag. I've had less-than-enthused-borderline-rude people take my order and I've had fantastic servers that brightened up my entire day. Prices can seem high but they're still reasonable. I would probably expect to pay $9-13 on food and $2-6 on coffee per person.   Love that they have local artwork and hand made mugs for sale as well as a large collection of books to browse."}
{"text":"This place can convert any omnivore into a vegan. (Or at least get them to go veg for a day.) The pizzas are great, the sandwiches are divine, and the hot open faced mushroom and hummus sandwich with a lemony vinaigrette is just mind-blowing. Plus, the coffees are just lovely. If you can snag a table (which can be hard to do), you could spend a very pleasant day with a great book."}
{"text":"Love meeting here to catch up with friends! Love their coffee, different flavors of kombucha, and I've been there for breakfast // dinner. I had the root pizza the last time I was in and decided to try something out of my comfort zone and it was amazing! Every bite was delicious! Will be back soon!"}
{"text":"I came here for dinner with my sister and it was delicious. The atmosphere is great for studying or getting some work done. I got their lemon ginger tea and it was delicious. It was also less than $2, which is great.  For our meals, I got their soup of the day which was a spicy coriander soup. It wasn't my favorite soup and it wasn't that hot either, so I wouldn't recommend it. I got the culture sandwich (tempeh, pesto, spinach, and chipotle aioli). There's supposed to be tomatoes in it but I subbed that out for cashew cheese and it was very tasty. The sandwich had great flavor and was a big portion. My sister got the vegan power bowl with an egg (this was also a huge bowl). It had kale, sweet potatoes, tempeh, red bell peppers, pesto, black beans, and more. Her bowl was delicious and had lots of flavor.  The prices here are also very reasonable, especially for the quality of the food. The vegan power bowl is only $11 and the culture sandwich I got is $9."}
{"text":"I've heard about Root Cafe from so many friends over the years, and just never made it there until today. I'm in love! The atmosphere and people were super welcoming and friendly. I loved the various art installments, and the music. For lunch I had the daily soup (made scratch) that was roasted veggie (YUMMO) and the bean and rice burrito (2 thumbs up). I went in there starving and came out comfortably full. My only regret about Root is that I didn't try it sooner!"}
{"text":"Had the String Theory calzone for lunch today... When it arrived at the table I thought \"woohoo, lunch AND dinner...\"  Sadly, it was too delicious and I demolished the entire thing in one sitting.  I'll definitely be back."}
{"text":"I had the roasted root salad and it was amazing. I paired that with the chai and had a pleasant start to morning. Will definitely add this to one of my regular spots!"}
{"text":"Coffee is very good, but service is slow.  Not a coffee shop that you can just pop into for a quick drink."}
{"text":"Crowds swooned at the veggie foodstuffs on our last visit. One diner hunched over his Root Wrap ($9), concentrating on every bite of avocado and kale drizzled in chipotle aioli (the latter an entirely perfect, flavorful sauce). Elsewhere, the On The Road ($7), a zesty amalgam of beets, (local!) goat cheese, and caramelized onions potent enough to inspire journeys of peripatetic ecstasy, gets the Dean Moriarty seal of approval. The noise level within the stylish chalk+art expanse of The Root was relatively high, though not entirely obtrusive: apart from the typical clatter and wheeze of various coffee apparatuses, the soundtrack was composed of jangly indie standards, with a few old-school-cool jams thrown into the mix for good measure. Food was delivered after fifteen minutes or so, the implication being that each dish was assembled to-order. As this is a Café, the hot beverages ought be a driving allure, and they do, in fact, really, really deliver, particularly the chai, which is, well...more chai-y than most, both smooth and spicy with a tang of mildly tongue-stinging sweetness running through it. In sum, The Root is the prime place for vegetarian foodstuffs in Lakewood. Nothing else even begins to compare."}
{"text":"I AM OBSESSED! The Root Cafe is veggie heaven for Westide/Lakewood area. You get healthy mostly organic food at a decent price. The sunbutter cookie is to die for! My mom and I shared their taco salad, clevo sandwich, and coconut curry soup. All three were delicious. The root tang dressing is amazing, too. There's a decent amount of seating, parking is fairly easy, and there are daily specials. Also--the coffee is GOOD. Almond milk is made in house and is so yummy I got an extra mug of frothed almond milk after downing a latte.   Sidenote: bring a sharpie for the bathroom wall! :)"}
{"text":"Have been a regular here for the past month. I love all of their food and drink options. If you are vegan, you can request the nut milk in your drink which is house made- made with walnuts and sunflower seeds (I think). It's really flavorful almost addictive may I add?. Try the Mexican hot cocoa for a nice kick from a hint of cayenne- it's a flavor party. Their sandwiches are well crafted with a perfect balance of flavor and texture. I especially enjoyed the breakfast sandwich with pesto, feta, spinach and garlic. Their soups are really delicious, I love the lentil one and I usually get it with rice instead of bread. They source ingredients locally and mention where they get their produce from. Most of their raw materials are from local farms or other local businesses. Great if you want to support the \"buy local\" movement."}
{"text":"Quality vegetarian food at affordable prices. The food is innovative and the coffee is fresh- the Burundi pourover is one of my favorites. The peanut red quinoa cookie is not only vegan, but filling and super tasty and service is top notch. I really love this place, and hope it sticks around forever."}
{"text":"Coffee was better than Starbucks ... nice earthy place... had my Chai Tea with soy... would come here again but parking was annoying to find..."}
{"text":"I'm hesitant to write a review of this place because I want to continue to be able to get a table here.  However, I love this place so much, and would love if it ran the chain store across the street out of business and then somehow annexed that space, added a pedestrian skywalk made of locally sourced lumber and steel.    No, I'm not currently being prescribed any medication.  Thanks for asking.    Anyway, the coffee is great.  On cold days, I go for a Mexican Black and Tan, which is hot cocoa with espresso and a little cayenne.  On warm days, I get an iced Cafe Phoenix.  The staff is friendly, not pushy, and just generally the kind of people I'm glad to have handle my food and drink.    As for the food;  wow.  I regularly go here with a hard-core carnivore, and she adores the place.  The pizza/calzone dough is just fantastic, and the veggies all have vibrant flavors.    Honestly, it's a pretty good place to do homework or read, too.  No one really seems to bother anyone else, it's all reasonable, the wireless is reliable, and there's enough power outlets."}
{"text":"Man I want to like the Root Cafe. I really do. I even wanted to give it four stars in this go, but that doesn't mean total satisfaction. It was good, GOOD, easy, normal.  Mediocre is too bland of a word to describe a place that has a dull sheen. It's a practical and eclectic place for sure. If you read the other reviews, you get it. The coffee is good, the food... all vegan/vegetarian fare is fantastic, and the service is fine too.  We had a wrap and a tempeh sandwich. They were both great. But I have to be real, I was turned off by the ambiance. If you want to stop by here for a nice Sunday brunch take-out, you're set. But if you're hitting up the Root cafe on the weekend, consider it busy and not so suitable for a quiet place to have a bite and chat."}
{"text":"Cool vibe for this vegetarian and vegan restaurant / coffee house.  The rueben did not hit the mark in terms of flavor so I would definitely skip that going forward.  The special of the day was a curry which my niece like a lot, plenty of food left to take home"}
{"text":"Very cute and trendy spot! Love the organic and environmental approach of this cafe, the syrups are amazing! I loved the lavender latte!!"}
{"text":"I came to The Root Cafe looking for a good vegan brunch. Unfortunately, while they open at 6 a.m., they don't actually start serving food until 11 a.m.  (why doesn't their website specify this important detail??). I was only passing through Cleveland and was in a rush so I couldn't wait around an extra two hours for them to open their kitchen.  However, I did have some baked goods such as a cookie and a crumble-bar thing (their only vegan options) and a cup of tea. The tea was overpriced but at least they have a decent selection of loose-leaf varieties. The baked goods were decent but didn't blow me away.  This place isn't particularly vegan-friendly or innovative. Most of the sandwiches are basic with different vegetables, and there's also a brown rice stir-fry and a variety of stone-oven pizzas (they don't have any vegan cheeses, however). All of the sandwiches are either $7 or $9 and the pizzas cost $9-13. It's a pretty pedestrian menu and slightly over-priced.  Given the dearth of vegan options in Cleveland, I suppose Root Cafe isn't a bad joint. But it's could certainly go further in providing interesting vegan items (how about some tempeh or tofu sandwiches/tacos/Italian pasta dishes? How about a lasagna made with TVP or seitan? How about vegan nut cheeses? How about vegan breakfast sandwiches/bagels? I'll take anything, people)."}
{"text":"I went here last night. I love the vibe. Live music in the background and I loved the paintings on the walls. Very chill and relaxed atmosphere. I also tried a Mayan Mocha which I loved. I will definitely be back. I was there meeting someone so I was trying to be cute however next time I'll get more to eat and drink."}
{"text":"This is hands down the best place in lakewood to eat or grab a coffee. Local, organic, friendly, AND cool.   the root is one of the only reason I still live in lakewood.   check it out on Thursday for raw food night or tuesday for the open mic,  so much fun!!"}
{"text":"Wow! I was pleasantly surprised with this cute little cafe. I thought I was just walking into a coffee shop but it was so much more. Every chance I get, I try gluten free foods and The Root Cafe had an abundance of that.  I had the winter wrap on a gluten free tortilla. It was so flavorful and I loved the sweet potato! There was just a little kick from the chipotle spread and peppers.   Of course I had to snag a bite of my friends hummus as well....yum! So creamy, and I loved the array of dipping choices. A whole plate of veggies and pita. So much nicer than just bread. The whole raw food movement is pretty cool to me. Obviously I will return!"}
{"text":"WTF.  So, I was in The Root a short while ago, minding my own business, working on my laptop and drinking one of their lattes, along with many other patrons doing the exact same thing. I did this same thing this past Saturday night and multiple times previously. After about less than an hour of sitting, a waitress approached me and very warmly asked me to go share a table with someone else so that a group could dine at my table.  WTF.  Seriously? You just asked me to relinquish my table in a coffee shop? Who does that?? I have nothing against germs or table-sharing, but everyone in the place was drinking coffee and working on their comps...1) why did they choose ME to displace, and 2) why am I any less valuable of a patron than the people who want to eat?? I have never in my life been asked to move somewhere else in any restaurant, bakery, bar, or COFFEE SHOP. You're a coffee shop, you make most of your dollars on people like me, who work on their computers and chug coffee!   Um, I don't feel like relocating, I don't feel like being displaced, and I don't feel like being treated like a second-class customer. So, I left. And came to MoCa, who kindly invited my patronage.   The Root will never see my business again."}
{"text":"Please take note:  I just finished one of the outstanding sandwiches I've ever had.    As an omnivore, I know sometimes vegetarian preparations are at a minor disadvantage in some books, not the case here.  The culture is an exceptional sandwich, nothing is missing, everything is right:  tempeh, pesto, the zing of the chipotle aoili, some fresh greens.    Having consumed at least 8,000 sandwiches so far in my life, I know what I am talking about."}
{"text":"The gentleman who helped me was super sweet.  Had a delicious vegan lemon poppyseed muffin and delightful breakfast sandwich with my iced toddy coffee.  All my to go stuff came in recycled paper containers which makes my heart happy.  Will definitely stop in if I ever get the opportunity!"}
{"text":"AMAZING. Easily some of the best food I have ever eaten. The atmosphere is just as amazing as the food and drinks. I highly suggest raw food night!!! You will be pleasantly surprised!! :)"}
{"text":"Extremely hipster. Always busy. 4 starts bc everything is basically vegan and I'm not, which isn't a huge deal, but, ya know. If you can manage to grab a seat it's a nice place to chill. It's cool they have signs you can put at your table that your willing to share a seat, especially since thy can be hard to find. It's nice there can be places like this that haven't been shut down by Starbucks."}
{"text":"Friendly staff, wide range of pour over coffee from numerous countries and delicious and unique vegan friendly pastries/bakery treats. Great for grabbing some caffeine when you're on the run or if you'd like to hang out while working on a project or meeting clients in a coffee shop w/ wifi."}
{"text":"My favorite go to resto for lunch ... Fresh foods integrated into dishes with complex flavour combinations. Colorful and appealing. Friendly service. Open atmosphere. Cleveland best cafe and coffee. Too bad it's located in Lakewood."}
{"text":"I think the drip coffee is pretty good, but some of the espresso drinks just don't taste that good. I have never had one i loved.   The food I have  had has been just ok as well, and a little overpriced.   Almost every time I have been here the service has been slooooooooow, sometimes a little rude. I don't  think it's because they are taking great care to make your drink right....i think they are just slow. So watch out if you are on a schedule, build in some extra time to wait as they slowly make your drink or grab your food.     It is a cool place to bring an out of town guest though. Kind of a hipster vibe. There is usually some local art for sale on the wall.   I also think it's good for people watching and reading a book. No one seems to care if you hang out for a while. Just wish the food and drinks were more memorable."}
{"text":"I am going to have to deduct a star from my rating - still like the Root, but my husband and I have a hard time wrapping our head around the prices here. We just can't do $4 muffins and $9 sandwiches with no sides - I LOVE the Root Wrap but it was SO MUCH smaller this last visit - I was shocked. I also made the mistake of requesting tempeh added - this got me like three strips for $4. So this made my small wrap $12!"}
{"text":"Vegetarian/gluten free/vegan friendly café.  Delicious coffee and cozy atmosphere.  I would recommend the miyan mocha.  Always."}
{"text":"I've been a big fan of Phoenix Coffee for years, and I always loved Phoenix in Lakewood! The Root Cafe is Phoenix reimagined! Still the same great Phoenix Coffee (locally roasted) and loose leaf teas, plus great food, all cooked in house. I have not tried a ton of the food, but what I have tried has been excellent. Their pizza is quality. Sunbutter cookies- TO DIE FOR. Pretty much any muffin or scone I've ever tried has been delicious.  The vibe here is everything I look for in a coffee shop. The baristas are hip, but not too cool to talk to you. They are super friendly! The decor is original, and you can tell the place was decorated with love. It's not trying too hard, but it's really warm and welcoming. There are big tables, small tables, and a bar facing the window to sit at. It is well lit. It's great for sitting and reading, writing, working, catching up with a friend, people watching, etc. This is by far my favorite coffee shop on the West Side. If you haven't been yet, CHECK IT OUT!"}
{"text":"This is a great place to grab yourself some thinking time and great cup of jo! The oatmeal raisin cookies are awesome and the setting is perfect to chill! The people behind the counter are very helpful you will see me checking in at this place more often!"}
{"text":"Hello, the Root! I love you! I wish you were closer to me!  The Root is a beautiful coffee shop that serves lots of local produce (and sources its coffee from Rising Star Roastery newly located in Ohio City) and delicious treats. I love their vegan whoopie pies, and when I'm feeling decadent (which is most times!), I'll pair it with a small iced mocha. Sugar overload but it almost feels healthy because the whoopie pie is vegan...right?! Right!  The space is wonderful and I'd love to be able to hang out here every day. However, it's a bit of trek to bike ride over there as often as I'd like, but whenever I'm in Lakewood, I HAVE to stop by the Root."}
{"text":"Stopped in wanting something healthy for lunch which I got but just wasn't fully in love with what I had. I tried one of their wraps that had avocado and sweet potato in it. It was extremely filling but the wrap itself just didn't thrill me. I would definitely come back though and give something else a try."}
{"text":"This is a gem of a place in Cleveland. The staff is always friendly, helpful, and patient (while people like me take FOR EVER to figure out what I want!)  The coffee is really great, from a local roaster in the area (rising star) and they make creative drinks with their own syrups. The entrés have always been fresh and they have plenty to offer the gluten free crowd. They use local, sustainable and almost all certified organic for their produce, which is a must for me when I'm eating! As a former vegetarian of 6 years and now a conscious meat eater, I find this veg food to be creative and well seasoned with nice, balanced flavors. I love to see restaurants do this and make it a point to engage local farms. The deserts are always phenomenal. I've only had the gluten free ones, but they have always been amazing. I've been a handful of times and have never been let down by this place."}
{"text":"I've only had the Mexican hot chocolate, but oh boy... So rich and delicious. I also LOVE that they have locally made baked goods with a handful of vegan options. Even if you aren't a vegan, vegan baked goods are worth trying. Great atmosphere for all crowds. And my cousin's face is painted in the men's bathroom randomly! Love it haha"}
{"text":"A cozy shop with a great selection of baked goods and coffee. I got the vegan banana walnut muffin and it was DELICIOUS. I also tried their house-made almond mylk in my latte and it was exceptionally tasty--a must-try when you visit this place.  Definitely would recommend this shop if you're in the area. I'll be back for more lattes and to check out their Sunday brunch!"}
{"text":"We happened upon Root Cafe when our first choice restaurant's vegan options were rice & beans and chips & salsa. I am glad the other place didn't pan out, as Root Cafe is wonderful.   Order at the counter, take a seat, and wait for your delicious food to arrive.  The selection is varied, and we were thrilled with our choices: Tempeh Reuben, Root Wrap, and sides of Goddess Kale Chips and Beets with Basil. The food was so fresh and delicious!  This cafe is on my list for my next visit to the Cleveland area."}
{"text":"Once upon a time, long, long ago this used to be The Phoenix.  See my review right before this one.  Now it's The Root Cafe.  When I came by on my visit to Lakewood, anticipating my nirvana (the mocha made with toddy, see previous review) I was not happy to see The Root had taken hold and The Phoenix was gone.  After going in and talking to the nice folks, I found that they have a strong lineage to The Phoenix and continue to make great toddy.  *relief*  Once I saw what a great space they have, the nice community feel, the friendly service and the same great toddy...I approve! @therootcafe"}
{"text":"I loved this cafe. I'm visiting from Portland (OR) and I felt completely at home when I walked in here. My only complaint is that the whole organic ethic they present seems questionable when the only half and half they offer is the cheap stuff. What I can see (as a customer) is organic and ethical, but behind the counter is a different story. Service was great, food was great, tea options were wonderful, but make sure you don't assume anything. Ask questions."}
{"text":"Spacious coffee shop in a good location in the middle of Lakewood. Good coffee and breakfast/brunch plates. More than enough seating and tables to get work done and catch up with friends. If you appreciate woodwork in your coffee spot, then Root Cafe is the place for you. It's relatively steady, crowd wise, so there's always a good conversation opportunity to be had."}
{"text":"Love the Root. Their rice and beans w kale and broccoli is a stable. Its the heart of lakewood!"}
{"text":"12/2016 My previous update knocked off a star for being out of dairy free milks on a frequent basis, and lack of consistency in their mochas. I'm happy to say they've been doing much better on both fronts because over the last few months, I have enjoyed my mochas immensely. So happy about this!! They do occasionally run out of Almond milk, which is understandable since it is homemade, but I've had no issues with not having a back up option.   I have been coming here since they opened, and for years before when they owned The Phoenix next door. I love the Root. It is a haven for vegans (and vegetarians, and omnivores for that matter)! All of the food is delicious, but I particularly love the Hoffman's Bicycle Pizza. The dough is handmade fresh daily. All the ingredients used are fresh, and most are organic and local. Coffees and teas are fair trade, and delicious. Their chocolate syrup is homemade and vegan, as is their almond milk. I love their Iced Almond Milk Mocha. The atmosphere is very chill, and the whole place is one beautiful work of art. I highly recommend stopping by any time of day.  Previous update, issues seem to be resolved: Update: As a vegetarian cafe, I feel they of all places, would be sensitive to those who do not drink dairy. However, they are consistently out of dairy free milks. I love this place, I do, but I finally had to knock off a star for this. The quality of the drinks has also dropped over the years. I know this is an issue of consistency as there are some people who make my mocha perfect every time, and then others when the baristas forget the toddy, or get the ratios wrong. I find myself torn as this is by far the best coffee shop nearby, and I find myself craving their mocha when I am not in Cleveland, however, it is so hit or miss these days. Hopefully I can submit another update in the future that these issues have been resolved, but for now...down a star."}
{"text":"Got to visit one of my favorite coffee shops today in Lakewood. The Root Cafe is my go to place for a cup of coffee and yummy pastry! They have a great selection of gluten and dairy free pastry as well as frill dining menu! I love the gluten free wraps they use!   I was a little disappointed today because they were out of almond milk for my latte. I tend to run of out almond milk a lot. they use a homemade almond milk so it is expected to run out ... but maybe they could be from having a store bought kind for back up rather than resorting to soy (which I won't) or jut go with the dairy.. I went with a little dairy today because I really wanted my latte... let's hope I am not constipated for a week (too much info?)   Update:   I got a almond milk half caff dirty chia latte ... and it is sooo good!"}
{"text":"The best coffee shop in Lakewood, great vegan options. Food and coffee are both great. Food is on the lighter side so don't expect to leave stuffed but the quality is good. Dining in can be weird, they use a weird table number system that seems inefficient. I think you're supposed to bus your own table but you have to hunt for the place to put your used dishes."}
{"text":"The Root Cafe is a lovely place with friendly service and good food and drink.  A word of caution, however: the burrooto is very cilantro-y.  If you are cilantro-averse, like me, you might want to order something else.  The burrooto sauce is delicious though.  What a pickle :/"}
{"text":"Very good, affordable coffee.  I like that they offer a wide variety or sizes, you can get a literal 8 oz. cup or something more comparable to a big gulp if that's what you're into.  The ambiance was excellent and baristas charming.  Everything you want in a coffee shop."}
{"text":"This is my favorite coffee shop in Cleveland! It's full of hipsters and has that distinctive organic smell. (I'd rather be surrounded by hipsters than soccer moms. grannies, and yuppies as you'd find in the suburbs of Cleveland..) They have cool wooden deco, large windows, and paintings by local artists adorning their walls. They play live music and poetry every now and then. It's a good place to veg and meet with a friend or play board games.  It's always crowded, so you have to come at a good time or wait around and eyeball your space.  I recommend the chocolate vegan cupcake, beet sandwich, and their Mexican hot chocolate. I never liked or knew how good beets were until I tried their warm beet sandwich!  :D"}
{"text":"Coffee is pretty good. I had your plain ol latte. It was hot and tasty. I'm no coffee snob but the coffee is nice. Seems like a good place to hang out whether you a hipster or you have a job. I kidd I kidd."}
{"text":"Delightful!! Went to lunch here today with my sister and my little nephew (3yr old). The food was awesome. I was full the rest of the day but in the best, satisfied way. We had the amazing sunburst salad- divine. Split the roasted veggie sandwich and roasted sweet potatoes. We got the little dude a plain pizza.  Yum- salad was bright, crisp and perfect. Simple but so perfect and spot on with the flavors. Loved the fresh and homemade dressing.  The sandwich was awesome. We split it and the whole one might have filled me for a few days. Great flavor, awesome bread. The pizza was so fresh and you could taste every ingredient. Still thinking about how chewy and delicious the crust was and how  the sauce was so rich and yummy- but I love natural flavors and prefer real tomato flavors.   The funniest part was that the little dude ditched the pizza for the sweet potatoes! Since they were white (not yams) he thought they were fries and with the awesome (homemade?) rich ketchup he basically ate the whole order.  Will definitely be back. Will even grab a salad and pizza to go when I want some hearty goodness.  This place is worth it for the fresh, local flavors and great ambience."}
{"text":"A very colourful a trendy spot for sure! I had the string theory calzone which was filling and cooked well, however, the icing for me was the smoothie. I believe it had soy milk, strawberries, banana and honey and is a must have! I did find the smoothie pricey for the quantity they offered and that is what takes away that 1 star from this review."}
{"text":"I love this place.  It's the old \"Phoenix\" in a new, larger location.  The staff is still amazing and it's a great atmosphere.  One of the coolest things about it is how someone painted portraits of some of the most loyal customers in the bathrooms...I know that might sound weird to some people, but I think it's awesome.  See Brandon I.'s review for a great description."}
{"text":"UPDATED REVIEW:   I still LOVE the Root Cafe.  My all time favourite dish to order is the culture sandwich. In my opinion, this is by far the best item on the menu. I am not even a vegetarian but I love this tempeh sandwich. Try it!!!  The \"my egg sandwich\" for breakfast is absolutely delicious. I think the avocado and cilantro inside really bring out the flavour of the sandwich.   I've also tried the \"vegan style burrito\" which I didn't actually order. A friend ordered it and I eat almost half of it. It was very good but I didn't realize it has onions inside so I didn't like it as much (I hate onions).   I've had the Root Wrap twice now and while it is tasty, I didn't like the mushiness of it. It either has too much chipolte aioli or sweet potatoes. The wrap ends up being too soft/mushy; thus, when you try to bite into it, some parts fall off.  Live music is here on some weeknight evenings so call ahead or check out their website for a list of events if you are interested in listening to a band. Or just call ahead if you want to come here to work or study because I know I can't concentrate too much if loud music is on."}
{"text":"Chi tea for the win! In recent years I have found a new found love for tea...many different teas but my go to one in the winter is chi tea and let me tell you their's is good really good better than starbucks good. Tried one of their cookies, was worried as they look hard on the outside was pleasantly suprised by the softness and flavor. Tried their artichoke soup and well it just wasn't for me but would love to come back and try some of their other options."}
{"text":"Root Cafe rocks.  Oh, Root, I've been looking for you. Wide strong wood tables, lots of seating, and good coffee with food options? And adequate outlets? And wifi? Oh how I'm glad I found you.  Per suggestion, we drove to Root Cafe so we could get some work done on a Sunday afternoon. They have a wide selection of teas and coffees- I got this espresso latte mixed with toddy- and it was strong, but oh so tasty. He got the Mexican hot cocoa- and man, it had a bite to it, but it was good.  It's definitely a hipster/young professional feel to it..but I really like that. If they had live music, that would top it off. Nonetheless, I loved Root Cafe. Finally, a cool original coffee shop to frequent!"}
{"text":"Best food and atmosphere in northeast Ohio... Vegan options are so appreciated, coffee, espresso and kombucha drinks hit the spot. Soups are out of this world and be careful when ordering the tempeh Reuben, you will be addicted and henceforth require at least one a week. Artwork and laid back vibe, also much appreciated"}
{"text":"Being a vegetarian, it's always a challenge discovering new places to eat. And The Root Cafe nailed it!  We ordered the Mexicali pizza, couple of different teas and their soup of the day and everything was just fantastic! Definitely a place we'll regularly visit.."}
{"text":"Always a great place to meet a friend, or get some work done, or just hang out.  Coffee is good, food is all vegan.  The surroundings are very comfortable.  Pro Tip: They rotate syrup flavors (sourced from another business in town) - be sure to check the sign to see if anything catches your eye!  I love adding peppermint and other flavors to my drip coffee."}
{"text":"Met someone for a morning coffee before work. Had a Black n Tan which is espresso with hot chocolate and a homemade muffin. YUM  I even got to pet a few dogs. Great way to start the morning!"}
{"text":"VERY TASTEY!!! Being a vegetarian, this place is awesome! It's definitely more of a lunch place rather than a dinner place since they don't give you much food. It's also pretty $$$. Everyone is super nice! It's also ways busy. It's a very laid back, hippie vibe. The silverware can be kind of dirty, so watch out!"}
{"text":"The Root Cafe is always bustling. From the expertly made coffee, to vegan friendly and hearty dishes. Highly recommend the vegan Reuben made with tempeh on rye for lunch. The atmosphere is eclectic  there too. Hipsters,  families, foreigners all gather here. Snag a seat by the window if possible."}
{"text":"I really enjoy The Root. I have been supporting them since it was Phoenix a few doors down and I worked at The Record Exchange. The Lakewood bashing of the previous reviewer is pretty funny. I think Lakewood is a good place as well as Root. I go there with my vegan brother. It is a good thing that there are places that cater specifically to people who don't eat meat. There is a BK right across the street if you want to eat meat, so the location is ideal. The same BK where I had a knife pulled on me in grade 7 when a guy tried robbing me for my fries. I tried to ride my bike away but the chain popped."}
{"text":"Great work and study spot during the day. My go-to! The cool, cozy and relaxed atmosphere makes me feel as though I am in a cafe in Venice, California (a nice escape during winter!). Love the healthy meals and daily specials and would love to see more offered on their regular menu. Always great service and I like that the Root is always populated with people, but never too loud to work (bring headphones).  We need more spaces like this in NE Ohio!!"}
{"text":"Too much beer at Fatheads led me to Root Cafe in search of a pick me up. I had never gone into the old Phoenix because it was always way too crowded, and i don't carry my bongos with me. The new layout was more my speed. There was still the contingent of boho poetry slam jam Phish phreaks. But i noticed a wealth of patrons who actually may have jobs and shower regularly enjoying a cup as well.   I had a dread eye. Don't know what's in it, don't care. I am not an Arabica regular who can reel off the name of his favorite drink with all the annoying alterations. I just pick what sounds cool. It was very good coffee. It almost seems like the place \"grew up\" just a bit from a teen hangout to the kind of coffeehouse that could garner a national profile on Food network or something.   I can see myself stopping in any time i'm down on Detroit road. Panera cannot compete in the coffee arena, maybe sandwich arena. And Caribou is just so sterile.  It was funny. As i walked away, i could see the people in Caribou in their Uggs and p-coats staring at the hippies across the street in wonderment. Both should have spilled out into the street in a West Side Story styled dance-fight number."}
{"text":"Being a part of the coffee world I am extremely critical of coffee, but recently I've come across Root and I'm not disappointed!  The baristas are knowledgable about origins, flavor profiles, disciplined in knowing how to make drinks and can hold great conversation when they're not busy.   The rooms atmosphere is that of a college coffee house, and I cannot complain! Hands down one of the best coffee shops in Lakewood!"}
{"text":"These guys are amazing.  Twice I got service which I consider way above expected.  They had no decaf coffee, made me an Americano to go with my sandwich, had already presented me with a bill, and refused to charge for the coffee.  Then, I went and ordered a decaf, which they subsequently had brewed.  They ran out, so I didn't quite get a full cup.  Then, like magic, a small Americano showed up at my table.  Whaa?  They had a live jazz duo, and I'm pretty picky about live music, but these guys are quite good.  One of them does a good Nat Cole jazz vocal style.  Plus, the food was really great.  I am starting to come out of the holiday food coma thanks to The Root Cafe!  Glad I came back, even better than last time."}
{"text":"I went in on Saturday at 11. Breakfast service had just ended and their brunch is only on Sundays (0900-1300). Left with the lunch menu to choose from my friend got the winter wrap. The winter wrap was densely packed with food, but was served with no sides. I ordered the wet burrito which is more of a rectangular stuffed pancake than the fat circle the term burrito usually brings to mind. Mine meal was served with a small salad and topped with homemade sauce. All the sauces are made from scratch.   The cafe is a mix between a coffee shop where you can bring your laptop and stay awhile (free WiFi) and restaurant. There were some people taking advantage of both options. Despite those sticking around and the seat yourself policy there was no problem snagging a table for two. Next time I might linger myself - there is a large tea menu and Rising Star brand coffee as incentives."}
{"text":"One time someone gave me a gift certificate for The Root and I ate it because it tasted just like their food would have anyway."}
{"text":"As a drinks cafe, I could give this place a 4-5 star rating. However, the food was not good. Seating was unique - not enough seating, but they have these signs available you can place on your table to welcome others to share your table. Between three of us, we got the caffe Phoenix, cappuccino, and a chai tea. All were delicious and definitely some of the better espressos we've had. We got eponymous pizza. No pizza sauce on it (at least I don't remember any) and a bunch of veggies. It was really dry and pretty lacking in flavor. With most of the ingredients being local and/or organic, it was also pretty expensive for the portion. I could have given that a 1-2 star alone. We had to ask for some hot sauce since the pizza was so poor by itself. The hot sauce was AWESOME. Loved it, lots of flavor and just the right amount of spice. Overall, the cafe was ehhhh. I'd come back for drinks to go, but probably not more than that."}
{"text":"Coffee shop had a good selection of food & coffee is pretty awesome too. Just didn't like the unclean tables & had to ask multiple times before someone could clean them  other then that it is a fun place for ppl to hangout & have fun."}
{"text":"My friend and I love going to this cafe-- awesome wraps and great lattes!! Has a really cool atmosphere and love looking at the art work they have hanging on the walls sometimes. Giving it 4 stars because my one complaint is that customer service can be awful at times. For example, one day during a busy week we came in and all the tables were full but one. This table had dirty cups all over it and you are supposed to put your dishes away yourself. Felt kind of gross/stupid to put someone else's dishes away, so I went up to a worker and asked if she could clean the table because it was dirty and the only one available at the moment. She said no with a smile and made some excuse as to why she couldn't, but it was so loud it was hard to understand. I understand that it was a busy day but it is still their job. Eventually another table opened up so sat there instead; the other table was never cleaned lol.   There are awesome workers there, but they have hired some babies so some might take it personally if you have any sort of complaint about something. Will still go there but wish the customer service was better."}
{"text":"A nice hole-in-the - wall cafe. Fresh vegan local sourced food. (some weird artwork on the walls!) Great coffees and prompt service. Not too busy for weekend brunch."}
{"text":"Heavy on the wonderful and light on everything else that matters.  Relaxed and chill environment and easy to be kind of place and in whatever way I show up and bring in the door. Great place to just be or to be with others and the folks who work there and reach back when I reach out for a healthy dose of genuine and real.  Awesome reach on Thursdays raw foods wise and by the creationistas in the kitchen who make what they make with love and deliver it to your table."}
{"text":"The egg salad sandwich special was AWE. SOME. I almost always get the iced toddy b/c I can't get away from it. So good and doesn't require that I add ANYTHING to it.   Anyone will tell you that the atmosphere is laid back and great for getting work done, reading, or having a little chat.   Obviously the fact that they make their food from locally grown, organic ingredients as much as possible makes the place what it is.   The only negative I could ever say about it is that the price of most of their dishes is a little high (My egg salad sandwich, no sides, just two pieces of bread, salad and romaine was $7... their side salads are $7...) BUT you get what you pay for. I'll pay $7 any day for a salad that I can trust to be fresh, local, and healthy. No b/s, no additives, preservatives, etc.   I've never been here on a weekday until today... an added bonus was that I had absolutely NO TROUBLE parking on a Thursday at lunchtime."}
{"text":"I begin this review with a confession: I AM THE WORST! Going out to eat with me is like being in a Portlandia sketch: \"I'm not doing dairy, soy, or wheat these days. And I'm really trying to stay away from nuts.\" \"Is that organic? Is it local?\" \"Do you have a vegan option?\"  Needless to say, quick-service, grab-and-go dining is a minefield for me.  So, I'm giving Root Café 5 stars right off the bat for being a place that I can come for breakfast, lunch, or dinner and make absolutely ZERO dietary compromises!  On a recent trip I sampled a Fig/Orange muffin that, in addition to being DELICIOUS and house-made, was also gluten-free, soy-free, and vegan. The espresso roast I was served from Rising Star (love) was brewed to perfection. It was a perfect breakfast.  I have also partaken in their house-made burritos, soup, and hot breakfast options, all of which have been prepared and presented beautifully. Were they the best thing I have ever tasted? Maybe not. But everything was fast, tasty, well-priced, and as healthful/well-sourced as one can dream of in a café service setting.   Come here to have a quick snack that you can feel good about. Stay for the bustling energy and distinctive flavor of Lakewood.   Thank you, Root Café, for being a haven for the demanding eater! Keep it up!"}
{"text":"I keep meaning to review The Root Cafe. It has quickly become my favorite CLE coffee shop. Good bevies, good food... cool atmosphere. The boy tends to like their sweets - french toast and waffles on a Sunday morning. I almost always get the egg, tomato, and goat cheese sandwich. Everything is fresh... and local. It's amazing. Get there early on the weekends - it fills up fast.   The customers are family-like. You can even share a table with most of them if they're not using the whole thing (they will put a note out to let you know to have a seat!). Very cool vibe. The employees are friendly. They make killer fancy drinks with heart swirls in the foam. Totally Instagram worthy.   Try it. You'll be back... every.single.weekend."}
{"text":"I wasn't over the top blown away by the Root.  I like the concept, but it was poorly executed.  First off, I ordered a drink and the guy started making it, then put it down halfway through and started a drink for the next customer?  Huh?  It took him a good 15 minutes to make my Chai and other than the person he put in front of me, I was the only drink he was working on . Very bizarre.  We sat down and decided what to order - the bread my sandwich came on was awesome but the rest of it was just meh.  The rest of my group agreed with me.  I don't think I'll add this to my \"must do\" when I come home to Cleveland for a visit."}
{"text":"I loved visiting Cleveland a few weeks ago and we used Yelp to find all of the restaurants we ate at. Not only did The Root Cafe have great reviews...but we also were told by friends from Cleveland to visit.  Pros: - Large, lots of variety of seating - Lots of natural light - Great menu  - Many gluten free items (yay!) - Friendly staff  I just want to go back and eat another gluten free chocolate fudge scone! My husband got the grilled cheese and STILL talks about it."}
{"text":"Pretty crowded on weekends... I guess the word has gotten out that this place is pretty darn awesome. They feature an all vegetarian menu, house-made flavored syrups, local coffee and a ton of great bakery options.  I tried a latte with brown sugar cardamom syrup- great balance of sweet and spicy. I also got two of the grandma's wedding cookies which were SO good!  I figure most people would come in here and get a salad, so naturally I deviated and got a pizza.... no regrets. This may not be the first place that comes to mind when you think of pizza, but maybe it should be. The pizza was delightfully cheesy atop a whole grain crust that was surprisingly chewy and delicious.  This place has lots of seating and although it was quite crowded on the weekend, there seemed to always be tables/seating available. This place has an order at the counter kind of service, but they will bring your food out to you if you end up ordering a meal.  All in all, I can't think of anything to fault this place... I guess my only complaint might be the noise level if you were coming here to work or study, but I get the feeling that this is more of a 'meet a friend for lunch' kind of place rather than a study spot. Overall, it's a fantastic cafe that can boast way more than just good coffee!"}
