{"text":"Great place very friendly relaxed also licensed . Have been there twice now and always great . For those who eat roti and remeber Lena from I love roti well I found her It's her place . From the roti to the jerk chicken potatoe balls ."}
{"text":"Terrible customer service. Majority of the items on the menu weren't available. The rice was pure mush. I'd recommend Patois over this restaurant any day!"}
{"text":"I have been here many times and love the food. Lina is wonderful. I have eaten Rotis in the Caribbean and these are better!"}
{"text":"Delicious roti! Awesome friendly service. Reasonably priced. My new go to in Pickering!"}
{"text":"The best jerk in the area. Every thing else on the menu is really good too. Tastes like home cooked meals. All that with exceptional service, you can't go wrong with this place."}
{"text":"The best chicken roti ever. Sauce is spectacular and chicken is cooked perfectly. Generous portions for really reasonable prices. Homemade pepper sauce is delicious. Sodas are also good"}
{"text":"Great roti,especially the beef.Its the only place i buy Roti.The ambiance is casual,real caribbean vibe.Owner is personable and friendly.I recommend this place above other nearby roti shops."}
{"text":"Great Fresh food.  This place is in my top 3 for Roti. Be careful, their hot sauce is really Hot.  Guyanese style of cooking.  A must try.  avoid the restaurants beside it, go here!"}
{"text":"Had the goat roti tonight and it was sublime. Gravy was delicious, the meat was tender, and best of all, the service was excellent. A must try is the house hot sauce, the chef makes it herself and while crazy delicious, it. is. hot. AF. 

A warm and welcoming atmosphere, the delicious smell of curry in the air, all while a cover of Islands in the stream plays in the background. If you're craving roti, look no further. 

Roti n ting and Rotilicious are SHOOK.
5 stars."}
{"text":"Had chicken roti, great flavour but a little on salty side. Owner was very friendly. Portions very good, packed with loads of chicken and potatoes. Next time I will try with rice."}
{"text":"Excellent Roti, had the chicken curry and it was excellent. Good level of spice and the lady was so nice!"}
{"text":"Soooo good. LOVED it. Spicy, tasty and great service.  Will go back for sure! Thank you!"}
