{"text":"DO NOT BRING YOUNG CHILDREN HERE - they have no idea what to do with them. When this place first re-opened after it was re-done, I used to go at least once a week. As time went on, the quality of the food and the service declined and I can now say that I'm done and I will not be going back. Despite the convenient location and my history with the place, nothing about it (especially not the food) is good enough for me to go back and be treated the way I was - as a mere inconvenience and a potential paycheque/tip.  To sum it up in a nutshell, the food is average, the service is garbage, the amount of time it takes to get your food is ridiculously slow. The servers don't care at all and the owner/manager (whoever he is!) could not care any less about customer service.  Although they have crayons for children, they have no clue about feeding the younger ones and that they can't wait 45 mins - an hour for food. The put hot plates in front of the baby and were not mindful when refilling coffee (um, yeah, don't do it over his head, please). Our food came out one by one and we didn't get to eat together. All in all it was a terrible experience and listening to the owner/manager speak is infuriating. He has zero respect for his customers so I am going to take my money elsewhere."}
{"text":"We went there for an breakfast on a Sunday morning.   Homeway looks nice from the outside and also looks cozy on the inside but once you sit down you don't have that feeling.  The good: - friendly staff, not too busy (we went at 9am on a Sunday) - ample parking in the area - Challah French Toast was pretty good  The bad: - The tables had a strong odour of ammonia-based cleaner - Super slow service - Poached eggs were cold and had a strong taste of vinegar - The fruit was probably chopped with the same knife used for the onions since our fruit tasted like onion  Would I recommend this place? No Will I return? No. There are a few other better options in the same price range in the area."}
{"text":"Overall, average food and below average service.  We were ignored in the doorway by everyone walking past and working less than two metres away for about ten minutes before even being acknowledged. After we ordered, the food came reasonably quickly but my order was wrong. The food wasn't great: the 'fries' were soggy potatoes, the beans were lukewarm and the bacon was really fatty."}
{"text":"I'm shocked with how poorly this diner is rated. I have been there a lot, and every time I've ordered the French toast. Nothing compares. If your a French toast lover this is the place for you. I can't comment on the rest of the food, but I can comment on the relaxed, high end diner atmosphere being a really nice place to eat French toast on a patio in the sun with a glass of fresh squeezed orange juice.  Also, they serve real maple syrup rather than the rest of the diners in the neighbourhood who offer table syrup."}
{"text":"Excellent service! Our waitress was really nice and informative. I was very undecided and she helped me make my decision. I got the pulled pork. My only issue with it was it wasn't on challa bread, which is what the menu said it would be served on. Either way, it was forgivable. They let us sample the salmon and though I'm not a fan of fish, I'm told it was very good."}
{"text":"Had breakfast here today and it's now my new favourite spot! Love the club!"}
{"text":"We came around 9am on Sunday and there were plenty of free tables to choose from, but by 10am there were at least 8 people waiting.  We ordered the pulled pork eggs benedict with baked beans and the smoked duck confit eggs benedict with homefries.  Both eggs benedicts were great, although the pulled pork sauce was too sweet for my taste (some hot sauce did the trick).  The reason for the three stars was because the baked beans lacked serious flavour and was lukewarm, and the homefries were barely room temperature.  It's too bad, as I had high hopes this could be a regular restaurant for us."}
{"text":"The place has gone SO downhill! My boyfriend and I used to come all of the time, it was our favourite breakfast spot in the neighbourhood. Moved away for a bit and just recently moved back so stopped in for breakfast last Saturday. You used to be greeted by the manager or owner and offered coffee while you wait, eagerly trying to find you seating. We stood around for a bit when a server eventually noticed us and took us to her section, took our drink order, got our drinks fairly quickly ($9 for juice??) and took our food order. We both asked for eggs benedict poached medium, I asked to substitute my hash browns for fruit (the fruit here USED to be very fresh). Our eggs took over 30 minutes to come (it was busy but not close to full in the restaurant). Our server never came to refill our coffees while we waited or even once our meal finally arrived (delivered by a different server). My boyfriend's eggs were rock hard and mine were completely runny. My fruit bowl was exactly the same as the pathetic few pieces of wilting fruit in my boyfriend's meal, with the addition of three rotted looking orange slices. Yum! Still no appearance of our server with a coffee refill and we were both done our juice and really wanted water. The busboy noticed we were looking around for our server and offered to bring us water and got our server to finally come fill our cups. She asked how things were while she rushed off to refill other's coffees, and we said \"okay\". The table next to us, hearing us complain, started to laugh (they were paying their bill and asking each other if they really had to leave a tip since their/our server was so awful). The busboy came to clear our table which meant we then sat trying to flag our server down for another 20 minutes with our table clear and eventually I just got frustrated and got up, found her socializing with other staff at the front, asked for our bill and mentioned that not only did we wait forever, but our food was bad and our service was non existent. Her response was, \"I asked you how it was and you said okay.\" She dropped the bill and another 5 minutes went by before we decided to just get up and pay at the front. To sum up - we'll be finding a new local spot for breakfast!"}
{"text":"I've gone here a few times because the location is convenient, but it's really average. It's untidy (not full fledged dirty) and the food is only ok. I've had the eggs/bacon or peameal/ w/ toast/potatoes. It's somewhat bland but they give you a lot of food. The price is alright for the amount of food. Again, I mainly go because it's close to my condo and I don't have to pay for parking."}
{"text":"This place was great! We went earlier in the morning for brunch and it was really nice, calm and quiet. As we were leaving around 10 the line started to get long. They have a fantastic patio. The service was super friendly and really attentive. The place is not squished and the tables aren't tiny so you don't feel uncomfortable which is great. The food was fantastic! I got the hangover breakfast with french toast and it was soo good! I haven't loved french toast anywhere lately but it was absolutely fantastic here! I couldn't even finish it all it was huge.  All in all loved it! Definitely recommend it."}
{"text":"Brunch is really good! Expect a wait though and the service is a bit slow. I love that it was renovated from an old diner of the same name."}
{"text":"Terrible. If you want burnt coffee and dozens of fruit flies to swat at during breakfast come here."}
{"text":"Love this place. A little crowded when we visited but, service was efficient and food ample and tasty.  Nearly applied for a job as a cook here before we came back to Toronto."}
{"text":"The ambiance is OK but the eggs benedict are excellent, including the vegetarian option. Service has always been good. I have been here some of the busiest days of the year (mothers day and fathers day) and service has always been good.   Good kids menu too.  This is one of my local favourites for brunch"}
{"text":"Very nice place to have brunch. The food is good and the staff are friendly. They have outdoor seating for the summer months. Would recommend the steak and eggs or just the classic bacon and eggs breakfast."}
{"text":"Never again. I was a fan for a long time, but having waited for over an hour for pancakes on a quiet weekday afternoon, I'll never be back.  After an hour and fifteen minutes when I saw tables that arrived after me get their food, I told the server I was leaving. She asked me if I wanted my food to go I said sure. They gave me my meal for free: yay burnt pancakes and undercooked bacon."}
{"text":"My favourite place for brunch in Toronto. Fast service, even when there is a line up - friendly owner and waiters will offer coffee and ensure that you know that you are being looked after.  The best things: - Banana Grand Marnier pancakes. Get this as a share if you have 3+ people - Homefries are excellent - Portion size is generous - Continuous coffee refills - Kid and adult friendly (hair of the dog cocktails, fresh juices - in the other order obviously)  I'm not sure why they have such a low rating. I have been coming here for 4+ years and have never been disappointed."}
{"text":"My husband and I decided to give this place a try and were pleasantly surprised.  The interior is cute and cozy, but we sat outside on the front deck because the weather was glorious.  Reviewing the menu, much looked good. As we were famished, we both decided on the \"Hangover\" breakfast. It comes with two pancakes (with light cinnamon and vanilla flavour), two eggs, three slices of peameal bacon (or choose bacon or sausage or ham), home style potatoes, porky beans, two slices of buttered toast and a little fruit. This is a ton of food for a fair price of $14.95.  Everything was delicious except: (1) my husband was not fond of a sour flavouring of the peameal bacon; and, (2) neither of us was fond of the porky beans which were dominated by tomato flavour, without enough \"porky\" flavour, so nothing special.  Service was friendly, attentive -- terrific!  We'll be back..."}
{"text":"Read some of the positive reviews for The Homeway and decided to give it a try today (Thursday, approx. 10am). We walked in and it looked like a very welcoming place, nice interior. We were seated quickly as it was a weekday morning and not too many people were out trying to get breakfast. I figured we would have a good chance of receiving prompt service and food as the restaurant only had about 6-7 other tables who were all already currently eating their food. I was sadly mistaken.  The server took our order, but did not write it down. We received our drinks quickly, but that's about as far as our hopes for this place lasted. We waited a good 45 minutes to receive our food. Our server came by with another table's food and we thought \"okay, we must be next.\" But we did not get any verbal reassurance that our food was on the way. After the mistaken food was brought to us, it took another 10+ minutes for our food to come out. The server gave us our dishes and did not bother to apologize for the long wait. Shortly after we received our food, the table beside us who had just sat down about 10 minutes before we received our food, had also now received their meals.   Now on to the food: I had ordered the basic breakfast--Homefries were overdone to a crisp. I'm pretty sure they refried those potatoes more than once as they were 90% inedible. I found 2-3 home fries that still resembled a potato. The scrambled eggs were fine and peameal bacon was blackened on the bottom. I hated to say it, but the toast with jam packets was the best part of the meal.  There were a couple of other issues that I won't go into, but the basics of a good restaurant experience: service and food were completely missed during our visit to The Homeway today. I will not be returning here."}
{"text":"We went to the Homeway on the weekend after reading some mixed reviews. Terrible service (especially from the owner) was a bad starting point--at one point we switched tables and asked if we should bring our stuff with us. He told us to 'sit back and relax', that he would do it for us, but then disappeared and we had to go back and get our glasses ourselves ten minutes later. Same when we asked for spoons for our soup (had to go inside after waiting for at least 5 minutes, and then ask someone else).  The terrible experience really started when they brought my main--macaroni and cheese--with bacon in it. I sent it back--no mention of bacon on the menu. It came back five minutes later with--surprise--bacon still in it. I sent it back immediately. The owner came out and told me that the chef had redone it and I must have mistaken the tomatoes for bacon. He talked about sensitivities to bacon products but insisted there was no bacon in the second attempt. However, within five minutes the chef came out and admitted he had indeed tried to pick the bacon out of the first dish because things were so busy in the kitchen. At that point, I didn't want anything more so didn't eat dinner.  At the end of the meal, the only gesture made was to not charge me for the macaroni and cheese. I said something to the owner, who insisted it wasn't his problem because the chef told him he had redone it. He did not seem to think he had any accountability for the goings-on in the kitchen, or any need to apologize for the incident.   As I've said before, I've now been to the Homeway twice--first and last! I would not recommend it to anyone after the ridiculous and offensive experience I had."}
{"text":"Why is a place with so many negative reviews about their service still in business? Because their food is fantastic!  The Homeway was recommended to me for brunch by a friend who lived in the area a few years ago and just LOVED it (it definitely beats a greasy spoon).  We came on a Sunday morning for brunch.  I ordered an omelette which was light fluffy and came folded over fresh firm asparagus spears and warm melted brie cheese. YUM!  (The homefries that came with it were nothing special).  My friends ordered french toast, and the hangover breakfast. The portions here are big, the food is light, fresh, tasty and all served with real maple syrup.  The restaurant itself is in need of a facelift. The walls are pastel yellow, with a few brown accent walls and just full of visible scuffs and marks.   The servers seemed quite stressed. I'm talking stressed to the point that I was starting to feel anxious.   This place is very family friendly. There were more tables with kids than without.  ***EDIT***Came back a second time to eat on their patio and just loved it!! We arrived at 8am sharp and were one of only 3 tables there. The service was quick, friendly and efficient and the food was superb. All agreed, this is a great little find.  ***Tip: Try to arrive before 11am if you can. We showed up at 10:50am and waited only a couple minutes to be seated, starting around 11am the line got quite long. ***"}
{"text":"I used to be a huge fan of this place, but this neighborhood staple is now a bust. The last three times I have been, the service has been awful and the food has been bland. Every time I have gone in the last year I have waited more than 30 minutes for food, and the staff don't seem to care.  The sandwiches are bland with rock hard bread, the fries are dry and cold, the sausages, peameal and bacon are all cold, and the omelettes are brutal.  Good eggs Benedict if you want to wait for 30-40 minutes for it.  Save your money and go somewhere else."}
{"text":"its such a shame that the service is so bad here because the food is awesome. Everything you would want to see on a lunch or brunch menu is there, all comforting. i've been there quite a few times and all the food i have ordered has been amazing. The service seriously needs some work, been ignored for long periods of time, the server has admitted she totally forgot about a us at least twice (two separate occasions), sat on the patio once and had to get up to get my own milk for my coffee, cutlery, and after being told we would get  menus, after ten mins with no menus went up to get them myself. Will probably be back but make sure you set some time away to dine here as it takes longer than expected."}
{"text":"I've tried this place several times and have always been disappointed. Wait times of over 1 hour, rude, inattentive staff, a host that is insensitive.. cold food. Not recommended whatsoever."}
{"text":"I came here with my husband for brunch on the weekend and this place was packed. The environment wasn't the most glamourous looking. It looked just like a diner. I order the pulled pork eggs benny and it was delicious. The BBQ pulled pork was mouthwatering, tender and saucey. The eggs were made to perfection, running yolk burst out as soon as I poked them open. The only complaint for me was the home fries. They were not crispy at all and tasted very bland. My husband ordered the hangover helper breakfast (of course) and it was massive. It came with a choice of buttermilk pancakes or cinnamon french toast, 2 eggs, fruit garnish, a choice of bacon or sausage, home fries, toasts and baked porky beans. The pancakes were very fluffy and delicious. It was a great portion for a man like him.   I'd say this place is worth a try if you're in the area because it offers great value for the price."}
{"text":"The Homeway is in a sad state. I've lived just around the corner for almost 4 years and it used to be my local brunch spot. The last 5 visits have included: poor service, slow service, smelly wait staff, unkempt staff, terrible coffee (completely undrinkable cappuccinos), out of food (eggs. they ran out of eggs.) and the kicker? They don't even take reservations for large parties anymore. I'd be embarrassed to take family and friends to this establishment now, anyway. It's unfortunate; I wanted to continue loving this place."}
{"text":"Stopped in today for lunch.  I was told they are known for the benedicts.  So I ordered the regular one.  It came and was awesome.  The home fries are all crisp.  Not one soggy.  Really enjoyed that.  Service was great and overall cleanliness was great.  If you are in the area and in the mood for a brunch style meal then you should stop in here!  Enjoy this place with a friend, family or mistress!"}
{"text":"The food here is great! Cute little restaurant with some unique items on the menu. The one downside is there are always long wait times and once - our food took forever to come. I've never eaten something I didn't enjoy here. Comparable to Boom Breakfast and Hazels."}
{"text":"Cute, homey restaurant located in the Mount Pleasant and Eglinton area. This place is popular with the locals, with families always coming for brunch on weekends. This places serves up your basic brunch items, like omelettes and pancakes. Every day, this joint usually have a special juice (tip: try any of their juices, they are super fresh and worth the price). Wait time depends on when you go. I've come here at both off times and busy times. Off times (10 am), you'll get seated right away. Busy times (12 pm), it will take you usually 30 minutes. If you are an Eggs Benedict lover, make sure to try theirs (their hollandaise is out of this world, super creamy and amazing hint of lemon)."}
{"text":"Came for lunch today on a nice and quiet Friday afternoon. I ordered the Montreal smoked meat on rye with the soup of the day, which was chicken and lime, and the soup was pipping hot when it came to the table.   The soup was nice and savoury, and I loved that it had lots of vegetables - it reminded me a borscht soup, except with shredded chicken instead of beef. As for the sandwich, looks were certainly deceiving because I thought the portion looked rather small on such a big plate but it turns out that they really heaped the smoked meat into it. The meat was really tender and flavourful so I'm glad that was the case. The crust of the rye bread was a bit hard in contrast to the soggier middle, but it was still good. I was curious, however, where my pickle went since it was written in the description on the menu but was nowhere to be found in my sandwich.   The staff were all very friendly and overall, this seems to be a nice place to enjoy a weekday brunch."}
{"text":"I was very skeptical of this place based on its rating but we had a delicious meal served hot and fresh with good service. Maybe it's not as busy now because of all of the bad reviews? Or maybe they are trying to build up their reputation again. Whatever the reason, I would happily recommend The Homeway. I had the hangover breakfast because I wanted a little bit of everything and the cinnamon pancakes were amazing!! My friends were equally impressed with their meals - they had eggs Benedict and huevos rancheros. All in all, very happy with our visit to The Homeway."}
{"text":"I really liked the place, and I don't understand why the rating as of today is so low! I knew Madelaine D. couldn't be wrong.   We came here for a late brunch on a Saturday morning. They don't take reservations for less than 5 people, but we were able to find a table for 2 with minimal wait.  The place is small and narrow, and with everyone in there, very cozy.  The patio outside seems like a great addition the summer.   My coffee was never empty, and the server was quite friendly.   There were SO many things to choose from, including over 6+ omelettes, and 3 benedicts, and CHALLAH FRENCH TOAST.  I don't know what it is, but I'm a sucker for Challah. I have to come back and have this.  All omelettes come with home fries and choice of toast (including Challah).   But since this was my first time here, I have to have my inaugural eggs benny (Florentine).   It was good, and smothered with hollendaise, but I found the sauce a little too tart (lemony) for my taste.  Home fries were fresh and tasty.   If ever I'm looking for brunch in the area, I would come back here!  They only take cash or debit."}
{"text":"Note: it's about 3.5 stars but giving 4 because I think other reviews of one star are overly punitive.  (People should really consider 2 stars if they were really disappointed, and 1 star if they saw roaches or had food poisoning).  Service: fast and very professional.  Offered coffee refills, attentive and moved quickly.  Food:  good, club sandwich and eggs Benedict Parma (a little salty on the sauce), bread fresh, fries good.  Cappuccino 7.5/10  Premises: easy lunch parking free on sidestreet.  Clean and sparely decorated.  Temperature a little chilly (I rarely complain about it this, it could have been 1C or two warmer)  The operator and staff are obviously trying to please people and they deserve a try, there is nothing here to keep anyone away."}
{"text":"Went here on a Saturday early afternoon and it was packed! We almost left after 15 minutes as no one had greeted us or acknowledged our existence.   I agree with other reviews in that this is a very average place. Service was average, food was average but the price was pretty high for brunch!   They did have one of the best caesars I've had in a while though! Even my friend agreed it was perfectly made."}
{"text":"The long wait on a rainy Sunday afternoon was well worth it. This place has the best blueberry pancakes I have ever tasted!  The service was good, the atmosphere was very cozy and welcoming and it felt like a breakfast place should.   I honestly don't know how they only have a 3 star rating. Normally I live by Yelp ratings but I am very glad I ignored the yellow three stars and went for it, because I was more than pleasantly surprised!   Make a reservation if you can though!"}
{"text":"My overall experience at this brunch place is average. Service is average - I've heard someone complain about another server when I was there once. My servers have been alright so far.   It has good portions, but the quality of food is average. I've tried their eggs Benny, hungover helper and omelet. Nothing spectacular about them. I came back because I ran out of brunch places to go to in the neighborhood. For two people our bill always goes up to $40 +."}
{"text":"Experience was okay but probably would not return. Sweet potato and regular fries weren't crispy, and breakfast beans with sauce lacked flavour (...let's say that I'd prefer the canned versions). It took about a half hour for food to arrive just before Saturday noon, but otherwise, servers were nice. Pulled pork was decent; eggs Benedict were okay.   From the looks of others' meals, the sandwiches with salads looked decent in presentation."}
{"text":"If I was to describe the Homeway in one word, it would be mediocre.  Their eggs benedict are decent.    I asked if the orange juice was freshly squeezed I was told it was; five minutes later I saw the waitress carry a huge jug of orange juice from the basement...  Management needs improvement, the servers need to practice more patience and not show their frustrations in front of clients.  Can be a bit unprofessional.  The Homeway is located in a really convenient spot, it seems to be running solely because of that.  In terms of food, environment and service, really minimal effort is put into this business, unfortunately.  Menus are of paper and torn or stained, the attempt to be quaint and/or casual is futile.    I don't know what it is, but I get a dirty feeling from this place.  Torn/worn furniture, scratched, edges, stains on the walls or floor.  It seems like the only solution this owner could think of in creating an atmosphere is painting everything beige. Yuck.  And please, get rid of the plastic flowers, and replace the unflattering short skirts with a decent pair of pants."}
{"text":"This was disappointing. Glacially slow food  delivery in an uncrowded room. Dreadfully overcooked burger and eggs benny with only one egg runny as ordered. Not cheap either. Never again."}
{"text":"The Homeway has provided me with good and bad experiences when it comes to dining out.  This place has been a key brunch spot for me several times and it definitely has not dissapointed me with their food selection or the delicious taste of the food.  When I go there for brunch, I tend to try different things here.  These are my brunch faves I would recommend:  - The Greek Omelette ($8.95) - The Brie and Asparagus Omelette ($8.95) - Pancakes or French Toast (Both $6.50)   I also have visited the Homeway for lunch before, which has also been a treat.  For lunch, I have devoured a bunch of things here but I truly suggest the following:  - The Grilled Caesar Salad ($9) - The Homeway Wrap, which has grilled vegetables, feta and spiced aioli stuffed into a warm tortilla wrap ($10)   I have not been to the Homeway for dinner, but I hear it is decent.  The only thing I have to warn about is that the service can sometimes be iffy here.  Sometimes I would wait for a good 15 minutes to get a refill of water or coffee, even after I asked the staff politely for it.  Also, they always seem to forget important things to bring to the table all the time, such as syrup for the pancakes or ketchup and mustard for a sandwich.  But it is in a good location and have a nice patio. I say it is worth a try."}
{"text":"My chicken sandwich, charred black, arrives with giant cubes, hunks, really - of cold swiss cheese, a plain-Jane mayo and a bun that was advertised as Ciabatta but was more like a soft dinner roll. I hate when I order a hot sandwich and it's cold. The cheese should be thinly sliced and melty.   This is aside from the fact that there were all of 6 people there and it took the waitress 15 minutes to bring me a glass of water and another 30 minutes to bring me a cold sandwich.  It was edible, although bland and cold - Until I got to my second half - and found a hair. I just cut off that part because I the waitress hadn't come by since she first took my order 45 minutes ago. I attempt one more bite and decide I'm too put off by the hair. No sign of the waitress... she certainly doens't check in to see if I'm happy with my meal - which of course, I'm not. Another 15 minutes pass and I finally find her and ask for the bill. I don't mention the hair because I just want to leave asap.  To add insult to injury, the bill comes and she charges me $12 instead of $11 for the chicken sandwich. I decide to just leave an almost non-existent tip and vow never to return.    This is supposed to be \"The Home way of cooking?\" If my mom cooked that way at home, I would have run away and never looked back."}
{"text":"I have lived next to The Homeway for the past year yet only made my first visit yesterday afternoon for a quick snack. Despite seeing many customers come and go from this cafe the staff seemed taken aback when I walked through the door and were unsure whether to offer me a seat or a menu or what....it was like they had never had a customer before.  After asking for a table I was guided through a messy and dirty room (literally crumbs and food all over the floor) which is in a state of looking like its under construction....but that's just the design.  I ordered a simple carrot and coriander soup which took an extremely long time to arrive (despite there only being two customers in the place at the time) and in the end was not worth the wait....is carrot and coriander soup supposed to be so spicy!? I didn't think so... The staff seemed unprofessional and frankly annoying.... choosing to make comments about the book I was reading just when I had put food into my mouth...pleasant thanks.  Unfortunately, despite its close proximity to my apartment I will not be paying The Homeway another visit."}
{"text":"this is a great breakfast/brunch place. the customer service was really polite and quick. the food was not heavy and there were plenty of options.   i really enjoyed this place, and would try out their patio next time when the weather is great."}
{"text":"I really didn't want to write this review.  I'm staying with a friend and it's walking distance from this place. I figured this would be my go-to breakfast place. When I asked her what the deal was she paused, and in her Canadian way, said, \"You know...there's always a problem.\" That sounded cryptic but not awful. So we went.  We walked in at about 11AM on a Sunday and it was, predictably, busy. We gave our name and were told there was a 15 minute wait. After about five minutes I saw one open counter seat and one that seemed like you could sit at it if someone moved a cake tray. I brought it up and the waitress asked the somewhat frustrated seeming managed and they cleared the space for us. We sat down. We ordered food and I ordered a coffee. She ordered a latte. We got our drinks. Without spoons. And without sugar or milk. We had to grab it from another diner. When we asked about the spoons I was told \"we don't have any spoons right now.\"  That should have been the ballgame. I should have called it right there. I didn't.  And then we waited. For like 35 minutes. And it never came. And with kitchen staff so close to us that I could see how well they'd done their nails, the only coffee refill I got was when I flagged someone down to ask for it. The only time anyone checked on us it was...odd. At some point the hostess, about 30 minutes after we first got there, called our name for our table. Which A) says that the wait was a little longer than 15 minutes and B) Even when she seated us, she kept us on the list. So that was a little weird right?  But we called it.  Eventually, after seeing people who came in after us get served THEIR food, I asked for our food to go. And while I can't prove it, I'm pretty sure our order got lost. Maybe it's because our seats were in a no man's land where cake dishes usually are. Or because they thought we were still on the seated list. Or maybe our order just went to wherever the spoons disappeared to. But about 10 minutes after we asked for our order then gave it to us in bags and we left. We walked the block or so back. We opened up the bags and...my order was wrong. The steak wasn't medium rare and I asked for the porky beans and got the potatoes instead.  Look this math is simple: the amount of time you wait for food should be directly correlated to how good it is. If you go to a greasy spoon diner with mediocre food but it takes three minutes to get in front of you? Then that quality is fine. That's fair and appropriate. Conversely, if you wait an hour for a meal, then it better taste like something that makes Elvis want to come come back from the dead for seconds. And when food IS that good? Then the wait is fine.  The Homeway's food is mildly better than greasy spoon quality. And if I'd gotten it in 15 or 20 minutes? I'd have been fine with it. But they make you wait forever for it. I mean if I'm being honest, I'm pretty sure, with us directly in front of them at a counter, they forgot about us. And when we got the order it was wrong. Which makes this breakfast math a bad equation.  Let me be clear. They're all very pleasant. And the place is cheerful and bright. And it is convenient. And the pancakes were tasty. But unless you've got an hour or so to kill to wait for them, maybe try somewhere else."}
{"text":"I've been here a few times over the past few years and I've always thought the food to be mediocre.  Went today for what will definitely be my last time.  The homefries were awful, seemed like they were deep fried in old oil and then pan/flat top fried in margarine maybe??  They left an awful after taste from whatever oil/fake butter they used.  The eggs were, well, eggs.  And the fruit tasted like soap (I suspect from the plate that wasn't properly rinsed).  Overall vibe is a dirty place that does not put any care into the food they serve."}
{"text":"The updated home fries have won me back over. This place is a gem for early morning visits or a hungover brunch with friends. The Benedict is my favourite, but you can't go wrong with the classic peameal bacon with eggs and toast. Every dish is a hit and haven't had any complaints. The French toast is fantastic as well. I'll be there tomorrow morning."}
{"text":"The hillbilly heaven was great! Poached eggs on pulled pork with hollandaise sauce with a bit of barbeque sauce and sprinkled with paprika. Who would've thought it'd make such a great combination? Definitely my preference over the normal eggs benny..  The potatoes were average. Tasty average.  What was really unfortunate was how long everything took at this restaurant on a Friday work lunch. We had to wait until the other table was done with the lunch menu before we could look. We had both ordered the same item but it still came out much too late for our hour long lunch break. The restaurant seemed average busy with 4 tables inside and one outdoors (despite the rain)."}
{"text":"The aggressive crowding at the door, and the host's muddling up the waiting order of parties, made for a hectic experience. we were told the wait would be 10 minutes. it was 35 minutes. our appetites soared, as did our lofty ideas of how the food might taste.  the fresh squeezed grapefruit jiuce was excellent, but they didn't post the fact it cost $4.50.  my eggs benedict were merely OK.   we had to ask twice for water, which arrived after our meal.   they were pretty glassy-eyed when i said i was gluten-intolerant, and asked for my meal without the english muffin. the server overcharged me for my side of potatoes that already was included with the meal.   i loved getting charged money for my allergy to wheat!  SKIP IT.   the one nice thing they provided was free coffee during the wait, but it was impossible to penetrate the crowd around the coffee pot, so we stood there with empty mugs."}
{"text":"Really shocked to read the bad reviews. I wasn't sure what type of place I was going to. I had read a few reviews and I don't find they truly represent the restaurant well enough.   The staff is very friendly, always checking in to see what else is needed. The prices are fair and the food is great. Seating isn't overly spacious but they have indoor and a patio so you have options.   I had the Sinful Benedict and the hollandaise sauce was perfect.   Would recommend this to anyone in the area!"}
{"text":"Great brunch food and service was okay... I mistakenly tipped 130$ for a 30$ meal and left without knowing. I mean maybe the server didn't see the tip amount and let me leave the restaurant but once I saw my bank statement a day after I went back to the restaurant and told her what had happened. She looked through the POS system for the bill and finally found it and saw that I wrongly tipped her 130$ - what made me really pissed off was when she said \"I guess I'll give it back\" ..... I mean if your service was exceptionally extraordinary then maybe.."}
{"text":"This is the first negative review I have ever written.  It would be one thing if the food wasn't to my liking - tastes are subjective.  However, upon discovering a used sugar packet that had adhered to the bottom of the cup - only to be discovered after I had already consumed most of the coffee I was starting to worry about what was yet to come.  Upon advising our server of this (the one who didn't even check to see if the cup she was serving coffee in to her client was clean) she didn't even apologize or seem surprised!  I declined another cup but they brought one anyways.  I couldn't get past the non reaction and lack of apology enough to trust that I was getting a new and clean cup.  I left it alone.  Fairly soon thereafter I received my breakfast plate with a delicious omelette on it.  I was enjoying the gluten free bread and then took a forkful of their beans.  I bit down only to discover a stone! That is right - I bit down onto a stone that was in my bowl of beans!  I couldn't finish my breakfast at that point.  My friend finished his breakfast and when the server came over and I pointed out the stone that I discovered in my beans the response was \"oh, I will let the kitchen know\" after which she promptly brought our bill.  No discount, no explanation and no apology.  I didn't say a word to her about it as they clearly don't care. It makes me wonder if this is normal for this restaurant. I certainly won't take the chance on finding out."}
{"text":"It bothers me in an unsettling way that I have to give them at least 1 star in order to write a review. But here we go.  This place has the worst service I have ever received, food is comparable to shelters and motel lobbies.   We arrived shortly afternoon on Saturday. The restaurant was nearly empty but it somehow took half an hour for the food to arrive.  Not once did the staff check up on us during the whole time.I had one bite of the food and told the waitress that the food was cold and flavourless and she just said I'll let the kitchen know while continued to charge us in full for the meal without any offer for me to order something else.  No apologies were made for when she forgot the toast that was coming with my friend's plate.  As we were leaving she said \"here's your change\", while clearly mistaking us for another customer as we had paid by debit.   ....Was this done on purpose to let us know how little we matter to her? I'm not sure, but it would have been a completely redundant gesture as she has made it crystal clear during our visit.   never again"}
{"text":"Stopped there for lunch today. I decided that asparagus and brie cheese omelette sounds very interesting, so i got it. Unfortunately it was dissapointing, it was too much brie cheese, and asparagus was not fully cooked, could barely cut it with the knife. Dish was too salty, even a toast was covered with salted butter. Potatoes were overlooked and bland. Service was ok, could've been better. Coffee was very nice though. Don't think I will return."}
{"text":"What looks like a quaint little joint, turns into a bustling hotspot once you enter the front door of The Homeway.  I ordered the Huevos con Chorizo, which looked really appetizing as it was placed in front of me, but a few bites in had me reaching over for the salt shaker and hot sauce a couple times.  Regardless, the service in general was great. It would've been a big hit if I could say the same with the food.  The Homeway is still great to check out - I'll definitely give this place another visit in the future though."}
{"text":"Was looking for a brunch place to go.  Went here on a Sunday morning in the summer.  Ordered the Hangover Helper: 2 buttermilk pancakes OR cinnamon French toast, 2 extra large eggs, bacon OR peameal, homefries and baked porky beans. $14.95. Presentation was beautiful.  It even came with fresh fruit.  Service is excellent.  They have a cute patio on Mt Pleasant with flowers and vines and about four tables.  There is a much larger patio facing the side street with many tables and can accommodate large groups.  The inside is cute too.  Really good restaurant.  I consider this a hidden gem and will definitely be back.  Oh, also fresh squeezed grapefruit juice."}
{"text":"Can the rating be lower than a one?  Check out the history of the owner Lawrence Burns.  http://projects.thestar.com/broken-trust/index.html  Past behaviour says it all.  Best to avoid."}
{"text":"Delicious home-cooked brunch ... In my opinion, one of the best in the Yonge & Eg area. I love the lox / smoked salmon bagel and the Greek omelette. Pancakes are yummy as well. Great service. Lines can be long though for weekend brunch ... Would be helpful to be part of OpenTable or take resos for small groups. Overall, great neighbourhood place!"}
