{"text":"I can't speak for the quality of the cakes at this place - but customer service was the WORST of any vendor I've had to deal with for planning a small wedding.   The woman who runs this bakeshop agreed to a consultation, only to reschedule twice. Which would be understandable under normal circumstances, except she did not get in touch to let me know of said re-scheduling - I had to call her bakeshop a number of times to find this out myself.   At the consultation, she apologized for having only 2 basic flavour samples, which I am pretty sure were basically leftover cupcakes from an event she catered the night before. She took our details and info about the cake, said it would be no problem for her, and filled out an order form, assuring us that she would get in touch by email to iron out the particulars soon.   Two whole weeks passed, no email. I followed up by email, no response. I called her bakeshop - she seems to ignore 95% of phone calls. I don't know if she is understaffed or screening calls. I got through once, at which point she apologized and said she would send an email by the end of the day.   That didn't happen either. Another couple of days passed, at which point she finally sent an email apologizing for the \"delay\" with no explanation.   I decided to give her a chance as it was the holiday season -  I thought things may be busy. I sent her the info she requested, while at the same time politely expressing discontent with how the situation was handled thus far, and stating that hopefully the process would be easier moving forward.   I never heard back from her after that.   While no cash had yet to be exchanged, there was an ACTUAL ORDER in place at this point, and she just decided to drop it without letting me know. She had all of my contact details.  No note explaining why she couldn't go ahead with the order for whatever reason.   Just overall disappointing, style over substance, and potential wedding-ruiner.  Update: A friend pointed out a recent google review to me in which someone had a VERY similar experience in dealing with this business. It's so upsetting to see that the owner seems to treat her customers this way quite regularly. It's so unprofessional and disrespectful. I'd advise anyone to take their business elsewhere."}
{"text":"Awesome cupcakes, I had the chocolate-vanilla at U of T's Food Truck Friday. The cake is dense and moist, and the icing was a slightly odd texture but quite palatable. I'd love to pair the cake with a dense buttercream icing for maximum decadence. I'll be keeping an eye on their twitter (@prettysweet_to) to hopefully catch them again soon."}
{"text":"Another cupcake truck... another cupcake... ho hum.  My personal opinion is that if you have a food truck, your product still has to be able to sing on its own, without the novelty.    The cake was pretty good.  It was nice and light and melted in your mouth.  The icing was just \"meh\".  I liked that they didn't over-ice the cake, but it could have used some more peanut butter flavour.  It was also a bit warm which made everything feel really goopy.  I'm sure the temperature was due to the fact that they're serving out of a running truck, but if that's how you want to serve it, you have to figure out how to regulate things.  A good treat if I happen to pass it, but I wouldn't hunt it down."}
{"text":"Cupcakes that will come to me? (Sort of).  Hell yes!  This business combines 2 trends that I love (food trucks + cupcakes).  The spectrum of cupcakes ranges from inedible to spectacular.  From oh-my-God-I-think-I-just-ate-a-pound-of-butter to light cake base and whipped icing (the way I like it) - the variance is like day and night.  The ones at Pretty Sweet are 2/$5 which is on par in terms of pricing for cupcakes in Toronto.  If there WAS one thing I'd complain about it's that they're not the most environmentally friendly, using plastic containers for their packaging.    I like that they don't use heavy buttercream and instead use a whipped icing.  It's much lighter.  The cake base is really moist.  So far my favourites are the Salted Caramel + Chocolate and Cherry Bomb (take on a Black Forest cake).  Yummy!"}
{"text":"TIFF food trucks night four, round three.  To finish of this night I bought a red velvet cupcake. The cupcakes are smaller than what you'll find at other places around the city, but so is the price. At $2.75 this is a great price. The cake was perfectly moist and didn't crumble. The cream cheese icing was smooth and creamy and wasn't overly sweetened."}
