{"text":"I love Cupcake Cafe!  Best cupcakes anywhere! Prices and delivery is great too!"}
{"text":"I'm not a cupcake officianado at all, but after enjoying faire from the Cupcake Cafe, I have no desire to try anyone else's cupcakes and cake pops.  They have rich flavor; they are moist; they are attractively presented and -- as cupcakes go -- they are reasonablly priced.  Add to that, a very nice staff and you definitely have a winning combination.  The Cupcake Cafe shows up at several farmer's markets around the valley each weekend.  Check their website to find out when they will be in your neighborhood.  If you give them a try, I don't think you will be disappointed!"}
{"text":"If you love delicious cupcakes than you need to try the Churro cupcake from The Cupcake Cafe. Soooooo yummy! It tasted just like an actual churro. The perfect amount of sugar and cinnamon. The owner, Nicki, is as sweet as can be. I will definitely be ordering from her again!"}
{"text":"I recently placed an order with Nicki at Cupcake Cafe and must say that not only were my cake pops amazing the customer service was too! I was looking for something out of the norm for a bachelorette party I was throwing and Nicki really delivered... Highly recommend them!!!"}
{"text":"I recently had the pleasure of doing business with Nicki at the Cupcake Cafe and I was so impressed with not only the food but with Nicki's work ethic. I ordered cupcakes and cake pops for a baby shower I was throwing, some were on a Groupon some weren't but I was not treated any differently for using a Groupon which I hear happens at some places. I had to call and make adjustments and additions throughout multiple times before the shower and Nicki was great about it. I had a vision of what I wanted the cake pops to look like and she nailed it exactly! Most importantly when the cupcakes and cake pops were delivered on the Saturday before the shower I noticed the plastic wrap around the cake pops and cupcakes smelled like onions. I was a little freaked out and just called to let Nicki know and that I had removed the plastic wrap. Nicki called me and let me know she would remake the whole order and redeliver it on Sunday before the shower even though they are closed on Sundays. That was incredible! It's hard to find people who truly care about how their product comes out and is received. I will absolutely use Nicki again! Oh yeah and the food was great too, LOL!!!"}
{"text":"I really liked the Cupcake Cafe! I bought the Groupon and then emailed the company to place my order. I got a mixed dozen to be delivered to my dorm in downtown Phoenix. The woman Nikki who owns the business was super friendly via email as I ordered my cakes! 

Unfortunately part of my order was wrong. I emailed the owner to complain about the issue and she responded right away offering to bring me the rest of my order. It was the best costumer service I have received. Plus the cupcakes were DELICIOUS!!! Of course I adored their famous red velvet but the rest were moist.  They also got the buttercream icing just right! 

I would totally order from the Cupcake Cafe again!!"}
{"text":"The cupcakes are delicious and they deliver! Nikki was so accommodating. I was having a big event at a rooftop bar in Tempe and she delivered my cupcakes after her normal delivery hours to accommodate my event schedule. The cupcakes were delicious (we ordered 7 dozen mini cupcakes). I HIGHLY recommend the banana nutella. Really great company."}
{"text":"I had a last minute request for a custom cake. I needed it delivered valley wide and sent Nicki a text with the details and short timeframe. She answered and just said she would do it. She delivered in spades. The cake was amazing in decoration but more important for the guests the marble cake was consumed like it was the best cake ever. Any leftovers on another plate was grabbed up. 
I will not do another cake without Nicki. Word."}
{"text":"I also purchased a Groupon for the Cupcake Cafe and was pleasantly surprised by the great customer service from Nicki the owner.  We communicated by email and she was always quick to respond.  The deal from Groupon offered one dozen of one flavor; but it was so hard to decide!  Nicki was so accommodating--my order consisted of four flavors (I couldn't make up my mind what I wanted)--red velvet, carrot cake, churro and banana nut.  We've tasted three flavors and so far, I am very impressed with each one of them.  I give Nicki and her Cupcake Cafe five giant stars--for a great product and for caring so much about her customers!"}
{"text":"Nicki was such a pleasure to work with.  She was able to accomodate a quick turnaround and deliver a birthday cake to my parents while they were traveling.  I would recommend her service and products to anyone who has this type of need.  Thank you Nicki!"}
{"text":"Nicki is absolutely the best. A friend of mine was diagnosed with breast cancer, and I wanted to send her some special cupcakes after the mastectomy. I'd contacted three local cupcake shops with my request, and NONE of them seemed willing to help. 

Then I found Nicki, and thank god! She was so easy to work with (even though I was emailing her from Germany, which made communication tricky). She was excited to do something fun, and totally open to all my requests. I got exactly what I'd hoped for, hand delivered to my friend (who absolutely loved them)."}
{"text":"Nicki did a great job on my son's 4th birthday dinosaur cake and cupcakes. I requested softer frosting for little mouths, and I think it all turned out perfectly. The kids ate them up!"}
{"text":"I discovered the cupcake cafe when I was doing a Google search for cupcake/cake pop bakeries to make desserts for our sheep themed baby shower. I contacted cupcake cafe and they responded promptly and answered all of my questions. Luckily, she told me she would be able to replicate a sheep design that I wanted. Although the design aspect was important to me, everyone knows taste is what matters most. The cupcakes we ordered did not disappoint. We got mini cupcakes which were the perfect size- not too tiny. We were able to choose up to 4 flavors: chocolate, lemon, red velvet and wedding cake. All of the flavors were delicious and the cupcakes were moist and perfectly cooked. They were not too sweet and the cream cheese frosting was light and creamy. It should be noted that the cupcake cafe is an online business so there isn't a store front for you to visit and do a tasting. Therefore, these reviews are so vital to anyone who is considering ordering cupcakes from this business. I can say wholeheartedly that I would recommend cupcake cafe to anyone looking for a baker who will make delicious cupcakes with unique designs and is still affordable and who will deliver! Nicki- the owner/baker is a pleasure to work with and is very responsive and accommodating. I hope this review will convince those who are in doubt about her services and products that they should contact her asap for their cupcake needs."}
{"text":"I love their cupcakes.  I had several.  You can buy them at farmer's markets or if you are lucky you can buy a deal of the day in some of the sites that offer them.  I had some from Doozy and Nikki, the owner, was really nice.  I love the chocolate one with jalapeno raspberry jam.  Not sure if she had them anymore.  Also the \"apple pie\" and red velvet.  When you get one of those deals, she will deliver them to your home.  That is awesome."}
{"text":"The most awesome chocolate cake pops!  My choco-holic said they are like eating a brownie on a stick."}
{"text":"I'd like to begin by saying that I'm a HUGE dessert snob! I will not eat anything unless it is freshly made and contains real butter, cream and eggs. And absolutely no ingredients I cannot pronounce. I've been known to drive for hours just to seek out a good bakery. I purchased the Groupon for Cupcake Cafe because I'm constantly seeking out the best treats in the Valley. I ordered all red velvet (my absolute favorite and hence I have even higher standards for that). I remember when I first got the package, I was shocked that butter was not in the main ingredients for the cake itself. I was however relieved that the cream cheese frosting did contain butter and real cream cheese. I hesitantly took a bite fully thinking I would be disappointed. Boy was I ever schooled!!! These cupcakes are hands down, the best I've ever had in the valley!! Actually, anywhere. And I would know. If there's a cupcake shop to be found in the Phoenix area, I've been there and tried it. These ones really do take the cake. They are always moist and just the right texture. Everything I would expect from a true baker. That is why I immediately kicked myself for not purchasing more than one Groupon. However, Nicki is all about customer service, she gives a discount to repeat customers. If you're looking for a good cupcake, splurge and get these...but don't make the mistake (as I did) of telling people you'll have cupcakes because I guarantee you will not want to share them. Or meet up with Nicki at one of the farmer's markets."}
{"text":"These are the best cupcakes I've ever had.   So, so much better than Tammy Coe or any of the other dozen I've tried in the valley.

And here is the best advice I've EVER given on Yelp:

Order the Nutella frosting on Banana.  It will absolutely, completely, and guaranteed blow your mind.  I'm dead serious.

The other flavoers are good to great.  Never had a bad flavor.

But the Nutella (and I'm not a big Nutella fan, never putting it on anything), are transcendent.

Honestly, these things disappear at my office, at my home, at parties, faster than anything I've ever seen.  I've never seen anyone stop at one... unless it was the last one or they see a 5 year old walking over to it, and are socially shamed by reaching out to take the last one.

I have a hard time paying \"full bakery\" prices for things.  Cakes, cupcakes, etc.  If you've never tried this place, I don't blame you for being very skeptical for \"delivery cupcake\" prices.

But the Cupcake Cafe could honestly double their prices and I would still pay the price (but don't do it... just dont!!!).

Seriously, order today. 

And read my other reviews if you think I'm someone that just gives out 5 star reviews like candy on Halloween.  I'm normally brutal!"}
{"text":"I first met the owner, Nicki, at the Ahwatukee Farmer's Market. My  husband and I had started to frequent this one and of course the sign for cupcakes caught our eye! Who can resist cupcakes? We struck up a conversation that lasted for several hours, because her attitude and personality is just the best, you don't want to walk away! And who could, there's cupcakes there!

The award winning Red Velvet is to die for, but I've never had a single flavor that I didn't like! What's so great about the Cupcake Cafe is that Nicki is constantly doing new flavors, so there's no stagnant choices from week to week. She's very creative, even going so far as to make savory cupcakes {her Deep Dish Pizza won a prize at Cupcake Love-In}

I've done some photography for them as well, and they couldn't have been more pleasant to work with.

I look forward to working with them more {cupcake samples? yes?} and especially excited for holiday flavors!"}
{"text":"The owner was so easy to work with! The consultation had to be over the phone because we were coming in from Boston but she made it so easy for me. Very nice and the cake was amazing (inside and out)."}
{"text":"I have had the honor of having some of Nicki's delicious cupcakes courtesy of my lovely coworker Jen who ordered some for my birthday as well as her surprise reveal as to where she was having a boy or a girl ( a boy). I had the Southern Red Velvetm Salted Carmel, Chocolate Chocolate, and Chocolate Chip Cookie in my birthday dozen and dear lord I was in cupcake heaven!!!  Plus delivers these decadent cupcakes to you personally! Now that is service!!  Dang it, now I want a cupcake!!"}
{"text":"A mutual friend of mine/Nicki's referred me to her business when it came time to plan my wedding. I'd never met her nor tried her cupcakes but her Yelp reviews to date were promising. She was friendly and responsive over email when setting up details, going through options and finalizing logistics. We through a bit of a wrench in things because we also wanted gluten/dairy free options available. She was accommodating and our gluten/dairy intolerant friends raved about the final product. On the day of the wedding, she arrived, set up in a timely manner and the presentation looked beautiful.

The cupcakes and the cake were SOOOO delicious and we're still hearing from our guests how obsessed they were with them. 

We eventually met Nicki when we returned her cake stand. She was friendly and professional. We will definitely use her again, soon!"}
{"text":"I love the cupcake cafe. I first found them when I was pregnant and had a cupcake craving. They were so satisfying that I still have cravings even though I am not pregnant anymore. 

The owner is so nice and always remembers us when we stop by. She goes to a lot of farmers markets so be sure to add her on Facebook to see where she is at that weekend. Also make sure to get there early because she can sell out quickly. 
My favorite thing to get it the sampler packs because you can get a lot of variety with small bites."}
{"text":"Just received my delivery of cupcakes that I purchased through Nicki's Groupon!  I asked for the baker's choice (four flavors she picks).  The cupcakes are absolutely beautiful (sparkly for New Year's Eve!) and taste phenomenal."}
{"text":"The Cupcake Cafe is so wonderful! The owner, Nicki created the most amazing cupcakes for the 250 guests at my Wedding in October 2011. We had an equal amount of the flavors Wedding Cake, Red Velvet, & Chocolate, all with edible glitter!

People were literally sneaking them from the cupcake table, which was hilarious. I'm so happy everyone loved them! Not only that, I still get continuously asked by friends & family 3 months later where I got our cupcakes from, & always send them to Nicki at The Cupcake Cafe :)

You can see pictures of our cupcakes & cupcake stand Nicki brought for us here:

http://theolsenadventures.blogspot.com/2012/01/our-wedding-details.html"}
{"text":"Nicki is truly a delight to work with. She cares so much about her clients and takes extra time to ensure you are getting the product you want. I have used her 2 times, one for my 4 year old nephew's soccer game where she made cake pops looking like Red Ninja's (for the team mascot) and then she made me Ninja turtle cake pops for my friend's birthday. She is quick and has a great attention to detail. Nicki also delivered the cake pops to my office so I didn't have to leave to pick them up!

I am excited about all my upcoming events because I will for sure be testing Nicki's amazing creativity! Thanks Nicki!!"}
{"text":"I love the Cupcake Cafe. The owner Nicki delivers your order right to your door, or if you are lucky, you can find her at several Farmers' Markets (check her schedule).  I like that I can order classic chocolate cupcakes with delicious vanilla butter cream frosting. They are fresh, don't fall apart, and you don't have to choose a filled cupcake or exotic flavor... unless that's what you prefer. Her customer service is great.  There are more famous cupcakes, but we think these are the best."}
{"text":"Nicki at The Cupcake Café did an phenomenal job with our simple wedding cake and guest cupcakes. Numerous guests walked away raving about the taste and even went back for seconds. We kept it simple with chocolate and vanilla cupcakes with white frosting and gold glitter dusting. We added a white cupcake collar so they could look a little more wedding-like and hold their own on the cake table. Our wedding cake was a small 6\" vanilla with white frosting and white ball décor with our bird cake toppers. It was something I saw on Pinterest and she mimicked it to the tee. Planning a wedding from afar, seemed like a stressful task trying to find a suitable baker, but interacting and working through details with Nicki made it a breeze. She's very responsive, very creative and understood my vision. I can't imagine what she can do with other flavors or decoration. She was amazing and I would recommend her to anyone!"}
{"text":"Hmm, these cupcakes are not very good. I've tried gourmet cupcakes all over north america and these taste a lot like cake mix. The icing is uninspired. I've given them a two star because they have awesome customer service, and they arrive on time. Delivery option is amazing. Don't get me wrong, the cupcakes are OK! They just aren't gourmet."}
{"text":"Love them!  I first had them at the Farmer's market on Cactus and we ended up having them at our wedding as little \"sweet\" gifts for guests to take home. Everyone loved them:)"}
{"text":"The cupcakes are not good.  I've had cake mix from a box that tasted better.  Not worth the price at all.  The gal who took my order (the owner I think ) was very nice and very helpful.  The gal who delivered the order was rude, and had no information when I asked her a simple question regarding my order.  It's worth the drive to go elsewhere."}
{"text":"Not only were the cupcakes (red velvet) and brownies delicious I really want to compliment Nicki on her excellent customer service! I was not in Arizona at that time when I made the order with her through email, but everything came on time and were designed the way like how we discussed it would be. 

Her cupcakes and brownies were nice and moist, and the cream cheese icing is delicious!"}
{"text":"Hello Nicki! Words cannot tell you how absolutely stunning the large rose topped cupcake cake was! It was breathtakingly beautiful and absolutely perfect in my Jessie's smash cake photo session. Not only was it exquisite with detail and delicious, the roses on top were a perfect match to my delicate/timeless theme! The photos are unbelievable, It was just magnificent! We took it home and gobbled up the rest. 
Thank you, so much, for the last minute order and delivery and the most beautiful cake ever! Best, Anna"}
{"text":"Bought a Groupon for Cupcake Cafe and did not know what to expect.  The owner could not be any nicer and the cupcakes could not be any better.  We had a birthday party for my Aunt and had exactly a dozen people for the party.  Out of the 12 people( who really love cupcakes) not one of us were disappointed.  We got the coconut, apple pie and chocolate peanut butter.  We loved all of them equally and every one wanted SECONDS.  They were moist, a perfect amount of frosting and just plain delish!"}
{"text":"Before I get to talking about the cupcakes themselves, let me talk about Cupcake Cafe's owner, Nicki: Hands down INCREDIBLE customer service! Nicki was incredibly personable and accommodating. I called her to place an order for a bachelorette party on fairly short notice, and she was more than happy (and willing) to help! On the day of the event, she had a family emergency. It was clear that she puts her customers on the forefront, in that she made time to deliver to the hotel regardless of how her day was going. I was shocked! Now to the sweet part...

I ordered a dozen of the Wedding Cake cupcakes and a dozen Red Velvet. Both were incredibly moist. The frosting on the Wedding Cake had a marzipan vibe to it and was DELISH! the red velvet was all creamy cream cheese goodness. I was reallllllly hard for me to just have a small taste. I was able to stash a few to enjoy after my NPC comp on May 10th (they're already in the freezer). All of my ladies were LOVING Cupcake Café! I am sooooo glad that I found them on Yelp. 

Nicki, do you deliver to California?! :)

A+"}
{"text":"Had Cupcake Cafe make 2 dozen yummies for my company's Employee Appreciation Event. Not only was Nicki an absolute pleasure to work with, she is responsive, friendly and creative. She made the prettiest swirled cupcakes in our corporate colors and they were DELICIOUS!!! I consider myself a bit of a cupcake connoisseur and Nicki's cupcakes are one of the best cupcakes I've had in Arizona! To top it off, they deliver! I highly recommend them and will definitely be using them again. Thank you, Nicki!!!!"}
{"text":"OUTSTANDING. 

Cupcakes are delicious and service is outstanding. Nicki, the owner, is so warm, helpful and will go the extra distance to be sure you're a satisfied customer - even going so far as to roam ASU's campus to find the right place to deliver. 
Prices are extremely reasonable and delivery charges (if they even charge you one!) are so low. 

Best of all, the cupcakes are delicious. 

Can't wait to go back and refer others. Will use them again!"}
