{"text":"Service sucks. The bartenders have their local favorites and ignore the rest of the people at the bar trying to get a drink. Took me 20min to get a drink, and it was NOT busy. 2 bartenders, had my credit card out and was clearly a noob at the bar. They took forever to take my order and got it wrong. Both bartenders were too busy socializing - even left the bar area to go talk to people while I waited for my drink then gave me a bs excuse that she couldn't find the juice for my vodka juice drink I ordered as if I couldn't see them both out there socializing with their friends. Happened both times I ordered a drink and the second time I just got a BEER!! WTF this place sucks"}
{"text":"Best wings I have had in a long time, better than Native New Yorker!  Great service too."}
{"text":"We have been going to this bar for their breaded wings since it was the Running Grunion. You used to have the best. But what in the HELL did you do? First you ask for breaded n of course they're not breaded then I ordered Garlic Parm n they had nothing on them n third,  n WTF did you do to the RANCH. As soon as i took it out of the bag I told my husband this ranch is brownish n not right!! Tasted it n it tasted like it was made with Miracle Whip. Really? We came from Peoria to get wings n they SUCKED! N i probably could have eaten them if you used REAL Ranch. Very disappointed. Pullanos here we come. Sad, Sad Day!"}
{"text":"Great Bar... All the amenities including pool, darts jukebox, live music and surprisingly good food. Of course it helps that I live less than 1/2 mile from here.   Bartenders remember and appreciate me... I like that part the best."}
{"text":"DO NOT ATTEND. A friend and I walked into the bar, there's all of 9 people at the bar with two servers, we sat at a table and awaited a server to come over, after about 20 min and my friend talking me off a ledge, I had to physically CALL THE LOCATION AND ASK FOR A SERVER, I stated we've been siting at a table for about 15 min and are looking to served, she talked around the bar with the phone and said, \" are you calling, in a laughing and joking manner. She came over and apologized and asked what we wanted, I said waters and menus would be fine, I asked what beers they had in bottle, she had no idea. The bar is absolutely filthy, there's no AC in the building and just stand up fans from Walmart.  we ordered a beer just for the sake of being here and she brought my limes on a filthy cardboard coaster. The staff is horrible, the clientele is even worst. There's children in the bar!!! Someone's son is just chilling in the bar at a table playing a video game, while there parents are getting drunk. I'm 100% that's illegal. We're closing our tab as I write this review and getting far away from this hole in the all as possible. I wouldn't recommend anyone to this bar. I would recommend that some sort of inspection be done because I'm sure this bar is not up to code. Gross. Stay away!!"}
{"text":"Ordered this in December and received a piece of cake with a November date. Just gross. I called and they said they freeze their cakes. I don't know. Just weirded me out."}
{"text":"A nice quiet place to have breakfast and a drink during a Saturday morning ride.

I had a spicy Bloody Mary, eggs over easy with hash browns, bacon and sausage. Dahvia had an Irish Coffee, biscuits & gravy with hash browns and eggs over easy.

Well, our eggs came out fried hard....

When we informed our waitress, she was sincerely apologetic and the owner deducted one of the meals from the bill. I wasn't expecting that, considering that I didn't think it was anything major.

Don't be surprised if you see us here on Saturday mornings from now on!"}
{"text":"Unbelievably lucky to find this spot.  One of the few bars open at 6 a.m. (a real bar) and kitchen opens at 8 a.m.  Me and my gf stopped in here on Wednesday and had wings that were very good (I would suggest sloppy, so it has sauce on it).  We saw some regulars ordering the ribeye and eggs breakfast (6.95 ?!!!) that looked awesome.  We ordered that Thursday morning and it was fantastic, tender, and seasoned perfectly.  I had a breakfast sandwich that was english muffin, eggs, thick ham, cheese, and potatoes obrien.  Again, cooked perfectly, potatoes brown and crisp with carmelized onions and green peppers.  So, we're chatting with Beaver (the owner) and patrons and time flies.  Super nice people, and my friend is hungry again!  The previous day we asked if the potato skins came with green onions, and Beaver said, no, but they should!  We'll have them tomorrow... and sure enough, they did, and they were awesome!  Amazing how tough it is to find good skins in this town... So, great food, good drink prices, and one of the most friendly bars you can find.. cheers, Beaver, you've made a fan of me!"}
{"text":"You'd think the designated driver  would have free drinks...$5 for a small pitcher of coke , crap it's bad enough being the DD and circle K selling any size for $.89 cents... what's up beaver?"}
{"text":"I am so glad this place is fairly close to me. I pass 5 bars on the way there, but I will continue to pass them as the beaver bar has the best bloody Mary I have ever had. I gave 4 stars instead of 5 because I haven't tried anything else. The owner is super friendly and visible as well as accommadating and you can see the passion for his business in his smile. MO is an amazing bartender and I can see some guests coming just to interact with her super social petaonality. I encourage everyone to try this place. A diamond in the rough... if it is not close to you. ..drive."}
{"text":"This is a great bar great food great drinks the bartenders and cooks are amazing. Daily food and drink special."}
{"text":"Great neighborhood bar with excellent food! Open at 8 AM on the weekends. Great Breakfast Burrito made to your liking."}
