{"text":"Great food, excellent service. Enjoy the patio in the summer.... HOWEVER the pricing of the wine is rediculous. One glass costing more than a bottle is unacceptable."}
{"text":"I like the location and the all, but the fries I had were probably the worst fries I have ever had in my life. Soggy, dripping in oil, bitter-ish, not seasoned....i'm still confused about it.. Had a cider which was warm and a bit flat. Other people seemed to have fun, maybe it was just my fries ...and my cider ... :)"}
{"text":"Excellent Ambience and good food. Great prices and portion sizes. The patio is quite nice."}
{"text":"Mississauga natives find this establishment located in streetsville the go to spot for a casual night out with buddies. And so in turn, it is incredibly overrated. It's cramped, visually boring and has horrible music and service. There are much better bars to go to in the sauga area that blow this place out of the water. I really tried to like it, even after I gave it it's 3rd shot. Its one of those \"we get business regardless so we don't care\" places."}
{"text":"Streetsville is rapidly becoming another favourite spot in Mississauga. While I still have nothing but love for Port Credit, the bars, restaurants and shops of Streetsville have piqued my interest and drawn me into their quite excellence.   Last night following a successful dinner up the road at Saucy I joined a group of Yelpers at The Franklin House for a night cap. Now my second visit, I was more than pleased to take up on their great patio with my pals.  Sparing you the history lesson on this place (I'd kindly refer you to Jennifer K's review for that), FH looks older but I prefer to call it character. With 2 floors and 2 patios (upper and street level) this is a great spot to come for some local drinks or to watch the game.   Their beer selection is fairly standard (no local Craft Beers), and I haven't attempted their fare yet, so I'll be sure to do so and adjust this review accordingly. They are likely ready for a few small upgrades but for a local pub, it suits me just fine.  If in the area this summer, snipe a seat on the patio, bring a book if alone, or just enjoy the quite nights of Streetsville"}
{"text":"THE OWNER IS A JERK. Ive had a problem here so many times and so have my friends. The bouncer knew my as i had been in many many times before but this time i only had my health card but he would not accept it as ID and after getting the manager he told me to get off his property.....  There is always ridiculous lines to get in, and then once in another huge line to get upstairs......  Dont recommend this place to anyone."}
{"text":"Franklin House is a favourite place of some people I know so I end up here fairly often. It's comfy and warm, and the servers are good. There's an upstairs area for the live music which is nice for me because I prefer a quieter pub to a loud one.  The downfall of this place is that the food is only just ok. I had a Reuben and there was no sauerkraut, and the sauce was just mayonnaise as far as I could tell. My husband enjoyed his ribs (which I also tasted), but again, while decent they weren't special by any means.   The beer selection is small, so don't expect craft brews--that said, it doesn't pretend to be a place that serves fancy beer, so that's totally fine.   Anyhow, Franklin House is nice enough as a place to be well looked after for a basic pint and watching a game, but keep expectations for cuisine in check."}
{"text":"A surprise find...good pub food reasonable pricing...love the lively band on music night. Loud for a date but great for when over got nothing to say.... Enjoyable atmosphere and food."}
{"text":"In the presence of Elite companions, we followed the Yellow Brick Road to Streetsville.               ~~~ We're off to see the Wizard, The Wonderful Wizard of GTA[1] ~~~  After finding The Wizard at Lion City[Mississauga], Dorothy[2], Scarecrow[3],  Tin Man[4], Cowardly Lion[5] were sent to battle the Wicked Richie of the West[6].  At the Franklin House patio over some Guinness, Samuel Adams and Steam Whistle... We realized The Wizard & the Wicked Richie of the West were perfect Frat Buds.  No one got a Bucket of Beer thrown on them.  No one screamed \" I'm meltiiiing... \"                                            They all drank happily ever after.                                                               The End.  ------------------------------------------------------ [1] Kris U    [2] Marianne    [3] Jennifer K    [4] Yours Truly    [5] David L    [6] Richie S"}
{"text":"My favourite Streetsville pub! So much character and charm on the outside but classy, comfortable and clean on the inside with lots of seating areas and chair options to choose from. Drinks are always tasty and consistent. My favourite is the Jesse Juice cocktail recommended to myself and a girlfriend last summer, now we get it every visit it's so good! Love the balcony and patio, great live music upstairs on the weekend, sometimes we even get up and dance! Love the food too, Caesar salad is so unique and tasteful, fries are crispy, nachos are a little light on the cheese but the veggies are so fresh and tasty. My franklin favourite would have to be the wings, best I've ever had so crispy! The staff is so friendly and smiley and always makes sure you're enjoying your visit. I work up the street and I'm always sending my clients to franklin house and they're never disappointed!"}
{"text":"We came to The Franklin House for Paintnite but figured to also grab some food before the event. The food was alright and is what you would expect from standard pub fare.   Wednesday nights are their wing nights (for 80 cents a piece). A pretty good deal considering the massiveness of their wings. They were nice and meaty and were lightly dusted for an extra breaded texture. What I didn't like was how much sauce they had on their wings. I would definitely recommend to ask them to lightly coat them. They were completely smothered and doused and was too overpowering. The sauces was the extra thick kind. We went with BBQ and honey garlic half/half and both were on the sweet side. Too much sauce meant that the wings weren't as crispy as I would have liked. The house salad was also fairly standard with normal spring greens though I had hoped for better tomatoes and red onions that weren't so overpowering. We added grilled chicken and they weren't the greatest either as they were fairly dry"}
{"text":"The patio is quite nice, and they clearly are a hit with a fair group of local regulars. Service is friendly if a bit hit and miss (for instance no check up on how the food was)  Beer and food is a decent price if not great. Beer selection is pretty much standard domestics, no craft type or even craft want to be large brands.  The food was ok, not great but not bad. Had a ruben which was pretty good, the fries could be better, they were a bit cold, but also they had weirdly crunchy salt. I would guess pickling salt (not kosher or sea salt I use those at home, this was way crunchier like salt flavoured pop rocks). However for a pint and patio...good idea!"}
{"text":"Wandering around Streetsville on a sunny quiet Sunday. This clean and mature-looking pub looks like a rockin' neighbourhood hangout as I serendipitously stumbled in by chance while looking for lunch.  Wandering through their menu of pub and brunch food, was disappointed by their limited and standard selection of beer. Naturally I stumbled on some Steam Whistle. And a pulled pork sandwich.  Wandering my way into the meal... holy crap, their portions are huge! I was hungry like a wolf coming in, but their thick and juicy foot-long sandwich and overdose of fries was more than enough.  Their huge front-end patio looks like a great place to stumble upon some friends or eat some local village main street scenery."}
{"text":"2.5/5  A group of us celebrated my friend's birthday at The Franklin House last night. The majority of us tried out their prix fixed menu which is a 3 course meal for $25 (excluding tax and gratuity). I definitely shouldn't have snacked before coming because I barely touched my calamari appetizer. I had to save room for the main course -- the medium rare prime rib. The prime rib came out without au jus, cooked as medium (instead of medium-rare) and had the HUGEST piece of bread I have ever seen. The meat looked dry and it did taste how it looked. My sister who is a huge fan of prime rib didn't even finish hers because she didn't enjoy it. I wasn't surprised that their prime rib wasn't the best because it isn't featured in their daily menu. For dessert me and my bf chose the apple blossom. Dessert was pretty good.   We celebrated my friend's birthday on the second floor sharing it with a group of loud people sitting beside us...which was pretty annoying. Around 9:30 pm a live musician began to perform as well."}
{"text":"Great ambiance:The building and establishment date back to 1850's! There are regulars, students, and old timers. Gives the place a bit of the \"Cheers\" vibe. Nice live entertainment and stage certain days of the week.  Food is well prepared contemporary Pub fare. Loved the buffalo wings, chicken & nachos, and poutine. Great breakfast and brunch options, especially the omelet and breakfast skillet."}
{"text":"This place is small and lackluster. Nothing good and nothing bad. I came Sunday afternoon before st. Pattys day and it was dead. Ok well all of streetsville was dead. We tried to go up stairs but it was locked off.   They had green beer but that's all I remember.   I didn't eat here"}
{"text":"Went here on a Friday night for a bite to eat and a drink with a friend and ended up staying 4 hours! Part of that had to do with the extremely comfortable chairs at each table. We ordered fish and chips and chicken fingers and salad. Food was typical pub fare and reasonably priced. Turns out the fish and chips are on special Fridays so the discount was a nice surprise.   Good selection of drinks and beer on tap but I was dissapointed they didn't have a drink menu so we had no idea what anything cost. They did however get bonus points for serving Steamwhistle on tap in a chilled Steamwhistle glass. I'm always happy to support local businesses.   The downstairs area is great for dining and catching a game, nice background music and good service kept everyone in good spirits. The upstairs had live music, a full bar with with waitress service, patio and plenty of tables. There were even people dancing to the live music.  Overall, I would definitely come back and maybe spend another 4 hours!"}
{"text":"The Franklin House was built in 1855 as the  private residence of Peter Douglas, who in 1859 went on to sell it to Bennet Franklin. In 1877 the building was converted to a Hotel and Public House which eventually in 1910 under new ownership was renamed \"Queen's Hotel\".  In 1927 it ceased to operate as a hotel with the  enforcement of the Canada Temperance Act, but has continued to be used for commercial purposes.  The Franklin House has now completely renovated and serves as a bar, pub, sport bar (NHL, NFL, UFC...) and a gathering place for the locals!  Love the patio here and with the heated outdoor lamps, you can even enjoy a drink when the weather gets a little chilly.  According to sources, the ghost of a young woman named Jessie has purportedly haunted the grounds since the mid-19th century, and her presence is still felt.  If you looking for a place to chill with your friends in Streetsville, The Franklin House just might be the one!"}
{"text":"Franklin House is always crowded so they must have something good to offer. Perhaps the patio is nice, and it's good for a drink, but the patio was full and we ended up inside. It was cramped, there were only 3 or 4 other people inside, but it was terrible. We were seated off the bar, between the kitchen door and the door out to the patio. The music was so loud we could not hold a conversation. They did not have the beer I like, or my second, or even my third choice. The waitress was not overly friendly, but she was. What made this such a terrible experience aside from the atmosphere was the food. We ordered flat bread appetizer, cheese and bacon, and it was not good, no flavour, sorta dry and bland. For dinner, I ordered stuffed yorkshire pudding. What little bit of actual roast that was in there was dry, definitely reheated from frozen. The yorkshire pudding itself was gummy and tough, the vegetables tasted reheated and bland. My companion ordered a burger and fries, and the fries were awful, soggy, no seasoning, tasted like they had been fried in old oil, and the burger was dry and had no flavour. Our bill for 2 beer, and 2 meals and the flat bread was almost 60 dollars. We left and went to Burrito Boyz and got something else as we were still hungry."}
{"text":"Nice place - much better than it used to be run under older management a couple years back. Still a little dull, food is okay and prices aren't bad. Service was a little slow at times, though it seemed to be more of a staffing issue rather than a waitress issue. I'd like to come back in the summer on the patio, as that seems to be a selling point for a lot of people."}
{"text":"I came here with my co-workers to celebrate an uneventful Black Friday. The interior looked inviting. I had a Rickard's Red ($6) and the shepherd's pie ($12). I was quite disappointed. The shepherd's pie was essentially hamburger helper underneath baked potato scraps. The price is too high for the quality."}
{"text":"I came here on wing night where the humongous wings were $0.80 each and boneless wings were $0.60 each. When I say humongous I mean 3 inches long wings. It was fabulous. The minimum order was 10 which wasn't a bad deal. When we asked for dusted and they weren't as breaded as other places. The skin still had a nice crisp though but we had to ask for more sauce, especially for the honey garlic. The wings aren't tossed but drizzled on. We also got chipotle BBQ as well, both sauces were tasty. Our hostess/waitress was really nice and served us well.  I will definitely be returning here when I have a wing craving!"}
{"text":"So I am here for the first time. Had a few drinks and food. The bartender, Keirra, and the server, Jessie, both extended excellent, courteous service. The flat bread with chicken was excellent. Pricing was good. I would come here again.  Overall good experience"}
