{"text":"LOVE!! Your average bar but with a cooler atmosphere than most!  Went here around lent and ordered  the fish sandwich. I got it to go, the wait was kind of long and I'm assuming there set up to pick up isn't always the same but it was kind of odd but with all that set aside, the sandwich was AMAZING which is why I'm giving this a 5 stars!"}
{"text":"So far, I've been waiting 30 minutes for a gin gimlet.  Apparently, it's a complicated drink.  This does not bode well for the place. We mistakenly bought tickets to a comedy show here, so we can't leave, but will never make that mistake again."}
{"text":"Awesome beer selection, amazing food, and great service! Family owned restaurant with a great menu. Huge portions for decent price!"}
{"text":"Excellent food. When they say large portions, they mean it.  Large fish without bun could feed three or four alone. Recommend they nut & blue cheese salad with chicken. My only suggestion is for a better selection of beer. By which I mean local craft beers.   It should be packed on a Friday evening for dinner. I can only guess that it isn't due to location or more likely reputation from previous owners."}
{"text":"Fish sandwiches are huge but not very good unless you like your breading falling off."}
{"text":"Just finished a visit to Irwin from San Diego and found this spot quite randomly.  Big portions...check. Reasonable prices...check.  Cold beer....check.  Good service...check (thanks Krista).   Order the fish sandwhich, huge wings, and some hoagies.  All were great.   Anybody from out of town looking for something other chain restaurants needs to find this place!"}
{"text":"Great bartender and service. Ordered take out and the food was excellent. They're back on track."}
{"text":"Another new discovery for me is Rose Bar & Grille in White Oak, PA.  Had never been there until Friday night and I'm sure glad we did.  My wife had chicken parm and I went for the cod father fish sandwich.  Not only were the portions huge, the food was great!  The light breading on the fish was perfect.  I was told that the chicken parm was spectacular.  Our server Anna did a great job of making us feel welcome and keeping our drinks full and icy.  If you haven't been there, I'd suggest that you check it out."}
{"text":"I've recently been coming here for karaoke.  This place is fun and welcoming and the food is great too. It's a good place to go for a drink and share apps with friends. Nice open area with a pool table and bar too. I will be frequenting this establishment as they seem to have a decent amount of entertainment as well.  Just a note you must try the stuffed provolone  zucchini rolls. They are phenomenal!"}
{"text":"Stopped here pregaming before a wedding up the road.   Decor...a little random.   Food...we had a few appetizers and I have to say they were pretty damn good! Hot cheese balls, nachos and quesadilla. The chips are fresh made there which makes any nacho dip great.   Beer selection...awesome tap selection with around 12 or so great craft beers. A lot of seasonal.   Service. A little slow, but it was one bartender for seemed to be the entire place. What really was slow was the food service. Not awful, but could have been a bit quicker. The bartender was very friendly and informed one of us when ordering the Pumking that it was $10/16oz draft. I know that it is more expensive, but that could be a surprise for the regular customer so the head's up I think is appreciated.   I'll return here to check out other items on the menu and changing draft list."}
{"text":"The only positive is the fish was giant. The taste, was bland, it was mostly breading. We ordered 2 fish sandwiches and the stuffed zucchini, and our bill was 48.00!!!!! Expensive, bland and our wait was 1 hour and 2 min, for fried fish?? Never again!"}
{"text":"Great place, great food and great people.  Restaurant with a small bar with a pool table makes  for a cozy atmosphere.  It is no longer a smoking bar, so I would think that appeals to many more customers.  Jamie, the bartender, is an awesome guy and great at what he does!  They've brought in more types of beers in the last year, so that's ideal for some of the crafty beer types.  I'm not a big fan of pizza, but I love theirs.  The Roseberry sauce for wings is my favorite - sweet with a bit of a kick!  Their fish sandwich is the best in the area.  You really can't go wrong with what you choose from their menu.  I've had many great lunches here and fun nights shooting pool.  It rarely ever gets obnoxiously loud with unruly customers like some other bars, so it's ideal for those who want a fun night without the drama."}
{"text":"Slow service, lazy cuisine, but they have beer, and you can smoke there.  So, uh, yeah.    My fish was obviously frozen, and it was over cooked, served on boring old iceberg lettuce.  My friend's hamburger was the same, overcooked and tasteless."}
{"text":"Good beer prices, good beer selection, the food is unremarkable bar food. Seems to have a pretty active local crowd of regulars and a friendly sort of place. Definitely a neighborhood bar feel.  Overall a good place to get a drink. I was not too impressed with their wings,  or any of the food I saw served."}
{"text":"A group of us visited the Rose on Sunday afternoon.  I was pleasantly surprised at the cleanliness, extensive menu and service. I had grilled shrimp tacos and they were excellent.  The sautéed veggies were perfect and the wings and cheese balls were great. Our waiter was very efficient.  I am not from this area but I will return again. Don't pass this restaurant up. I have no complaints."}
{"text":"Great food and a good selection of drafts and bottles. Been here a few times and haven't had a bad meal or drink yet."}
