{"text":"I am one not to write reviews but since I have plenty of time on my hands waiting here I decided why not. Well if you plan on coming here on New Year's Eve for dinner expect to wait 2 hours !!! We were initially told 1 hour and 20 mins so we decided to accept it, but it has now been 2 hours and we still haven't been seated. I just don't want others to get the wrong impression I don't appreciate when restaurants tell you a certain time but then it extends way over. Once you have invested an hour and 20 mins you just keep waiting I sure hope the steaks are good. 

So once again expect the minimum of 2 hours"}
{"text":"I was here with a friend in the summer on the patio for dinner and the service was very poor! Recently, I came here with friends at Christmas (large group with kids) and we had an excellent dinner and excellent service! We sat in the section  by the fireplace, which was a little too warm. All in all great food and great service!"}
{"text":"There are better places to go for steak. Bacon around filet mignon was black. Mashed potatoes were delicious.
The booth that we were seated on had a huge rip in the leather fabric. The appetizers were so so, escargots came in a weird Indian cuisine tasting butter, the sauce that came with the bacon wrapped scallops was not the greatest. The bread is good.
The desserts were very good."}
{"text":"We had a wonderful experience at the Keg for a birthday dinner.  I hadn't been there for a while, so was not sure what to expect.  I was not disappointed!  

The service was excellent and they really catered to our daughter (even though it was not her birthday!).  

Our server was attentive and made lots of suggestions to us for drinks, appetizers and entrees.  She even brought out a fruit plate for our daughter once she placed our orders.  

We had chicken & rubs and grilled shrimp and split a caesar salad as an appetizer.  Our food was great - no complaints!  It nice great to be in a restaurant with ambiance, even with a little one.  Overall a positive experience and it is clear that this location is a well-run establishment."}
{"text":"You can never go wrong while eating at the Keg. Their steaks are to perfection and their food is top notch. I have been to the Keg about 11 times and every time it has been an extraordinary meal that satisfies me."}
{"text":"Just got a love the Keg. Caesar salads are awesome, the steaks are so good, the atmosphere is excellent and the service is immpeccable. I will be back."}
{"text":"Had a great time at the keg! Our Server was amazing and the food was spectacular! The wait was a little long though but well worth it!"}
{"text":"HUGE Keg fan.... when going out for a really good meal The Keg is the quintessential value restaurant in this price range.

I highly recommend The Keg classic dinners, as they come with your own personal starter salad and additional veggies with the main course.

The only let down may be the inevitable wait you'll experience Fridays and Saturdays; you better get there before 5:30."}
{"text":"Have been to many Keg locations before but it was our first time here after moving into the neighbourhood and unfortunately was a horrible experience. We visited Saturday night. All was going well until about halfway through my girlfriend's glass of water we noticed that the glass was filthy! Looked like it had been run through a washer with no water on and had little bits of dirt and food stuck to it. We pointed this out to the waitress and she said \"oh wow\". No apology and no new glass brought out. I would have thought it would have been brought to the managers attention however no one came up to us to apologize for the remainder of our stay. My steak was also undercooked which was a little disappointing but not a huge deal. The worst part was after returning home we both started to feel nauseous and I got sick for about about two days. Huge let down as we frequent the keg often but will stay away from this location from now on based on this experience."}
{"text":"You can't be perfect all the time! 

Been to this KEG maybe twenty times and it has always been outstanding. The KEG is famous for it's food and service and on both last night they failed badly.  The service was atrocious. Waiter brought the wrong order, we hardly ever saw him, and it took forever to get the bill.  My 10 oz filet mignon was not up to their usual quality. 

I'm sure next time it will be perfect again."}
{"text":"Visited The Keg on Trafalgar on January 20th, 2014 at 4PM. We were celebrating a special occasion and decided to return to this Keg because of positive prior experiences.

It was our last visit. Here's why:

-The hostess had great difficulty extracting a greeting.
-The menus were filthy and ragged.
-We had empty plates sit on our table for over 10 minutes.
-There was some type of fly that kept hovering over our table.
-We ordered garlic shrimp which arrived as a gooey mess. It was an entirely new flavour and certainly was neither garlicky nor buttery. 
- We asked for the bill and the server returned with it stating that \"since we were in such a rush\" the complimentary (and pre-made/brought in) cheesecake was packed to go.
-Around 3 AM I awoke with bad stomach cramps. 

The Oakville Keg = never again."}
{"text":"Tuna tartare and escargots for starters.  Pistachio crusted salmon and New York steak for mains.  Billy miner pie for dessert.  

Tuna tartare was tasty although I don't think the deep fried wonton chips were a good complement to the dish.  Escargot were buttery good.  And you get a nice sour dough bread to start!  Mains were good and hit the spot.  Ice cream pie was a huge slice and perfect for sharing.


Service is friendly and efficient, ie the guy who takes your order is not the guy who brings your meals but he will give you your bill!  Great place for a nice dinner anytime the mood hits!"}
{"text":"One of my favourite kegs to visit.  I've been coming here since they opened and to say I'm a regular is an understatement, in the last 7 years I've maybe had three steaks which were not cooked properly and they promptly made it right. You can't go wrong with a percentage like that.  The staff, beverages, and food are always incredible.  Great place to come for dinner or even just drinks."}
{"text":"Good food and good service. Very popular location since there is often a long wait. Make reservations when possible - even when you expect that it's not necessary...very busy."}
{"text":"Checked online for hours of operation. It says 12:00 to 11:59. Drove all the way from Milton to Oakville for a celebratory lunch....CLOSED!!!!!! Hours of operation on the door are different then website! Very disappointed!"}
{"text":"For the price I give it a 3. If it was less expensive a 3.5. KC cut was good,  not great. Garlic mashed were good. Overalll a good experience."}
{"text":"We dined here last night and took my girlfriends grandmother. What a wonderful experience. I would consider us regulars of the Keg in the past but because of recent bad experience last year have not been back until this visit. Everything seemed to just be on point on this visit. Our server Jolene was amazing! She was super helpful and attentive. The food was perfect. I'm a stickler for medium rare prime rib and it came out perfect! We had modifications and nothing was missed on the salads and entrees. We will be back and will be asking for Jolene again! To the management: I think she deserves a promo bottle of JLohr :)"}
{"text":"Worst Keg.  Tried many times always slow service, poor food quality and very noisy."}
{"text":"I love The Keg! This is the second time we've been to this location and we have found on the weekend it is BUSY! So be prepared to wait as we did....for over 90 minutes. Thankfully we had lots of drinks and appetizers at the bar to pass the time away. 

Our waiter was very good and attentive, considering we had about 9 people in our party. Job well done on his part. The food was typical Keg fare, I usually have the 12oz sirloin and I was satisfied. One area I would recommend is that as long as I have been going to The Keg I have noticed the wine list hasn't changed much. I recommend a change NOW! There are so many wines that could be offered by the glass especially, that it's starting to make going feel routine. 

Staff should be up on their wines, and be able to offer more options by the glass to its patrons. Most people won't/can't buy a full bottle in certain circumstances."}
{"text":"Always a delicious time at The Keg! 
However, this location doesn't have an espresso machine! :(
I purposely chose to go to The Keg for their amazing Billy Miner Ice Cream cake pie and a latte. But no espresso machine, means no lattes at this location. 

Their steak, twice-baked baked potato, caesar salad, red sangria and Billy Miner Pie are delicious!!!

Their calamari which I tried isn't the greatest. It was too soft, and maybe it's the oil they use....just wasn't as appetizing as other calamari served at other restaurants."}
{"text":"Such high hopes.
So easily shattered.

Here's how:
1) 65-minute wait. Ok. Ok... we showed up on a Friday night. We should've known better.
-------------------------------------------------
2) Pushy people in the bar. 
Some thoughts while I waited at the bar to be seated:
\"Geez, we're all waiting for the same table... this is gonna take forever\"
\"Stop breathing on me\"
\"Where's my drink?\"
-------------------------------------------------
3) The draft machine broke. Damnit.
-------------------------------------------------
4) Scoring a bar table a few minutes before the buzzer went off. Walking over to reception to say that we got a table at the bar area, and no longer need the buzzer. Going back to the table, excited that you can FINALLY eat... but not being served for 20 minutes
-------------------------------------------------
5) Waiting another 15 minutes before the waitress comes back to take your order... but still needing to waive her down to do so.
-------------------------------------------------
6) The food took forever! AND when we received it, it was just put in front of us. Practically dropped like a hot potato. No parmesan cheese offered. No freshly cracked pepper offered. This is a steakhouse, right?! 
-------------------------------------------------
7) AND another waiter (who was helping our initial waitress) had the balls to say \"Did you guys switch seats on us?\" when he reached to put a plate in front of me and I pointed to my friend across the table to say it was his. Um, how about... you're buddy doesn't know how to write orders?!! 
-------------------------------------------------
8) AND another waitress (who was helping our initial waitress & the aforementioned confused waiter) made the same mistake of putting food in front of the wrong person. MORE proof that our waitress just kinda sucked.
-------------------------------------------------
9) The bill came out in a flash! This would be excellent, but she didn't even ask if we wanted dessert. Geez.... don't you know that when we consume more food and drinks, your tip gets bigger?! fundamentals... fundamentals...
-------------------------------------------------
And last but not least:
10) PAVE THE DANG PARKING LOT! ALL OF IT!! It was rainy and windy and effin' cold on Friday night & I walked through muddy red clay and puddles trying to get back to my car. I want new flats!!

I've been to The Keg in the past (other locations). The food is on par with other Kegs, but this has got to be my worst service experience. It was my first & last to this location in Oakville. Get it together, people. 

*Sigh* And I was so excited to go to a great steakhouse closer than Toronto..."}
{"text":"Seated in a u booth walkin of 5 at 6:15 on a Friday. No reservations as they don't take any on Friday Saturday. Was promptly greeted by the welcoming hostess and were walked to a beautiful large U shaped booth. Alyson our server was great from start to finish. Manager came by and checked up. Great experience and an example of why the keg is where it is."}
{"text":"Place is always busy on weekends. We visit this location quite often and they are usually pretty friendly. We had a waitress (blonde long wavy hair) that was OK - smiled and was somewhat attentive. Food was good and we didn't expect much given it's the typical keg experience but once she gave us the bill and we paid - there was NO thank you , have a good evening or any type of acknowledgement once we settled up. Understanding that we just paid $140+ for a dinner for 2 - I found it totally rude and it turned us right off - seems like she was only putting on a show to get a good tip. Advice: don't hire rude servers or else people won't return. Never again."}
{"text":"Not sure what the complaints are all kegs are exactly the same. I've been to 4-5 locations and they are completely identical but anyways... For the price it's a great steakhouse. Sure you will get better quality beef at higher end spots but for the price this is a great spot. It's always very busy which is nice. I much prefer sitting in the bar area rather than the dining which I find to be depressing."}
{"text":"Consistently good food and service! Always busy and always doing what's needed for the customer to be happy! We come here often and it has never failed or disappointed us. Mark who is one of the managers is always looking after everyone! Highly recommend this location."}
{"text":"Love the crab special they typically run in feb-april.  They bring in duneness crab, the very BEST crab on earth folks.  I just wish they could have dungeness crab all year round!  It is so sweet.

The steaks are good too of course.  And the goat cheese appetizer is awesome (if you like goats Cheese of course!)"}
{"text":"I received great service here when I had my dinner at the bar. My bartender/server was prompt in getting my drink and food order and the conversation was lovely. I ordered the bacon wrapped scallops and as always it was very delicious. They came pretty quickly which was fabulous because I was starving. I also ordered a medium rare 6 oz. top sirloin steak with garlic mashed potatoes and béarnaise sauce and it was marvelous. The steak was cooked to perfection. I ended my dinner with a tasty crème brûlée. Definitely recommend this location for a lovely night out."}
{"text":"The Keg is a national brand, so the food is obviously very similar everywhere you go. First off, it is EXPENSIVE, especially if you're used to US steakhouses where you can get a steak dinner for $17.00. But you pay for what you get, which is the intimate ambiance and the amazing wait staff. I've never been to a Keg where the waiter wasn't top-notch.

Everytime we go, we get an appetizer, and everytime, we regret it. They give SUCH small portions for their appetizers, especially the shimp and cheese one. But the brie is SO delicious, I can't help but order that one. My favorite dish is the Sirloin Oscar - just thinking about it makes my mouth water. Delicious sirloin and scallops with asparagus and green beans with the most delectable Bearnaise sauce smothered over top. 

I also don't recommend the twice-baked potato - it is hard and dry as the day is long.

What I DO recommend, though, is going on a nice day where you can take advantage of the outdoor seating, which many Kegs offer. It always enhances everything, the beautiful sun shining on you and the wind ruffling your hair.

Get ready to pay at least $90 to $100 for two people if you go here, which makes it a place we don't go very often, but when we do, we always leave happy."}
