{"text":"I've had the Apple Crisp with avocado about three times now. There is no denying that it is amazing however I find it over-priced at about $10 with tax for a sandwich and ruffles chips."}
{"text":"I have been here a few times and it's a great place! I have only tried the classic, and I should be trying out the other ones in the future. The food is delicious and the environment is super cozy. I especially like how they give you chips + a pickle on the side of your grilled cheese! Overall, a pretty nice place to try."}
{"text":"Meh. I've experienced better.

Don't get me wrong, it has options galore! But if you're not ready to gain 5 lbs in grease alone, back away from the door! 

I love a good grilled cheese. I love the different toppings they offer. I just can't handle a grease overload. I'm going to equate it to the amount of cheese they put on it. It's delicious but you don't feel delicious once you're done."}
{"text":"Incredibly delicious, and a great stop to make when you have the time. We all enjoyed lunch!"}
{"text":"We came on a holiday and split the \"Black Jack\". They were out of the Monterey Jack Cheese but we got it anyways with just cheddar. It was OK, the pesto was a nice touch. But all in all it was under seasoned and kind of bland- could have used more salt or something. There was also trash everywhere and we had to wait roughly 15mins despite being the only table there."}
{"text":"En visitant le pittoresque quartier de Kensington Market et en voulant manger autre chose que des tacos, nous sommes tombés sur ce petit resto que nous avons eu le plaisir de découvrir.
Très  BONS grilled cheese réconfortants servis avec des chips et pickles dans une ambiance sympa et décontractée. 
Par contre, prévoyez de la monnaie. Aucune carte de paiement sur place."}
{"text":"The best grilled cheese I've ever had. Comes with some potato chips and a pickle. Great vibe, great staff, amazing sandwiches  and just over all great experience!"}
{"text":"on a rainy tuesday what else could you possibly desire more than a grilled cheese?! 

10 different sandwich options, meat or meat-free, served complete with pickle and chips! I had the black Jack which includes jalapeno havarti, grilled spinach and tomato and a black olive pesto! 
it fits well into the Kensington atmosphere. it is a wonderful option for lunch or a late night snack! I would definitely recommend. And I will definitely do it again!"}
{"text":"Who doesn't like a grilled cheese and a pickle?  I have always enjoyed my sandwiches at this place and love eating at a picnic table.  The jars of pickled items on display only add to the decor and I find myself eating with a smile on my face.  

It's not just about the food, it's also about the environment."}
{"text":"I was so excited as I saw this place being built - what could be better than an entire restaurant dedicated to my favourite sandwich? Seriously - what could be better? 

I've eaten here on numerous occasions, and although I so want it to be amazing, it always leaves me a little cold. Service is slow, and for someone on a lunch break such as myself that is not appreciated. The sandwich combinations are interesting from \"the classic\" (you can guess at that one) to \"the beast\" (loaded with turkey cold cuts, bacon, tomato, onions and other yummy stuff) - yet I have a very hard time actually considering what they make to be grilled cheese sandwiches. Yes, they are sandwiches. Yes, they contain melted cheese. Yes, they are grilled. But still... there's something a miss. The presses they use to make the sandwich smush the bread into hard crusty boards, and are more reminiscent of paninis than a traditional grilled cheese. 

The flavour combinations are tasty, and the atmosphere is great. And once I accepted that when I go there, I wont be getting wonder bread with processed cheese (I know it's sad - but that's sometimes all I want) I can accept their sandwiches for what they are. Which isn't quite what I want, but not bad either."}
{"text":"A tiny little joint that makes only great grilled cheese, bisque to dip, Ruffles and a pickle. Grab any one that appeals, walk across the street to Ronnie's and grab a beer. Such fun."}
{"text":"Short but sweet visit. My friend and I decided to spontaneously pop into the place while walking around the Kesington strip. 

The place is small but provides a good amount of seating. I was a big fan of the large windows which allows for a lot of light to come in while you're eating.

The staff are very friendly and funny. I overheard them joking around and thought that they had a wonderful dynamic with each other. 

We ordered a Blackjack which had pesto sauce, spicy jalapeño havarti cheese, spinach and tomato. It was supposed to be a twenty minute wait but we received our order in five minutes. The sandwich was good, no complaints. It's served with a side of chips and a pickle.

The quality of the sandwiches are good. You don't feel sick afterwards so that's also a bonus."}
{"text":"4.5 stars!

While craving for some comfort food, I ended up at The Grilled Cheese, in the heart of Kensington Market.

The space is really casual - no frills with limited seating and a picnic table out front. I'd be careful about coming here on a really busy day. I can see the sandwiches taking a while since they don't have very much space to grill all the sandwiches.

What went in my belly:

The Black Jack - jalapeno, havarti, tomato, spinach & black olive pesto ($6).  The cashier informed us this was their most popular sandwich, so I was sold. There was a generous amount of cheese sandwiched between thick slices of buttery bread and we both loved the saltiness from the black olive pesto.  Comfort food at its best! I can see why this is so popular!

Apple Bacon Crisp - Ida red apples, caramelized onions, bacon & cheddar ($8) which appeared to be one of the specials of the day. When I first read the name of the sandwich, I thought it was a dessert. Despite being on the heavy and side (it's a grilled cheese after all), it was a fantastic grilled cheese. If you're a fan of the sweet and savoury combination, you'd love this - the sweetness from the apples and caramelized onions and the saltiness from the bacon was delicious.

While I can't attest to most of their menu, I loved the Black Jack and Apple Bacon Crisp. You can bet I'll be back to try their other offerings!"}
{"text":"Two words; Effing amazing!

I got the cremini and portobello grilled cheese with a pellegrino blood orange drink, and I loved it!!

If you think about it, this is a perfect restaurant for Kensington Market. Its got lots of quality ingredients, tons of menu options and a really simple and quick to make product.

Waiting took 15 minutes for food, considering the line up was out the door, that's not too bad.

Sandwich wise, it  was really greasy, but thats to be expected with a grilled cheese. Lots of flavour and gusto to the sandwich, I was talking about it all weekend (of which all of my friends told me to shut up).

All in all, I loved this place. Give it a shot, you'll like it. 

Seating across the street  at RONNIE 069 is also part of the restaurant, and they bring the food to your table.

buon appetit."}
{"text":"So good! I only grilled cheese place I've ever visited but set a high standard for other places. Each sandwich comes with chips and a pickle wedge. There are lots of different kinds of ingredients, from bacon to olives to turkey. I had the Blackjack last time I visited, which was great and filling, but next time I will get something with meat in it. Love the panini-style grilling which cuts down on messiness. Downsides are the wait time, which I guess can't be helped, and the fact that they only take cash."}
{"text":"I ordered a mushroom madness and took a seat at the bar along the window. The sandwich took about 10 minutes, which gave me plenty of time to eavesdrop on the employees and patrons. I really liked the space and the chill vibe.

I burnt my tongue on the first bite of my sandwich - the cheese was absolutely dripping from it. There was a healthy amount of mushrooms in the sandwich. Overall, it was a decent grilled cheese. 

I was a bit disappointed in the white, generic bread. For a shop that makes its own pesto, soup, etc., I would've expected a better bread (not necessarily homemade, but not mass-produced stuff), or at least the option for something more whole grain."}
{"text":"We got the Mushroom Madness and the Classic with bacon. Food was ok, staff were nice...I guess I just expected more via the ratings. Good but not great..."}
{"text":"Had the mushroom madness with bacon. It was deliciously greasy. One of the best grilled cheeses I've had. 

If you're looking for some serious comfort food. Give this place a try."}
{"text":"Yum.. I love melted cheese therefore I'm biased towards this place. I really like the location in Kensington, and across from Ronnie's as well as the friendly staff. My favorite are their classic ones with lots of cheddar, the mushroom and the works grilled cheese are especially great. The Pickle that accompanies your melted cheese heaven is  pretty sweet too and helps to make it a nice filling meal. 

Bonus points for delivering across the street to the bar and picking up your empty basket, what a great mix with a cold beer!"}
{"text":"I came here with some friends, we each had different sandwiches and we all agreed that they were amazing! They have a wide variety of sandwiches that you can choose from, but i chose the Grilled Worx which I really enjoyed. The servers were also very friendly and nice, and I liked the layout of the restaurant. I gave it only four stars instead of five though, because even though they make really good sandwiches, the sides that come with it, (the chips and the pickles) weren't that great in my opinion. But if you're hungry and in Kensington market, this is definitely a place to check out!"}
{"text":"talking about making something simple really delicious and great.

great sitting outside and enjoy kensington market. people are very very friendly.

best grilled cheese i ever had....mmmmmmmmmm"}
{"text":"This place has a quaint mom and pop atmosphere that fits right in with the Kensington neighbourhood. Service can be slow just because they're taking so many orders and they have one panini press!

I'll be honest with you that I was expecting a gourmet grilled cheese experience when I was reading the menu so I was a little disappointed when I received my well... grilled cheese sandwich. I think somewhere in the back of my mind I was picturing a panini when reading the menu, but when I got my sandwich, I realized that I got exactly what I had ordered.

When I took my first bite I thought that it was too cheesy and that I couldn't  taste the mushrooms in my sandwich. The bread wasn't a bun, a roll, a kaiser, or a ciabatta. It was sliced bread. Then it donned on me... it wasn't a poorly made panini, it was a perfect grilled cheese sandwich! The toast was buttery and crunchy, the cheese was gooey and oozy, and the fillings were perfectly sauteed!

The chips and pickles left something to be desired since the pickle had a little funky smell to it, but hey, maybe I'm just used to the unsophisticated store bought stuff. The chips were right out of a bag and soggy with pickle juice, so I passed on those...

Other than that, the price was right and the sandwich hit the spot!"}
{"text":"Great food doesn't need to be complicated! Had the mushroom melt and it was yum! The decor is like being in a cottage. Definitely a relaxing environment.
Will go back for sure."}
{"text":"I love grilled cheese sandwiches. End of story. When I first learned about this restaurant called Grilled Cheese, I was giddy with excitement ! 

Today I introduced a Vancouver friend to Kensington & theGC. He loved it! If I love what I'm eating, when  the texture is just warmed enough to make the cheese gooey, along with the avocado, Carmelized onions and apple slices and lots of butter so that the saturated fat is almost dripping off the bread.....I'm moaning quietly, in order to give thanks to the Universe .

How lucky are we to have this cute resto in TDot?  And what I've noticed is the perfectly cooked sandwich every time!

Can't wait to go again!"}
{"text":"cockroach. saw one in there the other day. f-ing run. and spend your six bucks on something that takes actual skill to make."}
{"text":"I went here for the first time yesterday for lunch with several friends.  We were all quite hungry as we'd been trekking around the city and were very happy with our delish sandwiches!  All of the options sounded great, and we had trouble choosing.  Each of us chose something different, but we all loved our sammies.  

This is a great basic grilled cheese sammy with a little something extra thrown in in each option.  They come with a really big pickle spear and a little side of chips.  Even with a drink your whole bill comes in below $10."}
{"text":"This has been on our list to try for awhile. We saw it in Food Network a few months ago. We ended up here for lunch and we're not disappointed. 

I had the Blackjack with jalapeño havarti, black olive pesto, spinach and tomato. Delish! The flavours worked so well together. The bread was crispy on the outside but still soft and squishy on the inside. My husband tried the classic and added bacon. It was by far the gooiest grilled cheese I've ever seen. 

Fun, casual atmosphere and great Kensington Market location."}
{"text":"So I love the Canadian atmosphere and who doesn't like grilled cheese?? I had loads of fun with the cute cups so they know where to serve you when you sit. The only reason why they get one less star is because of the price. Some sandwiches are 9-10 dollars? Not to say that they don't taste good but I think it's a bit much. Great place for a small group of friends to relax! I would suggest anyone to go just because of this casual, fun experience"}
{"text":"Before you go here Google the business and read the star article. Horrible treatment of employees and not paying them."}
{"text":"Got my sandwich wrong - didn't know 4 ingredients was that difficult - and took ages to fix it and it was still wrong. Two of the people I was with had finished by the time my food arrived. Ended up with a disgusting sandwich with cold, hard, once-melted cheese and some warm slimy vegetables stuffed inside. It was disgusting. No pride in their work and a manager who seemed more preoccupied with the music they were playing than what was happening in the kitchen. With so much good food in Kensington, I'll have a hard time bringing myself to bother with this place again."}
{"text":"Delicious! I had the grilled cheese with aged cheddar, and the inside was gooey and delicious, and the outside was crispy and buttery. The service was friendly and quick, and it had a nice, warm atmosphere. I'd definitely return!"}
{"text":"This place is really \"open\" to the street. Feeling like in South Asia, Thailand or something:) antique and origin.
Ordered mushroom madness. It was amazing. Rich and fulfilled. Kind of greasy, but in a good way. Who doesn't like high calories stuff?
Will Definitely go back"}
{"text":"Oh the weather outside was frightful... but the grilled cheese was so delightful. And since I don't give a damn about my waistline, let's eat more let's eat more let's eat more :D

Downpour of rain outside. Warm fireplace inside. Sporting an empty stomach. They got delish grilled cheese and soup. What a perfect match made in rainy Kensington! It's just what we needed after trekking out hungry in the rain.

We tried the tomato soup and the mushroom soup - amazing because you know it's actually made with real stuff and not canned - hot and delicious. I had the blackjack - the bread was toasted just right (I'm sure with a LOT of burrerrr that I wouldn't dare to use if I were to make one at home), and it was stuffed with delicious goodness that probably clogged my arteries a bit more.

For 10$? Totally filling and satisfying. It was a good cushion for all the drinking that ensued later on in the night. And the trick to avoiding a long wait: go on a disgustingly pouring weeknight (9pm) when there is not a living soul walking in Kensington, obviously."}
{"text":"It's rare that patrons get insight into how a restaurant treats it's workers: http://t.thestar.com/#/article/news/gta/2015/06/29/toronto-workers-in-war-over-unpaid-wages-with-grilled-cheese-restaurant-owner.html

Plenty of other options in Kensington."}
{"text":"I really like this place and the grilled cheese. Great variety - the Lanois and the mushroom one are my favourites.

However, I've been here 4 times, and 3 out of 4 times they were out of one or two ingredients. When I asked to have avocado instead of one of their missing ingredients, they said they would have to charge me for it. Also the cooks and cashiers are very slow."}
{"text":"I liked this place. I was in the mood for a grilled cheese sandwich a bit dressed up and that's what I got! I had the apple crisp with bacon and avocado (you can either pick one or get both for a dollar extra) and my girlfriend had the grill works. Both sandwiches were tasty and they came with a side of chips and a pickle.

The sandwich was well cooked and the ingredients were well inserted. The taste of the thing hit the spot. Nothing fell out super easy either which could have been a big problem.

They provide ketchup and condiments although neither may be necessary given that the sandwiches are plenty full.

I would caution that there is not much seating so this would be a hard place to bring a group. But if you are in the Kensington market and in the mood for a dressed up grilled cheese, I'd say give it a whirl."}
{"text":"This is the best grilled cheese sandwich shop in Toronto! The inside is comfy just like a cottage and their sandwiches are the ultimate comfort food."}
{"text":"this was my second time going to this restart and I am very pleased. it was very crowded and took a long time to order and receive our food. the restaurant was a small space that was crowded and not well organization. 
on the other hand, once we got our food, it was amazing! It was Totally worth the wait and I recommend it!"}
{"text":"I was looking for a grilled cheese place in Kensington, and found them on yelp. They have a good variety of sandwiches and the staff was friendly. I definitely enjoyed mine! Would love to go there again."}
{"text":"savory!  

points for homey warm decor/interior, popping flavor combos, and simple but delicious dedication to the grown up's grilled cheese.

had the motzy this time.  arugula-so-good.  next time will have to try the portabello.

eat in, or grab one to go and have with a pint across the street at Ronnie's."}
{"text":"i think this place is closed. the number is not in service at this time.

http://globalnews.ca/news/2079758/former-employee-grills-owner-of-popular-toronto-grilled-cheese-joint/"}
{"text":"Grilled cheese please!

I wanted grilled cheese.  

Oh, how I miss Yasi's Place...  
Now that Yasi's is gone... delicious grilled cheese seems like a distant memory.

I ordered the Blackjack and we took a seat by the window.
It's fun to people watch with Ronnie's Local just across the street.
And it felt like we were people watching for an eternity as we waited for our food.

Buttery, crispy, toasty bread stuffed full of monterey Jack, tomatoes, spinach, olives ...

Could have used more olives.

It was pretty good.  But I didn't spend a lot time tasting since I was just shoveling hot sandwich into my mouth!

...Because I was STARVING.

And it was a freaking long wait for such a simple sandwich.

It's a good grilled cheese, but not the best I've had.
And the search continues..."}
{"text":"I am a huge fan of grilled cheese. That being said I had one of the best grilled cheese sandwiches I've ever had here just last week. We ordered the apple crisp sandwich, which the workers there told us was a customer favourite. It is now one of my favourite sandwiches. It was a little bit of a wait until we finally got our sandwich, even though there were only two other customers at the time, but the sandwich was definitely worth the wait.
Going to go back soon and try the others!"}
{"text":"I'm sure it's crossed more than a few minds the idea of opening a restaurant of sorts that specialized in grilled cheese sandwiches. How would you do it? A small cozy nook someplace in a hip, roots level area of town. You'd offer a variety of breads as well a variety of cheeses. In fact why not give people the option to add meat and veggies to their grilled cheese sandwich too? To top it off add some gratis potato chips and a slice of pickle. That my friends is what The Grilled Cheese in Kensington Market has done.

I went in on a Sunday afternoon and was lucky to not have to wait to order my sandwich as I've seen this establishment become quite busy at times with a line up of local fans. I ordered the Hamlet on rye which included cheddar cheese, ham, onions, and tomato.  It came in a basket with chips and a pickle. The sandwich was grilled in a common restaurant sandwich griller as oppose to the old school spatula-squish method. The results were pretty good as the cheese was hot n gooey while the rest of the ingredients in the sandwich maintained their consistency. I devoured it all in record time. It was gooood. The gal who made the sandwich came over and asked how I liked it. I smiled and pointed at my empty food basket \"All gone!\"

The grilled cheese sandwiches here come in a number of variations to suit anyone's taste. For example you have the \"Classic\" (Monterey Jack, Cheddar, Provolone, and Tomato), the \"Black Jack\" (Jalapeno Monterey Jack, Tomato, Spinach, and Black Olive Pesto) the \"Dill-icious\" (Dill Havarti, Basil Pesto, Sundried Tomato, and Onion) and many more variations on the grilled cheese theme can be found. You also have the choice of adding select meats to your sandwich for $2. more. In fact if the place is not too busy you can have them construct the grilled cheese sandwich of your dreams with any of their available ingredients. 

Decor-wise the place has warm wood tones and is open to the street for those who want to take in Kensington Market life as they munch away. There is even a small patio for those wanting to soak in more of the summer sun.

The sandwiches tend to be a tad pricey, you don't come here to stuff yourself silly on the cheap. More so you come here to fulfill your craving for a yummy grilled cheese sandwich with superior ingredients which this establishment does quite admirably. I'd recommend this place as a must go to if your ever in the Kensington Market area. 

Tip: Apparently the sparse amount of potato chips you get with your grilled cheese sandwich is to do to the fact most people barely touch them, thus many of the chips served end up tossed to waste. If however you promise the person at the counter to eat all your chips then I'm sure they'll be more than happy to add a good helping along side your sandwich."}
{"text":"Can I just say yum!  You would never think that grilled cheese was anything to write home about but the combination of ingredients that these people stuffed between bread is just smart thinking.  

As a meat-atarian I recommend the Beast. For a lighter choice, I liked the Pesto with added avocado (extra $2).

Despite the food being awesome, this place could use a few improvements: (1) More staff would definitely help with wait times and line ups.  When I went during a busy lunch time rush, there was only 1 person behind the counter (2) Re-arrange the indoor seating.  I had to constantly get up any time someone behind me had to get out (3) Debit/Creditcard machine please - this place is cash only. (4) Don't forget my pickle!

If you're lucky enough, snag a seat outside and enjoy the grilled goodness with the always interesting sights of Kensington Market."}
{"text":"Maybe it's just me, but there seems to be something missing when I go there now. It's probably just salt, but when I eat there now, it just doesn't taste quite as good, for one reason or another.

Maybe it's a hole in my soul, but filling that hole with cheese and good ingredients usually works."}
{"text":"Great prices for gourmet grilled cheeses in a hip, unique environment. It's not licensed, but the food was great!"}
{"text":"Ronnies + The Grilled Chese = Ultimate hipster bar experience.

Both the Classic and the Hamlet sandwiches are incredible.  There is TONS of cheese in each sandwich, to the point where one of the folks in the group wanted to order a \"half cheese\" serving.   I'm told they source all their ingredients from the grocery store down the block, which just adds to the charm.  It comes with Ruffle-like ridged chips, which taste amazing (especially if you haven't had rippled chips in years).

The very best part about this place is that if you're having drinks across the street at Ronnies they'll walk the order over to you.  That's real service!

Note they close at 10pm on Fridays, in case you want to have seconds."}
{"text":"Had this place bookmarked even before this place got on You Gotta Eat Here, but after seeing it on the show I was more excited to go there. I ordered the dillicious and overall it was pretty good! I liked that all the grilled cheese orders came with a pickle, which helps to cut the greasiness of the cheese. However I did wish that there was more dill in my 'Dillicious' sandwich, since the cheese was pretty dominant and covered up most of the other flavours. With the sandwich on it's own, probably only worth a 3.5, but the service was quite friendly and the prices were very affordable for a \"gourmet grilled cheese\" which sometimes start from $8 and up. Here I believe sandwiches start at around $6. So with the good service and affordable pricing I decided to bump it up a little. May come back to try the soup 'cause it looked pretty enticing on tv!"}
{"text":"This place is fun, no doubt about it. I ordered from the vegetarian section.  A cheddar grilled cheese on store bought brown bread. How bread and cheese rank as vegetarian is beyond me. I'm not a vegetarian and I don't want to be a kill joy so I quietly eat. I give 3 stars because this place is fun and they do what they do well, even though it may not be what should be on your menu for healthy eating.They seem to deliver as the waitress carried a few orders over to the patio across the street ;)"}
{"text":"I am embarrassed to say that even though I live in the market, yesterday was only my first time visiting the grill Cheese joint. I will be back (if I didn't have to work today, I would be heading there for lunch!).  This place sells grilled cheese and grilled cheese alone. But don't think that they don't have variety. Between the Dill-licious grill cheese and the delicious mushroom grilled cheese (which I indulged in yesterday), they have many options. Who know you could make grilled cheese such a variety of ways! 

The girl working at the restaurant was extremely outgoing and such a sweetheart. You can't help but adore her.

The decor is that of a cozy cabin. I sat at a bar stool and enjoyed this weeks NOW magazine while devouring my grilled cheese. 

The price is good, the food is amazing, the staff, incredible. There is nothing about this place I don't like! I will be back ASAP!"}
{"text":"Good place to eat.  Enjoyed the mushroom madness but wishing had the Cuban special.  Pickles are amazing.  Only thing make it better would be a pint."}
{"text":"Why have I never come here?  I always thought of grilled cheese sandwiches as something we can all make at home.  Throw in some extra ingredients, boom, get charged ten bucks.  

Well, it was Pedestrian Sunday and the weather was gorgeous.  For the end of September, we really couldn't have asked for more.  We could've asked for a less crummy summer during July and August, but that's another story altogether.   

Wandering around, we noticed this place was pretty busy.  Most of the establishments are usually busy during Pedestrian Sundays.  I felt like a snack and decided, why the heck not?

Just looking at their servings, my mouth was watering.  Decent sandwich sizes.  Gooey cheese, your choice of bread, and lots of different combinations.  

They were somewhat back-logged but that was alright.  We just walked around some more and came back 20 minutes later to get my sandwich.  I had the one with mushrooms.  I love mushrooms.  It was perfectly made.  Crispy, buttery, cheesy, mushroom-y...  $6 plus tax.  It was worth it.  

There were so many types to choose from!  I'm quite sure I will be back to try another variation of the grilled cheese sandwich.  

Your order comes with some potato chips and a pickle.  Nice touch!"}
{"text":"I saw this place on tv and thought: \"I NEED to go\"....and I'm so glad I did. 

The service was good, the atmosphere was cozy, and the food was ...grilled cheese with lots of tasty additions. I've tried the Mushroom Madness, the black jack and the \"lanoise\" (I think that's what it's called). It tasted like something I could have made at home, but it's nice having something comforting like grilled cheese made for you (:D). 

The seating area is all wood, and has a \"cottage'\" feel to it; there's a toasty fire place to sit beside (if you're lucky enough to snag that bench), and a wall of what looks like pickled veg. It's a good place to go to for a late night bite, or to hang out with friends, and it seems like each order comes with a side of ruffled potato chips and a sour pickle. Pretty good spot."}
{"text":"This is taking a staple comfort food to new and tasty levels.
They have a great selection of favorites or make your own.
Wonderful Bread from Silverstiens Bakery. Tasty 5 year old cheddar base.

They offer everything from Sauteed mushrooms to Jalapeno Havarti  to thin tomato slices to dill.

A great stop, all custom made with love."}
{"text":"What makes a good grilled cheese?

1) Grilled bread...not burnt, not too soft
2) Hot temperature
3) Cheese melty, stringy, well ratio-ed with the ingredients

These grilled cheese have all that.

We waited a LONG time for our grilled cheeses.  Seating is limited and kind of meh.  Bathrooms was gross.  But I liked it, and I'd go back.  Wish they had more drink selections, they were way overpriced ($1.50 for a can of Coke!) as well."}
{"text":"Went here a couple years ago on the recommendation of a friend, and I really didn't understand the hype. The place wasn't that remarkable in anyway. Seemed overprice for what I received, and left feeling I could've made my sandwich at home."}
{"text":"Small homestyle location with about 4 tables in-door and 2 out-door. Price ranges from $8-12 dollars/sandwich. Awesome selection, a few vegetarian options, some carnivorous options, and even a sweet and savoury with apple and bacon in the mix. The ingredients taste fresh, and the portions are done right. Definitely won't be disappointed as it is not your typical grilled cheese."}
{"text":"Cute little rustic Grilled Cheese cafe with awesome grilled cheese at a reasonable price. 
I got the Mushroom Madness and added bacon which was huge and melty-amazing.
I really wanted Tomato soup with it, but the soup of the day was potato leek. There should Always be tomato soup to go with grilled cheese,  people! it's a MUST! 
you can have other soups there as a special for the day...but tomato soup is a staple choice...just like any other Grilled Cheese on your daily menu! besides the potato leek was too 'rich' for the grilled cheese. the tomato soup would have been acidic enough to cut through the rich cheese

And...the potato leek soup was not very good; too thin and not flavorful. Minus 1 star for that

Otherwise, a fulfilling and awesome meal on a snowy Sunday"}
{"text":"if you like grilled cheese u have to try this place, as simple as that.  It's super casual and you order and pay at the counter first.  All sandwiches come with a side of regular (ruffles?) chips.  

I've had the mushroom one with cheddar, grilled portabello and garlic. and also had the grilled works with provolone, swiss, monterey jack, red peppers and portabello. 
both were AMAZING cheesy goodness. I def would want to go back and try out some other ones.  make sure you have napkins because it will get messy!"}
{"text":"Complaints from employees the owner isn't paying them. http://www.thestar.com/news/gta/2015/06/29/toronto-workers-in-war-over-unpaid-wages-with-grilled-cheese-restaurant-owner.html"}
{"text":"I have confirmation that it is reopening in 2 weeks with a new owner! Mark who was the executive chef at Greenwood Smokehouse BBQ is taking it over. I saw him there today! So excited!"}
{"text":"it was from the Food Network show You Gotta Eat here that my bf, his bro and i ended up here on a whim one day in the summer. they only take cash, but they have an ATM near the bathrooms in case you don't have any with you when you go. 

suffice to say you do wait quite a while for the food, but IT'S WORTH THE WAIT!! everything is made fresh to order (often made with ingredients bought right inside Kensington Market), accompanied by some chips and 2 cornichons (those are mini pickles). my personal favourite is the Grilled Motzy, with the sundried tomato pesto, mozzarella, and arugula lightly dressed with balsamic reduction. most who know me are aware i'm not a super huge fan of the acidity in balsamic, but the reduction was light, a bit tart and just flat out DELISH! 

once you've been here, you will NEVER look at a grilled cheese the same way again..and seriously: YOU GOTTA EAT HERE!! 

the prices do seem a tad outrageous, but personally, i'll pay a bit extra for food made with fresh ingredients that are often bought within the Kensington neighbourhood."}
{"text":"Excellent grilled cheese sandwiches. Went over here with the girlfriend and our dog and we were very glad to see that they had some outdoor seating that was under the shade (it was a really hot and humid day). When we first got there, the staff was not all that friendly. I was greeted by all three employees either crunching numbers, staring into the wall or texting/playing with his phone. Great... I had to initiate and ask if I could order. The worst ended here though, they brought the food to us very quickly and were friendly from there on. The food was great; we got the classic grilled cheese and the mega mushroom I think it was called. Both were great. The cheese was melt in your mouth cheese and the bread was fantastic. Best grilled cheese I have ever had."}
{"text":"I've had the Mushroom Madness grilled cheese both times I've visited The Grilled Cheese. And man it's good.

I love this place for a quick lunch and it can accommodate both groups and single diners - lots of seating.

I do wish that they served something different then just plain chips with the sandwich. But it's definitely not an issue big enough to keep me away! 

Cash only."}
{"text":"Like what a customer from Ireland said before she left: \"one of the best grilled cheese i've ever had.\" 
Before heading inside, my friends and I were unsure whether it was open or closed. This place is located more on the edge of Kensington. The atmosphere was very homey and suited what they were serving (I always found grilled cheese to be a reminder of my childhood). Wooden benches, chairs, fire place, chalkboard...
The worker was very friendly and efficient. Surprised she was able to serve 3 grilled cheeses 10 minutes after we ordered although there was a line-up. Each basket came with a side of regular chips and a pickle. Once you finished your meal, there was a larger woven basket for the basket you ate from and a garbage can - very efficient. 
The grilled cheese itself: gooey, crispy, filling. My friends and I ordered the black jack, hamlet, and pizza grill.
Out of the three, we agreed that the pizza grill was probably the best of the three as it had a lot of complimenting ingredients (explaining it's higher price). Only downside was that you don't really taste the pizza sauce but I don't really mind as I'm not sure if I would've been a fan of it. The black jack wasn't as hot as the other two and the hamlet was just your ordinary ham and cheese. 
Only use the washroom if it's a MUST (space is tight and the stairs leading to it as well)."}
{"text":"I have to agree that this grilled cheese is something i can make at home, but aren't they all? Granted, I haven't tried the 5 star grilled cheese places recommended by Kat F., but this one was pretty good. 

I got the Mushroom Madness (portabello, garlic, cheese $6 + $2 to add turkey). It also came with chips and a big pickle (which sogged up my chips). I took it home to eat, so I can watch Glee (i don't understand why it looks like they are lip syncing). 
Unfortunately, when I opened it up it was soggy.

The sammich was good, but I felt like there was a lot of butter on it. 

the place itself is cute. Like a small cottage with warm wood everywhere. I'd come back one day if I wa sin the area, and grab some dessert at Wanda's"}
{"text":"Grilled cheese at its finest. I honestly never had such amazing grilled cheese sandwiches in my life. I never knew these simple sandwiches could be so diverse. I give it  5 stars because we don't have cozy spots serving such simple comfort food in Montreal. (except hot dogs or fries...but never grilled cheese!) 

I ordered a dill-licious which was dill, cheese, pesto, and sun-dried tomatoes. YUM-MY. My friend had a blackjack which was havarti, spinach, tomatoes, and olive pesto. I didn't try but it looked good and yes, it actually was according to my friend. These sandwiches come with potato chips (nothing special) or a salad, Highlight was sandwiches of course. Service was decent. I recommend checking out this place if you are looking for a cheap, delicious eat in the Kensington market area. 

5 stars. Well deserved."}
{"text":"We stumbled upon this lil grilled cheese shack a few months ago when we were wandering through Kensington Market, just behind Chinatown in Toronto.  They have as many options of grilled cheese as you could ever possibly dream up.  It's a pretty simple operation...picnic tables out front, big front doors with an open air dining room and a grill off to the right, a few drink coolers, and a chalkboard menu.  
My favorite part is that they have a hand written sign saying they deliver to the bar across the street.  Happy hour was in full swing, and we could see people munching grilled cheese :)
We ate at the picnic table outside.  I can't remember the name of what I had but it was a daily special with some sort of combination of bacon and apple.  The hubs got the Black Jack.  We were extremely pleased...bellies full, we continued on our way."}
{"text":"Grab a pint across the street at ronnies while you wait for them to bring your grilled cheese.
Bite down and enjoy the ambiance of Kensington.
This is arguably the best grilled cheese in town at least in our vicinity.
Honest portions and prices and well worth the trip.
If you're in to grilled cheese grab the pesto tomato and the one with Apple... Trust me.
A+"}
{"text":"I decided to take my kids here during March Break.  The décor is homey but a little grubby (even by Kensington standards) and the person who took our order wasn't terribly friendly.  We arrived just before noon, my youngest daughter is a fussy eater so I was happy to see that you could order plain grilled cheese for $5.  My older daughter and I both had the apple crisp sandwich.  There was only one person working when we arrived and another staff person arrived at noon.  Since there were two tables that ordered right before we arrived and there was only one person on staff - we waited over 20 minutes for our food.  Anyone with young kids knows that this is pushing the limits for sitting and waiting.  The food was pretty good but nothing to write home about so I don't think I would return in a hurry."}
{"text":"Yesterday my heart was broken. I had such high hopes for a gourmet grilled cheese house and what did The Grilled Cheese do? Ripped my heart out, sprinkled Lays rippled potato chips on it and left it to go hungry in the hot humid sun. 

Ok a bit dramatic but common! We aren't dealing with a complex dish here. If you are going to specialize on one dish, and such a simple dish, it better be good!

Upon arrival things seem good...almost too good! You walk into this kitschy little shed which would lead you to believe that this is the perfect place to eat a grilled cheese...but then you order your sandwich and wait for 20 minutes while the people who came ten minutes after you get served first and then the cashier asks us \"oh what did you order again?\" all to receive a mediocre grilled cheese (mediocre still even after I paid the $2 extra to add portobello), a handful of Lay's rippled chips, and one lonely pickle. 

The pickles are another thing...they have a wall lined with home-canned pickled veges so one would assume there would be some good pickling action going on in this shed! Do not assume this friends, or you too will be heart broken like me. The pickle was  also mediocre - weak and bland. 

So in conclusion stay at home, save the $25 that you would spend here and make you and your mate your own gourmet grilled cheese. The dollars will go farther and you will surely impress yourself more than The Grilled Cheese would."}
{"text":"This place is adorable, with its shared picnic tables and wood burning stove.  It's small, so be prepared to cuddle up with some strangers as you eat your melty sandwich.  

I ordered the grilled cheese with apples and bacon.  I was mildly disappointed that it wasn't love at first bite.  The sandwich was cooked well, but somehow it was boring.  I went back to the counter when I saw a man eating tomato soup, but that too wasn't very flavourful.  

I would go back, but I have reset my hopes and dreams."}
{"text":"Truly delicious food!
Extremely long wait, but it was well worth it!"}
{"text":"Over rated. The grilled cheese was OK but the price is too high, the wait is too long, chips are stale and taste cheap and the pickle sucked. Had to rate so low to bring the overall rating down."}
{"text":"So if you like grilled cheese you will not be disappointed with the food...it's great! White bread, lots of butter on both sides, real cheese and all kinds of other toppings....

What's not to like, practically $10 for a grilled cheese! I'll come here again and enjoy the food, but I can't get over the price! At least it comes with a tasty homemade dill pickle..."}
{"text":"Yes, u could make a grilled cheese at home, but if u were to have someone make it for you it should be the Grilled Cheese. 

Quality ingredients, well prepared. I had the Hamlet with the addition of olive pesto. Ham, tomato, cheddar, swiss, and red onion. Well i think red onion, i remember seeing it on the menu but i don't remember eating it. 

We went on a Tuesday night so it wasn't too busy, not sure what it's like on the weekends. 

I like that each ingredient added their own distinctive flavour, as quality ingredients do. And I would add the black olive pesto to just about any grilled cheese on the menu, it was amazing. 

We had the soup & grilled cheese combo with the soup of the day, tomato soup for a total of just under $13 including taxes. Simple classic but perfectly prepared. A great addition for a few extra bucks Probably the best tomato soup I've had outside my kitchen. :) 

If your idea of grilled cheese is kraft singles and wonder bread with a can of soup, head out to the grilled cheese and enjoy a classic the way it should be. Perhaps it'll inspire you to do more. And if you already make a mean grilled cheese at home, take comfort in knowing there's a place out there that makes it with the same care and quality as you would at home should u ever find yourself looking for a comforting classic without having to go into the kitchen head out to the grilled cheese.n"}
{"text":"They do one thing and they do it well. Came here and had a blackjack (comes with pesto and jalapeno havarti) and tomato soup and enjoyed it. With so many restaurants in Kensington, it helps to have a nice reliable place to go for a North American classic. Would recommend if you're in the area."}
{"text":"The grilled cheese is great but the owner was fairly rude. He reprimanded rudely an employee who was just trying to eat because she hadn't eaten yet! It was a huge turn off. Great food bad service and even to customers the guy doesn't crack a smile! Unfortunate because it's a cool spot."}
{"text":"Tried black jack. It was pretty good. But they take long tome to make grilled cheese lol"}
{"text":"As a lover of grilled cheese sandwiches and cheese anything I had to check it out. It had a great feeling about the place,  nothing special inside but just a great atmosphere. Felt like I was back in college,  funny though I never went to college.  I think they had about 10 choices of sandwiches and the place was busy but worth a trip back"}
{"text":"Best GC I've ever had. I have a list of 10 grilled cheese places that I want to go to in Toronto but I never actually make it to them because I end up here all the time.... NOT COMPLAINING.

I love Kensington. Most of the restaurants I've been to there are great - this one is no exception. It's hidden right around the corner at Augusta and Nassau (my favorite street :)) and it's a little bit hard to find...they used to have a really small crappy sign and didn't look very inviting but since they they made it a touch easier to spot. When you see Tasty Corner - TUUUURN on Nassau and you will see the big delicious, cheesy-looking sign.

It's small inside, they have bench-like sitting. We were there during lunch time and there were a bunch of nurses/doctors gathered there, surrounded with delicious GCs. Aside from that, wasn't too busy. The doors were wide open so we could watch traffic and get a wiff of that yummy Kensington CO2.

I ordered the beast (obvioussssllllyyy) with jalapeno havarti, cheddar, spinach, bacon and turkey. It tasted...as if a piggie and a baby turkey in matching tutus were having their first adorable recital in my mouth. Yeah. THAT GOOD. Writing this is making me salivate profusely at work :( With chips and a pickle (i think they all come like that) it came to $10.

My friend ordered the Dill-licious with dill havarti, basil pesto, sun-dried tomatoes and sauteed onions. SOOOOOOOHHHHH delish, but not meaty enough for me. The pesto really gave it that herb-ey/Italian taste. With chips and pickle, the GC was $6.

The staff were nice and quick, we ordered and sat down - they brought the order to us. I really want to go back - someone pllsssss come with me!!!"}
{"text":"Very friendly staff/owner.  He was very accommodating as my wife is vegan and made a grilled vegetable sandwich for her, while I had the pizza grilled cheese.

The sandwich was great, and I loved the atmosphere of the restaurant.  I'm from down south and so I really felt at home with the wood/ and bench seating.

Having said that, I did walk away still feeling very hungry after the sandwich chips and pickle.  Worth what you pay, but not very big portions.  I'd definitely go again, but next time I think I'll get two sandwiches instead of just the one. ;)"}
{"text":"OMG.  I finally came here after years of shopping in Kensington Market. If it wouldn't have been for You Gotta Eat Here, I never would have thought of eating there.  

I found the grilled cheese sandwiches on the menu a bit overwhelming! There is a good variety! I selected the simple grilled cheese sandwich and the tomato soup. I've never had tomato soup. And now, I have been ruined! I don't think any other will compare! It had a spice element and a thick consistency which I loved!  And the sandwich came with rippled potato chips and pickle. The sandwich was THICK. It was delicious.

It's cash service, you order at the front, you take a seat and wait. It's a great place!"}
{"text":"When I used to go to Western, I always used to order the grilled cheese.  I know... it's simple, but I always got it with bacon inside.  For the longest time I wondered why no one had made this a standard item on the menu.  Come on... bacon makes everything taste better!

The grilled cheese is devoted to taking the grilled cheese sandwich to the next level.  I guess the first thing you'll wonder is \"what is the next level?  I mean it's a grilled cheese sandwich.\".  Well, it's not as simple as changing the cheese and the bread.  We're talking exotic mushrooms, different greens, meats and cheeses.

Tucked away in Kensington market, you'd notice a small little place with well... a lot of wood.  You may think that description is kinda weird, but when you walk into the place you'll get exactly what I mean.  I mean, this place has more wood than a... wood store?  Anyways, it's got a real country cooking kinda feel to it with benches and wood tables everywhere.  Sitting on top of a quant kitchen is the menu, which looks like it changes every once and a while (it's in chalk).

At first it really takes a while to pick out which grilled cheese fits your fancy.  I mean, how do you choose?  There's everything from basic to \"the monster\" which basically is filled with everything they have.  I got \"the monster\" because I really wanted bacon in mine and well... everything else as well.

The sandwich came with a side of chips as well as a large pickle wedge.  Personally I would have liked fries instead of chips... but whatever.  The sandwich itself was kinda meh...  I agree that it is really different and I like where they are going with it, but I don't think they really got the mixes very well.  I found \"the monster\" really salty and had a hard time picking everything apart.  It kinda just tasted like salty bacon and ham with a side of cheese; everything else was lost.  The chips were alright... but it's not quite pleasant when your chips have oil all over them because your sandwich was leaking all over them.  Maybe the side of chips should actually be \"on the side\".

Overall, I think this place has a lot of potential and I see it being a lot better int he future.  Right now to me it's kinda like your one time wonder of a restaurant."}
{"text":"I've wanted to try this place for awhile and finally did with some friends this weekend.  There weren't many places to sit, but by the time we got our food some chairs had cleared up.  

There were a number of sandwiches I wanted to try.  For instance, the beast, the original, the apple crisp and the dillicious.  I settled on the dill-icious as I've been going on a dill kick lately.  I added cheddar cheese to it.  It was packed full of flavour with the cheddar, dill havarti (have never heard of that before!), pesto and sun-dried tomatoes.  It was indeed delicious!!  

All of the sandwiches come with a side of chips and a dill pickle.  For the price you pay, it's not that a ton of food, but you're also paying for fresh, homemade ingredients, and interesting sandwiches, so I don't mind.

The only real complaint that I have was that the wait was incredibly long.  For a fast food place, we waited probably 20+ minutes for our food and I was starving! 

I will be coming back to try some of the other sandwiches soon!"}
{"text":"What is with the hype about this place?  Honestly, I tried it and it was lackluster.  I'm no chef by any means but  if I buy something at a restaurant that tastes like I could make it then you know something is wrong.  Cheese wasn't as generous as I was led to believe, bread wasn't anything fancy either it looked like dempsters bread.

With three sandwiches it was more than $24 which wouldn't be bad if it was filling but it wasn't.  

Oh yeah, whoever said that if you \"politely ask for more chips\" you get them was totally wrong.  Our order came with a couple of sparsely chips and when I nicely asked for a few more I was told \"that's all you get\" kind of attitude.  

Friendly staff?  Nope, missed that one again.  We had never been and when I explained that, the people working there were too busy stomping on the floor to get someone to help them (hint it wasn't busy, the person just wanted a break to be relieved).

Fool me once shame on you, fool me twice and shame on me.  Won't see me paying to come here."}
{"text":"Cash only and she wouldn't take our order until we went to the ATM which was annoying because we waited in line. Why not take order, then we can grab cash while you're making the sandwiches? Instead we just left and got a bagel next door.  
Not saying the food isn't good but that's just dumb management."}
{"text":"I came here for lunch on a Monday. Due to a \"busy weekend\" they had no avocado and no bacon for their most popular sandwich.

No worries, I substituted turkey for the bacon and waited.

And waited and waited. It took a half an hour to get two grilled cheese sandwiches (the place wasn't half-full).

The sandwiches were good, but the cheese was rather thin and definitely did not completely cover the inside of the sandwich. They do offer about 8-10 creative takes on a grilled cheese sandwich.

The restaurant itself seemed to need a bit of cleaning. The space looked more tired than anything else, though I have to give them credit for having something many places in Kensington Market don't have: seats.

With so many other $10 options in Kensington Market, I would say try this if you like grilled cheese (ok, really like grilled cheese), but don't go too far out of your way otherwise."}
{"text":"I never discovered the greatness of grilled cheese until a few years ago, mainly because, I didn't really cheese before.  WHAT WAS MY LIFE BEFORE THIS?

Located on the side street at Nassau, The Grilled Cheese is a little adorable place with a garage door, wooden chairs and seats, and adorable pickled jars on the side.

My friend ended up at Grilled Cheese on a lovely Sunday afternoon around 1-2 PM.  There wasn't much of a line-up (yet), however, the line-up started to build after we sat down.  My friend and I decided to get THE BEAST: Jalepeno Havarti, cheddar, bacon, turkey, onion, tomato, and spinach.  My friend and I shared this (before we headed to our next food adventure in Kensington).  It was absolutely delicious (in the first few bites), but for some strange reason, it got a bit too salty for my liking near the end.  Don't' know why.  However! I plan to go again just to try the more \"plain\" ones - hopefully, not too salty."}
{"text":"Just had a completely \"meh\" experience at The Grilled Cheese. We ordered the blackjack and the beast. The \"jalapeno havarti\" was essentially flavorless, although the spinach and tomatoes seemed fresh. The beast was also a disappointment, not much flavor here either. Say Cheese on Bloor is a better bet imo."}
{"text":"The grilled cheese here is amazing! Haha that must be why they named the restaurant 'the grilled cheese.' It all makes sense now!
I tried this place for the first time last year and it knocked my socks off. Delicious melt-in-your-mouth sandwich, and the homemade tomato soup just upped the amazing factor about 10 notches. Also comes with a side of chips and a pickle. 

Now, why would an ah-ma-zing place only get 3 stars? Well, I came back today and had the grill worx - swiss, provolone, roasted red peppers, mushrooms, red onions, and spinach all in a delicious grilled sandwich. Asked about the soup, and unfortunately they don't serve it in the summer or something is what I understood from the employee. How unfortunate. The sandwich was still good, but it was missing its greatness factor. 

My suggestion is to go during the winter when they'll hopefully have their soup. Also go during non-conventional meal times, as the wait can be cumbersome, even when the restaurant doesn't seem too busy."}
{"text":"Love this place! It's a hidden gem in the Kensington Market."}
{"text":"Mediocre at best, which sucks because I really wanted to like this place and based on the other reviews thought it was going to be a hit. I had the Apple Crisp and opted for both avocado and bacon. Bacon was hard and not fresh and apples were sour. The rest of the sandwich was kind of bland. For their \"most popular\" i didnt really see why. I get that it's a grilled cheese sandwich but I expected it be more than something I could make myself. The tomato soup was nice, and definitely not something I could make. That pretty much saved the meal for me. Sorry guys, I won't be a repeat customer."}
{"text":"Slow service and was turned off by unhygienic environment. Tables, floors, seats were all sticky and when you wipe it with a napkin it was black. I waited 30mins for one sandwich and server actually offered someone else's order by mistake a minute after I paid, which made no sense. No gloves or utensils are used at this place and it was disturbing to see cashier handle money (cash only) and then use her bare hands to grab Ruffles chips and sandwiches onto everyone's plates and proceeding to wipe them on a dirty wet rag. The sandwich itself was ok, but don't think it was worth the experience and the $9. Won't be coming back here."}
{"text":"I'm an addict of sandwiches and when it comes to grilled cheese, I just fall in love because I love cheese. For around or under $10, you can get a grilled cheese sandwich and chips and be full. Is it the healthiest meal you can have? No. Is it one of the most satisfying meal you can have? Yes!"}
{"text":"Good but not great. Like others, I think maybe my expectations were too high. Having eaten at a few awesome grilled cheese spots in Vancouver, it was definitely not the best grilled cheese I have ever had - but was good. I ordered the Hamlet, which was pretty ordinary ham and cheese w/ onions and tomatoes, so maybe it was my ordering that was the problem. The avocado / apple one looks interesting, maybe I will try that next time. 

I also ordered a cream of broccoli soup on the side... It was not good. Very watery and had no flavour. Like boiled broccoli in water. 

The atmosphere and restaurant decor is awesome... 5 stars for that! Also, it is in a really cool location. Overall, I would recommend you give it a shot but be a bit daring in your order and steer clear of the soups."}
{"text":"The sandwiches are pretty unique and amazingly good. I got to try Lanois and Apple crisp and both didnt disappoint me except for the chips. An actual chips from a bag. Hmmm."}
{"text":"Whenever I'm in Kensington, you can bet this is where I'm getting lunch.
Great prices and really great sandwiches, but the portions aren't massive. The pickles add the perfect touch but they'll make your chips soggy if you're not careful.
Love the atmosphere here.. lots of wood and bottles of preserves and a wood stove in the corner!"}
{"text":"Good food is heard to forget. I'm 99% sure when I had the Mushroom filled grilled cheese sandwich that I had tasted the pinnacle of grilled cheese. Life won't get better than that.

Other grilled cheese sandwiches are crap compared to what is offered at The Grilled Cheese. I honestly would be more eloquent about this review....but I guess that speaks to how good the food is there. It's so good that I can't even bother to put the words together correctly to describe how good it is there.

If you don't show up there one day, you're missing out."}
{"text":"Stumbled upon this little gem during an overnight trip to Toronto. From the Classic to the Grilled Monty its one of the best grilled cheese sandwiches I've ever had. The ingredients are beyond fresh. We saw the  farmer walk in to deliver the home grown mushrooms and arugula while we were there. I'm all about fresh and it doesn't get any better than watching it be delivered. 
Cozy little spot to meet up with friends or a date. Definitely not suitable for larger groups. 
All in all, it was delicious. I will definitely be back the next time I'm in town. Yum!"}
{"text":"3.5 stars.  The grilled cheeses are delicious, and they have a good variety of cheese/topping combinations.  My friend and I shared the beast.  It would have been better if they patted the tomatoes with a paper towel or included less of the pulpy part inside, as it left the sandwich soggy.  They also only had one can of Diet Coke, which is something I could overlook, but it also shouldn't be happening by noon.  I agree with some of the previous commenters that it is maybe a bit pricey, considering that all you get on the side is 10 potato chips that are somehow all crunched up into little pieces. 

The big problem with this restaurant is the system by which orders are completed.  Basically, the cashier/waiter writes down your order on a ticket for the cook, the cook makes it, and then the cashier/waiter distributes the sandwiches.  This involves him wandering around asking people \"did you order the Beast?\".  All the while people are lining up waiting to make their orders.  They should write the name of the customer on the ticket and then, when the order is ready, they could just yell out the customer's name, and they could continue to take orders."}
{"text":"I really wanted to be blown away by this place and it WAS good, but it wasn't the best grilled cheese EVER good. Perhaps my expectations were high, seeing as this place has been featured on shows and is number one for grilled cheese on BlogTO. 

I had the Grilled Motzy and my husband had the Black Jack. We also had soup, which was tomato and pretty basic. 

Both of our sandwiches were good. I'd say my husband's was a little more sophisticated in taste. Mine felt like the pesto really overwhelmed any other flavours. It wasn't unpleasant, but I WAS wanting a grilled cheese. 

The sandwiches are served in baskets, with some ripple chips and a slice of pickle...really good pickles actually. Chips are just chips. If these guys want to take things up a notch they should charge a dollar or two extra and consider creating a more interesting/homemade side dish. What??! I don't know, I haven't thought that far ahead. People will pay extra for good and creative side dishes that really add to meals though, right??

Oh and in response to people who were commenting that the sandwiches are really greasy, I didn;t find that at all! There was no grease gathering at the bottom of the paper in the basket and my fingers stayed relatively clean! Maybe they changed?? Or maybe some people are nuts...I mean it IS grilled cheese, it's not ....umm.....lettuce. 

I wasn't willing to leave without trying ONE last item...but we were full. I ordered a sandwich that's name I don't remember, but it was basically cheese, bacon and mushrooms. The to go sandwiches are in plastic boxes with lids. Great if you want to bring it to work the next day, or something.

In our case I split the sandwich in half and served it with my own soup the next day for dinner. This was definitely more of a traditional grilled cheese, but again, I found the bacon to be a little overpowering. Still good...my soup was heads and tails better though. 

Not sure I would bother with the soup here again. I liked everything I had, but nothing compared with the lobster grilled cheese I had the Joey's. The flavours were perfect in that sandwich!

THere are a lot of other options to try and everything was very good. I think that if you're in the area and want a sandwich that costs the same as Subway, but is more creative and more delicious, this is a great choice! 

Oh....they only take cash BTW! Make sure you come prepared."}
{"text":"Solid grilled cheese sandwich! I got the mushroom one and it was cheesy and delicious. It's reasonably priced at $6-10 per sandwich (comes with a pickle and chips)

I quite like the environment and decor as well (it is after all in Kensington Market). I would come back again to try out the other menu items (that smoked apple bacon grilled cheese sounds heavenly)"}
{"text":"Super yummy and very nice staff.  I had the grilled cheese with mushrooms and my partner had the grilled cheese apple, Carmelized onions and avocado.  Both sandwhiches were fresh and absolutely delicious.  I definitely recommend this place."}
{"text":"I went there once. Nothing noteworthy about the food, basically what you'd expect from a place that only has grilled cheese. They played sabbath which was cool, but apparently the owner doesn't pay his staff, which isn't that cool."}
{"text":"SO TASTY! I had the Apple Crisp with Bacon. OMGYUM. 

but please get a better system of letting people know when their order is ready. If you offer outdoor seating, you should probably walk outside and announce when an order is ready.....duh. don't just stand inside and look perplexed when no one hears you shouting. ugh. 

Anyway, would recommend. I will be back to try every other grilled cheese on the menu at this super hip place in this super hip neighborhood. 

Later, Toronto."}
{"text":"I went there a while ago and was super hungry after a blood exam. My mom and I went there to refuel and were disappointed. I had the melty mushroom sandwich and was surprised to taste that the cheddar cheese was the same colour and consistency of Kraft singles. If I hadn't watched her make the sandwich, I would have guessed it was processed cheese. I was also disappointed to see that their side of chips also came out of a bag. A bag of regular Ruffle chips...how lame! It would have been nice if they could make their own chips; vegetable chips would be a nice touch too. And with all the pickled veggies on the wall, you'd think they'd serve those up too but I just got a regular pickle. Even if the prices were raised a few bucks, I think these improvements would make it an exceptional sandwich spot!"}
{"text":"Definitely enjoyed my experience. Ordered the apple crisp $8 and make sure to add bacon! Grilled motsy $8 with the arugula was delicious. Blackjack was decent, didn't have much taste to it $6. 

Boyfriend thought the ingredients tasted bland and didn't have enough flavor even though the ingredients should've been on point. I however thought it was delicious. Just order the apple crisp! 

Service is fast! Couple of tables to sit and they've got a fireplace to warm up in the winter."}
{"text":"The kind of grilled cheese I always dream of making at home, but never actually succeed in doing... fortunately The Grilled Cheese is never far! 

By far my favorites are \"Pizza\" and \"The Works\" which are also the biggest (and most expensive), but hey, that's how I roll. I also love the sides of potato chips and a pickle! 

It's a great atmosphere and fits perfectly into Kensington (which can sometime mean terrible service, but not here!), and is a great place to bring a group for a late lunch (less busy). 

Also if you're lucky a former Degrassi star might make your sandwich for you. Happened to me!"}
{"text":"Needs to pay his employees.

I believe since the bad press, the owner has closed down. Doing cash only at some point, makes me believe that he was trying to avoid paying taxes. But no way in knowing for sure until the owner decides to reappear, pay his employees money owed, and then address the media."}
{"text":"I think grilled cheese is the new mac n' cheese. In the last few years, it's become trendy to take classic American/Canadian comfort food and put a gourmet twist on it. Last year and the year before it was mac n' cheese, now it's grilled cheese.

I happen to like storefront as it's cute and cozy. It used to be my favorite Belgian waffle place. I was sad when it closed down (not surprising really since it was rarely open in the first place) and now this sandwich shop took over.

They did a lovely job of renovating the space. I love the cozy bench seating in the back and the rows and rows of jars of pickled vegetables that decorate the walls. They also have patio seating in the front.

I ordered the Grilled Motzy, which was mozzarella, pesto, sun dried tomatoes, and arugula. The white sandwich bread was toasted nice and crispy and the mozzarella was perfectly melted and gooey. The fresh arugula prevented the sandwich from being a total greasy, fatty mess. I really like having the fresh bitter taste of the arugula as a contrast to the rest of the sandwich. The pesto and sun dried tomato relish could have used more salt as I thought the sandwich was a tad bland. I really needed the side of potato chips and the sour dill pickle to add a little more salt to the sandwich. 

I showed up just before noon and the place was dead. Ten min after noon, suddenly the place filled up.

You order your sandwich, the person behind the counter fills the order and calls out your number. You pay after you eat. I think this whole process is inefficient as it means that the worker has to deal with order and customer twice. Once to take the order and then to pay. I recommend that you take the payment when you take the order. This way the customer doesn't have to stand in line again to pay up."}
{"text":"Tried this place for the first time today and it was pretty damn delicious.

They have a ton of different grilled cheese sandwiches and it was a hard time choosing one.  I ended up going for the BlackJack.  The service was a bit slow considering its only a grilled cheese sandwich, but then I realized they really do grill it to perfection so the wait was worth it.  The sandwich was very filling and stuffed well with the cheese, black olive pesto, spinach and tomatos! IT was delicious!!!  The sandwich comes with chips and a pickle as well.

I will try some of the other sandwiches in the future.  Make sure to try the BlackJack and dip it in the hot sauce!! YUM."}
{"text":"I was so looking forward to a mouth watering grilled cheese delite and with all the reviews, my expectations of a out of body intervention was highly expected and with all the reviews  it was 100% in the bag..... but my taste bud was telling  me some thing completely different, the 3 cardboard sandwhich lacked the excitement of taste and the adventure I was informed off, i could compare the taste to when you get kicked in the balls, Maybe it was just that I caught them at the end of day... maybe Ill try another time when they find havent misplaced there passion for food. 
Ps the pickle was good and saved your work."}
{"text":"Walking by, I spotted this cute spot and the whole package screamed out \"delicious\". I was on a budget, but wanted to try the Grilled Cheese. I got the plain grilled cheese and it was pretty good. Pickle, great. And some plain potato chips on the side. I got it to go, which probably ruined it a tiny bit. Next time I'm going to eat in and get something fancy.
I give good rating for service and decor, but not a top rating because the grilled cheese was just OK."}
{"text":"I would give this place a 3.5 out of 5. No doubt, delicious grilled cheese sandwiches. Decently priced. 

My husband and I went to each lunch here on a Friday afternoon. Big mistake. It was not worth the hour drive just to have a grilled cheese that took half an hour to make. I wouldn't normally mind the wait much, but we were told there was no Havarti, no ham, no bacon, and at least one if not two other ingredients (I lost track). Well there goes half the menu. I don't expect a fancy restaurant, and I get that it is in Toronto, so it WILL be busy. But there are other places that are just as busy, if not more, and they actually know how to run a business (Banh Mi Boys for example). 

With all that said, I do still think it is delicious food. If I was in the area and needed a bite, I would definitely come here. I just don't think I would purposely drive downtown just to eat there."}
{"text":"So good. A really wicked little spot in Kensington for some perfect comfort food. Highly recommended for anyone that's in the area."}
{"text":"Boycott this place for mistreating employees like that! What sick and twisted person would not pay their employees. Hope this place closes."}
{"text":"This is my favourite spot for grilled cheesers.  There are so many combinations of cheeses and they make them right in front of you.  Be creative and mix and match.  Loved the generous serving of potato chips as well.  

This place is not fancy but it is hipster.  Shared picnic tables in summer, inside the walls are covered with shelves of pickles and preserves.  Go feed your hipster in Kensington and treat your inner child to a Grilled Cheese."}
{"text":"A place that exists solely to stuff my maw with melted cheese on bread starts out as a five star enterprise with me, no sweat. Sadly my introduction to The Grilled Cheese today was underwhelming. The cashier proudly asserted that today was her first day, which somehow translated into \"...which gives me licence to bung up your order and you not give me shit for it.\" Huh. 

I ordered \"The Classic\" (three types of cheese + tomato - $6) and the soup of the day (herbed tomato). I got the soup right away and my lunch date got her sandwich a minute later. Fifteen minutes went by and I still didn't have my sandwich. I kept looking over to see what was going on behind the counter and then realized they'd forgotten the rest of my order. Then the server came up to our table and said, \"Oh, did you also order a water?\" Um, no. But I did order a grilled cheese...you know, those things that you specialize in here?!

Five minutes later my sandwich was delivered, sans apology for the wait, but it wasn't on the bread that I'd requested. I was too hungry to ask that it be switched so I ate it angrily, but didn't finish it.

Sandwich was good but something I could easily replicate at home (minus the grill marks). It was served with some flavourless tortilla chips from a bag and a pickle that wasn't nearly sour enough. The soup, however, was better than the grilled cheese. I'll stick to buying my cheese at Leslieville Cheese Market & Cheese Magic and making \"gourmet\" sandwiches chez moi, without the wait."}
{"text":"If I were an urban planner and had the task of inviting people to open businesses in my utopia, I'd for sure send an invite to The Grilled Cheese. I have visions of people parading into my city (which I'd probably call \"Kensington\") and dancing in the streets with the joy of living off of gourmet grilled cheese sandwiches. Imagine how happy everyone would be if they never had to live without gourmet grilled cheese! 

As you might conclude from the name, The Grilled Cheese serves only grilled cheese. They have about a dozen choices to choose from (I was beyond pleased with my selection of mushroom madness, which comprised of fancy cheddar, portobello mushrooms, and roasted garlic and my dining company went with the dill-iscious sandwich, both of which were $6.78 including tax) and on occasion there is a daily special. There are more meaty ones than not but I bet if you asked them to rearrange a sandwich for you, they would. They were super nice.

The place is sleek and very different from the layout of Goed Eten, the former inhabitant of the spot. Inside, TGC has a beautiful! wooden interior, with inviting tables and booths, each one dimly lit with a small candle.

The people running the place were really friendly and the place itself was quiet. I am not quite sure what time of the week would be the busiest at a restaurant that only sells grilled cheese, but around 8 on a Wednesday it was a bit sleepy.

What is particularly brilliant is the location: it's located across the street from Ronnie's, and what better way to end an evening with an amazing grilled cheese sandwich than with a good beer?

Personally speaking, my friend and I opted for milkshakes on Bloor instead because it is no secret that grilled cheese and chocolate milk go hand in hand. I didn't really see a choice of beverages offered at TGC, but if they are looking to add a few items, I would for sure suggest that they serve milkshakes.

Each sandwich is served in a biodegradable container (I have mixed feelings about that) with a Strub's pickle slice and some very average (although unexpected) tortilla chips.

I said it before as I was leaving the restaurant tonight, but I'll say it again: See you soon!"}
{"text":"Nice little business in Kensington Market. The grilled cheese was good, though not by something to write home about. 

The staff was very friendly, the location is cool, the restaurant is comfortable and unique. The food was fresh and I'm told is locally sourced. Sandwiches come with chips and a pickle. 

I ordered the apple, bacon, and cheddar sandwich. It's a nice combination, and if you want something easy and simple and you are already in the neighborhood, this is a good option. 

In the world of gourmet grilled cheese, this restaurant is not notable, but again, it is a solid offering with a nice staff and is convenient if you are in the neighborhood. I wish this restaurant continued success -- solid addition to the local food scene. 

Note that they only take cash, but that there is an ATM in the basement level, next to the restrooms. Weirdly, the restrooms are decorated and finished quite fancy."}
{"text":"The name really does say it all when it comes to this place, the only thing you'll find on the menu is a variety of grilled cheese sandwiches but I guess all that focus on one thing allows them to be pretty good at what they do. All sandwiches are served with chips and a slice of a dill pickle (I wish they gave you the whole pickle) 
I have taken one of their most popular sandwiches and added my own twist to it which in my opinion has made it one of the best grilled cheese sandwiches ever. Order The Beast and switch the cheeses they use for Provolone and swizz and voila the best damn grilled cheese ever."}
{"text":"Love this spot! Yummy Grilled cheeses, staff is nice, great comfy atmosphere."}
