{"text":"The best place to get good seafood in Madison.  The staff here (and their other locations) has always been very friendly and knowledgeable.  We go here for fresh oysters and sushi-grade fish among other things.  They also have a good carry out menu with mostly fried seafood.  Fish fry is good and the fried scallops and other shellfish are cooked perfectly.  Never chewy.
The first time we here was the first time we were making sushi at home and not only did we get great fish, we got a lot of advice about making rolls and a great recipe for a spicy tuna roll.
It is expensive, but its madison and until they start pulling tuna out of lake mendota, it will always cost more."}
{"text":"One of the best seafood markets in Madison, with competitive prices.  The rating is based on available options in the Madison area - this isn't Pike Place or anything.

They have both frozen and fresh seafood with a very nice selection.  They carry the standards, like salmon, various whitefish, shrimp, scallops, live and frozen lobster, crab legs, etc., but also have some of the harder to find items like sashimi grade tuna, opa, blue marlin, skate wing, swordfish, prawns, clams, and oysters.  I think they're the only place in Madison that carries Laughing Bird shrimp.

Now I can't guarantee that they'll have everything listed there when you go, as they do have somewhat of a rotating inventory based on availability and fishing seasons, but I've always been able to special order something if they didn't have it.

Monday through Saturday, they also have carry out, if you're looking for some fried catfish, or shrimp, or cod, or calamari - that kind of thing - check out their website for a menu: http://www.madseafood.com/Carryout.nxg    They also have smoked fish available.  There is no seating, pick up only.

There's other seafood-related sundries there too, like marinades, sauces, breading, spices, and sides if you need ideas on preparing the main dish.

The staff is very knowledgeable, and can help you with recipe, cooking, and pairing questions.  They'll also skin the fish for you too if you ask.

They have an Old Sauk road location (which I think has some tables if you're looking to eat there) and a satellite in the Willy St. Co-op, but I prefer the Whitney Way store - if only for familiarity's sake."}
{"text":"I'm a first timer today... and I'll be back. What sticks out about the place?

The freshness, the very nice employees, the options to buy cooked or raw fish, the deli type of set up with everything you may need to make your fish, the stuffed shrimp, the fries, the calamari ,and the price!

As fresh as the cod was, I must say it was lacking in any flavor besides oil. Everything else had a mild but pleasant flavor... but not the cod. I'm still giving this 5 stars because of the quality of everything else.

I'll be back to try something else because I feel certain that I'd be getting quality and freshness here!"}
{"text":"The quality of the seafood here is great for the midwest (I'm from the east coast, so I am pretty picky about my fish). So that's not the reason they're getting a two-star review from me. 

The two-star review is because I ordered three pounds of shrimp for my annual Christmas party about a week before the party happened. They told me it would be no problem. 

Unfortunately they lost the order. When my husband went to pick it up, it was not ready and he waited over 30 minutes while they scrambled to find three pounds of shrimp.

If you're going to put yourself out there as providing catering platters for parties, then make sure you keep your orders straight. I'm not sure what I'll do next year, but I am definitely soured on the Seafood Center."}
{"text":"This was the best fish fry that I have ever had!!

The cod kept its shape and was nice and moist. 

The cod's breading wasn't to thin or thick and was nice and crunchy.  The tarter sauce had dill relish in it; it is quite possibly the best tarter sauce that I have had.

The Coleslaw= two thumbs up! It was nicely chopped, flavorful and had the right amount of mayo.

I went for the onion rings instead of the fries. They were beer battered and I could taste the beer in them.
All of this for under $8. Awesome!!!"}
{"text":"Hands down, THE best place in Madison for fresh seafood. We had a Super Bowl Sushi Feast a few weeks ago and I made the trek from McFarland specifically for their salmon and ahi. There was no way I was going to trust seafood from any place else for my raw rolls! I was even able to pick up some super yummy tobiko. When we lived on the Westside, I would ride my bike to pick up fresh fish for a weekend meal; they packed with ice to make sure my catch made it home safe. Gotta love the customer service!"}
{"text":"Excellent fresh fried fish, reasonable price, nice folks. I love fried seafood and have eaten it all over the country. For an everyday place in Madison, this is great.  Fish, scallops, and shrimp are excellent, fries too and slaw too (wish there was a bit more slaw). Only thing I had which was not great was clam strips, not because they did them badly but just because they are never that good."}
{"text":"Went for the first time on a Friday night. They were pretty busy the entire time we were there. Staff was very friendly and kept the line moving. Boyfriend and I each ordered a \"Catch of the Day\" with fries. We waited for about 5 minutes after putting in our order, and got a paper bag filled with 10 pieces of assorted fish, a boat of fries, two sauces, and two coleslaws. Everything was delicious, even after spending 20 minutes in the car ride home. Will return sooner than later."}
{"text":"Keeping it simple... i really enjoy the fried cod. The tarter sauce is excellent and it comes with a good helping of fries. You can't go wrong with this place if your craving a crispy fried fish friday (or any other day)."}
{"text":"Delicious  take out seafood at a reasonable price! I ordered the perch dinner, and it came with five pieces of fish, french fries, and coleslaw for $11.99. The batter on the fish was seasoned to perfection, and the french fries were yummy. The coleslaw was also tasty and fresh. The shrimp egg rolls were crispy, and filling for $1.49. Fresh catch of the day was halibut and it was extremely fresh and flaky.
Customer service was top-notch, and there was a large variety of cajun and Asian groceries."}
{"text":"My go to for any seafood cravings!

Lump, jumbo crabcakes? Yup, got those.

Jumbo pieces of Friday Fish Fry? Uh huh.

Delicious, golden-fried, jumbo shrimp dinner with fries, coleslaw, and tartar sauce for only $6.99. YAAS!

Freshly shucked, jumbo scallops? Ayeaye!

See a trending word here ;o) 

Seriously these guys are the best, so friendly, our fish fries are always heaping in portions and piping hot. It doesn't get much fresher or better than this!"}
{"text":"I ordered the fried catfish and shrimp basket. The catfish was not good at all. It was bland and under cooked. Underneath the batter the fish was slimy and wet. Being from Mississippi, catfish is my first choice of fish. The shrimp and fries was good. I will order raw catfish and cook it myself next time."}
{"text":"We ordered smoked whitefish and trout (only a half a pound), pound of shrimp, bread and some spices for Christmas more than a week ago. When taking the order, they said it was no problem and they would have it all ready for us. So yesterday, we went in to grab the order on the way home. As we walked up to the counter, a person right ahead of us grabbed a piece of smoked whitefish from the cooler, checked out and left. We got to the front, told them the name, and they told us not only was the order not ready, they were out of smoked whitefish. Also the shrimp wasn't cooked. We told them it wasn't fair as we ordered a week ago, they NEVER told us our order wasn't guaranteed as the snotty, young blonde hair girl tried to bark at us from across the counter.  They also told us they had already filled 60 orders as the reason they didn't have ours. What?!? Then don't take that many orders if you can't fill them! So we ordered more shrimp because of the lack of items, waited 35 mins for them to cook the shrimp and then had to drive across town to Willy St coop west to get the remaining items (Bob is awesome there!) and ended up spending twice as much time and money. What is the point of ordering ahead if you don't set it aside and sell the items you are short on to walk-ins?!? What a terrible business model- or maybe a great business model since we had to spend more money to compensate after being glared and barked at by terrible staff! So much for customer satisfaction!"}
{"text":"Wanted a real Friday fish fry up! All the Mom n Pop's corner spots close early out here in Wisconsin.. we're talking before 6pm... so turned to YELP to see what the locals recommend and came across this little gem! Warm friendly welcome as you enter the store.. there's a chalkboard with prices and specials as well as cold cases of their fresh seafood catches! You can opt to order your food to take home and prepare it as you may... or you can opt to have the shop prepare your food as well.. considering I am the weary traveler staying in the hotel ..I opted for them to hook it up.. and hook it up is EXACTLY what they did.. even at market value you actually can walk away with a steal of a deal for dinner fare.. soo GLAD we ventured here.. fish fry for two.. crab n cheese stuffed jumbo shrimps and clam chowder if course.. $30.. if you're around the area I too recommend stopping in and checking them out.. promise you won't be disappointed...btw.. they have a lobster tank.. pick away! KUDOS to you guys for our dinner! 
CHEERS!
Keep YELPING!!"}
{"text":"great choices for fish. Madison may not be near the coast, but the Seafood Center offers some great fish."}
{"text":"Mixed experience: great selection of fish and various salads and the like and the whitefish salad was excellent! A bit of a snafu when ordering the shrimp cocktail initially -- but when I finally got it, I was somewhat disappointed -- it was dry, some shrimp had not been fully/properly deveined and the cocktail sauce needed more horseradish for my [moderate] tastes.  The salmon roe was very good while the fried fish was just meh; nothing special for the area in my opinion."}
{"text":"Gave them a 2nd chance, tried the \"sampler\" well, it beat the hell out of the cod sandwich...

My Dad became really sick after eating here based on either food poisoning or some sort of virus from improper hand washing.."}
{"text":"The Seafood Center is the BEST seafood store ever! 
For lunch, the \"Catch of the Day\" is 4 pieces of fish, fries and cole slaw and 
ONLY costs.....$6.49!!!! Their fish is top quality and they have the nicest employees!. 
My husband just said, \"Thanks dear, yummy lunch!\" (and, he is sometimes Mr. Picky Pants). smile emoticon
If you love seafood, check it out. It's our favorite place for seafood!"}
{"text":"I saw this place rated highly on Yelp and had a hankering for some Fish and Chips so I headed on down there.  The place is small but they look to have a lot of great fresh seafood pickings.  My food was ready when I got there.  I wanted lunch and dinner so I got a shrimp fish and chips for lunch and a cod fish and chips for dinner, with a side of pasta salad and some New England clam chowder.  They were out of warm soup but I got the cold and re-heated.

Everything was superb, the shrimp was was large and the fish was very crisp and best of all, not greasy at all.  You'd hardly know it was fried in fact as it wasn't the least bit greasy and therefor didn't taste of grease at all (a common problem I've had at some places where I get fish and chips, greasiness=queasiness).  Fries were simply delicious, I usually throw some away as I'm not real big on french fries but none of these saw the trash can. The pasta salad was amazing and the soup was fantastic as well.  They also had a big basket of lemons of which I bought for desert (I love to eat raw lemons) and they were quite tasty too.

All in all it was about $30 for everything.  Not bad at all considering it was top quality and delicious and I got about 3 1/2 meals out of the whole thing.  A fantastic value.  I don't eat seafood like this alot but I'd eat here a ton if I was a Madison resident.  The only con I can think of is I'd like more of the chips (batter-not fries) like Long John Silvers gives you when you get their cheap fish.  Add that and this place would be absolutely perfect.  

Remember - carryout only!

NOTE: On my pic of the shrimp fish and chips dinner I did eat a piece of the shrimp before I took the pic so take that into consideration as to how much shrimp you actually get with the meal."}
{"text":"This place has been around forever, and its longevity is driven by the fact that they are the best at what they do in the area.   They make a no nonsense high quality meal, but also have great raw materials.   You need green lip mussels from New Zealand, frozen mud bugs, etc. this is the place to go."}
{"text":"Great fried seafood. Friendly service always. Love the tartar sauce. We love to get the calamari and shrimp baskets. The breading is so good and never falls off the seafood. The only thing that I wish was better is the coleslaw... It could be tangier and more flavorful."}
{"text":"The staff here is always so friendly! They have he best seafood in town. The salmon and crab cakes are by far my favorite thing."}
{"text":"Called for carryout and rec'd a quote of 20 mins. Arrived a couple minutes early and paid for my order. Then stood in the store for 20 mins (40 mins since order) waiting for my food. Finally asked someone where my order was; it had been sitting under a heatlamp since before I arrived. I asked \"is this going to still be hot?\" The counter help replied \"yeah it will be fine.\" 

Well it was not fine. Everything in the order was of course stone cold. I immediately called the store and was met with a bunch of lame excuses about how busy they are. Well, you'll be one less customer busy in the future. I will not be coming back."}
{"text":"I didn't think this quality of seafood could be found here. I lived on the east coast and have gotten used to fresh seafood. This establishment did not disappoint.
We ordered a couple of sandwiches and some seafood for later. I ordered a grilled tuna and my wife ordered fried cod. It came on a nice roll and was cooked perfectly. The fish in both cases was allowed to be the star of the sandwich. Meaning it was not loaded down with sauce covering the flavor. We split an order of fries and they were very good as well. Only draw back, there is only one table with four chairs in the place but than it is not a restaurant.
Now, while this is a seafood store it does not have an over powering smell as such. It is clean, the staff was friendly and eager to assist. The seafood items are labeled with type and where it was harvested. It all looked incredible and fresh. We purchased some fresh sea scallops that required nothing more than to be cooked with some salt and pepper. They were sweet and tender and turned out incredible. We also purchased some mahi-mahi, it was very fresh and I would venture a guess that it had not been out of the water for a long time. It smelled very nice both raw and cooked.
This is a place we will be returning to often. The only problem will be what to purchase next time."}
{"text":"I've been here a few times and the food has been wonderful. I've only gotten the deep-fried cod with fries, but it's always delicious with tasty tartar and coleslaw on the side. 

Only thing keeping me from making this a five-star review is that it's served a little cold - could be hotter from the get-go."}
{"text":"We only checked this place out because of the other positive reviews on Yelp, and I'm glad we did...

We had the Cod basket and Shrimp basket, both came with tatar/cocktail sauce, fries and coleslaw.  Each were cooked to order, so there was a small wait but again worth it.

There is no dining-in, but we were happy eating in our car :)

Really reminds me of Hagens Fish market in Chicago (Portage Park)"}
{"text":"First I want to say that I don't give a 5 star review easily. Although we have not eaten at The Seafood Center my husband and I get fresh seafood every time we are in Madison. We have a weekend home in the area and primarily eat seafood. So far we have never been disappointed and our go to's are the shrimp, bay scallops and whatever fresh fish looks amazing (except Salmon ... but that's because I don't eat it). 
Keep up the great job, it is very much appreciated."}
{"text":"I stopped here based upon the good reviews and because a local Madison personality buys all his fish from here.   I was not disappointed.
Really good prices.   The carry out price is a great deal and the food was excellent on our first order.  Deep fried cod of large proportion, tender, moist, excellent breading and good flavor.   The tartar sauce was quite good and so was the coleslaw.   
I also ordered some lobster bisque and one smoked whitefish which I haven't tried yet.
Everyone behind the counter was engaged in helping customers and very nice.
We will be back.
They actually didn't have some fish I was looking for but I might be able to order it so I won't give them a negative for that.  Can I get Chilean Sea Bass or Branzini?  I suspect so.  later folks."}
{"text":"I love this place. First off, I'm a HUGE fan of salmon. Their lox is my main draw. Get the good-lookin' whole filets if you're hosting a spread, but otherwise, the trimmings are just as tasty, and much less moolah.

When I'm in the mood for a fish fry in the summer, I go here for the perch and take it to a nearby park. They'll fry just about anything up for you, and it is TASTY. The frying oil they use is changed often, so you never get that nasty sludgy-ness that can happen elsewhere. They get a perfect score.

This is not a sit-down restaurant. You order and then go your own way. But man, it's one of the best fish fries in Madison, so if you have somewhere to hang out and eat nearby, seriously, give it a try.

Today I stopped in on a whim for some lox and asked if they had roe. OMG THEY HAVE ROE!!  I snagged some of the red flying fish roe so I can top my sushi bowls with it for the week. Adds a whole 'nother level to my lunchtime.

Finally, their sushi-grade selection is fantastic. I trust them infinitely more than most of the other markets in the area. The fish here is always top-notch and fresh."}
{"text":"I've heard about this place for a while and finally my girlfriend and I went there to get some sushi grade fish.  We were both very pleased with the quality of the fish as well and the friendly service we received.  We ended up going back there again and we saw some people ordering fish and chips.  It looked amazing!  We ended up trying it and it was delicious.  A week later we went back again since it was THAT good.  Wonderful little gem!"}
{"text":"Loved this place! Missing good fish and chips since leaving Seattle for the Midwest, and this was a perfect stop. Try the clams!"}
{"text":"Yum!  Our first time here for carryout and it was delicious. This place sells all kinds of seafood- fresh and frozen.  They also sell seafood related condiments.  But their hot foods carryout is super good.  I tried their catch of the day which was four kinds of battered fish, slaw and fries.  Hubby had battered catfish, fries and slaw.  We also tried clam chowder and crab cake.  Clam chowder flavor was spot on.  It wasn't as thick as I usually like it but it was still creamy and flavorful with lots of clam bits.  The crab cake had so much crab that you could pull it apart and crab would fall off.  Staff was super friendly.  No actual dining area- just a table with four stools."}
{"text":"The Seafood Center is one of the best take-out deals in Madison. A great portion of fish and chips for ~$7, friendly staff, and a consistently near-perfect cook of the fish (fried) makes this place my new go-to for a fish fry. The outside of the store (it's in a strip mall) will weird you out the first time, but the inside will make you feel like you've stumbled upon one of the west side's hidden gems. The cole slaw that comes with the fish is on the grosser end of the cole slaw spectrum, but who cares when you've got great fish?"}
{"text":"I love this type of of deli grocery with prepared foods concept. There is every kind of fishphernalia you could ever want: fresh and frozen seafood, condiments galore, fresh baguettes, and a case of seafood treats for taking away or eating in at a small table near the window. I came in for a quickie lunch, and was greeted by a very patient and friendly fellow behind the counter. Definitely a good front of the house type. I chose the deep-fried large shrimp plate which includes fries and coleslaw ($7.99) and spend a few minutes browsing all the goodies. I will definitely make this my go to spot for fresh fish and seafood, after being disappointed with some other Madison sources for same. I doubt I will ever have to sniff the goods before I buy them here.

My order was delivered by the friendly counter chap no more than 10 minutes later. The battered shrimp was perfect-serving of six. Delicious batter. Very crunchy outside and buttery clean hot shrimp inside. The bed of fries were fine, and the thimble of coleslaw OK. I asked about the batter, and as it turns out they sell the batter mix. I doubt for the reasonable prices here that I would try to make my own at home. I'd prefer to come here. Everything comes together quite nicely here, the high quality fresh ingredients, the fair prices and value, and most important, the flavors. Seafood Center will be on my tops list for everything fishy."}
{"text":"Do you like seafood? SEE FOOD! No, but seriously. If you love fresh fish but you're not in the mood for trout, blue gill, and other local freshwater species, Seafood Center is where it's at. Located in an unassuming strip mall (like so many other gems in Madison), I was greeted by friendly employees and two display cases bursting with clams, salmon, wahoo, mussels, crab, shrimp, and even some Dabob oysters! I nabbed some wild Alaskan halibut for only $16.99 a pound--sometimes this is a steal even in my hometown of Seattle.

I perused the \"to-go\" menu of various fried treats and chatted with the owner. Upon hearing that I was new to town, he said he wanted to do for me what someone did for him when he first moved to Madison. He wrote down a list of a few hidden gems--specialty food stores--that I should check out. Score! All in all, in the land-locked Midwest, Seafood Center reminds me that it's a small world after all and a taste of home is just a plane ride away (in a refrigerated case of halibut)."}
{"text":"Pros: Fresh, good quality fish, decent prices
Cons: ? 

We love stopping at the Seafood Center for some fresh fish to take home and bake for a cozy, fancy, stay-in dinner. Prices are reasonable, and the selection is good. They also remove the guts for you, which I really appreciate. Definitely one of the better (if not the best) seafood markets around town."}
{"text":"Go there for the Fish n Chips! Yeah, I know, they have have fresh seafood and all that but I go there for the fried kind. Depending on what type of fish you get it will run you $6-$7 and you get some nicely cooked fish, chips, coleslaw and tartar.  Very consistent with the food and nice employee's to boot. 
They only do take-out and unless things have changed they don't do the chips on Sunday, They also have a tank full of lobsters to entertain you while they cook your order!

Edit!    Hey! They now have one table to sit-n-eat at if you want!"}
{"text":"Awesome fish. I always get the catch of the day (variety of fried fish- from tuna to salmon to whitefish). It is phenomenal.  They also have a eide range of cooking supplies that go with seafood dishes.

 I have never made a bulk order so have not experienced any issues like some of the other reviews."}
{"text":"From the outside this place just looks like a place to buy seafood to take home and make at home. SURPRISE! You eat there or take out prepared meals. We enjoyed the  fried cod. Fresh, flaky, great batter and served hot! We also enjoyed the red beans with shrimp and scallops. The tartar and Cole slaw were also homemade."}
{"text":"For amazingly fresh and delicious seafood this is the place to go in Madison. I have never gotten any of their prepared food so this review is specifically for the raw side of things.

I have had the tuna and the red snapper here. Both were incredibly fresh and of very high quality. I found the price to be very fair considering the overall quality of the product. Really good seafood is always going to be costly but oh is this stuff so worth it as a special occasion treat! 

The shop also has assorted spices and cooking tools. The staff is always friendly and it is not a high pressure shop. I can't wait to go back and try more of their unique and delicious offerings."}
{"text":"Got the fish and chips - replaced chips with onion rings.

Fluffy and finely spiced, fish was definitely tasty. Good batter. Good take away food."}
{"text":"We've been going to the seafood center for years. They have a nice selection to fresh fish and other seafood. They also make a lot of other homemade foods and dips.

They also do food for take-out. I got it though for the first time today. I ordered the 3 piece cod with fries for $7.50 ish, a super good price if you ask me. The fish was really good, perfectly breaded for my taste, not too light but also not over breaded and super crispy. The fries were good, pretty standard. The surprise was the tarter sauce and side of coleslaw that I'm suspecting are both homemade. Both super yummy and really complemented the fish and meal. I will definitely be ordering carry out again, you just can't beat the price for the tasty, quality food you get."}
{"text":"Of course, I looked to see if there were any seafood markets in Madison. I was surprised that there was! They had a wide variety of fresh seafood, which is great.

I came in originally to get the halibut, but hah, I'm trying to save money so I wasn't looking to pay $27.99/lb for it. Nothing wrong with the price, just wrong with my wallet. I opted for the cod instead, which was $8.99/lb. The cod was very flaky and good. We breaded it and fried it, and it was good.

I am definitely going to come back to try the cooked food here. It sounds like that is what's up!"}
{"text":"My family loves this place. Whenever we're too lazy or cold to go out for fish on a Friday night, the seafood center is the perfect option for our family. The family pack is affordable & filling, and easily feeds a family of 4-5 people. The fish is delicious, flaky, and fresh, and the French fries are hot and addicting. Love this place!"}
{"text":"I love the seafood center because of the excellent fish fry. The price of the fish fry is about $7 for two pieces of fried cod, French fries, coleslaw and tartar sauce. The price is way cheaper than Culvers and even tastes better."}
