{"text":"Like so many who have written reviews, I live very close to Aliante Casino and was hoping the Mexican food was not as bad as some of the reviews. I actually waited until yesterday to give it a try thinking they are going to get it as right as they can by now.  This was worse than I expected after reading the negative reviews. The Margarita, if you ask for a happy hour price, is only $4 and not bad. The chips, which they obviously buy in bulk either in a bag or a box, are not fried on premises and about 80% of them, were little pieces too small for even me to eat. The chips came with 3 salsas. The bean and salsa were pretty good but the green salsa had a fishy taste. I ordered a two item combination, chicken enchilada and shredded beef taco. These items are what I consider the basics or gold standards in Mexican/American food. If you can't get this right you can't get anything right.   The food came pretty quickly which was not surprising as the restaurant was deserted and most of the people in the bar area were only drinking. As soon as I bit into the taco, which was in a purchased taco shell like you can buy in a grocery store, I knew it was chicken and not shredded beef. When the bartender came by I said I think my taco is chicken not shredded beef. She said oh, I will order you one a la carte. The taco came very quickly but it was ground beef and an off tasting ground beef. Taco Bell's ground beef has a more Mexican flavor. The enchilada was really small and had almost no sauce on it.  I have eaten at two Mexican Restaurant predecessors of the Salted Lime at Aliante Casino and they all have the same thing in common. The chips and taco shells are purchased and not fried on premises. Also, the sauces are very simple and uninspiring. I am guessing the problem is that the kitchen is not properly equipped. There is no other way I can explain how three Mexican restaurants in one location can be so bad!"}
{"text":"I've been to Salted Lime on about 6 different occasions.  I have always been seated promptly and the service is very attentive.  I usually go early evening.  Although the prices are decent, the food is always inconsistent.  I would order the combination plate and one time it would be fresh and moist tasting.  The rice would be exceptional.  The next visit I would order the same combo and it would taste old and dried out.  The rice would be hard to chew.  As stated by other reviewers the chips and salsa are always consistently good.  The other reasons for poor review include lack of any unique dishes that can't be found at a chain restaurant."}
{"text":"Worst food, I have ever had. I could cook Mexican food better,should have stayed at home. My daughters birthday was ruined by greasy fajitas and cores in the salad. YUCK. The Aliente Hotel should be ashamed. Will never be back."}
{"text":"Service was great! Our server William was attentive and friendly. Food is just ok."}
{"text":"Let me start off by saying that I eat a lot of Mexican food to say the least.  While The Salted Lime may not be the most authentic Mexican food I've had,  it's certainly very tasty.  I had the beef Flautas and wow delicious. The beef was very tender and tasty and the tortilla was crisp not greasy. The chips and salsa that came complimentary were pretty good as well. Our food came out very quickly and the service was excellent. I'll be sure to come back."}
{"text":"My girlfriend and I agree that the food is great but the drinks were terrible. The bartender was 'sketchy' and disappeared while 'making our drinks' which took 15 minutes. Bacon wrapped shrimp was fiendishly delicious, the chips n dips were good, and our waitress was pleasant. I just assumed a place called The Salted Lime, would pride itself on making margaritas that would rival Margaritaville's."}
{"text":"I would only come back for the chips and salsa/dip, which was complimentary, and the Elote. The chicken tortilla soup was way too salty, and the carnitas was too dry."}
{"text":"Love the Salted Lime! It's kid friendly and the food is delicious!  Went there last night with just my hubby. As usual, the staff was friendly, the Margaritas were great, and the chips and salsa as always were yummy. Really enjoy the relaxed atmosphere and like the fact that the manager occasionally goes from table to table to welcome patrons and ensure that one's dining experience is a positive one!"}
{"text":"This place is MUCH better than the restaurants that were in its place before.  First of all, the complimentary chips come with 3 dips- 1 red salsa (roasted chipotle I believe), 1 green salsa (avocado and tomatillo- my fave!), and a simple bean dip.  All three are delicious!  I could have just that and a margarita and be set.  I ordered the chicken flautas with a side of guacamole.  The guacamole was simple (I hate when restaurants try to throw too much in there) and the flautas were crispy without being over done.  I drank a regular margarita and then I went ahead tried a coconut lime margarita since it sounded intriguing.  I was surprised at how good it was!  Not too sweet, but not bland either.  Surprisingly delicious!  I ate in the bar area and the food came out quickly.  The service and prices were great!"}
{"text":"Me being Mexican... I am very picky when I go out to mexican food places. I came here on a date and must say I was pretty impressed. To start we just had some good ol' ch chips and salsa. They gave us two different kinds of salsa a green and red. They were both really good. For dinner I ordered the carnitas plate... Basically pulled pork Mexican style.  OMG.... They were so good! They tasted like the real deal. Definitely going to go back and try other items on the menu . I'm giving 5 stars just because my dish was as close to authentic as you can get!"}
{"text":"I didn't take any pictures but the salted.lime sure is salty. My server was very sweet and welcoming. My drink took longer than id like, but the bartender made it nice and strong. my food was not good. Not good food! I wouldn't come back but the service was good."}
{"text":"I was drug here again for someones Birthday Party and the Second Time was worse than the First. We ordered Chicken Fajitas and a side salad and an Order of Soft Beef Tacos along with a PATRON Margarita. First The Food. The Chips and Dip had two choices of Dip - neither memorable. For both Dishes The Rice and Bean Platters were prepared ahead of time and barely warm ( all eight of us got the same cold platter ) they put a Tablespoon of Salsa, Sour cream and Guacamole on each plate. Again noting as good as you can get out of a Tub from any grocer. Next The Service. It was Cinco De Mayo so they should have been prepared - Wrong !! Inattentive service, we were unable to re-order overpriced Drinks, ask for more condiments and could not even get refills on water. Third the Price - One Alcoholic Drink  , Water, a Chicken Fajita and two soft Taco's $ 45.00 counting Tip. All of us agreed we would never be back. Aliante is now part of Boyd Gaming which is widely known as having the Worst Dining Options in Las Vegas. So my recommendation is to go to a Non Casino Property and get far better food at a much higher quality or a much lower price for their offerings. Aliante relies heavily on a very aged senior community with a palate closer resembling a Nursing Home than Authentic Mexican Food. You've been Warned."}
{"text":"Wanted to give this place a shot being that it was Cinco de Mayo.  Wow, what a HUGE mistake.  My wife arrived before me and put our name on the waiting list at 6:15.  She was told that it would be about 30-40 minutes.  At the time, that didn't sound bad given the time of day and the fact that they should be busy on Cinco de Mayo.  At 7:15, we approached the hostess to ask how much longer since we had seen multiple parties conclude their meal and leave the restaurant.  It was at that time that one of the hostesses informed us that the \"kitchen manager\" had told them to not sit anymore tables until he said so since they were trying to cook for a party of 60-70 people.  I thought that was the most ridiculous thing I had heard in a restaurant in some time so I asked to speak to the manager.  After about 10 more minutes, out comes probably the worst \"people person\" manager I have encountered, Chris Olender.  When I explained our scenario to him and that at this point I was pretty irritated for not being told it would still be another hour before we would be sat, he did nothing more than shrug his shoulders and say there was nothing that he could do about it since they were trying to take care of the large party in the back.  Keep in mind that by now, there were at least 10 empty tables right up front that everyone who walked by could see.  It was almost laughable as the hosteses continued quoting new potential guest over an hour wait.  You could see the look of disgust as each person would question why they couldn't simply be seated at one of the many empty tables right in front of them.  This \"manager\" went on to say what did we expect, since it was Cinco de Mayo and that we should have simply came in yesterday or any other day of the year when they aren't busy.  Unbelievable!!!!  Simply put, I was willing to try to give them some business but I will never make that mistake again as Chris seems to live by the theory that his restaurant is down on the strip and that the customers just have to expect food and service to be misearble since those people are trapped.  That is NOT the attitude to have with locals as now I know why they are surely slow every other day of the year as Chris was quick to point out.  After reading other reviews, I am convinced that this restaurant will be closed soon enough and Aliante continues to sink further into irrelevance.  Such a shame because the Hotel/Casino is a beautiful facility but clearly isn't being managed correctly."}
{"text":"The complimentary chips and salsa were great.  Especially the bean dip that came with it.  We sat at the bar area during the \"re-opening\" week for dinner.  I ordered a couple drinks which were ok and had the combo with tacos, Chile relleno and a chicken enchilada.  The food was on par with what you would get at an Acapulco restaurant. Nothing to write home about. Service was good. Bartender seemed like he was learning the ropes still but always made sure our drinks were full.  I would go back just to chill at the bar and watch sports on the nice flat screens they have and have a couple beers and chips and salsa."}
{"text":"We use to really like the Salted Lime. However each time we have gone the service and food have been a little worse. Last night will be my last time going. Not only did it take 1 hour to get out food, but once we did my first bite was rocks... Literally. The waitress  saw me spitting out my food and told me they have been having that problem with the beans... So it's been a problem they know about, however have not fixed it? Our food came out dry as if it had been sitting awhile. Keep in mind that the restaurant really wasn't very busy. When we received the check the waitress said our drinks were complimentary because of the rocks. I had a water and my husband had a beer. Really sad, I hope it turns around or they come up with something better."}
{"text":"The idiots in charge of this place have ruined it.  Now the restaurant is open only 2 days a week ! Just the bar on the other days.  Came in tonight, been waiting for almost 30 minutes, NO ORDER TAKEN !!  Why ??  The idiots have only 2 people working !  1 bartender and 1 server.  The place is packed for a Tuesday night, the employees are doing all they can, it is the MORONS in charge that have their head up their ass !!!"}
{"text":"Very average food at best,  from authentic Mexican food and very commercial. Chili con queso was just a bowl of melted processed cheese with zero flavor, just like those jars sold at grocery stores. Chicken enchiladas were extremely dry and again lacked flavor. On a good note, they have ice cold tecate on draft. Service was also good with friendly waitress. So if you want a nice cold beer go ahead and stop in, but if your hungry go elsewhere. Prices are pretty high too, especially when compared to food quality."}
{"text":"We had six people they messed up three of the six orders. They even screwed up the dessert. When we told the server we did not order what she was giving us she argued with us. I had to flag down the waiter. Will not go back if someone else is paying."}
{"text":"We enjoyed a girl's night out paint event here tonight, super fun.  Since we were all engrossed in our paintings, we all just ordered appetizers & drinks.  I ordered a shrimp cocktail, presentation was good, came out in a little martini glass shrimp ceviche style.  Portion size was great, plenty of shrimp.  I shared an order of guac & chips w/ a girlfriend and it was super yum.  They give you an excellent ratio of chips to guacamole, pleasantly surprised.  I topped it off w/ a white wine sangria that was so freaking bomb, its a must try if you like sangria.  Service was on point, most definitely will be back to try some of their entrees."}
{"text":"Worst place EVER!!! Don't waist ur time or $. Have given this place quite a few tries and EVER single time is an epic fail."}
{"text":"Yikes! This place was terrible! The place seemed deserted and yet another waitress was helping our waiter out and seemed upset that she had to pick up his slack. The food was ok. Nothing spectacular. The tacos were in shells that you would buy at Walmart, the chicken was dry and flavorless, the only thing they had going for them was the complimentary chips and salsa."}
{"text":"Our experience was good. Food was good. Service was good.   Its at Aliante Casino(a place where good casinos go to die). Anyone who is a good server or top cook/chef is working the strip. Your expectations have to be reasonable. Even taking that into consideration I still like the place.."}
{"text":"Service was excellent.  Only issue is our meals were way more salty than necessary. Wife loved the Blood Orange margarita."}
{"text":"Just got back from an early dinner. We sat in the bar as we have in the past when it was Cabo. The bartender took care of us - he's been there for a long time and is always good, not intrusive but there when you need him. I had the Pork Chili Verde and my wife had the fish tacos. Both were okay but not great - definitely no where as good as we used to get back in the SF Bay Area. One thing I'd like to see changed would be a choice of beans. We both really don't like refried mush. Some black beans would be nice.   Oh yeah the menu was hard to read in the dim light of the bar. The combination of black letters on a brown/red background just doesn't work.  We really don't know if the \"new\" Aliante is going to make it. It's pretty dead every time we go. We ate at the Bistro the week before and the food was good but the place was empty. I think Aliante has to be exceptional to draw bigger crowds."}
{"text":"Very good drinks and a quiet spot at the Alliante.  The service is very good and food looks good but have not eaten there yet.  At this point given the choices of mexican food in NW Las Vegas I would recommend even without trying the food."}
{"text":"The food was good! My roommates order was wrong, and when we ordered desert they only brought one, ummmm there's 2 of us! They won't open the tables, which leaves you sitting in the bar. People were standing in front waiting for a table and they have to wait for a bar table to come open. There's 2 lady's working the tables, one who takes the orders, one who delivers. But, the food was good!"}
{"text":"Good food.  Shrimp fajitas and fish tacos are recommended.  Service is sometimes a tad slow (hence the 4 stars). It is our favorite for sit down mexican in the north part of town."}
{"text":"The service is extremely slow.. Been here an hour and still waiting for the food.  Very short staffed.. Hardly ever saw our waitress..food is good but there are other Mexican restaurants in the area!  I don't recommend this place at all.. Bad experience!"}
{"text":"Not good at all, on any level. The service is so-so, the food is bland and the drinks are watered down. Not good."}
{"text":"We sat in the bar for happy hour, which is on whenever they're open! The bartender was great & attentive. We tried the street tacos (carne asada & carnitas), ceviche mini toastadas and fish tacos in lettuce wraps. We liked all of it! Plus the complimentary chips & salsas & bean dip are tasty too. And you can't beat $3 wells and $4 margaritas!"}
{"text":"Great Value. Excellent white bean dip and chipotle dip accompany the chips. Margaritas for 4 dollars. My hubby had a huge chimi and I had a  tasty salad. So full that we couldn't order desert. All for 30 dollars and friendly service too!"}
{"text":"We went for taco Tuesday  for their $1.25 carnitas taco , they were delicious the meat was tender , shredded and flavorful.  I ordered a  Hendrix gin martini  which was good although not served in a martini glass they said they did not have any . The service was good, the manager  came around several times to ensure all was well and helped us find some extra chairs when we unexpectedly ran into some friends .  Overall good experience , will definitely go back again ."}
{"text":"I've worked in food service before and I feel that I am very fair and generous when it comes to reviewing an establishment. That is not the case for this place. First off the only reason I gave it one star was for the chips and salsa ( particularly the tomatillo). We didn't get to try the food we ordered because after waiting 15 min to be greeted by our server, waiting just as long to receive our drinks...my house salad came to me with a hair on it. Needless to say we were out of there! Don't waste your time here...not only was this place horrible but The Aliante in general has gone down hill since being sold. Air quality has changed to smokey, smokey, smokey!!! No handsoap in the restroom. What a huge disappointment all around."}
{"text":"The only reason I am giving one star is because the chips, beans and salsa were good other than that this place was awful. The dining room was closed since it was a Sunday which ok cool we decided it was fine to sit in the bar. There were no menus on the table and it took our waitress forever to come over. She finally comes by and asks what we want to drink and in the middle of me telling her she walks off!!!! She came back with menus and then walked off again so at this point we had been there 15 mins and had no drinks.   When she finally decided to come back she took our order for drinks and appetizers. We didn't have chips or anything and still no drinks not even water!!! She finally brings us our margaritas and guacamole but guess what... I'm not eating guacamole with my fingers because she kept forgetting to bring the chips and beans! Our margaritas were so watered down it wasn't even funny. We barely drank them because all they tasted like was watered down mix. Our waitress comes back over and asks why we didn't have our food yet! I don't know that's your job to know why. I watch her walk over and input our order into the system and it took another 20 mins for our food! She basically she FORGOT to put in our entrees! Finally chips came right when our food did so basically ordering an appetizer was pointless!   Dinner wasn't bad. I had a chicken taco and cheese enchilada and my husband had 2 cheese enchiladas! The only gross part was the rice and beans, they tasted stale. I couldn't wait to leave. I can say that I will NEVER go back!!"}
{"text":"Giving this place a 3 1/2 Star, great drinks and food just the customer service can lack sometimes. The elote is super good as well as the sopes of any meat flavor. Happy hour is worth it and you can use your alliante points!"}
{"text":"I've been hesitant to try this place since trying it years ago under its previous name.  Decided to give it a try with an open mind!  Staff is all very friendly and fairly attentive.  The food is just a bit disappointing especially for the high prices.  Don't try the pork chili verde, it's just greasy fried pork with green sauce poured over it.  The tacos and flautas were decent but not authentic or standout.  The carne asada was good.  Bacon wrapped shrimp was probably my favorite dish which was the least Mexican thing we ordered.  We did have some issues but they resolved them quickly and professionally which is much appreciated.  I think if the prices were more reasonable I would probably be back but I can get better Mexican food cheaper at a lot of places.  If you like gringo Mexican food this place would probably work for you."}
{"text":"We had the carnitas sooo good! Priced right. Ate through the complimentary chips. Are at the bar everyone was quick and attentive to all the guest. Definitely would come back again."}
{"text":"This place is ridiculous. There was a waiting list when we arrived. We put our name in and decided to wait the hour. Right on the dot the hostess called to say they could not accommodate us due to a party of 60. Why could they not tell us that when we checked in they made us wait the hour exactly and then decided to call and tell us. Then the. Douche of a manager came out after we asked for him and asked how our night was? Really. You're such a Schmuck. You should not be employed as a manager dealing with the public. I will not be back or ever recommend this place to anyone."}
{"text":"Delicious food!  Superb service!  A new favorite for sure! Love the laid back atmosphere.  The chips came with two types of salsa and beans.  My daughter and I went with the basic cheese enchiladas and they were delightful!  Not the typical thrown together fare but a carefully crafted twist on the classic.  I'm pretty hard to please with a cheese enchilada but these were delicious. My husband had a big shrimp burrito that he enjoyed.  The portion sizes are huge but the prices were reasonable."}
{"text":"Came here craving queso- sampled prior to ordering and thank goodness. Tasted heavily of beer. Went ahead and ordered a taco salad after the dip trio came out and was decent. The taco salad is a must not. There was a ton of mozzarella on it instead of cheddar. The \"taco seasoned beef\" was very familiar to a can of Hormel chili. The lettuce was already turning brown. Our salad was out within two minutes of ordering. The shell was glistening from oil, although it was fresh oil. I wish I had decided on Cafe Rio salad and not decided to try the queso. Being pregnant I already feel nauseated. The waiter was very pleasant and my water was fresh. Sadly, we will not be back. It's connected to a bar so don't expect anything beyond bar food. So if you are drunk... This may be what you are looking for. As for me I'd rate this below a taco bell salad for double the price."}
{"text":"First let me say I want this place to continue to succeed.  Aliante and its restaurants are huge in giving this community some flair.  I had been to both previous incarnations of Mexican restaurants in this spot and will say that I found the food at The Salted Lime to be on par with them.  The biggest difference i noticed us the menu has been streamlined greatly.  I sat at the bar which was not very busy.  The bartender was nice and the service was good.  The highlight for me was the Navy bean dip that came with the salsa.  It was excellent.  I could have just even that and been happy.  I am not a fan of the chipotle salsa although I'm sure some will love it.  I had an order of Nachos.  The portions were huge.  The beans were okay and I could have done with more cheese.  But overall the taste was fine. I would go back with friends or family or for their late nite happy hour."}
{"text":"I've NEVER seen my husband almost spit out his food before. It was horrible. Their menu is tiny (but do-able since it's the staples of Mexican food) but decently priced. Until we got the food.  The waitress forced a to-go box on us after asking if we wanted one and we said no. Normally, one would notice the untouched food and the customer not requesting a to-go box and question the meal, but there was no concern for quality here. We'll never return."}
{"text":"Wish i could recall our servers name. Tallish. Male. Was on a tuesday night. We had our 4 yo son with us. Server catered to our every request....and got it all right.  Even anticipated a few things we didnt ask for.  Requested no rice...not a single grain to be seen.  UPDATE: Came back today, servers name was mark!!!!  Tonight we had Griselda who was just as awesome!!!!  Maybe these 2 should be hotel managers?!!??"}
{"text":"Came here for the first time because thats where vegas painting parties was doing our painting. They have very limited happy hour menu, got the taquitos and they were amazing. Didnt care for drinks offered on happy hour menu, waitress recommended a yummy coconut margarita . It was delucious, yummy.  Pricey but worth it. It was so good that i took my husband back on another day JUST to try this amazing margarita. Went to the bar said i had a yummy margarita with coconut in it last time, ordered 2 girl acted like she knew exactly what i was talking about got the drinks, they didnt look the same, but tried it anyway. But wasnt the amazing drink i told my husband about. Showed the bartender the picture of the one i had last time and she said ohhhh that is not on the menu. Thats a drink i made up. And i told her well that the one i wanted. She made it and it was delicious. We were charged for all three margRitas thougb 30 bucks. Left the 2 full margaritas there and left. Very disappointing. How am i suppose to know its a drink not on the menu and how am i suppose to order it in the future?"}
{"text":"The salsa here is great. They give you kind of a sampler platter. The spicy beef taco is the best taco I have had in a long time. The service is a little slower than I would like but the waitress was very very nice. All in all a very pleasurable experience"}
{"text":"Came here so the wife could have a taco salad. This place was pretty darn good.  The 2 salsas (one green and one red fire roasted) were awesome, as was the bean dip.  I got a cup of tortilla soup and that filled me up (along with all the salsa and bean dip).  When my taco salad arrived I ate a little bit of it.  It was HUGE and darn good also.  We will be back.  Service was outstanding also."}
{"text":"Okay, so I don't understand how you mess up my order not only once, but twice! I ordered a two combo plate (pork tamale w/ green sauce on top & a chicken taco). When they brought out my food, it was a chicken tamale w/ green sauce and a cheese enchilada. It was not alt all what I ordered.. So the next time they brought my food, they brought out a pork tamale w/ red sauce and a chicken taco. Again Wong order.. Finally I get the correct order after everyone in my party was done eating! However, the food want that bad, it was actually pretty good.. My me need up being free, but come on guys.. Get ur stuff together.. The waiter was nice, but I just don't understand how u mess up an order twice. I also should mention that my spouse order a carne Asada burrito topped with shredded cheese and green sauce, which they forgot to put on his burrito and my mother order green sauce and sour cream on her chimichanga which they did my put on again.. So do yourself a favor and make sure that they get ur order correct!"}
{"text":"The salsa and bean dip they bring before the meal is delicious.  Margaritas are pretty good.   I have had shredded chicken tacos which were also good.   I wouldnt recommend the regular chicken tacos as they were too bland for me.  I wouldnt consider this authentic Mexican food but good for a couple of quick shredded chicken tacos and guacamole."}
{"text":"Now that this place is no longer Cabo, it seems like they simplified it. Menu is now 2 pages: front side is appetizers and back side is entrees. Food comes out in large portions and pricing is very reasonable and cheaper than Cabo was. The only problem I ran into here was their short staffing...we sat at the bar which only had a single bartender so drinks and food took forever to get to us including our chips and salsa. On another note, the food was great and so was the salsa so I will probably be returning in the future"}
{"text":"I wish I could leave no stars, because I would. The best thing about this place is the \"complimentary\" chips & salsa $3. These service is horrible, the staff the worst. And let's not talk about the food. The drinks were all watered down, the food was all dry. We saw our server 3 times in the two hours we were there. Never again"}
{"text":"Our family love love Salted Lime. The BAR area is great, Nancy is very good at greeting everyone and getting theim their drinks fast. The pork chop are wonderful and on Tuesday is taco day, they are great. But for the most part all the food is great and everyone is very nice. Love all you guys."}
{"text":"Service was slow food took more than 40 minutes they brought out one of the the Maine course items as a appetizer, the fajitas were burnt. Margaritas sucked best advise I could give is pass this place up and go to Taco Bell ( yes Taco Bell is better and a hell of a lot cheaper ) and it will be delivered fast unlike the service here !"}
{"text":"So, the only reason my fiancé and I came to this restaurant was because we had coupons and didn't want to it to go to waste. Came here before, only for the bar and appetizers to watch a game.   So today we walk in and sat down in the bar area. Chips and dip (salsa, bean dip, guac) came out immediately after we sat down. Then the wait for our waitress. The restaurant was slightly busy, but still had plenty of open seats. However I'm not sure if she was the only waitress for the area and maybe that's why it took her a little longer to get to us. The waitress comes, takes our order and grabs our drinks. That's when the wait begins. I'm not exaggerating when I say we waited 37 minutes for our food.   Who I am assuming is a manager, (because he was wearing a suit), came out to every single table and told us our food would be out shortly. We all sat down at different times so how all 3 tables and some bar people received their food at the same time is beyond me.  Back to the food. I had the chicken fajita. I managed to eat one which honestly wasn't bad. The peppers and onions were sautéed to my liking, the chicken was a little dry, but I put some of the guac on there which made it better.  Mind you, I was waiting for 37 minutes, so I was pretty full off of chips and dip. Not complaining about that though, I don't mind left overs. My fiancé had Carne Asada which should have been some hamburger meat. It was thin, no seasoning, generic meat. Robertos has better Carne Asada...per his words.  The reason I chose two stars.  1.) our waitress Amber Though waiting tables and getting a little behind, she was friendly and energetic. Again, we think she was the only waitress at the time and we are giving her benefit of the doubt for not being as prompt but her attitude is what got the star.  2.) the manager coming out to let us know our food was coming and also he offered us dessert on the house which we kindly declined.  This place has potential but if you're looking for a Mexican place there's a better more authentic restaurant a few miles away."}
{"text":"The service at The Salted Limit is generally stellar.  I've eaten there several times and never waited more than 15 minutes for a seat and always had a great server.    The chips and salsa are great - freshly cooked corn chips, green and red salsa and bean dip.  I had the fajitas for the first meal and they were very good.  The last time I went, however, I got a mixed beef/chicken fajita plate and was dissapointed.  The presentation was nice, but the meat needed more seasoning and the beef was tough and chewy.   However, I'll be back because the location inside Aliante is convenient and I'm convinced it was just an off night."}
{"text":"This place needs serious help.  We should've known better than to roll the dice considering the restaurant appeared abandoned around 6:00 on a Sunday evening, but I was really craving Mexican food.  The margaritas are a joke.  A splash of alcohol at best.  The rice and beans are inedible.  I'm positive the rice was made from a box, and poorly at that.  The food lacked any flavor or any thought whatsoever.  It really felt like food was nuked and thrown on a plate.  The tortilla chips are probably what gave this place its name; they were salty beyond comprehension.    Worst 50 bucks ever spent.  Shudder."}
{"text":"This is not authentic tasting Mexican food I expected a lot better than this something closer to \"Lindo Michoacán\" for example or \"Viva Zapatas\". Besides that the service was bad although a Friday night it wasn't very busy but the waitress (Asian lady) didn't seem to pay much attention to our party of 6. She rushed through placing our order and wasn't very accommodating or very friendly. Then I asked the waitress for the hottest sauce or salsa they had and she brought \"chulula\" which is not close to what I desired little do I know the tacos come w a very spicy red sauce I would've been completely satisfied w maybe they should get to know there meñu a bit better. To top it off they had sour faces when they brought out a birthday candle we requested they didn't sing Happy birthday it was kind of rude. I will not be returning. I will say the one dish that was actually good was the chile relleno."}
{"text":"I was so excited to try out The Salted Lime! My friends and I (party of 8) had a reservation at 6 for their opening day.  The bartender, Morri, made the greatest margaritas! Chips and salsa were complimentary. Food took a bit to get to us, but what would we expect, it was opening day! The food was far from disappointing, we each enjoyed our entrees. I will definitely be back to try another delicious selection from the menu!"}
{"text":"The food was good, but it took forever to get served and they're not too busy. Not sure what's up. I ate so many chips waiting for our meal I was full when it got there."}
{"text":"Food was OK service was REALLY slow. Good for happy hour but I would advise going somewhere else for real Mexican food and good service! Plus the margaritas were second rate!"}
{"text":"We went to happy hour last night ordered the corn on the cob we ordered the sliced cucumbers , the cucumbers are hot but we learned a little trick and ask the bartender to squeeze fresh lime on top of the cucumbers and it was amazing. We had a carne asada taco, the meat was delicious the corn tortilla was a little bit dry and kind of a hard. I ordered the guacamole, I'm actually allergic to onions, so I ask the bartender if the chef if he could make some without onions and he applied and it was very good and I am very thankful, with the guacamole with the free chips and salsa. we also had a few well drinks  on happy hour special and the margarita that was on happy hour special. The food was beautifully presented and tasted just as good as it looked we are absolutely going to be back the atmosphere was fun it was a beautiful setting and we actually made some new friends"}
{"text":"We've eaten here in the past and not found anything with posting aboot.. Try to give every place more then one chance.. Just in case it was a fluke..  The chips and dips were good.. That was it..  The service was slow and un attentive..  Ordered two two item combos.. Chicken Taco and pork tamale.. Beef Taco and pork tamale.. The chicken was dry.. The beef was spicier then advertised by the server.. And the tamales were just gross.. They were spongy and the pork was very grisly..  We didn't even eat half the meal..  The server never asked how it was.. Just took the plates and dropped the check..  Will not be returning.."}
{"text":"Was waiting on a movie so my husband and I stopped in for some beers, appetizers, and chips & salsa.  We ordered the cantina platter- Tapatio Shrimp, Chicken wings, mini beef taquitos, and Elote. I would say the Elote was the best part. I've never had it before so it was interesting- grilled corn smothered in sour cream(?) and spices. Apparently it's a very popular Mexican street food.   Chicken wing- my husband bit into one and it was still very pink on the inside. Looked very under-done or almost raw. That was a little unsettling.   Fried ice cream- just skip this dessert. All you taste is oil! the ice cream was plan vanilla and the crust... was inedible. Just very oily and should be removed from the menu."}
{"text":"I have been here a few times. The main reason I keep going back is the bacon wrapped shrimp appetizer. So very tasty! The food is generally good, nothing to knock your socks off, but typical Mexican food Americanized. The iffy part can be the service; the servers themselves great, very helpful if you have questions. However they can be slow in getting to you to take your order, I find it annoying to have chips and salsa, but no drink order being taken, let alone arrived at my table. Otherwise pretty ok place for dinner."}
{"text":"So we went to grab a bite to eat at the salted lime on Taco Tuesday. The Hostess an older woman was super nice and made us feel welcome. Our waitress however No customer service skills at all. The food took over an hour to arrive and the manager comped our meal. It was tacos thought so it shouldn't have taken that long. Anyway not happy with the service and the food was mediocre  not impressed"}
{"text":"Drinks were your average restaurant drink and their happy hour is over at 6pm during the week. I'm not sure the name of our server but she was terrible we only saw her 3 times in the 2 1/2 hours we were there. But the nachos (sub fries) were amazing!"}
{"text":"I do wish I could actually review this restaurant because I've heard good things about it.  We attempted to eat here last week but things didn't go so well.  Upon entering we were given very rude glances by some of the diners because we had young children with us, but the staff was very accommodating and seated us at a corner table where we wouldn't be a distraction.  We ordered our drinks and dinner and were snacking delightfully on the yummy chips and dips when my sister's one year old started to fuss.  So like any normal mother she did her best trying a variety of techniques to soothe the little guy, who gradually kept getting louder (mind you, we had informed the hostess of his mood and that is why she sat us in a separate location as the rest of the patrons).  Just as she was about to take the baby out to the hall a diner from ALL THE WAY across the restaurant YELLED at us to shut that baby up.  So I would like to ask...which is more rude in a restaurant...dealing with a fussy baby or yelling?!  Needless to say the manager went over and had a chat with this diner (who was irate and very rude to him) and the manager came over and basically asked us to leave.  He did say sorry because 'we are a family restaurant' but we felt so uncomfortable and made the decision to leave as this man complaining was basically in attack mode towards us and the manager.  As we walked out this man yelled at us that the baby needed a spanking and we needed to shut him up.  By far one of the most uncomfortable dining situations I have ever been in.  The baby had JUST started to fuss and we weren't even given a chance to deal with him.  This is not some $50 plate gourmet restaurant.  It shouldn't have been that big of a deal, but we weren't impressed that we were the ones asked to leave and not this inappropriate man who also acted like he had been drinking.  Unfortunately it left a sour taste in our mouths and I doubt we'll return, even though my sister who is a local, has raved about the food!"}
{"text":"First time we tried it here and it is so good.  Asked for caso sauce on my burrito and even though it wasn't on the menu they were happy to do it.  They have huge portions, I could eat 3 meals on this one."}
{"text":"This is not the best Mexican food, by any means. The chips are okay; the salsa trio that is complimentary is probably my favorite item here. I've tried various dishes, from enchiladas to ceviche, and have not been overwhelmed by anything. I started coming back only for drinks and chips/salsa, but the drinks are VERY light on the alcohol, mostly mixer. The bar ambiance is pretty, but the service is very mediocre. They've certainly improved since their grand opening, but are still a bit slow."}
{"text":"The Salted Lime has always been my favorite spot for a margarita and appetizers until tonight. Even though it is Cinco De Mayo the service should have been better. I only seen 2 servers there.  It took our server 15 minutes to come to our table to greet us. At that time we placed our entire order including drinks from the bar, appetizers and entrees. My six year old son was with me and was ready to eat. 25 minutes after being seated they finally brought us chips and salsa but still no drinks. 45 minutes after being seated I finally got my drink from the bar that was not what I ordered. I ordered a blended margarita but received a margarita that sat so long before they brought it to me that all the slush had melted. So the server  said they would make me another one. So after about an hour we finally got the appetizer (Bacon Wrapped Shrimp). It had set so long before being brought to our table that it was barely warm and the sauce that is drizzled on the plate for decoration was dried to the plate. When I finally got my drink from the bar I asked for more chips and salsa. After about another 15 minutes they brought bean dip and he said he would be back with chips...that never happened. In the meantime my son was ready to leave because he want McDonald's now. 90 minutes after being seated our food finally comes to the table. At that point I asked the guy who brought the food to please bring us a box...he scoffs at me. I told him never mind we are leaving. During that whole time I was there, 2 families that were seated after us left before placing an order. I tried to be patient because I know it was a busy night, but this was unacceptable. I have always sat in the bar area and was my first time going to the restaurant side. Truly disappointed with my experience."}
{"text":"This place is zero stars. We decided to eat here before a concert. After a 25 minute wait just to be seated, it took another 10 minutes for the server to stop by for the first time. We immediately placed our order, and 30 minutes later, the server told us the chef said they did not have a complete dish of something we did not order. Stupid and incompetent. After another 10 minutes without even our appetizer being served, we stood up to walk out, and after waiting another 5 minutes to try to settle our check for the two drinks they brought us during this ridiculous wait, they wouldn't even bring that. Ultimately we had to leave for our concert and the manager came by to apologize. Importantly, the chips the brought with the water were stale and literally covered with cold old oil. If that is any indication of what the food they never served was like, that's a good signal to stay away from this awful place."}
{"text":"We very much enjoyed the food and our server, Tiffany, was nothing short of wonderful. We will be back based on the service alone!"}
{"text":"My husband and I decided to pop in for happy hour. It was really early like. 4:00 pm and we were the only people in there. The bartender /server was very nice and attentive.  We asked her for a Happy Hour menu and she said none had been created but they had Megaritas for $4.00  We ordered food off the bar menu and it was awful.  The street tacos were dry the fish lettuce wraps were boring and it felt like the food was a last minute add in and no effort went into it.   We definitely won't return but it was worth a try."}
{"text":"My first time eating at aliante..... I loved the salted lime. Our watress was great the food ooooh the food sooooo delicious.  (Yummmm) The chips and salsa were very good, navy bean dip and green salsa are so tasty.   Our bacon wrapped shirmp was amazing.  The jalapeño margarita was incredible! It's a must try!!! Trust me you will love it.  I had a wonderful experience and will be back."}
{"text":"I only got to try the bar menu since the restaurant didn't open until 4pm. I have to say I am thoroughly impressed by everything about this new menu. Compared to what it used to be, Camacho's (meh) and then Cabo (horrible) I went in not expecting too much. When I first took a look at the bar menu, I noticed how many items were under $3. Then I noticed something that I would've never expected to see in a Mexican restaurant inside a casino; elote and pepino's. That kinda sparked my interest and I knew from that point on that this was already gonna be better than anything this place used to be.  So of course I ordered a bunch of things:  Chips and salsa-complentary with 3 dips/salsas that were all amazing. The avocado salsa was like a cross between salsa verde and guacomole with the perfect blend of spicy/lime/avocado flavors. Then there was a whitish looking dip that the bartender told me was navy bean dip. Never had that before and OMG that was surprisingly good! I never was a big fan of regular bean dip but this was really creamy with a different bean flavor that isn't bland like pinto bean dip. Absolutely delish. Then there was a chipotle salsa, not a big fan of chipotle flavor but that one was good and all tasted freshly made. I would hope so since the restaurant has only been open for a few hours thus far.  Street tacos-carne asada and carnitas. The were pretty standard, nothing too special here but still good.  Fish taco lettuce wrap- I know my low carbers can appreciate this one. Grilled fish on top of some Bibb lettuce. Squeeze some lime on that baby and you eating good and healthy.  Shrimp cocktail- nice, big shrimp that were very fresh. The sauce had a unfamiliar taste to it so I just ate the shrimp.  Elote- came out molded into a cylinder with mayo and spices already mixed in it. All the goodness without a face full of mayo and parmesan cheese.  Cucumbers with lime and tajin- pepino's beautifully arranged with the perfect blend of lime and spiciness.  Another guilt free and carb free option.  There were a few little things that could use some work like food orders coming out pretty slow, expediters not knowing who ordered what, and old looking shredded lettuce as garnish on some of the plates. These are just minor things and its not a big deal cuz I understand they just opened.  Everything was beautifully presented and although it was just the bar menu I got to try, I'm sure the regular menu is great as well. I hope they continue to do great and keep up the good work so that more people can enjoy dining in NLV."}
{"text":"I've only been here once and would have much more visits, but their hours do not work with me. It would be nice if they opened up a couple hours before what their current opening time which is 4pm daily.   I liked that I was able walk up and sit myself at the bar. The street tacos were basic as can be, but did the job and the complimentary chips, salsa and bean dip was a nice touch. This is pretty much the only bar I know of in the north to order a michelada and be able to substitute it with any other beer on draft."}
{"text":"Awesome place and the service was amazing! ! Thank you Amber for such good service! !!"}
{"text":"Very friendly waitress but food wasn't impressive. Quite pricey for just canned bean dip and stale corn wraps. Won't be visiting again."}
{"text":"I recently found out that Aliante was no longer a \"station\" casino. One thing about the station casinos is that even though some of them have restaurants of the same name they were never each consistent taste and quality wise. Cabo in the Red Rock was delicious (it is now gone), but the Cabo here at Aliante was not that great. When I heard a place called The Salted Lime had opened in the place of Cabo I knew I had to at least give it a try since it might actually be good.  The decor inside doesn't appear to have changed other then the menus having a different name. The service was excellent. We were brought chips and salsa right away and our drink order taken. I never had an empty glass the whole night. The chips and salsa were great. It also came with a bean and cheese dip that was quickly eaten. You might even want to ask for 2 bean and cheese dips because they are addicting! There was also a tamatillo/avocado dip that tasted very fresh and delicious.  We started off with \"Chili Con Queso\". This was terrible. I tasted like they just took sliced kraft cheese from the wrapper and nuked it in the microwave. Even if this appetizer were free I wouldn't recommend eating it.  I ordered the \"Carnitas\". It cost $15. The side of rice had a lot of flavor and the beans were thick and very good. It came with warm corn tortillas but I asked for flour. The carnitas had a lot of flavor. I was impressed with the amount they served. This is something I would order again.  The others in my party had \"Beef Fajitas\" and \"Cheese Enchiladas\". The fajitas were a big hit but the enchiladas weren't.   Inside is clean and they have tables or half booth/tables.   TV's are everywhere.  You can sit at the bar where they have daily happy hour specials.  I will be back!"}
{"text":"We've been to this place a few times, and I don't know what has taken me so long to write a review!  Love the chips & salsa/dip trio they bring out (Navy bean dip mixed with the spicy red salsa=delicious!!) Tried the Queso Dip, it was OK, but the Tortilla Soup was AMAZING!  My favorite entree is the pick 2 comb plates.  Their rice and beans are really great too.  It's a little noisy, but most Casino Restaurants are.  I love that they have TVs with sports on them. pretty much visible from anywhere you sit.  We spent $60 between the 2 of us (not including tip), but I did order a massive Blood Orange Margarita that was a whopping $12, and we brought home another meal in leftovers.  I think it's worth the money, when you leave stuffed, & with a meal for the next day."}
{"text":"Worst food ever. Food was just warm, shredded chicken was disgusting. The only thing I can say is the chips, salsa and beans are good. This places need new management and a new menu."}
{"text":"Well what can I say,  latique was great.  She has the best customer service in the entire casino.  They were closing but she took the time to make our experience worthwhile.  Attentive and generous with her time and knowledge.  We got a mess of chicken, beef and fish taco.  All were fresh and delish.  Salted lime exceeded my exceptions and Justin the food server was just a sweety."}
{"text":"Dont waste your money! Slow and non attentive service. Food was beyond bad. Carne asada burrito looked like burnt tiny scraps of meat.  Tacos had no sauce and no flavor.  Terrible service.  3 tables came in after us and got food before us..  plates garnish looked like it's been sitting out for hours.  We wont be back."}
{"text":"The Salted Lime is a cute, brightly decorated festive restaurant with a separate bar & seating area. Over the years the menu has grown to include a great selection of traditional & nontraditional appetizers, entrées & drink selections.  We opted for an early dinner and we were quickly seated in a large booth. Our server brought fresh chips, salsa & bean dip along with getting our drink selections. I opted for the Shrimp Diablo and requested black beans be substituted for the refried beans & rice. My husband opted for enchiladas. We were both very pleased with the portions and flavor. Our server was very pleasant and attentive making for a very enjoyable experience."}
{"text":"Slow service, incompetent cooks, poor quality food and drinks... but those were the good points. This place was way better when it was Cabo. More than just the name changed and not for the better."}
{"text":"I have ate here twice and I am not impressed with the food. I have ordered the quesadillas as well as the enchiladas and both of them lacked flavor. The food is pretty bland and taste more like fast food than a sit down restaurant. Also, the alcohol beverages I have had here are constant disappointments. The first time my drink was way to strong and had too much sugar. It was just gross. The second time my drink did not even taste like it had alcohol and I had to go to a different bar to feel satisfied with something. I rather just spend my money elsewhere next time."}
{"text":"A must visit! It's a great local hangout for many of us who live nearby! The wait staff are great and the manager Lee is so very friendly and during New Years Eve, he was working tables, making sure everyone was good and was a great example of helping his team!   If you are nearby, a must go!"}
{"text":"We went to the Salted Lime last night for a New Year's Eve dinner. We had a great experience from being seated by the hostess to great service from our waitress Lyndsey. Definitely order the bacon wrapped shrimp  appetizer which was excellent,  a lttle pricey but very good. For dinner we had the beef chimichanga and shrimp & chicken fajitas both were great especially the chimichanga, the beef was very tender. Looking forward to our next visit."}
{"text":"Horrible service the waitress never came back to check on us the food was cold there were bones in the food. Judy the waitress never refilled our chips and salsa before the food came out the menu was small more like appetizers the a meal and Rick the manager was no help at all with our complaints this was a birthday dinner that turned into a birthday night mare we will never go back to the salted lime in aliante"}
{"text":"Have been going to the Salted Lime for many months, just love the chips & salsa. The $4 house Margarita is good. The bartenders are very nice! Also haven't found a plate that I haven't enjoyed."}
{"text":"Don't go! Food is gross .... Obviously sitting under heat lamps for a while ... Bland and old"}
{"text":"I came here for chips, four salsas, and a beer. Yep I said four salsas because you must ask for the hottest one. Could of been hotter but it mixed well with the bean dip. The hostess was very polite and conversed well. She was very descriptive of the specials, even told me what the bar specials were too. I sat down and my server was quickly on me to get my drink! After giving me a few moments, she helped me choose my meal because I couldn't make a decision. We went with the Baja Chop salad, because I'm trying to eat better. But when it came out I could tell it was a high calorie salad. But good though so I ate it of course.  The staff was very attentive and I found them to be very friendly too. I don't come here a lot but I may have to start. Especially for the chips, salsa and Beer!"}
{"text":"Strange thing...been going to Aliante off and on for the last couple of years.  Didn't notice until now that Cabo has been replaced by the Salted Lime.  I figured it was the same type food with the same \"just okay\" taste.  I was right and wrong.  Same type food, but Salted Lime is definitely an upgrade.    The Salted Lime reminds me of Pink Taco at the Hard Rock minus the crowds.  This restaurant has a bar on one side and the restaurant to the left.  With your meal you get a bottomless serving of chips.  These chips were airy, light, and fresh.  After after about 3 refills on our chips, we were ready for our main meals.  I got their beef chimichanga.  Because of the cheap price, expected a small bite sized chimichanga.  What I got was this mammoth of a burrito that was so good, crispy because it was deep fried, and juicy.  Who describes a chimichanga as juicy?  I just did and if you've had one from the Salted Lime, you would know what I am talking about.  I was a little disappointed in myself because for the first time in a long time, I did not finish my meal.  My mom didn't raise a quitter, but this was way too much food and quit is what I did.  Between 2 people our meals came up to $33, which is a bargain.    I don't frequent sit down Mexican Restaurants too often.  I actually prefer your small stands/joints that you find in California.  However, the Salted Lime has quickly changed my mind.  If I learned anything about the Salted Lime, it's come here hungry, prepared to eat, and don't over chomp on the chips.    PS:  Service here is great.  3 different employees stopped at our table just to chit chat and ask us about our meals.  Me and my boss (who happens to be a big Samoan) only ate half our meals.   Yes, the food portions were that big.   Sorry...no pictures.  First, I was with the boss.  Second, the portions were so big a picture would have killed my phone's battery."}
{"text":"Came here for happy hour for my 21st birthday! We sat at the bar & got the $4 margaritas. They are huge! But so good. Also ordered some food. She brought us the chips & salsa & bean dip. Omg best bean dip ever! I ordered a cheese quesadilla & it was really cheesy & delicious. Would love to come back for Taco Tuesday & more bean dip & of course, more margaritas!!"}
{"text":"Five star service! Waiter was great, food was great. Never an empty glass. The bean dip is actually pretty amazing and highly recommend the beef fajitas or shredded beef enchiladas. Will definitely go here again. Thanks salted lime for the great dinner this evening."}
{"text":"Arrived at the salted lime. Table of 4 adults/3 kids. Place was half empty but they refused to seat us! They told us they didn't have enough staff to accommodate us! I have never in my life had a restaurant turn me away like this. I guess they don't like money or customers. It was completely ridiculous. If I could rate 0 stars I would."}
{"text":"Have been here twice. The first visit the waitress ran to receipt for a 20% increase expecting a tip on top of it. Manager tried to tell us it was only ran for the amount on bill but had bank account open and it had not been. The second visit was not much better.  Bill was correct but service was terrible had to keep waving down waitress to get items.  Had to wait almost a half hour to get receipt.   On a positive note the food has good flavor."}
{"text":"Great Service and awesome Margaritas!! Judy rocks! We come here weekly just to see her and enjoy the atmosphere!"}
{"text":"Great place to hang out before a concert. Very good Margarita and at $4 during happy hour, just can't beat that!"}
{"text":"First time here. Hostess took our names down at 730pm and we did not get in until 830 even when we were told it was only a 30min wait. They had cleared tables but would not sit anyone because the kitchen was so backed up. The food was not worth the  wait and it took a while for us to get food. Carne asada was dry but the hostess was real nice. Thanks but we will look else where next time"}
{"text":"Yuk.  This place is garbage.  I did not like it when it was Cabo and I still think it's crap.  The one star is for the excellent service.   The beef enchiladas had a awful tasting red sauce that needed to be cleaned off in order to make the enchiladas edible.  Menu stated it was supposed to be green which it obviously was not.   The pollo ranchero was supposed to be a braised chicken. It was actually grilled because it had the burn marks of being on the grill.  Tasted O-K.  But wasn't worth going back for.  The beans and rice weren't nothing to write about either.  The service from our waitress was outstanding.  She tried to make everything right and threw in desert freee of charge.  The chef told her that the problems with the food were because the menu has so many misprints. I'll stick w/ Roberto's taco shop for mexican around these parts."}
{"text":"of course this place is far from authentic. its in a casino in a massive suburb. as long as you can remember that then its just fine. its a great place to sit down score dos xx, happy hour $2.50 tacos that are pretty decent and free chips and salsa. the margaritas are $5 and surprisingly good. the nachos are more about quantity over quality but they do the trick. I will say the service in the restaurant sucks so try to sit at the bar."}
{"text":"The food was amazing. I got a three course meal for $15 along with some of the best bean dip and salsa ever. The queso dip grows on you and its well worth the money. I highly recommend this place!"}
{"text":"Our friends suggested The Salted Lime for dinner, having been there many times, so we were virgins, but my margarita certainly was not.  The illuminated sign outside the restaurant that rotates through the menu says  Happy Hour is all the time, so when our waiter came for our drink orders, I asked if I could get the HH margarita pricing.  He said he'd get me one, as long as it wasn't frozen or flavored.  No problem, since I'm a straight margarita kind of girl.  It was in a nice, big Mexican goblet, and was pretty tasty.  The usual tortilla chips graced the table, along with a warm bean dip, excellent green dip, and dark and earthy brown salsa.  None were overly spicy, but good nonetheless.  Only the tortilla chips weren't winners, since they were overly salted.  The restaurant's special for the evening was a chile relleno stuffed with shrimp.  I was sorely tempted, since the waiter explained that this was NOT breaded and fried.  How rare is that?  But I passed.  My husband started with a big bowl of tortilla soup.  It was thick and full of chicken and cheese, but not enough spice.  It cried out for some avocado, but I think Vegas chefs skipped that lesson in chef school.  It was a hearty soup, though.  Our friends suggested that if we got fajitas, we should share, since it's a very large portion.  I'm often skeptical, remembering years ago when very old Great-Aunt Ethel treated me and my then-husband to lunch when we visited her in Florida; she insisted we share a sandwich, because they were so huge.  Needless to say, we dropped her off and went to find a restaurant.  But this time they were right.  Our friends ordered their fajitas with carnitas, not often a choice at most Mexican joints.  I wanted that, too, except I was sharing mine with Mr. Chicken, who only eats pork in the form of bacon.  So we got a chicken/shrimp combo.  I tasted their carnitas - tender, lean, and yummy.  Next time I'll get my own.  But I can't complain about ours.  There were four perfectly-cooked large shrimp and a whole mess of tender chicken.  The accompanying sides were the usual refritos, rice, and FRESH guacamole, still with its chunks.  The one nit I have with this place is that they charged extra when our friends asked for more tortillas, and us, too, when I wanted mine corn instead of the flour ones that came with ours, as per my husband's request.  Not a dealbreaker, just unusual, especially for a place that is very reasonably priced.  Aliante is quite a distance from where we live, so I'm not sure when we'll get back there again.  But I know that it'll be on a Monday, when they have whole meals for six bucks!"}
{"text":"Went there today for the first time. The service was excellent. The waiter filled up our water very frequently and everyone was very friendly. They started us with complimentary chips and two kinds of salsa (both very good) and refried beans. I ordered the fish tacos and they were delicious, all ingredients were fresh and the sauce that came with the tacos was amazing. My husband had the burrito and a beef taco and was also very pleased."}
{"text":"I have mixed feelings about this Mexican restaurant located inside of the Aliante Hotel & Casino. I tried the cheese enchilada and chicken flauta. The cheese enchilada was very tasty. I got it with the green sauce and this was also very good. The chicken flauta was overcooked and the meat was dry on the ends. I did enjoy their iced tea, which was freshly brewed. I also sampled the house margarita. First, it took a very long time for the margarita to come. It was also not that great. It tasted like they used bar mix instead of fresh lime juice. It also tasted watered down, possibly to compensate for the larger size. A Mexican restaurant should always use fresh lime juice as a standard."}
{"text":"Bar was not crowded. The short brown hair female bartender could not handle the crowd. She looked stress of the crowd which was not that bad. She took our order & it took 45 mins to get our bar food. Tacos were old& tortilla was hard & food tasted awful. Don't eat here. Drinks are ok one star is too much"}
{"text":"Been here twice thinking that first time was just a fluke... apparently not. Ten minutes sitting at a table with my wife before acknowledgement by any of the staff. Ordered drinks and were served chips and dip. First basket of chips gone before a beer and a glass of wine were served. Ordered appetizers (2) and waited. 22oz beer sipped down to 1/4 glass by the time the appetizers arrived. Wife asked for another glass of wine and I apparently was invisible as I was not asked or served another beer.   Asked for corn tortillas to be eaten with the appetizer and by the time those (3, 5\" tortillas) arrived (after reminding the waitress we needed them) the appetizer we were gonna eat them with was cold. Since we had not tried the appetizer in question before hand, when the tortillas arrived we noticed it was burnt to the plate. We skipped dinner there and paid the bill.  Just an all around bad experience and we will not be back... ever... as in not in this lifetime."}
{"text":"Stopped by to try something new. We sat at the bar and service was slow. The bartender wasn't very personable and seemed to rushed to even take the time to listen to what you wanted to order. They give you chips and a salsa trio when you sit down. The green avocado salsa was awesome. Tried the carnitas street tacos, wings and cucumber tajin all of which were delicious. Had a cadillac margarita which was better than most places I've tried. They have happy hour drink specials all day. Will definitely be going back."}
{"text":"The machines are decent with a royal progressive on quarters (which I've hit couple times).  Salads are fresh. Hot wings are large and fresher tasting than bdubs, portions are good size all around.   Cocktails are free while playing a machine.  Taco Tuesday's are good for the price."}
{"text":"When I first arrived here it just was to find a seat to wait for my friend to arrive. Once I got seated I was excited to see a special for a pacifico and a shot of Patron for $8. When the bartender (Nancy) greeted me I was pleased to see she was happy to comply and get my shot and of course the beer but wanted to make sure I wanted that first since she didn't want my beer heating up. I ended up ordering the most delicious Margarita I have ever had after I asked her recommendation it was this delicious spicy watermelon mango drink. I thought I took a photo of the menu but after three drinks in I think I somehow forgot so I can't tell you the name EXACTLY but its a 10$ drink that is so delicious...It tastes like the type of Watermelon Aqua you'd get from a taqueria but it had a salted chili rim and tequlia... My favorite part of the whole experience was that I got good SERVICE with a smile! that happens less and less these days so I would recommend giving this place a try if you are at Aliante or in the mood for a good Margarita..I know I will be back soon because I LOVED my drinks..."}
{"text":"I am currently here. They have a teacher happy hour once a month. The place is brimming with teachers but they won't let us sit in the dining area. Call me crazy but shouldn't you be flexible and accommodate the clients?  When you advertise something, expect a turnout and be ready to keep the people happy. Our party had grown larger then the 3 tables we went to move to lower tables, which our waiter said we could do, the manager came over and said we could not and the server was wrong. She said we could not move unless we were no longer going to participate in the happy hour.  There were no diners waiting, just wall to wall teachers. This is the 2nd time I've been to this restaurant and the 2nd unfavorable experience."}
{"text":"Food was good, margaritas were terrible. The worst part was when we got the reciept. Getting ready to figure tip when we noticed that it was already ran for  20% above the ticketed amount. Which could have been her tip but since it was already ran for that amount we went for signing the reciept for exactly the amount on the reciept no tip added. Manager saying that it was ran for the amount on reciept not what our bank was showing. Keep an eye out for the scams."}
{"text":"Leaps and bounds over its predecessor, The Salted Lime is a welcome addition to the new Aliente.  My wife and I decided to dine here with some reluctance since we did not care for the former restaurant \"Cabo\" very much at all. But we are glad we took the chance. The new menu is pretty cheap and relatively simple with your normal American-Mexican fare such as burritos, tacos, chimichangas, flautas, etc... When we sat down they have us a basket of chips and three salsas. A salsa verde, a picante, and refried beans (ok not really a salsa). All were quite good. For dinner  I had the beef chimichanga and let me tell you, it may be the best chimi I've ever had. They didn't use typical beef but birria which if you don't know, is beef that slow cooks in a broth with peppers, onions, cilantro, etc for 4 hours or so which makes the beef very savory and tender.  The chimichanga was fried perfectly. Usually it's a big greasy mess but here it was very lightly friend and added a nice crispness to it. My chimi was accompanied with beans and rice which were fine, about as good as beans and rice can be I suppose.    To drink I had a big ol 36oz beer. My wife however, first ordered a margarita which was pretty tasty. It seems like here in Vegas they tend to go a little heavy on the triple sec but not this one was nicely done. Her next drink was a Coconut Lime Margarita that was innovated in house by one of their bartenders. I was skeptical as I don't care for sweet drinks but this was good! Not sweet at all!   So overall we had an excellent experience here and we'll be sure to come back often. I give it 5 stars cause it was excellent service, great prices, and surprisingly good food. Tip- Sit in the bar area and you can order off the restaurant menu as well as the bar menu which includes super cheap little apps."}
{"text":"No waiting for table.  Server (Tiffany) was awesome very outgoing and great attitude. Food was great.  Highly recommended.  Will definitely be coming back. Prices are reasonable."}
{"text":"Tried it again same result. Staff is nice, friendly, but food quality is poor. Manager helped but since this has happened several times and we don't like to have to ask to have great food preparation every time, it's not worth it."}
{"text":"This review is strictly for the bar area only.  I've been here a couple of times for their happy hour and have not been disappointed. Although I haven't tasted any of the food, the margaritas are always great and customer service is fantastic.   Next time I'm in, I'd like to try some of the food and be able to update my review."}
{"text":"Not very good. Wasn't horrible but I don't think we'd come back. Service wasn't very good. Seating was awkward the chairs were uncomfortable. You get 3 salsas and we didn't like one. The entrees were just okay."}
{"text":"My husband and I ate at The Salted Lime for Cinco de Mayo with some friends. We came around 5PM and were immediately seated.   Chips and salsa are complimentary, which is always a good thing at a Mexican restaurant. There were actually three dips: a spicy red salsa, a salsa verde, and a bean dip. The chips were warm and crunchy and the dips all tasted pretty good.  I ordered a bean chimichanga which was humungous. It wasn't made as I requested (I asked for sour cream) but overall it was still good. My husband had the nachos, and he didn't have any real complaints either. The food portions are generous and relatively inexpensive. The Margaritas were only $4 and served in generous portions as well.      The reason why I'm rating the restaurant so poorly is due to poor service. Our waitress lacked personality and was extremely inattentive. My husband waited 15 minuted to get his beverage. After reminding her, she said she would comp the drink. This was a positive step, but she quickly backtracked any progress by virtually ignoring us thereafter. We had to ask twice for anything we needed help with. She never cleared a single item from the table either. When the check came, she mixed up our orders and charged the wrong checks to our cards. Ultimately, it took us 45 minutes to flag our waitress down to get the check and finally pay and leave. We spoke to the manager who barely apologized, but sent us off with 3 bottled beers for the inconvenience.    The food was good but not great, and the service is horrible. We definitely won't be coming back!"}
{"text":"This place is great. Don't know why it's only three stars. We've only been to the bar so maybe it's on the restaurant side. Food is good especially for the price. Taquitos get the taquitos and the carne asada fries are a good grab too! Street tacos are okay lol. Nancy the bartender is great too she makes her own drinks and is very attentive. Love this place check it out well the bar area for sure. Good food great drinks!"}
{"text":"We went out to eat at the salted lime in Aliante casino tonight and we had a great waiter and the food was excellent."}
{"text":"This was our first visit here last week and both the service and the food were on point. We went around dinner time right before a 7:30 movie showing and we were sat quickly and attended to in a very timely manner. I guess we were lucky to not have to wait long since it seems as though that is the chief complaint about this place. The server was very efficient and friendly. The atmosphere is about what you would expect from a large Mexican restaurant, very upbeat and festive. My wife had the pork carnitas and I had the chicken enchilada. Yeah, not very adventurous, I know. But these are staples that any Mexican restaurant should hit out the park and if they can't get these right, then there's no reason to try any of the specialty dishes. Well, it did not disappoint. Very tasty, well cooked and presented. The carnitas is probably some of the best we've had, not over seasoned (and trust me, we're Puerto Rican so we love ourselves some seasoning). Tender, not too saucy and the rice was on point. The enchiladas were so good I wanted to take some to go but we had a movie to catch. The service was great, the establishment is clean and happy, the price was right. On the matter of long waits, like I said, we didn't have to wait long this time but now I know the food (at least the carnitas and enchiladas) are worth the wait for me. I always urge people to understand that if the food wasn't good, the waits wouldn't be long. I'd rather wait knowing I'm going to enjoy my dinner than to have a short wait and bad food. These meals are made fresh and that takes longer. How long does it take you to make a meal like that at home? Overall a great experience and we'll definitely be going back."}
{"text":"Great service from the hostess to the servers and bartenders ....good food starting with the three dip chips and salsa and  you must try the carnitas plate and the Diablo shrimp they also have the best Blood Orange Margarita I've had."}
{"text":"TheSalted Lime is a restaurant prior to Boyd gaming taken over was open daily, but now only open on weekends, however the bar is open daily in the evening. At this point I would give it 4 stars based on my experience.   My wife and I went there for taco Tuesday where they have $1.25 per taco (Carnitas only). I will say they were pretty good, tasty and had good flavor. Due to the bar being full, they opened some of the restaurant tables to serve people. We also got the chicken tacos from the regular menu as well which were also pretty good.   One thing is during the week is the limited in the bar, hours are limited which is something that seemed to happen after Boyd took over. The staff are pretty nice and do a pretty good job taking care of patrons.   All in all, a nice local place to hang out, have a few tacos and a cold beer. One thing I wish is that regardless of the hours, they would have more variety of food choices available."}
{"text":"Food is good but terrible terrible service. The manager was taking a personal call on the work phone when we walked in and there's not a staff member in site with my husbands empty glass. I had higher hopes. The friendliest person was a girl named Odyala or something."}
{"text":"Nancy is the best. She is so sweet and always quick with the drinks. Love the service. Great food and drinks! Me and hubbys favorite spot !!!"}
{"text":"Not enough beer options and the so called bartender doesn't know how to make a Manhattan.  Her attitude was ok, but not really that friendly."}
{"text":"My husband and I went for the first time last weekend and we were pleased. He ordered a shrimp burrito and I a taco salad. He ate everything on his plate and I could only eat half my salad because it was huge. We both ordered margaritas. Mine was blended and didn't seem to have any alcohol and his was on the rocks and it definitely had alcohol. We had a great local date night. The taco salad is crave-able   We will go back."}
{"text":"Awful place chips and dips are always complimentary at a Mexican restaurant. Poor service.  Portions are small. Took 2 hrs for dinner on a sat night and we were only people in there"}
{"text":"You would think that if a place is only open 3 days a week the food would be awesome..... well it's not. We've been here 3 times, each time a little less impressed than the last time. It's just food, nothing great or special about it at all. Sitting here forcing myself to eat red sauce that taste like pasta sauce. The chips and dip where the highlight of the meal. 3 strikes your out....thanks but no more for me. Service was not great either."}
{"text":"Daniel was a gem of a server. Awesome care and help to support my son's food allergy needs. The food was spot on and management was attentive to the overall experience. Definitely will return! Thank you Daniel for everything!"}
{"text":"Shout out to Daniel for the awesome service! He kept the drinks and chips filled and was friendly. Best service we've had anywhere in a long time! Fajitas were yummy and not too greasy. My hubby had a combo meal of taco/tamale/enchilada. He said the cheese enchilada was his favorite of the three. Our teenage son ordered the tacos and liked them, albeit a little on the spicy side. Both of them were too full to even finish their beans and rice. We will definitely be back!"}
{"text":"I went to this place on a Wednesday evening at about 7:30pm. There were only a few customers there, and we were seating immediately. The waitress brought our complementary chips and three different dips - a bean dip, a green salsa, and a red salsa that had a smoky taste to it. All very yummy! I actually got fairly full off of eating chips and dips. Our waitress was very friendly. When my friend asked her to sing about the different sauces they had available, she opted to just tell us while she did a little shimmy dance. I ordered the regular bean and cheese burrito, which was massive. Even though I ate a lot of chips, the burrito was so good, that I ate over half of it. My friend got the three taco meal. He said he really enjoyed. Then we got dessert. I ordered the sopapillas...delicious. I couldn't eat them all though. He got the churros with ice cream. The churros, alone, were good, but the churro - ice cream combo wasn't that great. I'm not a fan of vanilla ice cream though. When I went, the food was good; the service was good; and I will be going back."}
{"text":"Went to the salted lime and had there house margarita which was on happy hour for 5 bucks, ordered a chop salad, and there chicken burrito which was huge. Everything was delicious be careful with the chop salad when ordering the spicy ranch dressing if you like hot you will not be disappointed its full of flavor. Will definitely be back very polite fast service and decent prices here."}
{"text":"I have absolutely nothing bad to say about this restaurant! Warm, inviting, amazing customer service! And the food!!!! Oh lord, the food is phenomenal! I had the steak fajitas and they were the best I've ever had! Also, I'm not a huge fan of beans, but the bean dip you get with your complementary chips and salsa, I'm a huge fan now!!! Looking forward to going Christmas Eve for their Christmas special! Shrimp tamales and pumpkin flan here I come!   Update -- by the way, the Christmas special was AMAZING!"}
{"text":"Loved that there was no wait at 7pm (I realize this should have been my first clue but I was starving)!  Liked the chips and the 3 salsa platter.  Our waitress was nice but she did disappear for quite some time.  Disliked that our food came out wrong, charred and some things tasted as though they had been previously frozen."}
{"text":"great flan. I'd come back in just for flan, and maybe the guac.  come for the flandney brought me chips and salsa and bean dip right away, but I didn't see anyone after her gain for over 10 minutes, which I thought was odd, since the restaurant was not busy at all. I ordered the guac app, which took approximately 15 minutes to come out, and the bacon wrapped shrimp, which were another 5 minutes behind the guac. the red salsa was bland, and looked a bit more burnt than I like. the bean dip was good, but nothing special. the chips, unimpressive.my beans and rice... the rice tasted.like store bought, the beans were brought out on a separate plate and we're cold. the worst part though, was that even with as long as the shrimp took, they were painfully undercooked. the manager offered me a free dessert for the undercooked food, so I tried the flan, which admittedly was pretty good.  service 2/5 (slow though cheerful) food flavor 1/5 (guac was ok, bean dip ok) food temp 0/5 (cold food, undercooked food) value 1/5 I could say 0, but had the food been good, the value would have been decent.  I'm a guest of the hotel for 2 weeks, and I've stopped and looked at the menu several times but passed it by, worried the food wouldn't satisfy me. my meal ended up being comped, which was nice, but I think I'd still stay away from here next time. lovely restaurant, great vibe, but in the end, the food just wasn't good."}
{"text":"When I saw a prickly pear drink on the menu, I was sold! We stopped here en route to a comedy show at Access Showroom.  The bar also has gaming, so hopefully that drink would come with a big video poker win.  I love the name, I love the decor, loved the drink! Well, one of the drinks- the spicy margarita! Very good. Skip the prickly pear paloma, it was too sweet. My friend really was impressed with their White Russian, and thought it was a deal at $6.   For the main course, I had the chili relleno entree, which was a special request by me after seeing it mentioned on yelp. It was fine, but not great. The chips 'n salsa were pretty good, and theirs includes bean dip- always a great addtion to the meal. The decor is a bit upscale, with a centerpiece tequila bottle chandelier over the bar. I liked the gaming area at the bar and there are also seats available at the bar without machines. Nice place to stop before a show."}
{"text":"I really love this restaurant.  They have the best refried beans.  The shrimps taste sooooo delicious.  The enchiladas have a green sauce instead of red which is ok, I do prefer red though.  Service was great.  The margaritas were soooo delicious, don't miss their happy hour.  I also like that all restaurants at Aliante are never packed.  Wait time was under five to ten minutes."}
{"text":"So the four stars is because the kitchen got my order wrong but the 2 bartenders that were working the early dinner shift made sure it was made properly. Our waitress was a skinny tall c younger women who had a really unique name (sorry i cant remember) But she was lovely when  i came back in with my togo order as soon as she saw me she came to me and accommodated me. She had a good attitude. I love posole and there's was delicious I have now been back three times for it!!! so good soothes my cravings!!   Take outs are only at the bar and they do not let you call in your orders. which sucks for a local like me who doesn't want to sit down in the restaurant."}
{"text":"Came here for Taco Tuesday as they offer some of their tacos for $1.25. The tacos were decent, ordered carnitas and the meat was very tender and shredded. I ordered some alcoholic beverages as well, and went for the classic jack n coke. The chips, beans, and salsa was decent.  Service took quite a while, which negatively impacted my experience. I hardly saw my waiter and waited more than 45 minutes from ordering to finally receiving my food. Drinks were quickly given, though.  I'm not sure if I will come back again, as there are many other authentic Mexican restaurants in the valley that offer good quality and quick service."}
