{"text":"Good service and hot, tasty bar food.  Nice, clean and great beer varieties for a dive-bar type of place."}
{"text":"Slightly horrifying.  I think I've seen pictures of my parent's basement having the same chairs in the 70's.  There was a 40 year old woman with short spiky blonde hair singing Karaoke.  
A beer is a beer though.  
I got the perogies, I think they were on special.  They were actually really good.  Beware though, the cottage cheese ones have cinnamon in them. Yuck.   
It's Brunswick, you can't expect too much more.  I'd probably go there again."}
{"text":"Worst place in Brunswick. Only for a \"select\" group of locals. Terrible service. Terrible food. Spend your money in any other Brunswick establishment then this one"}
{"text":"The owner is what wrecks this place.  I stopped in with a friend and it was clear she only cares to have her friends and cronies patronize the bar.  Sucks because this place could be a decent hole in the wall.  To be fair, they do have a good burger but make it very clear you are not welcome if you're not in the owner's clique."}
{"text":"Beware!
Unless you are a dirty biker type, you will not be welcome."}
{"text":"Interesting.  Weird.  Fun.  Slow. Tasty.  Experience this one for yourself!"}
{"text":"If I could give this place half a star or zero stars then I would.  A few others commented on how disturbingly unfriendly and unsanitary this place is and I could not agree more!  The ONLY reason that brought me into this twilight zone of a place was a coupon.  The owner or lady who seemed to run the joint snatched it up and the \"specials\" menu and made sure to scare the living crap out of us.  The water tasted like something scooped out of the dirty dish sink.  Someone was smoking behind the bar.  There was NO ONE in the place except for us.  I don't know why we didn't run rather we asked to have our food to go and made up some excuse about getting an emergency call only to be told to go orders as NOT ALLOWED.  Uh okay.  Time to peace out and we did so.  Hysterically, the lady said \"was it something I said?\".    We took our business and appetite (what was left of it) over to the Grille in Brunswick (where we should have gone to in the first place but coupons make me happy) and we told the bartender about our terrifying experience.  He laughed at us in a Vincent Price like voice and said he's heard this before.  I still get the creeps just thinking about that experience.  You have been warned, people."}
{"text":"I bragged about this place to a buddy-great bar food amazing bison burgers, complimentary snacks and good beer selection.  We went there a couple of Saturdays ago for lunch.  The waitress appeared to be a customer who got up from her barstool and came to our table.  I said \"hi-can we get menus?\"  She replied in a surprised tone-\"you want menus?\"

We ordered two beers and she returned with menus then  brought our beers and returned to her perch at the bar with her friends.  She came back about 5minutes later and we ordered some wings(I was very disappointed the bison burgers were not on the menu ). Also MIA were the complementary popcorn and peanuts for snacks.  Our wings arrived fresh from a deep freeze with some hastily tossed hot sauce on them- no celery-no blue cheese-no flavor!   After 3  wings went down the waitress yelled from the kitchen \" you want more beer?\"  Thinking this was her system I yelled back\" Yes please!\"  But she was yelling to her crowd at the bar.  One of her friends heard me, got up from his bar stool and brought us our beers.  The other customers here are polite.  While still working on our second round the waitress/patron-returned with a bill, declaring she was having trouble with the register and yells\"you gonna put a tip on this?\"   ( I gave her credit for moxie and being an over achiever!)

I can only assume the bartender was called away in an emergency and left the place to be run by the customers. The food was not good-(I realize this was just one visit-after all,  beers were fine -I am really not trying to be critical just honest.  I was disappointed in how this place has changed-"}
{"text":"What a joke this dump is. Microwave Chili. Well-done, dry hamburgers. The Pepsi was awful - pretty sure it was not real Pepsi. Will never eat here again."}
{"text":"Don't expect to walk into an e.4th bar here, but why would you? Its a blue collar joint with good people, cheap prices and tasty bar food. Ample space in the bar area, nice size outdoor patio. Completely unpretentious with a nice local bar feeling."}
