{"text":"My husband and I stopped in for dinner on  Saturday night and both really enjoyed our food and the service was excellent. Will definitely be going back again. The only thing I would recommend is that they change their hours and be open on Sunday's.   *updating my previous review from last month. My family came in for dinner tonight and I was hoping for another positive experience, that wasn't the case. First off, it is freezing cold inside the restaurant we kept our coats on the entire time. Second, the service was incredibly slow and we were seated right away, they weren't very busy. The worst part was when I asked if they had any vegetable side I could order with my burger. The waitress offered fried green beans as the only vegetable side so I ordered them (planning on removing the breaking). When the bill came I was charged $8 for the side of fried green beans!!! Which was more than my burger cost! After this experience we most likely won't be back."}
{"text":"Food is way way overpriced for what it is, 80's hair metal and pop country was turned up way too loud at 8 pm.  there is much better food in the area for a better price."}
{"text":"Great food and service, in a sports bar setting."}
{"text":"Used to be pretty good, now they eliminated 1/2 their menu.  The Wings are \"good\", not great.  None of the sauces have real heat.  Don't for see them lasting a whole lot longer."}
{"text":"This is the best place to get Wings locally, in my opinion. My youngest is a picky eater and he loves this place. The only negative, the service can be a little slow."}
{"text":"Food is decent. Menu keeps changing....obviously different cooks and food vendors too.  They appear to be struggling to compete with JTs ..... but they will have a much more difficult time if other dives start popping up.  Used to have best wings around, although I get the sauce on the side because otherwise they would get soggy..  But for the price per wing they better figure something out because those tiny things aren't worth over a buck a piece! Used to be gigantic but now they are way too small for the $.  The veteran bartender makes one hell of an old fashioned and if you drink enough of those the food and the prices are much less of a concern"}
{"text":"Not only are the wings absolutely delicious, but the staff and customer service is out of this world!  My friends and I had called in a fair-sized order of wings (50+).  The folks assembling the order had made a mistake and shorted us some wings (it happens) and we didn't notice it until we got home.  A simple phone call, the nice lady who answered must've apologized a hundred times.  They not only got us our wings, they offered to deliver (we picked up anyways) and ended up prorating a refund to us AND giving us a gift certificate. (so much more than we ever asked for)  All company's make mistakes.  Great company's make amends.  The Wingery is a great company.  We will absolutely eat there again!"}
{"text":"If you like fish they have the best here!  Friday nights they have all you can eat walleye. I don't usually eat fried food but the breading is very light and slightly crispy and its served fresh and hot. The coleslaw and fries are good too.  It's a great way to wind down at the end of the week with a good meal. They also have $1 drafts on Wednesdays. In nice weather it's great to sit outside and listen to laid back music on a nice night."}
{"text":"The Wingery is nestled on I-47 between a car dealership and the grade school. I haven't been her for a couple years, because I usually do not eat in Mahomet for lunch. The menu is different than the online menu because they have not updated it since it was posted a couple years ago. That threw me off a bit.   I ordered 6 boneless wings in the Raspberry sauce and the waiter offered bleu cheese and ranch. The sauce was pretty a mild sweet and did the wings justice.   When the check came, I was a little surprised. They charged me 60 cents for the bleu cheese and 60 cents for the ranch. I thought it was complementary with the wings and didn't think anything about it. That is $1.20 that I wasted on sauce because I don't like sauce with  my wings. I think that the waiter should have told me this and everyone else for that matter because my friend and I could have at least shared. My friend paid for the uneaten sauce as well.   It's not that busy during lunch; we got in and out within the hour."}
{"text":"We visited here a few falls ago, hoping to use a mobile certificate for 50% off. Though the certificate said it could be redeemed via mobile, when I presented it at the establishment I was told they would only accept printed copies. I explained that certificates that were print-out only had special instructions that their coupon did not have, I was still not allowed to redeem. Eventually, through a review I wrote, I was promised a gift card to come visit the restaurant again. We called ahead twice to ensure it would be there when we arrived, and it never was. Eventually, I was offered to have the gift card mailed to me, provided my address, and it was never received. I had taken down my original review hoping to re-write it after a second visit (the food was pretty good, the beer list was decent, and the atmosphere was good for watching a game), but it slipped my mind when we never got the gift card back. Now I see they're offering the promotion again, so I find it necessary to address this again. I think the owner probably just wanted to offer the gift card elusively until we eventually went away, and don't trust the business!"}
{"text":"The atmosphere is good but the service and wait staff leave alot to be desired. The food is average at best. Not a fan."}
