{"text":"I liked my thin noodles and beef short ribs. The broth wasn't oily which was good. The tofu snack was ok, but not a must-get.   I thought the shaved noodle was slightly too al dente for me but overall it was fine.  There's a Presotea inside but I didn't get anything this time.  Ordering from and iPad was easy and convenient for those who don't speak Mandarin. The menu is available in English and Chinese."}
{"text":"I first came here with the BF about 2 weeks after they first opened back in Sept. I remembered remarking about the lack of combos the first time here. Came back with the family about 3 weeks ago, and am happy that they now have a combo!  Their Special Combo, when you order a Soup Noodle, an Appetizer, and a Medium Presotea Drink, you can get the appetizer and drink both at half price. But only if you order all 3. The half price will not be seen on your ipad order, but will appear as half price on the bill. I think if you wanted an appetizer or a drink in the first place, it would be a good deal. Fried Noodles, do not apply for this deal according to our waitress. I have noticed that the prices of the soup noodles have increased since my first visit, which is probably to compensate for the combo deal.   The first time here I got the Shaved Noodle Dan Dan Noodle and the Fried Seafood Shaved Noodle to share with the BF. The Dan Dan Noodle was a soup-less noodle. It had some bean sprouts, cucumber, ground meat, parsley, and a little bit of tahini sauce. The noodles at the bottom of the bowl got really gummy because it was probably placed in the bowl right after boiling, so it was still hot. Overall I found this dish really bland. So bland I almost didn't want to finish it, which is saying something, because I'm known not to waste food. I ended up dumping a lot of vinegar on it and finishing it. The Fried Seafood Shaved Noodle was a lot better. I think stir-frying is possibly my favourite way to order shaved noodle now. It had a lot of flavour, but was a bit oily, probably to prevent the noodles from sticking to each other. It was good, but being so oily you might not want to finish one all by yourself.   This time we got the Fried House Special Shaved Noodle ($9.99), Small Traditional Hand Pulled Noodle ($7.99) Small Braised Pork Hand Pulled Noodle ($7.99), Beef Pancake ($5.99, Half priced to $3), and Medium Earl Grey Milk Tea Family Tea ($4.99, Half priced to $2.50). We only took advantage of one of the special combo since my family wanted to try the fried shaved noodle I was talking about and we didn't want too much food.   The Fried House Special Shaved Noodle was really good again. Although I feel it might be even more oily this time. Still I would order it again to share with people. You can choose for it to be spicy or not. The hand pulled noodles were good, but was slightly overcooked, so it lacked the slight chewiness I liked about them. The broth for both the hand pulled noodles were a bit salty, so don't drink the broth. They gave you a lot of Braised Pork which were pretty big chucks, but a bit too fatty. The sliced beef in the Traditional noodle, was sliced nice and thin so it wasn't tough. I liked this one more than the braised pork noodle. The Beef Pancake came sliced in 4 per order. There was a good amount of beef and sauce in it, but i didn't like that the pancake part was over fried, making it hard. The Earl Grey Milk Tea Family Tea was good, your average milk tea. I've had it before at Chef Papa and liked it, so I ordered it again. It's good that you can actually choose the sweetness and ice level here as well. Although I feel like the medium cup is a bit more narrower than when I got it at Chef Papa, I wonder if Presotea changed their cup size.                 The seating is comfortable here and the place is clean and modern. This is another decent place to eat if I want both noodles and bubble tea at the same place, or hang out a bit with people after we eat."}
{"text":"The beef ribs noodles and the house shaved noodles are good - everything is cooked perfectly and the noodles are well made.  Fresh tasting ingredients I will definitely come again"}
{"text":"Open til 5am!! Even though I barely eat late anymore, its always nice to find places that are open late incase I am in search of some food.   The Bowl Noodle bar offers hand pulled noodles. You can see the chef through the window, making your noodles as you order. I love the hand pulled noodles here. Chewy and delicious.   Aside from noodles, they also offer a variety of side dishes as well as Yogen Fruz and Prestotea Bubble tea! One stop shop, works for me.   They give you an iPad to order with, the menus in both Chinese and English. Very simple to use and it sends to the kitchen right away. Most other places with iPad ordering systems take the iPad after you order and input it for you into the kitchen. This is the first I've been to where it's do it yourself. Very convenient.   The only downside is that post meal I've been quite thirsty - which usually happens after I eat too much MSG. Ah well, I'd still go back."}
{"text":"I tried The Bowl Noodle Bar today and liked it. I ordered two different noodle dishes. Unfortunately that was a mistake as one dish would have been sufficient. I was stuffed. In particular I enjoyed a shaved noodle dish very much. I enjoyed the bubble tea. I found the tablet menu quite easy to use.   This type of Chinese food is new to me; however, I would describe it as Chinese comfort food.   I will be back."}
{"text":"The first thing I noticed was the incredible environment! Modern design with amazing Asian flair, what an incredible place. Also VERY roomy!  For a Saturday dinner time, only half the dining room was full. But then again, from my understanding this place is fairly new. It's right in the Silver Star plaza, about one or two doors away from Destiny.  The fiance and I were greeted with smiles, and quickly seated. We were then handed an iPad (always cool) to order off from. While ordering they were quick to place our lemon water down, in fancy glasses I may add. The menu is very simple and easy to navigate so I appreciate that.   There's quite a few food options, but from what I can recall, I don't remember a side dish menu, it's really not coming to me. Because I would've honestly ordered from it. You get the choice of fried noodles or soup noodles. I thought I would change it up and get the fried noodles. I had ordered the beef fried noodles and the fiance had gotten the szechuan spicy noodles. Also with bubble tea for the both of us. Mind you, it costs an extra dollar to upsize your bubble tea size.   The one thing I really liked about the iPad menu ordering was the customization of the food options you chose. For example the noodles, you can choose if you want it to be spicy or not. For the bubble tea, you can choose what kind of topping you want and also the sugar level etc. Kinda like Chatime!  You then look over your choices, and hit send and off your order goes into the kitchen! Very cool! It might be obvious though that I've never done iPad ordering at a restaurant before.   While waiting for the food, I found myself admiring the beautiful decor even more. There's always something exciting in every corner. The place is impeccably clean, and I love how you can watch the chef's through a window making your meals fresh. Even down to the bubble tea corner was spruced up and modernized!   The one thing that made me uneasy is the wait staff tend to kinda ... Stare. Not in a creepy way, but in the \"I am ready to help you\" way. I don't know if it's because iPad ordering may be new and difficult to navigate for some people or the fact the place wasn't as rammed and they were just looking for something to do. I guess great customer service, but it was a little bit irritating watching a wait staff watch you eat.  Food came out fairly quick, as I would assume with any noodle place. The flavouring of my beef fried noodle was spot on, and I would for sure order it again. I was a huge fan! I'm kinda kicking myself in the butt for forgetting to take a picture of it.The beef was tender and the noodles were fried to perfection. Super delicious! The beef to noodle ratio was good also, tons of beef for you to munch on! My only complaint about the dish is that it was literally rained on by way too much green onion, fried onion and green peppers. Those ingredients alone kinda drowned out the noodles and beef which should've been the star of the dish. But again, very tasty.  My fiance on the other hand wasn't a fan of his Szechuan chicken dish. I had tried a little, and the seasoning was delicious, but there was something about the chicken. It tasted too ... Chickeny? I don't know how to put it. It's almost as if it weren't marinated with the dish (which it shouldve been to absorb the flavours) and it was just thrown in there in the frying process. All in all, the chicken just couldn't absorb those super flavourful flavours. Which was a down vote for me. And just like my beef plate, his was drowned out also by the sheer volume of green peppers, fried onions and green onions. It's good to have in a dish, but it was a bit too much.  Another thing was how slow our bubble tea took to come out. I was already 3/4 done when it finally came out. Which kinda sucked, because I kept looking over to the bubble tea corner and there was just a lot of standing around over there. Maybe they get the iPad orders a little slower? Or some kind of delay? I don't know.  My overall experience of the place was good, not perfect but what restaurant is right? There was this one guy that stood out to me though, telling by the way he was dressed I could only assume he was the owner of the place. He was up front and centre of the eating area with nothing but sheer professionalism on his face ready to serve. You don't get to see that a lot, and I can tell he wants nothing but this restaurant to succeed. So it was quite refreshing. I recall him going over to another table and happily helping out when they were having a bit of trouble ordering off the iPad.   I 100% will be coming back to this place, but will be trying the soup noodles. And hopefully I will be able to find the side dishes (if there even were any). I will update my review till then. But for sure a must try!"}
{"text":"I got the tomato beef hand pulled noodles. Yes, they are hand pulled noodles so will not be all equal widths. However, this led to undercooked noodles. Beef brisket were tiny cubes that were slighter bigger than the size of dice.   The three of us that got hand pulled noodles were almost finished before the sliced noodle arrived. So they need to work on timing of dishes arriving.  We also got the beef pancake. Very doughy and salty not a lot of beef. This was supposed to be the appetizer, but it arrived last.   Considering this is a new establishment, they have a lot of room for improvement."}
{"text":"Food: 8/10 -- Value: 7/10 -- Service: 8/10 -- Ambiance/Décor: 8/10  Their special combo includes a noodle, half-price appetizer, and half-price prestotea drink.  Food is alright. I had the beef brisket noodle ($7.99) was not bad even if the broth was a tad on the oily side. There were a lot of noodles; too much for me to finish. Taste was a little bland. But the second time we came by, we ordered the preserved veggie beef noodle ($7.99) and \"pita bread with lamb\" soup ($12.99). They were both good. The lamb is a bit weird, though. The \"pita bread\" which is the \"noodle\" of the soup, are these cube like things with a strange texture, almost like they're not fully cooked or a little powdery. It wasn't a nice feeling but the soup was good.  The hokkaido bubble tea was really big for $3 (50% off $5 when you order it with noodles and an appetizer + $0.50 for tapioca), which is a great deal. Not quite as good as the hokkaido I had from Sharetea. The matcha milk tea and red bean slush were better. Not too sweet for my tastes and a noticeable matcha flavour.   Their appetizers range from $3-$6, which isn't bad when you get it in a combo at half-price. We had some type of spicy ligament skewer, which was average but skippable. The green onion cakes were a bit powdery for my tastes, but the beef pancakes were quite tasty.  Service and food are both quick. Economical as most Asian places are, but I like the option of ordering on an iPad because you can see the pictures, even if the system isn't the most polished."}
{"text":"Decided to try this new noodle bar for lunch as it looked quite busy. I like how you order with the iPad; your order should be made the way you ordered, no excuses. Tried both the ramen and the shaved noodles. Definitely go with the shaved noodles. The ramen was a bit soggy to my liking and not as chewy and tasty. Also, they can definitely work on making it more presentable. Overall, it was a decent portion of noodles and ingredients and the broth was pretty flavorful. Worth a try!"}
{"text":"Ambiance/decor-5 Service-1 Food-3 Strikeouts-1/3  First thing you notice about this place is the design of this restaurant. For a bunch of restaurants lined up in a plaza, you would not expect to see the amount of thought and effort put into the place. The made the surrounding area colour even match up with the utensils. The two side walls are notworthy and definitely artsy. Simple, yet impressive.  The service was really bad on thanksgiving day. Should I be surprised? They claimed to have several people away, and only had 2 waitresses for the whole restaurant. Luckily, they run on an Ipad service, which is clearly noted by every other review. Problem is, with so many people, mistakes are bound to be made. This is a strike, for actually forgetting the main dish for my uncle.They had a special where you buy one bowl of noodles, you get half off a drink and a side dish.  Ordered 12 items, got 9/12. Two being two presto drinks missing. They actually dropped our two drinks, and it took them forever to find out what drinks they dropped (even though they are labelled) and who they belong to (my table). This restaurant definitely needs some work here.  Some other yelper made a good point, the food here is all second rate, but the convenience for comboing, makes this place just that much better. The bubble tea appeases the young generation, and the yogen fruz is something the older generation can tolerate if they want something sweet. The food here is overall okay. Can't say much about it. It's definitely not terrible by any means, but it doesn't shine like a star. Not cheap, but not expensive.   If you happen to be in the neighbourhood and can't decide what you want to eat? Drop by here for a quick bite!!"}
{"text":"The bowl noodle bar is one of the new shops of the plaza. Walking in, the restaurant was bright and had a mini bubble tea shop in there which also sells frozen yogurt. It looked like one of the hip places for teenagers slash young people to visit. Arriving in, they will give you a cup of water with half a slice of lemon in it.  We were seated right away, and given an ipad to place our orders. They had a limited selection of noodles, small snacks, bubble tea and frozen yogurt (Yogen Fruz). A bowl of noodles is around $7-$9 for a small, and an extra $1 for a large, which is equivalent to adding noodles for $1 in my opinion - so get the large if you can. You can select if you want onions or not as well.   They have a special where if you purchase noodles, an appetizer and the presto tea, the presto tea and the appetizer are half off.  In the window, you can see that all of their noodles are hand-made, the ramen, the thick noodles where the slice it off. To pay for something like that nowadays, is definitely more worth it, than going somewhere knowing that it's machine made noodles.  The food came SUPER quickly. Expect a lot more noodles in the bowl than additional stuff such as meat and greens. The thick noodles were roughly the same size, definitely really appreciated that it was hand made, so you're going to expect them to be slightly thicker than the ones that are machine made. The ramen was really delicious. The soup was mediocre, I felt that the soup for the seafood thick noodles was way better than the ramen soup base. It also wasn't hot enough.   For an appetizer, we got the beef wrap. I though that they used way too much tendon in this, didn't put a lot of ingredients in it, which made it thin and small for what I remember to be $5.99 (a price around there) for four tiny pieces. It was not worth it at all.   Come here if you want to meet up with friends, for bubble tea and noodles, but not really with your family for Chinese food."}
{"text":"I admit that I'm picky with noodle places,and the reason I picked this place was because they have one of my favourite bubble tea shops (presotea) inside. I love this 2 in 1 concept (bubble tea bar +noodle bar),also using a tablet to place your orders (eng/chinese),service was just o-k,most of them don't speak english,but I guess they don't need to if the tablet does the job already. In terms of the food,I had the minced pork \"dry\" noodles, no soup eventhough they indicated this item in the \"noodle soup\" column on their menu. The sauce on my noodles was a bit bland,I had to add tons of chili oil & vinegar to bring out the flavour. Overall experience, not too bad for a place that just opened last week, I see lots of room for improvement and I will come again to try an actual noodle with soup in it."}
{"text":"Below par noodles Awful awful bubble tea. This place has a presotea inside the store which is so garbage. My bubble tea was watered down and tasted like flour and sugar.. Watered down flour and sugar.  Other Presotea locations are much better.  Just give me $5 and I'll serve you some delicious flour water."}
{"text":"Since my first review back in October, I've been there another handful of times. Since then I\"ve tried a few other noodle options, but I tend to like ordering ones that I\"ve tried and liked and stick to it. But here are some of the ones I tried and my thoughts on them:  Pork Ramen/Shaved noodle In terms of noodles, it really depends whether you like ramen or shaved noodles. I loved their shaved noodles. something about the texture just really appeals to me in general, and they cooked theirs a bit al dente so i really like the being able to chew my noodles (don't get me started about pasta not being cooked al dente). Anyway I love their pork. I'ts pork belly and it's braised in a thick sauce, which is usually mixed into the broth. Overall I find their broth quite clean, not too salty, which is good coz it actually allows you to taste your food, unlike a lot of other asian places where they seem only know soy sauce, miso and MSG. Because their broth has a cleaner palette, it allows you to actually taste whichever ingredient you chose for your noodles. Anyway, this is one of my all time favourites, for people who are coming for the first time, I would recommend you to try this because it's almost like their 'signature' ingredient.  Braised beef Ramen/Shaved noodle Again, noodles are based on your own preferences, I like both of them actually, their ramen also has very good texture as well, but my preference is still over shaved noodles, but for those who do like ramen, definitely give their noodles a try. Anyway, back to braised beef. For those who like beef shank, ;you would like this. This almost reminds me of the braised beef noodles that I had in Taiwan before. The meat is slowly cooked, giving it the tenderness, moistness that is known for braised beef, and when you eat it with the noodles, the meat just softly falls apart. LOVE. I also really like the sauce it's been braised in. They don't put a lot of that sauce into the noodle, but that's perfectly fine because the braising process allows the beef to absorb all the flavours anyway. I would say this is another one where you would want to try as your first time here at the restaurant.  Chicken Mushroom Shaved noodle My finace ordered this because he wanted something lighter, so I did give it a try. For those who don't want such BOLD flavours when eating ramen, and seriously, once in a while, esp when you're feeling a bit under the weather, I find this would be the perfect option. It's lighter and cleaner in taste, the chicken doens't have a very bold flavour either, but just seasoned enough (though for me I found it on a blander side, but people who have a blander palette would appreciate it). They use chinese mushrooms, which is great, because I LOVE chinese mushrooms. Their flavours are much bolder than fresh mushrooms, so people who like mushroom chicken steamed rice, or at least that type of palette, woudl like this options.  Dam Dam Shaved noodle For those who like dam dam noodles, the restuarant only serves this in the shaved noodle option. Generally for people who like the dam dam noodles, this is great :) I\"ve ordered it twice. Both times i love it. The flavours are super bold by the way, so make sure you have some water on the side! The only suggestion would be that i wished their peanut sauce wasn't as thick, slightly more liquidy would've been PERFECT, which you could do by asking for a bit of hot water - i add it in myself and then i'ts the perfect texture. otherwise it feels like you're eating noodles with peanut butter. it comes with bean spourts and cucumbers, which is a nice mix with the noodles along with some preserved vegetables and minced meat. YUM. Great choice for those who don't want soupy noodles.  Appetizers: Tofu - i love their tofu, but the only thing I would complain is i find they put too much suace on their tofu and it kind of overpowers the whole dish. I like mine spicy but they have nonspicy option too. Green onion pancake - the first time I tried it back in October, I didn't like it as it lacked onions. HOwever since then we have given it another try and it's now a regular app that we order every time we eat here :) The kids we eat with also love them!! ther'es lots of onion flavour, comes with 8 wedges for 2.99. the texture is nice and crispy. LOVE. Grilled squid I love squid, so I have tried this. those who like grilled squid woudl like this as well! They do have two options, one for the upper part of the squid and one with just tentacles.  Ambience is nice. Ther'es lots of seating so if you have a big group or even kids, i'ts a great place to eat. They also have a BBT prestotea shop inside along with a yogen fruz. their teas in general are quite well made - this brand is from Taiwan after all. I\"ve tried the matcha red bean and their milk tea with grass jelly and both of them are well liked :) The milk tea I find i like better than chatime only because i find the chatime one a bit too milky. You order from an iPad!"}
{"text":"Newly open noodle joint. Spacious with modern look and a fair amount of seating. Serves Presotea along side with noodles of course. Once seated the waitress drops down an tablet to order food with. She then starts showing us how to order with the tablet in Mandarin. I don't speak a word of Mandarin so we just nod and let her finish. I tablet was easy to follow for ordering. I really don't see the point of using a tablet unless it was used to avoid communicating with customers in English or Cantonese which I think is the majority language in Markham. I believe all staff there are Mandarin speaking but they do understand English so it was no big deal.   On the menu they advertise the noodle as ramen but its actually hand pulled noodles. Ordered the beef rib with noodles at $7.25 + $1 for big bowl. The noodles were fresh hand pulled noodles. I thought the noodles were a bit overcooked so they had a slight soggy texture to them. The beef ribs were very flavourful even though they were in the soup itself. The portion of beef ribs was pretty decent. Some pieces had too much fat on it.  Also tried the Intestine noodle at $7.25 - good amount of meat and the noodles were the same as mentioned above.  Also got a passion fruit lime basil seed drink from Presotea at $3.99 - a bit sour and a bit sweet. Tasted okay but next time I think I will stick with my iced milk tea.  Overall, a decent hand pull noodle joint."}
{"text":"After reading mixed reviews, I decided to check out this place. It's a cool concept to order from iPad and the decor was very clean and welcoming.   On a Saturday evening at 6:00pm, there was one table occupied and it was pretty empty. The server gave us lemon water but it was room temperature and we had to ask for ice. She at first did not understand and we had to explain it to her more than once.   Ordered the Chicken and Mushroom noodle and Eggplant noodle - both in the small size. Each cost 8.99$ and if have the option of \"customizing\" or adding vegetables for an additional 1.50$. I also ordered the Pearl Milk Tea with less sugar for 4.99$, this is Presotea and there is option to customize similar to ChaTime.   The noodles were unappetizing. Nothing to rave about as the texture and taste was nothing special or unique. The eggplant was minimal in comparison to the photo on the iPad. The broth was bland - tasted similar to chicken broth and filled with MSG. The consistency of the broth was \"creamy\" and lacked depth. So yes, it was salty and after 3/4 of the bowl I felt extremely bloated and uncomfortable.   The bubble tea was good but still not worth coming here just for this.   Overall, I will not be coming back. By the end of the night, my stomach felt very uncomfortable. So yes, location and decor is decent but the food is lacking in more than one way. For the price it was an additional disappointment."}
{"text":"Knife Shaved or Hand Pulled? What's the verdict?   Is it Ramen or Lamian?  For The Bowl Noodle Bar, I personally prefer the Knife Shaved. I just like the chewiness texture and how the noodle was cooked to perfect al dente.   Spicy Beef Brisket Knife Shaved Noodle ????? VS Traditional Lan Zhou Ramen ????  Noodles where both A-OK. But I was more interested in their snacks. Teppan Tofu ($1.50) was spicy and memorable. I would order that again! Shredded Squid ($1.99) was really tender.  To order off tablets was quite easy but there was still some confusion when food I did not order start appearing at our table.  I will be back for some Presotea next time too!"}
{"text":"Craving for some noodles I decided to drop by this place since it opened up not long ago. Had their special combo where you get an appetizer and drink for half price and pay full price for the entree. Ordered their hand pulled noodle and can't really complain as it wasn't too bad or anything of a wow factor. Soup base was good. Appetizers I had the beef roll which was a bit cold and small. Their bubble tea was okay as well. Wasn't too bad of an experience and will come back when I want to eat some noodles."}
{"text":"The best way I can describe this place is it's a combination of three places that are second rate.  The Bowl Noodle is basically a second rate version of Magic Noodle on SilverStar and McNicoll  It has Presto Tea which is basically a second rate version of Green Grotto/Gong Cha just on Steeles and Warden area  And it has Yogen Fruz which is basically a second rate version of Menchie's down on Steeles and Warden Area as well.  Sure it's not as good, but think of it this way... they are all in the same place and you don't have to move around.    The space is ample, and I don't see too much people.  Probably because most of them are waiting outside the door of Magic Noodle.  Which to be honest is still okay with me if I wanted to have some noodle without dealing with the crowds.  The ordering system is trendy using an iPad and all, but its still an app with poor User Experience (UX) by my standards.  Fonts are too small and sometimes wrapping inappropriately.  The discounts also do not get applied on the iPad just an FYI.  I have tried two of their soups so far: Tradition Beef Noodle and Beef Brisket.  The meat itself isn't too bad, it's not as tender as say Magic Noodle, but they are acceptable.  The soup base is a bit peppery, but I can tolerate it.  I would recommend you get the extra noodle, it is on the menu but you can't order it individually from the iPad, I had to request the waitress to add it.  The coconut shrimp isn't too bad, though it's a bit pricey on it's own.  I suggest you get it as part of the combo.  The Presto Tea isn't something too special, in fact I prefer ChaTime over it and that's saying a lot since I am not 100% sold on ChaTime yet.  However, would still be going there just for the room and meeting up with friends in the future.  Just won't expect much :)"}
{"text":"Decided to give this place a try for lunch since I saw it was recently opened. Don't come to this plaza on weekends though unless you want to wait longer to find parking spots. I got confused and almost entered the bakery right next door, because they had huge red signs posted at their entrance.  This restaurant uses ipad to order, just like ayce sushi buffets. Actually, the menu interface seems really similar to Yokohama at steeles and warden. Inside though is quite spacious, it didn't take me long to get a table and the decor is cute and chic. The waitresses didn't understand much English but I guess the ipad already did most of their work for them. They have Presotea options on the first page and even frozen yogurt for dessert on the last page. Just in case you didn't know, when you order your noodle dishes you can tap on the picture and they have \"hidden\" options to make it a big bowl (+$1), no onions, no parsley, etc.  Well onto the food, we got the pork handpulled noodles and the seafood knife shaved noodles. Not a huge variety so it was a good change of pace when trying to decide what to eat, because I can be quite undecisive sometimes. They gave us quite a big portion of pork, and the seafood contained a mix of shrimps, fish, and squid. On the side, we got lamb skewers and teppan squid for appetizers. The lamb skewers were quite juicy and delicious but the teppan squid was too saucy and had lots of spices on it. After sharing two big bowls of noodles and apps, we were quite full.   Overall, during the course of our meal there was almost barely no interaction (is that the point they were trying to get across?) with the waitresses and I noticed the manager (perhaps he was the host) just walking around and doing what looked like nothing.  I will probably come back if I have some cravings for freshly made noodles (and on a weekday)."}
