{"text":"I stopped in the Yardhouse one afternoon not knowing what to expect. But I was surprised. The service was good, the food was tasty and the beer was cold and fresh. They even have enough tvs to watch the game in comfort.
It's got some weird industrial theme going on, but it doesn't feel too dirty. And the food is better than I thought it would be. They also have a good location on 17th Street. I'll be back."}
{"text":"I was already a fan of Yardhouse after my visit to the Kensington location, however this Yardhouse location wins hands down!

Everything is as great as its counterpart location, however the reason this one is the *better* location is because it has a patio along 17th avenue!

In my review of the Kensington Yardhouse, I commented on how nice it would have been if the patio faced the street or if it made watching people walk by possible. The 17th avenue location of Yardhouse has this covered.

What's the long and short of it?
The 17th Avenue location has all the great attributes as its counterpart Kensington location, however it ALSO has the perfect patio ;) Happy summer scopin' y'all!"}
{"text":"Dropped by The Yardhouse after work yesterday as I haven't been there in over a year. I remember the food tasting delicious and they had wicked summer specials so I thought I'd check it out again.

We were seated outside on the patio which was great minus the fluffy cotton things that were flying around (I hate allergy season). Our waitress came to say hello, gave us menus and took our order in a very quick time which was impressive.

Where I feel improvement is needed is in how fast the food comes out from the time that the food is ordered. I didn't keep exact count but I do know it was anywhere between 35-45 minutes for the food to come out while there were less than a dozen people inside the restaurant and a few tables outside on the patio.

We had 3 different dishes, a penne dish, a tuna steak dish, the cajun chicken sandwich dish and an order of nachos.

The Penne dish was great, looked good, garlic bread looked fantastic as well, definitely a well made dish all around. 

The Tuna Steak dish could have been prepared/cooked better, would've been nice to have the inside of the tuna still red and not fully cooked throughout, the risotto was delicious and plating was definitely high end looking.

The Cajun Chicken Sandwich the bread could've been less toasted the edges become really hard to chew/bite. Chicken was good and everything else inside the sandwich was good as well.

The Nachos were sub-par, I mean for one thing it should have came out first before our meals, it's under the appetizers section of the menu for a reason. Also, there was barely any cheese visible on the Nachos, I mean I love Tortilla chips but having a huge platter of them without much cheese is kind of a waste you know what I mean?

Anyway, I definitely will be back here as I do enjoy the establishment and currently for summer they have a 50% off food from 4--8pm everyday plus drink specials everyday.

Hopefully some things change!"}
{"text":"This place was rather bitter-sweet for me upon my visit last night.

On the one hand, any establishment that offers a wing special wins points in my books (though I must say I prefer the ones that simply lower the per-wing price, rather than this \"100 wings for x\" system because those of us who DON'T always have a big group to go out with may have an issue getting through an order that size. The wings were pretty good... nowhere near the best I've had, but definitely not the worst. Most were pretty good size, and I simply would have liked a little more flavor... but all in all not bad. Another major selling point was the second server we had, after our group was moved when we ran out of space. She was an absolute delight, fast, friendly and VERY cute (hey, I'm a guy, so sue me!)

On the flip side of the coin: as I said the wings were a little light on the flavoring agents. The lemon pepper ones especially seemed very light on their namesake ingredient, the drink prices were more than high enough to still leave us paying more than a usual night out, despite the cheap wings, and the first server seemed had a rather sour disposition (never been so happy to be moved tables in my life) and seemed to resent me for being the non-drinker of the group.

Aside from the aforementioned everything was rather par for the course for a typical Calgary pub - if somewhat cramped (I'm convinced the number of people they cram into such a small location must violate fire codes). The decor was rather \"as expected\", the TVs were tuned to various sports events, and the music alternated rather frequently between the kind of songs you WISH you heard in places like this more often, to the type that seem to be encouraging you to drink more to drown them out, so it's pretty hard to give a grade there.

All in all, I'd say this is a perfectly \"acceptable\" place to spend a night out, but nothing I'd go too far out of my way for."}
{"text":"I wanted to try someplace new in Kensington so I dropped by.  Service was quick and efficient.  The food was meh.  I ordered the beef and sausage burger.  It was decent but very dry.  The fries were good.  I wanted to pelt people with them at the same time.

Okay, but forgettable."}
{"text":"After a long & busy summer it was time for the girls to get together for a couple hours to have a good gab session which included some bits, bites & bevy's.

We decided to drive down to Kensington to see where the wind would carry us.  We forgot the Film Festival was going on...the line up at the Plaza Theater reminded us of this as we drove around looking for parking. Fortunately it did not take long.

After wandering around we decided on beer & a pub type atmosphere which brought us to The Yardhouse.  We had visited the Uptown location in the past and felt it was a good choice.  It was getting close to 9pm by the time we got there and we were able to find us a decent table since there were several empty ones available.

The beer selection is not overwhelming and decent.  I was happy to see the bits & bites menu was simple and short...we ordered some nachos to share and were further elated to see the portion size of our sides (sour cream, salsa, guacamole) were large enough to share without chip fighting over the last bit of salsa.

The downside this night was the service.  After the waitress took our beer order and brought us menu's it became self serve.  Our waitress walked by our table a couple of times and made eye contact with me but never stopped to ask us if we wanted to order food.  There were only a few other tables around us so not overwhelmingly busy for her...plus she didn't really seem very happy either.   20 minutes later I got up and politely asked another waitress to send over our waitress so we could order some food and by this time more drinks.  She finally came by and we received slightly better customer service from that point on although it still could have been better. 

In the end the food was good, drinks were good, company was good.  A fun spot for a quick beer/bite."}
{"text":"You know that feeling when one of your friends makes a change to their appearance in some way, whether they got a new 'do or even a new pair of glasses, and you notice something is different, but can't quite pinpoint what it is right away? That's what I felt like walking into The Yardhouse earlier this week for lunch. It took me a moment to figure out exactly what had changed, the colours! The Yardhouse is now a nice vibrant green and the windows on the side have been frosted over. It's refreshing and boy has it ever brightened up the interior.

It seems a Wednesday at 130 is not prime-time lunch hour here. We were the only ones in the restaurant. But that meant we were the only customers for our server to dote on :). And she did it just right. When I decided that I was going to try the deep-fried burrito her eyes lit it with excitement! \"Good choice! It sounds like it would be greasy, but it really isn't. It's pulled pork deep-fried in phyllo and is soooo good.\" When my burrito came out, I took one bite and concluded that she knew what she was talking about. The burrito certainly wasn't greasy, in fact, it was nothing at all like I expected. Delicately flaky crust thanks to the phyllo, full of BBQ flavoury goodness inside with the pulled pork, and not a drip of grease or extra juices in sight.

Next time I'm trying one with a yardlong :)."}
{"text":"This is a great looking bar. There are at least ten plasma screens adorning the walls, each and every one of them showing sport. The bar sits in the middle of the room and you can be served on any section of its circular shape.

The spirit selection is impressive and with the tulip shaped long glasses the cocktails look very impressive. Even though I did not eat I perused the menu which had some exciting options ranging from salads to burgers. With a nice outside patio, inexpensive food and drink options, I would certainly be up for a long night at the Yardhouse."}
{"text":"Came here for the Monday wings special. They've got some interesting flavors including sweet chilli, dill pickle and garlic cheddar.   But I would stick to Sweet chilli and honey garlic as I found the wings dry with the powder flavors.

The patio was closed, but the interior was quite nice.  Not sure why they closed the patio on Monday night as I was not the only patron wanting to sit outside.  

The bartender was quite friendly but may have been over worked as there was only one server and one bar tender an there were about 8 parties in the restaurant   that required service.  It was a little hard to get their attention, but it wasn't so bad.

The funny thing is that when you are here for the all you can eat wing special, you can only order 1lbs of wings at a time.  Now this makes sense as some people order 3 pounds (roughly 12 wings/lbs.) and then they don't finish.  But this is smart on behalf of the bar.  In between waiting for wings, you drink.  And sometimes you order more beer waiting for your wings.  

Overall, it was ok.  Apparently, on Wednesday nights, you get 50 wings for $7.95.  That would probably be good if you came with friends."}
