{"text":"For what you pay for its not worth it. Service was not good at all. They served over each other food. Steak was tough an for the fish I got to very small pieces an not fully cooked!"}
{"text":"Just a note for the former \"Hilltop Inn\" fish fry addicts who might stumble upon this page.  The fish was good on opening day, claimed one of the folk who I spoke with.  He's a fellow who has eaten many a fish dinner previously at this location.  Definitely up to par, he said.  He will be back.  So feel safe and head out to try the new decor.  John was still cooking the fish, BTW, so you won't be taking a big chance on a new restaurant.  Jump in.  But do a bring a little extra cash. 

Me, I've been eating at this location since I was 10-years old or younger.  I'm 55-years old.  My dining experience was good and the people were friendly.  Many old Hilltop Inn folks were wandering in and enjoying themselves with friends they hadn't seen for a few months.  I hope this continues as things move forward.

Former Regulars note:  No more brunch on Sunday.  An all you can eat chicken dinner has taken its place later in the day.

An article published regarding the new owners, etc.:  http://www.nsarrow.com/story/2016/03/10/community/steve-and-vanessa-mckenzie-take-over-the-hilltop-in-cross-plains/1477.html"}
{"text":"Was so looking forward to trying the Hilltop Inn but was mildly disappointed! We waited nearly an hour for our food. The fried cod was undercooked, the baked cod overcooked. While the mixed drinks and beer were great, I'm quite sure my McMurray Ranch Pinot Noir was not as advertised. The coleslaw and cinnamon butter were super! Will try again, maybe an off night."}
{"text":"I have been here several times since the new ownership almost 2 yrs ago. Small cozy establishment, with a classic Wisconsin Supper Club feel. Always pleasant staff. You may have a wait on busy nights, but the food is well worth the wait. Having drinks at the bar the bartenders make you feel like a friend. The wait staff is always pleasant and go above and beyond to take care of what you need. The food that comes out of the kitchen is incredible with always amazing steaks. The prime rib special on Saturday is the finest around. It is always busy for the Fish Fry on Friday's with delicious fish prepared perfectly not skimping on portions either. There haystack onion rings are quite the conversation piece and taste even better. And the broasted chicken is the best I have ever had!! If you are looking to try something new The Hill Top is worth the visit!!"}
{"text":"Last night was a disappointment all around.  We registered at the front desk and were told there would be a 40 minute wait - long but not unexpected for a Friday night.  Others came in after us and put their name on the list also.  After an hour, we were still waiting, while most of the other people were seated.  Looking around the dining room, there were open tables they were not using.  This was frustrating.  After about 90 minutes, we were finally seated, almost the last ones on the list.  Once at the table, the wait staff informed us they were out of most of the Friday Fish menu choices.  Now that it is 8:45 in the evening and being way out in the country, we could not go to a different restaurant, so some of us chose fish from the remaining selection while our friends order steak.  The food arrive very slowly, the steak was overcooked and had to be returned.  When it was returned, she still could not eat it.  The fish was okay, but not anything special.  The choices of potatoes did not include baked - very strange for a dinner club.  Overall the evening was not positive.  This is one place we will not return to.  In southern Wisconsin we have so many great choices for Friday Fish. I would look elsewhere."}
{"text":"Stopped for brunch on Sunday - best buffet by far that we've had in Madison - if you like traditional foods like biscuits and gravy, fried chicken, mashed potatoes and gravy, fried shrimp, scalloped potatoes, eggs, sausage, homemade waffles, cinnamon rolls, salad bar and fruit!  Now going to try fish fry on Friday."}
{"text":"I will start by saying if I rated on service alone this place would be five stars. From the second we walked in the door to the time we left, the server and hostesses were all absolutely lovely. 
Unfortunately though this won't be a place I hit up again for a good WI fish fry on a Friday night. I was craving it bad but the place I really wanted to go to isn't super kid friendly, so I figured I'd give this a shot. I love a good old school supper club experience, after all!!! I had been told to go early as the place fills up quick - so we did (4:15) and there wasn't another soul there. Probably would have been fine to get a table for four at 5:30 still, but I didn't want to chance the wait as we had plans later. It seems as though the rule of thumb here is to come in, have a cocktail at the bar, and then go sit down in the dining room when ready. 
My discerning little foodies tell me their cheeseburgers were overdone and the Mac n cheese was standard Kraft fare. Beer list was so-so, a couple of standard crafts available. The alcoholic ice cream drink list looked awesome, but I didn't go there. 
The cheese curds were pretty average too but they did offer a couple of other dipping sauces outside of ranch with them.  The real bummer was the fish. The breading was bland and the fish was chewy, and dang it - on a Friday night (during Lent!) they should be doing better than that! I thought the coleslaw was too creamy with an overwhelming mayo presence. It all just felt like not a lot of effort went into it and was especially disappointing given that I was looking forward to a fish fry. Where's your favorite place for Friday night fish in the Madison area?"}
{"text":"Our family used to frequent this restaurant before \"the take over\", and while I understand changes, I feel that the increase in their prices do not substantiate their food!   I was so disappointed in the Lake Perch!  It was coated with beer batter; who does that?!?   And frozen green beans?!?  
Terrible food!!!!  Service wasn't that great either!"}
{"text":"Probably my new favorite find. We went on a Friday wanting to try their fish fry. Luckily we got a table right away(fyi definitely want to make reservations especially on the weekends). My husband got the ribeye and it was perfectly prepared med rare and I had the fried cod which was awesome. The sides weren't the best (fries and slaw), but that fish made me forget about it. Another note..really not for kids. We had our 3 year old and they don't really have a lot of options (it's our own fault because we didn't know what to expect since it was our first time). When we asked our server if there was a childrens menu her response \"Mac n cheese, tenders and fries or a cheeseburger.\" Obviously any of those will do just not the best atmosphere for kids. 

Oh I can't forget the delicious bread that we started with! Comes with a cinnamon butter...YUM. We will definitely be back. They have a giant alcoholic ice cream beverage menu I'm dying to try :)"}
{"text":"Went for the typical \"Friday Fish Fry\". The fish was excellent,  the batter light & not heavy at all. Two of us had the chicken carbonara, which was excellent too. It had fresh spinach & shaved parmesan. The portion was large & half came home with us. The old fashioned's were top notch too. Since the new ownership, there is no longer a salad bar. The prices seem on the higher side. Service was spot on & we were seated immediately around 5:30. By the time we left, the place was full."}
{"text":"This restaurant has a supper club like atmosphere, but the exceptional cuisine will make you think you're in a five star restaurant.  Just a short drive from Madison, it is definitely worth the trip.  The restaurant changed hands in 2016, and the new  owners stepped up the game with the quality of the food. (The steaks are amazing!!) The prices are very reasonable and the wait staff is efficient and friendly.  Before dining, we enjoy a drink at the bar, where you can easily rub elbows with other patrons and the owners as well!  You will usually find Caleb behind the bar - friendly, welcoming and he knows how to mix a drink.  If you love good food, from the soup to the dessert selections, add the Hilltop to your list."}
{"text":"Great wine list and excellent food."}
{"text":"This place is just fine. It's got a down-home atmosphere that is SUPER appealing. The wait staff all seem genuinely interested in the customers (if you like to keep to yourself, this may not be the place for you, but I'm into it).

Park in the back; it's a gravel lot. Go slowly when you pull in because the front door opens right out into the driveway.

We came here for Easter brunch on the fly, and they were so lovely to fit us in. The buffet was good - not the best I've ever had, but you've gotta give them credit for the varied selection of food. And it tasted good too.

I ordered a bloody, and it was nothing special but it sure hit the spot. I'm looking forward to coming back for a non-buffet dinner.

This place is just what you'd expect from an old Wisconsin supper club. If you want to frequent a spot where everyone gets to know you and other customers are comfortable chatting too, this is definitely the place for you.  :)"}
{"text":"We weren't expecting much based on reviews but we were pleasantly surprised. We made reservations for 5:30, but didn't actually need them. I even checked on our way out and we wouldn't have needed them at 6:30 either. 
As for the food, we went on a Friday so of course we had the fish fry. My husband had the perch with scalloped potatoes and I had the perch with a baked potato. When I go back I'll choose the scalloped potatoes, they were creamy and delicious - not that there was anything wrong with the baked potato. The fish was cooked thorough and was very good. The thing to note is the portion of the perch. We took home an entire portion! As many have mentioned the bread and cinnamon butter is a nice welcoming touch to dinner. 
We finished dinner off with a brownie and ice cream. I was expecting a scoop of vanilla on a brownie square but instead had moose track ice cream on top of a cakey warm brownie with whipped cream, caramel and chocolate sauce. We couldn't finish it!
All in all, this is a warm and friendly supper club. The servers were very friendly and it never felt forced. Our water was constantly filled and we never felt like we had to wait for anything."}
{"text":"Authentic Wisconsin supper club. Delicious food, great drinks, real wood paneling, friendly people.... and one unlit fire exit (so make a plan before you start drinking.)"}
{"text":"I had a really good experience dinning here for my first time. We experienced great customer service, drinks were never empty, and the food was delicious. Restaurants like these seem to be a dying trend around the area, I am really glad they decided to re-open this one!"}
