{"text":"Here for a business trip I needed breakfast to go by my hotel. Starbucks nearby had a big long line so I went here. Really surprised! Tasty, freshly made egg sandwich and a little fruit cup came out to 7 dollars. I will definently come here next time."}
{"text":"I am very disappointed in the changes that have been made recently to The Corner. I have been coming here once a week for lunch for the past few years. I will not be going back after today. 

I was upset by the special Super Bowl menu (with higher prices than normal) that they had a few weeks ago. But I figured things would go back to normal after the Super Bowl festivities were over. And they were last week. But I went in today to order my usual and the total was $3.00 higher than normal. I asked the cashier and she said they had raised their prices and revised the menu. At the new price point, I am better off going to one of the many higher quality, sit-down restaurants in the vicinity. The prices at a basic, order-at-the-counter, sandwich/salad/soup shop should not be the same or more expensive than a sit-down restaurant with actual china and tablecloths."}
{"text":"The staff is great. Always friendly, and quick. And this review has absolutely nothing to do with their service, because it's always great.  Food-wise, this place was so much better when it was \"Chloe's Corner.\" After it changed to just  \"The Corner,\" the quality of food went downhill. I always got Chloe's breakfast sandwich, which i absolutely loved. It was creamy and cheesy and just delicious. It's still on the menu at The Corner but it's not anywhere near as good. Lesser quality bread, dry, hardly any cheese, and the bacon is always burnt. There's a \"to go\" section, and I always grab items from it for lunch to eat back at the office.  When it was Chloe's, you could always find an array of FRESH sandwiches and salads from which to choose. Now, at The Corner, you're lucky to find 2 varieties of salads or a sandwich/wrap, and you can guarantee they're at least a day old, if not more. And a day old is no big deal when it comes to some things - you just need to be wise in your choice.  I just got a wrap from the \"to go\" section for $8.00 and it was pretty gross, and soggy, and quite obviously, not fresh. I also purchased a fruit cup for $2.50 and the pineapple was completely brown. The only redeeming item contained within this lunch was the \"shot\" of coleslaw they provided as a side with the wrap.  Literally - it's the size of a shot.  After today, I think I'm done with The Corner. Way overpriced for the quality of food you get. Please come back, Chloe!"}
{"text":"I didn't get a chance to try the food as there is a doughnut shop in the same building, however I got a chai latte and I'd have to say it is the best chai I've ever had!! It was refreshing and not overly sweet like a lot of lattes. The service was great and the manager even gave us recommendations for the doughnuts next door. 

The concept is really interesting inside. There are multiple coffee shops/cafes and you can pick and choose if you're with a big group. It's cozy and still large enough to host a busy lunch rush. 

Definitely recommend."}
{"text":"This is like the 4-5th time they run out of potatoes in the AM. Today I just decided I didn't even want to buy out of frustration this keeps happening"}
{"text":"The food can be good when they are not out of what is on their menu. 50 percent of the time they are out of what we want to order. We live local so very annoying! Service is good about 75 percent of time. Don't recommend unless very occasional visit."}
{"text":"Love the location especially when the ice skating rink is up and running. Sitting on the patio is pretty chill watching all the people happily skating around. Every time I have come for happy hour drinks with or without snacks, there is some kind of hassle ordering-- can't find wine, or glasses or how to ring it up on cash register, but I keep coming back because it is  a relaxing place to hang out without a ton of creeps--- it is what is is and for the most part it is just fine."}
{"text":"Huge fan of The Corner. Their menu is good (I love the turkey club sandwich with guacamole), the staff are super friendly, and it's in a great location. Perfect place to meet friends for lunch."}
{"text":"Went to lunch at Chloe's (sorry,  \"The Corner\") today and was extremely disappointed.  Haven't been here since the renovations and Super Bowl festivities rolled into town, and that may have had something to do with the uninspiring lunch.  The leftover \"Puppy Bowl\" menu they were offering was simply not good.  If this was my first lunch there, I'd probably never go back ($8 for that sandwich?! Please.)  Because I've had better, I'll go back again, but it's on probation in my mind.  Used to be one of my favorite spots for lunch."}
{"text":"All in all, the food was good and the staff was very polite and attending. Great, relaxing, enjoyable experience. 
Decently priced and a very unique set up within cityscape, The Corner offered a variety of seating options from bar to open table space that is shared with other vendors. I also liked the option of being able to choose sides, drinks, and deserts from a grocery type set-up prior to ordering my entree."}
{"text":"OMG! How have I not tried this before? Absolutely amazing menu selection! I tried the Caprese sandwich and it was perfect. Great customer service, quick pit stop for lunch to go and a beautiful refreshing atmosphere. Will definitely be back to try breakfast too, maybe even tomorrow!"}
{"text":"I love this place! Service is always great, food is always amazing! Clean and cozy inside and a nice little market with snacks and beverages."}
{"text":"The baked goods here are fabulous! The day old pastries are the best deal and are not to be missed. The pizza is usually good but is sometimes a little burnt on the bottom so all you can taste is that gross burnt taste. The salads are a good size. Iced tea is mediocre. Gelato is a nice treat- be sure to sample before committing to a flavor. The Flavors don't rotate- always the same.

There is a little grocery section with a good selection of food and beverage items. Sit outside during the nice weather for good people watching!!"}
{"text":"Tohle mam rad - misto, kde si muzu vybrat a dat na talir, co chci. O to vice ocenuji, kdyz neni mic casu a zaroven nevim co ostatni jidla v menu znamenaji ;-)"}
{"text":"Great food, every time i come, usually for breakfast sunday morning. The service is attentive, the food is cooked relatively fast, the people are nice. If it doesnt change, ill be coming here every sunday morning. Recommend: strawberry french toast!"}
{"text":"Great food, fun and quick service. It's got a bit of a hip and sometimes hippie vibe. Like a NYC coffeehouse. A bit pricey, but that's Downtown. Plus food is all fresh and to order."}
{"text":"Be VERY careful of the Clam Chowder served on Fridays!

I am a customer that visited this restaurant frequently. I went because I enjoy the clean appearance of the restaurant and their fresh food selections. I have returned often with co-workers to enjoy a light lunch with good food and very good service. I often make a point to stop by the restaurant on Fridays to enjoy a bowl of clam chowder because it is usually so rich and delicious. 

Two weeks ago Friday the chowder sickened me. The chowder was the only item I had eaten that day. Within one hour of consuming the chowder I became violently ill; vomiting uncontrollably and had non-stop horrible diarrhea. I was so sick that I almost fainted. I was terrified to leave for home because I did not think I could go that far without a restroom and did not wish to become sick in my car. The constant back and forth to the restroom literally went on until 5:30 that evening when I had totally emptied the contents of my stomach and finally felt as if I could safely make it home. I have never ever experienced such a violent response to something I had eaten. 

I wrote a letter (and included my receipt) about my experience and hand carried in greater than 110 degree weather to the restaurant to let them know about my experience.  I was met by a supervisor who was extremely defensive and informed me that if there was a problem with the chowder hundreds of people would have been sick because they sold a lot of clam chowder that day. I explained that many things could explain why people were not contacting the restaurant; the fact that the weather was consistently greater than 110 degrees that week, perhaps they thought it was something else they ate or they just didn't want to be bothered. Rather than express genuine concern and to apologize for my experience I had to hear about food handling policies and the way they operated. When I explained that I wanted NOTHING from them other than to look into it then she stated she was sorry. I waited TWO WEEKS before posting this experience to give them an opportunity to contact me and if nothing else let me know the issues was looked at with whatever the result was. Instead I heard nothing back from them at all.

Needless to say this was a horrendous experience and this incident has frightened me from ever eating there again. Use great care if you intent to consume their clam chowder."}
{"text":"Poorly set up for the super Bowl. Forgot our food, lost our drinks and then closed the bathrooms while we waited 45 minutes to get our check... Never again!!!"}
{"text":"Horrible processed turkey in the corner chop salad.  I can't believe they're serving this."}
{"text":"Truly enjoyed this coffee shop. i loved the industrial type ambiance, and even more, i enjoyed the mini farmers market type vibe they have going on inside. They have some gourmet snacks and jellies and little knick knacks which make nice gifts too. Their refrigerated area had pre-packaged cold brew coffee, raw food bars, and vegan snack options as well. I didn't get any food except a spirulina prepackaged snack when I visited but their salad/sandwich menu looked yummy too ( I will be back to try!!)
They were serving some select beers on draft, but since I was not in the mood, I ordered an americano. It cane out piping hot and was made with love, and to perfection. This is the type of neighborhood coffee shop you come to, to catch up with your girlfriends, or want to be a regular at.

I'll be back soon!"}
{"text":"I go back and forth loving and hating this place.  I wish, for the love of God, they'd just get rid of the Almond Brittle flavored coffee and offer a normal cup of regular coffee.  PLEASE, help me get back to loving this place, so I can enjoy my chorizo burrito without compunction.  Kelly keeps me coming back!"}
{"text":"Best salads in downtown! Great vibe. Most everything downtown has to be excellent, or it will simple fail with downtown prices being high. The Corner has competing prices, I get what I pay for, and it delicious. 
I look forward to it whenever I'm downtown."}
{"text":"The hot and cold food bar always gets cleaned out by 12:30 pm :( after lunch hour): I've only made it once or twice. When I did make it there early the food was great! I just wish they refilled and left it open longer."}
{"text":"Today was probably my last time going here, at least for a very long while.  I don't know why they can't leave menu items well enough alone. Seriously, please stop changing items on your menu that are perfectly fine, and if you do, it would be kind of you to CHANGE THE NAME of the item so that we know what we are ordering.  I'm tired of going here and ordering something I've eaten many times before, and getting my food only to find it has been altered in some way, usually not a good way.  Today it was the pizza special (margherita) - which now apparently comes with a balsamic glaze all over it (disgusting).  Absolutely gross, not to mention that my pizza is soggy from having this sauce all over it.  This also happened to me with their \"Italian\" sandwich which now comes with the same, awful balsamic glaze and a fat slice of fresh mozzarella (that is NOT an Italian sandwich, btw)."}
{"text":"My husband and son have been waiting over 20 minutes for 2 breakfast burritos...sorting at the counter even. No one has come back to check on them, nothing."}
{"text":"This place is always packed.  I love the create your own salad bar and the value is amazing.  My coworkers and I are in here for lunch most days during the week and absolutely love it.  The owner is the nicest man and so friendly.  He's always right in the mix helping out, which I appreciate a lot.  Yummy food, great staff, lucky to have this place right by the office!"}
{"text":"I love this place.  Food is great, coffee is great and the staff are some of the friendliest I have encountered downtown.  Their new dinner specials are a reason to stay late from work!"}
{"text":"I want to like this place more, but can't. I came here on a biz trip and was staying in downtown Phoenix and came here twice: once for coffee in the afternoon and once for breakfast. 

Pros:
+Cool atmosphere. I love the high ceilings and wood tables. Its spacious and inviting. But the music is a bit loud, especially in the morning.
+Good coffee. Better than that burnt crap from SB.
+Love the lunch counter/diner style as well. 

-Slow service, Inattentive and a bit ditzy. 
-Bad bad breakfast menu. Horrible. I know this is AZ but putting spicy mustard on a breakfast dish pretty much ruins your good coffee. 
-You will get some downtown riff-raff coming inside. IF the riffraff orders something, the staff will let them in. But seriously, you can't allow smelly riff-raff to ruin your good restaurant."}
{"text":"Fun urban space if you can find it open. Management should consider offering extended hours of service. Closes at 2pm on weekends?? Come on! I live downtown & have found it to be closed more often than open."}
{"text":"Service? What service? Scrambowl of burned and cold eggs, missing an ingredient with a side of cold sourdough toast. Waitress was more intersted in her silverware polishing project than us.  Asked for water and butter, but didn't get it until the 2nd request half way through the meal.  Watched the \"cook\" burn and throw away 2 pans of eggs.  He poked around one totally smokimg pan as if he was thinking of serving it.  The wife finally said something and they re-made my scrambowl. I have a personal rule against that and only went along with it since it was Mother's Day.  Still over cooked the eggs and was still missing the avacado that was printed on the order receipt, at least it was hot.

The kicker, there were only 4 customers including the 2 of us in the entire place!"}
{"text":"Stopped in for an afternoon hit of Java.  Not very busy.  So.......s....l.....o.......w.........   They must have had to go grow the beans, roast em, milk the cow (had a latte), and distill the water, and then make my drink.  I want to throw love to the noncorporate peeps out there, but I could have ordered a dozen drinks at the Starbucks around the corner.  Get it together people.  Product is good, service is lame.  Really."}
{"text":"We work around the corner and use to come here a lot for their salads. They have recently revamped their warm bar and it is TERRIBLE. Today I picked up the Beef and Broccoli (less than 1/4 cup) and it was disgusting. It seriously tastes like they made the beef and sauce then tossed in frozen broccoli. We will not be going back. 

Oh, mind you; less than 1/4 cup of beef and broccoli and 1 egg was $5.29."}
{"text":"Let's talk about the food. 

The menu is just straight up American. No, not that nebulous American (New) stuff I see popping up. We're talking great for sandwiches, pizzas, flatbreads (I love when a restaurant can differentiate between the two), and salads. I stuffed my face with a lot of stuff here, so let's talk about the good, the bad, and the ugly. 

The good: The pizzas are on point. Sure, the pesto gets a bit sloppy, but tastes great. And the tomato bacon variety is top notch, especially because they appear to be one of the few restaurants out there that actually puts effort into serving good bacon. I was very happy with that selection. Pair it with a salad. Doesn't matter which one, they're all really freaking good.

You know what else is cool? The huge to-go section, like a grocery store deli. If you can't sit down for lunch, you can just grab it off the shelf. There's a huge beverage selection as well. It almost makes downtown feel as though it's not a food desert. Prices are totally reasonable, and if their hot dishes are any indication, the quality makes Paradise Bakery look like Subway. 

The bad: Flatbreads are kinda lame. Salmon and capers make for a snoozefest with nothing else to really let it shine. The chicken variety tastes like someone really wanted to make a chicken salad sandwich and gave up half way through. I wouldn't go for these. 

the ugly: Nope, there is none. The worst I can say about The Corner is that only the majority of what they serve is good. Don't expect anything adventurous for your palate here, but rather the classics done correctly, and you'll leave satisfied. If I'm ever in the area for lunch, this is on the top of my list."}
{"text":"I got the tofu scramble. Came with spinach, red peppers and choice of toast. It was Huge! Yay!! But lacked flavor, had to salt, pepper and add hot sauce, but that didn't seem to improve the taste that much. I also got a side of potatoes, no beverage. Total bill came out to $11.37. My coworker got the egg sandwich, he said it was good. The place it really cool with communal type tables. You order at the cash register and they give you a number and bring the food out to you. Other option is \"full\" service if you eat at the bar. I am interested in trying this place again since their menu looks pretty good and prices seemed reasonable but I won't get the tofu."}
{"text":"Ok, so I was here with my son and some friends the day before Super Bowl, so I'm sure it was a little more crowded than normal, but the waitstaff were still friendly and helpful.  We just got stuff at the coffee bar to go and I was happy with the food.  Will have to come back to eat sometime."}
{"text":"I was so overwhelmed when I walked in.  I did not know there is a menu, a hot food area (scope and go) and a cold good (scope and go).  Since we were on a time crunch, I decided to get the hot food bar.  I pick a to go container and got:  pasta and meatballs, bread, and i think it was mac and cheese?  I got a pink lemonade.  The food was just ok.  They had made an extra sandwich, the server asked if we wanted it.  That was so nice.  Next time, I will try to order from the menu."}
{"text":"Delicious! I had the B.E.S.T breakfast sandwich and it was good. My boyfriend ordered the chorizo and egg breakfast burrito and he says it was the best breakfast burrito he had ever had. I tried it and I would agree! It came with a side of salsa which we liked so much we bought some from them to take home with us! Would definitely recommend it."}
{"text":"Simple but often healthy food. 

Parking: Street parking and meters around, or use the CityScape garage and get validated for free parking. 

Atmosphere:  Depends on the time.  It can be super quiet on a weekday afternoon, or super busy during an evening when there is an event near there, such as Meet Me Downtown.    

Service:   Quick. 

Food:  I have gone here a few times for the last two or three years. I like the simplicity of the vegetable salads and sandwiches.  Most people I have taken here can find something to eat as well (meat eater friends).  

Drinks: There are bottled drinks to order, or fountain drinks."}
{"text":"I stopped in the Corner with a friend while walking around and watching the ice skating. The Corner is a great fun place in CityScape. It's next to the ice skating so I'd recommend you check this place out when you need a break."}
{"text":"Neat little place to grab a coffee (or a beer) and a bite to eat. The doughnut menu is huge and an indecisive persons' nightmare. The friendly and accommodating staff make this place worth a visit."}
{"text":"I love this place. Cool environment, friendly staff, yummy food and always packed at lunch (hey! That's a good sign!) and they offer reservations through Yelp which is extremely convenient.
I love going to The Corner. It's always a nice experience."}
{"text":"Stopped in this morning for a quick breakfast, bad idea. Sat at the counter for 15 minutes. I must have been invisible because no one even acknowledged I was present. I can't comment on the food or coffee because I wasn't served. And I especially cannot comment on the service because there wasn't any."}
{"text":"We ended up here because they were open. That's the truth. We were pleasantly surprised because we hadn't even known they existed. All we had was a pizza and salad, some drinks. All fine. And we sat where we could just about grab the hats off skaters. But we didn't. I will try this place again when I am not in such a hurry. It's an interesting \"dinery\" sort of place. I can't complain about one thing..."}
{"text":"$13+ for lunch and they allowed a homeless guy to wander around and beg for change. A manager sat in his chair and counted out receipts while watching this guy walk around and bother customers and get aggressive. Even the subway across the street boots these guys out right away. For that kind of cash for a sandwich I wouldn't expect this to  be allowed."}
{"text":"This is the place to be.  Great sandwiches, salads, freshly made donuts, draft beers and the best staff.  Of you haven't been here, you need to.  Love you Lisa, that's for the great experience. (The Denver seven )"}
{"text":"I came to the Corner in December for a wonderfu;  event. And I was super pleased with the venue. The Corner is a wonderful place to  check out for a nice meal! I will definitely try this place out whenever I'm back in town! 

At this event, we had the option of trying out several foods they serve here. I really need to commend The Corner on their Southwester style salad. It was absolutely delicious and very fresh. I'm a huge fan of corn and avocados; both of which were both included in the salad. I also really like how their pizzas are quite unique, but still tasty. I'll always say yes if there is bacon on the pizza. I really recommend checking this place out. It is refreshing and seems pretty healthy! Happy holidays everyone!"}
{"text":"Stopped by to have a drink with friends on the patio to watch the ice skaters. We had a couple local drafts and \"cranberry mimosas\". Drinks were ok, but the girl hanging holiday lights around us was kinda rude. She even asked some people to move from their table so she could string up a row. Didn't even say excuse me when bumping a few other patrons. Could've found a better time to do this instead of a busy dinner hour."}
{"text":"The Corner is in a great downtown location. Smacked right in the corner of the Cityscape, so it is perfect for people who want something quick before going bowling, ice skating or attending a show. They seem to have a very limited list of dishes in the evening. The only thing available were the ones listed on the placemat menu. I wasn't wowed by the pizza. I thought it was a little too thick and not enough cheese. It was a good thing I ordered a bowl of tomato basil soup to dip the excess bread. I doused that thing with Parmesan cheese! Service was great and i was given a complimentary refill on my iced tea. Delish."}
{"text":"We went to the corner for the first time during a promotion they were running with city scape for the outdoor movie night. We ordered, and it took quite a while for them to bring us our bottle of wine, but the owner came over, spoke with us, and made sure we were well taken care of. The pizza was delicious, and the atmosphere was great. We'll be back!"}
{"text":"The food is excellent.  Great selection of salads and sandwiches.  I have had several selections off their menu, but so far the BLT is my favorite,  Probably the top lunch place in downtown Phoenix right now in terms of selection and food quality IMO."}
{"text":"I love this place! The service is always good. The food is delicious. The environment is chill. I live downtown and eat here at least three times a week. They have a variety of food to chose from and they make it fairly quick! I definitely recommend!"}
{"text":"This place is excellent. food is always delicious. Staff is always wonderful & helpful
Only thing I don't like is they don't do refills for ice coffee.. When it's 103degrees outside that's a bit of a bummer, other than that though the corner is my go to place here in DT PHX"}
{"text":"Coolest place on earth.  Stayed open because we had a large group.  Food is sick.  Staff is dope.  Giddy up!"}
{"text":"This place has the best slice of pizza in Phoenix. If only they would open more locations!"}
{"text":"No more. Been coming here for breakfast on weekday mornings.  The food is excellent. Female barristas at the wine counters where I usually sit not so much.  

They tend to pay more attention to the male customers from the courthouse--male lawyers.  Sometimes it takes awhile for them to \"notice\" I'm there when engrossed in conversation with their male clientele.  I've actually left without ordering on a previous occasion. 

But I'm a sucker for their excellent food.  Went back just now, was able to order, but once I received my food no one checked back with me to see if the food was ok, refill my coffee or anything.  Luckily someone had slapped the bill down otherwise I'm convinced is still be waiting to pay.  

I'm thinking service is better if you are male and look like you are part of the legal profession.  

No more for me.  There are other places I can try downtown and my prior calls to
Management have gone unheeded."}
{"text":"Buffalo chicken pizza was lit. Plenty of wine to choose from. Live Dj was killin it. I wouldn't sit by the register at the bar. Hella busy."}
{"text":"The corner knows how to throw a party! Amazing food! We're having the salad and flat bread! Fun atmosphere with a friendly staff! Large sinning room and close to all the action downtown Phoenix!"}
{"text":"First visit. I had pasta puttanesca and lemon butter asparagus from the hot bar and threw in some salad from the salad bar. It was very tasty and fresh. The receipt doesn't list the weight or price per pound so I don't really know how much my food cost. My estimate is my meal consisted of about 1/3 cup pasta, about 8 spears of asparagus and bit of salad with a dab of dressing and 1/2 an artichoke heart priced at $4.64. That's not a lot of food for the money. As I was not very hungry and wanted to try more than one thing,  I am happy. I want to come back again and try the soup,  coffee and baked goods other diners alluded to. This Thursday noonish it was swamped. I will have to come back later at off peak times."}
{"text":"Restaurant is very clean, staff friendly.  I was at location for Meet Me Downtown Phoenix and they are very accommodating to us. Adult beverages are ice cold."}
{"text":"I rarely give 5 stars and while part of me feels like I am being overly generous, another part of me says,\"Your here more often than most other eateries nearby.\"
It's my first choice for lunch hands down. Their salad and hot food bar makes it super easy to get quality, as healthy as you choose, food to-go or dine in. 
My favorite lunch dine in option is to grab a stool at the counter and order off the menu for full service. Or order at the register,  get your #, find a table and they will find you. 
It is so fun to sit out on their patio and people watch the CityScape crowds. A nice coffee, tea, beer or wine in hand and watch city life buzz around.  
My favorite items there:
- The salad bar of course.
- The meatballs off the hot food bar.
- The chicken strips off the hot food bar.
- Their BLT! 
- Their Spinach Salad.
-"}
{"text":"I love this place really great salads and sandwiches on a week day about 12-2 you can find corporate america swamped in here eating some good lunch! They even have an open fridge around the salad with  tasty and healthy snacks and drinks on the Go! Usually they have an awesome wine deal when you buy lunch as well:)"}
{"text":"I was prepared not to be impressed, but the Egg in the Hole Bagel Sandwich was dynamite!! This is a large open concept space with a small market, indoor and outdoor table dining, there is a Fractured Prune donuts inside and a Grabba Green smoothie shop.  

The sandwich was really really good, the service was a bit slow but I'll try this spot again for breakfast for sure . My boyfriend had just the buttered sourdough toast and orange juice which he said was a four out of five. He was more there for the donuts next door. Not a bad deal at $18 for the both of us."}
{"text":"I gotta give this place 5 stars for the presentation and thr taste of the food and fairness for price. Breakfast was priced right at around $8 and coffee was $1...AS IT SHOULD BE! I am from the east coast so I've been in many bakeries and delis and those ones are regularly filled with people that don't even speak English and you hope that yur food isn't cold and doesn't have cockroaches... this place is clean and beautiful and spacious. They have everything you need and seriously a great way to break the ice cuz let's face it Arizona has very very little food culture... IT'S TIME ;)"}
{"text":"Arrived at The Corner located at City Scape on Friday night at 7:15. There was a crowd of people (hundreds) milling around and also on the skating rink. We wanted some coffee and a baked good to nibble on while we watched the skating on the ice rink. We were denied because they were closed (closing), others were also turned away. It was a Friday night, it was First Friday, the ice rink was open until 11 and they close at 7. How sad is that. sorry but I can't patronize a restaurant that closes ridiculously early on a Weekend Night especially when there is activity going on in Downtown Phoenix. That left our only choice Starbucks which has old high calorie baked goods and frankly not the best coffee to my taste. Actually no coffee place in Phoenix is open at 7 p.m. except Starbucks. So The Corner should take advantage of this and stay open. Will I return when they are open, doubtful."}
{"text":"The Corner is a great fun place in CityScape.  If you are tired from some ice skating or need some pep in your step to ice skate or enjoy a fun night, I would recommend coming here.  

I came here on a Yelp event and found the people extremely friendly and accommodating.  The feeling inside was cozy and warm. The food variety was excellent. I would come here again."}
