{"text":"Portions are large and prices reasonable . but it has the same problem as graceful veg and lotus pond. you can't get any raw vegetables with your food. and all the dishes are quite carbo high. Vegetables in general are a very small part of the dishes, even cooked"}
{"text":"Duck noodle soup-Absolutely delicious 9/10 Fish ball noodle soup- The fish balls are weird but nice noodles 7/10  Amazing huge portions.  Weird service from staff since they talked with food in their mouths.  Overall they were still kind,yummy huge portions of food and a cheap eat.   Would recommend for take out."}
{"text":"I think this place is the best! I don't buy it anywhere else. Mind you there is probably msg it's still good to me"}
{"text":"3.75 stars.  Must try:  -#3 Deep Fried stuffed bean curd skin with Yam Small $4.25 for 3 rolls(6 pieces) and Large $7.50 for 6 rolls (12 pieces). It's heaven if you like fried foods and taro/yam!  Most other food are decent."}
{"text":"Good value and taste. services was ok but the serving speed was fast. Have been there a few times, it's a good place for veggie food in Scarborough :-)"}
{"text":"This is my first time at a buddhist vegetarian place. Came here for dinner because of a friend's recommendation. Initially, I didn't think this place would be that good because in my mind I thought this place probably only serve plain tofu and vegetables. But to my surprise, there were so many variations that can come out of tofu. Many dishes were very saucy. They had great flavor too."}
{"text":"The stafs have no respects for the customers. They were talking loudly to each other about eating all kinds of meat. Do they now that it's a vegetatian restaurant? They all gave me a very bad sense when I looked at them.  The food was tasteless and there were only a tiny bit of ingredients in a plate of fried rice. Will never ever go back. No wonder they were so empty."}
{"text":"Really liked this place. I agree with another reviewer the veg dim sum was delicious."}
{"text":"Highly recommend this place. They manage to serve vegetarian without sacrificing flavor nor variety. Feels like a family bussines run by hard working people. Give them a chance next time you are hungry and around the area."}
{"text":"I've been coming to this place since I was a wee lad. Nothing's really changed. It's not stand out but it's always serviceable. Standouts include their spring rolls as well as their great mock beef with pepper sauce and flat rice noodles. And of course, their vegetarian platter plates are always welcome. We get them at least once a year!  For a full review with more pictures and descriptions, feel free to check out my blog, conveniently located on my profile page!"}
{"text":"This place is great.   When you order \"dim sum\", it's really not the usual dim sum that you find in most Chinese restaurant, it's actually a platter of different flavored tofu, tofu sheets, and gluten. You get a sour one, and there is one firm-er than the others which is a mock BBQ pork. A pressed firm tofu would act as a piece of chicken breast, and there is also a curry flavored fried gluten ball.  Some of their dishes are just simple stir-fry of vegetables, but there are few amazing dishes that they use gluten and turn it into mock meat that you really can't tell the difference. The Salty fried chicken with fried noddles is one of the best. Even with a sauce over everything, the chicken pieces would still be crispy on the outside and tender on the inside. The most amazing thing is, it even seems like it's real meat, that it's bursting with flavor (it's juicy!) when you bite into it!  You would see this place packed with people at lunch times when it's weekends, or when it's the first day (or 15th) of the month on the lunar calender.  Normally they are really quite, so that when they are busy, the service suffers a little. If you want the \"dim sum\", you should order it the first thing you get inside, as the only server in the place will have to make that for you, instead of sending that one order to the kitchen.  If you trying it for the first time, go there at around 2pm, or early evening at 5 - 6pm, that way you can be sure you get your food in a much more reasonable speed.  they close at 9pm, so the \"dim sum\" wouldn't have any many selection. (you don't really get to choose, so it's a tip that you should get there early.)"}
{"text":"came here for lunch bc i was craving chinese food !  first, let me just say that the parking in this plaza is SO hectic and it will probably take you around 10 minutes to find a parking spot during busy hours  there are actually many veggie restaurants in the gta area that are pretty similar but i think this one beats all of them! the food is so yummy, service is really quick and the portions are super duper big.  ordered the mock sweet and sour pork - we asked for the sauce separately to dip and they were very accomodating! really good texture, i reccomend this to everyone! (5/5)   we also ordered the rice noodles - it was super good as always, the person sitting beside us who just came in even asked what it was because they wanted to order it! (4.5/5)   the menu is all in chinese, but if you explain to them what you want they will know! one thing is that the restaurant isn't so big so sometimes there are waiting times (like 5 min)   btw sometimes the food comes out of the kitchen super duper hot so you might have to wait a little bit before eating it!"}
{"text":"Honestly, a complete MEH from what my imagination had for great Vegetarian foods. One use of tofu was disguised under the names of \"curry\" this and \"chicken\" that; \"black bean\" this and \"kung pao\" that ...   It is alright if you're looking for a familiar Chinese favour, but for the price they charge, I could honestly visit T&T supermarket and buy their vegetarian meals and be more satisfied with taste and price.  Also, expect complete silence during lunch hour at 1:45PM - there were 3 other tables occupied with ours and all that was in place of \"talks\" were clatter of chopsticks and spoons ... some slurps, but absolutely no conversations from anyone. Just wow.  A 3/10."}
{"text":"Was so curious to get to know Chinese restaurants that only serve vegetarian dishes thanks to Deb P! Although I am Chinese myself, I did not really realize we do have quite a few Chinese restos here and there in GTA catering to vegetarian eaters due to personal/religious reason. Pretty interesting if you ask me.  This place was the first one I tried. The parking lot was busy but there's more spots at the back of the restaurant. The establishment itself is not the biggest but seems pretty clean. Ordered spring rolls and mock sweet and sour pork and they tasted surprisingly good. The portions were decent as well.  Service was okay. The server wasn't really rude but she definitely seemed bored.  They have a takeout food service counter by the door and debit and credit card are accepted here.  A note to people who don't understand Chinese: the menu at the takeout counter and chef's recommended on the whiteboard are only written in Chinese. so maybe bring a Chinese friend to interpret so you don't miss out?  Heading to my next veggie restaurant :)"}
{"text":"It gets really busy here during the 1st and 15th day of the month in the Chinese calendar (avoid coming these days) the dishes are tasty and very realistic to meat dishes in the way it looks, of course taste and texture is different. try the curry dishes! noodles or fried rice is good too! the large vegetarian gluten dish has gotten smaller and smaller they keep giving less things..."}
{"text":"One of my favourite Chinese vegetarian places around this area. I love the Chinese gluten dishes. Usually, we get the assorted ones that has the curry flavour, sweet and sour flavour as well as items that look really similar to meat such as BBQ pork and the pig intestine.  Overall, the dishes are decent priced - roughly $8-$10 each in a relatively large portion that is good for sharing amongst families. We enjoy getting the Fried noodle with mixed vegetable, which is only for $6.95. Fried noodles indicate that the sides of the noodles are crunchy and lightly fried, but since they cover the noodles with a lot of sauce, the noodle are usually soft and covered with sauce.   Another one of my favourites are the Fried stuffed yam fish with sweet and sour sauce for $10.50 for dishes to go along with rice. It has always been one of my favourites, and definitely not easy to make as it takes a lot of time to make. Be careful when you eat it though, it can be pretty hot when it comes out fresh from the kitchen."}
{"text":"Came cuz I saw their Chinese gluten display in the window, and I'm a sucker for Chinese gluten. Not a fan of the way it sits out in the open without any plastic screen to protect it from insects, though. Got a small for $4.50 (tax included).  Not cheap, but not overly expensive. The box wasn't completely full. I don't like that. I said I wanted some of each item (first time, so I might as well try them all). They didn't give me every item. I didn't like that either.  Taste: curry gluten - had some curry taste. sweet and sour - had some sweet and sour taste, but not sharp enough. vegetarian char siu - tasted odd. Not like char siu or its sauces at all. vegetarian pig large intestine - I liked this one. It had a nice chew to it. Good texture.  vegetarian kidney - sauce was gloopy. The sauce spilled onto my other non-kidney options.  bean curd sheet rolls - I like these. I mean, these are really hard to get wrong. other nondescript glutens - tasted like salty gluten. Overall taste - they could have been considerably less salty.  Will I come again for the gluten? Probably not. It's okay, but if I prefer T&T's gluten (their curry gluten and their duck gluten are amazing), the portions are better and it's cheaper, then I'm going to go there."}
{"text":"So good! This is a small little restuarant located inside the plaza. I never knew this place existed so I always go to lotus pond near by for their vegetarian platter and sweet and sour fish. So these are the two dishes I got here. The large vegetarian platter for $8.00 and the sweet and sour fish which was fried taro for $13.99. Both dishes were extremely flavourful and fresh. The vegetarian platter had distinct flavours too. The sweet and sour sauce for the fish was on point, a great balance of sweet and sour. They seperated thr sauce and fish so the fish was still super crispy. Service was good and price is a lot cheaper than lotus pond. I think their food is less oily than lotus pond as well. The only down side is this place is quite small so remember to make reservations if you have a large group."}
{"text":"It may have been what I ordered, but this place was nothing special to me. I was in the area and used yelp to find a place to eat. I should have spent more time reading the reviews, because they talked about what I didn't like, but was eager to eat. I guess I have learned my lesson.  I ordered their mushroom noodle (because I was trying to avoid the \"fake meat\" and I love mushrooms) spring rolls and the vegetarian dim sum.  -For the dim sum I was expecting more of a steamed dumpling then fake meat, this was the real disappointed point for me. I guess I should read better next time.  -As for the spring rolls, they were good and a decent size. -As for the noodles, I prefer a thick noodle to the thin and crunchy ones they served. This may be normal, but again it wasn't my cup of tea.  -On the topic of tea, like many chinese restaurants, this place serves complimentary tea with your meal. -On the plus side, the flavours were very good.  An additional note is to be patient in the parking lot. It is relatively small and very busy. Take your time and some deep breaths when it seams chaotic."}
{"text":"Since I have been to a few Vegetarian places in the area such as Graceful, Gourmet etc... I figure why not give a chance to try a new vegetarian place instead of going to the same one.. .  Didn't know what to except, especially after reading the limited reviews online.  I have to said that I haven't not been disappointed.   Though I did make a reservations early on, we were given a table right close by the door (and it was extremely cold that day)...  I guess reservations really doesn't matter. It is first come, first served.  7 pm is the most busiest time. I recommend going there by 6 pm..  or after 8pm.   Staff was polite and nice.     Food is actually great & good value. Staff also gave great suggestions.  They also have great combos at the back.   Parking: Kind of hard to find parking in that plaza as there are so many business and restaurants.. suggest to maybe park at the back of the menu.   Space:  Very tight and limited.  They can only fit so many tables in there. They also asked patrons if they would like to share a table..     Overall, I would come back but I will only come back when it isn't as busy.."}
{"text":"I've been here a couple of times over the years and this lovely family owned restaurant hasn't disappointed.   I tend to stay away from the Mock meat dishes, since I'm a little wary of the procedure behind getting tofu to taste exactly like meat. Meat-lovers may want to try it though! I dare anyone to tell the difference.   This little restaurant is almost always busy, yet the quality and taste of the food is never compromised. I end up eating every last piece on my plate.   I can't wait to go back!"}
{"text":"Ever since our first visit to Buddhist Vegetarian Kitchen, we have been back at least once every 2 weeks.   We pretty much love everything we tried and this is now our more frequent regular spot.  Love it!"}
{"text":"I'm currently on the hunt for mock meat that tastes close to the real thing...and this place is not it. However, the flavours for each dish was really good that it didn't even matter. We ordered bamboo shoots, which were good but the bamboo itself I found to be quite large and thick which made the bamboo less tasty and more..fibery if that makes sense. We also got the veggie delight which was larger than expected - always a pleasant surprise when that happens. As well as the moo sho pork dish - this dish was definitely my favourite out of the three. It was super flavourful and I enjoyed making my own rolls from the wraps. The pork bits also looked very much like the real meat, but couldn't fool me! ..it tasted and felt exactly like tofu.   Final conclusion? Decent place that I'd come back to, but wouldn't rave about it."}
{"text":"This is officially my new favourite place to get Vegetarian Sweet and Source Chicken. It was AH-mazing! The service is pretty bad and they forgot my rice but the food is worth the wait! They also offer veggie \"meats\" you can take home to cook. Haven't tried it but it looks good."}
{"text":"I've been eating here for years (take out) and the food has always been fair and tastes good. The ladies that serve me are always so nice and they give a little bonus food when you're polite to them! They have been in this location for at least 6+ years, and I'm amazed at their high standards!"}
{"text":"This place has been around for decades now and is still going strong. It was my first time sitting down to eat here. In the past I've only packed up from their to go bar.  Being a Buddhist kitchen, all the dishes served are vegetarian. Their menu has a lot of items that you'd see at any other Chinese restaurant but the meat is replaced with various bean curds and Buddhas delight or \"jai\". To test out the authenticity and to satisfy a recent vegetarian convert's cravings, we ordered sweet and sour \"pork\" and \"beef\" chow fun. Just by sight, you 100% can't tell the difference between the meatless dishes and the real thing. The sweet and sour pork was actually beautiful. The sauce had the right sheen and each piece of meat and vegetable was perfectly shaped. Biting into the pork, it had that iconic lightly fried crunch to it and the bean curd did a wicked impression of pork. In some ways it was better than the real thing - there were no \"gotcha!\" bites of a piece only of bone or one that's all fat. The flavour of the sauce was also super authentic and delicious. The beef in the chow fun dish was more on the medium end of matching beef. It didn't quite soak up as much flavour as I would have liked and the texture is quite different from beef. The noodles and the bean sprouts were great though and they subbed in slivers of snow peas instead of the green onions which I actually liked more. If you're fiending for those classic Chinese favourites but shying away from meat, I absolutely recommend coming here.  If you're not looking for dinner, the jai bar lets you pick and choose. I also saw them preparing big party plate orders while I was there, so there are bigger take home options as well."}
{"text":"I have been going here for years and absolutely love, LOVE the food.  My favorite is the dim sum plate of mock meat and the deep fried tofu with black mushrooms.  Bot are out of this world.  Very nice and friendly staff and very reasonably priced!!"}
{"text":"Came here for lunch and it's not bad for vegetarian food.  The place is pretty small and prices are reasonable.  I did enjoy their noodle soup and the staff has low patience so it's better to know what you want to order cus if you are trying to figure while they are their they will just walk away and tend to to other customers."}
{"text":"This vegetarian place was quiet even during lunch hour. The food felt a bit inconsistent; some dishes were salty and some were bland. However, the mixed vegetarian plate and crispy bean curd roll was delicious. I've definitely had better vegetarian dishes but this was acceptable by my standards. The parking is crowded in the front of the plaza, so try to find parking behind the restaurant!"}
