{"text":"all the \"good\" reviews here were posted by the owner...what staff?? there is a guy behind the counter stirring a wok with week old oil...and of course, he doesn't speak english.    if you are going for the \"buffet\"...it is not a true buffet where you can have what ever you like...the owner is waiting by the cash with a lid, and will charge you extra, when you didn't over stuff the container (the lid fits fine!)...he still charges you extra!!!   and charges a fee for using the debit machine...you must fill half the container with their greasy rice and tasteless noodles.
DO NOT GO HERE!!!!....YOU WILL PAY $12 FOR A MEDIUM SIZE CONTAINER OF BELOW STANDARD FOOD!!!!"}
{"text":"Its pretty hit or miss on my end.. I find there food pretty salty some days but honestly most of the time its amazing. And who can beat that price!! Keep up the good work but watch the salt :P"}
{"text":"If you need a quick Chinese food fix and are on a bit of a budget, then this place is perfect for you.  You'll definitely get the bang out of your buck whether you dine-in or take-out."}
{"text":"Amazing selection of gluten free treats from thoughtful, friendly family owners. Their son has food alleegies so they take them very seriously. The steamed chicken buns are killer! The food is high quality home cooking. 

We stocked our freezer and have yet to try sweet and sour chicken balls, breaded shrimp, lemon chicken and hot dog buns, just to name some of what they offer. The bbq pork bunk doesn't have the sweet sticky pork you might except but it's fresh and delicious. 

Can't wait to go back and stock up!"}
{"text":"Amazing food!! It's fresh and so tasty!! My husband and I wanted to try this place before but it was closed (closed on Sunday). Just stopped by today to grab lunch on the go and glad we did!! We can definitely call this place a go-to for food. Love the fact that you can grab a variety of food instead of just one item. Small place but big in taste!!!"}
{"text":"It's a fast food buffet style  Chinese food restaurant. I actually used to come here 8 yrs ago and loved it . Now they are gluten free . I missed it and love this place!"}
{"text":"Good, reasonably-priced food in Victoria Village Shops. We've been going there on and off for years, both for take-out and eat-in. Friendly, attentive service at a good price."}
{"text":"Discovered this place while working not too far from there. The food is consistently good and fresh and the staff and owner are always happy to see you. The prices are pretty good too considering what you get.  I go there for lunch every once in a while and am never disappointed."}
{"text":"This is in the same plaza as the DriveTest centre. 

The interior is done up in green and white fast-food decor, but ultimately it's clean and bright if a little tacky. The owner (I think) is very attentive and is happy to see everyone who steps through the door, seats them, brings them water and menus, etc. Is this place new? He acts like it's new. He's a little pushy but he's a nice friendly guy.

The food is plain, plentiful, tasty, and cheap. For $11 plus tax and tip, we got an order of wonton soup, two spring rolls, and a huuuuuge sharing-size plate of noodles with shredded veggies. They have a small buffet for $8.99 lunch and $9.99 dinner, plus you can fill a takeout box for $6.99. 

The only thing I would love more is if they had some tofu on the buffet. Since I passed my driving test I have to fabricate a new reason to go out there."}
{"text":"The food is good but, I was a regular customer the 1st time they were open and that's when it was worth the price, now they watch how much food u put on the plate I even had the manager told me am taking too much food after that I never went back"}
