{"text":"snooker haven  often overlooked in pool halls but the restrooms are one of the best"}
{"text":"Best place to play pool or snooker in Scarborough! Diamond everywhere for the pool tables, and the snooker tables are very nice to play on also. I have not had food here myself, but while playing pool (on several occasions), I overheard people mentioning how good the food was, so I guess the food is worth the shot even if you have never tried it before. Waitresses are nice to you too, and often ask you whether you want something to drink, so I guess that's good customer service too, so bonus points! As for the restroom, it is the best I have seen among all the pool halls I have visited in Scarborough."}
{"text":"Wow, what a hidden gem. Passed by this place several times but never knew what it was until I decided to look it up. I love the game of snooker and this place is great because there are several tables and not many people playing it as most of the people play 8 and 9 ball. I've been going here now for the past three months and the alcohol is also very well-priced. Haven't had a chance to try the food yet though. Only downside I noticed is that the snooker tables aren't the best type of tables......definitely not brand name."}
{"text":"Clean place. Lots of space. For pool players that come to play, they have all 7 ft and 9 ft tables. They also have up to date screens and a projector that you can actually appreciate. They also have snooker tables and table tennis. Lots of people come here just to eat the food. Parking lot is huge. The service is great. They have ample parking that most come to hang out in lol."}
{"text":"This place manages to be a huge open room with rows and rows of pool tables without feeling soulless or uninteresting. It's unassuming from the outside, but inside it's very welcoming and well laid out. My friends and I had a great night and will definitely be back in the next week or two. Here are our observations:  The place is brand new, so it's very clean and everything is in great working order. The drink/food prices are on par with most Toronto bars (meaning I can afford one drink+tax and tip, no food, but I blame my career choice for that, not the bar).   The servers were friendly and attentive. I got the impression the two who served us may be new to serving/bartending, and a little unfamiliar with the menu. For example, I asked for a dry white wine and got something so sickly sweet it made my teeth hurt; friend's beer had way too much head for a Stella, etc. but they have the makings of good servers with some pouring practice and some wine tasting.   Another friend of mine ordered a poutine after we watched one be taken to another table, but hers ended up coming pretty light on the gravy and with less seasoning than the one that went to the table beside us. The place is brand new (less than a month) so I figure the kitchen is still learning ingredient ratios and the problem should fix itself with time.  After 45 minutes of nonstop Bob Marley music, we decided it was time to call it a night. Don't get me wrong, there's nothing wrong with Bob Marley, but it was a bit too mellow for a night of drinking/games and everyone started to fall asleep.  All in all, this is a great place with huge promise. We spoke to a guy who seemed like he may be the manager (or even the owner) and he was incredibly funny, personable and interesting. Can't wait to go back!"}
{"text":"I was concerned it would be dungy and factory-like but it's quite a nice pub and spacious.  Lots of pool tables and tv screens. Wings were not the greatest though."}
{"text":"Rating is based on the place in general and the food and as you may have noticed, my reviews are generally based on restaurants/food.    Corner Bank is fairly new so it's still in very good condition.  Staff are friendly and very attentive.  Hopefully this will stay the same even after their business picks up more (the place is huge and it was about just less than half full).  Tables are also priced (hourly) reasonably.  Could honestly see this as being a new hang out.  As for the food, was pretty much your average bar type food.    Pizza - I've had better pizza though it still wasn't too bad.  Pizzas anyway are a hit or a miss (usually a miss) when served at a bar setting.  In my opinion anyway.  3/5.  Chicken Wings - I ordered the Maple Bacon Butter wings because... well bacon.  The wings were large and were perfectly fried to a crisp.  They were also very juicy.  The sauce however was a bit underwhelming.  First bite was nice but then after that it was just meh.  Ended up being too greasy to my liking.  Then again, it is butter.  I have had buttered wings before and though just plain, even that was in my opinion, a little more enjoyable.  I'd definitely order the wings again just not this flavour. 4/5.  Sweet Potato Fries - Was very nicely crisp and went great with their chipotle mayo.  Would definitely order this again. 5/5.  Chicken Fingers - Not sure if this was home made or what but it was on fleek! It's always great to have such flavourful chicken fingers when all you really need is plum sauce.  Would definitely order this again. 5/5.  Fries - I can't help but always look forward to some fresh cut fries when at a bar because why not, right? I personally love fresh cut fries like what they have at Swiss Chalet but these fries were a little on the starchier side. 3/5."}
{"text":"Went with friends last week as it opened down the street from my office about a month ago. Very large space with lots of pool tables. It was extremely busy for a Wednesday night. Looking from the outside in, you wouldn't expect it.   Food is good and well priced. Not the best, but better than you'd expect from a pool hall.   The owner was extremely welcoming and friendly. Very eager to please. Staff was fantastic. Highly recommend, check it out."}
{"text":"Just came here for the pool - Diamond tables as far as the eye can see - a real \"players\" spot but great for a night out too with lots of space and TVs if you want to catch a game on TV - didn't try the food as I was too busy trying to tame one of the brand new Diamonds! Snooker tables look great too - top spot for condition of equipment too"}
{"text":"Livelier than your average pool hall. Good atmosphere and priced at $6.50/hr/pp, it makes cents!"}
{"text":"This is my favourite pool place to go to. The outside looks a bit sketch but the inside looks totally modern. The prices are about 15 per hour. Parking is also kinda annoying to get to but other than that it's a great vibe place with clean and different sized tables.  One of the times I came, I hosted a birthday party for about 30 people. The managers and staff were very friendly and helpful in having me set up everything. I ordered trays of wings, pizza, sandwiches, spring rolls. All were yummy to pair with the amount of alcohol we had."}
{"text":"Huge spot. Lots of TVs with sports. One giant screen on centre. Good food. Lots of pool tables. Even table tennis. Overall great spot for friends even family."}
{"text":"Ambience- 5/5 Huuuuuuuge- basically a warehouse turned into a pool hall. No shortage's of televisions and there was free tables around. Nice crowd. Lot better than a lot of older run down pool halls  Food- 2/5 We got wing platters. I guess what they try to make up for in flavor they compensate with size. Giant wing!!! however- very dry and almost over fried and very lightly tossed in ssauce. Its pretty hard to be dissappointed by wings. Another tip- step your hot sauce game up. A lot of successful business have thrived due to their hot sauce / suicide game. Its Scarberia- having the right hot wings is a MUST!!!!  I think i will end up there again tho- pretty cool place to hangout. Moderately priced as well!"}
{"text":"Their wings are shit but you can't go wrong here.  Two big projector screens and 4 other LCDs playing sports. Tons of pool tables and snooker tables. Great service."}
{"text":"The Corner Bank is a great place to come and watch all sports. They have multiple TVs and kindly switched the games on some projectors to the basketball game that was going on. Took a little while, but understood because they were a little busy. The space in here is pretty big.  There are a lot of pool tables. Nice place to play some pool and also watch a few games while drinking a few beers.  Food was decent. The wings were actually pretty good, and a little salty with the lemon pepper, but I like salty so it worked out for me. I ordered the butter chicken plate, and it was a nice portion. Moderately priced.  The server was excellent and extremely polite. He did not mind splitting the check three ways, and always served with a smile. He wasn't even rushing us because it was near the end of his shift either. Great customer service!"}
{"text":"First visit - good place to play pool, tables were very good. Not really a big deal but when we ordered fries seemed like they downsized compared to some other pool and billiards places (fries were good). Looking forward to visiting again."}
{"text":"I've never paid to play pool before, probably because I'm a terrible pool player. I'm all sorts of uncoordinated. That being said, this was a much needed stop on Food Tour 2.0 (Scarborough Edition). The three of us played for a bout 1.5 hours, and our total was a little over $18. I like that it's clean and looks new. Service, where we had it, was friendly and cheerful. Free WiFi helps. Ask for their password. It's random."}
{"text":"Great new upscale Pool hall in Scar.  New tables, not crowded, clean"}
{"text":"I came here for some late night pool to celebrate a birthday. Place seemed pretty great, some of my friends weren't a fan of their food but the stuff I sampled tasted pretty good.  Staff: Friendly and checked in once in a while; be aware that they won't be checking in as often as a restaurant should since it is more of a sports bar. Everyone seemed nice and were helpful.  Ambience: There are a lot of tables and tables can be located nearby. We were able to eat, drink and play pool due to the proximity of everything. It's all well lit, and there were plenty of televisions playing different games to satisfy any sports enthusiast. Everything seemed pretty new and in good condition when it came to the pool tables. Lots of space to move to play. Could be considered a bit noisy but nothing that you wouldn' expect from an establishment of this sorts. Nice relaxing and frienly atmosphere overall.  Food: I only sampled the nachos and the pizza. In both cases I would say it's bar food. Nothing stood out but reasonably priced and tasted alright. I'll be honest to say that I would't seek out the food but I definitely enjoyed the bites while shooting some pool. Will say that the pizza crust was a little on the dryer side.  Overall, if you want a nice welcoming spot to play some pool and grab some drinks, I highly recommend it!"}
{"text":"Decent place for an afternoon party with lots of pool table, ping pong tables and great service. Clean, open space. I didn't try the food."}
{"text":"Good sports bar. Lots of pool tables. Food is a little uninspired though. Standard bar fare."}
{"text":"This is a great place to play pool. It has all types of tables and is very high class."}
{"text":"I recently organized a company social event at The Corner Bank and Jim and the team took care of us really well. They basically told us to show up and everything would be ready and it was! Great service.  As far as the pool hall itself, I've been in enough pool halls in my life and this place is huge! It's well lit, great ambience, and a great place to play pool. Tons of TVs, tons of pool tables, tons of place to sit and grab a drink. The food was solid and the wait staff were attentive and friendly. Definitely not the stereotypical pool hall you are used to.  I will definitely be back the next time I'm craving to play some pool and would recommend anyone to check this spot out."}
{"text":"The burgers have stepped up their game and are very delicious for a jam-packed 8-ounce. Base burger starts at $10, already comes with a lively aioli."}
{"text":"Took suggestions from review but have not try the wings yet. Staff is friendly.  I'm playing hooky from work in this fine sunny afternoon. Pricing is reasonable @ $6/hour or $15 for 4 hours. Took the $15 deal.  Coffee is okay, a bit stale and strings which is the reason for 4 stars.  Good place to practice.  Noise level is down to minimal."}
