{"text":"Silk is a lounge/restaurant that has an eclectic menu of Thai and american style cuisine with the equally eclectic decor to match.

The food is excellent, especially theirr Thai Drunken Noodles (basil beef with veggies and noodles in a spicy Thai sauce) and the service is friendly.

There's limited parking in the front and more out back."}
{"text":"The atmosphere is cozy and unique. The waitress I had the one time I've been was awesome. This is also the first place I tries sangria and haven't had sangria anywhere else that I liked as much as this place. 

The pecan crusted Brie cheese was awesome. Not a huge fan of anything else I had food-wise. 

This restaurant/bar/lounge hybrid is in an odd location so it's usually pretty dead, hence their early closing time. I'm sure if it was in a better location, it would be packed almost daily."}
{"text":"Very reasonably priced. The food wasn't fantastic, but it was good. Entrees were $10 to about $18.

They have a small bar area with about 8 beers on tap and a seating area. The seating area is a mix of tables, booths, and couches with coffee tables.

There are three or four rooms to the place, one of them had a real fire place going while we were there.

The staff was very friendly.

For our meal, the wife and I both started with the parsnip, pear, & camembert soup.  It was delicous.

Along with the soup was brought some bread with olive oil & balsamic, and a bottle of water.  Tap water likely, but that is fine by me.  I drink a lot of water and in most restaurants I have to ask twice.  When we finished the first bottle we were brought a second (we didn't have to ask).

For entree's, my wife had a baked halibut and I had a pizza supreme - pepperoni, veggies, and something else on it.   The entree's were ok.  The pizza was too big for me to eat  there and so became next day's lunch.

For drinks my wife had a perrier and I had a couple of pints of Mill Street Organic.

It looks like a very comfortable place and I think I'll be back, even perhaps to just have a pint by the fire."}
{"text":"I went here a while back and I am sad to see this site listing them as closed because this is hands down one of the most unique places to eat in Etobicoke. 

The decor is such a strange fusion that I can't even describe it but it is fabulous and inviting. The ambience is rich and warm with more then enough seating and a very concise menu with some interesting items that are prepared with care.

The service was very good and from what I remember the prices were very competitive as well. The parking is somewhat limited and the lot can be a bit of a pain to get in and and out of but definitely worth the effort to experience the wonderfully prepared food and unique dining ambience"}
{"text":"I love when places go out of their way to provide amazing service and what better way to thank them than to Yelp about it! Here are some highlights:

- Have us our own section for our group of 15
- Agreed to stay open later than usual to accommodate the group (they close at 10pm and we left at 11:45pm)
- Let us pick the music
- Pre-cut all the fruit for our Sangrias earlier in the day to avoid delays
- Allowed us to order from the kitchen past 10pm

It was honestly an awesome night and our waitress Carolina was a witty sharp tongued delight."}
{"text":"We didn't set out to eat here, we originally wanted to go to another place down the street that we didn't realize was closed. Since we were pressed for time due to another appointment we pulled in here. I remember this place when it was both Miller's Country Fare and Miller's Bistro, either would have been better.

This is a restaurant in search of an identity. The name and decor scream Asian, the menu is more continental leaning to Italian, the music is soft listening jazz. It was a Tuesday evening so the restaurant was not that busy.

After seating ourselves we were quickly presented with a menu and wine list. This was followed by a bottle of water (tap I am sure), some warm bread, a couple of slivers of butter and 2 cruets one of olive oil the other balsamic vinegar. The balsamic was generic and the olive oil uninteresting, so much more could have been done.

For the meal we ordered the pasta with braised veal and beef meatballs and the Mediterranean pizza (asparagus, sun-dried tomatoes, kalamata olives and feta). We were presented with our food in about 20-25 minutes. The pasta was mushy, the sauce clumpy and bland, the meatballs were just there. My wife who does not cook commented that she could have made better at home. The pizza was mediocre at best. The crust and toppings were passable, the sauce bland. 

While I was in the restroom the waitress asked my wife to rate the food on a 1 to 4. My wife said 1 complaining that the sauce lacked flavour. The waitress commented that they usually have young children in the place and kids don't like it with too much seasoning. 

Considering the number of places competing for business I would strongly recommend this place get it together fast and find their identity or they will be out of business, I know I won't be returning with mine."}
