{"text":"We had the BBQ plate and the chicken tenders. Sides we got: Collard Green, Mac and Cheese, Fries Sweet Tea and Lemonade
 
BBQ was a rib plate, but it was odds and ends of meat, apparently from talking with others you don't actually get ribs, its just chunks of pork meat. Their sauce was really bad, almost like a sweet and sour sauce.
 
Chicken Tenders plate was run of the mill food service frozen tenders. Low quality meat and didn't have much flavor.
 
Sides were all either just ok or poor: The Mac and Cheese was obviously just box variety but really greasy and mushy noodles.
 
Tea was pretty bad, decent amount of sugar, but lacking tea taste, I suspect it was a liquid mix. The Lemonade was Kool Aid or similar mix.
 
Service was very good, the people were friendly, fast, checked on our drinks even though we sat outside. Expect to pay $7-$10 for lunch.
 
Overall the food was from just OK to bad, there are allot of BBQ places around, you might as well go to a place that does it right.
 
To the owner:
Rework the BBQ sauce, get better pork meat, anything that is obviously food service frozen items replace and start doing things from scratch. Watch out for overcooking your noodles and brew the tea."}
{"text":"Good BBQ - sloppy but who gives a damn. Its friggin BBQ. All you naysayers, shut it. This is a great place to eat when  you want good southern food. Quick too.

I didn't get the ribs yet so I can't comment there but I will  be back. Why? Because you definitely get what you pay for and not less.  You can eat lunch for less than $10. Hells yes.

Now if you are one of those NC BBQ snobs that just has to have it one of the three different NC regional methods of cooking, then you're not going to be happy if you want that drippin Lexington stuff they call BBQ. This is simple smoked BBQ with a decent sauce on the sandwich.  I hope you like it; if not you know where I-85 North is. See ya after lunchbreak."}
{"text":"If you're in the mood for some down home BBQ,  this is the place to check out.  They have everything from ribs to hot dogs, so something for the whole family.  It's a fun place to come and enjoy some good food with your friends."}
{"text":"Three things struck me most about The Rib Palace:

1. The staff was really helpful, asking if we had ever eaten there before and when we answered in the negative, explaining the way number of sides was determined (anything over $5 gets 2 sides, anything under gets fries) and that there was a 2 meat combo plate if we couldn't pick just one meat. This is not to say they were particularly interested, but I'll take helpful over interested any day.

2. Holy cats, those were some damn good collard greens. Tender and moist, with more than a hint of spice and some remaining chicken hanging around in them. YUM.

3. That was a ton of food. I can't believe I ate most of that food.

I had the BBQ sandwich with greens & hushpuppies and the roommate got the combo plate with fried chicken wings and fried shrimp, green beans & hushpuppies (we like hushpuppies, okay?). My sandwich was full of meat, not bogged down with sauce and the pups were good, but ill admit they were were not the high point. The roomie's only regret was that he ordered too much fried, which is really his own fault.

All that plus one sweet tea, ran us just under $20 w/o tip. I was handed a takeout menu on our way out which I'm thinking is the way to go. (If i wanted to watch home shopping on tv while I ate I could just go visit my parents.) But i think it's a safe bet that Rib Palace fare will be enjoyed again from the comfort of our couch."}
{"text":"What can I say you win some you lose some.  This was a hit or miss was dissapointed.  Trsut me I have had BETTER!!  I do admit they serve you a good amount but of so ~so food.  The Mac and cheese looked like Kraft Macaroni just backed BAHHAHHAHHAHHAHA!!!  I asked for green beans and got b aked beans whihc were good actually.  I was shocked at the fact that thye offered every discount under the table but not a military discount which I was disspointed becasue it shows thye DONT KNOW THEIR SURROUNDING NEIGHBORS.  I ordered the brisket it as good dont get me wrong but the sauce thye poured over it was AWFUL.  It was a bright red pinkish sauce not a BBQ sauce I havever had it was like maple syrup it was awful.   The staff was great and helpful but all in all I will not be gonig back to this place The Mc Rib down the street was better than this place."}
{"text":"If you like lots of crappy BBQ...

My sister and I ordered one meal to share.  We couldn't finish it.  Was it too big or just too nasty?  Maybe a little of both."}
{"text":"The Rib Palace isn't like any palace I've ever seen, or even imagined.  It's more like a shack.  And the ribs aren't really ribs - more like rib tips.  Rather than being cut lengthwise, so you get ribs you can actually use for holding your portions, you get these oddly-cut shapes of bone sticking out at every angle.

On the good side, the portions are huge.  And the food isn't exactly bad.  The staff is helpful, if not particularly familiar with what you might get, what they have or even able to tell you what they have available at any moment (took them a while to tell us that we couldn't get what we had ordered).

The Palace is also a bit barren after lunch hours - that is to say, it might be busy at lunch, but it's definitely empty at dinner."}
{"text":"I stopped in there for lunch after driving around and noticing the sign..it's very easy to miss, a small place with a catering van outside.  I had the smallest rib plate -- about 7 bones, which was plenty for me.  It came with two sides (I got the green beans and the mac n' cheese, which were fine) and a couple slices of white bread.

The ribs were pretty good; not over-cooked.  There was a spicy sauce over them, but I could still taste the pork.

The menu also included medium and large rib plates, a rib & links combo, burgers.  A surprise was the list of discounts: Tuesdays students; other days for law-enforcement, the self-employed, healthcare workers... (if I remember correctly).

Anyone who likes ribs should definitely check them out."}
