{"text":"visited this place few times.  small regular  coffee and a small square piece of baked organic  bar/cake  $12.00
the staff are not very welcoming ,  hard to find a spot to sit .. too expensive for the  level of service.  Being an organic place I could justify their prices its the level of service I have a problem with.  went in many times and  I am always made feel that they are  doing me a favor
selling me just a cup of coffee."}
{"text":"Quality organic juices that taste great and are made with care. This is my favourite juice bar in town. When comparing prices, a 16oz organic juice for $6.99 seems pretty reasonable."}
{"text":"The ingredients they use can match up to the price. But I do agree with what other people are saying about this place. The staff is very unwelcoming to customers. I walked in the first time for some juice, and the older lady just kept on saying something to the younger lady in a surprisingly loud and unmannered tone. And when I ordered the biggest size (to last for a couple of days) they were like \"oh wow\" and \"ok I guess we still have to make it\". I mean, should I just order a smaller one to make it easier on them?

I wouldn't come back to this location again, considering how they make me feel about ordering a drink. But I still very like to shop in their store though. The people are generally ok if not more friendly, and product selection is decent."}
{"text":"The juice at the Big Carrot is organic, therefore the prices are high! 
There is not an alternative on the Danforth Riverdale area. 
The Juice bar behind the 2cd. Cup closed 6 months ago & is now a Real Estate office (not my R/E company ! :)
Watch out for the apple or orange juice it has so much foam in it - you wonder what your paying for?...Carrot juice w/ Cayenne 'no problemo'. 
The staff is somewhat understanding & try's a little 
- I just wish my 'LIVE' Organic Energy Juice was GR8!"}
{"text":"I have no issue with the juices , teas or coffee ...pretty good stuff if just a little pricey. My one problem this place is with the staff ...they are not terribly friendly , don't seem happy to see you and it seems like they are doing you a favour by giving you their overpriced juice. I've been in a few times and it's always the same. I don't think I'll be back."}
{"text":"This spot has wonderful juices that are made fresh and have a wonderful taste. Location is great and easily accessible by ttc in Greek town. Pricing is on the steeper side but is reasonable and to be expected at an organic juice bar. Staff were friendly and knowledgeable about the products on my visit to this location. Will return."}
{"text":"Never actually bought anything from this juice bar, but I still feel like I have an opinion worth sharing.  I have walked into this place with the intention of buying juice about 6 times over the years.    Each time, I've looked at the pricing and just walked out.  I am surprised that it has managed to stick around so long.  There is (was?) a better juice bar across the street behind the Second Cup."}
{"text":"What a disappointment this place is now.  I used to love coming to 'the Carrot' -all the way from St. Catharines.  Prior to the renovation I found the place to be quaint and interesting with a tasty, varied menu,  books and unusual things for sale. The 'experience' is now the equivalent of going to my local 'No Frills' or 'Commisso's' grocery store and the menu at Zehrs deli far tastier and move varied. The staff seems less friendly than at Walmart - especially in the cosmetic area where they are more interested in talking to one another than serving a customer.  Next time i make the trip to Toronto,  doubt there will be any reason to stop there."}
{"text":"Good products, no arguments there.  Rude, indifferent staff is what I have a problem with.  Shitty vibe in this grubby little place.  Lose the attitude ladies, it's getting really old, your dreadlocks and dead eyed service won't make you seem any more exotic.  Won't be back."}
{"text":"My juicer was getting dusty at home, and I needed a nudge to get juicing again, so I decided to buy a 16 ounce Lemon Zinger at The Big Carrot Organic Juice Bar.

Check in on Yelp and Bonus! 15% discount on 16 ounce juice for checking in.

But the person who took my order had never heard of Yelp, never mind the discount.  So she asked the other gal working and she knew nothing about it either.  Cashier looks at my phone closely, taps the button to marked the offer as used, and then doesn't know how to apply the discount on the computerized register so I can pay.

Manager from the main store is called over and says she knows nothing about the discount, wants to see the coupon on the app, but cashier has already marked it as used.  At this point I am starting to feel awkward as a line is starting to form behind me.  Manager says she will have to call Yelp and look into this.  Punches in the discount and leaves.

My juice was made, and was pretty tasty, so I decide to buy some fresh produce and start juicing again.

Big Carrot Juice Bar rating : Juice - 4 stars, service - 2 stars, so I will give them an average of 3 stars.

Juicing at home - 5 stars, discounted price and no attitude!"}
