{"text":"We went to The Stanley for the first time last night and absolutely loved it! The menu was creative and diverse, the environment very friendly, and the staff warm and engaging. Even the General Manager, Stephen, gave us personal attention.  Meal prices were reasonable, and the wine list diverse and good.  This is an excellent restaurant.  We will most certainly be back and I highly recommend it for anyone looking for a new, creative option in the Charlotte area."}
{"text":"A world-class addition to the Charlotte restaurant scene. This is a beautifully designed blend of new and old but completely inviting.  The food is as beautiful. I say that because you need to stop for a second and realize how much thought went into each plate.  I had an Asparagus appetizer that was called \"Asparagus as many ways as we could think of\".  We lost count at 5 different ways, and it was spectacular. Service was proper but welcoming.  Nothing stuffy about it.   I really am not sure what else I can say about it. Loved it! Can't wait to see how they change their menu as the seasons change."}
{"text":"This is a beautiful restaurant -The colors, the bar, the lighting - are all gorgeous.  From the minute we walked in, everyone working there was so nice and so helpful.  We started with cocktails - a Stanleyville, The Nobleman and Mezcal is the New Black. All were interesting and delicious! Don't be put off by the color of the Mezcal, the Smokey flavor was really enjoyable. We shared several dishes including: the Tempura which was light and crisp, the Foie gras funnel cake had amazing fresh peach slivers, peach dust and dehydrated peaches, the porky belly steamed buns were my favorite of the small plates I tried, and the risotto and shrimp was creamy and delicious. Unable to pass on dessert, we tried the unbelievable strawberry shortcake.This too had strawberry dust, fresh and dehydrated strawberries with a very flavorful sorbet and was absolutely delicious! We also had the apple pie with a sweet rich caramel ice cream with crunchies. Loved this dessert too! Every dish was as beautiful as it was delicious. Even the music selection added to the fabulous ambiance in The Stanley. I highly recommend it and can't wait to return."}
{"text":"This place defines dinner as a experience, beyond taste, presentation, creative ingredients, hospitality and ambience - all of which it gets a solid 10/10.  Will come back for more..."}
{"text":"The Stanley has been on my radar since I finally heard that they were opening up. The wife and I had a few hiccups with trying to get in for our reservation as they had some last minute construction that needed finishing up this past weekend. Either way, I was able to secure a last minute-ish time for Saturday night after our Friday one needed to be cancelled. The restaurant is laid out a little strange as there is a front dining room and bar area, and a separate back dining area, with the kitchen kind of being in between the 2. Now I know that some guests have commented on the acoustics in the back dining area and it certainly was loud when we were first seated, but it was definitely due to a 6 top of people who were super above normal decibel levels. There was a definite hush in the room when they left even if the rest of the dining area was still packed. Either way, on future visits, I would opt for the front dining area or the bar itself. I'm not completely sure, but I don't think that the same acoustic issues would be the case there.   The service was attentive and allowed us to take time to make decisions on drink and food all the while explaining us the concept and the menu. The wife decided in a salad to start and the trout with beet risotto for her main. I went full on freestyle and got 3, well 4 in total small plates if you include the pâté, which I made my dessert. The wife went more traditional for dessert with the strawberry shortcake. I started with the mushroom soup, which was the only off the menu special I believe. There were a few delivery issues as the thicker soup was difficult to pour out of it's carrying vessel. The server apologized and said that the chef was still working out a few kinks with the presentation. The flavor was there and I really enjoyed it, so no problem in any event. Next up I had the sweetbreads which were served with the inspired flavors of buffalo chicken wings. Blue cheese dressing/sauce, carrot foam and hot sauce. The sweetbreads were pan fried I think with some light batter on them. I was glad that they weren't deep fried as I don't feel like that is the best presentation for them. I really liked the idea, and the flavors were all represented well. Hopefully, there will be a continued presence of the sweetbreads on the menu maybe with other presentations, like an entree version. Next up was the beef tartar, which was a little disappointing, as I have had better versions. Sightly under seasoned on the tartar and really the dish didn't have any wow factor after the sweetbreads. As previously mentioned, I chose the pâté for my dessert as I clearly didn't have enough meat at this point in the evening. The country pâté was good, but the pork belly rillette ball was over the top good and really closed out the meal for me on a high note. It was deep fried and appears in the middle of the picture. I highly recommend this dish to anyone that loves meat. The wife said that her goat cheese and strawberry salad, and her trout were delicious, as I can attest since I snuck a few bites. The drink menu is varied for cocktails and the wine list was pretty extensive, so there should be plenty of options for all. Some drinks were hit and miss for me, but I really enjoyed the After Dinner which had bourbon, fernet, coffee and a dairy ice cube. As the ice melts, the drink changes and it was delicious. Looking forward to future visits at The Stanley and explore more of the menu as it changes with the seasons."}
{"text":"What an awesome place!! Food was freakin amazing and my wife and I loved the food and attention to detail with the food!! Way to go Paul!! We will be regulars, if you are a foodie in Charlotte, NC you NEED to make this a regular stop!!"}
{"text":"We were patrons of Heritage and were excited for Chef Paul's new restaurant The Stanley. As usual, we were in for a treat. The sweetbread, aka calf thymus gland, was a real surprise. It was cooked to perfection with a smooth texture and savory sauce. The cocktails were delicious. My husband had the pork chop and I had the steak; both were excellent. The ambience is warm and inviting. Dessert was the strawberry shortcake with strawberry sorbet served with fresh marinated strawberries. The Stanley is a restaurant where the menu changes often and you just have to be comfortable with the unexpected. Chef Paul is innovative and scary talented and he continues to push the boundaries of a myriad of established cuisines. It's sort of Southern cuisine with a French twist but really, the food here defies categorization and that's a good enough reason to keep coming back."}
{"text":"This place is hands down one of the best restaurants we have been to in Charlotte. Truly farm to table! Justin was awesome, guiding us through the menu and describing items perfectly. Each plate is crafted with thoughtfulness and precision, it's more than just good food. We cannot wait to go back again!!"}
{"text":"We were very excited to try The Stanley as we appreciate the creativity and community support of farm to table. Chef Paul Verica did not disappoint, as the food was inventive and refreshing. The farm fresh vegetables were truly the star of all the dishes we tried and we advise that you eat EVERYTHING on the plate!   We would highly recommend every small plate that we tried, as each one was more delicious with every bite: the Hot Pocket, scallops, tempura broccoli, and strawberry balsamic salad with goat cheese. For entrees, we were pleased with the presentations and portion sizes. Again, the vegetables truly starred in each dish. We tried the strip steak, trout, pork chop, and shrimp risotto. Each protein was well cooked - our only critique is that each entree dish was a bit under seasoned and could have used some salt.  The cocktail list is inventive and original. While price for the size was a little mismatched, we were pleased with the flavor development and creativity of the Mezcal is the New Black (smoky, but sweet) and the Nobleman (tart and refreshing).  Justin provided excellent service and enthusiastically guided us through the menu and helped maximize our experience as a party of 5.  Overall, the experience was delicious and fun, the service was refined yet laid back, and the decor is beautiful. Our only critique is to add a bit more seasoning to the food, which we still loved based on variety and uniqueness. We will be back."}
{"text":"The Stanley is a farm-to-table restaurant, which seems to be a popular description these days. However, unlike most farm-to-table restaurants this one stands out from the pack by having very modernist principles in its food along with a bit of rustic flair. You can tell from the plating and the choices on the menu that there was a lot of thought and love put into the food.  Boyfriend and I booked a table for 7pm on a Thursday night. Normally we try to do a weekend date, but getting a table before 9 on Saturday was a challenge. For a restaurant that has just opened within the past month, it was a good sign. The decor is welcoming and elegant, and there's a back area for seating along with the front & bar area.  The menu changes constantly with whatever they have in season and in stock (my boyfriend wanted the apple pie dessert but they didn't have it this night), so whatever I say here may not be present when you go there. However, considering our experience, you wouldn't go wrong selecting anything of their menu.  The offerings are mostly small plates, with a few entree selections, sides, and then dessert (which is on a separate menu/ask the server about the day's selections). There is a separate menu for wine (they have a huge wine selection) and cocktails (smaller, but still interesting). For drinks, my boyfriend chose the Mezcal is the New Black (which was a delight, bitter with a sweet aftertaste) and the Stanleyville (which is basically a Manhattan with cherry syrup added in). I chose the Caswell Cooler, which was a good gin-based drink that was refreshing.   For the small plates, we chose the foie gras funnel cake (!) and the beets plate. The beets plate had beets made 5 ways: pickled, \"tartared\", pureed, sorbet(ed) and panna cotta(ed). Everything on the plate was meant to be eaten. We both decided that the tatared beets (basically chopped up with a few things mixed in) was the best, although the sorbet and panna cotta were very good as well. The sorbet was slightly sweet, made with yellow beets, while the panna cotta was made with goat cheese and beats and then cubed on the plate. The foie gras funnel cake was a rich experience, with foie gras puree, funnel cake, peaches pureed and diced, and some pecans mixed in. The cake wasn't greasy nor oily, and the peaches and pecans gave the dish another layer of complexity that I enjoyed. Both plates were great for 2 people to share (the foie gras one might even serve 3 people, as it was rich.)  The risotto plate we shared, and for the price, it's quite small, although the shrimp on top were perfectly cooked and the risotto was flavorful. The risotto was creamy with an al-dente bite. However, this was the least favorite of the dishes. If I were to go back I'd probably try another small plate in its place.  For dessert we tried the deconstructed strawberry shortcake. This had to be our favorite dish of the night, as the strawberry jam/macerated strawberries were amazing with the perfectly sweet shortcake. The sorbet had a slight lemony taste to it, and reminded me of strawberry lemonade.   Definitely get reservations if you can -- as we ate people kept filing in for dinner! Also, with anything in the Elizabeth area, parking is a challenge and the lot behind the Stanley is small. We will be back when the seasons change -- I want to see how Paul changes the menu to fit the seasons. :)"}
{"text":"Called and was told there were no tables available until late so we planned to make reservations for another time...  Got a call back a few minutes later and they said that something came open and we could seat in 15 minutes.   Excellent customer service from phone to table are the makings of a great evening. Ask for Chris as a server, particularly to get an accurate pairing of wine or knowledgeable description of the cocktails.   Menu changes daily, but taste like old favorites.  Our Meal:  Salad course was perfect...arugula, apples, and Asher Blue; balsamic strawberries, goat cheese, and mixed greens  Second course star was the scallops...tartare, chips, and bitter micro greens; scallops, fennel, and lardons  Main course favorite was the risotto...bone in pork chop, braised collards, and sweet potato mash; shrimp risotto with early summer vegetables  Dessert...deconstructed strawberry shortcake, and chocolate pot de creme with peanut butter powder   House Red - Italics Red Blend worked nicely with everything."}
{"text":"I was very excited to try The Stanley after rave reviews from the Charlotte Agenda. The restaurant is beautiful. Unfortunately the ambience could not make up for lackluster service and bland food. We found the drinks to be tasty though a bit overpriced. The steam bun stood out among the appetizers. The asparagus many ways was beautiful on the plate but lacked flavor. Of the entrees, the pork chop was well received by the group. The risotto featured over cooked shrimp and was a small portion size for the price. The trout lacked flavor. I hope they are able to work out some of these kinks with more time."}
{"text":"Absolutely outstanding. Me and my lady like to share plates and eat slowly while enjoying libations and each other's company. Larry's cocktails were absolutely amazing, and each course was perfect to leave us full and satisfied but never over or underwhelmed. The scallops were the standout, green beans were great to start, and the pork belly was absolutely divine. Service was perfect. What a nice addition to the Elizabeth/plaza area. Its like Soul gastrolounge without having to feel like you're in Zoolander."}
{"text":"Typically dont post reviews but it was a really disappointing experience tonight.  I dont know if this is the right space for the restaurant, the dining area is disjointed and its hard to have a quiet conversation in the back room because the acoustics are terrible/loud. The menu looked great but the execution wasnt good, the pork chop was overcooked and very dry. The drinks were unimpressive especially for being priced higher than comparable restaurants. Kindred or Heirloom it certainly is not..."}
{"text":"This is an exceptional new restaurant offering a farm to table menu that changes daily.  We had most of the small plates and every one was better than the last. Cocktails were excellent too."}
{"text":"The food and drinks were fine, but someone tipped themselves $40 more than what I left. I reached out but no movement on their part so. Here we are."}
{"text":"My wife and I are in our early 40's, huge foodies, and we were excited to finally try The Stanley. Lumierre and Dogwood were our regular spots, but with Lumierre closing we are now looking for a replacement. I applaud the design of the restaurant, they really did a great job. However, my wife and I were seated in the back room, and on the way down to the back is a sloping decline with no traction mat. My wife, not even wearing heels, slipped almost falling on her butt, and would have painfully if it were not for the hand railings. Bad start. We then proceeded to enjoy their wonderful cocktail menu, and order small plates. Here is what we ordered, 1-10 score, and feedback.  Surf&turf: 8 , fresh light flavor, a nice take on steak tartare.  Pork belly app: 10, my favorite  of the meal, served in a cappuccino cup, with layers of pork belly, cheese grits, spinach, a poached egg, maple foam, and a touch of bourbon. I wish I could eat this for breakfast every morning.  Scallops: 3, this got high reviews by other people, but ours was extremely salty. So much so, my wife got a blood pressure headache. Maybe if done correct it could be a 7.  Foie funnel cake: 6, a bit bland, for this unique dish, I would want a more intense flavor to have it be the star of the meal.  Peach arugula: 5, nothing special. For something so simple, the ingredients should have been way better.  Sweetbreads: 2, again way way salty. Could barely eat it.  Trout dinner: 7, salty again, but not so much so that we could not enjoy it. Fish was cooked well, and was fresh.   Rissoto: 8, good execution, good flavor, hearty.  Carrot cake: 5, interesting presentation, but the slices of carrot with the dessert was not doing it for me. The carrot sorbet part of it was good though.  Strawberry sorbet: 9, really really good!  Overall, I would have loved a manager to have come over right from the beginning and comp our first round of drinks or something apologizing for my wife almost getting hurt due to the slippery ramp. Nobody even came over, most likely because the hostess didn't tell them. I think execution needs to be addressed on the line given what we experienced with our dishes. I also think that although it's great to be creative with presentation, and putting your own spin on dishes, the flavor and texture still needs to be there. Doesn't matter how pretty something looks if that is not right. For the money, and background of the chefs, we just expected more."}
