{"text":"Love this place. The atmosphere is amazing and great for a night out on the weekend or a dinner during the week. The menu has a great variety of food options - the calamari, and chicken supreme is amazing (not to mention the IN-HOUSE KETCHUP is UNREAL!) I tried the Belgium Whit and Session IPA ... I'm not a big craft beer drinker and I can say I'm now hooked. They also have some cocktails ... the raspberry mojito is absolutely delicious. Would definitely recommend the Six!"}
{"text":"The ambience of the place is stellar, but the beer really is just mediocre. Like a better version of Budweiser. They have a lot of beer on tap, but I wasn't especially impressed with any of them. They are definitely food pairing beers that perhaps have more flavor when you're just looking for something to wash down the greasy burger you had."}
{"text":"This place was an awesome spot to have great beers and watch a game. We were a party of 10 and asked for a spot near a TV to watch the playoffs, and they were definitely very accommodating. Also, our server was so attentive! Definitely great staff.

Two reasons why its not five stars: 1) The Food: We liked the \"bar food\" (nachos, wings, etc..) but the burger was okay, and the buffalo chicken burger was a bit plain. Also, maybe its just me, but its a bit odd to not have bleu cheese to go with buffalo wings or buffalo chicken sandwich. The homemade ketchup was good, though!
 
2) Perhaps its a new-modern decor vibe, but they have these low lamps atop the cruiser bar tables where we sat, and half our group couldn't see the TV because the lampshades were in the way! Though they look awesome, may not be the most practical thing at a bar that has TVs on all the walls..."}
{"text":"Avoid. The flourless chocolate cake was hard on the outside and frozen in the middle. The rasberry mojito with \"rasberry puree \" was minute maid concentrate. Service was ok. Music was terrible. Oh and the beer was alright, we got the the Porter."}
{"text":"I 1st became aware of The Six in July 2017; I walked by the venue then, well before it opened.  The address used to be an Asian restaurant which I once visited for dinner with a dining out social Group.  Yesterday I met 4 other people I knew for the Brewery's Grand Opening Event, when I finally made it inside.  The 5 of us were seated at their bar in the back on the 1st floor, where we could choose from the list of beers on their menu.  We received beers of various quantities and a variety of food items and others in my group also ordered food to share.

The main/1st floor is fairly spacious overall and they have a lower level with a separate bar; it's also where the washrooms are as well as most of their brewing equipment.  As it was their Grand Opening Event it became fairly packed in the back on the main floor where we were as it became later; by the time I ventured downstairs to take a look at their lower level after 8 pm it was packed down there with just about every seat taken.  They have multiple big screens on both floors which were tuned to the hockey game last night.  As it became later, the music was turned up until it was fairly loud, though not so loud that it interfered with having conversations.

The service at our bar was quite attentive and friendly and of course the Brewery's Staff is quite knowledgeable about their beer and food offerings.  As the Brewery isn't too far from where I live - I walked to and from there yesterday - I hope to make it back fairly soon to try some of their other beers, as the 3 I had last night (Hopster Session IPA, True North Stout and Trash Panda Porter) were all quite good.  The food samples were quite good too and the venue has a fairly upscale appearance.  So I recommend you check The Six if you're in the neighbourhood and are in the mood for quality beer and/or food.  It's at a good location, on a street corner a little west of Bathurst St."}
{"text":"Session IPA is amazing! I went for the beer but I had a great experience overall last Friday, my server was friendly and knowledgeable and my tacos were lovely."}
{"text":"The mussels were great! I dove in and finished every drop of the broth as well. Will probably request to have it served with fries (classic mussel and frites) next time. Pub style burger was good; the cheddar was perfectly broiled ontop of the patty with the burger served open-faced, having me salivating almost immediately. And at $8 as a Monday special was quite the bargain. Loved the flight. Unfortunately, I couldn't complete sampling the rest of the beers as the Session and the Lager were unavailable at the time. Going to go back to try the rest of the menu before it gets updated."}
