{"text":"OK so this place is: Way over priced, I mean come on for a meatball sub it cost $13.99 , a pastrami on rye $15.01 and a tiny container of Mac salad which literally was like 4 bite was $4.99, so with tax and service fee it was $50.54.  I was really expecting something more for that kind of price. I won't be ordering from them again."}
{"text":"I just love these ladies! It's the \"go to\" for lunch at my office and everything on their menu is delicious (we've gone through pretty much everything). It's also the highlight of my day to hear them say \"We'll have there in just a few minutes, sweetie.\" It always makes me smile."}
{"text":"I was in dire need of a breakfast burrito, but couldn't leave work. I decided to take a chance on something new and ordered from here through Postmates, and I'm glad I did!

The burrito did the trick. Eggs, chorizo, potato, and cheese -which was more like the nacho cheese; I wasn't expecting that, but it worked well! It wasn't an enormous burrito, but the perfect size to get me full and fed.

It looks like they have a ton of other stuff on their menu. I would give something else a try from here!"}
{"text":"Just ordered from the place and it'll be our last.  First time here so was skeptical so I ordered the burger basked on the picture they are adverstising... unbelievable....., what I got was 2 smashed bread and patty with a piece of cheese... no lettuce,tomatoes, pickles etc which was displayed in the picture.. I could see why the rating was sub par but we were desperate ordering for delivery..  I don't write much yelps in the years since having a YELP profile but I feel I should at least warm consumers...  disappointing"}
{"text":"When I first drove past this place, I laughed. We all know not to trust food from gas stations, right? I never saw myself eating there. 

As luck would have it, I ended up working right across the street and I'm there at least once a week! The food is always amazing, and I'm sure always fresh! I'm boring and always get sandwiches but my friends often order hot food with zero complaints. Sometimes the customer service leaves something to be desired, but the older gentleman who is there a lot is always so so nice! And I think some of the customer service issue is my hearing problems (I am 50% deaf) and I struggle with their accents in the sometimes noisy, echo-y store or on the phone, so that can be very frustrating for everyone involved. They have a seating area outside that I used for the first time recently. It was cool to people watch while eating my lunch, and since it is a gas station you can see all sorts of characters. 

The bottom line is that if you think this is \"gas station food\"... It's not. It's awesome, and why haven't you been here yet?"}
{"text":"This place charges $.99 EXTRA for butter on a $3.49 bagel. They also offer a Peanut Butter & Jelly sandwich for $3.49. What a deal! Oh, wait, it's an extra $1.25 for the jelly and $.75 for the Peanut Butter.

Some fancy boutique establishment, you ask? Why, no. It's in a GAS STATION! How much for a side of unleaded?"}
{"text":"You know you're in a good area when the corner convenience store doesn't just have your standard soda, chips, and beer but also a plethora of gourmet items including craft beer, wine, specialty sandwiches, fried chicken, etc. 

The Corner Deli is a fixture in North Central Phoenix. Run out of libations at a party, send someone over to get some more. Taking a bike ride through the neighborhood and need a refreshment or snack, this is the place to go.

Other parts of Phoenix may have Circle K's or 7-11's on every corner, but we are lucky to live in a section of town that has a store like The Corner Deli."}
{"text":"This is an oasis in a busy world.  Great sandwiches, the best fried chicken, rice and beans, and breakfast foods.  Add to that world class wine options.  Get all this while gassing up.  Amazing place!"}
{"text":"The friendliness at this Deli really stood out to me.  Everytime I call to place an order the person who answers is so nice and helpful.  It's a double bonus that all the food I have had has also been exceptional.  I would recommend Corner Deli to anyone!"}
{"text":"This is a little hidden gem. The food tastes like something a family kitchen makes. It's also a convenience store so you can get everything you need"}
{"text":"Very disappointed, especially after all the good reviews everyone seemed to give this place. The meatball sub was weak, the chowder tasted like it came out of a can, and the potato salad was so bad I couldn't finish more than the first bite."}
{"text":"As Shell gas stations go, you can certainly find cheaper spots than here to fuel up.  As Shell Convenience Stores go, this may be one of the best you'll find in the valley.  The convenience store (called The Corner Deli) has most of the usual convenience store staples, but also has really impressive sandwich offerings at their deli counter and a robust booze selection (particularly the liquor choices).  Everytime I come here it seems like the owners are trying to find ways to cram more products inside for people stopping in.  The station backs up to one of the most affluent neighborhoods in Phoenix so a lot of the offerings you'll find here are pretty rare for convenience stores (high end spirits in particular).  Prices for the convenience store products here are generally more expensive than say if you used Safeway a short drive from here, but such is the way of convenience stores.  My family comes here often for lunch as the deli counter has a great selection of sandwiches made to order.  I'm personally a big fan of their deluxe sub, which includes ham, turkey, and roast beef with whatever fixings you want.  Seating here is limited so probably best to get it to go, and be warned this place gets super busy during lunch time.  Just an FYI, the deli counter now uses Uber Eats if you wanna go that route.  All in all a pretty solid one stop shop on 7th Street.  But like I said, try to fill up the tank elsewhere."}
{"text":"I really like The Corner Deli. Sure, I don't love them. But that's okay, I'll keep coming back anyways! They're a great little deli with simple, tasty food and nice people. Nothing fancy about it, but that's part of what's so good.

Of course I'm sure it helps that I work just down the street. Easy access = easily drawn in."}
{"text":"Had an absolutely terrible experience ordering delivery from this place. We waited an hour for our food and when it still hadn't shown up, we called the restaurant to find out what the deal was. Whoever we spoke to on the phone didn't know where the driver was and didn't give us a way to contact him. With some digging we were able to find out our driver's contact info and we gave him a call and that's when he finally rushed over. Our food was barely warm and my chimichanga ended up having a medium-sized chicken bone in it. I would be willing to shrug off the wait time if the food was good, but unfortunately it just wasn't worth the wait."}
{"text":"I really like the sandwich various food varieties offered here.  I ate the burger and the Mac and Cheese.  I thought it was a good value and taste.  It took longer than I expected to show up but it was still edible."}
{"text":"Love this place. I've gotten it was uber Estes, grub hub, picked it up myself. Mac n cheese is bomb and tastes home made. Never have gone wrong  with a wrap and thief curly fries yum and the portions are worth the price."}
{"text":"Good for quick bite........ Kinda shocked they had soul food menu options???? The owner gave me a chicken tender to try............I have to admit it was yummy"}
{"text":"We've been coming here for years, since before they opened this location. It's always clean and staff are extremely friendly. Thank you, Steve, Nick and Mike, who always make us feel like family and the food is always good!! The Krispy Krunchy chicken is the best we've ever had!"}
{"text":"Corner Deli is the most fitting name I can think of - they have the market cornered on late night delivery food.

I wouldn't come here during the day - the prices are borderline extortion.

I would, however, order from them through UberEATS at 3AM when I don't want to move. 

They deliver food - pretty good food, I love the burger and seasoned fries - but they also deliver from their deli and store: firewood, gallon of milk, pound of deli meat, bread, ice cream. 

They nickel and dime you to death with every sauce and side, and they charge way too much... but their food is totally worth the occasional late night splurge."}
{"text":"A great little place for lunch in Kierland. Even when I walk past it, it's classic decor and bar stools make me smile."}
{"text":"When you visit Kierland, you'll have many restaurant options, but none will be as rewarding as Chloe's Corner Deli.

Not being a 'bunny-food' aficionado, I threw a tantrum in Kierland Common's main square when my wife insisted we eat there, despite my penchant for PF Changs on this day. 
My arms firmly crossed and pressed closely to my chest, stomping my feet down in obvious disgust, and finally, plopping my butt down, (arms still folded) I  began to cry.
This is when she dragged me to my feet and towed me into the deli.

After ordering, (still crying) we sat outside, enjoying the spring-like temperatures.
That's not all we enjoyed.
We enjoyed the food once I got over my little hissy fit.

I learned a couple things that day.
One. 
If your wife is wearing non-matching bra and panties with her hair pulled back... a beret resembling a tiara, it's likely you're married to Wonder Woman and never knew it. Because despite your best attempt to remain glued to the sidewalk in a tantrum-like state, she WILL pick you up and drag you into the deli. 
Like it or not.

Second. 
The spirit of Harriet Tubman (Underground Railway, google her) lives on. 
I say this because I firmly believe there's a network of women who secretly share the best places to have lunch, as this place was crawling with 'The Salad Network'."}
{"text":"The best place for homemade food.
Love this hidden gem.
They love have so much variety and cater to all needs.
Prices are a little high for gas station / fast food"}
{"text":"Stayed in central Phoenix for the night and after 2am this was one of the places we could order from on UberEats24. We ordered a burger and chorizo burrito. The burger was a little blah. Nothing special but the burrito was good. Had the right combination of egg and chorizo. Chorizo had some spice but not too crazy. I'm very picky about how my burritos are rolled and this place nailed it. The burrito was rolled tight. It wasn't falling apart or making a mess. Good surprise for 3am cravings."}
{"text":"The best kept secret in the Scottsdale Airpark. It is a small deli in a strip of office buildings, but is it yummy. It is so close to my office I can easily walk there to grab lunch. I work in an office all day and need to get the blood pumpin every now and then. 

The staff is super friendly and remembers me ever time I stop in, about once or twice a week or so. Their More Than A BLT is probably the best sammy on the menu. It's a regular BLT but they put their fabulous turkey on it and avocado I think. They have several other sammys to pick from, including hot ones. Or you can build your own. Their meats and cheeses are all fresh and sliced in house. They also have several salads and soups, and there is always a daily special that isn't on the main menu. I had a Grilled Reuben last week, yum! 

They are open for breakfast as well. I get the breakfast burrito all the time; eggs, cheese, cream cheese, green chills and your choice of ham bacon or sausage. 

They also deliver to most place in the airpark. We had a catered meeting at our office a few months ago and the delivery guy was great and fast. If you are in this area check them out.

PS: Going to get lunch from there now! Jealous? You should be!"}
{"text":"I had an excellent veggie sub from here today! ( delivered by ubereats). It's amazing how simple a veggie sub is but truly it can be hard to find a spot that executes a really good one. The Corner Deli will be my new go to sub spot. Here's why:
Perfectly fresh bread (I chose wheat)
Boar's Head cheeses to select from (and meats if that's your thing) . Lot's of veggies to select from. Crisp lettuce. Great Italian dressing. Perfectly layered. Perfectly seasoned (I chose with salt&pepper)... Thanks Corner Deli!"}
{"text":"I looooove Corner Deli!!!   I eat there at least once a week and their JALAPENO CORN CHOWDER only comes every few weeks and it is TO DIE FOR!!!!!!!!!!!!!!!!   I get an email daily that tells me about the specials and the soups and every time I see that corn chowder on the list...I'm there! And they are expecting me!    I'm going to steal the recipe...shhhh don't tell anyone.  

Corner Deli isn't exactly on the corner...but its around the corner!  And its perfect for those of you located in the Airpark!  They offer free delivery if you just can't get away from your desk.  The prices are affordable and the quality is out of this world!  They make all the sandwiches fresh when you order.  I'm also a big fan of their Turkey Ole sandwich.  With swiss cheese, lettuce, mayo and yummy green chilies!  They also offer breakfast burritos, bagels, sandwiches, soups, salads and ooey gooey brownies.  

Monica who works the register is so friendly and charming.  I've even placed a phone order in the past and didn't make it to pick it up and Monica called to say she noticed my food had been sitting for awhile and asked if I wanted my soup re-heated!  

If any of you are burnt out on the typical chains located in the Promenade, then just head around the corner to the Corner Deli and check it out.  You won't be disappointed!"}
{"text":"Finally a real hero!!!!!!! My husband and I love this place. If you don't know what a bodega is, this is it! Reminds us of our home state back east. Only downfall, a bit expensive.... But for us totally worth it!"}
{"text":"This is now my new favorite deli for lunch! Loved the turkey sandwich and the Blackberry Green Tea -- Unsweetened! The folks are friendly, the service fast and the food great!"}
{"text":"The pic you see on Yelp is not The Corner Deli, its of Chole's Corner in Kierland Commons. The Corner Deli is across from Scottsdale Quarter in the AIrpark. The atmosphere is very basic but the dining area was bigger than expected. Service was very friendly and our sandwiches were great. Pretty cheap, about $ 7 or 8 for a sandwich drink and a side."}
{"text":"I always get the strangest looks when I say \"go to the shell gas station and get a sandwich.\" I get it. It sounded so odd to me too. That was before I tried it. The corner deli is literally the BEST deli in town. Their sandwiches are ridiculously good. I'm a salami person and they slice their salami perfectly and aren't shy with the portions. You can actually buy their deli meat and cheese to take home! The sub rolls are so fresh and not tough like most other deli's. You can pretty much get whatever you want here. The staff is so nice and accommodating you can customize just about anything. The gyro is amazing (I know, it sounds strange. Gyro at a gas station) but once you try it you'll need no further explanation. Their hours are awesome, I believe they may be 24 hours now which is perfect no matter what your schedule is. Some days I grab breakfast and dinner here. Everything is fresh and delicious it's hard not to be addicted. They also have a great liquor selection at decent prices."}
{"text":"So I was starving and ordered from here thru Uber Eats. Had no idea of the size of the fish filets, which run $5.99 each, so I ordered 3 of them. Ok so these things are freakin huuuge!! somewhere between a phablet and a tablet.. well I ended up with way too much fish but at $5.99 each I dunno how they're making money on these. I'd order them again for suree"}
