{"text":"Great tacos and burritos, haven't tried the churros yet but will be back again soon. Nice friendly and cheap little family joint."}
{"text":"Nice little latin shop with very friendly service. Had a beef taco for $2.50 on an impulse. Was hefty for a cheap taco and served with tortilla chips and sauces. It was excellent! I recommend stopping in for a taco or burrito if you find yourself walking by."}
{"text":"Absolutely amazing, great food and great service, a definitie hidden gem!"}
{"text":"Small, clean shop with lots of Mexican non-perishable goods, pinatas, sodas, snacks, religious candles, some chorizo, and dairy products.   They also have seemingly very authentic burritos (which brought me in) for $4.99. Packed - I had the carna one - lots of beef, beans, avocado, and spice. Lovely. I'll be back.   Well priced (like Mexico) and the staff working there couldn't have been friendlier.   ttyn,  PAT"}
{"text":"So I've driven by this place so many times and been teased by the big $4.99 BURRITOS sign on the side of the building, that when I had some time to spare on the weekend, I had a chance to stop in.  The shop itself is small and filled with imported mexican goods including candy, cooking ingredients like different type of rices, beans, sauces, etc, and even some sausages and such in the back fridge. Then in the very back they prep the hot food.  They offer a small menu of burritos, tacos, and churros as well.  I saw Mexican Pulled Pork Burrito and couldn't help but need to order that. At pretty much any place that offers Pulled Pork, its impossible for me to resist ordering anything else. I figure lets see what Mexico can offer on this front. The burrito took about 5-10 minutes to make in the back of the store which gave me time to pick out some mexican nachos, canned refried beans, and a guava based bottled beverage to buy as well. Once I made it home to dig in I found what was a pretty darn good burrito. I'll admit. I've never had a burrito like this. It was large in size and filled with big chunks of meat and a few too many pint beans. Overall pretty good and definitely worth the $4.99, but I think Im more of an american pulled pork fan with barbecue sauces and such so will have to go back and give the more traditional carne (beef) and pollo (chicken) versions a try."}
{"text":"This place is amazing! So glad I got to meet our old friend and owner of the place! A must try is the Carne Asada burrito! As a fellow mexican I have a feel of home in this place. Food is greatly priced and you can also find some groceries that are authentic. If anyone is in the Toronto area this is a just place to visit to get a taste of Mexico!"}
{"text":"AMAZING! Finally got food here after walking by hundreds of times. Today the smell was too much to resist. Beef burrito for $6.50 was packed with beef and beans, and vegetarian quesadilla with cooked vegetables, cheese, and beans was pretty hearty for $5.50. Portions were huge for the price and the food tasted great. Really good comfort food with simple ingredients. Staff was really friendly too!  I am so excited to come back for food and will probably buy some of the groceries too (especially the coconut candy bar)."}
{"text":"Traditional Mexican food definitely lives in this little corner of College and Margueretta Sts.   This little joint offers everything from quesadillas, to tacos, to burritos to churros! Of coarse, I have had all of them. My personal favorite is the chicken taco. It consists of so much flavor! Also runner up, is the chicken Quesssdilla, with lots of cheese! And always served with tortilla chips. This little market also offers Mexican grocery items such as salsa, chips, beans and other items. They also have a wide variety of drinks.  This place is very clean, and has a couple of tables of chairs, and two benches outside. The people there are very friendly, and the service is moderate,   Moreover, I strongly recommend you come here for lunch or for a snack. (P.S, They also have Kawartha Scoop Icecream)"}
{"text":"Awesome little Mexican grocery store. Like the first review said, lots of authentic Mexican grocery. Burritos are 5 bucks, I had the beef and chicken during separate times and both were pretty authentic. Extremely friendly people. This is my new go to burrito spot.   FYI, no seating, take out only."}
