{"text":"I love that they have really good food and drink and nice people. The bartender Lexi, is my favorite! They have a bar area and dining room and the owner is really cool, too!"}
{"text":"Great place! Very clean! Bartenders are very customer friendly! Try the chicken tortilla soup .. Homemade cream of mushroom is delicious also! Italian hoagie was also very good.. Kid friendly too there is a dining room separate from bar area."}
{"text":"First time lunch today. This place is a nice little gem. I had fish sandwich fish was crispy, not greasy and on a fresh Italian hoagie bun, the kind that is about 2' long and cut in half, 3 large pieces of fish, coleslaw was homemade and relish, home made chips where crispy and tasted, wife had chicken Greek salad, lived it and had all the fixins, daughter had chicken tenders, nice garlic flavor and came With garlic butter to dip, a unusual welcomed surprise, our friend had the club sandwich and homemade mushroom soup... really good. We started with a zucchini appetizer with fresh cheese and sauce.... service was great... I'll be back and it's nice to know we have such a fine restaurant nearby, if you haven't been here I'd try it! Lunch, dinner or to watch a game."}
{"text":"I live in the area and this place has been a few different establishments. This one is a great idea but isn't good. I've tried to eat here 5 times because of its convenience to my location.  I would love a place like this based on menu alone, but it falls flat in so many areas. .  #1 being the service. Oh Lord.  The service is awful.  Its like they don't want you to have a good time. The food tastes frozen and the beer is warm. Yuck. This place isn't for me."}
{"text":"Small and quaint.  Was passing through town and saw this place. Needed a quick lunch. Was very pleased. Atmosphere was rather cute for a small place. Service was great. We had the zucchini appetizer and it was outstanding and a large portion. Also had quesadilla and a turkey club sandwich. We were very pleased with everything. Met the owner on our way out and had a lovely conversation.  Would definitely stop by when in town again."}
{"text":"This was the perfect way to spend Valentines day!! The special for dinner was filet that was cooked to perfection! The steak wrap was delicious! I love the atmosphere, the service and the food! If you are in Canonsburg, this is the place to stop! Great food at a reasonable price!!!!!"}
{"text":"Great wings!! We live near by, so we are frequent customers. The Last Call never disappoints. Clean inside and friendly service. Nice size bar and good specials!"}
{"text":"Ordered a takeout meal and it was the worst. It looked so sloppy we thought maybe the person who made it was drunk. Turkey Devonshire was made using processed turkey and cheese whiz. It was served ice cold. Buns for the steak sandwich were put on backwards and parsley was sprinkled all over everything including the boxes. We called to complain and was told the owner would get back to us. We never heard a thing."}
{"text":"Alright food, terrible service. If you have time to wait around I'd suggest it. Service was extremely slow. Sat in the bar area because there were no signs instructing where to go, which apparently was a mistake. The server/bartender took about 15 minutes to bring over just two waters. We ordered more drinks and had to wait another 15 minutes for those. Also after offering to refill my water, I never got it back. Our server/bartender seemed more interested in socializing with her friends instead. Will not be returning."}
{"text":"Came here with three other people from work for lunch.  The menu is pretty good, however, they were clearly understaffed when we came.  Besides maybe three people drinking at the bar, we were the only other people in the place.  Yet it still took quite awhile to get our food.  When the food came out, it was tasty, but it was only warm, not hot like one would expect.  If they had another person in the kitchen to help out over lunch, it would have been a much better experience.  I can't see how they would serve multiple groups of people over lunch here with, what seemed like, only two people working."}
{"text":"Came here because a friend said it was good and wanted a quick bite, walked in the front had to find my way to the seating area because there was no signs. Next I sat down and was greeted (the waiter seemed nice) ordered a water and the waiter took about fifteen minutes to bring just a water. Then I ordered the Rubin and that as well took way to long to come out. There was not a lot of guest and another table was awaiting there order just as long so I'm not sure if it was a cook issue or a server issue. The Rubin was decent the bread seemed as it sat out to long. The pub fries where crispy. Overall I don't think I'll be returning."}
{"text":"Great food, great staff. Loved it when it was the Handle Bar, love it now as Last Call. I've tried several dishes during several visits and have been pleased every time.  If you've never been, there is a dining room separate from the bar, but you can tell that the bar is still bumpin'."}
