{"text":"This place seems like it wants to be a beer bar, bottle shop, coffee shop, convenience store, and a deli. While I fully support the enthusiasm, it's hard to execute all those components well and keep everything cohesive. Ordered a sandwich, coffee, and bottle of water from three different parts of the place. That order would have been frustrating if this place was busy at all.  My sandwich order got lost (it happens from time to time NBD) but the sandwich, 10$ club, didn't make it worth the wait or the price. Coffee wasn't anything I'd go out of my way for either. There was almost nothing on the shelves to purchase which made the convenience store part seem pretty much useless. Seating was great though.  I'll probably give this place another shot but I'll have to have a game plan first. I think I'll do a hitch route for a coffee then run a post for a breakfast sandwich in the back. Celebrate with a beer if all goes well."}
{"text":"Beautiful spot with good coffee and great sandwiches.  Lots of upside to this spot. Staff was friendly.  Chix Salad Sand was delicious."}
{"text":"Great neighborhood spot. Coffee is top notch, atmosphere is chill. I've had the deli food once and the club sandwich is top notch and a healthy size. I can bring my whole family here and enjoy!"}
{"text":"I love getting breakfast here when I get a chance. It seems like it's the only place that has a good breakfast burrito. They're always friendly and able to modify my order as requested, and it's usually pretty fast.   Highly recommend the breakfast burrito as mentioned. Many of the breakfast places around have started using red potatoes in their breakfast burritos for god knows what reason. People's Market uses hashbrowns and it's amazing. Would recommend adding the sriracha mayo to your order."}
{"text":"I stopped into this market with a friend on a whim because we were in the neighborhood and I will definitely come back.  I love the look of the place although it looks like they are still stocking up on merchandise for the shelves.  The layout is a little different and a tad bit confusing but hopefully they will work it out in due time.  We headed back to the food counter and I chose the vegan burger and curry lentil soup and my friend had the egg salad and bacon sandwich (she added avocado) and chips.  I would have loved to have a vegan cheese and mayo option for the burger and would love to see some baked potato wedges or some type of French fries. The food arrived in a timely fashion but the burger was in plastic container which was kind of odd. Maybe butcher paper or something else would be better.  The burger was a thing of beauty and the only thing I changed was I had raw onions instead of the cooked ones put on mine.  The taste was pretty good but the burger itself needed seasoning and if vegan mayo isn't available maybe a special sauce would be cool.  The curry lentil soup was sooooo stinking good. Yum. Yum. Yum!!  My friend said her sandwich was really good and thoroughly enjoyed it.  We sat at the bar area and the woman working behind the bar was so nice and even let us sample some kombucha that I would definitely purchase next time I go.  It was fizzier than usual, more like a soda almost.  The name escapes me right now.  She asked us our thoughts on the food and I shared about ways to improve the vegan burger and she genuinely received the feedback.  She pointed out the owner at the front and as a woman of color, I was thrilled to see the owner is a man of color.  Some may not understand that but it's nice to see.    On our way out, the owner asked us how everything was and he sensed my hesitation about the vegan burger and asked me about it.  I shared my thoughts and he too, accepted the feedback graciously and was thankful it.    Oh, and I forgot to mention that they do have vegan dessert options but the woman who makes them was on maternity leave at the time of my visit so when I go back I hope I can get to try it.  The ice cream from Two Scoops is all dairy but hopefully one day they'll have a non-dairy item.    This place has some improvements to make but with an owner who seems to be willing to receive constructive criticism, they can be made.   That is all!"}
{"text":"The coffee/crew keep me coming back. Always stoked to see Amber & Will behind bar, they never disappoint. There on a weekend? Walk right on past any pouched pickles and enjoy some top shelf donuts from Move That Dough Baking Co."}
{"text":"Great new spot to hang out! It's very open and I'm assuming they will be getting more stock of products or vendors. In the meantime, there is a huge coffee bar with local coffee, a selection of beer and wine, and in the back a place for sandwiches and salads (gluten free options ftw!) There's also an outdoor seating area if you're into that."}
{"text":"I've been here twice now to eat and do some work.   Space: plenty of seating; bar, booths and tables. It's open and light, plenty of sun shining through and right in the heart of Dilworth. The bar serves local beers on draft. Again, very large bar area.   Food: I've recently had the People's market salad and added chicken salad on it. Overall, this is a large salad. Veggies were fresh and crispy. Now, I am a little picky about my chicken salad but this was pretty good. Large chicken chunks and light mayo. I've also had the chicken biscuit. I ordered it as it comes, but it the future I would add pimento cheese and maybe some lettuce. I didn't love the mayo on it.  The nitro cold brew is awesome! Served in a pint glass and coming in around $4.75-ish.   There is a large beer and wine selection in the store area. Some chips to choose from to go along with your meal. Overall, a place I will return!"}
{"text":"Very cool place, great location, free wifi,everything is fresh and they have outlets all over to plug in your laptop or charge your phone"}
{"text":"I'm so happy The People's Market opened up. We need more places that emphasize community and TPM really does that. First off, it's HUGE. There is so much room. Lots of different seating options. I like that the coffee and food are separate, so some people can sit at the bar and others can order food and sit down. There are retail items for purchase all around - an extensive beer collection, wine, snacks, ice cream - you name it. At the bar, they have coffee (including nitro cold brew, my fave!) and beer and possibly kombucha on tap. Plenty of vegan milk options.   Then you head to the back where you can order food. You can pick up a pre-prepared meal or order something hot. They have a variety of options - nothing wildly healthy or super inventive but all very solid. My one big gripe is everything is served in to-go containers: why? Doesn't make sense to me.   Whether you're looking to catch up with friends over a sandwich or sit for a while on your computer with a coffee, TPM has a spot for you!   Oh, and there's a little patio outside too!"}
{"text":"A group of us that are all 25-26 came and the women denied 3/6 of our ID's. The 6 of us are visiting from out of town and of course don't have local id's. Will never recommend this place."}
{"text":"Place is just what East Blvd needed. Have been to grab coffee and get work done, just eat lunch or have a beer with friends and play board games. Definitely still new, and once they find their groove will take off. Look forward to going back soon."}
{"text":"I anxiously awaited the opening of People's Market.  The area definitely needs a Common Market/Rhino Deli type establishment.  Unfortunately, the final product doesn't hit the mark.  I'm left wondering if they rushed to open before they had the store fully stocked.  You only get once chance to make a first impression.  I walked in asking myself, \"are they really open?  where is everything?\"  It's heavy on beer and wine but not much else.  How about lots of healthy snack options and non-alcoholic beverages like various types of kombucha? The lunch menu is ok but it would be nice to have non-processed protein options like chicken breast, natural unprocessed turkey breast, salmon, etc.  I'm in no rush to return unless I hear that they've filled the store out with more choices.  I'm not suggesting you need to clone Rhino or Common Market but perhaps walk through and get some ideas, otherwise People's Market is just too limited."}
{"text":"oh! I didn't know I missed reviewing this after my first visit...but now I have been twice, and it's a nice spot.  Justin and I went for breakfast on a weekend morning, and i enjoyed my breakfast. I thought the portion was hearty and they had great gluten free bread. Justin wasn't totally impressed with his breakfast burrito, and they were still new, but the deli menu was expansive and they had some local offerings, too.   We went most recently on a Sunday for lunch after a car ride. I had the cobb salad and a side of cucumber salad.  He had an egg salad sandwich and a bag of chips.  Both of us enjoyed these very much. The frist trip, the food scene was more of like a food museum -- with like one or two random cans of this or that -- honey, or jam, or one or two bags of the same coffee. When we went the second time, they had fuller shelves, and also fuller seats. It was wonderful to see the place buzzing.  I think they'll make it. There is ample parking even though East isn't always desirable to drive down."}
{"text":"I've been here five times now. I always enjoy the food. It's consistent and tastes great. It's always clean as well. I recommend it to everyone that's looking for a good breakfast spot."}
{"text":"Cute spot! I really liked my sandwich! Really chill. Great place to hang with friends."}
{"text":"Coffee and muffin were good, eclectic menu and I loved how the setup and flow of the restaurant was there was such a ease of ordering but wish it was a more comfortable space. Lots of outlets for working but it didn't have a warm inviting environment that i am looking for"}
{"text":"Everything here is great. It's a perfect casual breakfast or lunch spot. I got the lavender vanilla iced latte and a breakfast sandwich with modifications. Delicious!"}
{"text":"The concept is good. I don't get a warm fuzzy feeling from the staff or the market. Beer selection is okay. Not a wide variety on tap. The wine by the glass is very limited.  Not sure I will return."}
{"text":"Great aesthetic, and lovely wine selection! The food is great, a little pricey for a biscuit BUT breakfast is served all day which is a major plus for me. They also have gluten free bread! Not bad considering today was day 1 of their business. We will be returning to try some of be beer on tap and more of the food selections."}
{"text":"AHHMAZIN' breakfast sandwiches, great beer selection, and the coffee ain't bad either. The place is HUGE and feels like just a comfy neighborhood hangout. Plenty of spots to drop down with a group, or grab a spot at the bar or counter seating. Also some comfy looking couches on one side."}
{"text":"Noticed this place while walking to Starbucks across the street and thought I would check it out. As others mentioned, you order at the counter all the way in the back, plus you pick out your drink and snack first.  I ordered the BLT and had plantain chips with cinnamon to accompany. The BLT was good, loads of fresh avocado on it, and the bacon was nice and crispy, just the way I like it. Interior was spacious with a warehouse feel. They have a bar inside, plus loads of wine and beer to purchase."}
{"text":"Oh I love this place! I could spend all of my monies here and all of my time. Breakfast, lunch and dinner. Coffee, beer and wine. All the things you need! Their food is delicious and they carry pastries and those famous vegan donuts. The coffee is really good and the staff are friendly and helpful with making recommendations.  The space is huge and there's plenty of seating around the place. It's a very open concept but set up in a way that it feels like there's different areas. I ordered just a hot coffee and an amazing breakfast sammy and took some baked goods to go for later. Parking is a little crazy since it's on the corner of East Blvd and Kenilworth, but I'll definitely be back."}
{"text":"I've read the positive reviews and tried to see what they were seeing but I just cannot. I was so excited about this place. Totally was expecting a Dilworth-spin on Earl's Grocery. But what we got is an IKEA market. It's stark and not welcoming and the aluminum barstools are so uncomfortable (so much for hanging out with friends). Everyone in the neighborhood with a work from home gig, and every PTA mom who has breakfast and/or lunch committee meetings (I identify with both categories) was anxiously awaiting somewhere besides Mayobird to eat while meeting. The food quantity and price point doesn't make up for the lack of ambiance or personality. The space is so huge and has so much potential. Right now it's a drafty cement slab with tons and tons of unused space and no character. I'm rooting for it to adjust to the hood, but Dilworth deserves more than what The People's Market is currently offering."}
{"text":"Obsessed! Great priced wine, no corkage fee, yummy food (had the vegan burger). Definitely will be back soon!"}
{"text":"Was at the People's Market for a Blogger event! This place is so nice, very tasty food, and the cofee in a cone's are to die for!!"}
{"text":"The People's Market is such a cool place! Such a variety of things to go for. They have a great selection of wine and craft beer from local breweries, as well as a coffee bar by day and bar at night!   The breakfast selection is great! We had breakfast sandwiches when we first went, but could easily order one of everything! The inside is chill too, some outdoor seating available too. Parking can be tough but it's worth it!  There is also a great lunch menu!! I would highly recommend this place for any part of the day or even to just sit back and relax!"}
{"text":"This is a cute little market/deli. It is hard to find parking. The turkey and the blt are good sandwiches. They sell wine and have a beer bar."}
{"text":"My first visit of this highly anticipated neighborhood market was disappointing. With not so far away competitors Earl's and Common Market, People's Market needs to step it up. I feel like they are no more than 70% there in any aspect of their execution. But, there is a ton of potential for this place to be fantastic.   Here are the issues I found:  1. Not enough selection. Sparse shelves with limited selection. Too much space dedicated to seating and not enough to buy.   2. Limited beverage selection more like a Convenience Store than a local market. My water selection was limited to Dasani and the likes. No sparkling water selection, no artesian water selection.  Ditto for soda selection. If it isn't a Coco Cola product don't look for it at People's Market.   3. Fresh foods seem more like a local deli than gourmet market. Maybe that is all they are shooting for. The menu was uninspiring. My wife ordered the highly recommended chicken biscuit. She expected a fried chicken breast but received chopped up dark meat reconstructed when fried in the batter. This should have been disclosed as she wouldn't have ordered it.   They do focus on locally sourced selections and beers (but not soft drinks), which is great. They just need more of everything and to step it up with the food to attract the neighbors as regulars."}
{"text":"Stopped by this morning to grab some coffee and breakfast. We just moved to Dilworth so I'm really happy we have our own little market for quick bites, beer/wine, and coffee.   I ordered the sandwich first. Bacon, egg and cheese biscuit. I actually ordered it for my husband, but I took a small bite it was really tasty. My only qualm is that they use American cheese... lord knows why? Can that really even be considered cheese? I wish it was an aged cheddar or something else really.. anything other than American cheese. The sandwich was $5 and it was large too... so the size and price worked for me!  I was surprised at how quick the sandwich came out. That was pretty awesome.   I then went and ordered a cup of coffee. It was a little over $2 for a local roast. This seemed reasonable to me especially because it was a local roast.   Very cool spot. I was rushed (due to said move), but I look forward to stopping back there again!"}
{"text":"Just looking for a place to have a breakfast sandwich and this place popped up with pretty good reviews so I hopped into dreadful traffic for a 45 min 12 mile drive. Upon arriving we were pleased to see they have their own covered parking garage which is free! The place is very nice with plenty of indoor and outdoor seating. You can place your order at the bar or the kitchen.   The staff was very friendly and started us off with two amazing Lavender Vanilla Iced Coffees  but it didn't end there. I ordered the Chicken Biscuit thinking what the hell you can't go wrong and if you've had one chicken biscuit you've had them all. Well I was very wrong! This was easily the best chicken biscuit I've ever had! The biscuit was so soft and fluffy and the souther Fried Chicken was crispy and very flavorful accompanied by some delicious sausage gravy and scrambled eggs.    Hands down the best I've had! I'm definitely coming back and I recommend you give them a try, you won't be disappointed."}
{"text":"Not impressed!! Our sandwich lacked basic seasoning. Our coffee was very watery... The place lacked cohesion with regards to ordering... Had to order breakfast in one area and coffee in another. The only thing positive I can say is decent decor and plenty of seating. Won't be going back."}
{"text":"I'm so happy The People's Market is finally Open! I went here a few times since it's in a convenient location. First, they have a solid food menu. The breakfast options are AWESOME and the coffee is delicious. I opted for the breakfast burrito, which was filled with egg, potatoes, cheese and a great herb aoli. I was stuffed afterwords...just like the burrito. I highly recommend for breakfast!  Lunch also had a great selection. I had a turkey sandwich with tomato and sriracha mayo (not spicy but had good flavor). I saw they have salads but didn't try any. If you don't like what they offer, you can build your own.   One of the best parts about The People's Market is the array of local foods stocked on the shelves. Love the local support! Aside from the shelves, they have a bar with a bunch of local beers on tap.  Overall, a great, clean, modern space to gather with friends to come by yourself and have a beverage and something to eat. Fair warning, they food takes a little while to come out, so don't swing by if you're in a massive rush. I'm sure I will be here multiple times a week and will be cleaning them out of pimento cheese and beer."}
{"text":"This place is interesting. Came in to try their deli with my colleague for lunch. We checked out the menu online and were intrigued by the all-day breakfast.  I had the avocado toast, which is made off wheat toast, guacamole, tomato, red onion, over easy egg, cilantro and added the country ham as protein. It's a $2 upcharge, but I wanted to off-set the sweet guacamole with salty ham.  It was delicious. It fails to say that it is an open-faced sandwich. So make sure you take some utensils with you or things can get messy.  Also added the soup of the day, which was a mushroom and leek chowder. The soup was good, creamy, like you want a chowder to be. And got zappops chips (made in NOLA)...get the Voodoo ones! Any of the 2...love love love  My coworker had the chicken salad sandwich which is made of chicken salad, glazed pecans and red grapes with lettuce, tomato on a brioche bun. She swears by that brioche bun - her guilty pleasure. She also added a soup of the day (they had 2 plus the daily chili). She had the mexican beans soup. Which she loved as well.  Overall the menu was great. I was split between the avocado toast and the morning rancheros. Definitely will try that next time.  They still have a lot of kinks to work out. The layout of the \"Market\" is all over the place. It's very sparse and you have to go from \"station to station\". I'm from new york, so i'm used for things to be more crammed and within arms reach. I think it was more the flow of the space. The cashier did note that she wasn't sure where the home made cookies ought to be. They were at the \"market register\" and I'd suggest them to be by the coffee bar, as you would want something sweet most likely with you brew.  Also odd was that after ordering / getting our food from the deli (all the way in the back) we had to get water at the bar (all the way in the front). With our hands full with our food, we had to walk a lot before getting seated. I wonder if they can serve water from the deli directly. I can understand going to the bar for coffee or beer. They do have soft drinks available in the fridges next to the deli.  They have unique edible goods to purchase, artisan beers, local and international (I'm German, so I appreciated the made-in-germany hefeweizen in a bottle, just like home!) The feature local brews on tap and bottle / cans as well as two-scoop creamery ice cream (YAY! - get the cookies by the sea!)  Lots of space for sitting and chillin, do some work, lots of outlets. there were a few people meeting, for what i guess work. I didn't check the wifi, but it must be good with the amount of people that were there.  Definitely going back to try more of their menu and hopefully they will figure out a better flow of the space in the meantime. Perhaps update my review on their improvements. They just opened and I hope they are there to stay, because the food and the concept are great."}
{"text":"For my first visit here, it was right after they opened. My boo and I came early afternoon for lunch and a beer. What's nice though is that they serve breakfast ALL DAY! So I ordered an egg and veggie wrap with potatoes and some sort of cream sauce. I liked it a lot, but after sitting down at the bar and getting to know the bartender, she informed us that some menu changes were coming down the line and that would not be on it.. boo. That being said, the beer selection was great and the bartender was fun to talk to without being annoying either. Everyone here is really kind.   Upon the second visit, the same bartender actually remembered us! We continued the convo and trying even more beer options and I also ordered another menu item. Wasn't as impressed, but it won't stop me from going back again.  The atmosphere here is really chill. Music varies, but it's all fun and easy to listen to while you eat/read/work. It's one of those places you can come to hang or just for a quick bite. Outside they have a fireplace which is superrr toasty on a cold day. :)"}
{"text":"Wow! Definitely worth the 40 minute trek from north Huntersville down to Dilworth. We enjoyed everything: the chicken biscuit with sausage gravy, deacon breakfast burger, bacon-egg-cheese biscuit, and Plain Jane cheese burger. The burgers were perfectly cooked & moist. On top of hot food, they offer a variety of desserts: ice cream from Two-Scoops, King of Pops, & lots of pastries. The bar features beer, pina coladas, & coffee. I really like that you can get a little bit of everything here. This is a very family friendly joint and we will definitely be back very soon!"}
{"text":"Love this spot for grabbing a coffee or a beer and some snacks and getting work done. They have plenty of space, lots of outlets and very good food and drink options.  Our favorite food item is the Market Bagel (turkey bacon, avocado, egg, american cheese, tomato, on a white or everything bagel).  We can usually find street parking when we go (typically weekday mornings). Staff is friendly and helpful."}
{"text":"Definitely a fan of the People's Market.  I should preface that I've only been here to have a drink and hang out, so I need to come back and try their food options.  Overall, I like the concept.  I'd agree with some of the previous reviews saying it's a little \"confusing\" but I think  you come into a relaxed atmosphere, clean-modern space, where you can just relax (do some work with the free wifi), meet up with friends, have a bite, etc.  The staff will help direct you to whatever you are looking for :)  The staff are really nice.   Bartenders have to do a little \"extra\" here since there's an ice cream case and the kitchen is in the back by itself.  I always am a fan of the princess leia artwork on the walls as well as the huge bookshelf of board games.  Concrete floors and wood tables give the space a warm and industrial feel while the large windows let in a lot of light.  Their outdoor patio seems to be a hit... whenever the weather started getting nicer, it was always a sure bet to find people out there when I drive by on East.  There are plenty of tables and chairs... lots of single-seat bar seating that gives you access to outlets and USB chargers for all your devices.  High top, regular seating, tables..... if you can't find a chair you like in this place, there may be a problem."}
{"text":"Potential for sure with a great location, but if you're going to call out vegan options, deliver. The vegan burger was better than the boring vegan sandwich with a very small amount of bland hummus. Also, how about containers you can recycle or compost or have a smaller impact like paper? Those #6 containers are not recyclable. And where are the recycle bins to dispose of what you can recycle??   We will not be recommending this place to friends and family until it improves."}
{"text":"Walked in this morning around 10:30, sat at the bar to an inattentive bartender and waited a few minutes before he walked away. Well, I walked away also, right across what street to Starbucks. It will take a lot of encouraging to get me to return to The Peoples Market."}
{"text":"I'm disappointed in this place because the hype was so big leading up to its' opening. We walked in for a coffee and breakfast and did not get warm and fuzzy feelings from the staff. The place feels cold and unwelcoming; the staff were taking to each other and I felt as though I was interrupting. My latte was cold and sweet and there was nothing personable about my interactions with the barista. Again; felt like I was interfering on his morning. After buying a $6 juice and $17 almond butter (seriously!??) we checked out the breakfast options. Deli sandwich was terrible quality; greasy, cold, sloppy. Would return to buy wine and cheese but would like to see some improvement in the customer service aspect. Concept is great and has some real potential!"}
{"text":"I stopped by The People's Market to continue my adventure around Charlotte to try all the Reubens the city has to offer. Although most of the unique, non-traditional Reubens have been unimpressive, this one was a hit.   The People's Market boasted a 'Southern Reuben', swapping out the kraut for coleslaw and tossing on mustard instead of Russian. They also subbed in pastrami for corned beef - all around a very different sandwich than your traditional Reuben.   Although it wasn't one of the best Reubens I've had around Charlotte, it was a quite tasty sandwich. The pastrami was unbelievable - juicy and flavorful, it's everything you could want from the main part of a sandwich. The slightly sweet coleslaw was balanced out by the bite of the mustard. The cheese was barely noticeable on the first half as it had somehow migrated to the second half (literally it was coated on the second half and I couldn't find it on the first half), but that second half of the Reuben was perfect when all the flavors came together.   My biggest issue was the bread - they didn't toast it. Although the rye was ok, the untoasted bread just doesn't work on a Reuben.   Overall I think this Reuben is worth a try for it's creativeness, but there are definitely better Reubens around the city."}
{"text":"I agree with the overall 3.5 rating but I'm rounding up to a four because the atmosphere is nice.  When you walk in, it's confusing.  There are multiple order here signs. To order food, you walk all the way to the back.   The order coffee you go to the first bar section.  If you want to order a sandwich and get tap water, you order in the back and then wait in line at the coffee section to get water.  I think they should have self serving water out like Amelie's to solve this problem.   There is a huge variety of drinks both alcoholic and non alcoholic.  I love the way everything is displayed it's very trendy.    I ordered the blt sub cheese for tomato (I'm slightly obsessed with cheese) and my husband got the chicken salad.  Our food came out super fast.  My sandwich was wrong, but they were quick to fix it so I thought that was really good customer service.  The sandwiches were good but nothing special or unique.  We ordered chips as a side.    I would like to go back for breakfast because it looked like that is what most people were ordering.    This is a cute place to bring out of town guests."}
{"text":"I love this place. I've been here a few times now and here are my hot takes:  1. Lots of seating and different seating options which is really nice. Whether you need a large table to play board games, or maybe a nook by the window to eat your ice cream, or maybe you want to sit outside and people watch, they got you.  2. Draft beer, canned/bottled beer, coffee, ice cream (Two Scoops), deli/kitchen, wine, fresh pasta (Pasta & Provisions), charcuterie stuff, groceries--anything you're in the mood for they got. While this variety is awesome, it does make for a confusing first-time experience. Just so ya know, you can open a tab and use it anywhere inside (deli, coffee bar, bar, etc.) and then close when you leave.  3. As for food: - Their Southern Style Reuben is an interesting creation but if you're a mega reuben fan like me, it's meh.  - Their cobb salad (really why I came here to write today) is BOMB. It's only $8 and includes meat??!?! Really fresh and delicious. Also, I asked for honey mustard dressing, even though it wasn't listed, and they had it! It tasted homemade. It was really good and high quality.  - I haven't had their breakfast yet, but that is my friends' favorite thing to get there. Still to try. It's served all day too!!  4. Staff is always friendly whenever I go.   ** Also, when I went last night, one of the employees told me their menu was changing soon. So keep your eyes peeled."}
{"text":"My visit here was extremely underwhelming. I was waiting for the chance to come here, now that I have, I may not come again. The food selection was tiny and just not worth the money I payed for it"}
{"text":"I really love this concept for a do-it-all market! They have wine by the bottle, beer by the can, and draft beers on top of it all. They've got pre-packaged foods, snacks, and a full kitchen putting out sandwiches, salads, and breakfast foods (all day!).  We happened to show up on $3.50 pint night, which was fantastic. It's so refreshing to go out for drinks in a trendy neighborhood and only spend $7 (plus tip). They have a decent selection of local and national craft beer, but don't go expecting 20 taps of every style imaginable. They also do not have a full bar, if you're looking for that.  I really enjoyed their Superfood Salad. I firmly believe that salads should have as many ingredients as possible, and People's Market delivered. From avocado to craisins to soba noodles, this salad packed a punch! The cool salad and cold beer were the perfect antidote on an (extremely) humid night after an (extremely) hot yoga class.  Shoutout to the Carolina Honey Sriracha chips - they are delicious! I've never seen them anywhere else before and was pleased to find a regional good on the shelves of People's Market.  Will definitely visit again when I'm back in the neighborhood."}
{"text":"The space has lots of seating, which is nice, but if you are going to call this a market then it should have more market-like options.    Went for a sandwich and coffee - the sandwich counter lost our order and it took us 30 minutes to receive 2 sandwiches and the coffee gal seemed confused by the coffee order.  Their water machine wasn't working, so I had to also purchase 2 bottles of water.   This place has potential and a good atmosphere.  Will likely give it a second chance."}
{"text":"Overall this place is good with potential to be great. I've been here many times because of convenience and the quality of food is really good. I haven't had a bad sandwich yet and I've had about 6 different options (breakfast and lunch). The atmosphere is very inviting and is great for everyone. However, the large open areas and organization of the market  is confusing. They do not serve iced coffee unless you want to pay $5+ for a nitro cold brew or pay for a cup of ice. Overall, I enjoy coming to this place often but there is definite room for improvement."}
{"text":"BLT was a 9/10, but the service needs some work. Lot of people working there but no one is really paying attention to what's going on.  The staff just takes the chill vibe too far, to the point where chilling out is number one priority versus helping customers. I think once that part gets worked out, this place will do fine."}
{"text":"Pros: Parking in the parking deck Great breakfast and lunch choices Great beers on tap Great coffee Friendly staff Lots of places to sit  Cons: Can't really think of any besides the baked goods being a bit overpriced.   This place is great to grab a beer or a quick bite to eat. The ambiance is cool. Very clean and trendy. You can also get bottles of wine or beers to go."}
{"text":"I usually don't like hipster-ish places like his but I always have a great time.  Decent beer good food and nice people. No my go to but always a great spot."}
{"text":"We love the concept and every employee we interacted with was awesome. The menu looked promising and we decided on a chicken biscuit, soda and water. The water bottle was small and $2, which seemed crazy to me. Other stuff was more pricey than I'd expected but I'm willing to pay extra to support local businesses. Aquafina, however, is not a local business so I wasn't feeling that price.   We sat down after ordering our food and were surprised at how quickly our name was called. When we tastes our food, we realized why - our sandwich was luke warm, at best. I went up to the counter for hot sauce (because I believe Texas Pete makes everything better) and noticed an employee bringing a bowl of cooked chicken from the back and setting it on a warmer in the front of the kitchen. I realize this is probably why our chicken wasn't hot - it had been sitting there, premade before we ordered. I would've rather had a few minutes longer of a wait and had hot food that was cooked to order. The taste was okay but not stellar and the biscuit fell apart. When we were finished, the bottom of the container looked like we had literally crumbled up the entire biscuit into small pieces. I think this biscuit could be great if it were executed better.   We will be back to buy local products but will probably wait awhile to revisit the deli again."}
{"text":"Wow. Peoples Market is on point. I've been going since the beginning and they've really stepped up their game. This is the quinoa salmon salad. Super tasty and healthy option. Quality is awesome. Can't beat it since I can walk here and they've been making some huge investments in the neighborhood.  #supportlocal"}
{"text":"What a cool concept. I love what they have going on here. It's nice to see more urban markets popping up around Charlotte.   I came here for lunch one day. I wanted to get the That's Balogna Grilled Cheese, but they took it off the menu and hasn't updated it.  They serve breakfast all day, so I ended up getting breakfast country sausage grilled cheese. It was pretty good.   They have a decent amount of seating. Along with the restaurant portion, they have more grocery items, a bar, ice cream, and a bottle section.  There are board games too!   I do wish their menu were a bit more expansive, but all in all, this is a good place to hang out. You can get a little bit of everything all at the same place."}
{"text":"The ease of The People's Market is amazing. Easy parking, easy location, you can easily order online. The environment is crisp, clean, and roomy. There is a covered outdoor patio with picnic table like seating. There are some great local products and beverages available. However, my dropping of stars is for the vegan food.   It's tough to be a vegan in an omnivore world, so when restaurants have a whole separate section for vegan choices it gets exciting- as lame as it sounds.   The upsetting part about this review is both times I have purchased the food, for me it is just subpar. Most recently I had the Latta Good Stuff. I ordered it online and said to add avocado, which they did not. Additionally the bread was supposed to be toasted and it wasn't, resulting in a crumbling mess. Finally, the amount of ingredients to bread ratio is extremely off. The humus was a minimal amount of spread, definitely not enough to even cover the bread and get the flavor . There was one piece of tomato, one piece of lettuce, etc. just not enough to give me flavor. I tasted more bread than anything. If they just bulk up the ingredients and make it worth it, I'll be so happy to support this nice market. But I need to enjoy my food!   I'll keep trying, but please improve the vegan dishes."}
{"text":"I personally had a stellar experience at The People's Market. The Lady and I stopped in here for a Sunday brunch, and were pleasantly surprised at the variety and price point of all of the menu items!  First off, parking. The Lady and I call that shopping center \"Dilworth Dilworth\" because it houses Pio Pio as well as Thai Thai. So it makes sense. Feel free to use that for yourself, you're welcome ;) We parked there and walked across the street.  We walked in and pretty easily figured out that the food ordering was in the back, so that's where we head! Two things here: They should probably get another register in the back for busier days, and they should also figure out which way the line will curve. There's not too much space, and aside from waiting for the guy in front of us to figure his life out, we had multiple people ask if we were in line or where the line was. I ordered the BLT and The Lady ordered a breakfast burrito. We gave our name, and headed to the bar to wait. There's a water machine there that was supposed to be able to produce hot, room temp, and cold water, but I think the temp functions may have been not working? Anyways, we grabbed water, took a seat at the GORGEOUS bar, and ordered ourselves a beer. I would also suggest for The People's Market to get updating draft menus like at breweries, because sitting on the end, it was hard to figure out what exactly was on tap. When we went, they had a fantastic list of really unique brews that a lot of places don't carry (including Deschutes!! Welcome!!). I saw they also had a nice esspresso machine on the other side had we gone the more traditional breakfast route, but luckily breakfast is served all day!  Our name was called and we got our food - which was absolutely to die for! The Lady loved her burrito and my sandwich could not have been more perfect. I heard they're still making a few changes to the menu, but either way, they know what they're doing in the back. Walking around the market, I was curious what market-esque things they had. Craft beer bombers? Check. Local snacks? Check. Bitters, pimiento cheese, cheesecake? You got it. I still do think that they could make do with some more local market type things, such as pastries and/or wine, but they've got time to stock up. Overall, The People's Market is off to a great start, and I'd gladly return to try out multiple items on their menu."}
{"text":"I'm so glad this place opened. The coffee and food are great, as well as the atmosphere."}
{"text":"My wife and I went last weekend and we really wanted to like it.  We have lived in the neighborhood for over 10 years and enjoy the variety of places to visit.  Sadly we felt that The People's Market doesn't live up to the standards in and around Charlotte.  Places like Earles Grocery, Common Market and Sunflower Bakery are miles ahead of this spot.  I hope that it is only growing pains and that this place will offer a better variety of items.  On the plus side, it is a large space with plenty of seating.  On the down side it looked like it was a pop up deli that couldn't bother to finish unpacking before opening.  The menu is ok for a deli and there seems to be way too much open space.  We waited to grab a cup of coffee and were never acknowledged and never asked if we needed anything.  I am sure this place will grow into itself, just way more options in the area until it does."}
{"text":"Usually a decent spot for breakfast but way overpriced for what it is, I have been a few times. I recently went there to grab a sandwich for dinner. I got the blackened chicken sandwich. It came on a bun that looked like a cheap store bought burger bun and was super small for being $9."}
{"text":"Walked In here on a Saturday night and was greeted by Kim immediately.  Kimmy was helping me with their on tap beers and  TJ was helping us choice wine. The kitchen made us a cheese plate (not on menu) that was to die for. Wonderful place. Recommend to everyone. Oh sandwiches, coffee etc ... will definitely come back the next time I'm in Charlotte"}
{"text":"If you're in the the trendy concept of Urban Markets, you need to stop by The People's Market at Dilworth.  Big space, plenty of seating in and outside. It's a great location to work out of or meet friends for drink.   I love the variety of items offered here--that said, I personally found it to be a bit expensive. However, I think it's worth checking out. We just had cold brews, but there were plenty of draft beers to pick from.   You can order food from the deli and the menu is relatively large for a deli, there is something for everyone."}
{"text":"Imagine if the common market had an older, more sophisticated, yet not as hip brother. kinda like Earl's, but more Dilworth less Elizabeth. This would be the People's market.   Pro's 1. Good parking options 2. Awesome open layout with a ton of tables, bars, etc, several outlets for working while eating 3.Lots of local, small business treats all around the market 4. All of the employees were incredibility nice  5. Good Latte  6. Nice music playing, easy listening 7. Open late-ish for a deli    Con's  1. different areas for ordering drinks and food makes it more challenging to get your food and pick up from different locations especially if you have a laptop set up. 2. Pricer in my opinion, but hey you're in Dilworth. 7 bucks for a bacon egg and cheese and $2.15 bottle of water 4. Really cold in the market  Considering this place just opened, it was running very smoothly and I'll for sure come back to visit. A lot more pros than con's which really weren't a deal breaker. I really enjoyed all of the space, open layout and so many windows. It's a nice addition to the area.  A casual place to grab a bite or drink while on East Blvd."}
{"text":"Has a ton of potential but definitely some kinks to work out in the kitchen. Took 25 minutes for my husband and I to get egg and bagel sandwiches and there were only 4 orders for the kitchen at the time. My order was completely wrong but they fixed it - non apologetic staff for the noticeably long wait and food issue though. Just have to find their groove and once they do could be a great place! Good atmosphere, wine and beer selection and location."}
{"text":"The People's Market is akin to Charlotte success stories such as Common Market and Rhino Market, but it definitely has it's own (Dilworth) vibe going. All of the employees are friendly and helpful. The food does take a while but they just opened yesterday. We ordered two sandwiches and there were two individual people in front of us but it took about 15-20 minutes to get our order. That being said, the club and the BLT were top notch. They have a great wine and beer selection. I did not try the coffee but will be coming back for one soon. Looking forward to more visits here in the near future!"}
{"text":"Convenient store on drugs is the perfect way to explain this place. A bloggers event was held here that i was invited to if it wasn't for that once again i would have never known this small hidden gem existed. Parking is right off on the side of peoples market in a good sized parking deck. The fact that the peoples market is surrounded by other eatery's and fun things to do is a plus. I could have just had a field day walking up and down the side walk. As i entered i notice all the people outside on the patio eating,drinking and having a jolly time.   When you walk in it is a very large amount of space. I didn't know where to go first. The set up is like a convenient store but of coarse way bigger. Almost like the perfect one stop shop where you can order sandwich's, they have a bakery, a cool spot towards the back to buy wine and so much more that i didn't get a chance to explore. The bloggers event sponsored us food here so i will have to come back and try out peoples markets goodies. Perfect name for this spot by the way"}
