{"text":"Awesome show!  Very entertaining.  Not totally sure how he guessed a few of the things he did!  Definitely an entertaining evening."}
{"text":"Great show!  Very entertaining and interesting.  Mr. Gladwell is professional and energetic-- we had a great time!"}
{"text":"I really enjoyed this show.  Bill was great with the audience and did some really interesting mind 'games' with the group.  Things that he couldn't have known he did!  Don't miss it if you're in the area... I can't imagine any of the huge productions around there being better than this!"}
{"text":"This show is a must see!! My husband and I have been coming to Gatlinburg for years, and wanted to see a show we hadn't seen before- I'm glad we saw this one! Bill is interactive with the audience, and the tricks or \"mind reading\" Bill does is unexplainable. He has a great sense of humor throughout the entire show. Fun for the whole family- theater is small, so you can't have a bad seat (located inside the Arcadia). Very impressive and worth the money. Go see this show!"}
{"text":"A friend and I just saw his show tonight.  It was a very small group - only 11 people.  Highly entertaining!    He's amazing.   He was 100% right every time.  He was able to guess the type of pet and actual name of my friend's cat...and it is no a common name!"}
{"text":"This is a great show.  Good for all ages. We were still guessing how did he he do that the next day"}
{"text":"This show is great for all ages and extremely crowd interactive.  Our little group included adults, college aged and grade school aged kids.  We all had a fun time and two of our boys even made it up on stage. Thanks, Bill Gladwell, for providing a funny and entertaining alternative to the \"big\" shows in Pigeon Forge."}
{"text":"Wow!  What a great show. Did not expect to be so entertained and baffled!  A great time and something we took teens to."}
{"text":"Bill Gladwell show was very entertaining and enlightening. I would recommend him for any visitor to Hilton Head Island."}
{"text":"Bill Gladwell was AMAZING!  Have seen many shows before, but he really makes you think.  Nice to see a family friendly show where both the adults and kids enjoy.  He makes everyone feel part of the show.  Great time!"}
