{"text":"I have been meaning to try this place since it opened last year and yesterday I walked by so decided to give it a shot.  I ordered The Harrison which came with a ground beef patty and a panko crusted cheddar piece.  The panko crusted cheddar was great.  I would probably ask for less (or no ) sauce next time but in general I am not much of a mayo/sauce kind of guy.  I would definitely go back to try more of the menu.  It is a bit on the pricey side but the sandwich alone was filling even without a side."}
{"text":"\"Not right now, it's too busy\" is a TERRIBLE excuse for customer service when requesting sauce on the side for a sandwich. So is cancelling a ritual order for a sandwich that was advertised as available during the order. It's very unfortunate that the card machine prompts for tips at time of order, as the service to follow is definitely undeserving. It's not even like this place is an extreme bargain, I would expect better from a place that serves $13+tip sandwiches."}
{"text":"Price is a bit steep for a sandwich 8-10$ usually with some 10-14$ 

I've tried at least half of their menu... The club, Harrison, fish, steak and enjoyed each sandwich. You can't really go wrong

The barbarian steak for 14$ ends up being really expensive though, and was messy .. But I didn't regret trying it. 

I would recommend this place forsure"}
{"text":"My friend started working here a couple weeks ago so I figured I would go check it out. Seeing the abundance of good reviews, my expectations were high. Like my friend suggested, I ordered the Calamari sandwich. The staff was very friendly and my food came out in less than 5 minutes (it was 5:30pm on a Thursday). Seating was limited so I decided to eat at home. 
Now. This was my first ever calamari sandwich and, truthfully speaking, I don't think others can top it. For $10, the amount of calamari you get is unbelievable. All of the ingredients were very fresh and the ratio of the bread, toppings, and calamari was perfect. Flavorful, crunchy and oh so satisfying. Although I did feel as though the sandwich got a little heavy at the end. 
Overall, great restaurant with warm staff and impeccable food. Will definitely be coming back soon!"}
{"text":"A shame that the service is so poor because the food is decent. We were the first to arrive at TLP and ordered 2 steak sammies. 2 parties came after us, and they got served before us. We only got one sandwich before them. We felt slighted because they served the regulars and the next guest after. The person before us also got the same order, how is that okay? They also forgot the gravy and the fries. Thanks, never coming back if it's the same 2 girls working this joint.

Good thing I am not a germaphobe. I noticed the cashier today (feb 6, 2016) was on the phone and didn't wash her hands before touching the buns, and wiping them on her shirt. Bravo on the hygiene."}
{"text":"Decided to go with the Harrison sandwich which had beef, panko cheese, jalapeño relish and aioli on a bun.  Pretty much a burger but it was so good. Would come back again for sure."}
{"text":"Great takeout option! The Harrison and Calamar are particularly delicious!"}
{"text":"In my opinion, TLP has the best sandwiches in downtown Toronto. The Harrison is my favorite; however, all other sandwiches are great!"}
{"text":"I liked this place, nice little hole in the wall. I went out in a group to this sandwich shop. I had the steak sandwich. It was decent, but the steak was a little tough. But, luckily I was able to sample the jerk chicken and club sandwiches. Both, in which I found very good. Despite my sandwich being mediocre, I could tell the taste and quality of other sandwiches was up to par. I'd go back if I was in town, but just for a quick lunch or take out. Not really any seating"}
{"text":"Stopped in after elmwood spa today for a girls day and grabbed some lunch.  Cute little sandwich place with friendly staff.  Ordered the TLP and it was great.  You can add your own condiments as well.  Would return if in the area again for sure!"}
{"text":"Fantastic, friendly staff; great energy and I always get service with a smile! Food is so so delicious - I work nearby and I go there at least once a week. I am on a keto diet (extremely low carb) and they've always accommodated me by turning my sandwich into a salad - not a half assed salad but fresh mixed greens piled with the sandwich toppings. I can't rave about this place enough. Their Charlie Blake has my mouth watering just thinking about it and the horseradish sauce it comes with is my favourite.  The steak from their steak sandwich is so tender and juicy, it just melts in your mouth. There is nothing on the menu I wouldn't recommend!"}
{"text":"The What a Jerk! sandwich is spicy but very tasty with excellent crispy texture on the toasted bun and ends of the pork."}
{"text":"Good sandwich shop. Big fan of the potato wedges. I will say that there seemed a little too much bread for the amount of filling in the meatloaf sandwich and the steak. The Harrison was the winner for us. Conveniently positioned in front of a city of Toronto patio."}
{"text":"Located right beside the Barbarian's Steakhouse, it wasn't as hard to find as I had initially thought. I had a bit of a craving for a nice gourmet sandwich and their sandwich did a good job of hitting the spot. They have a good selective menu of sandwich and the sandwich itself was big. It was serve to order and was piping hot when I ate it. I got the Barbarian's Steak Sandwich and not only was it super flavourful but it wasn't dry which is the death to any steak. The steak is seasoned with the spices from the Barbarian's Steakhouse and it is well known for a good reason. My friend has gotten the Country Chicken Sandwich and I had a bite or two of it (he had to stop me or I would have finished it). It was incredibly  juicy and flavourful, the about it while writing about it makes me salivate. Will definitely be coming back again and I will be sure to make my way through the menu since both of the sandwiches that."}
{"text":"Went here on a whim about 10 minutes from their closing time and am sure glad I did. This shop serves up a sizable sandwich, that doesn't lack in meat or condiments! What a great meal :D

The Harrison (4.5/5): This is their Barberian's ground steak that is sandwiched between panko crusted deep fried cheddar cheese and generously served with jalapeno & red pepper relish + roasted garlic aioli. Is your mouth watering yet? The ground steak is cooked fresh on the grill while another server slathers their soft buns with le condiments. Altogether the sandwich is a savory and wonderful concoction, that will fill any hungry belly to the brim with joy. The meat is juicy, the cheese is stretchy, and the bread is moist while still be strong enough to support what's inside. Would highly recommend this sandwich shop to all! I will definitely be back to try the others :)

Cost (4/5): The Harrison is $10.85+tax which is a fair price considering the sheer size of what you are served. More than happy to give my patronage here!

Service (4/5): I felt kind of bad ordering 10 minutes before closing, but none of the people working there seemed annoyed, but instead treated my boyfriend and I very kindly. They did not rush us in anyway and I am glad for it. Our order came in a jiffy and we were in and out within 15 minutes!

Can't comment too much on the ambiance since we didn't stay for that long, but it is more of a take-out place with about 2 seats inside. However, there are benches on the sidewalk at the front of the store where you can certainly have your sandwiches. The place itself is neat and they even have a wall where you can draw your own pigs, how cute :)

Overall, I enjoyed TLP and will be back for more!~"}
{"text":"Fantastic all the way around. Highly recommend the Flat Top Chicken Thigh and the Fish sandwich (usually only available on Friday's). The fries are also incredible."}
{"text":"Just go already. The Harrison is fantastic as is the TLP peameal. I'm sure the other sandwiches are just as good but have yet to try them."}
{"text":"I've tried at least 5 different sandwiches and hands down I still dream of going back for the Calimari burger. They have amazing humour, amazing service and the place is packed lunch time! Everything on their menu is worth the wait tho ...hence going back tomorrow :)"}
{"text":"The TLP (peameal) sandwich is really good.  I've never had peameal that tender before.  Probably the best peameal sandwich I've ever had.  The only thing that could make it better is if it was better seasoned.

The calamari sandwich is pretty good as well.  

The braised beef sandwich is so flavourful and tender.  

The flat top chicken thigh sandwich is good.  Really glad they use dark meat instead of white.

The vegetarian sandwich is a bit blah

Updated on Feb 17th

Their special on Thursday, the canuck is one of my favorites.   It's a peameal sandwich with panko breaded deep fried cheese with an apple slaw.

Tried their steak sandwich, definitely tasty.  It is very flavourful...Seems like a sandwhich to have once in a while, but not everyday.

I tried a new sandwhich recently, can't recall if it was a special or regular menu item...it is essentially a thick homemade hamburger patty, panko crusted deep fried cheese, garlic aoli and some sort of a relish....it was another well put together sandwich...that said, it cost of $10 for it.

They have changed their veggie option...it's no longer the blah eggplant sandwich."}
{"text":"I had the Barberian's steak sandwich.  Garlic butter, mushrooms, cubano peppers, caramelized onions. It is probably the best steak sandwich I have eaten. Along with it I also had the beefeater fries. Total came up to be around 17 dollars.  They have about 11 sandwiches currently on their menu, with prices ranging from 6.64 to 12.50. I can't speak about the other sandwiches but the steak sandwich was a party in my mouth and everyone was invited.  From pictures the calamari sandwich looks good as well for reasonable price of 7.95.  This place is the offpring of Barberian's Steakhouse.  I haven't been to Barberian's steakhouse in a while but from what I remember the steak was good.  Beefeater fries were well seasoned and delicious. I definitely will be back."}
{"text":"We dropped by Three Little Pigs (TLP) for a quick lunch over the weekend, and were greeted warmly by owner Arron Barberian (owner of Barberian's Steakhouse down the street). He was very clearly passionate about the food and service, and made a point of remembering your name when your order was up. Personal service is a nice touch, and is very hard to come by in this day and age.

Having ordered two chicken club sandwiches and some fries, we found a spot to stand by the window and eagearly awaited our sandwiches. The fries came first and were delicious steak cut fries which were perfectly crisp and well seasoned.

When the sandwiches arrived, we were a little taken aback by the size and amount of toppings, but they didn't last very long as we were starving. The chicken thigh was perfectly cooked and not at all dry like in other sandwich shops. I found the peameal bacon decent but it didn't really add much to the flavour if I'm honest. The buns were fresh and dusted with flour. In all, I was very impressed with the sandwiches and overall quality of the meal.

I will be back very soon, as I have since learned about the Tuesday/Wednesday steak sandwich special. Barberian's is a little out of my price range so I think this is a perfect opportunity to try their steak without paying through the nose."}
{"text":"Tlp what happened to your harrison burger? It used to be the greatest thing ever but then you changed the formula! Why fix what isn't broken :("}
{"text":"Great sandwiches, love the bread they use nice and crispy. Had the Harrison, tasted good but not really my flavour. I could tell they have good stuff based on the quality of product, will have to try something else next time."}
{"text":"Not sure why this place has such a low rating.  I have tried 3 sandwiches here and all were delicious (oooh that bread), decently priced (under $10), freshly prepared (made to order with an open concept kitchen) and serviced fast (less than 5 minute wait for 2 sandwiches) .

I recommend getting the peameal bacon sandwich with an egg to give it that extra something special.  The calamari sandwich has some great crispiness from the batter and fresh veggie topping mixed with soft bread.  The biggest surprise and my favourite was the meatloaf sandwich since the meat was so moist and the sauce was tasty.  Not your mom's typical meatloaf that's for sure.

Next time I will definitely try the steak sandwich and fries.  The steak is from Barbarians Steakhouse and will only cost you about $13!

Diners beware: this place only has 1 bistro table for 2, a standing counter at the window and a few chairs outside."}
{"text":"Place wasn't full at al despite the recent review at blogto but ppl would drop in for takeout frequently. Big fail is the lack of seating in the counter by the window. Basically there are 2 chairs in the whole place despite the space for them. Tried the calamari sandwich- portion size is good and the bread is delicious but, as per other reviews, it was stringy. No particular taste in the aioli. If back I'll try the tlp- a tomato lettuce peameal bacon. It seems to be a favorite of the takeout crowd. Fries were good."}
{"text":"I've always walked by this little shop and it has always been quiet. However saw some friends bring back giant sandwiches from here and went for lunch the next day, and boy was the line-up looong.

Sandwiches are around $10 after tax, and they are massive. All the fried ingredients are fresh and crispy because there is so much turnover. I was worried that the bread would be hard because it looked crusty like a bread bowl, but it was surprisingly soft. I got the calamari sandwich and while it was good, I think I prefer to have calamari on its own as an appetizer and not between two buns. My friend got the Holy Schnitz and the amount of schitnzel in there was crazy. All in all I'd say quantity is definitely there and so is quality. However there's one guy on the grill and fryers, a girl assembling all the sandwiches, a girl packing the orders and one taking orders...so it's not super efficient and if you go with friends, your orders will not come out at the same time. Just depends on what ingredients they have out at that time. 

The fries are wedges and they were good."}
{"text":"Great schnitzel sandwich and unreal carnival style fries. Also had the beef and por which was more like a burger but didn't hold up well. Would go back for a quick bite. Great lunch spot."}
{"text":"I think this is one of the better lunch spots near my work place. I had the fish and chips sandwich, which is only served on Fridays (heads up, contrary to the name, no fries are included with this order). Fresh fish; they definitely don't skimp out because they give a generous portion of it. Great coleslaw topping; not an overwhelming amount of tartar sauce added. Warm buns; soft and not dry or stale at all. I also added on a side of fries and it was definitely worth it - thick and well-seasoned steak cut fries. My only concern is price, sort of expensive for a sandwich - not something I'd get everyday."}
{"text":"Came here today for a quick lunch and I was glad I did. Items range from about 7-14 bucks and are the perfect portion for lunch. If you're not full you can also custard tarts for dessert at about 2.50/2.75 a piece! i was having difficulty choosing the sandwich I wanted and settled on the Harrison for about $10.95. I was very pleased with my choice. Think a burger but less guilt inducing, except it actually should induce guilt because it includes a fried piece of cheese. The fried cheese is paired with a jalapeno relish (not spicy at all. In fact kinda sweet so helpful with cutting through the grease and savouriness of the ground beef patty and the fried cheese. Bread was soft and fluffy and surprisingly not dry at all.

I made the mistake of not getting a pop cause I was cheapo and thought \"why would I pay more than $1 for coke?\" Well be advised that they also have san pellegrino and other interesting drinks (ranging from iced tea to fruit punch) from brands I've never hear from before but would love to try. 

Food came relatively quickly. Be aware that the Harrison is a sliiighhtly longer wait. Staff is also friendly. Overall, will def return just cause there are still like 5 other sandwiches I need to try."}
{"text":"Huge sandwiches, taste; not bad, nothing extraordinary. 
Maybe a hit more seating inside would be better, but then again, maybe not, with all the beautiful smells, you may have to eat 2 sandwiches, then not eat for another week. 
Patio-sort seating outside, not very efficient."}
{"text":"I've had 3 sandwiches in a week! So yummy and all very different. Staff are super friendly and fast! 

It's pretty much a take out type of place, with a small window area to stand and eat. I bought a jar of dill pickles! Yum! 

All sandwiches are pretty much under $10. You can't go wrong for a hearty and healthy lunch!"}
{"text":"Thoroughly enjoyed the TLP sandwich.  The peameal was melt in your mouth and the bun was fantastic."}
{"text":"We were walking around trying to find a place to eat for lunch.  We read the reviews and since the restaurant was on the same block where we were walking it was a must stop.  We got the pork sandwiches.  It was exactly what we wanted.  Very tasty and the bread was amazing.  It will be a definite stop again."}
{"text":"New neighbourhood sandwich shop which recently opened a few doors down from its parent Barberian's Steakhouse, at a convenient location not too far from Yonge/Dundas. Open during lunch hours only and currently has four sandwiches ($5 for a limited time) on its menu:
1) TLP - Tomato, Lettuce, Peameal Bacon
2) Chicken Thigh
3) Calamari
4) Braised Beef
You can combo any of the above with any drink (standard pop, water or San Pellegrino, $1) and fries ($2).  Staff are super friendly and there are some little treats at the counter as well (cookie, butter tart, Portuguese egg tart) if you have a sweet tooth.  They accept credit!

Friend had the Chicken Thigh (nice and light, chicken was very juicy), and I had the Braised Beef (slightly salty but very homey and satisfying taste), both very generously portioned.  Bummer there is no seating inside (take-out oriented).  All the best TLP and hoping for more menu options soon!"}
{"text":"I absolutely loved the calamari sandwich. The calamari was tender, not rubbery, and the dressing was tangy and delicious. And the bread was great too. I wish I lived in Canada, moreso this area of Canada, so I could have it again."}
{"text":"Came here for lunch one day after reading all of the good reviews - needless to say I had high expectations. I was a little skeptical ordering The Calamar... I was thinking to myself \"how good can a calamari sandwich be?\" and \"won't it just be really dry?\", but it was anything but that. The calamari is cooked perfectly and you get a very generous amount. The toppings on the sandwich also make it that much better.

The service was friendly and quick, even though the place was overflowing with customers. There is very limited seating inside and out, so I would recommend getting takeout. Although in the summer or if the weather is nice, you can sit on one of the few random benches along the street.

The pricing is fairly reasonable as well - everything is around $10, which is not too bad considering the quality and size of the sandwiches.

Would love to come back and try something else!"}
{"text":"I went just to try the steak sandwich since is getting rave reviews.  
I did enjoy it.  Yes all the reviews were it's expensive but then it's steak for crying out loud. You can pay over $10 for ground beef now! 
Taste-wise it could use a bit more to make it more gourmet I think.  It's a simple a steak sandwich.  Clean if you know what I mean.  aka good quality meat in it."}
{"text":"TLP completely understands the \"you eat with more than your mouth\" notion. Walking in here and ordering a sandwich is like a journey for your senses. Watch as the chefs expertly toss fresh meat onto the grill and listen to the sizzle. Take in the aromas of all those soon-to-be sandwiches. Feel the warmth of the bun between your fingertips, and then take a bite and savour. 

I used to come here for lunch when I worked in the area. It was always a treat to myself as the sandwiches are a bit on the pricier side. But you get what you pay for, these sandwiches were big! I really enjoyed the calamari and chicken sandwiches. Their ingredients are fresh and since you're watching them make the sandwich in front of you, you know exactly what you're getting. They are also very generous with their toppings and sauces (almost too generous as I found my first calamari sandwich a bit heavy-handed on the mayo, but this can be easily customized). The buns are toasty Portuguese buns that are both fluffy and durable, perfect for a take-out lunch. 

I usually get my sandwiches with a side of thick cut fries and a San Pellegrino. I'd suggest not doing dine in as they barely have any spots. Service has always been very friendly and relatively quick. It's a shame I'm not in that area anymore, I do miss those sandwiches.

(16/100) - 2016"}
{"text":"Sandwiches run from between $9-14 and they're pretty big for the value that you get. The place is kind of small on the side of the road, but our sandwiches didn't take long to make (around 5-8 minutes since we arrived near opening time). I got the Schnitzel sandwich and the meat was VERY crispy with fresh tomatoes and lettuce, so I got a nice crunch every time I took a bite. My date got the jerk sandwich and the pulled pork near melted in your mouth and was extremely tender. 

We also got fries and gravy on the side, and while our sandwiches were an excellent 4.5/5 - the fries and gravy fell flat for us. Fries were a simple steak/wedge cut, but there was literally no seasoning or salt on it, so it was pretty bland (2/5). Good texture though... iunno. However, the gravy was a tasteless, sour, watery mess that was way overpriced for its worth ($1 for espresso shot size water). 

Just go for the sandwiches and you won't be disappointed, and maybe fries if you don't mind dishing out extra change."}
{"text":"After walking by this place on numerous occasions and reading generally positive feedback I finally had an opportunity to duck in and get my hands on one of their steak sandwiches and it was beyond disappointing. Now perhaps it was just my luck and others have experienced a much better sandwich but mine basically tasted like a salty mess. 

The steak slices while generally cooked medium were beyond salty absolutely destroying the rest of the flavour (all I still taste is salt) of the sandwich. A few bites were met by the oh so familiar gristle resulting in a need to actually utilize ones hands to get help break apart the steak into a manageable piece. 

The redeeming factor and savior was in fact the bun. Absolutely marvelous and I can imagine it being a stellar vessel to potentially carry some of their other combinations like peameal bacon (someone beside me got one with a fried egg...I was jealous) or the chicken thigh. 

The combination of ingredients that form this sammie should work (mushrooms, peppers, a wonderful garlic butter) but alas the steak (which given its from Barberians and after eating there before is absolutely wonderful) and more specifically its seasoning (and maybe it was just my sandwich!) overpowered the sandwich and the meat itself. 

I want to love it and I want to return and try something else but but for now after spending 12.50 on that sandwich I am in no hurry."}
{"text":"quick service with reasonable prices; the burger contents to bun ration was just slightly off, making it a little bit too bread-y for my liking. other than that, a good quick bite on the go as there weren't really seats inside but high counters were available"}
{"text":"Their thick cut fries are a favourite of mine. I had ordered the Calamar sandwich and it was done really well. I didn't get an overcooked elastic band in my sandwich. The calamari was done just right. The calamari batter adds a nice crunch to the texture of it all."}
{"text":"In general I love little sandwich shops and a dream of mine has always been to open one someday. I think there is room for so much creativity, and you can pack a lot of flavors and awesomeness between two buns. Often the difference between an amazing sandwich and a mediocre one comes down to one toping or sauce so the unforgettable sandwiches shops are the ones that have picked every ingredient with some thought.  So needless to say that I was very excited about TLP and been waiting for a day that I might \"forget\" to pack lunch and stop by. Entering the place they have all the right signs for a fantastic little sandwich shop. Small space with a couple of seats, simple decorations and a short but interesting list of options on the menu with creative unfamiliar names for each sandwich. 

I tried the Harrison which was almost like a burger with a layer of fried cheese and jalapeño and chili relish and garlic aioli. It was very big (as were all the options it seemed) and did taste pretty good. However,  I do feel like it was missing something. Maybe it just needed some salt or some sort of kick (I expected the relish to be spicy(er) but it wasn't). I did like it overall but was expecting a bit more for some reason. I am going to try their other sandwiches as I'm sure I'll be back again. Also , their fries were really good. Thick cuts, crispy on the outside and soft on the inside. The prices were also reasonable.

Food: 4/5
Service: 4/5
Price: 4.5/5
Overall: 4/5"}
{"text":"Loving TLP! 
I've been here twice, and both times came away totally satisfied. I also like that it's never slammed with people, so we can grab a spot in the window (not braving the elements to chow down on a sloppy brisket sandwich).
Decor is super clean, but sort of brought to mind sweet Italian sandwich shops (white subway tiles, carrara marble, loaves of bread everywhere . . .).
First time I tried a sandwich with Canadian bacon and sweet mustard and it was pretty good, but was waaay too big for me to finish.
The second time, we split the Charlie Blake & it was beyond delish. Just how I like it; flavourful, saucy, soft bun, rich and super filling. 
Will be coming back here, again and again! 

It's just under $10 for a sandwich and a pop. Wait is about 5 minutes.
Enjoy!"}
{"text":"Pretty good. Bread is super fluffy and toppings complimented each other well. Got the Calamar, portion size is a bit small for the price of a sandwich ($10+) but I still enjoyed it"}
{"text":"The fries deserve a 5 star rating!
The CLUB sandwich with 2 strips of peameal and chicken?, average/ok.
With minimal staff the place is a bit slower than you'd maybe like...  I would skip PEAK periods."}
{"text":"I am feeling generous today as this is the 3rd 5 star review already. Maybe it's a Friday or maybe I've just been having great food lately but whatever it may be it's all for the greater good of humanity - I said it cuz I can.

Elm street -- the little tranquil street that is sandwiched between the main artery of our economic prowess and one of the most historic streets in our great city. Even though this tiny stretch bears no such grand responsibilities of the former it is however the very definition of our food culture; diverse, simple, unpretentious and most definitely delicious. In this little stretch of perhaps 500 metres you will find great Jamaican patties, delicious Hong Kong pastries, some French fare, fine steaks and Three LIttle Pig that serve amazing sandwiches.

The menu is very limited, only outdone by their meager seating offering of 1 table and 2 chairs. But whatever little they do offer is fresh and delicious. Sandwiches are made with the utmost care; calamari is tender, beef is juicy and pork is...well porky. All that goodness served between some gourmet buns of course. They use sauces liberally and the crisp vegetables are all there to enhance the star of the meal not overpower it.

And their fries are just ridiculous. More like delicious potatoes wedges!"}
{"text":"I work right beside this place but have never been here to eat before. However, last Friday I went here by myself after a long day of work to see how this place was. I've seen long line ups at this place once in a while but still never came here. I'm not sure why. Maybe it's just because I always resort to the same old places to eat (I AM CHANGING NOW). 

I first asked the lady at the front desk (who was very kind), what the most popular item was. She said it was \"the Harrison\", which is popular because it has red meat? And most people dig red meat. OH I also forgot to mention that this place is a sandwich place, and the menu is on the wall (literally), and there's only like 5-6 options to choose from (I LIKE THAT THOUGH). I ordered the calamari sandwich and OMG... Probably the best sandwich I've had in a while.

Let me first start off by saying that EVERYTHING in this place is homemade, EXCEPT the canned coke. The calamari is cut, fried to perfection and in the middle of my meal these huge macho guys come in walking with these huge trays of cooked meat from heaven. The meat smelled BOMBBBB and these people really know how to cook. I also never thought I would say this but even though they didn't toast the sandwich bread, I DO NOT CARE. For some reason, the crispy (SOOO CRISPY) calamari with the tartare looking sauce(?) and some acidic coleslaw they had in there as well (to cut through the richness!) was just PERFECT with the bread. I AM SURE they make their bread themselves too or at least have someone nearby who bakes it for them fresh every morning. 

The squid was perfect, the frying couldn't have been better, the sauce was perfect, the sale was perfect, and the bread was perfect. It all makes a perfect sandwich at the end of the day! The coke was good too, thank you coca cola. 

I am definitely coming here for lunch and/or dinner again sometime and so should you!"}
{"text":"I'm so glad I stumbled upon this little gem on Elm street because it has changed my lunch routine for the better. One wouldn't think to look for the cozy sandwich shop which consists of just a simple counter and very few seating spaces, so be on the lookout on the south side of Elm street as you approach Yonge. I've tried two sandwiches from here, with my favourite being calamari as many other yelpers have raved about. Very well cooked with delicious sauces to go with the fresh bread. I also tried the TLP which was just as amazing, and the meat was generous which made me very pleased :). Might I also add that this place offers Ritual which has made ordering even easier! Working at Sick Kids, I can place and order and then commence the walk over with the sandwich ready just in time. Highly recommend this to anyone who works in the vicinity."}
{"text":"I come here sometimes to get a good sandwich near where I go to school. It's a bit on the pricey side, but it's better quality than the other nearby sandwich shops. I usually get the Calamari sandwich which is actually quite good. The actual place is small, but there are a few seats. They also sell Portuguese style custard tarts and other small snacks. This is a pretty decent place, so I hope no big bad wolf blows this house down."}
{"text":"I have seen a lot of good reviews for this place so I went with some friends to try it out. I am not really a fan. Let me start with the positives. Nice little quaint place to have a sandwich. They encourage you to draw on their wall which can be cool. Limited menu which made the choosing easier. They make a hole in the top bun for the toppings which was a good idea. Limited seats however. Someone told me it's too prevent having to provide a washroom but I didn't get to verify... I ordered the Duke and my wife got the calamari. The Duke was super salty. It was fairly hard to taste anything else in the sandwich. Tasted their gravy and that was super bland. Had some of the calamari and that was bland. It's like they took all the salt from the rest of their menu and put it in my sandwich. Only saving grace is the fries. They were pretty good fries. I don't think I will ever come back here. Didn't like it so much that I don't think I will give it a second chance."}
{"text":"The best steak sandwich you'll ever have. Only served on Tuesdays and Wednesdays. It's hard to imagine better."}
{"text":"We stumbled across this little sandwich place and were blown away. They definitely have the best sandwiches we have tried in the city. We recommend the Canadian Pork Party sandwich or the Fish N Chips special on Fridays."}
{"text":"+.5 for service

In case you're looking for this place and can't find it, it's now called TLP Sandwich Co.

I was craving a gourmet sandwich and had a choice between TLP and Clubhouse Sandwiches, and decided on this place as it was closer to my office. I will try Clubhouse as well in the future, but I was overall impressed with this place!

I had the calamari sandwich, which consisted of crispy squid, onion and cucumber relish, tomato, and mustard mayo. I also had their fries, since I read good reviews about them as well.

The sandwich was definitely one of the best I've had. The size was huge, the calamari was huge and had a lot more squid than batter, and the sauce, relish, onions, and other condiments were an excellent touch to the sandwich. The fries were even better; they were big, fresh, and packed with potatoes. The only small problem I had was that the fries got soggy faster than I thought, as I took it back to my office and I can already feel the sogginess. Either way it was still edible and delicious.

Seating is limited; there's only one table with two chairs, and the table location is right along a wind draft, so if the door opens the wind will blow right in your face. There's also a high table area, but no chairs are available there.

Service was great and the employees were very knowledgeable on their (limited) menu. It's for sure a place I will revisit if I'm craving a gourmet sandwich for lunch!"}
{"text":"It's as good as it gets. Premium sandwiches worth getting once in a while. They're large, meal-sized offerings, so prepare for a lazy post-lunch afternoon once you've finished. 

I stick with the chicken and the Harrison. A bit on the salty side as there was cheese in it. But on the plus side, there was cheese in it."}
{"text":"Somewhat tucked away in the busy area of yonge and dundas lies my favourite fried calamari sandwich. You'd think that it would be a heavy and oily sandwich but nope. There's a nice lime or citrus sauce they add that cuts through the oil and actually makes it feel light (and almost refreshing). This place holds sentimental value to me because it was the first new food joint I got to try since moving to Toronto. It may have triggered the \"crazy\" foodie in me."}
{"text":"Hands down our favorite sandwiches. My husband said it was the best he's ever had and that's saying A LOT!  Will definitely come back next time we are in town"}
{"text":"I went on a Friday evening shortly before closing so all the key shining menu items I would typically go for were out.
I ended up getting the Mrs. Blake's meatloaf, while my sister tried the fried cheese.
I was prepared to be very offended when I saw they serve you room temperature buns. The end result was however quite delightful. The meat loaf was fluffy with occasional bigger chunks that gave it bite. They had a tart and tangy mayo like sauce that went very well. Flavour profile wise, it's definitely a winner. 
I found the sandwich a lil wet...the moisture was needed to soften the cold hard bread. I think the whole combo would be a 5/5 had they lightly toasted the bread and gave it less sauce.
The fried cheese was also nice, just that the cheese was not very prominent with the strong combination of slaw and toppings.
I would like to go back to try their other sandwiches to see what else they have to offer.
On a side note, I found it very weird for them to configure default tips on the card machine since the location is an obvious take out joint. Even if you do plan on eating at the location atvthe stand up tables, it was a primarily help yourself kind of establishment."}
{"text":"I'm not sure if it's just bad luck but the past few times I've been here my experience was less than satisfactory. 

I used to frequent TLP at least twice a month but after the past two times I'm not sure if I'm willing to give it another try. The menu has been quite inconsistent and their portions have been halved. 

I've tried to order TLP on Ritual and each time it was a disappointment. Sandwiches would be out of stock but not marked on their Ritual app which has occurred a few times but didn't really bother me because they are quite popular & I just assumed it was too busy. The one time my order went through, I got 2 calamars- my usual order + a friends. Compared to what I was used to they basically gave 1 sandwich worth of calamari into 2 sandwiches as both our sandwiches were half full. 
I was already really disappointed as I wanted to introduce my friend to TLP. 

Anyway I thought it was just my luck with Ritual and maybe ordering at the store would be better. I went in at noon- prime time for lunch- and more than half of their sandwiches were sold out. I ended up walking out without getting anything because they only had 3 sandwiches available - none of which I wanted. The inconsistency of their menu is really disappointing. I would like to warn anyone who might be making the trek for lunch to avoid wasting your time. This used to be one of my fav lunch spots downtown, it's only a let down now."}
{"text":"Not a bad place for a sandwich. But this is nothing spectacular and its also a little bit more costly. I have only tried the Flat Top Chicken, though.

Place gets busy even before lunch time hits. I came around 11:45 and there's already a lineup. Even longer lineup by the time I got my food ... 

The bad thing is there was only 3 people working: 1 cashier, 1 prep and 1 cook. The cashier is the same person who needs to get the order out to the waiting customers. I literally saw my sandwich waited 5 minutes in the counter by the time it was done before it was given to me. I could have just grabbed it and saved myself some time.

Having said that, if it doesn't look too busy, I'd probably go again and try the other sandwiches they have. A lot of people seems to be ordering \"The Harrison\", so I might give that a try next."}
{"text":"Schnitzel was good. Quality of sandwich is better than most of the restaurants in the area so I will return."}
{"text":"I really wanted to like this place but it was just okay. For a spot called three little pigs I would've expected a pork centric menu. However the cashier noted that the top sellers/most popular sandwiches are the Harrison (branded as \"ground steak\") and the steak sandwich... Both beef based sandwiches. 

Got the Harrison but it was really just a burger. Ground steak is just a hamburger patty. I guess I should've just known that that meant hamburger. Came out to be just under $13 which is a bit pricey for a burger from a take out place. 

Overall it was okay. But nothing special. Probably wouldn't come back nor would I recommend it."}
{"text":"Great sandwiches and the vibe of the place is awesome. Staff members are friendly and efficient."}
{"text":"Finally got around to trying TLP! TLP is located on Elm street right beside barbarians. During the summer months, they have a cute patio right outside that extends onto the street.

I came on a Thursday right at lunch hour and there was only a handful of people waiting inside. The smell that greets you upon entering is mouthwatering!  The menu here is small but its because they do the few things they have very well. 

I opted for the calamari sandwich, which comes with cucumber relish, lemony mayo, tomato and of course, deep fried calamari. I got fries and a drink and the total came to about $15 with tax. Everything is prepared fresh right in front of you, no awkward counters to look over, its quite an open space so you can see them prepping your meal.

The sandwich itself was deeeelicious, the calamari nice and crispy and the mayo and relish making it really fresh feeling and not super heavy. Was not a fan of all the excess flower on the bun but that's just the style of bun they use (but its now landed everywhere on and around the area I was eating in). The fries left something to be desired. I'm generally not a fan of steak cut fries, wide and flat, but these were slightly undercooked and just didn't add anything to the meal. If they had been nice and crispy they would have been better. I think the fry guy was rushing to get these done and they came out of the fryer too soon.

Delicious sandwich, will definitely be back to try more. Wishing they had more options that had regular bacon instead of peameal. I'd avoid the fries, they're just not worth it and you can get better fries elsewhere."}
{"text":"Everytime I come here I'm never disappointed by the sandwiches they have. 

I've tried almost (holy Schmidt, Fried Cheese I have yet to try) everything on the menu and enjoyed every last bite. It's prepared fresh and the meat cooked to order.

The bread is great and the fries are good though I don't come for them and won't get them often in the future (the sandwich is filling on its own). 

My personal favourites are the C.P.P., Mrs. Blake's Meatloaf, and the Calamar. 

Check it out you won't be disappointed."}
{"text":"Had the worse experience here.
Order: Fries, Calamar= $18.11 TLP=$15.60 (including 20% tip each)
which is annoying that they expect you to tip before receiving food or service.
A bit over priced for one but I don't usually complain about price until after I eat. I don't mind paying for quality food. But these sandwiches definitely were not worth the price or shitty high school girl service

I first ordered the Calmar w fries based on suggestion from the girl at the counter ( blond, young girl, skinny) . I was still waiting for my sister to pick her sandwich via text  which is why I ordered my food first and her TLP on a separate bill. 
Anywho she made my sandwich first so I sat down to eat it while she made my fries and other sandwich.( bun was big, sandwich was messy, missing cheese or bbq sauce something is missing. but it was pretty tasty) There was no one else in the restaurant at this time. I'm sitting down enjoying my sandwich and I see the same girl whos making my sandwich fussing with something so I stretch my neck to see over the counter and shes changing the garbage.
Fine! but then she has the nerve to go right to the sandwich on the hot top with the same gloves she used on the garbage and my food previously. I was like no impossible, so I stood up to be sure and looked. Yup! she was adding the topping on the bun. I didst wanna be rude even though it was extremely disgusting and unsanitary.
So I say \"not to be rude but, you should probably wash your hands after touching the garbage\"
she says \"oh ummmm\" and continues what shes doing
I was shocked like hi helloo did u hear me or.....
So another girl comes up to the front heavier set dark hair, I tell her I need a refund because ...before I could finish my sentence she says we can make you another one if you like
I said no I dot like can I have a refund plz, I know this must be annoying for you to do but you must understand how disgusting that is.
In the most annoyed voice ever she says \"no you don't feel comfortable eating it that's fine. After 20 mins of her trying to do a refund and calling who I assumed was her manager she still couldn't do a refund. 
Meanwhile my sister who just had a csection the night before is waiting on her first real meal, So I just said listen why don't you just give me back cash as you'll still balance at the end of the night
She agrees and I leave w my refund of the second sandwich.
shes lucky I didn't demand a full refund of everything as I didn't even touch the fries and had 2 bites of my calamar sandwich

NEVER AGAIN!!!
Stop employing these people who have no sense of cleanliness or respect for other people"}
{"text":"My boyfriend and I were craving big sandwiches on Saturday afternoon and TLP served our needs well. 

I went for the Harrison, and he went for the peameal bacon sandwich and added an egg. 

The Harrison was totally unexpected and I loved it! The panko crusted cheese and the ground steak went perfectly together, plus the toppings of peppers and mayo, and I was in a sandwich coma. 
My boyfriend loved his sand which too but I could tell he was ogling mine! 

The staff was friendly and helpful in assisting our decision, and the music playing was early 2000's which I thought was hilarious and fun. 

Will return again!"}
{"text":"A friend who lives in the neighbourhood tipped me off the opening of TLP (Three Little Pigs) which is a sandwich shop from the owners of Barberian's Steak House.

Stopped in for lunch and there was a choice of 4 sandwiches - peameal, calamari, beef brisket and chicken ($5 each).  I went with the beef brisket.  It was pretty big...the kaiser bun was super soft and yummy.  Beef was tender and there were a few chilli flakes for spice.  Passed on the side of fries ($2) but was tempted by a few desserts - gluten free cookies ($1) and butter tarts ($2).

Limited seating so you can take your sandwich out to Yonge Dundas Square or a quiet corner on Ryerson campus."}
{"text":"TLP is my go-to destination for super yummy sandwiches. If you're wondering where the top sandwich places are in Toronto, this is one of them. The buns are fresh and soft, the bacon, chicken and meat are equally fresh and well cooked. When you try their stake, club or chicken thigh sandwich, you will immediately understand what I'm talking about. They don't skimp on ingredients or quality for that matter. Their sandwiches keeps me full for good 3-4 hours, providing enough energy to get me through the day. I highly recommend you check out this place, if you want to find out what a great sandwich tastes like."}
{"text":"My fiancé pretty much lives right behind TLP and we've been looking forward to it's opening since last fall. I had their TLP sandwich and my fiancé had their chicken sandwich. 

Overall, my TLP sandwich was massive in size but it was quite bland. They give you a generous amount of pea meal bacon, but it surprisingly lacked salt. The toppings of lettuce and tomato just didn't really add much taste. I wished it was salted properly and perhaps more depth (ie. some heat?).

My fiancé enjoyed his chicken sandwich, however it didn't wow him, but he will be back to try their other sandwiches."}
{"text":"After my first visit - I have been back twice with 3 different friends who all raved about the taste. I have tried the: Club - great chicken sandwich (you get a whole chicken thigh!) with bacon, Flat top chicken - similar sandwich but with a cool cucumber dressing, Holy Schnitz - a monster sized pork schnitzel. All of them are great!!!"}
{"text":"Harrison sandwich was awesome. First timer, but I will definitely be back to try the others."}
{"text":"I went there with a few colleagues for a Friday lunch. It is always difficult for someone to propose a location that everybody agrees with, but it was a real surprise that we never tried this place before.

And we regretted not going there sooner. The place is definitely small, and the weather was so nice we were able to sit outside with the chairs so kindly set up. But the food is great

As far as sandwiches/burgers go, this is definitely one of the best. They are bigger and cheaper than some, and the taste is among the best I had. The sauce with the meatloaf sandwich is something to try. 

I would recommend going there anytime, I am myself looking forward to going back."}
{"text":"The Harrison was an excellent choice. For a sandwich it was a little expensive but for steak it was very reasonably priced. You get what you pay for, very yummy! Really enjoyed the atmosphere as well."}
{"text":"I have been to TLP twice so far and have tried the Beef Brisket Sandwich and the Calamari Sandwich.

The Beef Brisket was really good.  The bun was soft and the beef was tender and full of flavour.  The sandwich alone is almost 10 dollars and doesn't include fries.  If you do order fries though, they are quite thick and delicious.

The Calamari sandwich was a huge fail to me.  It's very popular and looks appetizing but it was very hard to eat and the calamari was really stringy, it grossed me out a bit.  Not sure if I just got an unlucky batch, but I couldn't even finish the whole sandwich.

This place is tiny and there is no seating area but it's still a great lunch spot and there are a few great sandwich items on the menu!"}
{"text":"I had the flatiron chicken sandwich and it just okay. I expected the sandwich to be really juicy but it just wasn't. There was too much bun as well. When I walked in for lunch I was the only person there. The staff however were nice."}
{"text":"This is a tiny sandwich shop that's related to the legendary steakhouse Barberian's, just a few spots down the street.

The food is really good. On my most recent trip I had the schnitzel sandwich, which was fresher than you would expect due to the cucumber mayo it came with. The schnitzel was crispy and well-fried, although it could have used a little more seasoning. I also ordered the steak fries which were well-done but a little too thick and potatoey for my taste. They also could have used some more salt.

There is almost no seating inside, but they set up chairs outside in the summer.

Be warned that the portions are enormous. On a previous trip I had the Harrison burger, which came with fried cheese on top. It was delicious, but the size was overwhelming going back to the office after lunch, and I'm a big eater. Great value for money though. You could even split a sandwich with a friend for a smaller lunch.

This is a great lunch option for the neighbourhood, you can do much worse so close to the Eaton Centre and Dundas Square."}
{"text":"I just had the braised beef sandwich ($9.75 after tax). While the bun was good and the flavours were there, the size was way too small! Weighed about as much as a Whopper?  It was an $8 sandwich after tax not $10. I found the service with not many people, to be disorganized as well.  4 stars for flavour, 2 stars for everything else."}
