{"text":"Service was really good.  Had lunch.   Felt a little like mall food."}
{"text":"My wife and I just visited Thyme 4. The food was quite tasty and the service was very good. The prices were more than fair. Waitress was super-nice. My wife and I split an order of Bruschetta. She also ordered Spaghetti and meatballs. I had the Caprese salad which wasn't the traditional style. It had lettuce. More of a garden salad but I was fine with that. The dressing more than made up for it. It was delicious. I ordered the veal with gorganzolla sauce with veggies. It was fantastic. Finally we had some dessert. (Chocolate Torte and Carrot cake) And they also make a terrific espresso. We will definitely return."}
{"text":"Best gnocchi ever! I ordered the Gnocchi al Pollo *drools lol it was the best dumplings I've ever tried. We had it delivered, food came quick and fresh also came with a side of bread, really good! Love this place, definitely need to try it."}
{"text":"I've ordered from here a few times, never disappoints! Their pizza is great and the pasta is even better. Everything is fresh and authentic. Never been to the restaurant itself, but I know delivery is fast and always arrives hot. The bruschetta is a must try, as well as the spaghetti & meatballs!"}
{"text":"RAT ALERT!!!! Had the carbonara.. Sauce was watery and my meal was served within 10 minutes of ordering - no way this was fresh!  Beer was flat and house wine bottle must have been open for days as it taste bitter.  At the end of the meal, a rat walked in the middle of the dinning room.. When we mentionned to server, she said \"it's okay\"..!!!!!"}
{"text":"Perfect place for ordering delivery on a Sunday night. The meatballs are my favorite along with the Alfredo linguine."}
{"text":"Wow, great find... Italian food that is great quality and not over priced. Think I found my new weekly Italian restaurant :)."}
{"text":"We went to Thyme 4 for dinner (four of us) last night.  The restaurant was busy!  We did not have reservations but were seated right away.  The menu had a lot of variety--especially for pasta.  We ordered garlic bread, not knowing that we would receive an order of warm breadsticks with plates of balsamic vinegar and olive oil to dip.  The bread was yummy!  The food was fresh and delicious, but the portion sizes were ok.  Although the service was friendly, we weren't checked on during the meal (which was fine with me) but we also waited a long time to pay.  Given this, I would still go back to Thyme 4."}
{"text":"I've got a soft spot for unpretentious family Italian restaurants and Thyme 4 fits the bill perfectly. Situated in the heart of Ford nation, surrounded by strip malls with plenty of parking right in front of the place on Queensway or on a side street, access is almost too easy. When I visited on a Friday night, there was a steady stream of wide eyed customers picking up their orders.  The warm bread with oil and vinegar was delicious and I had to hold myself back from devouring it, as my risotto was on its way. I needed something to warm me up and the shrimp risotto with cream sauce satisfied my hunger like no other with its rich and hearty flavour and texture. I mentioned to the friendly server that I had to go back to work that evening and my order came in reasonable time and I was on my way.  I was told that their afternoon combo with salad was a good value and one of my friends even ordered and finished a second basket of bread while waiting - it's that good!  The ambiance was pleasant with low lighting and a steady din of conversations could be heard from happy diners. The manager was fun to talk to and very friendly. I'll be back soon!"}
{"text":"Dinner after a move on Sunday Nov 1st 2009. I had the seafood risotto my wife had the mushroom risotto. Both were excellent. Great Italian food, good wine list, cozy décor and good service. They just did an update recently so new signage and revamped inside."}
{"text":"I usually order for delivery on nights I'm craving pasta and am too lazy to make it myself. So far I've had the spaghetti rose and fettucini carbonara. The carbonara was really oily when it was re-heated the next day but still tasty. The portions are huge and usually feeds me 3-4 times which is awesome. They always package everything neatly and delivery has always been under the quoted time (about 25 mins give or take) except for the last time I ordered."}
{"text":"Last Thursday my (22 yr old) daughter visited and she was driving me nuts to order something in for lunch. For some reason Thyme4 popped in to my head. Once she saw the menu my daughter was sold so we ordered the Spaghetti Rosè and the Fettuccine Carbonara. First the Spaghetti..the couple of shrimps and scallops were slightly under seasoned and slightly undercooked but still very tasty. The Spaghetti on the other hand was spectacular the sauce was by far the best that I've ever tasted that is until I tried the Fettuccine Carbonara!!!..It was truly out of this world..JUST AMAZING AND BEYOND!!..Although the meal was a little pricey at $40 for delivery for 2 (actually enough for 4 people) it was well worth the money. I will definitely be ordering it again. Speaking of that, I was thinking of ordering it again today so my son could experience this greatness but apparently they don't deliver until 4 PM which is strange because they delivered at 1:30 PM last week...Nonetheless give this place a try - you won't be disappointed!!"}
{"text":"Thyme4 used to be my \"go to\" place - always great food and the service used to be great - attentive, professional, friendly and welcoming. I have been there twice in the last 10 days - different servers both times and both times the restaurant was not busy. The food is still great (their little warm bread fingers are the BEST), however both times, each server was not good at all.  No greeting, no pleasantries, very slow to serve, never checked on meals or refreshing drinks, not a smile in sight.  They did only what they HAD to do to meet the minimum requirement of being a server in a restaurant.  There were 4 of them in the restaurant so it wasn't that they were short staffed - they were just uncaring. Shame - the food and atmosphere are good, however the service sucks."}
{"text":"Thyme 4's pizza is so delectable!  In my opinion, one of the best pizzas in the city!  The crust is so flavourful and the toppings are top quality.  The pasta dishes are pretty good too - my husband loves the seafood pasta.  It's a cute little place that would be great for a romantic dinner.  I would have given Thyme 4 five stars but had a bad experience once with a really, really rude woman who took my order over the phone - I think she's since gone though."}
{"text":"Went to Thyme 4 last week for dinner and have to say we enjoyed our meal. Prices are very reasonable and the food was overall pretty tasty. Service was excellent and the atmosphere is really nice. We had the Caesar salad (nice and cold and very tasty), garlic bread (lots of cheese and just how you want garlic bread to be), and risotto (overall great flavour just a little too heavy handed on the oil).   As mentioned above, my only complaint would be the pasta we both ordered was very oily. There was quite a lot of oil left in the bottom of the bowl. If the chef could go a bit lighter on the oil I would bump my review to 5*. Will definitely return."}
{"text":"Had bruschetta to start - excellent.  Would order this every time.thinner bread toasted perfectly retained chewiness and tomato etc topping tasted great.  Pizza - had the signature pizza and again really good. Crust not too thin not thick and cooked nicely with generous topping that didn't create a soggy mess.   Chicken goat cheese pasta in white win cream sauce very tasty.    Prices are very reasonable including wine prices.  This is a great casual place to catch a quality Italian meal.  Server was very sweet, attentive and helpful.  Excellent."}
{"text":"Food is excellent. You can taste the freshness in the ingredients down to spices and herbs. Bread served with vinegar and olive oil to start is amazing. Wait time for food can be a bit lengthy, likely because it was prepared on the spot, and you can certainly taste the difference that makes; well worth it! Atmosphere suggests a romantic place to take a date, or a place where a small group of friends can catch up."}
{"text":"Well, this restaurant is literally around the block from where I live...went past it for years....finally took the plunge and went.  I was blown away.  The food was delicious, lots of it.  Bread was good...and they didn't skimp on the wine.  White table cloths, and napkins.  Excellent service.  It was a really nice ambiance.  After a very hectic day at work, it was lovely to sit in a calm spacious environment and be catered to.  Definitely my new favorite spot on the Queensway/Kingsway area."}
{"text":"The pasta is great always hot and fresh and the service is good too. They are quite efficient."}
{"text":"Food is good. The seafood pasta is really delicious. But takeout service consistently bad. Dine in service is better. Need to be more competitive with service given two new italian eateries that just popped up with wood burning ovens."}
