{"text":"Had a great meal there on Dec 9th. Great staff, service and Chef John does an outstanding job. Highly recommend! Thanks for great night"}
{"text":"I come here often, especially for lunch. If their dinners are superb, which they are, their lunches are excellent. At lunch, ask for the special sandwich. Chef John creates imaginative sandwiches, different every day, and always something to die for. Do not expect a cheeseburger on a bun, unless you ask for one. They put together meats, cheeses, and sauces -- served on matching breads, rolls, or wraps -- all chosen to complement each other. I don't know a restaurant in the county that can please taste buds with such variety. Even the BLT is unique and delicious. Every day, there's a homemade soup, if you wish. Today, I had gazpacho that was better than any I've had in Spain, but you don't need to speak Spanish. Thyme pizza is as good as any in Naples, but you don't have to speak Italian.  Service is casual, so don't expect tuxedoed waiters. But the same quality cooking would cost you twice as much in downtown Cleveland or Columbus, I'm pretty certain. No, I don't work there, and I don't have a relative on their payroll. I just keep going back, and I'm glad they continue to please my friends and I."}
{"text":"This is a great little place with pretty good food and service. We love Mike the  bartender. They have some great bar specials nightly. We're especially fond of Tuesday martini specials and Thursday BOGO.  You can't beat these prices. Surprising as food is on the high side."}
{"text":"Visited Thyme2 in the pub for lunch. Food was delicious and service was perfect."}
{"text":"This was amazing! I had the triple grilled cheese with tomato bisque and it was MOUTH WATERING! Everyone at my table had something different and of us loved our meals! The waiter was very outgoing and friendly who was interested in what you said. The prices were reasonable, and definitely worth the food. We will definitely be coming back!"}
{"text":"The pan roasted chicken is the best I have ever tasted.  Everytime I go to this restaurant I say I am going to order something else but this chicken always end up on my plate . My dinner companion ordered the scallops that were served on a bed of creamed corn also to die for. You have your choice of fine dining upstairs or the pub downstairs where you can order off either menu. They also have a nice patio for outdoor dining. The service was perfect as well."}
{"text":"Excellent food.  Not casual, but just look nice.  Mahoney was great.  Pear martini is excellent - if you like pear.  lots of wind choices, good drinks."}
{"text":"Very good food.  The food is a bit \"fancied\" up. So if you are a finicky eater, know that coming in.  Would definately come back."}
{"text":"Thyme2 is a cute little gem of a restaurant near beautiful Medina Square. It's a shame it's not on the square itself. It's small, intimate, and has great ambiance. The upstairs is a fine dining restaurant, while the downstairs is a pub.  Everyday they offer a chef's special appetizer and entree. We decided to stick with the regular menu for our first visit.   We ordered three appetizers and one entree, which was plenty. Our server was lovely enough to course our entire meal. Before receiving any appetizers, she brought us delicious bread served with thyme honey butter.   Our first appetizer was melted brie on toast with granola, blackberries, blueberries, and strawberries. Holy cow talk about rich and decadent all the while being savory and sweet. The granola added a nice bit of texture. I love melted brie and eaten with fruit creates a lovely combination. Our second appetizer was the clams casino. I have no idea what was in this dish except bacon. It was great! If you don't like seafood, I would still recommend this dish--the bacon overpowers the clams. Our last appetizer was the lobster pizza, which was OKAY. I've had better. I wouldn't get it again.  On to the entree: macadamia crusted grouper served with Chinese black rice and an egg roll. Delicious! The black rice was really fun--nothing I had ever seen or heard of before. I really enjoyed the egg roll, which was filled with peppers. The grouper is apparently their signature dish, so if you can't decide, this is a safe bet.  Lastly, dessert, which did not disappoint. We had a trio of ice creams: orange creamsicle, chocolate cherry, and raspberry lemonade. The orange creamsicle was my favorite, followed by the raspberry lemonade. The raspberry lemonade ice cream actually tasted like lemonade. I could take or leave the chocolate cherry ice cream. However, it was the most smooth and silky of the three.  Our server, Jordan, was lovely.  If you ever find yourself around the Medina area, you should definitely stop by."}
{"text":"The bleu cheese burger I had here was fantastic. Also a nice fancier atmosphere. Good for date night type deals."}
{"text":"Had a birthday dinner and we sat downstairs and had a blast. The rock and roll theme with Beatles memorabilia everywhere was a big plus. The food was hot and delicious and the sever terrific. No complaints, only compliments. When the food and service is wonderful, the price is a minor thing because I don't mind paying well for an excellent meal."}
{"text":"On Girls Night Out, eight of us had fabulous food and very good service. Everything from the duck, pork chop, macadamia crusted grouper, and a special shrimp/pasta dish was excellent.  I would definitely recommend this great restaurant."}
{"text":"Not impressed. I came here with my spouse to celebrate our anniversary. It was our first time to the restaurant. We made a reservation well in advance but they gave away our table to someone who just walked in off the streets. Due to the unearned high popularity of the place there wasn't a table for us. We decided to leave and go to the Corkscrew instead. While we didn't even get a chance to eat here we weren't impressed with the décor. We really wanted to like it, but the first impression blew it for us."}
{"text":"Thyme 2 has out done itself again. Took my father and boyfriend to their beer tasting and we had amazing food and a lovely time. The beers were Colorado themed, it complimented the dishes well. There were 6 courses and I cannot tell you which one was my favorite because every dish was prepared so wonderfully, with eye catching presentations. The tasting was priced so well for everything that you received. That is why I recommend people to go to tastings when restaurants offer them because the chefs usually create the menus and you get to try their true talents. If they have another tasting I will be joining the fun on that one as well."}
{"text":"We picked this place based on Yelp - so glad we found it. Excellent service and awesome food! We sat at the bar upstairs, but the \"basement\" was hopping! We will definitely be back."}
{"text":"All I can say is we love this place.  The staff is always friendly and the service is quick.  We prefer to sit in the pub area where you can choose from either menu, and the atmosphere is a little more laid back.  Good food and drink selection, and our food has always tasted great.  We will continue to dine here, one of our favorite places in Medina!"}
{"text":"I have eaten here 3 times and have always been pleased. I had the salmon this time and was not disappointed. My wife also ate the salmon while several in our group had burgers. Our waiter was attentive and personal and made our time pleasant and fun. Will not hesitate to visit again when we are in the area."}
{"text":"Fabulous dinner.  Great ambiance.  I had beggars purse salad with warm goat cheese in phyllo..well worth it.  I enjoyed the macadamia crusted grouper and they happily subbed out the rice for artichokes.  My entree also came with a veggie spring roll.  The grouper was a decent size portion with just the right amount of sauce on the plate and it was crisped just perfectly with the nuts. The entree was fantastic.   My husband had the seafood Diablo dish and said it had a hearty amount of seafood in it.  We were too full for dessert but would return again soon."}
{"text":"Had a great time here this evening. The scallops were the best I've ever had at any restaurant - highly recommend. The wait staff in the bar and dining room were so friendly and accommodating."}
{"text":"What can I say Thyme is awesome!! Love the pasta dish Chef John makes!!! Great atmosphere, great service, great food, just an all around great place to go!! Chef John always makes sure every dish is special.. If you have not tried Thyme whether for a casual night downstairs or a date night upstairs I suggest you go!!! Great outdoor seating!!"}
{"text":"There are quite a few places in Medina and the surrounding area that have good food and good drinks but Thyme 2 is the only place to get a pub burger with the flavors of a gourmet restaurant. The beer selection isn't extensive but they carry a selection for craft beer drinkers. Go there and you won't be upset. I have never eaten in the upstairs dining room but it is expensive compared to the pub menu (available downstairs)."}
{"text":"We have been to Thyme2 a number of times and each time it is as good as the last.  The overall experience is wonderful - a perfect mix of great food, comfortable,upscale surroundings, a beautiful wine list and a welcoming staff. John and his team are excellent and always exceed our expectations.  Thyme2 holds it's own against the best in Cleveland, Chicago and elsewhere!! Wonderful asset to Medina and all of northeastern Ohio. Our favorite is the Thyme chicken. It is all at once the perfect \"comfort food\" dish combined with a true gastronomic flair! Beautiful."}
{"text":"Look, I'll just come out and admit it. I'm a bit of a food snob. I have boy-band level intense crushes on some chefs, I take far too many pictures of my food, and I have had at least three dreams about making panna cotta in my life. It's rare indeed when I find an establishment (especially a fine dining one) where I do not have small factors to nitpick about. But Thyme Squared, located in sleepy adorable Medina, is one of those establishments I have not yet found fault with. It's a true diamond in the rough, or in this case diamond in the Cleveland suburbs.   This restaurant is large, with a Downton Abbey setup. By that I mean fine dining room upstairs for you upper crust nobles, and a more casual pub downstairs for those who can let their hair down a bit more. I would recommend dressing up and enjoying the fine dining room, because with a chef like the one here you should go big or go home. The room is airy, with nice space to stretch out between the tables. Unlike much fine dining in the Cleveland suburbs, the room here does not feel overly gilded or tacky. The interior decorator chose bold colors to paint the walls, like orange and burnt red, and I like it. A touch I love is the ceiling has black paneling with buttons in it, which resembles a plush cushion from a nice leather chair. It really is an extra touch of class that a restaurant goes to the trouble to \"design\" their ceiling, instead of leaving up those porous square panels that remind everyone of cubicles or the stuff you'd throw and stick pencils in when bored in the back of social studies class. You know what type of ceilings I'm taking about.  The menu is the perfect Goldilocks length. There's stuff to please everyone here, with not too many choices to weed through. The menu changes occasionally. I ordered a duck confit appetizer with delicious and slightly sweet pulled duck wrapped in flaky pastry dough, baked till golden, and then plated with some strawberry compote and peppery greens. The plating was visually beautiful, and the meat was perfectly prepared.   For my entrée I had the pork chop with sautéed Brussel sprouts with bacon, cherry jam, and a butternut squash flan. The best descriptor that I have for this dish is sexy and it knows it. The chop was tender, salted perfectly, complimented with the sweeter jam, and rounded out by the substantial sprouts. But the part of the dish that convinced me this restaurant is on a different level than the rest was the savory flan on the plate. That flan was creamy, savory, a different take on a familiar taste, and exciting enough it could have comprised a whole dish instead of just a side to the meat. I'm normally a vegetarian leaning fish eater, so the fact that a pork chop has my mouth watering right now is quite an accomplishment.         Summary:   This establishment exemplifies fine dining without the pretension, and unique ideas without the hype. I would say if you live in Cleveland this restaurant is worth the drive out just to dine here. All aspects of the dining experience, from the atmosphere, to the service, and of course the food are exceptionally good."}
{"text":"A girlfriend and I went here last night. It was good but it didn't wow me. We ordered off the pub menu. I ordered the raspberry mojito, which was decent but not anything memorable. For dinner my friends ordered the grilled cheese, which she liked. I ordered the black and blue burger which was also good. The service was pretty slow. I asked for a dessert menu but she never brought one so we just paid and left. Overall, it was good and I would eat here again. But it wasn't spectacular and it was a little overpriced."}
{"text":"Arguably the best restaurant in Medina. The chef has mad skills, so you can order pretty much anything and you will be happy. The downstairs is more pub like vs. the more fine dining in the upstairs room. The jerk chicken is awesome. All the appetizers are great as well."}
{"text":"Food came out cold which wasn't a surprise since it took so long for our food to come out, so clearly it sat for a while before being brought to us.  My pizza crust was burned and it did not have a tomato confit on it as advertised.   Overall we were underwhelmed.  Perhaps our expectations were too high given all the rave reviews."}
{"text":"First time visiting last with friends who had been here. Food was delish. I had steak and it was cooked perfectly. Our waitress, Sarah, did an amazing job, plus we just really had fun with her. Will go back!"}
{"text":"Someone once asked me what is the best restaurant in Medina, I quickly answered Thyme2.  I appreciate the great food in the dining room upstairs, and the more casual food and ambiance downstairs.  Great value and great food."}
{"text":"I chose this place because of the good ratings on Yelp & the fact that we spent the morning at the farmer's market nearby. The service and ambiance were great, but the food was not. Hubby had a pepperoni pizza, and it was a greasy, soggy mess. It was served on a metal pizza pan with a piece of paper under the pizza, probably to soak up some of the grease. Since it was impossible to pick up, he attempted to eat it with knife and fork, but kept getting bits of paper in with the goo. He finally managed to get the paper out from under and ate what he could. I had a salmon salad - basically a piece of salmon on a bed of spinach with some thinly sliced apple. Despite a sign on the door that said \"Farm to table to you,\" and a wonderful farmers market that took place all morning only a block away, the spinach appeared to come straight from a bag, and was not at all fresh. The salmon was, at best, meh. Not going back. SO disappointed! I expected more."}
{"text":"We found the Yelp reviews to be accurate. Thyme 2 is known for creating well considered food presented in a tasteful atmosphere. They delivered on it! Our food was spot on. Also our server was lovely. We will certainly return anytime we visit the quaint little town of Medina, Ohio."}
{"text":"This a great place to get some really good burgers. The restaurant has fine dining and a pub downstairs. Have only done the pub and it is always pretty good. Burgers are always good. Good salads. And the service is usually always good."}
{"text":"Great atmosphere, very professional employees that are accommodating to their guests. Had the fire roasted pork which was delicious. My wife and friends had a very enjoyable experience thanks to John the chief with his recommendations and Sam with her great service."}
{"text":"I love the food here. The seafood options are as good or better than the best of Cleveland."}
{"text":"Let's call this more like 4.5 stars. I've been to their old location and loved that. So the wife and I finally got to check out this place. Finding parking was a bit difficult. I guess that is expected in downtown Medina. Once parked, we went in and got seated right away. We went to the casual dining pub downstairs. There is finer dining upstairs with a full dinner menu. We tried some some burgers and they were delicious! Cooked to order perfectly, sharp cheddar, and thick crisp bacon topped with fat, non-greasy, sweet onion rings...... Heaven... The  fresh cut fries were also really good.    We are definitely going to come back and try the fine dining as well. I'll update when we do that!"}
{"text":"Great service...great food.  Chef John seated us and spoke with us.  Just a great little medina find.  Have to get the garbage fries...so good.  Eating light so we just got a pizza but you can tell everything is fresh and homemade here."}
{"text":"Lunch at the Thyme2 Pub.    Outstanding!  Burgers, salads , wood fired pizzas , sandwiches, great apps and desserts. No short cuts taken. Scratch kitchen. Go to spot for lunch or dinner.  Fine dining upstairs is tops in Greater Cleveland."}
{"text":"Great atmosphere, awesome burgers, and excellent customer service!  If you are within an hour of here, the trip is totally worth it.  All mixed drinks were expertly done."}
{"text":"Out for a birthday dinner Fabulous waitress Perfectly cooked steak ! Not too expensive - we got seated a little late but the made up for it by offering a taste of their fall soup We were also allowed To bring a cake , which many places do not allow anymore  I will be back"}
{"text":"This is the best restaurant in medina county. I have loved everything I have eaten from the pub menu and was very impressed by the uniquely delicious combinations in the fine dining section. The pizza, bacon burger and sauerkraut balls are delicious. Their prices are much more reasonable than you would think. Always excited to go back!"}
{"text":"I love this restaurant.  We visited last night with a party of 6 and every person commented on how exceptional their meals were.  Great ambiance, reasonably priced and Chef John stopped by our table to personally check on our experience.  They just rolled out the new seasonal menu and we couldn't be more pleased.  The Brie appetizer and mussels were delicious and I can't say enough about the presentation.  If you haven't tried it, check them out!  They have upscale dining upstairs and pizzas and burgers downstairs ( among of things) so whether we plan a special occasion or are headed home after a sporting event with the kids, Thyme2 is always a great choice!  Can't wait to go back for Mother's Day Brunch. Keep up the good work, Thyme2."}
{"text":"Favorite place to eat in Medina.  While I loved the old location so much, the new one has its benefits.  Upstairs - fine dining, Downstairs - pub, casual dining, but you can also eat off of the fine dining menu.  Everything at Thyme is delicous - a favorite is the Thyme Chicken - if downstairs, try the sausage pizza.  Yum!  Love everything from the bread with Thyme butter (delicous!!!) to the dessert.  A definite stop if you are looking for a good meal in Medina that makes you forget you are in Medina."}
{"text":"We went to Thyme for a special birthday lunch. It was a beautiful summer Saturday, so we dined on the deck, which was quite nice. The service and ambiance were great, and that's why they get 3 stars, because the food was mediocre or worse. I had a pepperoni pizza. It was a greasy, soggy mess. They should have served it in a bowl. Actually, they served it on a metal pizza pan with a piece of paper under the pizza, probably to soak up some of the grease. Since it was impossible to pick up, I attempted to eat it with knife and fork, but kept getting bits of paper in with the goo. I finally managed to get the paper out from under and ate what I could. I was quite hungry, and I love pizza, so this was a great disappointment. My wife had a salmon salad - basically a piece of salmon on a bed of spinach with some thinly sliced apple (or pear?). Despite a sign on the door that said \"Farm to table to you,\" and a wonderful farmers market that took place all morning only a block away, the spinach appeared to come straight from a bag, and was not at all fresh. The salmon was, at best, meh. Not going back."}
{"text":"It is an amazing place. Luved the atmosphere and the food and wine selections were amazing. Service was excellent.  Special thanks to Jordan,Amber and John for making it a enjoyable experience . Would highly recommend this place.  Thx  DR MD"}
{"text":"Great atmosphere, fun and innovative menu and everything here is super flavorful. The sandwiches are a great bang for your buck. Oh, and best damn cocktails and drinks in the area."}
{"text":"Wonderful. Excellent vegan meal prepared on request.  Very much appreciated on the road after 70 mile canoe race on  Susquehanna River in NY heading back to Ohio ! Carbs mean success!"}
{"text":"We love this restaurant.  The food is really delicious, and the dishes are well-conceived.  John Kolar is a master at sauces.  The lobster pizza appetizer had lots of big chunks of lobster, and my pork chop was expertly cooked.  Even better, the ambience hits just the right note: upscale yet comfortable.  You can also \"go casual\" at the bar or downstairs for the pizza and burger menu.   The wine list has a nice variety, with some good wines for under 40 dollars.  The best dessert to get?  S'mores martini.  yummmm."}
{"text":"We stumbled upon this place on our way home from the airport in Cleveland. The patio is very nice. The food was amazing. The service was good. The food came out fast. Everything was great! I had the grouper and my husband had a cheese burger."}
{"text":"Have been there several times.  Each time I go the food gets worse. This will be the last time I go there.  Orderd 1/2 chicken & received two pieces of chicken food was cold had to send back. Still came backed luke warm."}
{"text":"Great atmosphere and great service. Both inside and outside dining. Choice from a more formal dinner or pub food. Their hamburgers are so large that they can be shared !Finish it off with a French Press (you get the whole press - enough for 2) and its a perfect meal. Excellent service - friendly and attentive servers in a warm cozy atmosphere."}
{"text":"Happy hour 4-6, M-TH. Upstairs bar only. Sliders, Martini's, and mini crab cakes!!!!! This is a great value and my favorite spot in Medina."}
{"text":"Very good.  Flavor groupings and overall taste very sophisticated, from appetizers/salads through main course and desserts.  Love the food, no complaints.  The amuse-bouche is a bit dated and a little pretentious imo.  Waitstaff too chatty, and \"convincing\" you about the quality of the food -- AFTER you have ordered it.  Awkward, but still had a great dinner."}
{"text":"Buyer beware.  My spouse and I discovered Thyme a couple years go when they where still on North Court Street and it's always been our favorite.  I've always recommended them as the best food in town.   Last night went there with friends and where disappointed. My spouse when ordering liquor will only have one martini. Last night at Thyme she (and her friend) ate lite, sharing an appetizer, but had a second martini and then a third and were still fully functional. Leads me to believe they are watering their expensive, top end vodka!!   And found out when we received the bill they charge a dollar extra for blue cheese stuffed olives,  each!!!  Go here for the food, but avoid ordering cocktails."}
{"text":"I just recently visted this place for the first time. It was during a rush for lunch hour for a christmas party. This place was on point with everything. The service was spot on and the food was amazing. Highly recommend the chicken caesar salad.. YUM! Ive heard other items on their menu are really good as well. This place was more towards the fine dining side but it was perfect and what we were looking for."}
{"text":"We walked in Saturday evening without a reservation on Resturant week expecting a huge wait or to be told we wouldn't be able to get a table at all. It was a packed house and the reason for a 4 star instead of three was the fact that the hostess went out of her way to get us a table. After looking for a table upstairs or down with no luck she said \"I have an idea\" she ended up taking two smaller tables in the upstairs bar area and putting them together for us and making our own little section for 6. I think most young hostesses would have just turned us away. The food was good, I would expect great for the price but I'm not complaining by any means. It is a neat spot with a \"fancy\" Resturant upstairs and pub style downstairs, the cool part is you get both menus and can order anything you want to have regardless of your seating location. We will give it another try for sure, it was just so busy with a lot going on to rate it off of one experience. I'll usually eat at a place a few times before even giving a Yelp review but was so impressed by the young lady. First impression's mean a lot  and she nailed it. Very friendly staff and good service."}
{"text":"I must confess, I've never ordered anything but a burger in the half-dozen or so times I've been here. But that's because Thyme2 knows how to prepare a burger, oh my lanta. They offer 6 options, all of which are entirely delicious, and from which the bacon burger and the mushroom burger stand out as the best in this burger girl's opinion. They always come to the table cooked exactly as requested, hot and dripping with flavor, both figuratively and literally. These are massive burgers my friends, and with the toppings, require either a whole lot of finesse to pick up and eat daintily, or better yet, being willing to give up on the impossible and embrace the delicious mess. I've never been able to finish both my burger and the fries, and the last time I went, my friend and I split a burger. They even served our halved burgers on separate plates with half the fries on each, which was the perfect portion for me. (But if you're hungry...don't hesitate, order the whole thing! You won't regret it.)   Anyway, I think I have communicated the truth that there are great burgers to be found at Thyme2. Aside from that most important fact, the service has always been quite friendly, and I've never had to wait to sit downstairs in the pub. One of these days, I will put on a fancy dress, do my hair, and find and excuse to eat dinner upstairs in the fine dining area, and foray into the many enticing options on their fancier menu. Until then, I will keep returning to satisfy my gourmet burger cravings in a way only Thyme2 has been able to do."}
{"text":"Loved this place! I took my boyfriend here for his birthday and it was excellent. The wine was wonderful and Our server was phenomenal. I wish I could remember her name so I could give her a Yelp shoutout! My only reason for the 4 stars and not 5 was because I got the filet and it wasn't chard at all. It kinda came out like a hamburger patty, it was sort of odd. However I had it sent back and they fixed it and it was much better. Definitely recommend this cozy spot!"}
{"text":"Enjoyed as nice dinner with wife and friends on the downstairs restaurant. Very cozy, service was excellent. Enjoyed appetizers and wood fire cooked pizzas. You can also order from the upstairs restaurant menu from downstairs."}
{"text":"My fiance and I dined here on 1/14 and while we've been here before a couple of other times and it's always been great, this most recent time I was EXTRA impressed with the service. First, our server Sarah was fantastic, she is personable, easygoing, and made our dinner a really great experience. She was able to anticipate our needs and go out of her way to communicate them to the chef. Then, the chef himself came out to confirm our needs (our needs being my fiance's giant customized steak/personal roast), cut a filet exactly how my fiance wanted it, and it was done perfectly and delicious. All around a great experience, as always! :)"}
{"text":"Not what it used to be.  Our food came out at different times and the quality was terrible.  On top of that, my steak was not cooked to temperature.  Can't even get the basics right - and it was a slow night with the dining room only half-full."}
{"text":"Fantastic. Lamb was great, fish with macadamia nuts,  gnocchi appetizer. Was great all around. Service was also stellar."}
{"text":"Our favorite restaurant in Medina! Whether you want bar food or top notch cuisine, they have something for everyone. The best burgers around! Pizzas are phenomenal, chef and staff are fantastic! Highly recommend!!"}
{"text":"Somewhat disappointed. After hearing and reading other reviews I thought we should check it out since its not far from our home. People state that it is the best restaurant in Medina County, perhaps it is. But then Medina  does not have any really great restaurants. The food was average, the service very average (we sat at the bar) the bar tender was not very attentive and it was not crowded. Parking is a real problem. Even though the lot is large it is a public parking lot and very crowded due to other businesses near by. I had blackened swordfish, sort of dry and thin. My wife had the 4 cheese pizza, they burnt the first one and the second one was just okay. We shared their version of a Ceaser salad, which was way below average. This was our first time there, so as always we'll give them a second chance, we may have just caught them on a bad night."}
{"text":"Went with my friend and had reservations.  We arrived early and were seated immediately.  The waitress was fantastic.  We ordered filets and they were done to perfection and beautifully seasoned.  Usually most places under season the meat, not here.  Definitely going back.  The owner personally came to our table to make sure my steak was cooked as ordered (I tend to eat really raw steak).  Everything was wonderful and we will be returning.  The owner certainly knows the meaning of customer service.  He was involved in everything that night making sure each table was properly set, customers were happy, and knows how to run a restaurant."}
{"text":"My favorite local restaurant.  Food was delicious.  We had a Caesar salad, seafood pasta, filet, & lava cake  Everything was great.  The only thing better was our server Sarah.  She was engaged & helpful the entire night, both with food and life.  I will absolutely return."}
{"text":"In trying to find a place between work, home, and my out-of-town guest's hotel, Yelp recommended this place, and we are thankful for Yelp!  My friend is a pescatarian, and I'm an omnivore, and the menu here had enough to please us.  We ate down in the pub, which provided us with the quiet environment to catch up in person while tasting amazing dishes.  Our meals started with the house giardiniera - pickled green beans, carrots, and peppers.  We shared two appetizers - shrimp lollipops (breaded shrimp in a coconut peanut sauce) and brie en croute.  We both had lobster waldorf salad.  To top it off, we split a vanilla bean creme brulee.  The plates were very visually appealing, with a fancy layout even though we were eating in the pub.  The food tasted very fresh and well thought out.    The service was great, as our server kept up on our waters and the rest of the staff made sure food came out at just the right times.  My only complaint is that the address shows W Smith Rd, but if you look at the building, it looks so non-descript.  This is because the business is facing its parking lot, which is off of S Court St.  If you go into their parking lot - across the street from Castle Noel and next to a yellow house - then you'll find the restaurant neatly tucked away.  This place is a hidden gem, and I'll gladly return with my husband for special occasions."}
{"text":"First time here for lunch. What can I say? This place is AMAZING! service was great and the food to die for! Real wood oven pizza home sauces great tasting combinations who knew I can get first class cuisine in Medina Ohio. Thank you all look forward to eating everything on the menu soon!"}
{"text":"Tried this place out after seeing it's high rating on Yelp with a descent amount of reviews. The plan was to dine in the basement \"casual\" part of the restaurant, but we were offered the patio as another option to casually enjoy the \"pub menu.\" It was a great choice as the patio was large, and very pleasant. The wait staff was fantastic, but almost too efficient (I'd barely put my fork down after finishing something when the bus boy was taking my plate away already). Had the sauerkraut balls as an appetizer and they were delicious (really more like reuben balls actually). For my dinner I had the Bacon Burger and it was definitely \"top 10\"! The bacon was cooked inside the burger and it was topped with tomato jam, bacon aioli, and brie. The fries were pretty good too. I tried a couple new beers too - a Belgian style ale (don't recall the name but it was a little too bitter for my liking) and an Indian pilsner.  Overall, great dinner - I'll be back."}
{"text":"The Easter brunch selection was mediocre at best. The biscuits were cold and flavorless. The staff couldn't be any less enthused. And some pointers to the staff: don't criticize the customer's orders when they're within earshot of you. That's just bad taste."}
{"text":"I was waffling between trying this restaurant and another highly recommended place.  Man, I'm soooo glad I came here.  I was traveling alone and sat in the bar.  I was warmly greeted with ice water, a basket of bread and thyme-honey butter... Yum!  I was also given a sample of the evening's soup selection which was delicious. I was told everything is made in-house with the exception of the hamburger buns.  It's apparent.  So good.  Service was impeccable. Food was heavenly and I'll definitely be back when I'm in the area again."}
{"text":"Been here several times but have only eaten in bar area downstairs. If you love grilled cheese, you just have to try theirs! It is so delicious and it comes with their spicy tomato soup ... soooo good!"}
{"text":"You will not be disappointed! My wife and I have gone to fine dining here give times and the pub twice. Each time has exceeded expectations And I end up raving about something I was nervous to try. Great place."}
{"text":"Always great, food is great nice sized servings.  Often can't finish.  Service great. Need to try the downstairs sometime."}
{"text":"I've been here several times. The service has always been excellent, especially when suggesting wines to pair with the meal."}
{"text":"This was a great dinner experience.  Took my wife's grandmother out and she is not a frequenter of many restaurants and she was quite happy with her meal and wine that she ordered.  I picked the personal baked pizzas and the seasonal pint of beer.  Great dinner and wonderful atmosphere to enjoy a meal and relax on the weekend while visiting relatives in Ohio.  Service was decent, on time and always ready to refill your glass (water or liquor)."}
{"text":"Have been to Thyme 2 a few times and it has been good. Today it was OUTSTANDING! My husband had the Caesar salad and black and blue burger that he said was excellent. The roasted beet salad ROCKS! Amazing. Can't wait to go back. Mike our server was also A+++!"}
{"text":"Although they have two menus, fine dining and pub, you can't order pub in fine dining but you can order fine dining at the pub. A bit weird. We went to the pub to have access to both. Four of us. We had a mixture of food from both menus. I can only comment on my seafood diablo. It was quite delicious. Generous seafood morsels and a bit of heat. Not really hot so most who like a bit would be satisfied. A bit noisy. My companion's food looked good but I didn't request comments, sorry!"}
{"text":"I received a recommendation to go here. My out of town friends and I arrived after eating dinner at Twisted in Medina. We wanted a drink and sat at the bar downstairs. Sarah the bartender was nice and explained that everything was put away. We told her no worries we are fine. She made 3 great drinks. Upon ordering a second round the owner John came and said Sarah was not comfortable serving us. In all of my 38 years I have never not been served. He did have Sarah come over and serve a second round. I did not partake to make them feel better. Why if they were so uncomfortable did they serve my friends another round? I tried to talk to the owner & he said he supports his staff. I do respect that but explained they this was completely unfounded. I even asked him to watch the video tape. I will never be back."}
{"text":"Was SO excited to finally try this place after hearing that they had the best burgers around.  We sat on the patio, around 12:50, not rush hour.  Service was slow, took a long time to get our food.  I was asked how i wanted my burger cook- medium.  I expected some pink and juicy.  It was TOTALLY well done, even the top bun was charred.   So very dry, couldnt finish it.  For almost $11, would not recommend.  So many other better burgers around the Medina area, dont go."}
{"text":"-The Experience Left A Bad Taste In My Mouth-  I've never been so disappointed with a place enough to leave a bad review. This place was so horrible that it prompted my first review.  My friend and I were pretty hungry and he decided that this place would be good to sit down and eat. He'd been there a few times and said that he gets take-out from there all the time. I trusted his judgement because I'm not from Medina, and I don't know what choices are around there. We requested a table downstairs, and were seated almost immediately, which was nice. My friend continued to rave about the food and showed me some of the entrees that he enjoyed the most.  We were given water and I continued to look over the menu, and the food did sound good. I figured out what I wanted pretty quickly and he had already selected what he wanted. We continued to sip our water, which was refilled often. I always said \"Thank you\" to the girl that was filling up our water but never even received a glance. She never replied, just simply refilled our glasses and left.  Following that, I had glanced around to try and see what was taking so long. A waiter, who I actually made eye contact with, continued to wait on tables nearby us, but never even stopped to our table. They didn't seem extremely busy, and could have at least stopped to take our order or get us something else to drink.  I would have even been a bit more understanding if someone had walked by and said \"Sorry, we're understaffed today so the wait may be a bit longer\" or something.  After 30 minutes of waiting to be acknowledged by anybody working there, we decided to get up and walk out. Then the wait staff seemed to notice and looked at us like \"Why are these guys leaving?\" Nobody said anything to us as we walked out. The food may have been good but I'm not going to forgive being completely ignored. I will not be back."}
{"text":"Inappropriate manager/owner behavior towards his staff. Not to mention the place is cockroach infested. If I could give 0 stars I would."}
{"text":"This place was amazing! The server was so sweet & everything we ordered was amazing.  We had a grapefruit gin drink, white wine, stuffed peppers, beer cheese soup, mixed green salad/Greek salad/salmon salad + brie cheese BLT! I would highly suggest trying this place out - we sat outside as it was a beautiful day out so cannot speak to the inside atmosphere.  If I am really trying to get picky - the salad lettuce could have been a bit stiffer and the bun (although yummy) was a bit too hoagie-y for the fancy BLT it was going for - all the same, I ate it all! Would go again if in town."}
{"text":"We've been here a few times, so it seems I should do a review.  We both ordered burgers and both were very good, except my wife had to send her soggy bacon back to get crispy. We ended with a chocolate molten cake. It looked like it was a Smart One you can buy at the grocery store. It came with a scoop of ice cream about 3/4 the size of a golf ball for $7.50, not a good deal. I was expecting more on this visit."}
{"text":"We spent Valentine's Day 2015 here and it was a great experience.  Food was timed perfectly, friendly wait staff, chef visited each table, manager brought a rose to each lady dining....the food was amazing except for the seafood in the diavolo was overcooked. Points for using Ohio City pasta though. The sauces were perfection from the chili lime sauce on the calamari appetizer, the homemade ceaser on the salad, the orange something that accompanied the macadamia crusted grouper to the raspberry on the chocolate dessert we shared.  There are two dining options, downstairs in the pub and upstairs fine dining with two different menus. If you sit in the pub you can order off either menu. If we find ourselves in Medina again I would go back to try a burger at the pub."}
{"text":"Just had dinner for 3, and the pork chop was incredible as well as the filet my son had (I was able to have some of his), I love this whole restaurant, from the bar tender to the servers , they are awesome!"}
{"text":"We came last night for the first time to Thyme2 to meet a friend from out of state for dinner.  This restaurant was recommended to us by someone who I know to be very particular about the quality of dining out.  We made a reservation ahead of time for eating in the fine dining area.  We were seated in a cozy and quiet booth.  Our waitress was cheerful, attentive, and helpful throughout our meal. According to our waitress, the menu changes seasonally and was recently updated.  All of the menu items are intriguing combinations of ingredients and it was difficult to choose what to order.   My salad choice was a frisee lettuce with golden and red beets, a large a slice of fresh rolled soft goat cheese covered in chopped almonds, and a light and complimentary orange vinaigrette dressing.  My chicken breast entree was served in a delicate maple glaze with large chunks of cooked carrots and delicious mashed potatoes.  The chicken was extremely tender and moist.  It was the best chicken entree I recollect ever having eaten.  I though my husband was going to eat all of the bread in the basket because it was so fresh and delicious.  It was served warm, with a perfectly light and crispy crust, and a delicious parmesan butter.  Our friend ordered the special soup of the day clam chowder and the strip steak.  My husband ordered the beef filet.  We enjoyed our entrees immensely.  All of our entrees were ample, fresh, and so tasty.  After visiting for quite a long time, I am sorry that we did not have time to look into the dessert menu.  We will definitely be back soon."}
{"text":"The food is great but we have had horrible service 3 out of our 4 trips.   It keeps me from going back."}
{"text":"Great place! Bartender was awesome stuffed peppers appetizer was a meal! Great place would visit again on my next trip!"}
{"text":"Stopped by Thyme2 for my mother-in-laws birthday recently and we had a great meal. Our reservation was for 8pm and we were seated immediately upon arrival. We were served water and then we ordered a brie appetizer. We were then given bread, which only I ate. The bread was fresh and delicious as was the home made butter spread that was included with it. They had a good selection of wine and a few beers on draft. I ordered a Fathead's Bumbleberry, which is one of my go to beers.  For dinner, I ordered salmon. A little while later, our dinners were delivered. My salmon had a nice crust on the outside and it was cooked medium, which was delicious. My mashed potatoes had wasabi mixed with them and that was interesting. The wasabi wasn't overbearing and they were green and good. It also came with a spring roll and some dipping sauce, which I loved. I ended up dipping everything in the sauce. I loved the dish!  Everyone else at the table loved their meals and they all said they'd give it five stars. I tasted my wife's pork chop and it was yummy. My father-in-law's potatoes and zucchini were average. My mother-in-law's deep fried potato balls were excellent as was her filet mignon.  We'll be back to try more and I can't wait to have a burger downstairs."}
{"text":"Pretty mediocre.  I was expecting much better after reading some reviews.  My wife said she doesn't want to go back there."}
{"text":"The best burger in Northeast Ohio and the jerk chicken sandwich is a staple too.  Great for both fine dining and the pub. Service is top notch."}
{"text":"In Medina for a third appearance in litigation I am handling (over a defamation suit regarding two eBay reviews!) I decided to try a new place for dinner.  I picked this one based in part on the friendly views of other Yelp, and my choice was rewarded -- it was a nice meal.  Good choices of beers (and wines, but beer is what I wanted), a nice soup of the day, good mixed greens, and a fine entree -- macadamia-crusted grouper with black rice.  A bit pricey perhaps but I would certainly put it on my list of places to return."}
{"text":"Good food for Medina! Chef and owner John keeps it consistent and service is decent!  Sit down stairs for both menus upstairs fine dining only!"}
{"text":"Sorry to say I am not a member of the Thyme 2 Fan Club.    This review is based on two visits -- one upstairs; one downstairs.  Generally we have found the food to be very good, but not outstanding.  (During our visits the service was actually better than the food.)  During the most recent visit we sat downstairs at a table where we got blasted with cold air during a very cool evening.  We were told there was nothing they could do and that the HVAC system MUST throw that air out at customers to keep the place from getting smoky.  There were no other seats where this could have been avoided, we were told by the very nice server.  The fish would have been good except that the skin was fried.  It both stunk and tasted nasty although the rest of the fish was delicious.  (Silly me -- I believed the server when she said it was crusted.  It wasn't.)  Is the place good?  Sure.  Excellent?  Uhh, no.  Would we return? Yes -- if we could not find an alternative."}
{"text":"I recently discovered Thyme2 and have been there a handful of times.  I have to say it is just amazing every time! Their soups are delish and their pizza is to die for, the crust perfectly crisp from the wood fired oven. This will be a favorite for years to come. Keep up the good work!"}
{"text":"I visited here twice in the past 3 months on a date night with my wife.  Thyme2 is located just off the square in Medina.  Upstairs is a small intimate dining room with a separate bar area downstairs with separate menu for bar food.  My review is based on my two experiences in the dining area.  Our first visit was perfect.  I ordered soup and hangar steak.  The soup was perfection in a bowl.  The hangar steak was cooked perfectly and had the most flavorful taste I'd had in a while.  Setting, service, and food were all worthy of 5 stars.  Each area of our experience made us want to come back.  And we did a month later.  Our second visit started off like the first.  I again ordered soup and had crab stuffed fish.  The food was perfect yet again.  There were a couple issues I had with our second visit.  There was a large party there that night.  They took up several tables along the back wall and they all brought their screaming kids.  Now this isn't the restaurants fault for having idiot parents.  This isn't a place for kids.  Those people ruined my experience that night.  I don't hold that against the restaurant.  Where I take away a star for my review is from our service.  Our server acted like we were a nuisance.  She attended to tables seated after us for starters.  We waited for 10 minutes after being seated before we saw her.  Then she acted like we were a pain for her to wait on.  We didn't say or do anything from the start so I'm not sure why she treated us so poorly.  We didn't get drink refills.  She showed up to show us dessert info just after we got our entrees because the table next to us was ready.  Not really a big deal.  It just added to the poor experience.  And I waited almost another 10 minutes to pay my bill after we were finished.  Had she treated us better this review would have been an overall 5 star rating.  Best restaurant in Medina. Food is the Star here and is always outstanding.  My wife and I like to eat here at least every other month for our date night. Not kid friendly.  Leave your kids at home."}
{"text":"Okay. I kid you not-the blended burger was the best burger I have ever had. It was blended with portobello mushrooms and finished with a onion bacon balsamic sauce. I love 45 min from medina and will drive back for this burger. Unbelievable. My husband had the salmon wrap and he loved it too! Great place!"}
{"text":"Always a great experience.  Very good fine dining options.  Clever pub fare for kids and tamer palates.  Great cocktail and dessert options.  We have been coming here once a month since moving to Medina 6 years ago and still love it."}
{"text":"Best triple grilled cheese sandwich! Crunchy, cheesy, and the tomato soup...so creamy and smokey! And only $10.50   Great portion too."}
{"text":"So we visited Thyme 2 today after international fest. I would give 3 and 1/2 if yelp allowed half star ratings.   The Good - food was more than decent. The Mediterranean pizza was yummy, the special which was a chicken sandwich was very good. My salad (once I had dressing) was good. They have beer on tap so that's always nice!   The not-so-good -  1) our waiter seemed to be very unhappy having to be there. It dampens the experience and puts the group in a worse mood. Don't be a waiter if you can't at the very least be kind to people who haven't done anything to deserve your attitude.  2) they cleaned the tables with a very strong smelling disinfectant. Not appetizing at all.  3) over salted French fries. They were good just tone it back a tiny bit.  4) my salad (the mixed green) needs to have more dressing. It tasted like there was a table spoon on there... Maybe.  5) the Mountain Dew tasted like straight syrup.  6) both my glass and one of my compadres glasses were chipped. Probably shouldn't use glasses that can result in a lawsuit!    Overall the food (mostly) was what saved the experience. I would go back and give them a second chance."}
