{"text":"I've been looking for a Tibetan restaurant to try and after reading the other reviews, my boyfriend and I had to try this one. As soon as we walked in, we were instantly greeted by Garab (I think the owner!) with a huge smile on his face. We were already off to a great start! 

As we had never had traditional Tibetan food, we had Garab recommend us dishes to try and they were absolutely delicious! We started with the momos which are traditional Tibetan dumplings (3 steamed and 3 fried) and they were great. For entrees we split the chilli chicken and the Shaptak, and the flavours and spice were perfect (spice level would probably be rated a hot at Thai restaurants in the city). Both dishes also came with a bowl of white rice. 

It's surprising this place wasn't busier on Friday night because it definitely should be. The service is fantastic and I would highly recommend this restaurant. We will definitely be back!"}
{"text":"First time ever eating any of the Tibet style food. I would eat here again. The choice on the menus was very easy to understand and everyone in our party was pleased with the food."}
{"text":"Food was good and the outdoor patio had quite a relaxing feel to it. If your looking for tibetia comfort food this is definitely the place!!"}
{"text":"Had pork chili which comes with a rice. I loved the food. It is spicy and amazing and matched my expectation..... It just cost me $9 and i was full!!!!! I will recommend this place for someone who can handle the heat.... I am going back for more."}
{"text":"Being a Tibetan I'm pretty picky with my Tibetan foods. & it's hard to find satisfying good Tibetan food. But Tibet Kitchen is beyond my satisfaction. Super like!!"}
{"text":"One of the best Tibetan restaurants in Downtown. The server and owner is very friendly. The beef dumplings is a must.. 
This place is always busy however the service is relatively fast. Highly recommend.."}
{"text":"Nice place for dinner. The patio is basic but the vibe is great. I went on a Friday night and they had a singer doing karaoke of old bollywood songs and the crowd was totally digging it. Food: the pitcher of beer was flat :( But the chilli pork was so amazing! the beef something I ordered was pretty blah (so boring I don't remember what I ordered). And the chicken momos was pretty good too. The service was super nice and they are willing to listen to feedback so I hope they improve."}
{"text":"We love this place. The food is amazing and the owner is soooo nice and accommodating. Couldn't recommend this place enough."}
{"text":"After reading some of the reviews here, i had to leave a comment behind. Most people who left negative comments here have no clue what tibetan food is. If u go into a tibetan restaurant expecting Chinese and Indian food, of course it is not going to meet ur expectations. Tibet kitchen offers 
home cooked comfort food that Tibetans all over enjoy. Tibetan cuisine has evolved over the years; it has Mongolian, some Chinese, and heavy Indian influence. In no way is Tibet Kitchen comparable to a Chinese owned sushi place. Lol. Really? Tibetan food is unique; momos are meant to be thick, they r not wontons or whatever the chinese equivalent is to many ignorant people. The roti is different too, it's not the same roti that u get in indian restaurants. 
Tibet Kitchen is a decent place to eat in. The food is authentic. Although the place is rather dingy and poorly lit, the food is delicious. I love their spicy sausage (gyuma khatsa)."}
{"text":"Came all the way to downtown to try the place. Worth the trip :)
Owner and staff are super nice, more like a family kitchen, we saw lots Tibet people having lunch here too. Food are great! especially the milktea, the first time have home taste since I came to torono. 
Will come back again for sure! :D"}
{"text":"Amazing food, service and possibly one of the best (and most secret) patios in the city! The gyuma (blood sausage) is not to be missed and the beef Lhasa momos were juicy and delicious. The ginger cardamom tea was lightly sweet and exquisitely aromatic. Previous reviews were bang on about the chili chicken - it's especially good dry with gravy on the side!"}
{"text":"If you want some authentic home style  Tibetan food and very warm hospitality -this is the place to go.. Garab - the proprietor is a great guy..."}
{"text":"Excellent food! I loved the momo and the Phaksha Khatsa was full of flavor! Will definitely come back here again! Garab was the best!"}
{"text":"I've had my share of South Asian and Himalayan cuisine in Asia over the years, and this place has what I'm looking for: friendly service, great prices, and simply delicious food!

It's an easy place to go by yourself, or with friends. They have a nice lunch special for around 7 dollars. Will need to check this out too.

The momo's are great; try the moon shaped momos. Beef and hand made noodle soup was nice as well. (The noodles are house made and hand cut to bite size pieces, so all you need is a soup spoon.)

Will be back for more!"}
{"text":"I am visiting Toronto from NYC and my first stop was Tibet Kitchen. Heard that it is one of the most famous Tibetan Restaurant in the town. I had the Gyuma which was really good. The chicken pakora was even better. Momo's was delicious. As heard the food was really good. 
The owner was the one serving food and he was very good. My experience in Tibet Kitchen was really good."}
{"text":"let me just start by saying, Tibet Kitchen is the only restaurant I would gladly drive from Mississauga to Toronto just to get my dose of momos and chicken pakoras! Service is excellent, everybody makes you feel welcome once you arrived. Amazing food, can't get enough! I always order their momos, chicken pakoras and chili chicken, highly recommend them!"}
{"text":"Food was tasty, but not fantastic. We ordered the pan fried kothey chicken momos (8 dumplings) as an appetizer, but they took very long and arrived about 2 minutes before the main dishes. Only 3 tables taken at the restaurant, ours + 2 more, and we all walked in at the same time. The other tables had their mains served before we even got our appetizer. 
Had the chili chicken (very nice) with rice, and the special chowmein (ok, but was missing some kick or maybe more sauce). Good size portions, but had no leftovers for 2 of us. I also tried the Tibetan butter tea, and enjoyed it, salty and all. 
Service was friendly, but the main dining area lacks in ambiance and could use a good cleaning (e.g. vents were scary). What you can see from the kitchen is a bit run down, and I truly hope the state of the washrooms is not reflected in the kitchen area. Yuck! 
Can't comment on the patio, as it was the middle of winter. 
All in all, being my first time trying Himalayan food, I was intrigued enough to want to try other places, but probably won't go back to this restaurant."}
{"text":"Great food, great service, great patio! 
The server is always welcoming and friendly. The restaurant may seem small but they have a nice patio in the back. Go for the momos!  Amdo Momos (deep fried) and Lhasa Momo (steamed) beef or vegetable. I'm drooling thinking about that chili sauce..."}
{"text":"Tibet kitchen is by far the best Tibetan restaurant in Toronto. Chicken pakora, chilli chicken..thali...n  the list goes on. We are always welcomed with a warm smile by the owner. The food is great..and the friendly atmosphere makes it a great place to enjoy great food and always wanting to come back for more :) can't wait for my next visit.."}
{"text":"Excellent food!! Super satisfied by their hospitality and welcoming environment. By far the best Tibetan Resturant in North America! If anyone is around parkdale area give it a shot  satisfaction guaranteed!"}
{"text":"Stopped by for a Tibetan Tea.  I've had a similar tea in Bhutan, and loved it, and wanted to try the Tibetan style (which was very similar).   Its basically black tea with butter and salt.  Sounds strange, but its a great drink to warm you up on a cold winter day."}
{"text":"Free Tibet now. Food was amazing. Chili fries are a must! Try to sit in the back area, awesome on summer days. You'll will be well fed here, one of the best places I have been in Toronto. Would recommend to anyone. Spicy is no joke."}
{"text":"Definitely a restaurant to try out. It is worth the money and time. Me and my Bf always go to this restaurant most weekends coz it's got all the meaty and spicy stuff I like and the price is very reasonable and affordable.

The servers are extremely friendly and accomadable. The owner is a great guy and truly provide a great service. 

Go once, you will be hooked. 

If your into spicy foods. You must try shapta ( fried spicy beef with or without gravy) chilly pork and chilly fries are lovely too."}
{"text":"This was the very first restaurant I went to when I visited Toronto in 2012. My hotel room was at the airport and traveled all the way to Parkdale for this food. When my gf and I moved here in 2013, it became a staple for us. 

Their chili chicken (dry), beef momos, and chicken pakoras are honestly the best I have ever had. I always use Tibet Kitchen as the standard for food with other Tibetan/Nepalese cuisine, but none of them compare to Tibet Kitchen. Great food, great people, and ALWAYS a five-star experience!  Oh, in the summer... They have one of the best patios in Parkdale. Its definitely a hidden gem.

Go try it ASAP if you haven't been there already."}
{"text":"The food was delicious and the service was excellent. I really can't complain about anything. A definite repeat  for me."}
{"text":"pros: good service, nice patio, good food, amazing mango lassi, portion size is good for the $$
Cons: restaurant closes between 2-5 pm so no late lunch at this place."}
{"text":"Very good chilli chicken and chilli shrimp.
Seems like the food is from Delhi. 
The owner is extremely friendly and nice"}
{"text":"Love, love, love this place! It's a small, family run business. The service is exceptional. The owner and staff are extremely nice and make sure you are comfortable and well served. I absolutely love the steamed momos. Came here on a snowy day in April to enjoy a plate of hot steamed chicken momos with hot and sour soup. We also tried the vegetarian momos, sweet corn chicken soup, chili fries and chili tofu with broccoli. Delectable, homely, fresh food. Highly recommend."}
{"text":"Food that comforts me, chai tea that warms and the most gracious staff .Tibet Kitchen is a favourite for myself and my kids. With a weekday lunch special that's enough food to share  you can't go wrong. My favourites are the Chili chicken (dry) and Ting mo."}
{"text":"Tibet Kitchen is one of my favorite momo spot in Toronto. I moved to BC about a year ago and I am yet to find Tibetan dumplings as good as it is here. The customer service is absolutely excellent and I feel well taken care of every time I visit. And their pork chilli is Ahhh-mazing as well!!!! Can't wait to go back when I am in town :)"}
{"text":"Great family owned/operated restaurant. They are the nicest people you could meet! The food is always excellent and a lot of their menu can be adapted for vegetarian/vegan meals"}
{"text":"First of all, the owner is the friendliest man ever! Loved him. We had the steamed beef momos, the dry chili chicken (we asked for it mild and it was perfect) and the everything chow mein (I forget what it was called but it's the chow mein with chicken, beef and egg). Everything was amazing! My only suggestion would be, if you have a tough time with heat, see if there is another sauce available for the momos because the one that comes with them is crazy spicy. We'll definitely be going back."}
{"text":"Excellent food and service. I would recommend it to a friend in a heart beat. Momos are are one of the best I've had and chilli fries are scrumptious. 5 Stars!"}
{"text":"People are super friendly, the foods absolutely amazing.. Always fresh.I've had their chicken noodle soup five days in a row now :) definitely recommend it for everyone to try."}
{"text":"The best tibetan food in Toronto!! Great food and fantastic service !! Definitely recommended!!"}
{"text":"Great food, very friendly service! The vegetable spring rolls were very fresh and seemed like they were handmade right before cooking. Decent drink menu with beer on tap, bottles and wine selection. Momos (dumplings) and mains were very good."}
{"text":"It's our first time trying Tibet food. We got chilly chicken (dry) and chilly beef. The boss was very very friendly and the food was amazing. Definitely a must-try if you're interested in Tibet/Nepal food."}
{"text":"Great food and customer service. There's an awesome back patio for warmer days and the staff are so friendly. Must try the beef momos. And the steam buns with whatever you order are delicious also. We will be back for sure!"}
{"text":"My sisters and I were feeling adventurous and decided to try Tibetan food.  This place had great reviews so we settled on this restaurant amongst the many other Tibetan options available on this strip.  

We ordered:

Shae mo (half chicken half beef)- good amount of filling, dipping sauce had a good kick 

Jasha khatsa (chili chicken)- we got it dry with the sauce on the side.  I preferred dry better.  Nice and crispy.

Phingsha - this was simply described as sliced beef sautéed with black mushroom and bean thread which led us to assume it was a noodle dish.  It came out as a soup dish! Broth was a bit bland.

Service was good, we sat on their back patio and it was lovely."}
{"text":"Had a lot of great, inexpensive meals here. Despite the affordability, it is still clean, cute, and welcoming. The menu has a lot of dishes that are basically a spicy twist on traditional Chinese food (if you're not familiar with Tibetan food, that's an easy way to get the picture).

Love the steamed momos (instead the fried) and the chili fries are a surprisingly pleasant appetizer. Soups are good, too.

I always get greeted with a smile and good service, but I think that's because the owner thinks I'm one of the Property Brothers."}
{"text":"What a humble but great place to tryout Tibetan cuisine right in the city. Was veg this day so I tried the Lhasa and Kothey Momos and the Veg Chow mein and they were absolutely delicious! The portion size was great and the flavors were spicy and a treat for the senses! I can't say enough about the chow mein as it was simple yet extremely well made! Can't wait to tryout the meat and sea food dishes another time which my friends say are a delight! 

The patio at the back of the restaurant is a nice surprise but I think they need to do something about the mosquitoes and bugs which were quite annoying. 

Nevertheless great service and pleasant and humble folks who deserve much more praise for this hidden gem!"}
{"text":"Very good nepali food with authentic taste and I highly recommend this place! Thali is their signature best and laphing as well. Rest are good but I'd put thali on top of my list! I ate here majority of my stay here in toronto, as a newyorker I crave for good, spicy and authentic taste coz I am used to it in NY and this is the right place."}
{"text":"Good food ! Awesome dry chilli chicken and Hakka chow preparation. Their momos are also good. The owner / manager is very welcoming."}
{"text":"This is the first time I've ever had Himalayan/Nepalese food and I didn't think I would like it but it was a really good first experience. The service is amazing, so friendly and welcoming. I already loved the atmosphere and vibe as soon as I sat down. The food was really good considering I'm not a huge fan of this kind of food. I would definitely come back and I cannot wait to sit in their patio as soon as it's opened. I definitely recommend coming here if you've never had this kind of food and want to try a new place out, the service and food is worth it. (The mutton curry is a must if you do, the pork chilli is also good.)"}
{"text":"This is probably THE MOST hospitable restaurant we have ever been to and we have eaten all across the world. They were closed for the esteemed Dalai Lama's birthday celebration but when we told them that we had come all the way from Texas, the owner and his son welcomed us in and served us everything we wanted. They made us feel like family which is so rare at a business establishment. If not for anything else, we would totally recommend this restaurant to just enjoy their charming hospitality. The food is an
absolutely delicious bonus! Happy Birthday to the great Dalai Lama - His teachings are reflected in the people at the Tibet Kitchen."}
{"text":"Great place to eat traditional Tibetan food!

The service is perfect and so is the food! We ate on the patio and it was a nice atmosphere.

We tasted some momos and they were really tasty. Also we tried the beef with spinach and ginger. The beef was perfect

The price is really low for what they offer"}
{"text":"I'm wife and I have been eating here once a week for years and the food is consistently prepared with care and attention. The staff are genuinely kind, want you to be satisfied and have a good experience. I could go on and on about this place but simply they are great people who care about what they do and everything on the menu is fantastic. Go in and order some stuff you won't be disappointed."}
{"text":"This place holds high praise among the Tibetan community.  If you want a some g'old traditional Tibetan home cooking, this is the place to go!"}
{"text":"Food was alright, staff was friendly.

Milk teas were interesting, and had very different tastes."}
{"text":"This place is great . Pros 
Food taste great , amazing price and the service was super friendly 

Cons: not very spicy so you may wanna ask them to make it spicy 
Lunch special is only for weekdays . 
Highly recommend to try once"}
{"text":"This review is long overdue but I think that's ok because now that I have been here twice, I can agree on the consistency of the dishes.

Both times I came here I tried:

1.Chicken and Beef Momo: Really good! the outer layer is not thick but extremely soft and moist. The filling however could be better (Om has better filling)
2. Beef Tripe: OMG! The best ever!!! I don't know what spices they use but its amazing! Not for the weak hearted though... be warned!
4. Chilly Chicken: I really like the chilly chicken here, its not the usual Indo-Chinese style but I actually prefer this over that..
5. Chilly Pork: Slices of pork and onions beautifully spiced with bits of green chilies. Definitely try!
6. Tibetan Chowmein: So good! Its got almost everything in it, prawn, beef, chicken, egg and veggies. The noodles are thin and its an extremely well seasoned dish. This one is not traditionally spicy (if you like spicy then you have to ask for it)

I usually have all of the above with a cup of Indian chai. This however was better today than the last time. It was more flavoursome. 
There were four of us and a baby, and the quantity was perfect. The only thing missing was dessert (they don't have a lot of options... mostly ice-cream). We split the bill and it was $38 with tip (for two people). Very well priced and reasonable.

Bottom line, the food here satisfies my craving for spicy food. It is also consistently good, not to forget the service here is exceptional. The owner always has a smile on his face and is very accommodating. The place by itself is not very large but cosy. It also has a very clean bathroom in case the spice takes you by surprise. 

This is definitely my go-to spot for Tibetan Cuisine! 

PS: I don't know much about their alcoholic beverages since I never drink there, but I did see a few guys having beer. So I know you can get that if you want."}
{"text":"Have heard wonderful things about this place and decided to come visit and give it a try! I had done my due diligence beforehand and so had a list compiled before coming... When Garab, the owner, saw this list, he was so intrigued and kept asking which friend recommended us to come haha! He was super enthusiastic and welcoming, and very excited to share Tibetan cuisine with us. His high spirits and friendly, smiling personality certainly brings a great vibe and atmosphere to the place!

We ended up ordering the following:

- Gyuma 
It said beef sausage on the menu, but I suspect that this was actually a beef blood sausage of some sorts. It was slightly spicy and very rich in flavour, and came stuffed with rice and dressed with raw scallions. Pretty good, though slightly on the saltier side!

- Beef Lhasa Momos
While these were good, they weren't the best momos I've had! The skin / wrapping is a little thicker, and the juice within is almost purely beef broth. I'm used to having a bit more curry / seasoning on the inside, but this was super flavourful nevertheless.

- Ting Mo
For those who love carbs, this may hit the spot! A slightly oily but very hearty steamed bun, this roll goes perfectly with curries to soak up every last drop.

- Pork Chili
Garab recommended this over the phingsha, so we chose this! It was quite spicy but extremely rich and flavourful. The pork is thinly sliced and quite crispy (I suspect it was fried beforehand), and marbled with lots of fat. It actually quite resembles char siu! The red onions are fried well, and the sweetness comes right out.

- Mutton Curry
This dish was definitely the highlight of all that we ordered! Although curry was slightly watery, the broth was super delicious. There was the slight gameyness from the mutton, and the curry was adequately spicy to go very well with the complementary rice. There were many pieces of mutton inside, making it a very generously portioned dish of curry. Loved this dish so much! My family cleared it all.

- Butter Tea
According to Garab, this tea, which is mixed with butter and salt, is meant to be consumed by those who require vast amounts of energy for their hiking trips. It helps your body keep warm, and indeed, the beverage stayed piping hot to the end of our meal! Though we weren't massive fans of the flavour, it was definitely a great and unique experience. When we spoke to Garab right after, he was super enthusiastic and gave us the drink on the house!

Overall, a wonderful and eye opening experience! Garab is a lovely and welcoming owner, and the food is very flavourful and rich. Would recommend you come if you're feeling something hearty!"}
{"text":"I'm not likely to ever get to Tibet so I'm glad to have been introduced to this restaurant. It's so homey and cheap..the food is comforting, a combination of Indian and Chinese food. It's sometimes flavoured with slices of hot green chilis. I really enjoyed the sausage. It's better not to think about what goes in it (blood?), but it's so good. It was also fun to try the salty butter tea, which I've read about in books about climbing Mount Everest."}
{"text":"Great food and even greater service.
It's not just the food, but the hospitality that brings me back here. The staff is polite and goes out of the way to make you feel good."}
{"text":"There are plenty of Tibetan restaurants in Parkdale, yet we've returned to this one rather than trying another and surely will again. The staff here are super friendly and happy to make recommendations, the food is great, and the price is reasonable. And there is a lovely back patio open in the summer that's absolutely perfect on a nice day. 

If you've never had Tibetan food, trust me: You want the momos. These are Nepalese/Tibetan dumplings and a must for anyone who considers it their life's goal to eat the dumplings of every culture. (Which is a fine and worthy goal.) Momos can be ordered with beef (traditional), chicken, veggie, and maybe pork. We normally stick to beef, but the chicken is not bad. They can also be deep fried, steamed, or pan-fried. They're all great and come with a delicious hot sauce. 

(Apologies in advance for not remembering the names of the dishes.) The chili chicken dish and a sizzling noodle dish are just delicious, and we can't remember the third dish that we had several months ago. There are also firey Tibetan sausages among the appetizers, and the famous Tibetan yak butter tea, which is warming and salty - probably more like drinking broth to most North Americans. If you're up for something different, and especially if you like salty things, be sure to give it a try. 

There are a whole whack of other dishes that I can't wait to get back to Toronto to try, including a traditional Tibetan thali, soups, and hot pot dishes. We'll most definitely be back!"}
{"text":"Delicious dropa khatsa (fried and steamed), order prakaha khatsa (dry chilli pork) and jasha katsa (chilli chicken in gravy)."}
{"text":"Definitely coming back!

This definitely hit the spot for comfort food and not having had momos for a long while.  The restaurant is one of the nicer authentic Tibetan places I've been to.  Modern decor, and they place pop music not loudly for ambience. 

The service was fantastic, always friendly with thank yous, interacting with our 3 year old boy, filling our water.  Kids menu being available is a plus as well, even though we didn't use it.

We had pan fried momos, steamed momos, and a noodle dish.  I could do with 1 less momo dish and be less full than I had been as I was still full at dinner time!"}
{"text":"1ere expérience de gastronomie tibétaine! 
- le cadre est très apaisant avec ses décos locales, banderoles décoratives aux couleurs du Tibet ainsi qu'un grand portrait du dalaï Lama.
- La nourriture en elle même est ultra protéiné car le peuple tibétain est habitué à marcher de longues distances dans les montagnes. Vous aurez donc droit à une soupe au poulet en entrée suivi d'un plat de riz au poulet sucré avec ses légumes et une boulette de viande de boeuf à la saveur plus qu'étonnante.
Il y a aussi des spécialités bien locales comme le thé au yahourt et beurre que je vous déconseille si vous n'êtes pas habitué au régime ultra protéiné et beurré. Prenez plutôt un coca pour agrémenter votre repas.
-l'accueil est quand à lui impeccable, le gérant n'hésitera pas à vous conseiller sur les plats à prendre et n'ira pas directement au plus cher. 
La formule du midi comprend entrée, plat + boisson le tout pour 8$: imbattable!"}
{"text":"I love going here for their lunch specials! I always order the curry chicken which comes with rice, small salad and a beef deep fried dumpling! The owner is always so nice, polite and full of smiles, great atmosphere to enjoy food. I come here every now and then and it's always a good time!"}
{"text":"This one is definitely a local gem. I've gone on a Saturday afternoon so it wasn't too busy. Feels like home food, since it's not too greasy. Loved the momos and the chili chicken here. It was really enjoyable. If you want a low key, comfortable vibe, then this place was great."}
{"text":"I'm giving Tibet Kitchen 5-stars because the food that I ate was as good as it gets. The only downside is that this establishment is not as vegan friendly as others so make sure you inquire about the foods before ordering. The service and staff were super helpful, friendly and incredible though and our meals were everything and more than we hoped. Tibet Kitchen lives up to the hype and I would be devastated to see it go. If you haven't made the trek don't pass up the opportunity to eat some of the best Tibetan food this city has to offer."}
{"text":"I can't say enough about Tibet kitchen. Great service , great value and an amazing lunch menu.  For 7.99 you get a main dish, a tingmo (steamed dumping for dipping) a fried momo and a choice of two soups. Everything is fresh and delicious. 

5/5 !!!!"}
{"text":"Went here on a date, and I really could tell it was a family run spot.  I really like that.  It seemed that there was a Nepalese family having dinner in there as well.  It was a nice cozy family vibe.  Very cool.  The service was friendly and attentive to explain items on the menu.  I ordered a platter that had quite a bit of serving on it, and when I was finished I could hardly walk.  No joking.  I even tried momos for the first time here.  It turns out they're pretty much Chinese dumplings (not sure what the big deal is about).  Great place, delicious food, fair prices.  I'd be back for sure."}
{"text":"If you have never tired Tibetan food, you will really like this place since it will offer a very new type of experience. if you have, like me, you will put your excitement aside and compare this place with other Tibetan restaurants. The tali dishes are good overall but the momos (dumplings) are not really that great because the meat doesn't gave a good taste, unless you soak it with the hot sauce which ruins the point. They do have a great patio but it doesn't strike as Tibetan at all and the service is really weak and the servers are not pro-active at all."}
{"text":"Love the newly renovated and 
Amazing arts by great artist from Nepal  (display). 
And of course delicious food  and service as always. 

Best wishes 
Sunny Sonam"}
{"text":"Came to eat the momos, which are average (chicken ones are average, maybe the beef is better). The Thukpa was a no no. Chilli pork was good. All in all an average experience."}
{"text":"Authentic Tibetan food with the blend of some Nepalese. The outdoor patio is cool for summer and drinks are quite reasonable priced. Should definitely try MoMo"}
{"text":"I was very lucky to have stumbled on this place earlier this summer. I had gone on an epic 75km bike ride with a friend and on our way back, I was starting to feel the need to eat a whole horse. I called my wife and asked her to google some cool new place that was somewhere in between where she was and we were so that we could meet somewhere in the middle.

She found this place and it was a truly pleasant surprise. The place is good enough that we've returned two more times since. Now, I almost feel like I should be giving this place a slightly higher rating but in the grand picture of restaurants I've eaten at, it's a solid A-OK. 

I really like that Tibetan cuisine is slightly different than what I've had from other Asian cultures as it expands on the diversity of a cuisine that I already love! 

More importantly, the service here is friendly and timely enough and the ambiance, while being quite divey, it quaint and enjoyable. I always make a point of eating on the patio out back.

Eating here has inspired me to try some new Tibetan restaurants so keep a look out for future reviews. :D"}
{"text":"The broccoli tofu was literally inedible, and I was starved after a long run. A flavorless gel-goopy sauce and uncooked tofu on dry white plain rice. The back patio was lovely."}
{"text":"Tried the dry chili chicken, absolutely loved it. Our server was also the nicest guy."}
{"text":"Disappointed, given the reviews here. The service was friendly and patient but the food left a lot to be desired. Spicy but not truly tasty. The fried cauliflower was just that. No flavor. Their recommended dishes lacked special-ness."}
{"text":"First time I've been here and everything was phenomenal. The service was excellent. Prices are reasonable. The food was fresh. I recommend the dry chilli chicken. 
The owner was genuinely interested and in our opinion of the food. I'll be going back for sure!"}
{"text":"There's been a menu change and I love it! Thank you for including more veg options. The Delhi Momo was fantastic, and I will definitely have to come back for the vegetable manchurian. This is now my favourite restaurant in Toronto. Amazing food, and I love the new changes inside. My boyfriend also ordered the chicken chilli which he loved."}
{"text":"I've made a visit to Tibet Kitchen on many occasions- lunch/dinner. Always a positive experience! The food is made with love. The owner has a beautiful positive attitude. The food is also very affordable. Lunch specials such as Veg Thali for under $10. Definitely one of my favourite Parkdale locals"}
{"text":"This is my favourite lunch spot in Parkdale - the special with soup and spring roll is seriously the best deal in the area. Always tastes fresh, service is super friendly and the flavours are outstanding. Vegetarian friendly, too!"}
{"text":"Stumbled upon this place by accident. Food is really good (amazing!!!!), and prepared really quickly. The service was amazing and everyone was really kind. 

Great patio in the back with lots of space in case it's busy. Especially great with the lights on in the evening. 

Highly recommend the dumplings and the chilli chicken. 

May be one of my new go to dinner spots; it's just that good."}
{"text":"If you are in this area you MUST come here for lunch. Mt friend and I came here after reading all the yelp reviews and they're all true (the good ratings ones anyways). The walk around this area is a bit sketchy but the food here is so good. We got the lunch specials which is only $8.99 and came with so much food. Soup of the day, steam bun, rice, fried dumpling, and one entree. I got the chicken curry and my friend got the dry chili chicken both wete really good.

The service was exceptional. We came there at 11am right when they open and the lady there was very nice to us. They take credit and debit and cash. No american express."}
{"text":"The staff here are so warm and friendly! They really make you feel welcome.

The food comes out really quickly and is great value. Our go to is the chilli fries!"}
{"text":"*UPDATE* - newly renovated and patio open

It's been awhile since I visited my favourite Tibetan restaurant in the city. 
I decided to take my friend here who's never had Tibetan food before. I was pleasantly surprised to find the entire place has been renovated! And....that the patio is finally open for the summer too! *Woohoo*

We ordered the steamed momos, chicken pakoras and chicken and mutton thali. Everything was delicious - no surprise here. Also, the owner Garab is super sweet and welcoming as always. It's always such a pleasure to dine here. 

Thank you for everything Garab!"}
{"text":"THIS PLACE IS THE BOMBDOTCOM.

Okay so we just popped in. We were sort of near by, and decided to check it out. I am so happy we did. This place is out of the way for us, however, we will be making the trek out to Parkdale/Roncy to eat here again.

We had the chili fries (GET THIS), two types of momos (the tibetan dumplings), and the chili chicken dish (W/O GRAVY).

Let's break this down, okay?

Service = super friendly. They've been open for 12 years and the current owner/manager has been around for 5. It was empty, early on Friday night. But we could tell it was popular. People were coming in for takeout constantly. And there were several couples (and solo diners) streaming in throughout our meal.

Chili Fries = AMAZEBALLS. It's got a light coating of a spicy sauce, and served warm. Quite good.
Momos = We got Lhasa momos with chicken. That's steamed chicken dumplings. And Kothey momos with beef (pan fried beed dumplings). I wasn't a fan of either set of momos. My only other experience with Tibetan cuisine is from Everest, a restaurant that used to be at John and Queen. It's long gone now. But I remember enjoying the momos there. Here, the momos were okay, but nothing incredible?
Jasha Khatsa (chili chicken) = LEGIT the best chili chicken I've ever had anywhere. And I've had lots. From across the board of Asian cuisines. We got this dry (so without gravy). It's one of those slow burns. You know you'll regret all the spice later, but right now, you just want to guzzle it down.

My partner and I had an incredible meal here. We loved the decor, the staff, the food. I highly recommend this place. I can't vouch for authenticity (because I've never been to Tibet, nor do I know anyone on a personal level who is Tibetan) but it seems to be as authentic as you can get? Even if it's not, it's worth the visit."}
{"text":"Soup is really nice. Spicy pork the best. Dnt forget the dumplings and their buns too."}
{"text":"Never had Tibetan food before this and gotta say I liked it but my husband didn't care for it so much.  His beef soup was over cooked and had a scorched taste.  A little out of the way from tourist Toronto.  We live in Buffalo and love exploring the wonderful restaurants of Toronto.  The flavours were good but it was executed poorly.  Everything was overcooked.

If I had to explain the flavor I'd say it was Chinese meets Indian flavors. I'd go there again but not sure my husband agrees."}
{"text":"The place gives you a warm and genuine feeling of Tibet out of Tibet. We were a party of 5 and reached 15 minutes before our reservation. Garab the owner who runs the show took charge immediately by accommodating us in a fully packed place. It didn't take long till we were seated and Garab wouldn't stop apologizing for something which wasn't an inconvenience for us.

He waited on us and gave us really good suggestions on Tibetan cuisine.

Chicken momos and chilli fries were the highlight of our meal. Food on the whole was really good and the customer service was even better. I can't remember getting such great service at a fine dining restaurant.

They also have a big patio that accommodates around 60 people. Unfortunately it was a bit chilly to enjoy an outdoor patio meal. However come summer I'm gonna look forward to another amazing experience at Tibet Kitchen.

Big thanks to Garab and his team for looking after us. He sets an amazing example on how to deliver the goods in the best possible way ever."}
{"text":"I came across this hidden gem searching for a nice Tibetan/himalayan place to eat . Tried this first place from my list:

Ordered : Chicken momos, chicken manchurian and chicken noodles. The best momos till date so far reminiscing about street momos in  india. Beware of high spice levels!

Cost for 2 : $30-35

Tips : Pre-order by calling for dining/take-away as it took a good 45 min for our food to come.

Garab, the owner is very friendly and nice to chat with!"}
{"text":"The owner is so sweet, he's honest and friendly to everyone who comes in, it's evident that he is very passionate about the wellbeing of the restaurant and customers.

Everything that I've tried thus far has been delicious.  (The mango lassi compliments any dish you get, mmm.)  In addition, the Momos are truly authentic to the traditional Tibetan variation of dumplings.  What can I say?  We like our beef Momos hearty and made with love!

I don't always visit Parkdale, but when I do I always make it a point to drop by."}
{"text":"I am a big fan of this place.  They have FANTASTIC momo's (fried and steamed) and really really great beef tripe.  I made the mistake of asking for it spicy the first time I ordered it and it almost burned my face off. Now I ask for it mild spicy and just add more chili sauce if need be. Their chili sauce is mind-blowing spicy hot. One thing I didn't know about Tibetans is that they do not mess around with spice. These people have iron stomachs man. I am in awe of how hot some of their food is.

The Chili Chicken is awesome, and the noodles are great. Actually, anything you order from this place will be tasty and delicious. Good prices, great quality and a very friendly place."}
{"text":"Nice tibetian/Nepali cuisine. Very busy on a Friday evening. We called and made reservations. Very friendly service. Lot of options. 
The C Momo was the best of all. The sauce on top of the steamed dumpling had a nice curry flavor. 
Chilli chicken with gravy and tsey khatsa ( vegetarian dumpling) had similar sauce but the chicken was little smelly. 
Chowmein and fried rice were relatively bland but went well with the above dishes. 
The veg curry had a lot of steam veggies and was flavorful.
Nice place to try the momos."}
{"text":"This amazing restaurant hasn't disappointed yet. Delicious food is accompanied by a friendly and warm host that makes EVERY customer feel special. That always adds to a dining experience. No matter how busy the joint, and this place gets busy, he spends time on every table and speaks with every guest as if the he was meeting a very regular guest. 
Our favourites are the chicken chow mien, chicken dumplings, and the chilli chicken. The chilli chicken is simply awesome, you can't go wrong with that. Order it dry and enjoy the crispy goodness. If you like gravy, you can order on the side. The chow mien resemble Hakka style, but is a Tibetan preparation. These are the best Hakka noodles / chow mien in the GTA. 
In the summer they open up the area in the back and you can enjoy the patio season while munching on pan fried dumplings. The inside seating area is large enough to accommodate 30-35 people at a time. Being a popular restaurant, it can get crowded during peak hours. But the atmosphere is always casual and comfortable."}
{"text":"Food is as good as usual. Love their shae-thuk ngolpa(hakka chowmein) & spicy shrimp. Everything on the menu is amazing. This place never disappoints me."}
{"text":"What a wonderful Tibetan place. Cozy back yard sitting. Wonderful waiter, a native Tibetan who ran around like a headless chicken. Poor wonderful fellow. 
Now the food: very tasty hot and sour soup which could best any where else. Chicken curry was flavorful without overpowering. Dumpling and bao were juicy and fillings were delicious. Very natural home cook taste, full of aroma from china to india."}
{"text":"I love their back patio.  So quiet for being on Queen street.  So I'd go there just to sit there, but fortunately, the food is good too!  I haven't been their for lunch specials during the week and unfortunately, they don't have them on the weekends.
I've had their beef momos and their andmo beef momos (did I get that spelling right?).  The chow mein noodles are good.  And I had a veggie dish.  Everything was good.  So a good place for supper...but eating there at lunch is more pricey than I'd like.  
Owner is very nice and accommodating.  A good option if you're looking for a patio."}
{"text":"I've never had Tibetan food before this experience so I don't have much to compare it with! But we got take out, and it was still delicious - huge huge huge telltale. I was extremely intrigued by the dumplings. Everything had lots of flavour and the sauces were all nice compliments to the food itself."}
{"text":"I cant say enough good things about the restaurant and the service.  The owner is the kindest and the most affable man and the food is fantastic.  Loved the atmosphere as well.  Yum!"}
{"text":"Ordered takeout. The service was great. The manager was exceptional and very friendly. However when we checked the food when we arrived home the containers were a quarter full, food was mediocre and it just wasn't worth the price. For $50, the amount of food would realistically feed 1 hungry person. Very odd."}
{"text":"We've tried a few other Tibetan restaurants in the area, and overall, our meal here was just alright. While service was absolutely wonderful and friendly at Tibet Kitchen (I would consider coming back since we had such a positive customer service experience here!), the food was a bit of a hit or miss for us. 

We visited on a weekday evening and ordered: a) 6 Pan Fried Beef Momos ($6.99), b) Tsey Khatsa ($9.99 - deep fried marinated vegetables in chili sauce), and c) Chili Chicken Dry ($9.99). For us, the Chili Chicken Dry was the best item - crispy, with a kick, and a great array of flavours. Unfortunately, the Tsey Khatsa was a bit soggy and wasn't crispy at all, and it lacked the flavour we experienced eating the same dish at another Tibetan restaurant down the street. As well, the beef stuffing of the Momos didn't taste appealing to us. The Chili Chicken was the definite standout, and is the item we would order again if we came back to this restaurant. 

For two people, with tax and tip, we paid around $37.05. Note that they take reservations, and there is street parking available in front of the restaurant. Overall, an okay experience - the wonderful service and the chicken were our positives!"}
{"text":"Delicious food,  kind and welcoming stuff and I should say surprisingly good price. I enjoying very much my dinner. I had a starter, main food, beer and desert; all for 22$!"}
{"text":"Second time trying Tibet food in Parkdale. I wanted to try this place last time but they were closed. Walking in on a weekday around 12:30pm, we were one of the only people in the restaurant, but slowly after people started to roll in.

The staff were super friendly and got us waters and menus right away. We ordered the:

Lhasa Momo ($8), with a choice of beef, chicken or vegetable. 
Looking at the other dishes we wanted to order, we decided to go with the chicken flavoured one. Tasting momo for the second time, the skin of these momo were thinner than the other store, something I enjoyed a little more. The filling was delicious - savoury, but not too salty. It comes with a spicy dipping sauce - great for your tastebuds on a hot day.

Tibet Kitchen Assorted Kitchen ($13)
This comes with a vegetable spring roll, gyuma and a teriyaki beef stick. Everything was cut up into two+ pieces for us, making it easy to consume. The gyuma for those who aren't aware of what it is, it's a sausage dish where the sausage is filled with rice, barley, oats, blood and ground beef. The flavours are a little less savoury than the sausages we typically purchase from Western grocery stores. 

Thali 
This was a really beautiful platter served on a brass plate. It had a scoop of rice, a curry dish, a chickpea dish, some assorted vegetables and crisp dough. This was probably one of my favourite dishes - I'm not sure if they serve it on all days of the week, cause I didn't see it on their online menu. The crisp dough wrapped with the assorted vegetables and meat from the curry was created to perfection and it felt very authentic! 

I would recommend Tibet Kitchen for Tibetan food!!!"}
{"text":"Very disappointed.  Went here tonight.  Sat for maybe 10 minutes before getting the menus.  Then we got waters after another minute.  (By the way, they did not have air conditioning inside and it was quite warm.)  Then we waited again for another 10 minutes with no service.  I understand that maybe the back patio was really busy, but inside, there were only 2 other tables.  Then we watch a large table of maybe 11 that arrived maybe 15 mins after us received their menus AND got to order their food.  We waited another 5 minutes of still no service and then decided to leave.  This was also right after seeing another two ladies leave as well without getting any service too.  We won't be back.

We ended up going to Norling down the street where we got seated, and received our food within 20 minutes!  So My Tip:  Head to Norling!

***
Update - Note that the owner was very attentive to my post.  He not only reached out to apologize about our experience but offered for us to return on the house."}
{"text":"The owner is so pleasant and friendly! Enjoyed talking to him. 
Nice restaurant overall. Has various pictures and paintings from Tibet. 
Manchuria was so so, not that spicy. The momos are nice and I would recommend. The chow mein was delicious and also would recommend. Enjoyed our meal."}
{"text":"Même si la deventure ne paye pas de mine c'est vraiment un restaurant à essayer!

Quand nous somme arrivés il n'y avait personne, mais le restaurant nous avait été fortement recommandé! donc on essaye quand même!
L'endroit est très propre, calme, c'est très appaisant de manger dans ce restaurant!

En plus des plats il y a un menu le midi à 6,50$ environ (HT) et si vous arrivez à le finir, bravo! Car c'est très bourratif, mais qu'est-ce que c'est bon! C'est vraiment une nourriture différente de tout ce que j'ai gouté auparavant, c'est à essayer au moins une fois! D'ailleurs pour le menu le choix est très varié, au moins 8 plats différents!

Le service est assez rapide, rien a redire sur la prestation!"}
{"text":"This place is in such a charming neighbourhood that is unofficially called Little Tibet (I think?). The restaurant looks small from the outside but once you're inside, walk through the narrow hallway past the cashier and into the outdoor seating area - it's a beautiful patio area. The waiter/owner - Garab was such a delightful man whose passion for food and his culture comes through naturally. Here's a tip: let him pick the dishes out for you. We asked him for recommendations, told him our food restrictions and he brought us some of the best dishes in his restaurant. Everything from the momos (dumplings) to the beef appetizer dish, the noodles, etc. - they are very flavourful and unique."}
{"text":"My visit to Tibet Kitchen was the first time I was trying tibetian food and I will definitely come back for more. The much talked about chili chicken is really worth it! Its different from any other chili chicken. I found the dish to be good without the gravy. The chicken was crispy on the outside but so soft on the inside! We also got momos as a starter, which were also great. The best part about the restaurant was the owner. He was very friendly, came and spoke to us, and made sure we are satisfied with everything at the restaurant. I will definitely revisit!"}
{"text":"Last Sunday, I went down to Tibet Kitchen, a place I have only been once before when I first started trying different Tibetan places down in Parkdale. I must admit that other than the outside that I have passed by many times, nothing about the restaurant seemed familiar. It seemed rather plain inside, although there were pictures and paintings on the walls, and very low-energy (except for my server who was fine). But everything was very clean and organized, so I don't want to deter anyone from visiting. Perhaps it has changed inside or perhaps I just don't remember my previous visit properly. I did recall meeting by chance someone I used to work with, and I also recall enjoying the food, which is the most important thing.

As for my meal, I had the Shaptak beef, which is small pieces of beef spiced with ginger and scallions with a bowl of rice, and Ting Mo steamed buns. The beef was very good, spicy but not too much; the scallions in particular had nice flavour. This was the first time I have had steamed buns instead of momos, and they were larger than I expected, but still soft and warm enough to absorb some of the Shaptak sauce. The only downside of the meal was that they were out of butter tea by the time I was finished eating.

Overall, a very good and filling meal for only $20, and certainly another good option for Tibetan food in the area."}
{"text":"And the award for most unassuming patio in Parkdale goes to Tibet Kitchen!
Seriously, I've walked by this place so many times and didn't even know they had a patio. But in this case the patio looks a good 2x as big as the dining room itself, and is twice as nice as well. Lovely garden vibe with a big tree in the middle. It's really quite serene. 

On to the food, we sampled a bunch of stuff including:
-Gyuma (beef blood sausage cooked with spicy peppers - super tasty!!!)
-Chicken Pakora
-Chili Chicken w/ Gravy
-Beef w/ Broccoli
-Veg Manchurian
Everything was somewhere between good to great. The Chili Chicken can also be served dry but I liked the sauciness of the gravy which helped with rice saturation. I was expecting something completely different with the Veg Manchurian, as what was brought to us was these sort of fried balls of vegetables in a bowl of sauce. Looking at the menu again, I'm almost thinking we got the wrong dish... But either way, it didn't really hinder our enjoyment.

Drinks are reasonably priced and they have a handful of beers on tap including Beaus.
Service is a bit slow and unattentive. Perhaps just under staffed, but I'm a stickler for drink service and when both my water and beer glasses are empty I get sad. On the flip side, the staff are super friendly and do what they can it seems.

All in all, this place is pretty great, and I'm glad to add another patio place to my Parkdale hangouts."}
{"text":"Good staff and food is also good. Sweet and sour pork was really nice and there speciality fries were amazing. Will definitely go again to try other items!"}
{"text":"A nice little restaurant in Parkdale with a great fusion of Himalayan/Nepalese, Asian Fusion and Indian food. I've heard many great reviews about this place before coming here. We came here after our curling game in High Park for lunch. It wasn't busy so there are no reservations needed. Our waiter was super friendly and helpful and try to give us some good recommendations which convinced our group of 8 to order most of the things he mentioned, We ordered the Chili Chicken, the Momo's both pan fried and steamed, the sliced beef dish, a chow mein dish and Tibetan style sausage. The dishes came out in a timely manner and across the board, I definitely loved all the dishes. Great flavours and pretty decent portions for each dish. The restaurant and the food definitely exudes that Tibetan culture which I like since I've never eating their ethnic food. Overall, a great little hidden gem in Parkdale if you are looking for great food with a bit of a spice kick to it. Definitely recommend it for people who have never tried Tibetan food."}
{"text":"Absolutely loved this place!  Went to try it out for my boyfriend's birthday.  Ordered lots of great things including the special tibetan fried rice (tasted like an amazing home cooked meal), the pan fried chicken momos, the deep fried beef momos, the fluffy steamed buns and the vegetarian manchurian.  All the dishes were so flavourful.  The steamed buns so moist and fluffy, the momos ridiculously good.  The thing I appreciated most is nothing tasted greasy!  And to boot, the owner treated us so amazingly!  Would 100% come back or order for pick up as they get busy really quickly for dinner."}
{"text":"The food here is alright - it's good but nothing to rave about. The waiters and the owner were very nice though and they have an outdoor patio which is really cute! We ordered the chicken pakora, lang sha tang (beef broth), beef and chicken delhi momo (dumplings on a sizzling plate), Chili chicken, and tibet special chow mien. All the dishes were 3/5 and is good for the price you pay. Come here for decent food but don't expect anything too out of the ordinary!"}
{"text":"The best chicken momos in the 6
Patio is well kept and ample sunlight
Service can be slow, but great hospitable servers"}
{"text":"My friend took me here to try Tibetan food for the first and I must say I was very impressed. 

The restaurant was clean and the serve as very friendly. We sat on the patio since it was a nice day and it was very spacious and such an amazing experience. 

We tried the dumplings which very succulent and juicy. The blood sausage was savoury and delicious. The had these buns called ting mo and it was very fluffy and soft and delicious. The chicken pakora was a nice crispy addition to our overall experience. 

I would definitely recommend this restaurant especially in the summertime on the patio with some beers and some of the sausage with the chicken pakoras.

Thank you tibet kitchen for the great food and great service."}
{"text":"Great food with amazing service at reasonable prices and very easy to book a reservation at (compared to other places nearby e.g Thanks Doomies! /s). Definitely a good place. 

As a vegetarian, it's sometimes hard to find out if the food you are eating is okay with my ethical principles. The owner was really good at talking me through that and determining if the food was cruelty-free or not. 

Service was impeccable although strained due to a large, loud multi-table group that were very demanding of the owner so that kinda took the ambience down a bit but otherwise food and service was unimpeachable for the price range."}
{"text":"My favorite food joint in Parkdale. Amazing taste and great prices.  Doesn't look too special from the outside or inside but serves up fantastic Tibet food. Had the blood sausages, chow mein and chilli chicken. The portions were huge so had enough to fill me up and take out."}
{"text":"What a great deal! Excellent food, great service, very reasonable prices. Check for 3, including drinks, less than $55. Small neighborhood place. Expansive menu, cooked fresh when ordered. Thank you, Yelpers, for the on-target reviews!"}
{"text":"I went here with a group having never been before to this restaurant nor have tried Tibetan food.

It's a small restaurant with a good size patio out back (some portions are covered).

The owner is a delight!  Super friendly and makes jokes with his customers:)  Too bad more people don't have his disposition- truly a gem in the service industry.

We got a mixed order of the momos (similar to dumplings or pierogis is the best way to describe them  ) that were both boiled and fried 

I ordered the chili chicken and it was spicy and good (I've had better but it was still good) it's one of their more popular dishes.  Side of rice comes with it.  

Honestly the hospitality here is amazing- if I lived closer I'd definitely try a few other menu items like their thalis (only available at lunch time unfortunately)"}
{"text":"Excellent chicken corn soup, chili chicken.
Needed more staff on a couple visits, slower than you'd want.  Food is worthy of returning.."}
{"text":"There are several wonderful Tibetan joints on and around West Queen West. Every one is fantastic, and this one might be the best of all. I don't know, it's close, but the food here is always perfect. The owner is a classy guy and his family employees are always friendly. It's hard to get spicy food in Toronto, but Tibetans know how to do it. I hear they might need to go move to make rent. They could probably go up-market and keep making the same food, though... maybe if they evolve with the neighborhood, they could stay right where they are. Otherwise, though, other parts of town would probably flip for top notch Tibetan, too. It would be a damn shame if they closed for good, though."}
{"text":"we were there with my partner on new year's eve. the place is packed, the staff were very friendly and the owner's son was very busy bring the food out but still he took the time to greet us and the waitress was super friendly. the food were great we had the chili pork and chicken and momo and the spicy shrimp.  we been there before the food never disappoint. Bottom line, the food are great, service awesome, nothing fancy just plain good home cook meal. love it"}
{"text":"Thinking the food would be similar to Mt. Everest Restaurant in the Annex, I decided to head here for dinner. Both the exterior and the interior are humble, modest, yet welcoming. I know these types of places often have the best tasting food.

Unfortunately, I was very disappointed when I noticed that the menu is a combination of Chinese and Indian food. For some reason, that memory did not stick when I went to Mt. Everest. I had a hard time choosing and in the end chose a chicken dish that (the chicken) was covered in some sort of weird paste. I could not get over that paste. It was hard to remove and I did not like it. 

Overall, I did not enjoy the dining experience. If I want Himalayan  /Nepalese cuisine, I will return to Mt. Everest Restaurant."}
{"text":"I've never tried Tibet food before, it was the first time I tried! The server recommended chilly chicken and he was so right! The chicken was soooooooooo delicious!!! also C momo(beef) was good too! It's a little sweeter than chicken tho. still loved it! Also the  (seems) owner was super kind and funny :) I would visit again with my friends anytime soon!"}
{"text":"Seriously amazing food and service by a clearly humble and sweet family. The food was unreal; such good flavors and quick service. Would highly recommend this restaurant"}
{"text":"Wow! This place is awesome, 5 stars for sure!

We got the chilli chicken (4 stars), amdo Momo (5 stars), and the Tibet kitchen special shae-thuk ngolpa (5 stars). We were 2 people and it was more than enough. Note that the chilli chicken came with white rice too. 

Amazing food, warm summer night and we got to sit in the patio, good service. We will definitely be coming back!"}
{"text":"Good food, great price. Chili chicken (dry, with gravy on the side) is the way to go. Different from what one might expect, especially if used to eating at Hakka places.

Momos are a staple Tibetan food. We ordered the C-Momo and liked it. One thing is maybe we would prefer a fried one (this one was steamed).

The chow mein was also good. The server (who I think is the manager/owner) was great. Super helpful, friendly, and was willing to adjust our order (since we were unfamiliar and wanted to try things).

With three dishes (chili chicken, chow mein, momos) and a side of rice, it came to about 30 bucks, excluding tip. Definitely worth the price for two people."}
{"text":"I enjoyed every thing about our dining experience at TK. The food was great - it was well priced, great portions, and delicious. We ordered a number of items; those that stood out were the momos (both c and delhi), chicken chili, spicy shrimp, pakoras, and the tofu broccoli. The experience with the staff was impeccable to begin with during the entire process. I want to say that it's rare to experience this sort of service now in the city and I am so glad there are still places like this little treasure that exist. The manager was awesome and the waitress was very friendly and patient. I would definitely come back to Tibet Kitchen to try other items on their menu - what a gem!"}
{"text":"I'll admit it. I am completely unfamiliar with Tibet/Nepalese food. I had been waiting for someone else in my circle to try it. Then base my decision on that whether I should go.  I've seen and walked by numerous Tibetan restaurants and had never gone in. 

One day, I was surfing and saw some of the highest ratings for food - in general, for one of the places I kept walking by, Tibet Kitchen. After that, I made a plan to go and try it on my own. I was pleasantly surprised!

I ordered their lunch special Chili Chicken(Jhasa Khatsa) made to your heat preference. It came with a vegetable spring roll, rice, pickled daikon/carrots and hot and sour soup.  I also ordered their beef momos (shae mo).


The food was incredible! Flavourful with just enough heat for me in the chili chicken. The accompanying vegetable spring roll was crispy and not greasy. The hot and sour soup completely hit the spot. Warm goodness that really helped me out that cold day.  The steamed beef dumplings were a delight. Two sauces come with it: one with some kick and the other without.  

Hard to say which was the highlight because in all honestly everything tasted good. The coffee was amazing too! They use Propeller coffee folks. Good stuff.

One of the things that made the experience over the top was the customer service. It turns out the welcoming host, Garab, was the manager. He's such a pleasant fellow and extremely helpful with any questions you might have.  It's so great to support an independent local restaurant when you realize how much passion they have for what they produce and want to share. 

Give them a try. Absolutely worth your time, pocket and palette."}
{"text":"Was around the area and looking for a place to eat. Saw this place on Yelp and it had good reviews so decided to check it out.  
It's a small restaurant. Seats about 25. Has a giant picture of the Dalai Lama. Other than that nothing special in terms of decor. 
It was around 9:20pm and I was the only customer. The guy there not sure if he was the owner, brought the menu and water and soon asked if I wanted to order even though I hadn't finished looking the menu. I ordered the Thukpa beef noodle soup. Was a bit disappointed with my order. The portion was small for the price. The noodles tasted ordinary. The soup was bit oily, and just a little bit of shredded beef and vegetables on top. I haven't tried their other items and hopefully they are better."}
{"text":"Been waiting a long time to try Tibetan  food. The server was very knowledgeable and helpful. She told us what popular Tibetan dishes to try were. We ordered:

Mango lassi - smooth and creamy

Chilli chicken (dry) - she said this was the most popular dish. I can see why! Very crispy and flavourful. We got it mild and it wasn't spicy, but watch out for the tiny chillies because those are super spicy. 

Ting mo: smooth and moist. Try it with butter. Tasted way better with it!

Chow mien: delicious! Flavourful and yummy.

Beef momos: a bit disappointed because it was dry due to the lean beef. 

Overall, I would definitely come back and try their other dishes!"}
{"text":"Tibet Kitchen is my fav tibetan restuarant in the neighbourhood! If you want to try traditional Tibetan food, this is the place! The best Tibetan restuarant in Toronto! I have come here so many times I lost count. I always get the Gyuma and chilly fries to start. The Gyuma (intestines) is my favorite. If your feeling a little adventurous, I highly recommend you to try it. I also love the chilly chicken and tingmo and their thali and Tibet Kitchen Special Chowmein and fried rice is really good! Their lunch specials are a steal too! Must try! The service and the food will have you calling back to this place again and again!"}
{"text":"On the edge of Parkdale sits this cute little restaurant. I came here based on all the reviews on yelp - and was not disappointed. This place gets 5 stars because the service is outstanding. I had originally called in the morning to inquire about whether their restaurant was baby friendly. They were very accommodating, but I did not yet make reservations as I wanted to discuss w my group of friends first. Then at 3pm when I finally decided to make a reservation, I called and they were closed for their siesta hour (3-5pm) - did not leave a voicemail. So I figured I'd call back at 5pm. To my surprise, at 455pm, Garab - the owner calls me back. He was very courteous in returning my phone call. 

When my party and I arrived. Garab was very warm and welcoming. His gestures were very genuine. It did not seem scripted or pretentious. He made us feel very comfortable and cozy. He's the cutest lil man. He knew that I was there for my birthday so he kindly offered a free drink on the house and encouraged me to get a pint on tap. 

We were a group of 10. And we literally ordered two of everything. We ordered:
+ Tibet Kitchen starter platter - you get a chicken spring roll, veg spring roll, teriyaki beef stick, and tibetan beef sausage - not bad
+ steamed beef momos (dumplings) 
+ pan fried beef momos - I think they momo's are made fresh bc I could see from my seat the lady in the back rolling the dumpling dough and stuffing it - comfort food, tastes homemade and fresh 
+ steam buns - we originally thought they were like a Vietnamese banh bao which is stuffed w meat and veggies inside.. But this was literally just super soft, fresh, steam buns served w butter. At first we were disappointed bc we thought there would be more to it.. But if was unbelievably fresh, soft, moist... And tasted exceptionally good w some butter on it
+ chili chicken - kinda like a kung pao chicken but less saucy... Be careful of the chilis...very hot if you mistakenly eat one thinking it is green peppers 
+ spicy shrimp was definitely my favourite... Perfect amount of sweet and spicy sauciness to it... Could lick the sauce off the plate it was that good 
+ Tibet special fried rice - it was fried rice w basmati rice 
+ Tibet chow Mein - also made slightly different than the usual Chinese chow Mein 
Overall, my impression was this was all made from scratch, with love, and is influenced by Indian and Chinese flavours without being overly spicy, salty, and fried. 

For a Thursday, Garab was steadily busy serving all the tables. There seems to be lots of regulars who eat there as well as lots of take out orders. I would definitely recommend coming here with your friends and family. Quiet ambiance, simple decor. Good karma all around. 

Thanks Garab for a wonderful experience with tibetan food!"}
{"text":"This would be the 4th time I've been there - it took me a little bit since it's the first Tibetan foodspot I tried - I like it.

My first impression was - wow, it's just like \"asian food\" except...different? I'm not sure what it is, but it definitely looks very similar. Tastes a little blander but I like it that way - you can actually taste the food, and not just the seasoning.

I got a dish with 3 types of meat + veggies + noodles.I didn't think the proportion was that big until i started eating it- I definitely didn't get to finish the dish or the fried dumplings we ordered. The stuffing in the dumplings were just the way I like it - beef and chives with bits of onion. AWESOME.

The fried dumpling was simply delicious - as was the food - so much so that I took the rest of it home. The next day, it was STILL delicious!!!!

The service was also very good- I think she may have been psychic, because every time i thought , \"Oh I need ....\" she was RIGHT there with a big smile with whatever it was my mind thought it needed.

For the amount of satisfaction and food you get here - the price is pretty cheap - in fact, I'd go as far to say that it's a SMASHING deal.

WARNING: THE CANDY THEY GIVE YOU AFTER IS TAMARIND FLAVA.
I love tamarind, but this is not the candy for me. Still, if you feel adventurous, go nuts...."}
{"text":"Have been coming to this place for a long time and it never disappoints. The owner, Garap, is always more than accommodating and goes out of his way to make sure everything is ok. 

Food is always fantastic, especially the spicy shrimp, chow mein and pretty much all the momos. 

They also have an amazing rear patio during warmer months. Don't miss out on this place. Well worth the try!"}
{"text":"Can I just first say that I cannot wait till I get to come back and try more of their dishes. It was my first time having Nepalese Indian fusion food and I became a huge fan. Love the atmosphere, the owner was serving tables and incredibly hospitable and friendly, everyone's comfortable, other Tibetans are here to dine as well. My hubby and I ordered the Thali (with mutton), pan fried Tomo/dumpling (chicken filling), and beef chilli. 

The thali mutton so tender, the sauce so flavourful. I love how Thali is an entire meal served on a plate made in and brought back from Nepal. The aroma and flavours just kept us eating more. 

The tomo was crispy and chewy on the outside, and as soon as I bit into it, juices from the meat flows out. So tasty. It reminds me of the Shanghai Shao lun bao. 

As for the beef chilli, it definitely had quite a bit of a kick. I'm not used to eating really spicy foods but it made me hungrier and wanting to eat more. Thank goodness for the yogurt drink included in the Thali because it helped calm down the residual heat on my tongue so that I could eat more of this beef chilli! 

This restaurant is definitely a reason to come to the west end :P"}
{"text":"Friendly staff..that make you welcome and comfortable. I would definitely recommend this place for a fabulous meal... Must have the chicken momo"}
{"text":"So disappointed in this place! I ordered from here today for the first time through a delivery service, and really wanted to love it. All the great reviews made it sound delicious. Maybe I chose the wrong thing to order but the sweet and spicy chicken I got was flavorless, fatty and unappealing. The fried beef momo's were okay, but the dough was a little undercooked in the middle. So overall, not impressed."}
{"text":"The food was great and the service was even better. We sat in the lovely patio in the back, it was so nice. The owner is really friendly and funny. Prices are fair and portions are perfect. Momos were delicious!!"}
{"text":"Foods were delicious! coming back fo sho!"}
{"text":"It is not a given that glowing Yelp! Reviews guarantee a great experience. I wanted something a bit different from the ordinary where I could take some out of town guests without spending a fortune.

Tibet Kitchen is delicious. The steamed beef buns, fried chicken buns, noodle dishes, and recommended chicken dishes were all excellent. If you are not a fan of spicy, tread lightly with the accompanying hot sauce.

Service here is excellent.

Prices are extremely reasonable. We agreed that if the same food was being served by some celebrity chef downtown, people would gladly wait in line and pay 2-3 times as much.

Can't wait to go back."}
{"text":"OMG! I miss Tibet kitchen already!!! The owner is so funny and friendly. The environment is so lively and the atmosphere was just so uplifting. I loved all of the dishes especially gyuma because since I live in Chicago, we don't have any Tibetan restaurant here. I am hoping to visit again during winter. STRONGLY RECOMMEND EVERYONE TO GO TO THIS RESTAURANT! You won't be disappointed!"}
{"text":"Don't be deceived if you walk by this spot and see no one in the restaurant. That's because everyone is in the back patio, under the shade of a giant tree enjoying momos and a beer. I would highly recommend that you join them. Great service and friendly smiling server, even when they are super busy in the heat.

I would highly recommend the fried momos, which come piping hot and golden brown. The texture of the crisp chewy crust and the moist flavourful beef filling makes  for the perfect bite.  For the adventurous, try the gyuma which is a beef sausage with rice inside. Perfect side dish for a couple beers. For the not so adventurous, get the spicey chicken with a wonderful blend of heat and white rice. Will definitely be back to try more of the menu."}
{"text":"Was planning a dinner for few friends in May 2016, so decided to take here as this place had great reviews and a patio.
Since then I have been to this place sooo many times, I don't even remember the count.
The owner of this place is super nice and welcoming. He will make you feel very comfortable and offer you free beverages like tea :) Aww he is so cute. He knows the art of making your customers to come back to you again and again.
I have tried a lot of things from their menu and I love all the dishes but my favorite by far is their chilli chicken and chicken chowmein.
I have tried their Hot and Sour soup, Steamed chicken and beef momos, Tibetan style beef patty, Steamed buns, Chilli chicken with gravy on the side, chicken chowmein, fried rice etc. I am telling you guys this is the best tibetan restaurant you can ever find in Canada so do yourself a favour and visit this place once and I am sure you will become a fan ;)"}
{"text":"we went there last sunday and the owner/manager was so friendly. we ordered chilli pork and lamb(mutton) curry. the taste of the food is super delicious! i like the chilli pork so much coz the tender and chewy of the pork belly is cooked perfect. the lamb curry also good."}
{"text":"This review is very much overdue but I visited this gem with a couple of friends after reading the stellar reviews and wanting to check out the patio/backyard oasis.

The food overall was really, REALLY yummy. Because I came with a larger crew, we ordered probably over 9 different things on the menu. The highlights for me were: the veggie momos (we gottem steamed), the chilli chicken (I literally did a dance after the first bite - ask any of my friends who went with me and they will verify), the chow mein (not at all like the uninspired kind from the run down Chinese restaurant in your block) and the HOT SAUCE (will have you sweating and maybe even crying). 

One thing I definitely don't wanna forget to add is the SUPERB service we received from a man who I believe was the owner. The food was definitely amazing but his hospitality is what blew me away the most. Need to go back ASAP!!!!!!"}
{"text":"Best Hakka Chinese in Toronto hands down. Specially if you're from India. It reminds you of restaurants back home. Not very upscale but very homely. The owners and servers are very welcoming. I work as a cook in a restaurant and I really would recommend this to anyone I know. Love this place. Even better in the summers when they open their small and cozy patio. Check it out !!"}
{"text":"I came in for lunch, this week and was presently surprised by just how much I liked it, I picked up a lunch special to take home with me and let me tell you the smell was awesome.  I suggest the chilli chicken, (chunks of chicken with fried green chillies), any of the noodle dishes and the warm steam buns.  I will be returning soon."}
{"text":"Great little place for authentic Tibetian/Nepalese food. Veggie momos were just okay, but the veggie Manchuria and the Chilli shrimp were really flavourful. Also have a nice little patio in the back, with tons of street parking up front. Super friendly staff and very reasonable prices as well! Definitely will go back here."}
{"text":"This dinner was SO GOOD!

- vegetable shae mo
- vegetable spring rolls
- ting mo
- tsey tofu

Everything was delicious and went so well together. The hot sauce was amazing too. I loved eating the fluffy ting mo with the coleslaw and hot sauce. Yum! Will definitely have this all again!"}
{"text":"Really good food and even better service.   Really enjoyed my meal here.  It's good especially if you like spicy food. 

The decor is simple and very clean.  

Would recommend."}
{"text":"I came here on my trip to Toronto as it was near the apartment I was staying at. Initially, I came because of all the rave reviews on Yelp and online. I had not had Tibet cuisine before and did not know what to expect. However, the food was nothing to go crazy over. My cousin and I both had the chili chicken lunch special. It's a great deal because you get to also try their soup and dumpling. I would recommend this place if you're looking to try Tibet cuisine. Also, I preferred the corn soup over the hot & sour soup. The hot and sour soup was a bit too vinegar-y for me as the corn soup is more tasty! Overall, I would come back if I were in the area again. The food is good and the service is great!"}
{"text":"Came here on New Year's Day because it was one of the few places open and they were packed. But the amount of customers did not hurt the quality one bit!  The egg noodles were homemade, dumplings, while not amazing, were very good and the veggie platter was lacking in the veggie category but good none the less 
I scored this restaurant higher because the people were so kind and helpful and quick.  
Great great food for take out!"}
{"text":"My boyfriend and I have ate here numerous times and we have never, ever been disappointed. Tell Garab what you like and he will feed you in abundance. There are so many dishes we could recommend here that we wouldn't even know where to start. You must go here!!"}
{"text":"I wanted to try this place for a while because I never tried Nepali food before it kind of reminded of federicks with the chilli chciken but they have other different dishes like momos which are dynamite with the spicy sauce. The noodles are below par. The mutton curry was dynamite it had a little bit of five spice and what I really like the owner and his son are very friendly and really good customer service"}
{"text":"We had a great time in Tibet Kitchen. The food was delicious, the prices are reasonable and the portions were huge. We were treated like family and I definitely recommend this awesome place!"}
{"text":"Possibly my favourite resteraunt in Toronto. The chilli chicken is incredible. How can such a perfect flavour exist? The dumplings? Best in the world. The verdict is in. You absolutely must check this place out!"}
{"text":"First time in Parkdale and had to try some Tibetan! We had the beef momos and chicken pakoras. The momos were essentially dumplings and the chicken pakoras were seasoned nicely. Everything was tasty but not the best chicken pakoras I've had. Overall, 3.5/5 because the food was generally good and the man that served us was adorable! He was very polite and provided us with excellent service. I'd come back another time to try other dishes and one last tip.... if it's warm enough, try sitting in the patio area, it's cute!"}
{"text":"Extremely friendly service and delicious food. Affordable and the food came quickly. Had their beef momo and dry chilies chicken. Beautiful sunny day spent in their spacious and clean back patio."}
{"text":"It didn't live up to the hype. I came in with my boyfriend a few days ago during a Wednesday lunch time and was seated immediately. The place was mostly empty, but easy to find with all the signs regarding its high yelp status occupying the front of the restaurant.

Our server was very friendly and continued his high service throughout our experience there. His kindness almost makes me want to bump my review up a star. That's how great he was.

We decided to order the chicken pakora as an appetizer, the chicken manchurian, and the beef broccoli lunch special. They were all reasonably priced. The chicken pakora and soup that came with the lunch special came out first. The chicken was very tender and had a nice crisp outside that paired well with the sweet and sour sauce. The soup was nothing special, sweet corn with shredded chicken inside. Then the main dishes arrived. I had higher expectations for the place because of its reviews on Yelp. However, there was no flavor to the dishes! The manchurian and the beef and broccoli were drenched in sauce, which we used to wash down the rice, but it added nothing to the rice except for making it more difficult to pick up with chopsticks. Even the fried dumpling didn't have too much flavor, just a sweet accent in the dough.

This was my first time trying Tibetan food and I was a bit disappointed. Maybe I had too high expectations going in or tried the wrong dishes. I'm giving this place 3 stars for the service and portion sizes; I was definitely full after trying to finish my meal. Overall, I hope to find more flavorful Tibetan food. This was an interesting experience."}
{"text":"Came by here (commuted over 2 hours) because I heard they had the BEST CHILI CHICKEN....nope. Not even close. My friend and I found it to have no spicy and little flavour at all. Originally, I thought we must have gotten the wrong item but looking at photos, it looks right. We were expecting the chicken to be crispy as I read in some reviews, however, our dry chili chicken was SOGGY. It was actually the worst chili chicken Ive ever had... I would reccomend this place in Scarborough on pharmacy (forgot the name), or chili chicken house in Mississauga. Try making chili chicken at home too. My mom's is much better than this place. 

Other menu items/highlights :
- gyuma blood sausage appetizer: DELICIOUS MUST TRY ITEM. It was my first time trying blood sausage or blood anything. Had no idea what I was putting in my mouth but everything including the onions were a delight. The sauce was sososo good! 
- ginger garlic bok Choy had a great tasting sauce
- was not expecting a huge bowl of steamed rice. We ordered a fried rice bowl and ended up not eating much of the plain rice or finishing the fried rice. It looked like they used different grains of rice. 
- tibet fried rice was better than expected, tastier than the basic Chinese fried rice that it basically looks like
- service: okay... We didn't have water for a long time. We waited for her to come back and asked her to fill it. I think even then, she only did once. We were the only table in the restaurant too for awhile. Then two other groups came."}
{"text":"Amazing and so very authentic! The owners super nice as well. Momo's are out of this world."}
{"text":"Service was good and friendly but the food is just okay. 
We ordered pan fried chicken momos and chili chicken with rice. 
The chili chicken is so far the best out of two dishes, the chicken momos are not as great as we expected. The outer crust of momo seems like a separate layer of food, it does not goes well with the inside meat when you putting it in your month. 
My friend does not feel comfortable with their cleaning and hygiene standard.As he took a peak at the kitchen through his way to the washroom, he saw a run down kitchen and the condition in the bathroom is truly unpleasant. 
I don't think so we will be back to this place in the future after all."}
{"text":"Came here and ordered from the lunch menu, which was excellent value!

Staff was very friendly and gladly accommodated vegetarian requests."}
{"text":"Food was awesome.. Server was very friendly and knew lot about food. He recommended good dishes as per indian taste buds. Momos were too good. I will be back again when i m in toronto"}
{"text":"Love the portions of the dishes. Chili chicken dry, momo's and fried rice are amazing!"}
{"text":"3.5*, pumped up for friendly and hospitable servers!  

Momos = straight up Dumplings.  Just under a different name and it was accompanied by pickled strips of daikon/carrots and this light orange coloured chilli sauce.

I came here during their \"Momo Munch Fest\" where 100% of their proceeds went back to their community.  However, I feel as if I came on the wrong night as momos (steamed, beef) were literally the ONLY thing on their menu - saved pop, tea, water, & some of their chicken soup.

So since their menu was so limiting, I shared a plate with a of momos with a friend and we ended up eating elsewhere.

I loved the skin of the momos.  They seemed to be made in-house.  However, I found the beef stuffing a tad dry and tasteless.  The sauce/pickled veg on the side definitely helped!  

I'm not sure how they're supposed to taste in Tibet, but in China, they innards are definitely more tasty!  So momos alone, about a 3*, but all the servers were lovely and very welcoming during their charity event."}
{"text":"Amazing restaurant!! We always order in from Uber Eats but when we had visited the restaurant, it was such a great experience as well. 

Owner and servers were super friendly, nice, and took your order quickly. Food arrived pretty fast and the portions were really generous. 

Must try: all the momos (we had the Lhasa mono), gyuma (spicy beef sausage), phingsha (most delicious soup I've ever had!), phaksha khatsa, chilli tofu broccoli, Lhasa nyop-tsey 

Love this place and hope they stick around! Truly a hidden gem for Tibetan cuisine."}
{"text":"Garab, the owner of the restaurant is so friendly and kind. His restaurant makes some really yummy food. I recommend the Momos and the Chili chicken which was our favourite. Restaurant is Clean and the food is great. Would definitely return ! Prices are great and portions are big !!"}
{"text":"Very very delicious!
my friend and I enjoyed there 
The tea is authentic."}
{"text":"This is my favourite Tibetan restaurant. The food is delicious and the service is so so gracious. Owner Garab and his staff are filled with warmth and you always get served with a smile. Highly recommend the beef and chilli chicken, the tingmo (steamed buns), the house special chowmein, beef sausage and the momos."}
{"text":"The food was great as was the service. Great spot to stop and grab a nice lunch"}
{"text":"A bunch of friends wandered into this restaurant as we had just seen a show across the street, and so glad that we did! The food was fresh, flavourful and the prices were nice and cheap! We ordered the fries (if there are fries on the menu no matter where, it's hard for me not to order them ha) and Parkdale pakoras which were made of cauliflower and a veggie thali - all were delicious. Others ordered momos (dumplings) and rice stew dishes that I can't remember the name of (sorry), and steamed buns that were the size of my buttcheeks that looked so fluffy and yummy! They also had a butter tea that was interesting, like a salty black tea concoction, but I think I prefer the sweeter kind better!"}
{"text":"Visited for the first time today for breakfast and it was an experience I haven't stopped thinking about al day! Excellent price for an extremely filling breakfast of eggs, sausage, a bowl of a chickpea and potato soup, different types of breads and spicy sauces. Also ordered the steamed veg momos which were amazing! The chai was also excellent, can't wait to come back!"}
{"text":"So my friend took me here for the first time and let's just say, it was absolutely amazing! Never be afraid to try new things :) 

To start off, the restaurant was decent in size and even had a patio in the back! The owner is super friendly and the service is great! 

My friend and I ordered the chicken pakoras, steamed momos (beef) and she ordered the mutton thali and I got the chicken thali. The chicken pakoras were amazing! Definitely the best chicken pakoras I've ever had! They were super crispy and had a lot of flavour. The beef momos were great! I loved that they had soup inside of them! Now the chicken thali was amazing! The lentil soup was really good with some rice in it and the chicken was delicious. The only thing you wish for is more! 

I'm definitely going to come back here and I would recommend this place for everyone to try!"}
{"text":"I am truly an advocate to this restaurant. ever since I found out about it I have fallen in love with the food and the service!! I live a bit of ways from Tibet kitchen but I find that the drive is totally worth it!!!! always a craving satisfier !.. 

if you like spicy food try out their chili chicken dry, very flavourful!!
and if your not so into spicy food momo(Tibet style dumplings) are my favourite! 
so succulent and juicy, so much better then the regular dumpling!

lots of culture in the restaurant and it shows through the owners and service! 
there are always so polite and kind! which is another reason for my constant return! 

I with out a doubt always bring my friends to try this place out and they all love it as well.

I can now say I am a regular even though sometimes it take me 40 mins to get there depending on where I am coming from if I want to get my Tibet food, nothing will stop me to get to Tibet kitchen!!! and because I live far I always order for take out after my meal as well to bring home to my family and boyfriend, because just like me they love it too."}
{"text":"I'm no expert on Tibetan cuisine, but I can't imagine the experience gets much better than Tibet Kitchen. We ventured to the west-end in hopes of something unique and delicious, and we were not disappointed.
We explored the menu, and tried the steamed chicken momos, steamed beef momos, pan-fried veg momos, chicken spring rolls, veg spring rolls, dry chili chicken, and blood sausage. To my surprise, my favorite variety of momo was definitely the veg, they were super flavorful and well-spiced. The chili chicken was a big hit, but the real prize was the blood sausage. Very distinctive, but also super approachable and not as strange as some of you more reserved eaters might think.
The reasonably priced beer and amazing service were just extras. I can't wait to make my return in the summer and check out their patio. Also note that their chili oil might be my favorite to date. It's the first thing I try at any restaurant that places it on the table, and this one was phenomenal."}
{"text":"I tried the Thukpa, Jhol Mimi's and chilli chicken and all of them were delicious! My friend recommended me to try the thukpa- a noodles dish and I am in love :)"}
{"text":"The owner is really willing to offer his best service. Always smiling and the family run restaurant is no doubt the gem of parkdale. Best chicken fried rice ever."}
{"text":"The food was perfection but the service is slow.
Nevertheless I would eat there until I try everything. 
Please try the chili. Omg amazing."}
{"text":"Great spot if you like enjoy delicious and spicy food. We were greeted by the friendly staff and they immediately had us seated. We ordered Delhi momos (must try) and 4 ting-mos. If you love spicy food and want to try something different - this place should be next on your list!"}
{"text":"We went here for a late afternoon lunch and had a great meal. The restaurant is small but comfortable. There are even nice Tibet-themed photographs and paintings on the wall. Our server wasn't too cheery, but we got there shortly before closing, so she might've been justifiably upset at that. Regardless, the the service was fast, and the food was all amazing. The gyuma (blood sausage), the kothey momo (pan-fried dumplings), and the chili chicken (get it dry, not with gravy) were all delicious. The veggie manchurian (saucy vegetable balls) was ok, but I'd recommend a sautéed vegetable dish instead. Beyond simply tasting great, all of the dishes were attractively plated, which made the experience all the more enjoyable. We split everything among the three of us, which was a fun way to sample multiple different dishes. Overall, we had an excellent time, and I'd definitely be happy to return."}
{"text":"3.5 Stars

Affordable prices and casual atmosphere. Good place to try something new. 

Gyuma (Spicy Tibetan sausage) were blended with rice and had an unique texture. Mixed feelings about this and not sure if it's for everyone but good as a shareable app so you can try it with a couple friends.

Momos were good but I personally still like dumplings better (this is obviously a personally bias so they are still worth a try!)

Read good things about the owner but the service we got by a waitress was OK."}
{"text":"Was super looking forward to the Tibetan meal of my existence! Unfortunately my meal fell short of my high expectations and was altogether just OK. The very sour note was when I checked into Tibet Kitchen on Yelp, was rewarded -10% off for being among the first 10 to check in, showed the waiter who happily said he'd apply the discount with a smile, only to be served our bill by another waiter without the discount. When asked about the discount, he grunted that it applied to lunch only regardless of the our server agreeing to apply it and though we checked in on Yelp during dinner hours. I was not fishing for a deal but the server answered us like he was so bothered by us, paying guests in their restaurant. I brushed it off but the situation had me leave with a negative last impression.

Our order:

- Chilli fries: plate of red, crispy, sticky-sweet fries garnished with cilantro. Low spice level. Pretty good. 3.5/5
- Chicken pakora: bright red, crisp and tender seasoned chicken. Best of the order. Made only better with a generous sprinkling of lime! Ordered a side of white rice for better flavor distribution. 4/5
- Beef Lhasa momos (dumplings): 8 pieces of steamed beef dumplings. Very different from other styles of Chinese dumplings you're used to. Very photogenic but cannot say much about the cooked meat inside... it's tough, chewy with no other flavor but that of steamed beef. Didn't pick up other flavors, each bite had to be accompanied with the dip that tasted like tomato. Not bad but can't rave about it. 3/5

Adventurous eat in the Parkdale neighborhood but will definitely try other Tibetan cuisines before returning. 3/5"}
{"text":"love this place! such a gem in parkdale. the prices are very affordable for the quality and size of the dishes. cost between 10-15$per dish. the people are friendly and the place is clean and nicely decorated with Tibetan paintings or landscapes.

the portions are huge so sharing shouldn't be an issue. my friend and i got their daily lunch special: chilli chicken and it came with soup, their dumplings, gyuma, and c-momo.

Gyuma - Tibet beef style sausage. it honestly looked like Vietnamese's stuffed intestines. I thought the flavour was nice - meaty and spicy but not too overwhelming. My friend thought it was bland

C-momo (beef) - their spicy dumplings. Each dumpling was huge and stuffed to the brim. It came in a red spicy sauce which added tons of flavour. I tried without sauce and it was still tasty and flavourful

Chili chicken - I know why it's such a hit with the crowd. it came with rice, a fried meat dumpling (2nd best), a steam bun to soak up all the gooey goodness of the chili chicken, and soup of the day. All this, only for 12$!!  The chicken was so flavourful and it was spicy. in my experience, spicy food from restaurants are never spicy and i always have to ask for additional hot sauce.  but this place delivered everything - from spiciness to quality to the friendliness/helpfulness of staff.

highly recommend!"}
{"text":"It was an awesome experience, we ordered pan seared momos, the spicy momos in the excellent sauce and the chilli chicken. Next time definitely we are ordering more momos. Service was great and quick. It was our first time here and it certainly isn't going to be last time."}
{"text":"This place is a favourite of mine - the food is great and the staff are super friendly.  If you're new to Tibetan food, they'll guide you through the menu and make recommendations on what to order.  

We live in the neighbourhood and come here fairly often to eat in and get takeout.  My hands down favourite things on the menu are the chicken hot & sour soup (Khatsa Kha-kyur Thang) and the steamed beef dumplings (Shae Mo).  The soup is pretty spicy (as promised..) but so great, especially in the winter.

The back patio has just been renovated so this is a nice place to come in the summer too.  The beer is pretty cheap, which is always a plus!"}
{"text":"I love this place. The service is very good and the people extremely friendly. If you happen to come across Tibetan people eating here they may just ask you if you are enjoying the cuisine and make some recommendations. They have a really amazing beef sausage, some yummy dumplings that feel very much like home cooking, and some awesome beef noodles. If you like asian cuisine but are looking for something a little different, this place might just do the trick."}
{"text":"Best Tibetan food I have had so far in North America. I am gonna miss their food:( try once and you will be hook by their food and services..."}
{"text":"Easily my favorite restaurant whether I'm dining in or ordering takeout through Uber eats. Food is always the best quality when it comes out. Be sure to try all the momo's and the chili chicken with steamed ting mo bun. The hot and sour soup is also the best I've had in the city. Highly recommend this place and the owner Garab and his team always give great service. Get here!!!"}
{"text":"First time to Tibetan food... little different than Chinese / Haka food but tasty and good.. love their Momos... owner is very friendly and good to talk with... will sure go again"}
{"text":"We dropped in only because we saw Shangrila nearby catch fire, so that was closed. We were quite happy with this place.

It had good food and great service. This is a casual and simple place so don't expect anything fancy. But the chili chicken and momos were good, and the service was really friendly. They were quite helpful. There's also a nice little patio for when the weather's looking good."}
{"text":"I followed the suggestion on Yelp to find the courage to step into a Tibetan restaurant by myself and try Tibetan food for the first time.  The waiter was very friendly.  I tried the lunch special for the chilli chicken and really wanted to get the dumpling that came with it (but they were sold out unfortunately).  The hot and sour soup I thoroughly enjoyed as well as the chilli chicken on rice.  The veg spring roll was \"meh\" as I am not a fan.  I would love to try the dumpling next time.  Another visit perhaps."}
{"text":"I wanted to update this review so i could give it TEN stars, but sadly, that's not an option. But yelpers, that is what this place deserves!

Came here last night with my boyfriend for my birthday dinner (a very welcomed surprise!) and this visit was as good as any other. It was my boyfriends first time and he loved it too, despite how picky he can be!

We had the fried beef Amdo momo's, chili chicken dry, cauliflower pakoras, chili pork, and of course the outstanding services that always comes with a meal here.

If you haven't been here, you need to try it. And if you have, you need to come back :)"}
{"text":"Not too familiar with Tibetian food but I found food just mediocre and service was quite slow. Momo beef was bit try and chewy. Portions are also on smaller side. The owner was very nice and friendly!"}
{"text":"This was my introduction to Tibetan cuisine, and I'm not really sure what it is, but we ordered the steamed dumpling (momos) and some stir-fry on a sizzling plate. The flavours were nice and everything from the food to the service felt genuine and authentic and reasonably priced . The patio was quite enjoyable. It was a Wednesday evening and I really don't understand why we were the only ones in the restaurant! The ginger milk tea (?) was quite delicious, soothing and definitely worth a try."}
{"text":"Another great Tibetan meal at Queen St. W. 
We actually had an aim to eat at Himalayan Kitchen that Saturday night, but they were randomly shut. Tibet Kitchen was just a few steps away and looked pretty busy, so we thought this was a sign for us to try another new restaurant of the same cuisine. 
By far the most friendliest service compared to Shangrila and Himalayan Kitchen. 
The only reason I did not give this place a 5 stars was because they do not serve thali for dinner. So we started off with veg momo's, which were delicious, but I still say Shangrila make the best momo's.
For mains I got the large dhal with rice and my friend got the tofu and broccoli curry with tingmo. Surprisingly, the tofu wasn't deep fried, which is a good thing. However, the portion size was pretty tiny. My dhal arrived, which for a large, wasn't that \"large\". Also the dhal was made using a different lentil compared to the dhal from the other aforementioned restaurants, where they used the yellow lentils rather than the black ones. It was really flavourful though, and with the rice, it was really comforting for a cold night. Overall, the food tasted great and the restaurant itself was well decorated with some effort put into it (such as the addition of a large Dalai Lama painting). 
The portion sizes need to be enhanced and they should consider serving thali for dinner instead of only lunch. 
But, nevertheless, Tibet Kitchen did not let me down."}
{"text":"Best Tibetan food in the city! Be sure to order some momos ( I prefer steamed) when you come. The chili chicken in gravy is delicious with a good crunch to it. Big portions and very affordable. Regarding interior, it's not a very large set up."}
{"text":"This is one of the few restaurants in the neighbourhood that really stands out. 

My friends and I got the chili momo balls, soup noodles, shangrila noodles, and their signature chicken. With spring rolls as appetizers and it all came to $10 per person!!! Talk about affordable! 

The chilli momo balls are delicious and it's a definite must have when you're here! 

Bonus: Service is friendly and always refills water without being asked and their washroom is super clean and nice."}
{"text":"A small, very friendly place minutes from Roncesvalles in Parkdale..  I found it while idly browsing the net during my down time at work and was tempted enough by reviews to try it during my lunch hour. The proprietor was super friendly. 
I ordered two appetizers: Dropa Khatsa - well done beef tripe ($4.99) and Gyuma - beef sausage ($5.99). The tripe was well curried, very spicy and I loved it. Sausauge was soft and it strongly reminded me of kaszanka - a traditional blood sausage in Polish cuisine. I also ordered Phaksha Khatsa - chili pork ($8.99) and loved it as well. 
I always try hot and sour soup wherever it's available and this was not an exception. It was the only food item that I truly disliked and would never again order it there - too watery and pretty much tasteless.
I repeated my experience there few days later. The proprietor greeted me like a long lost friend. 
We ordered lunch consisting of fried dumpling,  chicken corn soup, chili chicken, small ball of rice, a steamed bun - it was fantastic. Portions were huge and we both ended taking half home. The cost? $6.99 plus tax !
I'm a believer now and shall be returning on many occasions."}
{"text":"This feels like a family restaurant and the owners were so friendly. I would recommend getting a reservation as it gets quite busy. My friend and I got a few dishes to share. We had the fried rice, chili chicken, a mix of momos, and a soup. Each dish was around $10-$15 and I thought the portions were reasonable for the price. I really liked the chili chicken - it lives up to its good reviews. The chicken was just enough spicy and not overly greasy. The vegetarian and chicken momos also stood out to me. I would definitely come back!"}
{"text":"I checked this place out with my dad!! It was awesome. The food is fresh not overly oily or salty.. legitimate healthy. The momos are great! And the man who owns this place is very kind. The service is fast. I would recommend this place for anyone especially if you haven't tried Tibetan food before as the owner will gladly explain any menu item."}
{"text":"Tibet Kitchen is located in Parkdale on Queen West among the many Tibetian restaurants around the area. I dropped by for lunch on a Friday not knowing what to expect (I've never had Tibetian food before except for momos!). The restaurant was not busy at all at noon on Friday but I did speak with the owner and he said that the place gets very busy on the weekends.

I ordered the chicken chili lunch special for $10 and it included a bowl of hot and sour soup, rice, and a deep fried momo. It was a lot of food for lunch and I wasn't able to finish all the rice. The chicken was tender and moist and had a good flavour to it. The deep fried momo was delicious (I'm now very tempted to go next time just to get a plate of their momos). The hot and sour soup was very warming and had the right amount of spice to it. Overall, good value for the amount of food you get.

The service was attentive and friendly. The owner is super sweet and nice. He always had a smile on his face and started conversations and joked around with the customers (myself included). He did mention that his main chef was away the day I went so he apologized ahead of time if the food was not good. 

Overall, great introduction to Tibetian food! Great and friendly service, I will be back for more and bringing friends to try more Tibetian dishes next time!"}
{"text":"Tibet Kitchen. I want to give it a 4-stars, but simply cannot. Here's why:

1) Food: This is a tough one. It may be just Tibetan food, but the entrees we ordered oddly lacked flavor and spice. We ordered the shaptak and chicken chili, both promising a little heat, but it was lacking. It almost had no taste.

2) Service: They were friendly, but slooooooooow. It took awhile to get seated, to take our order, for our food to arrive, and for us to get the bill. The entire experience took around three hours.

Despite the above, the space is beautiful and spacious. They have a back outdoor patio that is perfect. When we went it was full, so it must be popular. Perhaps we're missing something."}
{"text":"Food I've ever had in my life. The owner is such a charm he will make sure that you and your friends have the best time possible and the best food you guys can possibly eat"}
{"text":"This place has everything! Amazing food, great service and an amazing ambiance. No matter what I've ordered, everything always tasted great! Not once have I been unimpressed or disappointed.This is my go to place for Tibetan food when my significant other and I decide to go for Tibetan food. We have been going here for almost 3 years now. Took my gf here for our 3rd date and she loved everything about it and have constantly come back here for the service, food and the ambiance. Keep doing a good job!"}
