{"text":"Real, fresh authentic Mexican food. And reasonably priced."}
{"text":"Excellent food and very inexpensive.  Highly recommended."}
{"text":"Food is so good. The sauces are so flavorful. This place is delicious. Huge portions. Fresh food. Delicious beans. Good prices. Will definitely come again. My new go-to Mexican restaurant in Madison."}
{"text":"As a California native, I'm so here for authentic and low-priced, and I judge anything that claims to be authentic with a fierce side eye.  Los Gemelos wins, and is literally the key to my soul. Tucked in a cute little store, you walk in (grab some mexican candy cuz duh), sit down, get some chips and salsa for the free free, and chow down. Love this place more than any other restaurant in Madison."}
{"text":"The food here was yummy. I found this thanks to the YELP app and my inlaws and I went here to grab a quick bite after some shopping. The menu had some very different looking items than the typical mexican eatery I have dined before. My husband had something called a PAMBAZO. It was wonderful goodness. My phone died so I was unable to take a picture after checking in but Pambazo is a type of bread. It was sliced into two and it was filled with papas con chorizo (potatoes with chorizo), shredded lettuce, salsa, crema and queso fresco. I wish my phone did not die because a picture would just make the description pop. I recommend this place to anyone wanted to try some different dishes."}
{"text":"This was a good restaurant/grocery store. I thought that the meat was cooked a little too crispy but I'd go back."}
{"text":"I have been to Los gemelos a million times and I think it is because they are doing many things well. The owners (which is a big family) and the whole staff are always nice and make you feel at home. They make all their food from scratch and offer a variety of items to choose from. There is always a menu on the tables but they also have a menu board where they write down the specials of the day. 

The chips and salsa as other mentioned, are ok. My favorites are, the tacos campechanos (a mix of steak and chorizo), quesadillas (with cheese only), the green chicken tamales (which are served only on weekends), the dough it's really tasty and the chicken and tomatillo salsa filling has the right level of spiciness (I always ask for a side of crema mexicana (a table cream, not sour at all), it adds a nice refreshing element to the spicy tomatillo salsa. I also like their chipotle chicken soup, spicy and smoky at the same time, however, it is not available everyday, so you would need to check on that.

They also have a lot of mexican beverages, juices and even beer. For some people their \"grab yourself\" your beverage system from their coolers could be kind of confusing but I think it's kind of cool to choose your own and take a peak of their grocery store as well, it's like taking a tour while you wait for your food ;)  they have a bar area and I don't know if they serve cocktails that they can bring you, but as far as the beverages where you serve yourself is concerned, once you are ready to pay at the counter they always ask what kind of beverage you got and they charge you accordingly."}
{"text":"Discovered this place by accident while traveling. I must say I had my doubts when I walked in. 
The place is mixed with a bakery/grocery store. Service is a bit slow due to very small staff. But the food is worth the wait. 
I've ordered almost everything off the menu and have not been disappointed. 
Give it a try if your staying close."}
{"text":"Authentic food but terrible service in the restaurant. The entire place was lacking cleanliness, won't go back."}
{"text":"First:  If you want cheesy, saucy, greasy Tex-Mex, this is not the place for you.  If you want light, simple, authentic Mexican food, you've come to the right place.

Second:  Tienda Los Gemelos does not show up on a Google Maps search for \"restaurants,\" because it is tagged as a \"Mexican Goods Store.\"  And that's true -- it's a little Mexican grocery store -- but in the back, they're hiding a spacious, clean dining room, with televisions and table service.  And they're open on Mondays, contrary to an older review here.  And they take credit cards.

The food:  I ordered a steak taco, taco al pastor, steak tostada and chicken quesadilla.  The tacos are simple -- meat, onions and cilantro in a soft-fried tortilla.  The quesadilla is deep-fried, and has chicken, lettuce and crumbly queso fresco cheese.  The tostada has meat, lettuce, tomato, mayonnaise, queso fresco and slices of avacado. And the mayo actually works.

The pastor was the clear winner -- juicy, flavorful, delicious.  The steak was tasty but didn't pack the flavor like their pastor.  The chicken was cooked well, and tender, but not seasoned in any noticeable way.  All the meats tasted like quality cuts, though, and they provide two sauces and a salsa to dress up your entrees, as well as plenty of lime wedges for lime juice.

Drinks:  Grab 'em from the cooler, pay for 'em when you pay for your meal.  The opener's hanging from the cooler door.  If you have an ounce of observational skills, it's super-easy to figure out.

And all of that food, with a Mexican Coca-Cola, was less than $13.00."}
{"text":"Very good. If you're looking for champurrado in the winter months, they have it here!"}
{"text":"This place is great. Great service. Don't let the out side fool you.  Service is great and food is wonderful."}
{"text":"We we're just staying outside of Madison for a night and we decided to go here for a late lunch. I have to say, this place is the BEST! This is the best Mexican I've had in the Midwest. I had three tacos. The salsa was REALLY good on those tacos. It was pretty good since it was only about $15 for 2 people. Highly recommended. Go try it out, it's worth the drive out of the city."}
{"text":"Great little hidden Mexican food place. Highly recommend anything with their chorizo - perfectly seasoned. Easy on the budget as well!"}
{"text":"Great authentic Mexican and tacos for $2 is amazing. However, service was very very slow and not very attentive.  Place is strange and dingy which makes it feel unclean. If I went again I would only get it for take out."}
{"text":"I honestly don't know where the 4.5 stars came from. This place wasn't that great. l always start out with steak tacos, if a place has can prepare good tacos then its other plates are worth a try. The tacos were mediocre, they weren't delicious nor inedible. The steak was cut in too large of pieces, the seasoning was never added, the salsa was watered down and flavorless. I wasn't full so I processed to order enchiladas. I had two bites no more, there is a handful of other places to go to for better mexican food."}
{"text":"You can't imagine how happy I am to discover this place!! I'm a big fan of Mexican food and this is one of the best daily Mexican food I have ever had. You don't come here for the service or the interior design. You come here aiming directly at the authentic Mexican food that has price comparable to chain store fast food and the best taste you can wish for from $-$$ Mexican restaurants. I have tried enchilada plate, tacos and gorditas and they are all very good. Highly recommend it to people who like Mexican food and want take-outs or a quick meal."}
{"text":"Service was horrible...waited over a half hr for a to go order of 3 tacos.  Honestly they never turned in my order to the kitchen because they are so unorganized.  Will not come back."}
{"text":"My kids and I eat here four times a week! The Place is warm and Inviting place. We love to come here. The food is always freshly cooked and very good. We love Los Gelemos! Everyone should give it a try!"}
{"text":"Amazing tacos-- most authentic in Madison. The steak taco is so good-- the quality of the meat is outstanding. My husband loved his crispy, fried chicken quesadilla. We were the only customers speaking English in the place, but everyone was friendly and helpful. Prices are really reasonable. If you don't have enough cash, the store in front of the restaurant takes debit and credit! Enjoy!"}
{"text":"Best Mexican restaurant in Madison. We ordered take out the other night. The guacamole is simply amazing and I was also pleased with the veggie quesadilla. My husband ordered and enjoyed the chicken enchiladas. Great food."}
{"text":"Great place for some authentic Mexican food! Ordered the al pastor tacos and veggie enchiladas - both dishes were excellent! The tacos were seasoned perfectly and came with onions and cilantro with two slices of lime. My partner had the enchiladas and said that they were delicious! The enchiladas came with lettuce, beans, rice, and a couple of slices of avocado. The dish came with 5 enchiladas which was a lot for it being only 8 bucks, so it was a great deal! The place is connected with a convenience store which was a little weird, but hey..the food was great so I'm not complaining! Would definitely come here again, and I highly suggest you stop in for some tacos if you're searching for a good place right now!"}
{"text":"Bland and watery. 
We went for dinner and found food was pretty bland with not much flavor. The place wasnt that clean either. 
Chips and Salsa: Chips were good but salsa was so watery that it felt like they had poured water into left-over salsa to increase volume. 
Tacos barely had any flavor. 
Chicken fajitas were ok only."}
{"text":"The food was very good..fresh and authentic BUT..be careful if you order several different items. One goridtas, one sopes,  one quesadilla will feed two people. .that is my only complaint about the server..he could have said something..he understood we wanted to try different things..he would have gotten a better tip"}
{"text":"Friendly service, excellent food, and great prices! Having travelled to Mexico, this food is very authentic and comparable to high end restaurants there. In spite of the unassuming appearance, the inside of the restaurant is clean and comfortable.  I highly recommend giving it a try. Definitely check out the tomales - one of my favorites on their menu."}
{"text":"My bf and I decided to eat lunch here due to the rave reviews on Yelp and from friends. Unfortunately, we were disappointed with our experience.

We walk in and seat ourselves.  The server took at least 10 minutes to take our order. There were a good amount of folks already eating and enjoying themselves, so we assumed it was a bit busy.  My bf was trying to get the server's attention to no avail. When she finally came by our table, she apologized and mentioned that she forgot about us.

We ordered menudo, red tamales, steak taco, steak gordita, pastor gordita and enchiladas.  The food came out quickly, and yes, it was delicious.  Though our tacos didn't have as much filling to it like seen in the other Yelp photos. While devouring the food, we noticed how dirty the cups of water she served us.  We should've purchased bottled drinks in the front store instead.  

Other than dirty cups and bad service, the food was good.  Not great compared to other Mexican restaurants in town.  I'd go elsewhere."}
{"text":"Hands down the best mexican food in madison. It's tucked away in the back of a small grocery store at the end of a strip mall on Odana and everything on the menu is under 10 bucks, but everything is freshly made and the flavor is just phenomenal. I highly recommend taking the time to scout this place out!"}
{"text":"I'm always looking for real Mexican food in Madison, and I think I found it at Los Gemelos.  I ordered a chorizo taco, and it was one of the best I have had in Madison. I thought I would give their chicken quesadilla a try, and it is way better than the boring American style quesadilla.  The prices are very reasonable."}
{"text":"I love tacos, and I'm definitely coming back here for more. $2 a taco + no wait to sit down + pick your own drink from the grocery fridge + Mexican television in the background = pleasant afternoon. If you're going for tacos, I'd stick to the carne asada and al pastor. The chicken, even though covered with delicious cojita cheese, wasn't very flavorful. 

Even though there's plenty of room in the restaurant area and it's cool since you walk through the grocery store to get there, the atmosphere lacks a little - so you may not want to plan a romantic date at this Mexican grocery/restaurant. In that case, I'd recommend grabbing some cojita cheese and marinated beef from the deli to make those romantic tacos at home. 

Speaking of the grocery, it has some great items you won't normally find at other places, like Inka kola and tamarind soda. It seems a bit hit or miss though, but fun to look around. Nice selection of spices and candy."}
{"text":"Worth finding. Sure it's in the back of a poorly lit grocery store, but it's clean, inexpensive, fresh, and delicious. Grab a Coke from the fridge (the stuff w/ real sugar not corn syrup) or order a horchata. If you're a big eater, try one of the enormous tortas. It's a hot sandwich with your choice of breaded chicken, pork, or beef, topped with fresh tomatoes, avacados, lettuce, cheese, and mayo. Half of one and I'm stuffed.

The little gorditas with chicharones are another favorite. A small tortilla, stuffed with spicy, crispy pork belly, deep fried, then stuffed with fresh cilantro, onion, and a little cheese.

Or if you're adventurous, try something off of the menu in Spanish. They're happy to translate if you don't know what the items are.

Definitely one of my local faves and you can visit all you want without breaking the bank."}
{"text":"Best asada tacos in town, well unles they are homemade. I always have a craving for jarritos when I eat the tacos here. Yum!"}
{"text":"What a great little spot! The restaurant is attached to a Mexican grocery store and you wouldn't even realize it's there from the outside. The service was very good and the food was amazing! I had chiles rellenos which were perfectly cooked. My friend had a burrito that was enormous and apparently delicious. If you find yourself in Madison, give this place a try. I'll be back."}
{"text":"the typical hole in the wall joint that is packed by noon despite outward appearances. Pastor gordita was slamming, steak taco was good, chorizo sopes was tasty."}
{"text":"5 star update!  This is, so far, my favorite place for tacos in Madison.  If you're looking for tasty, authentic Mexican eats this is the place to get it.  

I went back a few times for lunch recently and left super satisfied. 

Here's how it goes:
1) walk in, head straight back and grab a beverage from the cooler.  Mexican coke, anyone? 
2) take a seat, any seat. And wait (sometimes a while) 
3) place your order.  3 tacos: campechano*,  al pastor and steak
4) eat
5) pay. 6 bucks. That's some cheap eats, friends. 

I recommend eating in so you can try their amazing sauces in your tacos. Everything comes out fast, hot and fresh. Everything I've had here has been incredibly tasty
Service isn't the best, but the food is so tasty that I don't care.  When you're done eating, check out the store.  You'll find some housewares, spices, groceries and even some of the meat you just consumed. Pastor meat, get it. 

I still need to get out there on the weekend to try their specials.  Barbacoa, pozole, carnitas and chiles rellenos are a few that come to mind.  

*the BEST taco in Madison. Chorizo and some crispy steak bits. Do yourself a favor and get this."}
{"text":"I don't understand how in the world this restaurant has such high reviews. We went in & were astonished at how dirty this place was. the menu was incredibly small. when the chips & salsa were brought to us, the salsa was in squirt bottles with crust built up all over it. the salsa was disgusting & they didn't even have queso dip! what kind of Mexican restaurant doesn't have queso? needless to say we walked out & didn't even order anything. AWFUL."}
{"text":"Absolutely the best taqueria in Madison! I didn't think there was a viable competitor to unseat Taqueria Guadalajara on S. Park St. in the cheap taco department, but lo and behold. The steak is amazingly flavorful without being muddied in a sea of clashing spices, the chicken is moist and slightly tangy from some type of citrus and the puerco al pastor is a great option if they are out of steak. Just, great."}
{"text":"Great, reasonably priced food. Nice and efficient people who work there. The attached grocery had everything you need for Mexican cooking. I'll always come back when i return to Madison"}
{"text":"Nice place.  Salsa was really nice.  Steak Tacos were ok.  Chorizo was better!  Service was really polite!  Nice place to stop and grab a bite."}
{"text":"My son got the Pechuga ala Plancha which was amazing.  My daughter had a quesadilla which she really liked. The meat in my tacos was tasty but very dry, making them a little tough to eat. My margarita and side order of guacamole was also good.

I've been in Madison over twelve years and never knew this place was rucked back here. I will be back."}
{"text":"I had the chicken enchilada with their home-made green sauce.  I loved the slices of fresh avocados on top.  Everything was very tasty and fresh.  I would also go with a 5 star food and 4 star ambiance and service.  The menu was less than informative. 
It is located towards the back of a mini-mall located perpendicular to Odana road. So, not really easy to find.  As you walk through the Mexican grocery story, you browse the beverages of your choice and take them to the table with you. I do plan on returning soon."}
{"text":"Very good authentic Mexican.

Location is sketchy AF and the diner/dining space ratio is also sketchy. Why it's so spacious beats me absolutely senseless. I have never seen more than 6 or so other tables dining in the 8+ times I've been here.

Other things sketchy about it is the atmosphere; eating in the back of a grocery store with quiet Mexican music in the background in an environment with almost zero noise. The water has been served to me in a pepsi cup, and even in a plain red plastic party cup that you would normally fill beer with. Yup.

The chips are also inconsistent. Sometimes they're multicolored, sometimes they're freshly fried; sometimes you don't even get any unless you ask.

But where's the fun in it if you know what you're going to get every time? I love hole-in-the-walls for a reason. Anyway.

If you speak even a little Spanish like me, use this as a chance to practice your Spanish! They find it amusing and will create a fun, comfortable atmosphere.

Contrary to what other people have said, IMO you CAN go wrong with the menu. Here's what I've tried:

-----

Tacos are good, but not mindblowing. I don't get why these are the most hyped thing on the menu.

Tortas are awesome. Lots of flavor. I love the milanesa and steak tortas.

Quesadillas are really good. Crispy, great cheese, and go swimmingly with a squirt of one of those salsas every couple bites. Pastor was really nice on this one.

The gordita was meh. Not really a fan. If there was no salsa, that thing would've just been bland.

The sopes and tostadas are nice too. They're loaded with meat and other toppings, and they go great with or without the salsas.

I would stay away from any of the plates. I've had one (I forget, it was some steak platter), and it was pretty mediocre. My friend came here with me for the first time and left regretting his decision after ordering one of the plates. One time I remembering ordering the chicken fajita special and it was very underwhelming for the $10 price we paid.

Actually, my advice is to stay away from chicken here in general. Just don't get it. It's just so much worse than the pastor, chorizo, and steak. When I go to Chipotle/Qdoba I always get chicken because it's way better than the other options, but the chicken here doesn't even beat fast food chain chicken for some weird reason.

Pambaso was not impressive. It's basically all starch. It's kind of like two giant pieces of spicy garlic bread with a potato and some chorizo residue mix slapped in between them. It tasted authentic for sure, but authentic does not always translate to tasty, contrary to popular belief.

-----

Anyways, Tienda Los Gemelos is kind of a mixed bag. They have a lot of good, tasty stuff, but some of their items are definitely underwhelming. Regardless, you'll definitely, definitely enjoy at least a few things there.

Go. It's cheap, authentic Mexican."}
{"text":"Came here to get some good Mexican food, and got exactly that. You get ships and salsa once you get seated and the salsa was perfect. I ordered the cheese enchiladas and they were fantastic! The enchilada plate came with 5 enchiladas, and for the price, it's an amazing deal. The green sauce on the enchiladas was very good. It was light and not too overpowering, but the flavor of it was amazing. The rice was not my favorite, but I am generally very picky when it comes to rice. Overall, this was a great Mexican place and I really wish I lived in Madison so I could go here more often,"}
{"text":"Went there for dinner with the family.  The prices are good but the food was not.  Got my order wrong the 1st time.  I got the tostadas with chicken and it had no flavor at all.  Not sure why people say this is the best authentic Mexican restaurant...its not.  Also some teenager was coming around to all the tables trying to sell stuff.  I do not want someone bothering me while I am trying to eat.  I will not be going back.  I do have to say the service was good and the people were nice."}
{"text":"Having grown up in Texas and then lived my adult life in California, I was skeptical about finding good Mexican food in Wisconsin. I tried this little gem out today and was blown away! Not only is it adorably quaint inside, but our server couldn't have been sweeter. She made guacamole for me on the spot, even though they don't typically even serve it on the menu. The tacos were amazing and everything was so fresh. They will definitely be seeing me on a weekly basis!"}
{"text":"Sopes Pastor, yum.

Totally delicious marinated pork with Mexican cheese, lettuce , tomato and avocado. Very filling for $3.50. Mango Jarritos soda, a real treat. Next time I will eat a burrito. Looked large and the one sopes was plenty.

Rustic but comfortable. Mexican TV in the background. Restaurant portion of store hidden in the back.  Tricky strip mall to find. Worth the effort.
5 star food, 4 star ambiance and service."}
{"text":"Note that, as per other reviews, this is hidden in the back of a grocery store. 

Very good tacos, with a very good price. Service can be a little slow, and ambience can be lacking, but you're not going to get 3 tacos of this quality for 6 bucks anywhere nearby. 

Also, they have solid Horchata so don't miss out on that!"}
{"text":"Arrived around 2pm on a Sunday afternoon and the place was packed. Took around 50 minutes to get our order of steak fajitas, pork tamale, side of guacamole, 3 tacos (steak, chicken, pork) and Gordita (potato and chorizo). Waitress was nice but man, that's a long time to wait for food like that. 

Fajitas were just okay, more veggies than anything, lacked flavor (and salt), tamale wasn't good, but the proportion of meat to masa was admirable, gordita was okay, and the tacos, especially the steak taco, were delicious. I will go back for the steak and pork tacos. Chips and salsa at the table prior to meal - chips from a bag, not hot and fresh, green salsa, lots of heat and cilantro and fresh tomatoes. 

The guacamole was very good, freshly made, and only tomatoes, onion and cilantro with ripe avocados. The chips that adorned it were considerably fresher than the ones at the table. 

The beans were okay, the rice was terrible. 

It is definitely hidden; I knew about La Mestiza which is nearby (across the street) but you'd have to know this was here to even go looking for it. 

I'd likely go back for some margaritas and the steak tacos but that's it. There are other comparable authentic Mexican places in Madison - like Los Atlantes and Taqueria Guadalajara."}
{"text":"Grab a cold drink along the way as you pass through the grocery store. Seat yourself. Grab a menu.... order some tacos or menudo on the wkd. Food is good and priced right. Bring some cash to tip."}
{"text":"Good!  Much better in fact than I expected given that this restaurant was at the back of a grocery store.  The service was good, the food well priced... my only complaint was that the flan I was given had over curdled and lacked that luxurious creme Brule like consistency that I craved"}
{"text":"We've been to Tienda Los Gemelos several times. The food and the prices make it one of the best options for Mexican in Madison.

It would be difficult to just stumble across Tienda Los Gemelos. It's tucked away in the back of a strip mall which is perpendicular to the road. There is no signage to let you know it's back there. If you are like us and looking for it based on the address it can still be hard to find. Once you have found it, you'll see a small Mexican Grocery. Walk through the grocery and you'll find a substantially large restaurant next door. It's seat yourself and pay at the counter afterwards.

The service is fine. Some of the staff are more friendly than others. The chips and salsa are included. Both are fresh and tasty. The menu has a lot of options you don't see at the usual Tex-Mex restaurants. There are various tacos, tostadas, pambazos, gorditas, sopes, quesadillas, and tortas as well as plates such as Bistec a la Mexiana or pechuga a la plancha. Absolutely everything we have had there has been delicious and reasonable priced. On our last trip I had the bistec encebollado. The beef was wafer thin and the flavors were phenomenal. The rice was fluffy and the beans creamy. I really enjoy the food. The Horchata is delicious and we've always been pleased with the margaritas.

Try Tienca Los Gemelos. You're sure to be pleased."}
{"text":"I can't imagine I didn't find this place for this long. Thank you yelpers for the recommendation. 

The restaurant is tucked nicely inside of the grocery store. It's real deceiving how small it looks from outside. It's a huge space inside. Very authentic charm to it. The menu was big, colorful and staff was very attentive. Even with some rush, we were served right away. 

We tried taco, gorditas, sopas and quesadillas. Everything we ate was excellent. I wanted tongue tacos but they ran out of it at 3pm... so I ordered steak instead. I am reluctant to give 5 stars just because their salsa wasn't as great as I have had at other Mexican restaurants in Madison. The chips wasn't made to order fresh as well. 

We would sure go again to this place. Anyone who likes a good authentic Mexican cuisine, must give this place a chance. There's plenty of space for huge groups as well."}
{"text":"Awesome authentic Mexican restaurant. The restaurant is connected to a Mexican grocery store which is a plus in my opinion. The store offers fresh produce with a meat counter. After entering through the store, you will find  a pretty large restaurant seating area. The restaurant also has a bar. Upon seating you receive complimentary chips and salsa verde. I love salsa verde, and I thought the one served was excellent. It was very fresh and had some heat. We also ordered guacamole which was very good too, and fresh- just needed a little salt. I got steak tacos and a steak tostada. I thought they were really good, the tacos were very flavorful. They are served authentic with cilantro, onion, and a side of lime. The tostada was also awesome. No complaints, the toppings on my tostada included fresh cheese and avocado. Everything here seemed fresh and was delicious. I also tried a bite of the pork taco and chicarron gordita. They pork taco was very flavorful and moist. The gordita was perfectly crispy and stuffed full with filling. Also very cheap and service was great. The staff in the restaurant and store were very nice and welcoming."}
{"text":"Oh so close to five stars!

Really, not much to complain about here, classic \"tienda taqueria\"--head to the back of the store, grab a drink from the cooler, and prepare for some great Mexican food. Priced on par and above average for quality compared to other Mexican restaurants around town. 

What liked--low key atmosphere, the sauces in the table were both very tasty and spicy (maybe too much for some folks). I sampled four tacos, asada, chorizo, pollo and carnitas. I'd highly recommend the asada or the carnitas, with the carnitas being my favorite. Not crowded at all for dinner (sounds like it could get busy at lunch). 

What missed the mark? The pollo taco was unremarkable, and everyone at the table thought the food needed more seasoning. But the real sadness was that they only have lengua on the weekends! The lengua taco is the benchmark dish for me, so I'll stick with four stars until I get back on a weekend to try them out. 

I'm also strangely interested in trying the chicharron prensado..."}
{"text":"Still loving this place. Our family calls it our taco place near our secret ice-cream spot, La Michoacana, across the street. I think we're regulars enough that we don't have to look at the menu anymore and the waitresses know we like having waters right away. Once in a while, we'll grab a Fanta from the coolers. I'm surely and slowly introducing this sweet spot to friends and all seem to love the tacos pastor (marinated pork tacos). 
Saturday mornings are the days you can go in and buy fresh-made tamales by the bag for $14 for 13 mix-n-match red/green tamales. Go early in the AM (opens around 10am) to get them before they sell out. Sometimes, if you're late, they might have leftovers in the freezers and you can by them singly for $1.25 each."}
{"text":"This is indeed a hidden gem. I don't really care for the grocery store, but crawling all the way through to the back, you'll find a quiet and small restaurant. 

And boy can this small restaurant serve the most amazing and authentic Mexican dishes ever! And cheap, might I add! My first time at this place, I ordered 5 things on the menu, came out stuffed, and yearning to go back again. Whatever cheese they use must be fairy dust. Whatever taco shells and starch wrappings they use must be magical runes. 

Do not let the looks of Tienda Los Gemelos deceive you. Because if you do, you will surely miss out on the magic carpet ride."}
{"text":"Authentic Mexi food at its best! Service at the restaurant I would give 2.5 stars, but the food is a 5+ and very authentic.  And I love authentic.  If you love authentic Mexican dive restaurants then this is my newest favorite place in Madison to go."}
{"text":"This is the best authentic Mexican restaurant in Madison. My wife and I have been to many other Mexican places in town a none compare to Tienda los Gemelos. The food is delicious and cheap, what more can you ask? The service is really friendly. The place might not be the nicest but it's decent. It's family friendly though.

I recommend coming on weekends as it's the only time they have carnitas and barbacoa available as a meat choice for any plate. On regular days they only have steak, chicken and chorizo. I ordered a gordita and sopes. Both were full of meat. My picture is a little deceiving as the gordita looks kinda empty but believe me it was full of delicious carnitas. They also offer chicharrón as an option for your food. For those who don't know chicharrón is pork crackling, it's oh so delicious! This is the only place I've found in town that makes chicharrón. The one thing that struck me as odd was that they don't have guacamole which brings me to my next point -- their great service. They offered to make guacamole for me even though they didn't have it on the menu. They also prepare your food really quick, I think we waited less than 10 minutes for our plates. 

I've already been here twice and plan to keep coming back for their great food!"}
{"text":"By far the most authentic Mexican dining experience I've had in Madison. 

Walking into the grocery store, you soon notice the huge dining area in the back that takes up most of the place. The rules there a bit unconventional, though. First off, you seat yourself - then an attentive server will approach. Second, if you want something to drink you can pull a soda or beer out of the grocery store fridge and take it back with you, the servers can get you water. Third, you pay up front and tips are left in a box by the register. 

Now, THE FOOD. Oh my. So great. 

Everything from the quality $2 tacos to their main entrées tastes amazing! The flavor this place offers is reminiscent of great family cooking - Mexican style. In the back you can find a clean kitchen with several authentic cooks at work making your food just like they do back home. You can almost taste the love. 

Another big thing to mention is their weekend-only tamales. I haven't had any in WI so far that could hold a candle to the one found at Los Gemelos. You deserve to do yourself the favor of stopping by on a Saturday or Sunday to snag some up. They go quick!

So in short - authenticity, huge portions and great prices are what makes Los Gemelos such a great spot. Also treating yourself to some imported candy or chocolate on the way out is a great idea (go for anything that says Kinder!).

Stop by for lunch, you won't regret it one bit."}
{"text":"Updating my review the final time after having Chili Rellenos;

Very good food and very fast service. Also has quite competitive prices considering the food quality is a good authentic-style. There isn't much I don't like about this place."}
{"text":"Nice traditional (I suspect authentic) Mexican shop/restaurant. I went twice now and the tacos are really nice and filling for the price (~2.5$ each). You can grab imported drinks from the fridges for very reasonable prices and the staff is really friendly. They also serve complimentary chips and (really hot) salsa; they taste very nice. My friends seemed to like their other orders as well. 

Only thing, the place is extremely unfriendly for vegetarians, so I won't go with my wife."}
{"text":"Great Mexican Mexican in the back of a pretty decent mexican grocery.  

If what you want is traditional mexican food, served in a slightly run down and beat up store, this is your place.  Full Bar.  Salsa's are on the spicy side, fyi.

I would give the food a 4, but since they have the full grocery, it gets bumped up.

If you want super clean and neat....well....It's clean enough."}
{"text":"The first sign this place is gonna be authentic is the fact that it's tucked into the back of a grocery store. The next sign is that they serve their tacos correctly, with soft corn tortillas. 

Additional notes: You can pick drinks out of the cooler in the grocery store, though they do have Horchata at the restaurant. Their quesadillas are not made with flour tortillas, but more like corn meal dough - fatty and delicious! 

Oh, and the staff there has always been ultra-friendly and polite. 

My favorite Mexican restaurant in WI."}
{"text":"Stopped in on the suggestion of a coworker. If you're looking for a fancy setting this isn't for you. The tables are wobbly, the restaurant is kind of dark and outdated BUT If you're looking for fair priced authentic Mexican food then you'll probably love it. This is THE definition of a whole in the wall. It's a tiny little Mexican grocery store that has a walkway which opens up into a rather large dining area. The food is superb, AUTHENTIC MEXICAN and fast. The staff does NOT SPEAK ENGLISH, so if this is a problem for you then I suggest you crawl back into your bubble and go eat your Taco Bell. You seat yourself. The menu is small. I'll definitely be back though. It's right across the street from La Michocana ice cream in the strip mall (but facing perpendicular from the street)."}
{"text":"Yes yes yes. The tacos! I typically go with steak or chicken, and they are served how tacos should be - corn tortillas, cilantro, lime. As others have mentioned, you have to walk through the grocery store to get to the dining area, but it is so worth it."}
{"text":"restaurant portion is tucked back beyond the store.  Seating is a lot more ample than I read elsewhere in a review.  Soda you do get from the cooler and may not be ice cold.  We waited to order from a waitress, and waited a short time. The wait for the bill was horrid! I don't think I have waited this long ever. I went up to pay versus take more from my day, they seemed startled that we were ready to go.

The wait for food was not terrible long.  Food was good, but greasy; if that's what you like, then go for it. Cheese enchiladas were not filled too much, so lots of extra tortilla.  Place filled up with other diners around 2pm, I could tell they had been there before.  Not many options on the menu, but sometimes that is better!"}
{"text":"Stopped in because I was in the area. The service here is very attentive and the food is truly authentic and definitely 'muy bien'.  I had a pollo and al pastor taco with a steak gordito. All of it was gone within minutes. The salsa is home made and probably one of my favorite parts of the meal!"}
{"text":"damit! this is my favorite hidden gem for mexican food in madison. hands down the best tostadas, margueritas, burrittos and soups i've ever had. authentic and delicious. that being said....its becoming more and more popular, which is great for them- but has made waiting times longer. oh well. they deserve it."}
{"text":"Great food, fast service, no frills place to just come in and grab a quick bite, and surprisingly inexpensive (to the extent where I wonder how they manage to stay open.)  

Another place along Odana you'll accidentally drive by.  Great tacos and chicharrones.  I'm sure there's lots of other good things on the menu, but I ordered these the first time I came, and I've been perfectly happy to stick with these each time I come in."}
{"text":"Incredible food!! One of our staple places to eat. The lamb on the weekend is to die for and I really love the gorditas."}
{"text":"Been here several times, and every visit has been more than worth the trip. Try the quesadillas. They are unique and wonderful"}
{"text":"This was the Best Taco I have ever had..while I am a lover of tacos..I have never tried the pork...The meat was so tasty.. We will now make it our business to try everything...Don't be intimated by the outside.. This food would taste wonderful no matter where you ate it!!!"}
{"text":"I absolutely love this place! The prices are super reasonable. I have had their potato and chorizo and shredded chicken gorditas, their pastor pork on the sope was amazing and super flavorful and that thing on its own is filling for under $4, their quesadillas were a bit different than I have had before, they were deep fried and looked like a taco, but boy were they cheesy! I had the quesadilla with shredded chicken and it went well with it. Last time I ordered the shredded chicken over a sope it was bland and not as flavorful as my second time around. Their milenesa plate is by far my favorite dish they have.

Their horchata, micheladas, and salsa are all yummy. The restaurant is on the side of their store. Lots of goodies and fresh bakery goods at the entrance. Good views of the televisions from the seats, but both times it was a show that was in Spanish. There is a bar area in the corner that doesn't seem to be used much. 

Don't forget to grab a $1.50 paleta ice cream on the way out. One of my favorites is the rice cream - horchata on a stick."}
{"text":"I have found a competitor for best Mexican restaurant in Madison! It functions as a grocery store as well, so I can buy some Mango Juice when I have cravings.

I went with the Bistec Encebollado, which is enough food to feed a small Mexican family. I decided to add a steak taco and gordita pastor to it, because why not. Massive portions, very tasty and the price was so cheap! I will most certainly be back!"}
{"text":"Best Mexican food ever! 
All of my Hispanic friends recommended this place to me and I'm so glad they did! 
The food is delicious, the service is great, also the store in it is awesome. The man who works here is so kind, and helpful. I love getting the aloe drinks and eating it with the delicious meal. 
I recommend the tacos, tortas, Mexicana ala carnitas (I think I spelled that wrong), and the tortillas are cooked perfectly. 
You have to come here and try the delicious food!"}
{"text":"This place is outstanding, authentic (I think) mexican food that everybody should enjoy.  Big fan of the gorditas campachano. Walking through the grocery store adds to the experience.  Tough to find, but well worth it.  About the same price as Taco Bell, and SO much better."}
{"text":"Very authentic. I was a bit confused as they did not offer beverages in the restaurant but you had to buy them in the grocery store. Still one of the best authentic Mexican restaurants in Madison."}
{"text":"If you are looking for real Mexican food, this is your place. The burrito was huge. Very good and very authentic."}
{"text":"This place is legit!  It came recommended and it lived up to it. I had the pastor taco and Gordita and they were awesome. The Gordita was the better of the two. My companions ordered the chicken burrito which is massive but the chicken was bland and left a lot to be desired."}
{"text":"Truthfully, I'm hesitant to even write this review because I really want this place to continue to be the best kept secret in Madison.  It's seriously a hidden gem - located in the back of a small Mexican grocery (grab your soda from the cooler on the way in), it opens into a large dining room that you couldn't predict being back there!  Food is awesome - my go to is the chicken enchiladas.  Sounds ordinary but it's not - the shredded chicken has a certain something - flavorful, juicy and covered in your choice of delicious red or green sauce (I always go green).  The plate comes with rice and beans - the rice is good but the white beans are a unique twist on your traditional mushy brown kind.  My husband always gets 6 tacos (street style) - the campechano (steak & chorizo) are his fave.  The tortas are huge and delicious.  The real star of the menu is the quesadilla.  Not the sad, flat grilled cheese kind - an oversized, crispy, stuffed (with your choice of meat & cheese) boat-shaped deliciousness that is super tasty.  

Service can sometimes be slow but who cares, stop rushing things and enjoy the experience.  And don't tell anyone else about this place!  It's our secret :)"}
{"text":"This place is a little bizarre. Enter through the Mexican grocery store next door. The restaurant itself is WAY too big for what it is, and often empty. The menu could use some work, and the decor leaves much to be desired. The service is just so so. 

So why am I a fan? Because their tacos are delicious. Their tortillas are definitely the best in Madison. They're soft and warm and two tortillas per taco as it should be. Tacos go for about $2, and three tacos is more than enough for me. I had the carne asada, the chicken and the a pastor. The al pastor is not my favorite, but tasty and flavorful. The carne asada is among the best I've had in Madison. The chicken taco was quite dry even with a good dousing of salsa.

I took a quick peek through the grocery store next door before I left and noticed that they sold marinated pork in the meat counter. Hooray! I'm hoping they'll have carne asada too on some days."}
{"text":"I'll affirm other reviews. Food was delicious, reasonably priced, and the service was friendly.  We will go back for sure.

The Bistec Mexicano was wicked good."}
{"text":"This place is amazing and I'm glad we took the time to drive around looking for it. I got the pozole and hubbie got a gordita taco and quesadilla. Fantastic! We are absolutely coming back."}
{"text":"Came here on Sunday morning for breakfast- had the posole. Steaming hot, served with radishes, shredded lettuce, lime, crunchy fried tortillas, and onions on the side. So full of flavor, chunks of pork, posole (hominy), and a red chile broth. Big serving, enough for 2 if you want to order another dish. I ordered a steak quesadilla and it's unlike any quesadilla I've eaten before. This was made from masa, not a regular corn tortilla, deep fried and stuffed with your choice of filling, with cilantro, shredded lettuce, and queso (cheese). Sabroso! Two weeks later, I'm still thinking about it."}
{"text":"If you're looking for some excellent authentic Mexican food, you need to come to this restaurant! 

The BEST Mexican restaurant in Madison. Service is efficient and the perfect amount of niceness! Only thing to be prepared when coming here is that it is inside/connected to a grocery store - which you have to enter through. But as you head towards the back to the restaurant, you'll be surprised at how big the actual restaurant is!

Esther's favorite: the pastor tacos!"}
{"text":"When it comes to ethnic restaurants, having people of that ethnic group approve of a restaurant is a pretty good sign. The last time I had a taco as delicious as the ones I had at Los Gemelos was at a taco truck in San Francisco. It was at night, after all the Mexican laborers in the area were off work, and the owners of the food cart didn't even speak English - I had to have a friend to order for me.

Los Gemelos is located within a grocery store in a plaza that specializes in ethnic foods and services. Walking inside, I could remember how, when I visited Mexico, the warm Gulf air would breeze through the palm trees as men sat in front of their shops waiting out the scorching noontime sun. There were burly Mexicans standing outside chatting in a staccato Spanish. In the store, you can buy authentic Mexican candy, and the Coca-Cola there is made from actual sugar instead of corn syrup. Stepping inside the restaurant, I was greeted by the elderly matron of the establishment. The menu was short, with the Mexican equivalent of comfort food. Soccer was being played on several televisions, and occasionally a long, drawn-out bellow of \"GOOOOOOOOAAALLLLL\" from the announcer would punctuate my meal. I came an hour after they opened, so there were very few people, but I can imagine coming here for to pick up a few tacos for lunch. For me, it's not how complicated or elaborate a meal is that makes it good. Simple is fine, just do it right. And here they do it right. This is Mexican food by Mexicans, for Mexicans."}
{"text":"A little leery of decent food in a storefront location but the quesadilla was really tasty, not doughy at all.  They really mean it about go get a drink from the grocery store, but they serve margaritas too.  I'll come back."}
{"text":"Once you walk through the doors you're transported to authentic Mexico.  In fact, this may be one of the most authentic restaurants in Madison.  

The breaded chicken torta blew my mind.  Really, really good.  Its $8 and it can easily feed two people (I like to eat and I didn't dare finish it).  

I haven't tried the tacos or the rest of the menu but the cooks look like the real deal.  

The grocery store has a surprisingly huge array of meats in its deli.  They looked fresh and the prices were cheap.  

I'm excited about this place.  You will be too.  Check it out.  I'll be back soon."}
{"text":"Authentic Mexican.Slow service but food is great. Reasonable pricing. I usually get their tacos and Bistec encebollado."}
{"text":"Service and food was a bit shaky on my last visit.  For those that are unfamiliar, the dining room is attached to the grocery store (just walk thru it to get there).  You order at the table but pay at the counter. 
I opted for the Pechuga ala plancha aka grilled chicken breast with salad, avocado, rice and beans.  The entree arrived with sauteed onions on top and contained a few small breasts.  I thought it was solid but afterwards my tongue and lips starting tingling which gives me thought that someone had a heavy hand with MSG.  If that was the case, not cool (nor needed).
My business partners opted for a few tacos pastor.  What they got was steak-dry  at that.
I had better dishes in my previous visits so perhaps they just had an off day.  But if this is the new standard in which they operate, there are too many other options in the Madison area to warrant a return."}
{"text":"Amazing place. Walked through the quaint grocery store and sat in the huge restaurant area for dinner and felt a bit intimidated since everyone in the restaurant seemed to be speaking only Spanish (and the TV was on a Spanish channel). However, our worries were quickly dispelled when they told us to seat ourselves without a second glance or any strange stares. We tried two tacos (one steak one pastor), a steak sopas, two tostadas (one chicken and one pastor again), and a chicken quesadilla. We were immediately given a basket of chips and salsa and homemade guacamole (!!!) which was such a nice start! 

The tacos and tostadas were out of this world (at such fantastic prices too). They were the most authentic that I have ever had and just plain delicious. The tostada was crunchy, fresh, and delicious with peels of cheese and lettuce on top. The tacos were also delicious and the contrast of the crunchy onions worked well with the tender meats. I would say the lime/sauces are necessary to have a citrusy contrast to the heavy food though - go liberally on the sauce bottles. The meats were also very well spiced and extremely tender. The sopas wasn't my favorite (just a personal preference) since I felt that the thickness of the vehicle was a little too heavy for me to handle. I also personally would not get the chicken quesadilla again since it wasn't to my taste (it was fried and deliciously greasy, but that made it somewhat difficult to eat and wasn't what I was expecting). However, they were all very authentic and well made and I'm sure others would enjoy them.

In the end, all of the prices were so incredibly cheap that you want to leave a generous tip for being left so full. We only managed to finish half of our food and took home the other half. Definitely coming back!"}
{"text":"My daughter had the authentic tacos with the green sauce and they were fantastic. I had a mix of the beef and chicken tamales. Kicked it up with the green sauce on the table. Complementary chips were also very good and fresh. We will be going back.  ¡Una comida maravillosa!"}
{"text":"I went there today for lunch and had the Mole Verde which was very good with nice heat and fall off the bone chicken. I had a tamarin soda, not quite sure what it was but it tasted good. I really like the low key local feel. The staff was very nice and it took about an hour for lunch, might of been shorter but it took Papa and me a while to figure out to pay at the counter. We tend to be chatty so there was no surprise on that one. It was fun to cruise around the mercado and listen to Papa question the staff on how to say certain things in espanol. I am looking forward to going back and trying more stuff, maybe I'll find another flavor of soda I can't identified and be delighted by it."}
{"text":"Excellent food, reasonably priced, and fresh meat from their deli. Los Gemelos is as close to authentic as you can get. The al pastor and chicken definitely hit high points if you go for any of their tacos, quesadillas, or gorditas. So far I have not had anything outside of their a la carte offerings, but I have been satisfied every time I've gone."}
{"text":"The food was phenomenal and I loved the fact that we had to walk through a grocery store to get into the restaurant. My only complaint was that it was a little unorganized, we didn't know if we should seat ourselves or wait to be seated, it took two requests to get a glass of water, they forgot to bring the rice we ordered, and we had to go up to the register to pay any request a to-go box. Only taking down a single star though, because we loved our food!!"}
{"text":"You know it's going to be good when the daily specials board is written in Spanish. This place is the shit for tacos and gorditas. One of, if not the best places in town to get cheap Mexican food. Service is OK. 

It's also half a grocery store and has a lot of Mexican imports and cheaper cuts of meat. The drinks on the menu are basically \"whatever you find in the store\" which is confusing since you dont know who exactly to pay for it and then if you need a bottle opener you have to track down the waitstaff who aren't always around. Small price to pay imo, but some people might get salty about it."}
{"text":"All I can say is . . . Wow! Yelp has hit the nail on that head once again.   In town for a conference and did a little shopping.  I looked for a nearby place and this popped up.  

True to other reviews, the green salsa was excellent with some spice to it.  It definitely wasn't one of those tomato bland salsas.  The chips were good with just enough salt.

I ordered a steak,  chicken,  and pork taco.  Each one was very tasty and served mexican style.  I added the green salsa and thoroughly enjoyed every bite.   I also ordered a side of beans and rice.   The rice was excellent.   The beans looked a bit different and tasted good.

Like others said,  back of the grocery store and grab your cold drink out of the cooler.  Overall, a really good meal that was tasty,  flavorful,  and quick. 

I will definitely be back again!"}
{"text":"This place is awesome! It is super cheap and extremely authentic. I've been too many authentic mexican restaurants and I think this is the most authentic/tastiest one I've ever been to. The prices are so cheap! Definitely get their tacos and tostadas (those are the best things). I will definitely be coming back. The environment is very relaxed and the waiters are super friendly.

The chips at the beginning are always a plus!"}
{"text":"I've been to the downtown location when I was a student, and I wasn't impressed at the time. Now that I work on the West side, my coworkers and I come here for lunch on occasion. I'm much more happy with this location! 

First off - this place may be a bit tricky to get to. The front of the restaurant is a store, so at first we weren't sure if we should go in, or find another entrance. Just go on through the store, and you can either turn into the restaurant by the drinks, or go all the way to the end to get to the restaurant. Very spacious seating, and there's always tables available. 

Food - very very good. My first time here, I ordered way too much. While I have a huge appetite, two tacos, a gordita and a quesadilla quickly becomes a lot! The food was hot and not too greasy. Generous amount of filling, and the ingredients were fresh. Very reasonably priced as well. 

Tip: get the steak and el pastor tacos!"}
{"text":"Eep I ate WAY too much.. ordered a sope, a quesadilla, and a tostada. I will agree with everyone here that the food here is quite authentic, tasty, and affordable. 

What I loved:
- Super fresh toppings- loved the cheese, tomatoes were juicy and not soggy, avocado was wonderful!
- Extremely affordable and a ton of food!
- Lots of space to hang out if eating in
- AMAZING packaging for take-out. I was worried my experience would be compromised because I was ordering for take out.. the package it so nicely that it is still able to stay fresh!

What I ordered:
- Tostada al pastor: was a little on the salty/heavier side, but I can see this dish being very enjoyable for someone who likes flavor. Also, Pastor may potentially taste better in a taco or another dish with more wheat to meat ratio
- Sope (for those who don't know, some explain it as a \"Mexican pizza\") campechano was also delish- very fresh avocado and really nicely prepped
- Quesadilla with potatoes and chorizo - Yummy! Flavorful! :) .. A little less \"interesting\" in terms of the mixture of flavors compared to the other dishes, but I really liked the crispiness of the quesadilla. Will be trying this with other fillings next time!

This is my personal preference, but I felt that the sope and tostada were a little on the dryer/tougher side for me- It was crispy but a little too hard and just wasn't my cup of tea, so I plan to be ordering tacos next time.

Overall, great staff, yummy food. Had my dishes complemented with some yummy green sauce :) .. I guarantee you will be full! I was pushing it with three entrees.. probably will go with two tacos or one larger dish next time..."}
{"text":"I've been to la tienda y la taqueria a few times now. The tacos are a must, along with the Mexican cokes and futbol jerseys. On my most recent visit, I was surprised to see they've expanded the dining room and added a bar. Unfortunately it was a work lunch, my name isn't Corey and I don't work for Yelp, so trying the micheladas isn't part of my job. Bummer. However, the torta milanesa was nonetheless intoxicating, beyond its bigger-than-my-face size and onto its tender, breaded and seasoned chicken, fresh avocados and tomatoes and lightly toasted roll. Perfect food-coma lunch. Probably a good thing I couldn't have that michelada after all. Go at a time you can get both."}
{"text":"I've been to this local Mexican grocer/restaurant a couple times with my family. If you're looking for some great Mexican food, don't hesitate to stop and check this place out!

On both visits, I had the Torta Chicken Sandwich and it is awesome!  It's a very large portion of food with jalapeños, avocado, and a great salsa. This is one of my go to meals at Mexican restaurants when it's an available item on the menu. This one ranks right up there and I would highly recommend it. 

My daughter has gotten the quesadilla both times and it is good, but don't expect your typically quesadilla. This one seems deep fried, which is a bit different than she is used too, but still tastes good. 

My wife has gotten tacos and tamales, which are excellent as well.  Chips and Salsa are great!

I honestly can't say a bad thing about the place.  Don't expect a fancy restaurant as its not at all, in fact it's a restaurant in the same building as a grocery store, but you can expect a great traditional Mexican meal!

I can't wait until our next visit!"}
{"text":"The green salsa is pretty awesome like the other reviews say! Service is fast, and staff are friendly. My tacos were a bit greasier than I'd like, but otherwise packed with a bunch of flavor and decently priced. I wasn't a big fan of the campacheno (mix of steak and chorizo) but el pastor is always yummy."}
{"text":"Mexican street food at its best (makes you wonder why anyone would eat at Taco Bell, Laredo's, or any of those horrid other places where everything is slathered in grease and cheese...)  Just like many good Chinese restaurants are full of Chinese people and has servers that may or may not speak English, this place is the same way (just with Mexicans speaking Spanish).  This place has put me on a mission to try the other \"real\" Mexican places around town.  As others have noted, couple of oddities:

(1) Get your drink from the cooler on the way back (though one time the waitress told us about a special drink they had that day that was not on the menu-- I forget what it was, but it was good!)
(2) You can (now) pay with credit card at the restaurant (you used to have to go to the front counter) but you can't put a tip on the credit card (so, tips are cash only!)
(3) Last couple of times I was there I'm not even sure they bring you your bill to the table-- so, when you're done, just go up and pay.

One of my kids is a picky eater (to put it kindly) and they have \"chicken nuggets\" with fries that fits the bill for him (the nuggets were horrendous when I tried one, but my kid likes them, and also likes picking his drink out of the cooler....)  Both kids like the goofy Mexican sitcoms that are often playing (in Spanish) on the TVs."}
{"text":"Bland food and crappy service. We did not feel welcomed coming in. Dirty walls and decorations. No mild red salsa."}
{"text":"The food was reasonably tasty, but I regretted eating it 24 hours later. The kitchen practices must have been as lackadaisical as the service was, underscored by a chunk of gristle in my desultorily delivered steak quesadilla. Disappointing, to say the least."}
{"text":"Outstanding food. If you are looking for the real deal Mexican food I would strongly recommend this place.   Two carne Asado Tacos filled me up.  The salsa is salsa verde and awesome.  Spicy .  And I don't mean Wisconsin spicy!!!  You know what I mean."}
{"text":"Local taco goodness. you really can't go wrong here,  this is a no frills neighborhood joint that serves up the closest thing you can get to Mexican street tacos.  I love this spot for their authenticity and their service even when their a bit slammed."}
{"text":"When I moved to Madison I was disappointed at the lack of real Mexican food, until I found Gemelos.  The restaurant is great, and so is the tienda.  I highly recommend the quesadillas compechano, the sopes, gorditas, or the pozole!"}
{"text":"The chips seem fresh and the salsa is very good. It's plenty hot, so I don't even need to ask for a hotter salsa! Thus is a sure sign the food is not as Americanized.

I had three different corn tacos: pastor, campechano (steak with chorizo) and pollo. The lime and cilantro made each even more delicious. Thank goodness for Zomato for turning me on to this place! I will be back."}
{"text":"Serving up serious Mexican biomass

Needing to burn a couple of hours while my daughter attended a birthday party at Ultrazone, I decided this was the perfect opportunity to partake in the grocery store slash taqueria that is Tienda Los Gemelos.

Hats off the the previous reviewers that confirmed that there actually is a restaurant in the back of the grocery store.  That fact is not readily apparent when you first walk through the front door. Despite a modest looking storefront, the dining area is rather substantial.  With its dark walls, black ceiling and scant natural light, the interior of the restaurant could easily double as a set from the move From Dusk to Dawn. And while I was disappointed there were no Santánico Pandemónium sightings during my visit, the steak tacos did live up to their star billing.

Once I got settled in my booth, the server dropped off a small basket of chips, a small bowl of guacamole and two bottles of salsa.  The chips were remarkably average, crisp but under seasoned.  The quac was more of an avocado puree, a disappointment to this chunky quac enthusiast.  The red salsa was liquid fire - I tried it twice and both times it numbed my mouth for five minutes.  I like hot, but I prefer being able to taste my meal. The salsa verde was my favorite of the three condiments.  Though a little too watery, it was freshly made and it was a great addition to the rest of my meal.

About five minutes after I was seated, I received my dinner entrees.  The $2 steak taco was as good as advertised.  The steak was crispy and well seasoned and  the corn tortillas were off the press fresh.  Topped with finely diced onions and cilantro, this was quintessential Mexican fare.

The other two entrees were good, but did not reach the exalted heights of the steak taco.  The pork in the $2.50 pastor gordita was under seasoned.  It needed a healthy dose of the salsa verde and fresh lime juice to bring out the flavors.  The masa harina shell of the gordita was seriously good.

The $3 cheese quesadilla at Tienda Los Gemelos was a vast improvement over what you normally find at most Americanized Mexican eateries.  Rather than your standard thin layer of shredded jack cheese (or mozzarella - horrors!) pressed between a pair of corn tortillas, this baby featured a crispy masa harina pocket crammed full of melted Oaxaca cheese.  Like the gordita, this dish benefited from a healthy dose of the salsa verde.

Just a head's up that your server will not leave the check at your table once you finish your meal.  You''ll need to go to the cashier and they will retrieve your bill.  

I left Tienda Los Gemelos with a smile, a full stomach and a relatively full wallet, since my Mexican feast only set me back $7.50.  Good times, good times indeed."}
{"text":"Oh my goodness this place is exactly what I was looking for. After living in Texas most of my life, I needed a meal that would transport me closer to home and this place has it. 

From the store front entrance, you know you are walking in to a true Mexican restaurant. The sight of brightly colored pan welcomes you in. 

There is plenty of space in the restaurant for you and all of your friends. The horchata is on point and strawberry margaritas will knock your socks off. I've tried many items on the menu- all are delicious and authentic- and when you just want a simple street taco, this place does the trick. 

Very well priced. Worth going to again and again."}
{"text":"Campacheno (steak and chorizos) chimichanga... was to die for. Best Mexican restaurant that I have been to in a very very long time. To go, Order in, it was so authentic and amazing."}
{"text":"Los Gemelos is my go-to taco joint at the moment. Usually I get takeout, but I laugh at the general concept of the place, which is tucked in the very back corner of a strip mall, has a grocery store in front, and a huge gigantic restaurant space in back. 

The tacos are good, but if you branch out and try your carbs in the form of gorditas and sopes, you will be pleasantly surprised. I'm not positive but I think they make the masa for these little guys themselves. The gorditas are especially good. 

(If you've only heard of a gordita at Taco Bell, the real version is a dense little corn cake about the size of an English muffin, split in half and stuffed with your choice of filling.)

The tortas are--as Donald Trump would say--HUUUUUUGE, and if you want to eat what is quite possibly the messiest sandwich IN THE WORLD, try the pambazo, which is a torta where they first dunk the outside of the bread in guajillo chile sauce and toss it on the griddle for a while. It is impossible to eat gracefully.

There are a few weekend-only items like tamales and pozole, and if you like these things, it's worth a weekend visit. Pozole is one of my favorite soups so yeah, winter time, I definitely get me some pozole action. 

Pro tip: get yourself a Sidral Mundet apple soda from the grocery side to go with your food. My favorite Mexican soda."}
{"text":"So great! I was in town for training and checked it out! It was so great got the tostadas and a pastor taco! Amazing!"}
{"text":"Once in a while I hit a very authentic Mexican restaurant to remind myself how much I forget about food.  This place was highly recommended by a friend.  I decided I had to see what it was all about.

First impression wasn't great.  Very small facade that makes you wonder where the restaurant is.  As you pass through the grocery store, you see it.  Whew!  The seating area was expansive, and they do their share of business (must be good, right?).  We sat down and looked over the menu.

The menu is a bit limited, but what they do, they do well.  Now this is where \"authentic\" comes into play.  You do not get a Taco Bell taco here.  Me?  I like stuff on my tacos, which is not the authentic style.  I settled for a steak taco and a chicken quesadilla.  The taco was okay, which I can't complain because I knew what I was doing.  It needed stuff.  But, with a little of the \"salsa picante\" from the bottle on the table, it was pretty decent.  The quesadilla was a whole different ballgame.  OH MY!  I'm used to the pressed/toasted quesadillas, but this was fried (pan?  deep?  don't know, don't care!).  With chicken, cheese and lettuce inside, it was so tasty! 

As far as atmosphere, I could do without some of the quirks.  For one, the place was in a state of disrepair.  A blue tarp hung, blocking off an area where there was banging and other noise.  I get it - repairs, no big deal.  Some of the seating was beat up, which I can live with, but I won't be taking the wife there.  There was also soccer showing on TVs throughout the seating area, which was fine, but a little loud.  Unfortunately, a goal was scored while we were there and we had to sit through three long breaths of \"goooooooooooooal\" from the announcer - interrupting our conversation until he was done celebrating.

Service was fine - nothing extraordinary.  It would help to go with someone who has been here before.  They don't bring you drinks - you pick those out in the grocery area.  When done, you walk up and pay (no check to the table that I was aware of).

Will I eat here again?  YES!  For $3, the quesadilla was a potential one-item meal.  For my mom and myself, the bill was $10.55.  You can't beat that.  Once you figure out what to order here, it is fantastic!"}
{"text":"I am not sure where all of the positive reviews have come from. Our experience was less than terrible and that is a compliment. The food was void of flavor, the hot sauce was mild, and the cheese that was sprinkled on all of the dishes was frozen! Yes, I am telling the truth about the cheese. We will never be back and hope to spare others the same waste of time ad money by posting this review."}
{"text":"Hidden in a small shopping center on Odana road - I thought it was just a grocery store. Little did I know, hidden more into the back is a restaurant! And, oh boy, is it worth it take a peek in there!

My sister introduced me to this place after being told it was one of the most authentic Mexican restaurants in Madison.  You know it's authentic when you're the only English-speaking customer in there.  O-M-G and talk about the price is right. Our order came to around 18 bucks (with drinks!) and we really could have cut back on a few less tacos - probably making a regular meal here around 7 bucks each; still leaving you full and satisfied! Who can beat that? Their chile rellenos are my favorite - YUM! But they are only served on the weekends. Mmm...I would like to go there right about now.  Oh, and service is always so great! Enjoy - and thank you Tienda Los Gemelos for being there for me when my tummy needs you most!"}
{"text":"This place has the best tacos in Madison -hands down!!

If you're looking for authentic Mexican food, you've come to the right place. My fiancé and I ordered tacos and tamales to go. The al pastor and steak tacos are super delicious. The red and green tamales were also amazing. 

I can see myself coming back here again and again."}
{"text":"Really enjoyed their tacos, but one order they forgot to add cheese to the gorditas and forgot my chips on one of my to-go orders.

Definitely recommend the place though."}
{"text":"Food is a four, service a flat zero. 
Admittedly, we were in a rush. When you come in, there is no direction provided-signage or personal-as to whether you seat yourself, wait to be seated or place your order and then sit down. We had to ask 3 staff members for directions before being told to sit anywhere and someone would be over. 

The waitress came over and took our order which amounted to 6 beef tacos (four without toppings) and 2 pork gorditas. When we asked about beverages we were told to help ourself and pay at the register. Fine. We'll skip the drinks. The place is less than 1/4 full. Chips were fine, salsa was pretty poor. 

32 minutes later and still no food. Now we need to leave to get our friend to the bus for an out of town trip. We flag down a waitress (ours had disappeared this whole time) and inform that any food has to be to go and we need to leave. I go to the register to pay. The staff seemed to have lost the order and didn't understand why I was paying and needing to leave. This takes another 5 minutes and we are out the door. 

Look-this is a little eatery affixed to a bodega. And the food is good but there is no way it takes 37 minutes for 6 tacos and 2 gorditas. We picked this place because it seemed simple and quick. Neither. Put up a sign and get your act together."}
{"text":"When people say \"quesadilla\", too often it means a flour tortilla rolled around some inert cheese, and heated till drippingly sad.

But here, a \"quesadilla\" is a big, crisp, bursting, flavor bomb - - a crunchy flavor delight.   The rich-corn-flavored tacos, too, are sumptious (great meats).   I took one of each to an early afternoon meeting last Friday, and if we could have harnessed the salivation at the surrounding tables, we could have solved the energy crisis using hydroelectric.

This is a hidden gem  (just TRY to find it).   The flavors are bursting, the prices are wonderful,  and the staff are wholly accepting of people who might not be native, while still cranking out glorious things at fabulous prices that  local mex-chains (read: Pedros?!?) could never even conceive of."}
{"text":"Best tacos in Madison! Been to the State street location many times, but this was my first time at the Odana location. It is in back of a small bodega style store, which is really fun to walk through. Daily specials are written in Spanish and the lunch crowd was 90% Hispanic...you know you have stumbled on a good place when that happens.Ordered the pastor tacos and they were perfectly cooked with a nice crispy sear, but the meat still retained its juice. Topped with plenty of fresh white onion and cilantro. Their two salsa options for topping your food items are also superior. The red is spicier than the green tomatillo which is what I like. The salsa served with the chips (free by the way) is also a tomatillo and pico de gallo mixture that has more kick that the squeeze bottle and was highly addictive. Will be going back many many more times before I leave this frozen state."}
{"text":"The closest thing to real Mexican food I have found since moving to the Midwest! This place has perfectly prepared everything! And the tortillas...oh man! Totally reminds me of home! And check out the tienda that it's inside of...great items that you can't find at any stores around here."}
{"text":"Average at best for the Madison area when it comes to taco and Tortas.   I would recommend but there is better options in Madison"}
{"text":"One of the best places for authentic Mexican cuisine. Its tucked in the back of a small grocery store. Just walk to the back and seat yourself. If you want something other than water you grab it out of the coolers to the right before you walk in to the restaurant part.

The have really good tacos. I like the steak ones with onion, cilantro, and lime. Both the green and red salsa they serve with the tacos are really nice. Their chicken tostadas are also tasty. The chile rellenos are really good too; lots of yummy sauce and plenty of rice and beans to go with it plus a side or corn tortillas.

We've been to other small, authentic Mexican restaurants around Madison and this one is right up to par with those if not slightly better and super affordable. A nice location in the westside; close to our house and work so that's one of the reasons we choose it often as well. Its nice not to drive far for authentic Mexican fare."}
{"text":"Both locations of Los Gemelos are great, the one on Odana is a lot more authentic in atmosphere, but they share the strength of great food.

This is the type of place to go if you want no frills Mexican food at a low price.  If you're looking for an American-style restaurant and more streamlined food this is not the spot.  I personally love the more authentic venues like Los Gemelos because the food tastes amazing, the staff is friendly, and the atmosphere feels as if you are in Mexico.

I really like the gorditas, tortas, and tacos, but honestly anything on the menu is pretty good.  The downtown location has ridiculously good chimichangas and the staff seemed slightly more attentive but that could have just been on the particular days I went in.  The Odana Rd location has a unique grocery store and usually futbol on TV, so that in my opinion is enough to recommend it first if you're deciding between the two.

I'd say they are pretty much on par with Taqueria Guadalajara, but that restaurant still gets my vote for #1 Mexican restaurant in Madison.  Regardless, Gemelos is great and absolutely worth a visit."}
{"text":"This is the best Mexican food in Madison WI.  It is family owned and authentic. It's also very inexpensive so surprising for the quality of the food. It does have a \"hole in the wall\" feel to it but the more you come here the more it adds to the experience of eating at an unknown secret spot. If you want a Coke or Pepsi you simply walk over to the Mexican grocery store that it's connected to and grab what you want out of the drink coolers. The service can be slow when they are busy but that's only because they have a small family staff and it's popularity has exploded.  Very worth the wait!"}
{"text":"Delicious food and great service! If you have a taste for tacos you should totally stop here first!"}
{"text":"I was first introduced to the concept of an awesome taqueria hidden behind a tienda in Portland, OR. There was a place in North Portland (Tienda Santa Cruz) that was a bakery, market and, in back, they cranked out gorgeous, inexpensive and unquestionably authentic stuff.

S.U. and I were on an Sunday shopping trip deep into the soul-sucking vastness of West Odana malldom, it was lunchtime and I remembered hearing about the 'other' Gemelos. It turned out to be right next to the unmentionable dark place we were heading so ..let's eat.

As advertised, we walked into a Mexican Tienda. It has a meat counter with fresh and prepared  beef and pork (al pastor by the pound for example), all the basics from housewares to spices and in the back a medium size restaurant. Booths and  tables. Sunday specials. We were the only obviously not-Latinos in the place. It was lunch so we didn't have much more than tacos and sopes. They came out fast, hot and delicious.
They have Sunday specials and I tried to order barbacoa (lamb) but they were out. They also don't serve beer (sad face). I guess that's OK but, as we're told here in Wisconsin, in heaven they don't serve beer."}
