{"text":"Sports bar ha!  Last call by 9:15 during a Pens game.  25 minute wait for a drink no never again"}
{"text":"Slow service ...,.. Chili was good but cold, calzone was huge for small and good, hot sausage was also good,  but onion rings were awful....can't believe they served minced frozen onion rings that were terrible....we had a coupon for 1/2 off thank goodness.  Probably won't go back...but would consider takeout for pizza... Nothing else"}
{"text":"Sooooo my first and real review was removed for \"rudeness/being real\". But guess what?!? The place is closed! Much sooner than my end of year prediction. So, chinga te Yelp. Chinga te Time out pizza pub and grub. And finally, chinga fat broads in spandex! Oh, I know there are signs on the doors that say \"we're remodeling\" but that's pure b.s. the place was spotless from jump. It just sucked!"}
{"text":"I got take out from Time Out only because I had a Double Take gift certificate so I can't speak for the service.  I ordered a White Chicken Ricotta Pizza, a NY Thin Pizza and a Club Sandwich.  The White Chicken Ricotta Pizza was made with steak instead of chicken.  Still good, but not what I had ordered.  I expected the NY Thin Pizza to be cut into big wide slices.  It was not, but it was still okay.  The Club Sandwich was pretty good, stacked high with meat and cheese.    I'm not sure if I should give 2 or 3 stars.  If the order had been correct and met my expectations, I'd probably make this a 4 star review.  I want to give a 3 because the food was good, however my order wasn't entirely correct so I want to deduct my review down to 2 stars.  Since I wasn't mad (just slightly disappointed), I'm settling with 3 stars.  And that's kind of how I feel about Time Out Pizza Pub and Grub in general.  Going there is settling for something just okay."}
{"text":"Back in the old hood and stopped in to catch the hockey game and some grub.  Our waitress was good, being there when refills were needed.  The wait staff wear referee outfits, so it definitely has the sports bar theme.  Since Timeout seems to promote the barbeque, ordered the brisket sandwich that is cooked over cherry wood.  The brisket was good with a nice smoke flavor but the sauce that came with it was somewhat sharp and sour, so not my flavorite (favorite).  The pizza looked good but none or us ordered it (the group next to us had it and seemed to enjoy it)."}
