{"text":"I love this place.  The menu rotates occasionally, and there is a specials board when you walk in (make sure to check the board or ask the server...sometimes the servers forget to tell you about the specials).  Food had always been stellar, from the basic burger to elegant salads, intriguing pizzas, and awesome pastas.  My fav is the gorgonzola gnocci, which is a rotating item.  Dessert is also good, maybe a bit pricey.  Creme brulee is always there and very good, gelato too."}
{"text":"I've been to Timpone's twice.  The first time, I thought the food was specatular and was wowed by the experience. I ordered the Foie Gras and Ahi Tuna and thought the quality was comparable to some of the better places in Chicago.  However, on my second try the food was a lot worse.  It was the night of an important football game so the place was deserted - but no excuse to be serving sub-par food.  Overall, I like the place and will definitely be back to give it a third try."}
{"text":"Amazing thin crust pizza and the best seafood risotto ever. Also great deserts. I have never been disappointed at Timpone's."}
{"text":"I was in Urbana alone on business and wanted to dine at a nice restaurant within walking distance of the Illini Union where I was staying. The restaurant had a nice ambiance and the wait staff was professional. I ordered the halibut with brussels sprouts and proscuitto. The lemon beurre blanc sauce served with the fish was divine. The white wine I had was also very good. I was too full for dessert but wanted to try the lemon tart so I ordered it to go. I figured I could have it later while I worked in my hotel room. I was surprised when I got my bill and saw that I was charged .50 for the container b/c I asked for the tart to go. It's not a big deal but after paying over 60.00 for my meal (for one), this left a negative impression. I've gotten dessert to go at other restaurants of all different price ranges and have never been charged for a container. I wonder if I had eaten part of the tart at the restaurant and then asked for the rest to go if they would have still charged me the .50. Again, not a big deal but this changed my impression of Timpone's from being an upscale restaurant to a fine restaurant wanna-be."}
{"text":"The atmosphere: The downstairs bar area is small and cheap looking. The dining room is dated and screams \"cheap 1980's supper club\" - not at all romantic! The restaurant was filled with retirement-age couples/parties about to head to a Krannert performance on the Wednesday evening that we went.   This past week, we went to Timpone's to celebrate my birthday. We started off sharing the \"Fritto Misto\" appetizr, described as \"Calamari, Gulf Shrimp, Scallops, Red Onion, and Zucchini.\" When the dish arrived, it was nothing but a pile of glorified onion rings. There were only three pieces of calamari (small tentacles), 3 shrimp (which were small, and clearly of the phosphate-pumped Asian variety, and a scattered few wet calico scallops...95% of the \"Fritto Misto\" was red onion. I feel as though by listing the seafood first, that indicates that the bulk will be seafood, or at the very least, there will be an even distribution of the components. Not wanting to be a \"difficult customer\", I chalked it up to just a \"bad batch.\" That being said, the recipe was a straight copy of Judy Rodgers' dish in the Zuni Cafe (San Francisco) cookbook, and I could have made it at home...  However, when I received my entree, \"Sea Scallops with a Dijon Beurre Blanc on a bed of celery root puree\"... I was furious. There were 5 scallops, each approximately the size of a quarter (no exaggeration) and only seared on one side. The mound of puree could not have been more than 1/2 cup (and didn't even taste good). My husband ordered \"Chianti-Braised Shortribs with Homemade Gnocchi\" - which came with fewer than 10 small gnocchi. Worst of all, the food tasted bad; the beurre blanc was so sweet it was like Creme Anglaise with Dijon and I could have done a better braise at home easily.  I know that times are tough, and that food costs are supposed to be ~30% of the final restaurant price- but I felt completely gouged. I'm happy to pay for a delicious meal and I do not expect large portions. I travel pretty frequently to Chicago and DC- I know what good food costs and what \"normal\" portion sizes are at \"fine dining\" restaurants. I did not want to make a scene because I didn't want my husband to feel bad for picking the restaurant. The only reason this place could possibly stay in business is because of its proximity to campus/the Krannert Center for Performing Arts or because most people have very low expectations due to the lack of \"Fine Dining\" in the C-U area.  Our server was very attentive and great, but the food was so bad (even with the small portions, we didn't finish our food and didn't want to take the leftovers home!). We will not be returning."}
{"text":"Every meal I've had at Timpone's has been delicious. Most recently, I visited with my husband and mother-in-law and we had the following meals: bread to start (costs $1 but worth it!), veggie pizza, bolognese with pappardelle pasta, and seafood risotto. Their pizza is a very thin, almost cracker-like crust, but is quite tasty and the veggies they put on it are fresh and delicious. The bolognese was hearty and rich with multiple kinds of meat in it, and the pappardelle was fresh made that day. But the star out of our 3 meals was definitely the seafood risotto. Nice size shrimp and scallops in a delicious savory tomato sauce with risotto that melted in your mouth. Would order this again in a heartbeat! This restaurant has two floors, with the host station being upstairs (and no elevator) so you will need to go up the stairs when you first arrive. It can be a concern for people with mobility issues, but I suspect you can request a table downstairs to accommodate your group as needed. They also have a private dining room that you can reserve which has its own bathroom and coat rack as well as a dedicated server just for your large party. We have used it a couple times in the past for large groups and been very happy with the food and service. You don't necessarily need reservations here, but if you're going at busy times (Friday/Saturday nights), you might want to call ahead and make a reservation."}
{"text":"I've been eating at Timpones for about 25 years.   This is one of the best choices for fine dining in C-U.   The food is always excellent.  The menu is constantly changing but they always have nice fish, meat and pasta choices.   Many people love their pizza.   The long-time favorite appetizer is Frito Misto (usually shrimp, calamari, scallops) with a garlic aioli on top and a spicy tomato-based sauce below.  Highly recommended.   Desserts are always interesting and wonderful.  The service varies as they do have a lot of turnover with students that come and go.   But the food makes up for inconsistency in service."}
{"text":"It is not Chicago, nor New York, but overall it is the best restaurant in Champaign-Urbana Illinois. I have been going there since it opened in 1986 and have NEVER had a bad meal."}
{"text":"They change their menu base on fresh food they get. It's the only real Italian restaurant in town. Good place for gathering and family."}
{"text":"Ordered seafood risotto, and spinach pizza with artichoke hearts and goat cheese. Both are delicious!"}
{"text":"Timpone's is a very nice restaurant, particularly at dinnertime. My boyfriend and I went here for a nice post-valentine's day weekend dinner (we knew it wouldn't be too busy this weekend, so we opted to do our v-day dinner this weekend instead.) When we walked in, the door and sign were very old-looking, but in a charming way, so that was promising.  The first floor is a little more laid-back, but they say you can go to the upper floor if we'd like, so we opted for that. It was very nicely decorated with sculptures, paintings, and plants. The other diners were dressed casually, but still nice, if that makes sense. Like, jeans with a button-up or nice sweater. It was quite nice up there and the service was lovely. I ordered the veal and it was absolutely delicious, and the perfect portion size; however, it was not the perfect portion size for the price. For a $29 entree, I expected a little more on the plate, or for the price to be lower for the same amount. None the less, the food was delicious and so was my boyfriend's. We ended up sharing the crème brûlée for dessert and it was very good.  Overall, the staff was very attentive and helpful. Although the atmosphere was slightly intimidating, it still had a nice, cozy, fancy-restaurant feel, and I wouldn't mind going again.  TLDR: It's a nice place with good food and service, but expect to shell out some dough."}
{"text":"I couldn't tell you about the food because my boyfriend and I were waved away the first and only time we tried to go here after finding pretty good reviews of the food on yelp. We walked in for an early dinner and were not greeted by anyone. We looked around and waited to see if we would be noticed by some of the bar staff, but nothing. We decided to follow an older couple up the stairs and were then greeted by a host who asked if we had reservations. We didn't and the host said that they were all booked upstairs, but that we could sit downstairs at a table by the bar if there were some available since those tables are first come, first served. That was fine with us and we headed downstairs and started to walk into the bar area where there were 2 or 3 empty tables. The older woman bartending was on the phone and as we started to head towards a table she looked over, shook her head, and waved her hand to indicate that we should not sit there. She went back to her phone call, didn't say a word to us and no one else spoke to us or tried to help us. Given no explanation and no other option and feeling embarrassed, we left and won't be back."}
{"text":"I really enjoyed a celebratory dinner I recently had at at Timpone's.  I'd always meant to try it out but never had.  The food was really good, the service was excellent and it had a nice cozy romantic feel.  It was, however, pretty expensive, particularly for being located on a college campus.  The food was fantastic but portions were on the small side, especially considering the prices.  The peach bread pudding was scrumptious.  I probably won't be back, not because it wasn't good, but because there are a lot of other upscale places in town I'd like to try before I break the bank at Timpone's again, and special occasions that warrant a $100 tab only come along so often."}
{"text":"I would not recommend this place, particularly in light of the high prices.  The decor/environment is really bad - very tacky, random unattractive pieces that seemed like they were all from different eras/styles.    That wouldn't be a big deal, of course, if the food and service were good.  However, that wasn't the case. We ordered a pizza and tried to swap out an ingredient due to an allergy, but they point-blank refused to add anything, only remove ingredients.  For a very small, 14 dollar pizza, that's a little silly.  The pizza was fine, but not at all worth the price, and the crust was pretty burnt.  The salad we ordered was soggy and overly cold, having clearly been prepared hours earlier and put in a refrigerator for a long time.  You have to pay to have bread before the meal, which is fine, except that they give you very little, and our waiter even took it before we were finished without asking.  Finally, our waiter and the host were both extremely rude to us.    All in all, if you want a nice meal, this isn't the place.  The food wasn't bad, but it wasn't worth anywhere near what we paid for it.  Go down the street to the Bread Company instead, where the staff is actually nice and the food consistently excellent."}
{"text":"\"Surprisingly good Italian food for the area.\"  Ordered the Fritto Misto as an appetizer. A great starter with Shrimp, Calamari and Scallops. Our table had the 2010 San Silvestro Dolcetto Monferrato Anselmo bottle of wine with our meal. Per the advice of the waiter, ordered the Pork's Lover's pizza as my main course. Good meaty personal pizza, large in size. Had Creme Brulee topped with fruit for dessert. Daily specials offered, generally better than the menu. Open for lunch as well."}
{"text":"The overall quality is great! The dish are served slow, it took them 15 min to have a pasta prepared. Good environment for dating, amazing dessert. The food taste great, and their seafood are fresh!"}
{"text":"This place is a total throwback in terms of both menu items and decor. It reminds me of \"fancy\" places from my 1980s childhood. The food was executed competently and the service was attentive and pleasant. However it was not worthy of the $100 dinner for two price tag."}
{"text":"Timpone's is a solid restaurant. The ingredients are fresh, and the menu changes often enough to keep things interesting. I would say that the food is overpriced, but it's hard to get \"nice\" food directly on campus, so you pay a premium for convenience I guess. I've been here a good number of times over the years, and every time was an enjoyable trip, except once. I took someone here on a date, and we were seated in an area where the lights weren't working and the speakers were broken. I'm guessing they figured they could just put students there and get away with it. I complained (the restaurant wasn't near full and I had placed a reservation), they were nice about it and moved us and the rest of the dinner went very well. The decor leaves something to be desired, but otherwise a solid restaurant, with decent service and good food."}
{"text":"This is one of the very early fine-dining restaurants in CU.  Picture a midwestern take on a NYC restaurant, circa 1980's (though a little later 80's now since they did some updating).  The menu, though printed daily, doesn't stray far - pasta, some fish options, sometimes steak, risotto.  Service varies, and unfortunately there is a lot of server turnover.  I have eaten here many times b/c it is close to areas of the University in which I work.  At one point this was a bit of the \"make the scene\" place, and it is convenient for pre- or post-concert dining at Krannert.  Nevertheless, many other places have come along since this one, and while I would say it's in the top handful of places in town, it is no longer at the top.  I would also recommend lunch over dinner...very similar menus, and I tend to get better lunch service."}
{"text":"The prices are fairly decent if you just order food (no alcohol included) and the quality is fairly decent. The waiter we got was very knowledgeable and polite. I'm also a fan of the dim lighting in the dining area and the overall quiet atmosphere so you can actually have a conversation with the people you are having dinner with. We both ordered pizzas, which they claim is one of their specialties, and it was good, but I felt like it was also a little over-hyped because it wasn't anything extraordinary. The ahi tuna appetizer was delicious though and I would highly recommend ordering it. Overall, it's a nice restaurant."}
{"text":"I went here for my graduation dinner and had a party of 7. We had a reservation and we arrived early and were seated instantly. We sat down at our table and there was only one other table in the room. We were all so hungry that by the time the server came we were so excited to order stuff. We ordered two bottles of wine and a few orders of bread. You have to pay a dollar for bread but I honestly think it is worth it and were ordered 3.   Their menu changes daily and they have daily specials. I ordered their tomato bisque soup and a caesar salad along with meat lasagna. Their soup was to die for. I wish I didn't split it with my boyfriend because I was sad when it was all gone. Their lasagna was made with spinach noodles which at first I didn't think I would enjoy but I really did. Everyone at my table was super satisfied with everything they ordered. The bill came out to around 250 which I thought was a little high. However, I can't complain because it was a really great meal and we had great service. I will definitely be returning and I'm grateful to the staff who helped to make my graduation night very special."}
{"text":"I've now been to Timpone's a couple of times for lunch (it seems like whenever I visit UIUC someone takes me here). It's pretty much located on campus, which makes it an easy destination if you're working for the university. The food is vaguely Italian with some American influences, and it's pretty good overall if not mind-blowing. Last time I was there I had the tuna burger, which wasn't bad, although I was a little disappointed when the tuna turned out to be a tuna patty and not an actual piece of tuna. They give you free bread... nice. Friendly service too. I just wish the food were a little more impressive."}
{"text":"Went there twice while in town for Science Olympiad.  Lunch was flavorful, help was pleasant even with some menu confusion and the fact we showed up just before lunch closing.  Didn't rush us at all.  Had shrimp and broccoli pizza (lunch and dinner), pasta with eggplant and amazing homemade ice cream for desert.  Looked at dinner menu and decided we had to go back next night for dinner since they had duck on the menu.  Dinner was also very good.  Would definitely go back next time I'm in town."}
{"text":"I went here last night for my birthday dinner, and I was extremely happy with the entire experience. The biggest plus for me, aside from the food that is, was the waitstaff. All of the servers were very friendly and professional, and I could tell they all looked out for each other. Case in point, I noticed some lint on one of my glasses of wine, and before I could even say anything, one of the other waiters saw me studying the glass and quickly came over and offered to replace it.  Speaking of wine, the selection was great, but I was unfortunately relegated to the limited \"wine by the glass\" menu since I was the only red wine drinker at my table. Even so, the selection of wine by the glass was well-rounded and pretty solid, and our waiter's wine recommendations were spot on. Now, for the food!  Bread and olive oil is complimentary, of course, and very tasty (so simple...but so good!). For starters, we ordered the crab cakes as well as a spring salad with walnuts and gorgonzola, both of which were very good. For my entree, I had the roast duck, which came with fingerling potatoes, red cabbage, spring vegetables. The entire dish was fantastic. Moist duck, perfectly cooked vegetables, and a wonderful sauce that had blueberries in it. A simple dish done very, very well.  In all, Timpone's is a great place for a gourmet meal at a pretty decent price. They have a nice selection of veg-friendly dishes, too (not vegan, however). I can't recommend this place enough. Give it a try!"}
{"text":"Timpone's has no vegan options aside from greens salad (ordered without the cheese) and penne pasta (which they did not have on the menu when I went). The server was not helpful at all and did not seem at all apologetic or concerned that I had to sit through a three-course meal with colleagues, starving with only a side salad. More vegan options (and nicer service), please."}
{"text":"My daughter came from Texas over Thanksgiving weekend.  There are very few restaurants she misses and requests to go to when she is here.  Timpones is one of them.  Being long term customers will probably now be a thing in the past.  We came Saturday after the Champaign Christmas lights show.  We had a party of three adults and two young children.  The male host was the most unwelcoming and least accommodating employee I ever came across.  If the look of disgust wasn't enough to inspire us to take our business elsewhere it was his rudeness by telling us they don't really accommodate young children.  No highchairs or Booster seats.   He looked at us like we have done something wrong.  We tried to make it work even so squished in a booth.  After the glares and uneasiness we decided to leave and go downstairs to the bar and order our pizzas to go.  The bartender was nice and professional.  Timpones..   you definitely need to consider obtaining a more pleasant host for your establishment.  I recently heard a similar incident without children after sharing with others.  The food is ok but we won't be going back.  The experience had us all in bad moods after"}
{"text":"Timpone's always has an interesting menu with delicious foods. The service can be slow sometimes though. Most disappointing is that they won't make any substitutions on food. I wanted to substitute garlic for olives on a pizza, but they said no. You would think that a restaurant with that price of food would accommodate this with their customers. I also recommend that they refill iced tea rather than bringing a whole new glass and straw. It is a greener way. All that said, the food is always wonderful and it is an excellent place to go for a special meal."}
{"text":"This place survives because it is on campus, and very conveniently located.  it is also the only restaurant within striking distance of the university that serves wine and has cloth napkins, which means that it is full of administrators and professors.  The food is not at all good, but it has no competition if you need to take adults out to a semi-decent restaurant you can walk to from campus.  You should definitely avoid anything involving duck as a topping, because it basically comes out looking and tasting exactly like pastrami from Schnuck's.  If you like that, ignore what I wrote."}
{"text":"I feel that this could be a perfectly good restaurant but every time I go there they just miss it.  So if you want an expensive meal that just misses tasting good, go here.  I had a perfectly good burger that had apparently been sitting too long before the waiter brought it out: the bottom bun had turned to soggy mush.  So close!  I tried a tomato bisque with goat cheese lumps in it that had a lot of potential but there were so many goat cheese lumps that the balance was all wrong.  When you order a tomato bisque it should taste like tomato, I reckon.  Almost!  I had a fancy-pants mushroom and sausage pizza.  Each ingredient seemed good by itself, but as a whole it had a taste I would describe as \"many strong clashing cheeses.\"  Nearly there!"}
{"text":"I came here for lunch and had the seafood risotto. Based on the atmosphere and the reputation of the restaurant, I had pretty high expectations. Unfortunately, the meal was very average and rather on the bland side.   (The desserts, on the other hand, were outstanding!)  This place probably deserves another shot, but based on this one experience I am feeling underwhelmed."}
{"text":"For two years I walked past the singularly unimpressive facade of Timpone's with its dated looking sign, convinced that such a place could only continue to remain open because it was obviously a front for some illegal racketeering scheme or other sinister enterprise.  Then I went for lunch.  I am still not entirely convinced that there is not a vicious syndicate running the location, but I was pleasantly surprised by my experience.  Well-made salads, great food options, and wonderfully arrayed.  I ended the entire adventure with a lovely dessert and coffee and emerged mildly regretful for having judged Timpone's so harshly.  However, if there's a raid one day I wouldn't be surprised. ;)"}
{"text":"Tjis place is out of the price range for most college kids and I feel the food is very average. Which would be fine if I wasn't paying extra for average food. I got taken here twice for a focus group for my major and since it was free I cant complain. But there's no way I would pay full price here.  I'm a heavy eater. And by heavy eater I mean I normally throw down to or three normal entrees at regular restaurants.these portions do not fill the average person though. Its not a bad restaurant but its not great either."}
{"text":"To the best of my knowledge, Timpone's and (in the evenings only) the Bread Company, are the only sit-down non-pizza places adjacent to campus.  So I end up here periodically to entertain faculty who are visiting the U of I from elsewhere.   It's decent enough upscalish Italian-American food, but location is the only reason I go there --- places like Radio Maria, Cafe Luna, or Milo's have quite a bit better food.  Overall the place gives the impression of a reasonably-nice hotel dinning room with mediocre food to match (though, in contrast to that image, prices are reasonable)."}
{"text":"Totally average for what it is trying to be. The food is competent but a little boring and is perhaps a hair overpriced. Gnocchi tends to be pretty ok."}
{"text":"This is a wonderful family owned restaurant.  The food is always great.  The owner changes the menu slightly all the time, but yet always has some of the old favorites.  It's been a local favorite for years and hopefully for many more years to come.  The food is a bit higher priced, but I believe it's worth it overall for the quality, taste, & ambiance.  This restaurant also has one of, if not, the best wine selections of any restaurant around the area.  The food can be described as an mostly Italian & American with a dab of other influences. The pasta and desserts are made on site. The bar area could be updated, but the restaurant upstairs is nice.  Highly recommend for a good conversation and a good meal."}
{"text":"Timpone's reminds me of Italian places at home run by a family you grew up with, and you just go because they are part of the community. I've never really been wowed by the food. It's average. And really too expensive for college kids. Good not great."}
{"text":"i had the mushroom ravioli for dinner and i thought i died and went to heaven. the best part though was not the dinner....it was the service. my waitress mary kate was one of the most wonderful people ive ever encountered. thank you mary kate, for being an amazing individual."}
{"text":"Everyone knows, being stuck in that section of Urbana can well and truly suck.  Especially when it comes to lunch!  45 minutes with a fifteen or better walk up to Green?  No thank you!  So, for a good time, there, Timpone's was the one.  The answer to everything.  And, in that, there was value.  Not a dollar value, I'm afraid, as Timpone's sure charged for the pleasure.  And there wasn't much flexibility there, either... I mean, it's not like you could order and they'd deliver.  But you could pick-up, so that was something.  My favorite, by a landslide, was their Italian Beef, but it, too, wasn't that dependable.  It really just hinged upon whether you liked thickly sliced garlic.  You could always tell when they got down to the bottom.... besides the beef getting a little fattier, there were so many pieces of sliced garlic, the whole texture/taste changed.  Enough garlic to keep ten Dracula's at bay, I assure you!  Their expensive sub-par pizza was soon replaced by Ozark.  A happy day for all those on the South Campus.  Honestly, we had to depend on this place for so many years, and I just always found their food \"meh\", and their \"service\" even worse.  Unfortunately, their prices were the biggest insult... When the new place was built across the street, we were all glad.  If you're looking for a very dated restaurant, with a menu that's reflective of its age, give this one a try.  Just limit your expectations."}
{"text":"My mother and I treated my boyfriend to dinner for his graduation. My boyfriend being Italian I figured hey what better way than authentic Italian cuisine.    Timpones was not the original choice, due to it being graduation weekend, everything in Champaign-Urbana was completely booked through the weekend. However, I got very lucky and was able to make reservations for a Friday night at 7 with no issues at all.   The ambiance of the restaurant was very warm and inviting, it was definitely decorated to replicate old world Italian and the feel of perhaps a true restaurant in Italy.  I've never been to Italy so I can't say how well they did.  The lay out of the restaurant is a little untraditional. The dining area was up two sets of stairs and there was also a downstairs, though I'm not sure what was down there.   We decided to split a bottle of wine amongst the three of us but we couldn't choose so we asked our waitress what she recommended. Our waitress was very nice and helpful in the ways that she could be however, wine was not her area of knowledge. She did however run our likes and dislikes by a man in the back who suggested a bottle of pinot noir and it was delicious.   I ordered the Penn Rustica, which was Penne, Italian sausage, roasted chicken, onions, peppers and mushrooms and it was spot on. My mom had ordered angle hair pasta with seafood and my boyfriend order wild boar with egg noodles. Both of which I sampled off their plate and both of which were very very good as well. Our food came out in a very timely manner and our waitress was there when we needed her but stayed away for the most part, which I can appreciate due to the amount of talking we do together.   Whether your in for a celebration or you have a taste for traditional italian food, Timpones is a great place to do it. With a welcoming atmosphere and fresh and delicious food Timpones is a very cool place."}
{"text":"Amazing wait staff and food! Great place to celebrate and very nice decoration and design. Sauces are amazing here!"}
{"text":"I'll start by saying we enjoyed the food. Nice portions, great flavor, good price. Because we enjoyed the food is the only reason I will give this place another shot. Terrible service. We arrived early for our reservation so we could have a cocktail in the bar first and wait for the other members of our party to arrive. Bar tender was a grumpy older lady. She didn't greet us and also didn't clear the dirty dishes off the bar where we were seated. We pushed them out of our way and were only greeted by a server delivering dirty glassware. He also gave us water. After about 5-7 minutes the lady came over and said \"ok, who's next\" This was after another couple came to the bar and went upstairs to complain they hadn't been greeted or received service (we were there a while before them). I ordered a cosmopolitan. It was not good. And I had to ask for the lemon twist. Once we were seated we had to ask for a wine list, we were handed a glass wine list and were told they did not have moscato by the glass. Then, we had to ask for a by the bottle list. We ordered a bottle of white wine and were then brought the wine, in an ice bucket, and  were informed they don't keep that particular wine chilled so we would have to wait for it to chill. Weird. We ordered several appetizers and entrees to share. All were delicious but we weren't given any explanation as to what everything was. Meanwhile, the host/bus person ran around frantically covered in sweat. He was so sweaty his shirt was visibly wet. It was not hot in there. Gross. No one wants to look at staff wearing a sweat soaked shirt while they eat. One member of our party was drinking Pepsi, which he had to ask for a refill on more than one occasion. The server actually reached over his empty glass to fill my 2/3 full glass with water. I feel like this place can only survive in the location it is in. Good food but there are many better options for ambience and service."}
{"text":"Love this place, atmosphere is wonderful. You can actually hear your companions conversation. Their Chianti and spinach tagliatelle fantastic."}
{"text":"The food this valentine's was very good.  We enjoyed.  The menu was prix fixe for $45/person.  They did not offer an optional menu.  We witnessed multiple tables of college aged valentine's dates (and some older folks too) sharing one dinner or actually walking out before ordering because they couldn't afford it.  Our waiter was HORRIBLE.  He had an incredibly loud voice and though friendly enough, was not really \"nice restaurant\" material. For example: instead of \"may I offer you more coffee sir?\" he said, \"do you want more coffee?\" (in that really loud obnoxious voice--think yelling)....  I mean, I am not snooty but it's Valentines and we are trying to be romantic on a night out so a little politeness could go a long way.  I could hear his voice across the dining room.  He actually called out one of the couples who left before ordering---saying \"Sorry Guys! You know the menu is really good and if you were in Chicago, you would pay $150, etc.\" I mean, he kind of went on and on....really loudly...and you know these broke college kids were just trying to sneak out of there with the least amount of embarrassment.  Geesh! HE was horrible.  Did I say that already? and we had to ask for everything- bread, refills, etc. nothing was anticipated---he was just bad.   The price is steep- especially for Champaign- but it was a holiday so the splurge can pretty much be justified.  Portion sizes were very big and good.  Food was hot and perfectly cooked.  They didn't accommodate vegetarians well- as we overheard at the table next to us----the veg options included the Chilean Sea bass without the Chilean Sea bass---so just basically the sides (what? Like, have a pasta dish, it is an italian joint after all).  We had a decent date---would have been great if the waitstaff were better.  Would probably go back.  I think they should consider some new staff though.  :)"}
{"text":"After reading other reviews here, I expected a respectable restaurant; nothing amazing, but solid.  I was sorely disappointed.  It was a slow, summer Tuesday night; maybe about 6-7 tables in the restaurant.  I started with the \"warm goat cheese, arugula, and endive salad.\" You get one small dollop of goat cheese, exactly 11 small pieces of sad arugula, and a mound of bitter endive.  I mean, call it an endive salad if that's the core ingredient.  And arugula is awesome, why have it as an afterthought in a salad?  So, after I finished my salad I asked another waiter passing by if it was possible to have some bread.  The passing-by waiter brought it out, but my waiter ignored the oversight altogether.  On to the main course.  A hanger steak with a medley of vegetables, polenta, and beans.  I ordered it medium rare; it came out solid well done (gray-brown thorughout with a touch of pink in the middle).  I understand if a steak is overcooked sometimes; but for this dish the \"cook\" (I mean it had to be a cook and not a real chef) sliced the steak into pieces and clearly had to see if was way overcooked.  After starting to eat my meal, the waiter asked my opinion of the meal.  I told him flat out, the steak is way over cooked but I'll try and eat it.  He looked me right in the eye, smiled and said \"Great!\"  Really?  Were you even listening?  (perhaps he put the order for the steak in wrong and I should not blame the kitchen?) The vegetables were more like a cold, grilled corn salsa spread over the steak, on some polenta, with a moat of beans around the edge.  The other parts were fine, but the combo of a mexican fiesta just didn't work.  I will say the polenta was good.  Still, I couldn't finish the overcooked steak and it's mix-match of sides and gave up half way through the entree.  The waiter took it in stride.  He brought me the bill for the full amount, and instead of trying to make amends, informs me \"I'm sorry you didn't like the steak, hope to see you again soon!\"  What? Service is a definite 1 star.  Food is a 2 star.  Overall experience a solid one star.  I will never go back to this restaurant and recommend you spend your time and money elsewhere.  The salad was 7, steak 19, glass of wine 6.  So, this is definitely a $$$ place."}
{"text":"I think this may be the best restaurant near the U of I.  Standard Italian food, but some wonderful improvisations in addition.  I don't know where they get their seafood, but the swordfish is the best I've ever had.  Also pastas, steaks, and great vegetables - they are committed to organic ingredients.  Spend a few hours and taste a few appetizers before dinner.  Reasonably comprehensive wine list and full bar.  Cordial service, but they keep it leisurely, so let them know if you've got a curtain later.  The owner comes around to make sure you feel well cared-for.  Note: they serve lunch M-F from 11:30 until 3.  Dinner begins at 5 p.m."}
{"text":"Go here if you want free food poisoning.  My mom got food poisoning from some shrimp she ate here. For the rest of the day, she was vomiting. Needless to say, I'll never eat there again.  Not only is the food bad, the owner is an absolute horror. I haven't dealt with him personally but he's got a very bad reputation. I talked with several people who worked here and they said he was just horrible.   I'm amazed that they are still in business."}
{"text":"This is a tale of two experiences. My husband would vote his meal as a three, where I am sticking with a two. To be fair, he is much better at understanding flavor dynamics on paper than I am, which is probably why we ended up with two different experiences.  This review is split into two parts: the ambiance and service aspect, followed by the food review. My husband and I agree, though, that two stars are definitely warranted for the former portion.  There are three important items to note before entering Timpones. The first is that the decor is absolutely ridiculous; reminiscent of a Miami night club circa 1984. The second thing is that the wait staff do not seem to know what's going on, which can perhaps be attributed to the third thing. The manager yells at their wait staff in front of all patrons, which I can only assume makes the wait staff SUPER NERVOUS. Of course, I am generalizing based on one experience, and yet it seems other Yelpers share similar sentiments.  Of course, the above items relate strictly to ambiance and service. Important, but not the end-all, be-all of a meal, so let us move on.  We started off with a goat cheese and arugula salad. On paper, this was an exciting start to this meal! But when it came out? A total disappointment. It is seldom, even when a meal is not good, that I think, \"this was shallow/vacuous/trite/vapid\" and yet that is exactly what it tasted like.  For dinner, my husband ordered a hearty stew with an interesting citrus, chocolate, and red meat dynamic. He enjoyed it, and rated it a three. I had the spinach tagliatelle that was underwhelming at best. There was very little flavor, but tons of cream. I thought the texture was nice, which is why I gave it two stars instead of one. No dessert--we had tried enough.  I am not sure if we will be going back here. I promise that there are restaurants in Urbana-Champaign that are WAY better. Perhaps they do not cost as much, or have as gaudy of interiors, but... they taste good. And I'm not so sure that the same can be said of Timpones."}
{"text":"Amazing, amazing, amazing!  I had their special black bean pizza and it blew me away!  Everything on the menu sounded so good!  I'll have to go back to try many more items:)"}
{"text":"I took my Dad here when he was visiting.  I was expecting it to be expensive, but also to be a solid dining experience.  Sure it is one of the few very nice restaurants on campus, but from now on I will go off campus to eat nice meals.  The food was okay.  The dishes were pretty small for the price.  Worst of all was the service.  It took forever to get anything done and while the waittress was very nice, it was unpleasant.  Also, it was too loud for my Dad and I to talk which was our main intention.  Lastly, this was in the winter and there was a huge draft whenever anybody entered the restaurant that forced us to put our jackets on."}
{"text":"Came here with a group. First off - got great service. Good menu recommendations, and very accommodating when it came time splitting the bill.  I had a nice goat cheese with arugula salad to start that was a really nice mix with a superb dressing. I had the seafood risotto for the main course, and it was really good. I like my risotto to be steaming hot when it comes out, and it was - despite the large group I was with. There was a decent, but not overwhelming amount of seafood/scallops/shrimp - there could've been more, but hey - we're a thousand miles from the closest ocean here.  I was a grad student at UIUC back in the early 90's, and when my current employer came to a recruiting fair, they took a handful of us out to dinner. I had never been someplace so nice as a student, and it was probably the best meal I'd had in Champaign-Urbana during my school years - but I could never remember the name of the place. After going in there this time, it was clear - this was the place. Confirmed by a local professor who said that Timpone's was an Urbana tradition and had been around longer than most restaurtants. Fond memories."}
{"text":"Have always enjoyed the food and thought it to be of very good quality.   The service is lacking due to the focus on hiring the nearby students from the university. On one occasion we made reservations, and while being seated the hostess tried to place us at a table. We prefer a booth and asked to be seated at one but she refused saying that they were not yet seating in that area. We insisted, and this went back and forth several times before we said that we will leave. She finally allowed us to sit at a booth but then made a dramatic show about placing us there before stomping off.   It was bizarre and not the typical experience, but just a cautionary sign of what comes when staffing students."}
{"text":"Went there for lunch.  My friend and I got an appetizer, lunch entree & dessert.  Super expensive for what you get.  The food was ok, the portions small and the service was awful.  I had tea and my glass was empty from the appetizer to the time I left-even though the waitress promised she would bring it back when the entree was delivered... And again when the dessert and check was delivered.  We were never asked if we needed anything else or if our food was ok.  Plus-I had a salad and only had two choices of dressings the house and Italian.  When I asked if I could have my salad with no tomatoes-the waitress told me that wasn't possible as the owner is the chef and refuses to make any adjustments to his foods.  Save your $50 for something much more enjoyable-food, service & something less than a 1970's decor!"}
{"text":"I don't usually go out for Italian food because Italian food is easy to make.  I make pasta at least once a week.  Why pay $15+ per person for the pleasure?  But I was taken out to Timpone's for lunch for my birthday.  I'd been especially hesitant about Timpone's when thinking about trying Italian food here...mostly because their logo is so yuck and tired looking.  Yes, I do judge a book by its cover.  I was not more impressed when we entered the building, as the restaurant looked like an old timey lounge or shabby hotel lobby.  My experience was proof of why it's wrong to judge books by their covers (though I'll still continue to do so).  Timpone's offers a pretty extensive and moderately priced lunch menu, ranging from salads, to pasta, to individual pizzas, to entrees.  Most items were between $8-12.  AND all of the menu seemed relatively innovative.  For instance, they offer a pizza that has broccoli, shrimp, and goat cheese.  You know you want that.    I had meatloaf (!!!  who even has that on a menu?!  excitement!) that came sliced, wrapped in thick bacon, on a fluffy bed of creamily dreamy mashed potatoes.  There was just the right amount of tasty mushroom gravy and crisp-tender green beans scattered throughout.  Holy hell.  It was so fantastic.  My dining companion had grilled shrimp with a less-mushy guacamole on top of polenta.  See?  Tasty and innovative.    Even better, we got the last table in the restaurant, but the waitress AND the food both came promptly.  Awesome."}
{"text":"My boyfriend took me here a couple weeks ago and it was absolutely worth the cold, rainy walk there. We were their last customers of the night so service was a little slow but the server was very nice. The food was amazing. I had the roasted duck and it was cooked to perfection. It was tender, juicy, and so delicious. My boyfriend got the veal and he has the most amazing lobster mashed potatoes. We also shared the pizza margherita and that served as a great appetizer for us because we were starving when we got there. We were both really pleased with the meal and I hope he takes me back there again sometime."}
{"text":"Three people on a Wednesday night.  Sat downstairs, which is like eating in the foyer.  One glass of wine, two personal pizzas, bowl of pasta and 3 salads equaled a tab of $60 before tip.  The pizza is great, but the total experience was meh.  This restaurant ought to have a lower priced menu for the folks sitting downstairs and getting food dished out by the bartender, and a higher priced menu would be fair for folks sitting upstairs enjoying the white tablecloth experience. I'll go again, but a $7/three-ounce glass of wine ought to be enjoyed upstairs, and was simply incongruous for the casual meal-in-the-doorway we had."}
{"text":"We order oyster as appetizer and two entries. i would say it is ok. not special or surprise"}
{"text":"I had a nice Valentine's Day experience at Timpone's. The decor is nice and impressively unpretentious for Champaign.   First off, I loved the rioja I ordered, some of the best wine I've had in a restaurant. The Caesar salad was pretty good. I was happy with the lobster bisque soup, which was sprinkled with bacon and chives, but it wasn't anything out of this world for $12. My girlfriend ordered the chicken clam chowder and although she liked it, I thought it lacked seasoning.    For the entree, my girlfriend got the spinach tagliatelle and again I thought it lacked seasoning. She thought it was perfect. I ordered the anatra (roast duck) came with Brussels sprouts, sweet potato purée, and cranberries with a sweet sauce. I generally liked it, but was disappointed that the Brussels sprouts were just boiled and sliced into fours (no seasoning/salt/marinade, etc).   We ordered the peach/blueberry crisp for dessert and it was pretty good. Overall, the food is good and the service was excellent, but I'm not convinced it's worth the prices."}
{"text":"I really love their seafood risotto. Leaves a very healthy and tasty feeling."}
{"text":"Would love to give Timpones 5 stars for the food, but decided on 2 stars because of the one terrible customer service experience we had there recently.  When we first got there, we approached the host stand, only to be greeted by an extremely rude, middle-aged male host. Because it was mom's weekend, we made a reservation one week early for 5 people. Last minute, I decided to bring along a 6th person, assuming it wouldn't be a big deal to add an extra chair or to squeeze a little.We are a low-maintenance, close family, and we figured a little squeeze was worth having an extra guest.  The host abruptly cut me off as I explained this, and said \"there was just no way we could squeeze.\" I explained again that we didn't care, and again, he looked at me and said, unapolagetically \"we just can't do it.\" My friend and I awkwardly sat there for 5 minutes as he stared at us, almost as if he was kicking one of us out of the restaurant. He didn't help   us at all or try to accommodate in ANY way. I understand it was mom's weekend, but it was the end of the night, and the place was starting to clear out anyway. I am personally a host in downtown Chicago, and never have I ONCE turned away a customer for the same reason. He didn't even seem to care that she had to leave, and the restaurant lost probably $30 of our business.  When I talked to my dad, he had also said that he experienced a rude phone call with the host.  Timpone's, you have great food and great waiters, but that host was one of the rudest I've ever experienced."}
{"text":"The appetizers were tasty; risotto cakes, and crab.   Short ribs were perfect, but the portion could have been larger.  Hangar steak was excellent.  Fig pizza was really different, but it worked.  Dessert; pineapple upside down cake with ice cream was sweet and tender.  Chocolate mousse and lemon tart were nicely done.  Conversely, the waiter was not very helpful when it came to ordering wine.  He made no attempt to help suggesting anything, he may not have known the wine list?  They have an extensive wine list, which should have a knowledgeable staff.  Our waiter was no student, he just didn't care.  Also, he rushed us to put in our dinner order, and the food came too quickly.  The place was not busy, don't know why this happened.  Perhaps it was because I was a female.  Often, we get treated differently when dining without a male."}
{"text":"Every time I've gone to the Canopy Club to see some raucous rock show, I've always wondered if folks at Timpone's were being disturbed by wailing guitars and so forth.  Still no answer on this but I have found that it's somewhere I'll want to be coming back to.   Well, I ordered the papardelle with the bolognese. Being a bolognese snob (and believing very sincerely that the best bolognese I've had was made by yours truly), I have to say it was certainly up to my standards. In addition, I had a slice of my neighbor's margherita pizza which was also tasty. I've not been to any other Italian restaurants in town, but this is Chicago-quality stuff right here.   While it's a little on the expensive side, it is finer dining. It's not somewhere I'd expect to go every day for lunch but it would be nice for special occasions, dates, etc."}
{"text":"This was my 2nd visit to Timpone's and just like the previous time, I was satisfied dining here. It's a nice Italian restaurant in campus, less fancier than the ones in the downtown Champaign. For a good dining option next to Microbiology dept, this is a great choice. We were a group of girls who wanted to celebrate an occasion and this place was perfect with choice of good food and drinks. I had the Trout on their special with Pinot Gris.. the fish was flavorful with the right amount of spices, and the veggies with potatoes was perfect with it. My friends'  food also tasted delicious and we all had an amazing time eating and drinking. This place is small. The downstairs near the bar has few tables while upstairs had more. Although we didn't have a reservation, we were lucky to get seats immediately. But since it's a small place, a reservation will be a good idea. The service was good and spot on. A great place to dine in campus."}
{"text":"This place is a hidden gem. Went for lunch today and the experience was wonderful. Server was attentive, they graciously accommodated us even though they closed in 45 minutes, and the food was beyond delicious. We ordered the mushroom pizza as an appetizer, the steak burger (cooked perfectly medium and only available on the lunch menu), mushroom ravioli, and the spinach tagliatelle with chicken. The menu changes often and I've been there multiple times and enjoyed my experience/meal. Definitely a special place to take out of town guests but we also enjoy it for a lunch or dinner when we're feeling fancy! I do agree that the portions are on the smaller side compared to other restaurants (of lower quality) but I feel very satisfied after because the food is good quality and delicious. You get what you pay for here."}
{"text":"This place has been here for a long time but I think it's still trying to figure some things out  The menu is very ambitious for a campustown location, serving up \"campustown\" pizza along side upscale American/French/Italian fare.  The dining room is upstairs and is nice enough in a traditional way, but the look and ambience are very dated.  The quality of service is not in line with the menu.  Our server was clearly overwhelmed.  Our table had white linens bespeaking of a \"nice\" restaurant but was set improperly.  Wrong silverware, no bread plates.  We sat for quite some time before our drink order was taken, then our waiter left in the middle of taking the drink order to serve food to another table.  He eventually returned to take our drink order and then asked us for our entire food order at the same time.  Bread service was slow though the bread was good.  The glass of riesling we ordered was clearly from a bottle that had been left open for too long.  Another glass from a fresh bottle arrived after a while.  We ordered some salads to start off the meal.  The bistro salad looked great - field greens, asparagus, potato, poached egg, bacon, vinaigrette.  However, when the salad arrived, there was no bacon.  Ahem.  \"Excuse me, but our salads have no bacon.\"  Response: \"OMG, forgot the bacon.\"  Instead of taking our salads away and giving us new ones, we were given small bowls of bacon pieces to put on the salads ourselves.  Please.  We ordered a wild mushroom pizza with sausage and gorgonzola but we wanted to substitute goat cheese for the gorgonzola.  We were told this was not possible.  Restaurant policy is no substitutions, just subtractions.  We could remove the g-z but could not add goat cheese.  We ended up using the build your own pizza option and built the pizza we wanted.  What a pain in the a**!  The pizza was delicious though.  The thin crust must be one of the best I've ever had.  The entrees were generally very good.  The American \"kobe\" skirt steak was tasty, having a sweet marinade reminiscent of Korean kalbi in flavor.  The duck breast was well prepared.  The trout was overcooked but was still edible.  The desserts were adequate and there is a good selection of after dinner drinks and dessert wines.  In summary, Timpone's has an identity crisis.  If they want to serve this type of food, then there is a level of service that is expected to go along with it which they did not meet.  It's hard to enjoy any restaurant when you are unhappy with the service.  My recommendation is to go for the pizza - then you won't need a bread plate."}
{"text":"I don't comment unless it's mindblowing or horrid...  If you're looking for \"italian\" go to olive garden or some crap place like that.  Timpone's has a seasonal menu, diverse offerings, and expertly prepared foods.  I don't think Timpone's bills itself as an \"Italian restaurante\"  Okay, pasta is on the menu too, but is that all it takes to be pigeonholed about being Italian?  Or the name?  Yes, the decor is bad.  But the food transcends...  Far & above, it is the best place to dine in Champaign/ Urbana.  Timpone's offers the freshest, most expertly prepared cuisine that I am aware of, and, for the quality, it is under-priced."}
{"text":"This was the first time in two years that I returned to the restaurant - primarily because the average cost of a meal is about 35 dollars per person with tip. We ordered the grouper and the pasta with bolognaise sauce, and their thin crust pizza. Overall the dining experience was mixed. The service was pretty good but the food was just blah. The grouper wasn't presented well and it was such a small plate; the pizza was a fig pizza, gorgazola, proscuitto was a little dry - the combination of ingredients didn't work, but the pasta was very tasty - again - very small plates. What 's dreadful about this restaurant is the ambiance and the decor (circa 80s) and that they charge $1 for an order of six slices of bread. When asked, we were told that patrons have asked for refills and the management was covering costs. what a lame excuse!  Also its not as though they served bread that's to die for - its just a VERY small loaf of freshly baked bread - no big deal!Try another restaurant - i won't be going back anytime soon."}
{"text":"I think this place is great.. probably the best Italian you can get in town and so much better than the Great Impasta or Biaggi's.    The service can be a hit or miss.. and yes, the stuff on the menu can be pricey.. but it's well worth it.  Great date place!  Try one of their goat cheese pizzas (it's not like Papa John's at all), specials (especially if it's steak or anything with foie gras), and creme brulee.  I'm not crazy about the tiramisu.. I think it's a bit too alcoholic.  The best thing about it is that it's on campus.. so even students can go there on a school night."}
{"text":"Went here for a lunch about six weeks ago (takes me a while to digest my thoughts, so to speak). Had a goat cheese pizza, and it was PRETTY TASTY.   Prices were right for a joint of its kind, and the place itself had a nice decor, which made it, all around, really solid."}
{"text":"My wife and I came back to UIUC  for business and decided to hit Timponi's for dinner. I had the tagliatelli and shared a portion with my wife. An hour later back at out hotel, my wife and I weren't feeling very well. While my wife only had an upset stomach, I was severely hit with a stomach ache and all that comes with it! I'm still feeling ill the next day. My wife called to tell them that we think that we were food poisoned and they were very abrupt and told us nobody else got sick and to maybe stop having such a negative attitude.  I'm so disappointed on this restaurant and I am sad that we have to take it off of our list of places to visit whenever we visit UIUC."}
{"text":"It's kind of funny how you go through your college years with a certain perspective on cost.  Back in my day, anything over 5 bucks for a meal was expensive.  I never went to Bread Company or to Timpone's until after I came back to visit my now wife.  But now?  I'm freaking rich, bitches.  I can order what I want, where I want.  That's right.  12 bucks for a plate of awesome pasta with bolognese sauce? Why yes, I can afford that.  I actually have a paycheck that isn't from wiping tables or undergraduate research!  The times I've been to Timpone's has always been impressive.  My most recent visit, however, made me appreciate this place all the more.  I can't say that I've had a better pasta with bolognese sauce.  Sure, it's a seemingly absurdly simple dish, but everything about the thing was just right.  The wife got a fried oyster and spinach salad that was extremely delicious as well.  I kept meaning to ask what sort of oysters they were, because you don't typically see consistently small oysters like that.  Alas, the mother-in-law has since moved away from the Champaign/Urbana area so our visits will be fewer and farther in between.  I'll have to make it a point to visit this place whenever we aren't stuffed on pokey stix..."}
{"text":"Last summer, I was in town for an afternoon, and I ate the apple, onion, ham, and gruyere panini. The fact that I remember the panini is a testament to how good it was. I still talk about it. I've tried to recreate it, but I haven't yet reached its level of perfection.  For reference, lunch was about $12--pretty reasonable!"}
{"text":"I came in with one of my old roommates to catch up after coming back to school from winter break. Neither of us had been to Timpone's, and as avid fans of Italian cuisine, we figured it would make a nicer dinner.  No waiting on a Friday night at about 6pm, which was good. The layout of the restaurant is a little strange. The bar/lounge area is downstairs and the dining area is upstairs. The dining area itself was pretty small, but charming. The inside of Timpone's feels very old school. The dim lighting, super quiet dining room and vintage décor was a trip back in time.  We sat down in a close-quarters booth and perused the menu. I was a little let down to see that bread and oil was $1, as opposed to a given like it is at most Italian restaurants. We ordered 2 of these to ensure we both got to try it. The bread itself was fantastic, very warm with a crispy outside and soft inside. The oil didn't exactly impress me, and we had to ask for some cheese to go with it, still not bad though.  We did order a couple glasses of wine. I had a red that I can't remember the name of and he had a pino grigio. The wine wasn't bad and went well with our dinners.  I decided on the spinach tagliatelle and I can't quite remember what he got, but I believe it was the other tagliatelle dish with prosciutto, tomato and artichokes. My dinner was delicious! Believe me, I had some doubts about authentic, quality Italian food in Urbana, but Timpone's really impressed me. Everything was done right and was fresh, flavorful and fantastic. It was quite rich and I was very full afterwards. The portion size wasn't as big as I had thought it was going to be, but I was not disappointed because I was definitely full after I finished my meal. Pricing seemed to be in line with the quality of the food, perhaps a little expensive but definitely not unjustified due to Timpone's focus on sourcing local, seasonal and fresh ingredients.  I forget our server's name but she was knowledgeable, friendly, and there when we needed her.  Overall, a solid experience at Timpone's, I will definitely go back!"}
{"text":"First time coming here with a bunch of friends. Many of us ordered the Fettuccine with Salmon Pasta, which was horrible. Not a single one of us thought it was decent. I had a difficult time choking it down after a whole hour of picking at it. Service was pretty good, although the food was not that great for the price you pay.  The portion sizes are very small. The beef tenderloin was way above its price range for the amount you get and there's better out there. Overall, my experience was pretty bad... The creme brulee was the only thing that was worth praising there, although it is a tad too sweet for many of us."}
{"text":"I'm rather surprised at the reviews here. This place is expensive, and the portions are smaller, but that's how high-class dining works. If you want big portions (and often I do, so I understand the desire), go to Nyro's and get a triple gyro plate.   The food is superb, and the waitstaff is excellent. The interior is very cozy and lodge-like (upstairs, anyway). Also, I typically don't like gourmet pizzas (I'm a blue-collar pizza kind of guy) but they really have some excellent pizzas here.  On busy college weekends (like parents' weekend or whatever they call it) it's tough to get a reservation here. It's also the place that visiting scholars are often brought to be dined.   The food will not disappoint."}
{"text":"\"Three raviolis in my dish?! This better be the appetizer portion!!\"  My experiences with TImpone's are fairly inconsistent. Food is not bad tasting in any way, but I always leave just a little dissatisfied. Portions are incredibly small and well, if you wanna be \"that kind of place\"...you should move out of Champaign. It's fine for a date, business dinner, something of that sorts, but definitely not the kind of place I'd keep coming back to."}
{"text":"First time I was hear the food was pretty good, but I came back recently for their Italian Sandwich and it was terrible -- just meat and bread, nothing else.  Update: came back and tried a pasta dish. It was completely overcooked and had the consistency of paste. Blech."}
{"text":"I love this restaurant. It's warm yet a fancy restaurant. It reminds me of a restaurant that you would get dressed up for. The waitstaff are incredibly professional like waiters should be. They're polite, they bring you a fork and knife new if you had an appetizer. The food is AMAZING. It's unique and 4 stars and different every night. They have many special appetizers (all delicious), pizza, pastas and entrees from steak to scallops to lamb to halibut. Everything is homemade even sauces and dressings. Back to the waitstaff, they're all college grads and formally trained. That is so refreshing. Dining out and having excellent service. You never have to look for them to refill anything (unlike many downtown Champaign restaurants.) The chef comes out and says hello. My only issue is that the bathrooms in the winter are too cold, but the restaurant is toasty so it's a small issue. If you want to dine at 4:45 or 8:45PM you can. The deserts are outstanding too. I had a smoked trout on greens with little vegetables and crème fraiche with horseradish... it was amazing as the chef smoked his own trout (instead of the packaged salty kind). Surprisingly parking has never been an issue being on campus. Very well done operation."}
{"text":"Little diamond in the rough. Ambiance and location were great but the linguine I had was a bit  oily."}
{"text":"Great place for a special occasion, very upscale and surprising considering where it is located, with a very knowledgeable staff and delicious food.  Definitely much more of a fine dining establishment than anything else in the area it is not an \"everyday\" kind of place for students but definitely a good place to keep in mind for those special events."}
{"text":"The gnocchi is amazing. It's a little pricey for the portions. I wish my party had settled on dessert so I could have tried the crisp or the key lime pie."}
{"text":"My boyfriend and I came in last night for the Local Flavors event. Sadly, we were a little underwhelmed. Local ingredients are very exciting to me and we've never been to Timpone's. I hear a lot of mixed reviews, everything from \"I had food poisoning\" to \"It's my favorite place when I have a special occasion\". Needless to say, we were excited to give it a try. When you walk in, you must go upstairs to be seated. After being seated, we enjoyed the Italian themed \"high art\" that was so popular in the 80s while we chowed down on a tasty meatball appetizer. We debated the ethics of charging the measly $1 for the bread starter. It was our locally inspired entrees that were especially disappointing. After a long decision making process, I went with the $25 halibut. It came with gnocchi and assorted vegetables. As I ate it, I felt like the fish was a little dry and overcooked and I noticed hints of freezer burn - yuck. After tasting all the components of the dish separately, I couldn't figure out what the culprit was. All I know is, it would hit me every now and again. My boyfriend's dish was the poussin (a baby chicken). It was super tender and was served with a farro pilaf. While it was tasty, the sweet sauce they smothered the chicken in made you feel like you were eating General Tso's chicken. We decided to try the apple crisp for dessert which was amazing! Little cranberries help balance out the sweetness. They did that annoying thing where they garnish it with mint even though there's no mint in the dish.  In the end, I'm thinking maybe it was a mistake that we ordered off the special menu. Perhaps their typical Italian American cuisine would be better. From what we experienced, we definitely felt that the dishes were overpriced for the quality. We spent $100, and left feeling like it just wasn't meeting the quality we've seen at other places nearby. For $100, you could have a perfect meal in downtown Champaign. For $50, you can go next door and have a pretty awesome meal too! I'd like to come back and try the regular menu but, I'm not in a hurry to come back and spend the kind of money they're asking for mediocre food."}
{"text":"The food wasn't memorable, but the service was.  Our waitress had no idea what she was talking about and seemed abrasive and rude!  Unfriendliness aside, she didn't even do her job very well.  It's expensive, and just based on service alone, I wouldn't go back."}
{"text":"They really do a good job.  We invited 20 clients to go last night and called with a 1/2 hr notice for a reservation.   They balked, but said they could do it.  We arrived and they accommodated the group just fine.   We relaxed with a few bottles of wine ordered our meals and enjoyed some appetizers and conversation.   Soon, everything came out of the kitchen and was great.  Later the Chef or Owner came up to check in with us and received great feedback from all.  The meal was a success and everyone was happy.  We will be back!"}
{"text":"This place was great.  I was very impressed with both the food and the service.  Me and my sisters went to this place for dinner.  We got the linguine pasta, the ravioli, and the Timpone's original pizza, and house salad.  All the food was delicious! And the waiter and chef were so accommodating.  My sister had a food allergy to the item she ordered and they immediately apologized and offered to get her new food.  I would highly recommend coming here."}
{"text":"Timpones. We treated my parents after a long trip. We were in Champaign when they first opened around 1984. The chef was exceptional then and now. The starter fig pizza with prosciutto was crisp and tasty. We ended up sampling each other's dishes including the seafood risotto and fresh pastas. The most outstanding was a real gnocchi, light and fluffy paired with a scrumptious lamb Raghu that melted on the tongue. For dessert, creamy cappuccinos and a steamed bread pudding worth dreaming about. Beyond that the staff was gracious and warm. A perfect lunch. Thanks Timpones!"}
{"text":"This is one of the few VERY nice restaurants on campus! Obviously since most students are poor they don't offer many fine dining experiences but this is one!  The food is Italian, which is your normal Italian. The atmosphere is great-cozy and romantic at times.  Everything is made fresh and tastes awesome! We got introduced to the owner and the Chef which made it even more enjoyable!"}
{"text":"From handsome waiter to friendly chef, great dining experience in campus. Quite and classy. Food is great I have to go on diets later after stuff myself too satisfied here.  Will recommend to anyone want Italian food in town"}
{"text":"I went here for a professional networking event during lunchtime on a weekday. The environment was very nice. Would make an excellent spot for date night. In the middle of the day, the lighting was pretty dim and I would have liked to see a few more windows open. The food was excellent and I think fairly priced (expect to pay around $15-20 per plate). I got a goat cheese pizza and a salad. Both were great. Highly recommend!"}
{"text":"Having gone to Timpone's for the first time for dinner with Sean Astin and the rest of the IUB Enriching Programs committee, I thought my lunch experience here would disappoint.   The bar is on the ground floor and we got seating on the first floor.  We ordered a Margarita pizza, two 8oz hamburgers (one with avocado one with cheese), and I ordered a Tagliatelle with Chicken Breast, Prosciutto, Peas, Tomato Cream, Basil, Romano.   I've had the pizza here before and it's not bad but the pasta I had today was pretty good. The portions were pretty small though- it could just be that I'm comparing it with other campus eateries, when this is on a whole nother level. This is the first time I've ever been here for lunch and I have to say that I'm impressed. I had a great time.I strongly recommend the Burgers here -they're cooked to perfection and priced just right.   This is a classy place so make sure you wait to be seated, even for lunch! My only regret is that I didn't explore their beverage selection..."}
{"text":"I have to say that I was really skeptical about eating here after going to other Italian spots around here, but damn... Way to represent, champaign, whoops, my bad, way to represent, URBANA!!!  I love this spot!!!    The portions look hella small (my friend who paid - looked at my dish and was like \"you sure that's gonna be enough?\" and it was!! It's like space food, you wet it and poof it goes bigger) but it's enough, trust me.   They are creative with their dishes (spinach lasagne special - uh yum?) and well worth the money I spent.   And also, the seafood tasted fresh, not rubbery from the freezer (they might be my go to seafood spot if I get a raise - sorry, red lobster).   They don't have ginger beer so no dark and stormies or Moscow mules, but they did inspire me to start making my own ginger beer (you can't have none).   Creme brûlée wasn't spectacular but their bacon caramel bread pudding, I swear it's like Einstein and Julia child had an Italian baby and the baby works in this kitchen.  The service was great, too.  Kerry (I think) was attentive in just the right way.  And he was honest with the things he knew and didn't know, and sold us on the specials (thank you, Kerry!!)  Cons: accessibility. There is a downstairs portion (where the bar is) but if someone who was wheelchair bound didn't want to be around that area, I don't know if the restaurant accounts for that.   Otherwise, if you want to impress ANYONE bring them here."}
{"text":"Okay, I went for my second visit....Just as absolutely fantastic as the first.  We had the salad with asparagus and a poached egg...the bomb.  We had pizza again. We noticed every single table had a pizza on it..  That says it all. The BEST. And the macadamia crusted Mahi was divine.  The sauce was to die for. We fought over it at the table. (yes, we share good food amongst friends).  Remarkable food. The best in Urbana."}
{"text":"Dined for lunch and dinner on separate occasions. Casual enough for friends, families, and dates (though you should call ahead and mention that so they can seat you in a more private area).   The pizzas are on the smaller side when compared to Papa Johns, but the quality is superior. They're meant to be shared, sliced in easy to take slices. If you want big portions loaded with fat, go to Olive Gardens or Pizza Hut.   I had the roast beef sandwich for lunch, and my god it was the best I've had in CU. Juicy, meaty, a traditional American feel. My only critique would be the okay service (it's spotty overall) and an overdue revamp of the outdated restuarant interior, as well as replacements for silverware and plating. Though who minds a little scuff when you've busy eating!"}
