{"text":"nachos are a must try. chana masala taco - an interesting attemp at indian cuisine. overall, will eat with them again..."}
{"text":"Killer Kim chi dillas!!! Jeff added some brisket to mine and brought it to another level! Give it a try, you won't be disappointed"}
{"text":"Not only are the tacos stellar and unique. They are also one of the most honest people I've met.  I accidentally over tipped a ridiculous huge amount and they called me out, cancelled my receipt,  cut me a new one. I wouldn't have known but for their honesty. Thanks guys and keep making tasty tacos.

Update : as an Indian I can vouch for the Chana masala tacos, the special shrimp tagardashi was incredible"}
{"text":"I love The TIN Kitchen. The truck comes to my office building Tuesday's for lunch and it is one of the highlights of my week. It's not the cheapest food but its not expensive, especially for the quality. Everything on the menu is absolutely delicious, and I mean EVERYTHING. I normally get a quesadilla, 2 sides and a drink for $10. You can also get 3 tacos and a drink for $10 as well."}
{"text":"Brisket nachos are the bomb! Staff is great. Very friendly."}
{"text":"Had the 3 taco combo with chips and salsa. The sizes of the taco were pretty small. I had the pork belly, thai shrimp and the BBQ brisket. Pork belly and Thai shrimp were tasty but small. The BBQ briskets were over cooked and dry.

Overall decent tacos but a little pricy."}
{"text":"This is one of my favorite food trucks in the QC. It began my love affair with local food trucks. It's a great deal. Each taco is $3.50, so you can easily mix and match different flavors to create a meal. I love the beef brisket taco and the pork belly taco. I also really enjoy the chips with fresh tomato mango salsa. 

You can find the truck at various locations around the city (in front of the Ritz, at food truck Fridays, NoDa Brewing Company, etc.). They post their schedule on their website. 

The staff is very friendly and the food is fresh. Definitely give them a try if they're in your area."}
{"text":"This place was awesome! The guys in the truck were really friendly and the food was delicious."}
{"text":"I had the Korean quesadilla which wasn't what I expected but still tasty. If you are adventurous with food then you might like this food truck but I am not. I wish they had a somewhat simple taco for those like me. Also food truck only open on Thursdays?"}
{"text":"The tacos are very delicious the sliders are very unique and the salads are  amazing I love the simple fact how to go to different breweries you can have your favorite local craft beer with delicious taco quesadilla or even a taco turn in a salad"}
{"text":"Definitely one of the better lunch choices for the people on the north side up Uptown! It's located in front of the 525 N. Tryon building. I've eaten here several times and I've yet to be disappointed. If the tacos seem a bit small, opt for the chips & salsa side. It should be enough food to hold you over till dinnertime. I've moved office buildings recently but I don't mind taking a stroll to grab a couple tacos from this food truck."}
{"text":"I have a confession...this was my first time eating at a food truck, and, boy oh boy, did the TIN Kitchen set the bar high for others! We arrived right at 5:00 while they were still prepping for the night. We were fortunate to be the first ones in line because it quickly grew.

As stated in the other reviews, the owners are super friendly & answered our first-timer questions. We ordered the vegetarian cauliflower & fish tacos and were not disappointed. I chose the bean salad as my side and it too was delish!

I can't wait for my next stop here!"}
{"text":"Refreshing change of pace from the food choices in charlotte. Everything I've had is fresh and local. The Thai Shrimp tacos  were great."}
{"text":"Rookie Food Truck person!  First off, they are so friendly when you walk up, you are completely at ease perusing the menu on the side of the truck and asking questions.  Placing the order was easy-peasy.  Hung around in parking lot trying to look I wasn't scoping the place out to hot wire the cars but that's not the Tin Kitchen's fault.  It is was it is (thank you John Fox) - food was melt in your mouth delicious - braised beef tacos stuffed full of slaw and meat - wonderful combination of tart and spicy - but those pickled veggies were off the chart good - hint:  order a drink to soften the heat from the veggies.  Will be a regular from now on.  These Guys Are Good!"}
{"text":"By far the best food truck in Charlotte. Their staff is very friendly and professional. The buffalo cauliflower is a must have!"}
{"text":"We booked Tin Kitchen for our wedding party. They arrived on time, with plenty of staff. They set up quickly and fully explained to the guests the menu and the specials. The food was hot, fresh, and delicious. We had so many people say that it was some of the best wedding food they have ever had. We will continue to seek Tin Kitchen out around town and would book them again in a heart beat for future events. Thanks!"}
{"text":"The gentleman running the truck was very VERY friendly (wow, someone who cares about customer service), the menu was delicious, food was reasonably priced and what we got more than surpassed what we paid.  The special of the day was the Mahi Mahi taco (which my neighbor said was THE BEST meal he has had in Charlotte). It was a perfectly (coming from perfectionist Texan yee-haw neighbor Ryan, it was PERFECT) grilled piece of mahi, on a deliciously grilled tortilla with a piccata sauce and crispy anchovies topped with some fresh slaw that was still cool and crispy. The combination of the fish, the piccata and the slaw-chovies was better than anything he got in Texas (I will let you know what he says in response to this, because nothing is better than food in Texas).  He loved the truck so much, he declared he will undoubtedly be back for more any chance he gets (for only 9 bucks).

Other menu options included the gut bandit choice of Thai Shrimp Tacos - tender shrimp simmered in a Coconut Curry Broth topped with a crisp Thai Slaw - side of choice was beans and hot damn those beans were good.  For 8 bucks, you can't get anything better in Charlotte.  Plus, you don't have to wait a decade for someone to notice your drinks are gone and you have been begging them for your bill.

http://gutcharlotte.wordpress.com/2012/04/02/the-gut-awakens-thanks-to-the-tin-kitchen-food-truck/"}
{"text":"Great food for the food truck usual price. I had the Chicken Tinga Tacos and my girlfriend enjoyed the Pork Tacos, They were both excellent and I would love to try more from them."}
{"text":"I have been to this food truck only one time, but was very impressed with the quality of the food and friendliness of the staff.  We were lucky to be first in line for our visit because shortly after they opened there were more than twenty people waiting. The Buffalo Cauliflower tacos were a great and inventive vegetarian option."}
{"text":"Stopped by the food truck today for lunch. After spending $10.82 for 3 taco combo/drink, i'm quite disappointed and still hungry. After eating 3 tacos anywhere else, I'm normally full and can barely take another bite. The tacos are too small and left much to be desired."}
{"text":"YUMMM! The drunken chicken tacos are so fresh and amazing!"}
{"text":"Awesome food and awesome serivce. Definitely worth tracking the truck down. Get the BBQ sliders!!!!!!!"}
{"text":"Rick Baylis brings  American cuisine to new creative heights at The TIN Kitchen. He makes excellent use of   American ingredients,most of which you will never see at Taco Bell."}
{"text":"Wow. Creative food actually executed well. The mix of seemingly incongruous flavors is pulled off seemingly with ease. A Pork Belly Taco with Kimchi and Hoisin sauce....REALLY? DELICIOUS!!!!! Very, very well done."}
{"text":"Fantastic taco truck.  I visit every time they are in Uptown, usually in front of their now-opened but not as good cafe.

If I have any complaints, they are occasionally a bit slow and the tacos are on the small side.  Get a bigger side, like the side salad, to help tide you over.

I can say I'd pay the $4 for an extra taco or would have no problem with being hungry again in 3 hours after getting their meal.  The BBQ brisket taco is a favorite that contains plenty of meat.  I never thought I would believe it but the buffalo-cauliflower tacos are shockingly good.  Ingredients are well flavored and taste very fresh.

Their pork shoulder special may be one of the best tacos I've ever had.  More on the expensive side for lunch on Tryon but certainly among the tastier available."}
{"text":"Price is a tad bit pricey but it is quality food.  I don't really have a go to item but every sandwich I have gotten has been good and their salad dressings for their salad bar are really good."}
{"text":"I first tried the Tin Kitchen at the Tread the Thread 5K race down at the Anne Close Springs Green-way and had the pork taco.  It was freaking AWESOME!  The guys did a great job handling a huge crowd (100+ people) while still maintain quality.

I just ate here for lunch at the Tryon & Morehead location in-front of the Catawba Lands Conservancy office.  I had the salmon taco with pineapple pico and cilantro-jalapeno rice.  Again, it was an excellent lunch.

Want to give a BIG thank you btw to these guys.  I didn't' read the dish entirely and missed that it came with an aioli sauce.  I can't eat aioli due to a food allergy, so I was disappointed at myself when I got my lunch.  Explained to the guy I needed to order another taco, but without the sauce.  Even though I offered to pay, he gave me the new order for free.  PEOPLE, THAT IS CUSTOMER SERVICE !!!

Couple things about the food..... yes the shell is slightly oily, but crisp.  It is a bit pricy for my normal lunch budget / amount of food, but I realize I am paying for quality not quantity here.  The rice is good, but didn't have any jalapeno flavor at all..... I was actually grateful for this since I am not a fan of spicy.

Looking forward to them coming by my office again next Tuesday."}
{"text":"Delicious soft shell crab tacos. Shells are amazing too."}
{"text":"I always get the buffalo cauliflower sliders and they are amazing every time! Must try you won't regret it."}
{"text":"David and his crew catered our wedding. They were attentive, dressed like chefs...bc they are.. and the guests raved about the food. He made special dishes and was a treat to have there. It was so good. Never missed a beat. These guys are awesome. Go to there cafe TK"}
{"text":"My boss took me to this place on their stop in NoDa.  We ordered our tacos from truck (my first visit I had drunken chicken, my second time ever I had one of their specials) then went into the NoDa Brewery for some beer while waiting.  The man brought our tacos into the brewery for us.  The platter comes with two tacos and a small side.  I got green rice, which is sooooo delicious.

The tacos themselves were sheer heaven.  The filling was delicious and was cooked perfectly.  Needed some napkins as my drunken chicken taco was a little drippy, but I didn't care that I made a mess of myself.  It was delicious and I was off the clock.

I have a frequent visitor card to the Tin Kitchen and I fully intend on filling that card SOON."}
{"text":"Excellent, fresh tacos. This was my first visit and I went with the cashier's recommendation of the pork belly taco. It was so good I had to run down and get a couple more! I'll definitely be hitting this place again!"}
{"text":"I have to say I've been waiting for the chance to try Tin Kitchen for about a month now. I feel like I have been chasing them all around the city and have never had the chance to catch them. Well, the chase is over, but the reward didn't live up to the hype.

I had four different tacos and I thought they were all sub par. The tortilla was disgusting and the flavors just weren't there. Pretty disappointed. I am going to try Food Truck Fridays one more time before ruling it out."}
{"text":"Changing my three stars to five. I've eaten here several times since my first visit and the service and food have been perfect every time. 
.
.
.
You definitely can't find any other food like this around Charlotte. unique delicious menu items and plenty of vegetarian options. I got two tacos (shrimp and buffalo cauliflower) and three portobello mushroom sliders. The sliders were even better than I thought they'd be. Even my picky \"meatatarian\" boyfriend loved them which I consider a huge win. However both my tacos were cold and the tortillas were stale as hell. Not a big enough inconvenience to give up on them though so hopefully they'll be better next time I stop by."}
{"text":"Always a great experience at Tin Kitchen! Haven't had a meal I didn't like there, love the Pork Belly and Togarashi Shrimp tacos. Don't forget to check out the specials."}
{"text":"Always on the move, this food truck is a staple in the scent of Charlotte. Often found parked outside the Charlotte Speedway, you can always find a great bite to eat when you're there. Referred to as a \"Gourmet Food Truck\", it also serves up great platters for catering events. You'll find fresh ingredients and originally creative creations here - all delicious to the last bite. They are excellent with their selection of tacos, quesadilla and sliders amongst many other choices. Famed for their Buffalo Cauliflower Sliders you should also try the Chana Masala Tacos! But the train doesn't stop there, menu items such as the Chipotle Chicken Quesadillas, Thai Coconut Shrimp Tacos, Pork Belly Tacos, Skyline Chili Nachos, Grilled Mahi Salads, Lamb Meatball Sliders, and the list continues. Use their food truck locator to find their current location, it's worth every effort to find it."}
{"text":"I got the Korean BBQ and pork belly, and they were excellent. The beef was moist and flavorful while the pork belly was well cooked. Being a food truck, the tin kitchen is also reasonably priced. It's hard to go wrong here."}
{"text":"Wowzers!! The Curried meatloaf sliders & Cauliflower tacos will breathe LIFE into you. Yum +++++"}
{"text":"If you're looking for a crowd pleasing group meal, consider TIN Kitchen Catering! I ordered a catered lunch for my team, and it was a huge hit. They were incredibly responsive to my initial inquiry, ordering & payment was a breeze, and the person who delivered couldn't have been nicer. It was also super easy to pack up leftovers - that made for a great dinner! Highly recommend"}
{"text":"I won't go overly long on this review, I think it's enough to say that these guys are just awesome. Every time I've eaten here, either at a Food Truck Friday or out in Uptown, they've delivered the goods. Fresh, flavorful and varied, they always surprise with their options. And they've had a few deals on Yelp, so keep your eye out to save a little, since it isn't really a cheap meal, but the ingredients are all well sourced and the guys obviously care about what their doing so I don't mind paying a little premium. Keep it up!"}
{"text":"If I ever had to chose a last meal it would be at The Tin Kitchen. The Pork Belly taco is outstanding as well as BBQ Brisket Taco. The daily specials are always a pleasant surprise and never disappointing!!!"}
{"text":"Buffalo cauliflower slider: insanely good!! By far, the best, most interesting and well-executed item I tried at Food Truck Friday. The cauliflower still had crunch, which some people might not prefer, but I thought it gave the slider good texture. The buffalo hot sauce was spicy but the blue cheese crumbles balanced the spiciness. The slaw on top was icing on the cake. Absolutely delicious. I hope this item stays on the menu for a while."}
{"text":"We hired the TIN kitchen food truck for our event this past weekend and everyone loved it! They were super helpful and communicative during the planning phases, scouted the location a few days before so they could figure out where to park the truck, showed up early to set up and the staff in he truck were so friendly and excited about the food. The food was great, the people were fun and I'd recommend these guys to everyone! 

I had the chicken tacos and masala tacos and went back for seconds... So delicious!  Thanks TIN kitchen!"}
{"text":"I had the special of pan-fried lobster tacos (pieces of lobster, sautéed Portobello mushrooms and arugula in truffled honey butter) and a side of the spicy red rice. Pricey at $16.00 (it IS lobster), but ever so good!!!! This was several months ago, but I still remember it very well. The steak tacos are also quite good!

Christa D."}
{"text":"I had the opportunity to stop by the Tin Kitchen food truck at the NoDa food truck event this past thursday and the tacos we had were extremely delicious. Specifically, a friend of mine and I shared the pork belly tacos and shrimp tacos. You could tell all of the ingredients were fresh as could be and even though I'm not a big fan of the corn tortillas they were served on they were still excellent. 

The only part of the meal that didn't really \"do it\" for me was the chips and salsa that I picked up for a side. The tortilla chips just didn't taste very good and the salsa was way on the runny side which is kinda a downer. Other than that through the meal was perfect."}
{"text":"Excellent tacos from Tin Kitchen! We went to open streets festival and I had to try these tacos.
I tried the beef brisket, chicken tinga, chicken masala tacos. They were tiny but very delicious.
The food was well seasoned & flavorful. I also tried the shrimp taco my bf had & it was full of yummy cilantro."}
{"text":"Went to the TIN Kitchen food truck for some gourmet tacos and had a couple of the pork belly tacos and one of the bbq beef brisket tacos. I liked the pork belly tacos better but I thought they're a bit pricey for what you got at $3+/taco. Creative but just missing a little something to put them over the top."}
{"text":"Everything i would want in a a taco truck.

Solid meat selection, interesting flavor combos, and some delicious corn/roasted tomato salsa.  Me like.

Well played gentleman."}
{"text":"Food trucks and tacos, enough said. I'm a huge fan of food trucks and I'm always happy to see Tin Kitchen at the foot truck Friday events.

Who doesn't love tacos right? Luckily if you don't they have a wide variety of options like quesadillas for you who like to be extraordinary, but trust me when I tell you that these tacos are a must! 

I went ahead with one of their recommended tacos and got the chicken tinga. Omg! This is one my top tacos of all time. Never had it before, but it's now in the top.

I was extra hungry so I got one of their quesadilla specials with chicken. I'm one of those extraordinary people who love things other than taco, but no worries I still love tacos.

I love mixing these great tacos with my beer and enjoy having a nice conservation with the owners and chef of the food truck.

Can't wait for the next Food Truck Friday to have another one of their delicious tacos."}
{"text":"Not usually a big taco fan, so take my criticisms with a grain of salt. I thought Tin Kitchen was a decent, not great lunch. Tracked down the TK mobile outside Gateway Village on a weekday for lunch and used the Yelp Deal to score 3 tacos for $7...not a bad deal at all. 

Here's the break down:

Chana Masala Taco (Stewed Chick Peas in a Coconut Curry Sauce over Date and Apricot Cous Cous, topped with Goat Cheese & Scallions - A little sweeter and not as spicy as your typical Indian chana masala as its stewed in a coconut curry sauce.  Caught myself looking for a little more of the traditional dry, spicy taste, which I'm used to. The flavor and consistency of the date and apricot cous cous seemed to dominate the taco but all-in-all I was impressed with how well all flavors meshed.

Chicken Tinga Taco (Chipotle Braised Chicken with Tomatoes, & Charred Onions, topped with Salsa Verde, Queso Fresco Crumbles, & Scallions) - This was probably the most traditional of the three and my favorite. I was a little disappointed with the texture of the chicken, a little on the dryer side but had great flavor. Good thing for the salsa verde to compliment the chicken! Charred onions were a great touch.

BBQ Beef Brisket Taco (Slow Braised Beef Brisket with House-made Chipotle Barbeque Sauce, Chipotle Slaw, & Shaved Scallions) - So where I thought the Chicken Taco was a little dry, this taco had way too much moisture. The brisket was dripping barbecue than smothered in chipotle slaw. The taco was soggy before I got around to finishing it. Chipotle overload for me and no other flavor except the scallions to even it out...Meh.

Try it out for yourself, this place has great ratings and just opened a brick and mortar in Uptown so they must be doing something right. Will definitely be trying something other than the tacos next time!"}
{"text":"I haven't been to many food trucks that can pull of Mexican cuisine, but this one definitely succeeded. Their chipotle chicken quesadilla is one of the best I've had, and they have friendly service as well. Just make sure you ask for napkins..."}
{"text":"Well this is my first review, so here we go.  My wife and I had the chance to try the food from The Tin Kitchen when we stopped by the Noda Brewery on 4/28/12.
  
Apparently, they regularly park at the brewery every other Saturday, and since the brewery offers no food, it makes for a good relationship. They had some special tacos, which included soft shell crab and a steak option along with their standard choices.  We both decided to go with the soft shel crab tacos, and I took the red rice as my side while my wife took the pickled veggies.  Everything was very fresh tasting and the tacos were made to order, as we saw them preparing the soft shell crabs on the spot.  The price was a little more than their regular fare at 13$ for the tacos, but it was well worth it. We will certainly be tracking The Tin Kitchen down again in the future.

While they do offer drinks, we were also there for the beer inside the Noda Brewery, but that is for another review."}
{"text":"This food truck was gourmet on wheels!  I tried their steak and shiitake taco and it was heavenly.  From the people walking away with stacks of orders, I get the feeling that everything is delicious.  It was the perfect pairing to the beers I grabbed from the local brewery and was well worth standing in the dusty parking lot for 20 minutes to get it!  It didn't hurt that the young men who worked there were charismatic and easy on the eyes by the way :) shh don't tell my husband"}
{"text":"We found The Tin Kitchen while doing a gallery tour in the South End on a Friday night.  I saw that their special that night was duck tacos and they sounded amazing on the board, so had to try them.  Was really excited and ended up a little disappointed.  The duck was nicely cooked and their bean salsa was pretty tasty too, but the dish felt like it was lacking something overall.  I was expecting it to be a little more spicy or flavorful and it just was missing the kick I was looking for.  The flour tortilla also seemed to overpower the rest of the taco - perhaps if there was some cheese or something else to offset the flour taste?

If the taco had been $7 or $8 I would have been a little less disappointed, but at $10 was expecting it to be really, really good.  It wasn't bad.  It was OK and I'd still give them another chance if I happen to come across them, but I wouldn't necessarily go out of my way to find them again.  Still not bad for my first food truck experience in Charlotte.  Made me happy to see the food truck scene after coming from NY and practically living off food truck food every day!"}
{"text":"Just had the last bite of my blackened tilapia taco with corn salsa and a side salad.  Perfect amount for a lunch.  My first time trying Tin and would definitely go back again.  I am food truck junkie who loves the food trucks in Charleston and Tin Kitchen will give them a run for their money.

See you tomorrow!!!"}
{"text":"The Tin Kitchen has been around for some time & I can't believe it took me this long to try them.

I had their pan fried scallop tacos the other evening & was very pleased. All the flavors combined in two tacos...mmm, I only wish the order came with more!
While I enjoyed the chips, the accompanied salsa was not for me. I'm a traditional salsa gal & when I see salsa with beans & corn, I'm a little sad.  I have no doubt that it didn't taste good, but I don't care for beans, period. 

The gentleman working the truck were very nice & quick with my order. The presentation was nice, too!  Another plus: their prices."}
{"text":"I'm a big fan of anything that the TIN Team puts out. They have been making gnarly tacos and are pretty OG as far as food trucks go in the Queen City. Also, I've loved everything I've had from their Uptown location, which is a totally different approach from the truck. Stopped by these guys for dinner recently and happy to report it's still damn good. 

Ok. Pretty much, I'd be happy to gorge on the buffalo cauliflower tacos, pickled veggies, and a few canned beers. Stellar summertime food, man. We went to Food Truck Friday with some friends and the tacos were just as good as I remember. Picked up the special for the night, too. I think they were bbq pork and were killer. 

The sides really round out the tacos. The pickled veggies and bean salad were both awesome. 

What's the secret to those buffalo cauliflower tacos? Wait.....don't tell me. I don't want to know. For now, I'll just tell people that it's magic. Which probably isn't far from the truth. The whole truck is full of some iteration of taco sorcery that I'm forever dig. Keep em comin, boys.

Hat's off to you, TIN Kitchen."}
{"text":"Cauliflower Tacos - INCREDIBLE!  So good that I'm planning to recreate them at home.  The buffalo sauce packs some heat, but is balanced by the cheese.  Even if you're not a vegetarian, you'll be sure to enjoy this.

Lobster Tacos - These were good, but given the price ($17 for 2 tacos), they had mostly mushroom and minimal lobster.  

Bean salad - Cold and refreshing on a hot summer night."}
{"text":"Tin Kitchen does it again!

I almost always get the buffalo cauliflower salad from  this truck on Wednesdays in Southpark. It's fresh, healthy, spicy and refreshing at the same time. Cauliflower is ultra flavorful and the celery root slaw is just different enough to be truly notable. One time I got a bad cup of blue cheese dressing on this salad but when I let the team know about it they apologized and offered my next salad on the house. 

Today I went for the chicken quesadilla combo. Wow! What delicious flavors!! Smokey roasty goodness. Well balanced and well executed quesadilla. Their cilantro rice side is like CRACK to me; I'd eat it by the trough if I could. 

Give these guys a try. They are kind and their food is a notch above that of many other trucks."}
{"text":"I've had to stop getting nachos from other restaurants because Tin Kitchen's far exceed anything else I've ever had."}
{"text":"Went back and got the Korean BBQ brisket siders... Wow... Life changer! Came back to add that extra star!"}
{"text":"Yay for the Tin Kitchen.  
 
The location of my place of employment leaves much to be desired when it comes to food options.  So it's a welcome change when the Tin Kitchen food truck comes to our corporate park on Fridays for lunch. 
 
The menu has something for everyone - from the meat lover to the veggie lover. On my last visit, I got the Blackened Tilapia. Boy, it was good! 
 
The guys are so friendly! And you can tell that care was taken for each order - their mise en place must be meticulous because the tacos come out so beautiful.  Yes, tacos can be presented beautifully! Looking forward to next week!"}
{"text":"Stumbled on this little gem casually and it fully won me over! The people who work here are very nice and create an enjoyable environment. It's a clean food truck and the food presentation is very nice. The food tastes great and the portions are well worth the moolah. It's one of the most popular food trucks in the uptown area and I can see why. If you see it, try it out!"}
{"text":"This vendor was parked at NoDa Brewing and they always have good food trucks outside so I gave them a try.  I had the carnitas and they were super bland and flavorless.  Carnitas should never be dry. So I went back up to get some salsa to bring in a little more flavor and moisture, and they charged me 50 cents for salsa! That's an extreme ripoff. The tacos were already $3.50 and very small, so it's not like they couldn't afford to throw a little tiny container of salsa in. I would not go back to this food truck."}
{"text":"They were my favorite food truck at the Charlotte Food Fight. Their special dish for the event, the scallop tacos, were amazing. They need to add these tacos to their regular or seasonal summer menu. Boy were they good. I also had a pork belly taco and the Korean bbq sliders. All were delicious. Will definitely be stalking I mean following this food truck to see where they are for food truck Friday's and any other day of the week I'm in the mood for a unique and delicious taco."}
{"text":"Tried a taco while they were at the South End Food Truck Lot on a recent Friday night.  Tough decision but I went with a Smoked Salmon special taco that had avocado mousse and chipolte aioli and crispy onions.  Hungry yet?  I'm sad that I only had one."}
{"text":"Had it today for lunch as it is convenient at my work building on Thursday! I had the pork carnitas quesadilla which was delicious! I am not a fan of spicy food and although this quesadilla was labeled as spicy, it just has a little kick but not too much to scare away the anti-spicy like myself! The pork was very juicy and I was delighted to see yellow peppers in the quesadilla. Usually most people use green since it's the cheaper of the pepper options. I would return again but I'm only knocking them a star for portions - this quesadilla is only 3 wedges but understandable for a food truck."}
{"text":"I'd like to first off forewarn everyone that the tortillas for the tacos are dripping in oil and crispy on the edges. If you can get past the oiliness, then continue reading...

The food here looks, smells, and tastes delicious. I ordered the BBQ Beef Brisket Tacos which comes with 2 tacos and a choice of a side (I got the cilantro rice).  I wasn't even hungry and downed the dish in nearly 5 minutes flat. Yes, the filling was that good. The brisket was tender and drenched in flavorful sauce. It was accompanied with a slaw and green onions. The tortillas were really oily and on a healthy day I would respond with only a face of disgust. But, at least it's crispy. For a better idea for the level of fry, it's like they dipped it in oil and tossed it on the flat top. It's half way between a soft and hard taco shell.  The serving size is large for 2 tacos, but small for $8 (that's the price of gourmet!). I would love to try more dishes here (gotta chase down the food truck) but I can't quite make this a regular excursion."}
{"text":"It's always hard to make a decision at food truck Friday but Tin Kitchen has never disappointed me and I find myself choosing their truck the majority of the time. Really great quesadillas and the combo option is a great price for a large amount of food. The rotating salsas are always very good! You can't go wrong with this food truck!"}
{"text":"What a clever name! 

I've seen these guys work in pairs or as many as a team of 4 or 5. They hustle! Last week at the Food Truck Friday event, there was a super long line for their tacos. Side note, it was one of those nights that it paid to eat dessert first from Sticks and Cones to hold me over while waiting to order. Once I got up to the front, I was greeted with a friendly smile as if I were their very first customer. 

Their tacos are made fresh to order. You get two in a corn tortilla with a side. I typically get their jalapeño rice and it's tasty. They also offer spicy pickled veggies and if you like a kick, you'll definitely get that. The tacos are good with their own special combinations and spins. I tried the scallop and cauliflower special last time and while creative, I decided cauliflower doesn't quite fit in tacos for my liking. Hubs ordered the veggie tacos and enjoyed each bite. 

These guys do a great job from taking your order to handing over your food. Try them out!"}
{"text":"It might not seem as hip, now that they've been on a food TV show, but they really are awesome. I love the creative foods they offer so much I often miss out on the equally great daily specials."}
{"text":"I needed an easy but delicious catering option for a lunch I was buying for a team of about 30 people. Placing the order was a piece of cake and the menu looked amazing. I was, however, a little nervous considering I based my entire decision on the other yelp reviews. The delivery was on time and super professional. My team was so impressed with their lunch. THEY LOVED IT! I would highly recommend TIN Kitchen as a reasonable and delicious catering option!"}
{"text":"Haven't tried a bite here that wasn't amazing. Try the brisket, try the shrimp. Sides are bit smaller than I would like but I guess that is why they are called sides- I was just craving more beans! They also have rocking Yelp and Foursquare specials that make happening upon this truck all the more delicious."}
{"text":"Sorry, TK I have to decrease your rating to three stars. One reason is the price per size of the taco. Now we know why Guy Fieri ate one in two bites and wanted more. The other, and more important reason, is because the brisket was hard, tough, and tasted like Hormel stew meat out of a can. It was hard to chew, but at least the salads are a lot bigger than the tacos. Hopefully you will see this feedback and adjust as necessary."}
{"text":"Food was amazing. Delivered and set up on time. Our staff unanimously voted to use Tin Kitchen again for future meetings. We got the Buffalo Cauliflower and Tinga chicken. Both were great. The salsa was also fantastic. The freshness of everything was evident. Highly recommend."}
{"text":"Definitely has a kick-ass Korean flair, TIN Kitchen is one of those rare treats that I should seek out more often! Clean, simply designed truck that serves some dynamic and flavorful Tacos, Quesadillas, and SLIDERS.

My two favorite I have tried so far are the Pork Belly Taco and the Korean BBQ Slider. Both have a \"30-minute kim chi\" and both have this outstanding hoisin glaze. I should probably branch out on the menu a bit more but damn did they make a winner here! The brioche bun they serve their Korean BBQ slider on is beyond what you would expect from a food truck, I'd love to know their supplier.

Want to track down TIN? More than likely they are hanging out at one of North Charlotte's breweries. They're one of the few truck teams that are likely in multiple locations at once because they have at least three trucks that I know of! You can go to their website, click on trucks, and see the calendar that's updated very frequently and shows where all the trucks will be. The other CLT trucks should really take note at how TIN is doing their calendar, it's perfect!

Prices are a bit on the steep side, but you only live once. And if you haven't had that Korean BBQ slider yet and you're in CLT, well buddy you just simply ain't livin'!"}
{"text":"We have been looking for a good food truck since moving to Charlotte! We have found it! The pork belly and brisket tacos were amazing! A perfect compliment to out beers at NoDa Brewing Company!"}
{"text":"Not sure I really need to say anything. This picture says it all. Nachos with beef brisket and chicken. Lady taking the orders was fantastic."}
{"text":"TK food truck is always a hit, and love the buffalo cauliflower tacos.  But want to also take a minute to give a shout out to TK Cafe downtown.  Friendly, attentive staff and I always get the portobello mushroom wrap.  Soooo good.  Kinda tucked away on the backside of 525 N Tryon bldg, but worth a visit."}
{"text":"TIN Kitchen at NoDa Brewery - what a perfect combination of delicious beers and tasty foods.  

During my last visit to NoDa, we needed to grab some dinner - TIN Kitchen to the rescue!  I got a delicious grilled chicken wrap with goat cheese and some type of mango chutney - exceeded my expectations.  My partner grabbed the veggie burger and thoroughly enjoyed it.  

The service was helpful and the food only took about 15 minutes to prepare.  Overall, anytime you see the TIN Kitchen, you can rest assured you will have some tasty bites to enjoy."}
{"text":"Ate here recently when they were parked outside the Observer.  I ordered the beef brisket tacos with green rice.  They were both delicious.  The brisket was not fatty at all, was very tender, and they didn't skimp on the amount in the taco.  The slaw and sauce complimented it perfectly.  Some people might think the brisket was a little salty, but I thought it was perfect.  It is a little pricey but to me is well worth it with the quality of the food and the amount you get.  Its not much more than Salsaritas and is a million times better.  Try it once and you'll be back for more."}
{"text":"The Tin Kitchen is a local food truck which pumps out some very tasty but small-portioned food.  We stopped by the food truck on our way to another restaurant to try some of their tacos as \"appetizers\".  The first location that we went to (the address on Yelp) is the location of one of their daily locations but wasn't the location for our particular day.  We had to go onto their website and find the location using their locator page.  The location had parks right up the road from it with a parking meter (parking was simple and cheap).  

As for the food, I have posted a picture of the 2/3 tacos we ordered.  We ordered the chicken tinga taco, the BBQ beef brisket taco and the Thai coconut shrimp taco.  The Thai coconut shrimp were bland and I didn't favor the Thai slaw on the taco, but to someone who does it would have been great.  That was the bad.. now for the good..  The chicken tinga taco (my girlfriend let me try a bite) and the BBQ beef brisket taco were absolutely brilliant.  I enjoyed these tacos very much; they were full of flavor.  Although as stated before these tacos were small (but we did have them as an appetizer so it was ok) and they were around $3.25 each if I remember correctly.
  
I would highly recommend trying out this food truck.  The lady taking the orders was super nice, and upbeat.  The time for them to cook the food wasn't too long at all maybe between 10-15 minutes.  Price was decent since the food was unique and delicious.  The only complaint I would really have is about their location, as stated before the location on yelp is wrong, check out their website to find out the correct location before adventuring out."}
{"text":"The Tin Kitchen is definitely one of the best food trucks I've been to. Had a shrimp and grits cake entree and overall it was a really good dish. This truck always has a long line but the food is well worth the wait."}
{"text":"While in town visiting my family, my sister told me about this taco truck she wanted to go to.  I'm pretty much game for anything, so I said sure.  We hopped in the car and a short car ride later, she turned a corner and said \"there it is!\"  Up ahead, gleaming gloriously in the sun, was the silver taco truck known as the Tin Kitchen.  As soon as we parked and got out, I could smell the amazingness.  

The guys greeted us as we walked up and I immediately noticed how hot they were (bonus points for that lol).  I looked over the menu and decided to go with their special taco for the day: a jerk chicken taco.  We went inside of the brewery to wait while the tacos were being cooked up.  My sister went out and grabbed our tacos and set down the clear plastic container in front of me.  I opened it up and took in the smell that wafted up.  I practically drooled all over the table.  The taco was so perfectly spiced and all the flavors worked together in perfect harmony.  The green rice side dish was also heavenly.  

I definitely know that this is a truck we'll have to find every time I come down to visit."}
{"text":"Charlotte has a lot of good food trucks; this one rules the roost in my opinion. As far as breadth, value, and taste, they are simply unbeatable. Every time I eat with them they have a different daily special that I simply can't leave without trying. Pork belly tacos are my go to staple, they are a must try."}
{"text":"Just for the record, we did not mean to eat dinner there, just a snack.  But is was so friggin' yum that we went back, twice.   

The pork belly tacos are to die for, I could literally live off them.  Check out my photo, the pork belly strips are huge and falling off the taco.........

The Korean sliders were okay, tasty and flavorful.  Just to much bun for me.

I went with a Kim Chi Quesadillas BUT I added pork belly. Oh yeah oh yeah, it was awesome.

Cannot wait to hit this delightful truck up again......"}
{"text":"A great complement to NoDa beers! The pork belly tacos were the best of the three tacos I tried, although all of them were amazing! The pork belly was crispy, the glaze was amazing and they're very generous with portions! I also tried the chana masala tacos and the chicken tacos, which were very flavorful. I am definitely going to come back later to try their other offerings :D"}
{"text":"After visiting the food truck and being a little disappointed with the service, the manager contacted me and was concerned enough to address the situation. Thank you Tin for the awesome service."}
{"text":"3 tacos and a drink for $10. TIN Kitchen takes a limited menu and offers a great variety of flavors. On my first visit, I had a chana masala, Thai coconut shrimp and pork belly, plus a Barq's root beer. Colorful, delicious and filling. I liked the paper product container and will most certainly try the sliders on my next visit.

No, these are not the least expensive food truck tacos you will find, but the presentation and flavors earn this place two strong thumbs up!"}
{"text":"Been here multiple times and generally get the same 3-taco meal, 2 pork belly + 1 brisket.
This time, something went bad.
Pork belly tacos, dry, no glaze and no scallion/onion on either taco. One taco shell hard (normally is soft) the other semi hard.
Brisket tastes ok, but, cold.
Did not feel like going all the way back down, so, suffered through 2 dry tacos today.

Update: Just ate my lunch. 2 pork belly shells were too hard, could not even bite through them with my teeth. Really off the mark for me today. 
FYI - It also seems when you get the 3-taco 'deal' you get much less meat than the individual taco."}
{"text":"Best food truck in Clt (or in other words - worth the wait!)
The quesadilla is the most underrated item on the truck. I'm no quesadilla connoisseur but this is one of the best I've ever had.  Brisket nachos, pork belly tacos & buffalo cauliflower were great as well but the Chana Masala is off the charts... the best!!"}
{"text":"Tin Kitchen is a food truck that I have repeatedly seen at breweries (Noda and Sycamore, just to name a few) but never felt compelled to try. That all ended one Sunday Funday when I found myself hungry and perched at Sycamore. Since they were conveniently located on site, I decided it would be as good as any time to finally try them. I placed my order for the buffalo cauliflower and lime shrimp tacos. I was then shocked when I heard my name called about two minutes later letting me know it was ready.

I raced back to my seat and dove into the cauliflower taco. I was underwhelmed. All I could taste was buffalo sauce (that tasted like some of the mediocre bottled stuff) and nothing else. Maybe if they consider roasting the cauliflower beforehand, it would enhance the taste. The bleu cheese crumbles added absolutely nothing. I would suggest they make those thicker pieces. The cilantro-lime shrimp tacos were okay. I found the cilantro lime aioli to be watery and lacking real flavor. Nothing memorable about these at all. I think there definitely needs to be something with more of a substantial crunch on these tacos.

Tin Kitchen regularly pops up in my business park so I figured I would give them another shot. I ordered a chicken tinga taco and, just like last time, my taco was ready in a flash. I definitely enjoyed this one the most, so far, of the three I have tried. Flavors were much more pronounced, with juicy chicken and a sauce with just the right amount of spice.  

Tacos are priced at $3.50 each and they are on the smaller side. In addition, they sell quesadillas, nachos, salads, and sliders. They normally have specials of the day. Personally, I do not feel inclined to try anything other than the tacos but I've heard the Korean BBQ sliders are pretty good so maybe on another day I see them around, I'll give those a shot.

They keep their core menu pretty much the same so I can see myself trying out the remaining four taco flavors just to see if I end up liking any others."}
{"text":"Several times I have tried to go to the Tin Kitchen Food Truck and the line is so long that I don't wait for it. But if the line is long, it has to be good.

I caught it on a day at Wells Fargo when the line wasn't extremely long, but there were about six people ahead of me. Everyone told me to try the tacos so I decided on a three taco combo. There's plenty of different flavors from around the world. And in the combo you can mix and match. I got a buffalo cauliflower,  pork belly and pork carnitas. The ordering process and getting food took a total of about 20 minutes.

Finally I got to eat the tacos. The buffalo cauliflower was a little lackluster. The buffalo taste wasn't as strong or spicy as I like it and there didn't seem to be enough of the cauliflower pieces. I did appreciate the Blue cheese slaw. Now what made me up this review to four stars instead of three, is the pork belly taco. The pork belly is cooked to perfection with a sweet sauce paired with fresh kim chee. I would have been very happy to order just three of these and this is the dish I would come back for. The pork carnitas was not as spicy as I had hoped, but had good flavor. The rice on the taco was a little dry so I wasn't blown away by it. 

I'd give it another try as I think I will enjoy the Korean slider and I'd be willing to try some other tacos.But I do hate the wait time for this truck."}
{"text":"I caught up with the TIN Kitchen this past Food Truck Friday. I got there early so there was no line. I also snagged a $7 for $10 Yelp deal to sweeten the pot! I opted for the daily special - crispy pork belly tacos over 30 minute kimchi w/ hoisin glaze ($10 two tacos and a side). I chose the pickled veggies for my side. I put my order in and hung out till my name was called. The pork belly was nicely cooked and crispy, as promised. I struggle to call the cabbage that was on the taco \"kimchi\"... I am Korean ya know... It wasn't spicy at all. It was really more of a lightly salted, pickled napa cabbage. Not at all what I expected, but it went well with the meat. Just don't call it kimchi... ok... cool. The hoisin gave the taco a nice sweet flavor that complemented the pork belly. I wasn't a huge fan of the pickled veggies - red & yellow bell peppers and lots of red onions. They were super vinegary but had a nice spicy finish. I would have liked the veggies better if there was a greater variety or just less onions. I'd definitely visit them again!"}
{"text":"Mmmm boy... Had us some dang fine Brisket Nachos and Spicy chicken quesadillas while the Kitchen was parked at NoDA Brewery this past Saturday.

The noshing put the lid on a great, albeit a little rainy, afternoon of beering!"}
{"text":"I like TIN Kitchen better than most because they are reliable. They are where they say their going to be, and I've never visited them and they were out of food. The food is fresh and spicy in a good way! My favorite dish here is the Chicken Tinga tacos. You can also mix and match tacos. The buffalo cauliflower is also very interesting and should be tried at least once."}
{"text":"The food is seasoned really well. The ordering is quick and easy. The guys in the truck are suuuper cool! But I got to knock them 2 stars because there was hair in my good and that's disgusting. I couldn't eat what I paid for because of that. And the next thing was the got my order wrong. I paid extra for salsa and I had no salsa for  my quesadillas."}
{"text":"I visited TIN Kitchen on location at Triple C Brewery. I love their catchy name and easily-identifiable silver paint job. Plus, I have to give props for being able to park inside of a gated section of Triple C's outside patio.

Give my high standards for Mexican-inspired cuisine (I'm from Southern California), I have sadly learned to be trepidacious about it's quality in the Queen City. Yet, TIN delivered so hard, that I had to go back for more! 

With all of the wonderful smells drifting from this truck, it was hard to decide what to get. I ended up choosing wisely with the Brisket BBQ, while my girlfriend went for the tried and true Blackened Fish Taco. Despite a line of waiting people, the food was ready in the time it took to get drinks from Triple C and find a table. Not too shabby. 

The tacos are mind blowing. While I never eat fish, I actually enjoyed the nibble I stole from my girlfriend from my girlfriend's taco. But the undisputed star of the evening was without a doubt the BBQ Brisket--smokey chipotle bbq sauce with a fantastic slaw. When they say house-made brisket, they ain't lying. The innovative flavors where a perfect marriage of Mexican inspired chipotle with some southern flare. These is a very intentional paring of flavors rather than the \"oh, I'll just put some of mom's slaw on top and call it Southern\" mentality that I often see at places. And the tender meat would give some established bbq joints a run for their beef. The finishing touch was the crispy texture of the toasted tortilla that added a nice crunch to the package.

After demolishing 4 tacos between us, we had to go back for more. This time we shared an order of the Oaxacan Chicken Mole. While by no means bad, it somehow lacked the gluttonous pleasure of the BBQ. 

So why the missing star? The sides.

Whereas the tacos shine, the side are lackluster. The beans of the Peruvian 3-Bean Salad seemed somewhat undercooked. In viewing the chips and salsa, they didn't stand out as amazing, particularly the store-bought chips (if you could do house-made chips and you would quickly become my hero). The saffron rice is probably your best bet. Still when placed (literally) next to the unadulterated awesomeness of the tacos, the sides simply fell short.

In addition to their taco's, they also had a special on oysters (raw or fried) while we were there. While I am not a seafood person, it definitely seemed to be a popular item. It is nice to see them mix it up a little."}
{"text":"Was able to try the Tin Kitchen while I was at NoDa brewery.  My wife wanted to try their Brisket Nachos and have to say it was really good.  

We just got that one item but the portion was good and the brisket was good.  Had a good flavor with the right amount of spice.   

Will seek out the Tin Kitchen in the future so that I can try more things in the menu."}
{"text":"The Tin Kitchen was the first food truck that I tried when I moved to Charlotte. All of their tacos are good but my favorite is the salmon taco with pineapple salsa that was removed from the menu some time ago."}
{"text":"I was pumped when I arrived at NoDa last Thursday and saw Tin Kitchen parked out back. Then I saw the \"Guy Fieri was here\" paint tag on the truck and thought \"wow, this is going to be good\". I decided to sample three items.

Buffalo Cauliflower Slider: great flavor, nice heat and celery root slaw was good - 4 stars

Chicken Tinga Taco: solid flavor - but no stand out notes for me - 3 stars

BBQ Brisket Taco: the brisket was burnt - not charred - but burnt and black half a centimeter into the tissue - the entire length of the piece of meat - super tough/chewy - all I could taste was burnt meat - if it had not been raining \"cats and dogs\", I would have brought it to their attention - needless to say I did not finish it - 1 star

Kind of disappointed with my experience considering their reputation. More like a two star for this visit. I will give them the benefit of the doubt that this one \"slipped past the goalie\", but quality control is very important especially for a mobile kitchen!"}
{"text":"Dear Tin Kitchen, oh how I love thee!  Your Chicken Tinga Tacos are so good, I crave them throughout the week.  My favorite are your beef brisket tacos but I have to be in the mood.  My friends rave about your thai shrimp tacos (can't remember what they are really called).  My only issue is you run out of good food too early on Friday nights at the FTF event.  I guess that's how you start an addiction, yes?!  Besides that, you are my favorite food truck out there (and I've eaten at many)."}
{"text":"I never thought I'd say this, but my favorite taco in Charlotte comes from a food truck. As much as I love Bakersfield, Cantina 1511, and Sabor, none of them hold a candle to the beef brisket tacos at Tin Kitchen. Add in some of the best customer service and friendliest servers and you've got yourself a winning combination. The pork belly taco and flank steak tacos are also crowd favorites- honestly I've never had anything from this food truck that I didn't love. I will 100% go out of my way to find what brewery or local business they're parked at in order to get my craving satisfied."}
{"text":"This truck has become my Thursday night go-to, especially since they park their wheels just outside Birdsong and NoDa Brewing Cos.  Their spicy and flavorful Mexican-fusion fare is a great pairing with some hoppy craft-made beer.  Vegetarians rejoice, you've got some fantastic options here too.

Just belly up to the side of the truck and take a gander at their menu, prominently printed on the side.  Tacos, sliders, and quesadillas dominate the current line-up.  Choose your protein and there are options a plenty.  The tortilla or slider buns end up just being a convenient edible wrapper, and that's not a bad thing.

Where things get interesting, my foodie friends, is the craziness going on insider that wrapper.  A yellow-curried channa masala with goat cheese crumbles and green onions is a flavor bomb.  Savory and warm, yet with a nice, sharp bite.  Contrast that with the 30-minute kimchi.  Spicy and lighter, with a great kick that mellows with melted Mexican cheese blends.  Add in the saltiness of some pork belly and you have another masterpiece in your hands.

There are sides here too, ranging from chips with house-made pico to hot and spicy pickled vegetables that are both healthy and a strong kick in the pants.  Great add-ons to round out the meal.

For a food truck, this mobile kicthen has some serious creative engines under the hood.  You can't find this at any typical taco stand. Do check out their nightly specials too, duck and scallop are regulars here and should not be missed if and when offered.   Same for their desserts.  

Just know you'll pay a bit more too for this taco upgrade- most tacos run about $3 a piece and a quesadilla will go for approx. $7.  Not bad, all things considering, but thank goodness they take credit cards as your cash will go fast to make a full meal here.  It's worth it, though, for a taco that is more than the sum of its parts."}
{"text":"Best food truck in Charlotte, hands down. I have sampled much of the menu and I've been happy with each selection. Workers are kind and quick. My order, even when I've substituted ingredients, has been right every single time. 

Pro tip: If there is a line or you're at a busy event, order the nachos. They're fantastic and they come out at lightning speed."}
{"text":"Pork belly tacos here are good. The tortilla that came with it could've been at least fried a little or something but overall it was a good place to try."}
{"text":"The tacos are good, so long as the truck shows up according to its website.  2nd time in the past 4 visits that they weren't at their LakePointe location on Friday.

Evidently hiring a web designer to update their website to keep customers informed of locations isn't worth the cost.  To their credit, they try to communicate their change of plans via Twitter but this isn't what you see at the top of the mobile website.  

For the money, the South American food truck at the gas station at South Blvd & Emerywood Drive is better.  $2 tacos on homemade, double wrapped tortillas and  you can count on them being there."}
{"text":"Tin partnered with NoDa brewing for restaurant week: 
Awesome people made reservations for Sunday but they sat us anyways on a busy Saturday night!  

Super great  Hot pistol: hot and spicy! But yummy! Will order another a large next time. 
Oyster stout: dark and a good stout. Nice dry Smokey stout. 
Breakfast stout coffee nice, under tone. Can I drink this for my morning coffee??? 
captain peanut butter slap your mama good.  I love peanut butter!!! 
Strong ale: it's ok. Good for a strong ale. My husband feels different but delicious. Typical Chad beer- strong but good beer! 

Paired with: 
Chipotle smoked beef tartare: okay had better but it is a good truck.  
Soup flight 
  Curried butternut squash super curry but I like it!!! 
  Sherries shrimp bisque- that is yummy! Eyes rolling in the back of my head good. It's better than the she crab soup at 82 Queen from Charleston,SC. 
  Miso ramen & pork belly ummm what the hell!! Buck week noodles with typical ramen packet flavoring. Give me a double order of shrimp bisque! 
Cast iron seared Scallops truffle white bean purée wild mushroom tarragon cream  scallops too buttery, beans are strange, mushrooms are very mushroom, tarragon cream does not go well with it. 
Braised beef short ribs red wine Demi roasted root vegetables wilted Swiss chard: love it!!! Super rich tasty dish good with any stout, warm and oily on a cold night in a tent.  
Vanilla honeycomb cheesecake every cheesecake should have an Oreo crust! 
Dark brownie brownie & bing cherry brownie candies pecans Nutella whipped cream. Dame this is good. It's a must pair with captain peanut better stout!!"}
{"text":"I had them at a really busy time. As I stood in line I reviewed the menu and grew eager to try the food.   I got the special of the day which was a scallop taco. the food came out fairly quickly considering how long the line was but it stillw wasnt quick enough for me given how cold it was. When I finally bit into my taco I was disappointed.  You could barely tell there was scallops in there. There really wasnt a lot in the taco period.  I also got the bean salsa that was pretty basic and kind of bland.  Overall, a disapointment."}
{"text":"This is a GREAT food truck. Its a must try. Ive almost everything in the menu. Everything is great, but if i have a go to it the Korean BBQ sliders. You will not be disappointed by anything they serve. 
Feliz Comiendo"}
{"text":"These may have been the best tacos I've ever had! I got the 3 taco combo - daily special Island Jerk Mahi, Flank Steak, and Buffalo Cauliflower. Each of them amazing. Very fresh ingredients, so flavorful, and filling. The truck was behind Sycamore Brewery and I had seen them on Diners, Drive-Ins, and Dives. The lady taking my order was so pleasant - all around great experience."}
{"text":"Be adventurous but be warned.  You might enjoy this truck you might regret it.  I have a hard time pinning this down because some things I really liked, and other things I found interesting but not for me.

I sampled three tacos:
Cauliflower didn't do it for me, the dish could have otherwise done a good job but I just didn't get the texture I wanted.  The flavor was close to what I had hoped for but there is something missing and I can't put my finger on it.

Chana was prepared well and had more interesting choices.  I liked it but it definitely isn't for everyone.  I really liked the mouth feel of this item and they kept it all tied together well enough.  I didn't get into my expected masala flavor groove.  I am probably overly committed to tomatoes and onions.

Pork belly was almost there, and the best of the tacos to end on.  It had the right texture of the pork, but the sauce was a bit too heavy for me after the other two tacos.  It was also the emptiest of the tacos and a real struggle to get pork belly in each bite.

Price is another issue, I think other trucks can't fill you up for $ 6-8 but here you will be more likely to spend $10+.  Three tacos for $10 is expensive, and the $3.50 each with a $.50 discount on three is weak.  $9 for three tacos would make a difference to me because then I could consider that fourth taco or not.

Conclusion: you will know with the first bite if Tin Kitchen's truck is for you.  I found it interesting but I am not craving to go back as I am with some other trucks/carts I have rated here.  If you like flavors that equally challenge and excite you then this is the place.  If you just want comfort food then I can't recommend such an adventurous but dangerous place."}
{"text":"I was finally able to try the tin kitchen during food truck Friday. Boy am I glad we did! Between my wife and I (I always feel the need to clarify because of the large amount of food we order!), we tried nearly all of their tacos and a few of the sides. 

Chana masala taco - amazing flavor and definitely worth trying. The goat cheese puts this one over the top good. 

Chicken Tinga taco - in my opinion a fairly standard chicken taco but let me just say it was very good. I would definitely get it again next time. 

BBQ beef brisket taco - by far my favorite taco that I tried. The brisket is cooked just right and the flavor is out of this world. A must try!

Thai coconut shrimp taco - this was my least favorite out of all that I tried. If I had gotten this by itself I'm sure I would have raved about it but it just didn't compare to the others in my opinion. 

Chips salsa - good but nothing to write home about. 

Charro beans - these had great flavor and were cooked perfectly. They went well with the tacos. 

All in all I had a great experience eating at the tin kitchen. I can wait to go back and try the nachos, sliders, and quesadillas!"}
{"text":"Awesome service!!! Beyond delicious food!! I had the pork belly, mac-n-cheese goat cheese special! OMG! Deliciousness!!"}
{"text":"This is a great good truck. Everything I've had has been good and I've eaten their food more than 30 times. I'm no vegetarian, So wouldn't normally try a veggie taco, but for an out of the box and out of this world treat, try a Buffalo Cauliflower Taco. Yep...cauliflower!  It's not on the menu as a taco, but ask for it. You won't regret it."}
{"text":"This place is so yummy! I loved their chips and salsa. I ended up getting the shrimp taco and pork belly taco. Shrimp was cooked great and paired well with the ingredients on the taco. Pork belly taco was good but not my favorite. My husband loved the pork taco though. Next time I'm going to try the flank steak taco!"}
{"text":"The quality and taste of the food coming out of this truck is phenomenal. The tacos. Dude. The tacos. Ordered four different ones, all great. This is my first Charlotte food truck experience and I will be sure to follow them around town!"}
{"text":"I love the variety and quality of food the Tin Kitchen offers. These aren't your average tacos! They have a couple of options for the vegetarian and vegan crowds (keep adding more, guys!) and plenty of choices for those of omnivorous leanings. I generally grab lunch at their McDowell St location and it's just the right portion to get me through the rest of the work day. 

Jack and Jimmy are always friendly, helpful and quick!

My favorite was a charro bean and sweet potato hash special back in the fall and their marinated portabella mushroom is one of the best shrooms I've tried.  The chow chow topping adds a nice zing to  the veg tacos or salads. 

Definitely give them a try for lunch or catch them at one of the brewery stops for some tacos and a cold beer. Perfect!"}
{"text":"Wow, I was blown away by the Tin Kitchen after finally tracking down this food truck..definitely as good as a brick and mortar restaurant. I ordered the pork belly taco and buffalo cauliflower slider.
The pork belly taco was awesome. While being super simple (just a corn tortilla, pork belly, lettuce, and sauce) all of the flavors went so well together that more ingredients would have likely detracted from it. The sweet hoisin sauce went perfectly with the salty pork belly, the soft corn tortilla was great, and the lettuce/kimchi was fresh. Simple but really good!
That said, the buffalo cauliflower slider I ordered was even better! I'm a meat lover, but I wouldn't mind being vegetarian if every vegetarian dish tasted like this. The charred cauliflower was excellent, and the buffalo sauce soaked in to give it a very nice flavor. The bun was perfectly toasted, the celery slaw was good, and the celery aioli & blue cheese rounded out the slider to make one awesome sandwich. 
Both things I ordered had perfect flavor combinations, which really makes me think that almost anything from the Tin Kitchen would be good and the chef/owner must really know his stuff. The prices were reasonable ($3 for slider, $2.50 for taco), and my only complaint is that I didn't order even more."}
{"text":"New food truck in CLT...yeah! 

When I visited Tin Kitchen during the South End Food Truck Rally I was pleasantly surprised by the array of tasty taco options written on their menu board. Despite being super busy, the dudes behind the Tin Kitchen were quite friendly and happy to serve the masses! 

While I was jonesin' for the Thai shrimp tacos, unfortunately, because of their popularity, those little crustacean envelopes were sold out. No worries, though, there were a handful of other delightful looking options to try! 

For $16, hubs and I split the beef brisket tacos & the pork belly tacos (3 each) with kimchi and hoisin sauce. Of the two, I favored the brisket quite a bit more. It was tender, savory and perfectly paired with a crunchy slaw. I was also a fan of the green rice as a side; it was a nicely flavored accompaniment and not the least bit mushy. No one wants mushy rice!

As for the other taco plate, the pork belly was nicely cooked, but the hoisin sauce was almost saccharin sweet and overpowered the pork and the kimchi. 

Overall, Tin Kitchen is off to a great start and I'm looking forward to catching them again soon!"}
{"text":"When you're paying almost 4 dollars for a tiny taco it kind of has to be amazing. These were good. But nothing above and beyond. So after eating them I was happy, but also $12 poorer and still very hungry. 

I liked the chana masala tacos the best. The chicken tinga was dry and not as flavorful as I would have liked."}
{"text":"Well would you look at that?!
I stumbled upon a taco truck while frolicking around South Park on my lunch break. Man I'm glad I did.
What a bargain!
I got the \"Chana Marsala\".. the chickpea/goat cheese one... it was everything!!!

If you ever get so lucky to see one of these trucks, chase it down like you used to chase ice cream trucks when you were a kid, it will make your day better.

If you check in you get 10% off... how sweet is that?!"}
{"text":"My company just had this food truck come out for our staff rally and man on man was it delicious. This was my first time trying this food truck and I absolutely loved it. I got the three and the chips and salsa. Everything was so fresh and the portion size was very reasonable for the price. If you decide to venture out to the food truck Friday events, definitely stop by this food truck."}
{"text":"\"The best restaurant in CLT is a food truck\"  My friend Matthew describes this new trendy taco truck to me. \"They hands down have some of the best food CLT has to offer.\"  Well this wasn't the first time I heard raving reviews about them.  It just so happens while he was telling me this, I had booked them a few weeks prior for my Wedding Party.  

They can also be found outside the Observer, in NoDa, the Common Market south end Friday nights or Use them for Catering as we did. 

My wife and I are not very traditional, we had a Wedding Party a week after we were married and used the Tin Kitchen as our chefs.  We wanted something different that had some great food.  We decided to use The Tin kitchen, have Margarita's and Corona's match the predictable hot July day in CLT.   We were referred to them by a family member and are glad we had a chance to use them.  I was basically sold on three different aspects: 1) The food is amazing, my favorite was the Drunken Chicken WHAT A DELICIOUS TREAT!.  (served with a side of Cilantro, Jalapeno Rice WOW!)  2) David and Charlie are very passionate about what they do and you can taste it in their food.  .  3) The concept, Food trucks are trendy, laid back and a outside of the box approach for a party, and all the guests loved the idea

Not only did they provide entrees but they also served some tasty hors d'oeuvres.  They consisted of a tuna watermelon ( turns out tuna and Watermelon are meant to be together), Pork tenderloin (delicious), scallops and pineapple, chicken salad sandwiches and Mediterranean pasta salad which was my wife's fave!.  Everyone involved was so pleasant and did a great job.  

On a side note I was just informed that they were booked by Google for the Democratic National Convention.  Yeah they are that good.  I mean come on if Google is booking them out of all the restaurants in CLT they are worth a try.  Well congrats Tin Kitchen, My hat goes off to you guys and your food truck!  I will definitely be seeing you guys soon.

Be sure to Catch them on the road and I just realized I did not mention the Pork Belly Taco,  WORTH MENTIONING! A Tin Kitchen Signature TACO!"}
{"text":"I saw this on triple DDD, I'll give it a shot another definitely fail for triple DDD, we had the cauliflower taco it was OK, the beef taco was cold and tasteless and chewy, the chicken tinga was dry and dull, i also don't understand why am  I paying restaurant prices for something served in paper bowl and no service?????I wished it could have been better, 18th triple D disappointment"}
{"text":"This is the best food truck in Charlotte. The food is delicious, the service is quick and the price is very reasonable. I've had the cauliflower tacos, the nachos with BBQ brisket and the quesadillas. All of it is excellent. You will not be disappointed with Tin Kitchen."}
{"text":"I'm so glad that they sit outside of my work building every so often during the lunch hour.  Always fresh, always friendly service and the food is oh so good.  Thank you Tin kitchen....I will follow you where you go!"}
{"text":"I had a really good tacos from this place!  They were delicious.  They were fresh and made quickly, perfectly paired with a nice beer from NoDa Brewing.  I have been wanting to try this little gem for quite some time and I finally captured it!

That's the thing I love about food trucks, they're always moving around and once you see one of your favorites or one you've been dying to try it's so fun!  It's like a hunt for the food!!!

The service was excellent and I was so glad I ran into them and got to try their food.  I can't wait for more opportunities."}
{"text":"Find this truck, and you won't be disappointed! Tin Kitchen has something for everyone, vegetarian, vegan, all the way to true carnivores. Their fish tacos are delicious, and their four cheese quesadilla is so simple but so amazing at the same time. I honestly haven't had anything from this truck that I didn't love (and try to replicate at home). Give it a try and you'll be happy that you did!"}
{"text":"FAN-FRIGGIN-TASTIC! Great food! Don't let the \"Lunch Truck\" appearance fool you, prepared to be WOW'ed with their combinations. Pork Belly tacos and Togarashi Shrimp tacos are great. The buffalo cauliflower tacos were a very pleasant surprise too!"}
{"text":"I got the Chana Masala and Pork Carnitas tacos. The Chana Masala was a very flavorful mildly spicy yellow Indian curry and came with cous cous. Since I like spicy, I added sriracha and it made it way more delicious. The pork carnitas was medium spicy and came with green rice and pickled onion. The filling of the tacos was very delicious. The only reason I give it 4 stars is because the corn tortilla was pretty tough and I like my corn tortillas soft. I would still definitely come back and would recommend."}
{"text":"Hard to believe I'm just now trying The Tin Kitchen but I am. Caught up with them at the Food Truck Friday in Southend. They had a lot of taco specials for the night but I went with one of their staples, the beef brisket taco. The brisket was tender and the sauce had a nice kick. Very flavorful dish. I had the pickled veggies on the side. Not bad but I wished there were more veggies, not just red peppers & onions. I'm looking forward to catching up with this truck again soon."}
{"text":"One of my most favorite food Trucks. Always check the specials last night (3/08/2012) in NoDa was Pork Belly Taco. Best thing I'v had in a while. I always follow them on Twitter to keep up with the location and Specials. A few weeks back they had Duck Taco with Duck Crackling on it. YEA!"}
{"text":"I had the Korean BBQ Sliders and I would get them again, but so much of this menu looks too good. I look fwd to the next try."}
{"text":"First time at this food truck & I wasn't expecting tacos. 

I was pleasantly surprised. 

The crew are all friendly and the tacos were delicious. I had the drunken chicken  and the scallop with the pickled vegetables..... and ummm....

I am ALL ABOUT those pickled veggies. I could eat the pickled veggies on their own at least once a day. I'm smiling over here as I type about them. They are fresh pickled and tangy awesomeness. Spicy though.... so if you're not into the hot stuff I'd skip over the jalapeno peppers.

Anyway, I'm a fan. And I'll be back."}
{"text":"Blessed to enjoy this food truck two days in a row! I was at NoDa Brewing and experienced the delicious pork nachos. The green tomatillo sauce and goat cheese totally sold this for me! Crunchy chips, creamy goat cheese, spicy tomatillo hot sauce, with shredded pork. Awesome combo! The next afternoon we were shopping for Small Business Saturday and were happy to see the familiar truck parked outside Dudeapalooza in South End. The special was a salmon slider for $4 and wow it was worth every penny! Toasted crispy mini bun with a chunky salmon patty covered in micro greens and a dill sauce, lush!"}
{"text":"GREAT Food!!!  We got the chicken, BBQ and Pork Belly tacos and Korean slider...  Awesome!!!"}
{"text":"Four stars for the food and zero stars for the mean girl who takes your order. She is sweet if you know what you are doing but if you don't, expect a heavy level of condescension. She literally turned her head in disgust and had to pull her chair over to sit down to deal with a question about the menu. Very sorry for making your job so difficult."}
{"text":"Food trucks can impress with the food stuffs they produce & TIN Kitchen definitely joins those ranks. One day they happened to set up shop a couple blocks from where I was staying so I had to go on a scavenger hunt to find them. It was a must do.
 
They have a very interesting menu, but my eyes were immediately drawn to the Korean BBQ Slider. As my little bundle of goodness was handed to me from the window, I could smell the kimchi. To my husband's chagrin, I don't always enjoy the smell of kimchi, but if you want to mix it in a slider (or a Philly Cheesesteak), I will eat it up. The slider was bursting with flavor and full of BBQ beef goodness. The right mix of flavor for all the taste buds to enjoy: sour, sweet, savory, salt. They were all there. 

I would definitely look these guys up the next time I'm in the Queen City to track them down again."}
{"text":"I had been wanting to try The Tin Kitchen for a while because I know the owner's mother.  My husband and I saw the truck in a long line of other vendors, so we decided to visit.  It turns out that The Tin Kitchen was part of a fundraiser for cancer, and we were supposed to buy tickets for the event.  Because we were hosting a dinner party that night, we told The TIn Kitchen that we would try them another time.  They insisted on giving us food anyway!  I had the buffalo cauliflower tacos and the pickled vegtables.  Both were delicious.  The buffalos cauliflower tacos were topped with blue cheese.  I was warned by the chef that the pickled vegetables were very spicy, but I love hot food and found them to have a nice, mild burn.  My husband ordered the pork loin tacos and enjoyed them as well.  Very pleased with the food, as well as the friendliness of the staff.  Will definitely order from them again!"}
{"text":"Went to the food truck rally this Friday and tried these guys out. I had the chana masala taco, Thai coconut curry taco and also the BBQ pork taco. All three were delicious my favorite being the chana masala taco- the blend of goat cheese couscous and chick peas with the curry sauce is to die for! The Thai coconut shrimp taco was lacking on the shrimp and could have used some more something? I am doing a low carb diet so I just wanted to eat the fillings and asked for a fork but didn't get one, no biggie cuz my hands worked just fine :). The staff were extremely friendly and I was told they started their tacos off with the BBQ one and it had some very good flavors with some complexity to it. The day was pretty
 rainy so we didn't get to enjoy the surroundings but it was worth waiting in the rain for. Also, the tacos were on soft corn tortillas which I've never been a fan of I normally prefer flour if I'm going for carbs."}
{"text":"Ate at tin kitchen food truck last night at food truck Friday @ sycamore brewing.

Pros -

* tacos and quesadillas are very good.  Reasonably priced

Cons -

* Girl taking orders had a snotty attitude and was pretty rude."}
{"text":"Amazing food! Awesome staff! Awesome truck! All the tacos are amazing, nachos are a great size! Can't wait to have them cater my wedding!"}
{"text":"Food Truck Review: I know some people love this place but I am never real excited when I see it. I stick with their tacos and quesadillas we do really  like the goat cheese one. If you don't like sriracha sauce do not get the nachos!
Catering Review: I was really disappointed with my catering order from them. If you use the free back room at noda and you want food you have to use them which I will never do again!!!! I was so disappointed with what we got for the price we paid and even worse they sent me an evaluation to fill out which I did and they never even contacted to say they were sorry I was disappointed AND they continue to send me emails about using them again! Talk about being disconnected."}
{"text":"Incredible tacos! I've had and loved every variety, so much flavor and creativity. You have to try the pork belly, it's heaven! Plus fast and affordable doesn't hurt!"}
{"text":"I'm not really sure how I overlooked these guys in past reviews.  They are, by far, my favorite food truck vendor in Charlotte!  

I'm a fan of the nachos, the quesadillas, and several of the tacos.  They even run some pretty awesome rotating specials.  The food has an eclectic twist, offering a modern take on Mexican inspired cuisine.  I like food with a kick, and these guys deliver!

I first discovered their original truck when it was a regular Thursday night contender between the original Noda Brewery and Birdsong Brewery.  They've since expanded, and now I frequent one of their newer trailers that is a weekend regular at Sycamore Brewing, right off the rail trail.

The staff is super nice, and they, of course have the modern mobile ability to accept credit/debit cards from their trucks.  

The food is delicious, and always pairs great with an ice cold beer.  Be sure to check them out if you have the chance!  I go every chance I get!"}
{"text":"I'm actually surprised that I did not enjoy the TIN kitchen as much as I thought I would after watching triple D. I'm not sure if the cooks were rush or I just don't like the ingredients in general.

We all came here for lunch today just to check it out, parked behind the nascar hall of fame. We ordered 3 cauliflower sliders, 2 Chana masala tacos, a kimchi slider, a thai shrimp taco and a chipotle chicken quesadilla. We were really excited for the cauliflower sliders but we're not too happy when we actually ate them. I did enjoy the bread that was used and over all flavor. But the cauliflower was not grilled as promised, I was waiting for crunch but never received any. The kimchi slider was ok. The chicken quesadilla was good but lacked the expected chipotle flavor. I did like the tortilla that was used, had an almost buttery flavor. I didn't like the pickled cabbage in the shrimp taco though the shrimp was good. 

I think the most disappointing item was the Chana masala taco. I took one bite and couldn't go further. I guess I am biased, I have had a lot of Chana masala as that is one of my favorite Indian dishes. But I do know coconut milk has no business with Chana masala. The traditional Chana masala dish is made with a tomato base, no creamy aspect at all. Nor does it involve an American mirepoix with celery or carrots. I did not like this item at all, bleh! 

I don't think I will be returning, this was the first time triple D let me down."}
{"text":"Wow! What can I say... I really really enjoyed my tacos. Apparently The Tin Kitchen comes to our corporate campus every Friday -- WHO KNEW??? NOT I! And damn happy that I do now. 

Let me tell you this, for a fusion taco truck to come rolling up out of the blue in corporate center hell, it made me pinch myself. And then to be slapped across the face by those smells that came from the truck--man was I in awe. 

I usually brown bag it as the food they serve here is not worth the money... bland as hell, but now I know when and where I will be shelling out some dough -- Friday's baby, that's when and it going to be go to the Tin Kitchen! 

These guys are super nice and accommodating! I left with my food in hand and a smile knowing they really care about their product and customer service. 

I had the \"Smoked Salmon Tacos-Flash seared smoked salmon, cilantro-japanese rice, pineapple pico de gallo, & cilantro lime aioli\" 

At first, when I was reading the menu, I thought to myself there were to many flavors going on... but I was sold on smoked salmon and said what the hell! 

Let me tell you.. I was completely wrong.. the layering of these flavors hit a home run. From the homemade tortillas, to the pico de gallo (they actually know what that is and how it should be prepared)  I was truly in heaven. Now don't expect anything to be Mexican because they use the word 'taco\" -- that is just the vessel of how it is going to get into your mouth.. this is completely fusion. A fresh look at an old favorite. 

Tomorrow is Friday and you can bet on where I will be come noon... getting me some Tin Kitchen on!"}
{"text":"I love a good food truck, but TIN Kitchen has set the bar so much higher than any other food truck I've had!

They offer tacos, quesadillas, salads and nachos etc. and even have combo plates available (3 tacos for $10!) if you want to get a bang for your buck. 

The food is awesome, we ordered the following:

*3 Taco Combo with Pork Belly, Brisket and Shrimp
*Chicken Quesadilla Combo with Rice and Beans
*Nachos (we did not add meat--though it is an option for $3 more)

Everything was so tasty. The pork belly was my personal favorite, but all the tacos were fresh and flavorful. Each had it's own sauce that truly enhanced the taste of the proteins. The nachos also stood out as they are so different from what you expect. They are served with cotija cheese, salsa verda and a pretty hot red sauce. The chips are cold--which I know sounds strange, but the flavor profile with all the ingredients really works. 

Great experience all around!"}
{"text":"Food Truck Friday - YUMMM!! Order everything!!

*Best tip: The Spicy Pickled Veggies are truly spicy, not at first, but a huge bite to em at the end."}
{"text":"Ate here for the first time today and it was great! I ordered two tacos, one chala masala and the other chicken taza, both amazing! I can't wait to bring my husband when he comes home and other friends and family! I know they frequently park in front of Noda brewing co. so that will be fun! Can't wait to see the triple D episode! Highly recommended for someone who loves lots of flavor combinations! :)"}
{"text":"So it's been a year and I decided to give Tin Kitchen another try when I saw them recently at Triple C Brewery.

There were several new taco options on their menu and this time I opted for the Oaxacan Chicken Mole tacos.  The chicken was very tender and was topped with an amazing herb salad on grilled tortillas.  The tortillas were great and not rubbery this time around.  I just wish this option had a bit of heat to it.  

I also opted for the Caldo Verde soup which was great with lots of kale, white beans and bits of chorizo.   My side item was the Peruvian 3-bean salad.  The flavors in the salad were great but I thought one of the beans was a bit too raw yet and could have been cooked longer.

Since it was raining outside, I appreciated that one of the guys came inside to take orders. 

Overall, I think the food was much better this time than my previous times visiting this truck."}
{"text":"Just had falafel, quesadilla and another item...with chickpeas and couscous. All we're excellent!  Service and presentation was also great. Would definitely recommend."}
