{"text":"Great place for lunch or drinks and appetizers after work. The fish tacos might not be authentic Baja style, but they taste good none the less."}
{"text":"Had the fish and chips, very yummy!  Good fries and gravy as well.  Hubby had club sandwich which looked very good and he said tasted great.  Friendly service, our waitress was very nice!"}
{"text":"Nice decor, lots of big TV's, good food, friendly staff. I had the Greek salad, which was good, my dad loved the crab cakes. Would go again."}
{"text":"Very good food and friendly staff. They have live music on some weekends. Saw patio seating outside but no use during the winter ;)   I specially loved their chicken salad and my friend who had the buffalo chicken wrap said it was the best she've ever tasted. Good place to hangout / meet your friends for dinner. Recommended!"}
{"text":"My husband and I go there almost once a week. Thursday night is half price martini night which I love and they use Tag vodka which is gluten free for those of us who need that. Our favourite's are the chicken enchiladas with real corn tortilla and my husband is a fan of the crispy chicken salad. Great service but Friday nights can be busy so get there early. They have a few booths which are quieter than the bar area."}
{"text":"Stopped in around 10 to suck down some $5 pints and watch the end of the free UFC event.  To my surprise when I asked if they could throw the fight on I had some poorly dressed man who claimed to be the manager come over and proceed to inform me that they dont show the fights as a house rule. When I asked why he mumbled something about 21 year olds. Keep in mind I was the only custome in the dinning area.  After scanning the bar area it was clear as it was with my previous visits that the bar is strictly for local bar flys from the surrounding area furthermore it was clear that all the characters there were with out a doubt being over served. This became more evident when I decided to leave and headed to my car I saw 3 different customers stagger to their car clearly intoxicated get in and leave.  Its simply a matter of time before someone from \"tin cup sports grill\" kills someone.  Lastly please remove sports grill from the name as you need to show sports at the bar in order for it to be a sports grill"}
{"text":"A good spot to watch the game. Plenty of screens, good food, and fresh pints.  Even when the game isn't on, we like the wings, unique burgers, and nachos.  Honestly, this is one of the best places for fresh, crispy, flavourful wings."}
{"text":"Nice place to drop in for lunch or dinner. Large, clean and with a golf thyme to make it interesting. Friendly staff, good pub food and not too expensive.  It's a local place but without the locals."}
{"text":"Couldn't tell you how the food was because I left after being ignored by the waitress for 20 mins...."}
{"text":"Good Buffalo wrap & Caesar salad & kids Mac & cheese.  Went here after the Polar Bear Dip in Coronation Park New Years Day!"}
{"text":"Great food, friendly and attentive. Their large nachos are just as advertised !  Ribs are always awesome, seems like they smoke them for hours. Beer is cold  :-)"}
{"text":"I'm almost hesitant to review the Tin Cup, because it's already way too busy -- if I recommend it, will more people show up and make it even busier? Still, wow, the food here is simply good! The Vegan Buffalo Mac and Cheese is brilliantly delish -- creamy, garlicky goodness. The Buddha burger is really tasty -- a bit too soft, but an interesting mix of chickpeas and other veg. The Buffalo Cauliflower Wings are yummy, but I have to ask for the mild sauce as they've really got a kick.  The service is great. My only complaint is that the place gets way too busy on weekends, but I suppose that's a testament to the good service and outstanding food."}
{"text":"I've been here maybe 50 times, the waitresses are always friendly and the service is excellent, I've eaten a lot of the menu choices, but I keep going back to their chicken wings with a  caesar salad. The caesar salad has been consistently delicious every time I visit, the wings are excellent on most visits. I have only one complaint the temperature of the beer on tap has always been too warm, I've tried all of them and it is always the same for the last three years, too warm, If they fix that I would visit them more often and give them another star."}
{"text":"This place was recommended to us by a local during a short stop through town. My mom had the crispy chicken salad and I had the Thai Tangler salad - both were good but mine was especially delicious (add the shrimp, it's so good)! Reasonably-priced food in an unexpected location."}
{"text":"It was a so so place in a so so location. The service was a little slow cause it was the Family Day Monday & the place was packed with Families!   I ordered the buffalo Chicken Wrap. It had somewhat of a \"blah\" taste & it matched the rather odd taste of the vinaigrette coleslaw. My wife ordered a wrap with sweet potato fries, they were tasty. One thing I'd like to point out is the place was very cold. I sat next to a window & froze my butt off!!"}
{"text":"Once upon a time, I was a regular at the Tin Cup. It was right down the street from the house I grew up in so it was a very convenient meeting spot/ watering hole. This place advertises itself as a 'Sports Grill'. I don't think they do themselves justice. They have a fabulously extensive menu, including a few excellent vegan options and the food is REALLY GOOD. Everyone I have taken here has been pleasantly surprised. People don't tend to go to a 'Sports Grill' for the food - that is, until they go to the Tin Cup. Now, every time I find myself back in Oakville, I make a point of stopping in for a vegan curry :) The prices are reasonable too and they always have some good classic rock tunes playing. The outdoor patio seating in the summer is the best. It's a great spot to pass an afternoon with friends or stop for lunch or a beer. The servers are all absolutely lovely. Kat, specifically has always been so friendly and accommodating. Thanks Tin Cup! See you soon!"}
