{"text":"Fast delivery as promised but I ordered a Sicilian pizza and the crust was just very bland and had absolutely no flavor. My wife stated that it tasted like cardboard, and I would have to agree. Their regular thin crust pizza is just ok, lacks taste. Hoagies soggy. Very overpriced for the quality, unfortunately.   Just seems to be another example of a sub-par, cookie cutter pizza shop. The only thing I have to compliment on is really the sauce. The sauce is actually pretty good. I would recommend going to Primanti Brothers for your pizza desires. I'm very rarely disappointed by their pizza.  Sucks that I have to give such a crappy review, but I have absolutely nothing to rave about. Totinos party pizzas have more flavor. If you haven't already noticed, I feel their food is terrible. That is all."}
{"text":"I called looking to place an order for delivery and the girl on the phone said they dont deliver to new ken.. Before i could even respond saying ill pick it up she hung up on me, how rude."}
{"text":"Not good. The crust was overdone and tasteless, it even curled up as you can see in the picture. I never went back. From Italy has much better pizza."}
{"text":"STAY AWAY!!!!!  Absolutely atrocious pizza and wings!!  We went there for my daughter's 5th birthday (luckily they don't' know any better...)  I would NEVER visit this dump again.  Service was mediocre at best, the pizza sauce tasted like it had sugar in it, the dough was gross, the cheese was barely melted.  Now let's get to the wings....it really isn't hard to make them.  You put them in the deep fryer take them out and toss them in sauce.  I ordered garlic/parm.  I got melted parmesan in a butter soup.  No taste of garlic.  Fast forward......all of us had to run to the restroom several times after eating here and I'm still feeling it today.  I will spare the details....  I have never been so irritated with a restaurant before.  STAY AWAY!!!!"}
{"text":"All food is good here I usually get the Italian sub or pizza. Would recommend. Very busy on Friday and Saturday. If you can pick it up usually takes about an hour for delivery. And if you order sides of sauces make sure you get usually they forget to put in my bag."}
{"text":"This used to be my favorite Pizza spot, but over the last 6 months the quality has been inconsistent at best. We've actually stopped ordering from here completely. Unfortunately, there aren't any other decent Pizza places in Springdale."}
{"text":"After looking for somewhere to eat on a Saturday night and not having any luck we ran into TNT dynamite Pizza. The parking lot was pretty busy so we figured it must be good. We put our order in and was told it would be 30 minutes. However, after about 20 minutes our food was ready! We tried the pepperoni pizza and the Buffalo chicken rolls. They were both very good! I think that I will get the pizza with extra cheese next time but that is only because I like my pizza really cheesy. The crust was very good but was thin crust. I love thin crust but just wanted to share that in the review. The sauce was good too and there was just the right amount.  The buffalo chicken rolls were good as well and come with ranch dressing. They were had just the right amount of heat kick to them do that you could enjoy the buffalo flavor.  Will definitely go there again. Might try the Italian hoagie next time as I heard they are really good."}
{"text":"I stopped by here this past weekend with my girlfriend for dinner.  We got there around 6 pm on a Saturday and walked right in and ordered the eye opener plain,an 18 inch pizza.  We were told that it would be about a 20 minute wait which was fine by us especially since the delivery times started out at around an hour when we got there and were up to an hour and half by the time we left.  It was a Saturday night though and so I was not surprised.  The restaurant itself was small but clean and looked like an old diner with what seemed like an old food bar in the middle of it and a couple of tables against the windows where we chose to sit.  Within the 20 minutes we were told our pizza had come out and it looked good, albeit fairly greasy.   As I think can be done with all pizzas, this one can be divided into its three major components : crust, sauce and cheese.  The crust on this pizza was pretty good, crunchy on the outside, soft on the inside when it mattered and cooked nicely.  Next is the sauce which seemed to be ok but I honestly could not taste much of.  That was probably due to the fact that there seemed to not be much of it on there although I know there was enough on the pizza  to cause the cheese to slide off the piece whenever it had cooled.  Last up is the cheese which tasted nicely and of which there was a ton.  All in all a satisfying pizza that I enjoyed.  The bottom line for me is that I would head back in the future if I was in the area.  The pizza was reasonably price, tasted good and had what seemed like a mountain of cheese on that I thoroughly enjoyed."}
{"text":"Had a smorgasboard of items since we ordered lots of stuff to stuff our faces.    The Dynamo hoagie is steak and cheese with lots of fixings was dynamite!  The Italian hoagie was fun to eat with some pepper in some of the meat and not as sloppy as my fav.  The pizza is very good with a thin soft crust with a nice sauce with just enough spices."}
{"text":"Great pizza shop food is amazing but customer service is lacking ordered pizza at 6:09 and when I went to pickup at 6:50 not ready. Took my money but did not let me know what was going on with pizza. Not normal for here but they still could have at least talked to me. Very unprofessional. Pizza took 1hr and 10 min. On a pickup order. Like said this is not normal for this place but I could not rate them higher for it."}
{"text":"I came here with a group after a long morning cleaning up the river, and we were starving! Our main goal was to get food in our bellies as quickly as possible, and Dynamite definitely did the trick. The place is definitely a dive, but that has never stopped me from going anywhere. And I think the pizza was pretty good, but I was eating it so fast, I didn't appreciate it as much as I probably could have. I wouldn't come out of my way to go here, but if I'm in the area and need a quick bite, this will be my spot."}
