{"text":"I stopped in to grab a couple of dinners to go, and was very happy with the quality and size. I ordered the bulgogi box and spicy chicken box.  It would be a great place to grab something to go and sit in the park."}
{"text":"SoYummy Factory has move to this new location! I love their Kimbap and I am very happy to see a local Ma and Pa shop growing into a new and better location! The shop is a block away from the original location, but the kitchen is now bigger and the restaurant offer much more than just 5 items. They have a full menu!  We ordered the kimbap set and spicy pork with rice.  Both item came with soup, which was an awesome starter with some fish balls. Then we got a side salad (i think it comes with the spicy pork). We finished the soup and the server saw we finished the soup so fast she asked if we wanted more! I was surprised but we kindly rejected but was very surprise they would offer us more. I can tell they treated their customer like real guest and i love that!   The Kimbap set meal came with a small side of tappoki (which you can order as a full size), one roll of original kimbap (has mix vegi and pickled veggies rolled together, like sushi rolls) and two pieces of 'waffle filled dessert' (you can also order more of these). This taste exactly the same as before. There were so many items on the menu so we also tried the spicy pork with rice, and it has a bold flavour and spicy! I really enjoyed it! (FYI their spicy has a kick to it, you have been warned) The portion was decent for $10 for both items!  I highly recommend this place to everyone who craves a simple roll or korean food in general. I will come back to try the other kimbaps!"}
{"text":"Great place to get a meal to go! Friendly staff and great selection of set meals; definitely a great bang for your buck."}
{"text":"This is a new place i found one night i was Pokemon hunting so i waited a couple of days and made my way down to Chinatown to this take out /small dine in place. I ordered 3 mealboxes. 1. Bulgogi box, 2. Japchae box and 3. Rice Omelet box. I was impressed with the meal each costing about $12. Which includes soup. The side dishes are different each time, cause they make them fresh daily. The norm Kimchi was nice and spicy and not too sour. The Bulgogi needs a little more sauce but that is to the individual. I loved the way mine was made. Oh and the Potato salad was yum! Good prices for the mealboxes. Service was great and fast. The dine in area is really small so this is more of a take out place. Worth checking out!"}
{"text":"Amazing meal boxes. Reasonable pricing and authentic Korean food. Must have! We will definitely come back for more! Thank you!!!"}
{"text":"Very good Korean food!  I'm impressed!  And such a good deal for lunch specials only at $9.99!  Had the Spicy Chicken, comes with rice, salad, soup/pop and a choice of a side.  My side was the fish cake.   The other people in my party had the bulgogi, the chicken bulgogi, japchae, & kim chee.  All were truly tasty.  Just wished the kim chee was the original kim chee with the white long cabbage as opposed to just daikon.  Will be back!"}
{"text":"I was walking around Chinatown and saw this new restaurant selling Korean takeout boxes (they opened a week ago). I picked up the two vegetarian options to go.  One was a Japchae and the other was a korean sushi roll.  The mealboxes come with a soup (meat broth) and a pop as well.  The food was okay, it was not as flavourful as most korean restaurants; however it was decent for fast food. For the pricepoint (about $11 each) and the ease of grabbing something quick; I would probably get it again.  The reviews for the meat dishes seem to be better."}
{"text":"Very tasty and good value. I got the spicy pork box; this isn't on menu but they were happy to make it for me. It was abundant- aside from the pork was a substantial portion of very good rice, a green salad that was beautiful, a cup of a thin but flavourful spicy vegetable soup, glass noodles, kimchi, fish cake, omelet, and potato salad. Really big portion. I like it very much and the level heat was perfect (which is to say, very spicy). I am taking one star off because the pork loin was quite dry- next time I'll try bulgogi or the spicy chicken and see if that's not as dry. But it was very tasty, and service was really quick and friendly."}
{"text":"This place was great. Love the concept of Korean take out. Was looking for a little snack and loved the large portions."}
