{"text":"Dropped into this little hidden and somewhat dark gem this past weekend after hearing great reviews from my new neighbours.  I've popped in before (a few times) to find that the kitchen is closed - that is entirely my odd stomach that finally feels hunger at odd afternoon hours. 

The place is, in true Leslieville form, quite kitschy.   The old ticket window is lovely, the oddly signed toasters, not so much.  the mixed and matched salt and pepper shakers add alittle something something to each table.     

We missed the line up and were seated right away.  The service was attentive at first, but slipped off as the resto became busier and busier.    (ie, no one check on our food or if we needed a warm up).  Although a server, no ours, noticed I didn't get toast (shocking) with my meal.  Of course, I'd asked for it on another plate, but it never arrived.  My mate wanted the toast.   he's a dear.

  Breakie for 2 was 30$ - we'd been warned it was abit on the $$ side for Leslieveille, but really, I think that is right on pare with several places on the strip. 

My mate at the breakfast bowl.  It was AMAZING!  had just enough heat and was full of flavour until you hit the mound of potato.   I had the SanFranciso Eggs (scramble with avacado, scallions and cheddar).   Safe for the gluten and dairy free crew if you ask for sans cheddar of course.

My mom always states that you can judge a good resto by its coffee.  A simple woman, I know. But the Dutch know what to demand.

Get out on a nice day and dine el fresco."}
{"text":"The place is pretty cute with decor, plates, bowls, teapots etc. that's seemingly a mash up of cute garage sale finds with toast prints painted on the ceiling. They have a number of old school toasters scatter all around the restaurant and salt & pepper shakers differ at each table. 
We came here because my sister has been raving about this place for awhile, completely enamoured by the french toast.  So naturally I had the cranberry cream cheese french toast, which was good but not ah-mazing like how my sister boasted about it.  Yes, things usually never live up to its hype so perhaps this maybe an unfair assessment given my expectations. It was a bit more mushy in the centre than I would have liked due to the cream cheese that was spread between the toast. 
My sister liked her smoked salmon benny and had no complaints. 

It's a cute and unassuming place to check out for brunch."}
{"text":"Been twice. Fast service both times even when busy. I've only had the eggs Benedict special which was very good. Price is slightly on the high side but the service and food make it worth it. I'll definitely be headed back."}
{"text":"So I went tonight to toast restaurant for dinner, thinking it was really good because of some of the reviews I read. But... the food is horrible. And I think its overpriced. We had Roast Duck Breast, the duck meat was like gum, totally over cooked. The portion was like mini, for 22 dollars. 
Never gonna go back there again."}
{"text":"Sunday morning, long weekend. Closest brunch restaurant to us on Queen St. Within stumbling distance, guaranteed to serve coffee. 

To be honest, I was worried after I checked the reviews on here. Maybe I was expecting the worst, but I LOVE eggs Florentine, I needed them, and I didn't want to wait in line at Lady Marmalade. 

Our server was polite, friendly, attentive and gave me a compliment. Good in my books. 

The hollandaise was yummy, and tasted homemade. The coffee strong and fresh, constantly refilled,  and my dining companion could not stop praising his Angus burger. The table beside us were chatting about their feed, and it appeared as if they were really enjoying it as well. At the end of the meal, a woman appeared (owner?) and checked to see if we needed our card rang through, anything else, some water perhaps? It was a nice touch.

So our experience was good. I really needed to love this place as it is so close, and we will be back for sure."}
{"text":"We were a bit nervous about trying Toast for brunch, given some of the mixed reviews about the service.  We went with two other friends and are happy to report that the service was fine.
We ordered the omlette, raspberry stuffed french toast and blueberry flapjacks.  The french toast was a bit disappointing in that the filling was not sweet nor did it have any real raspberry flavour.  The flapjacks were ok, the accompanying blueberry compote was a bit bland.  The omelette was good and they were able to accommodate some dietary restrictions which was great."}
{"text":"I've always been curious about this quaint lil' eatery in Leslieville. After all, it gets some props as being apparently one of the first places to spring up in gentrification of the once rough n' tumble strip of Queen East.

I'd planned on doing brunch at some point but wound up there for a quiet pre-Valentine's dinner instead.

Here's how it went down.

First the positive: the decor is kitschy but charming. Collections of antique toasters are everywhere, and tables look like something out of a vintage 1960s Better Homes & Gardens kitchen edition. The lighting was right, and the music was varied and properly low for dining.

The service started out on the right foot: the waitess was friendly and chatty. It wasn't hard seeing as we were the first (and almost only) table that Saturday night. But it went downhill from there. I guess the lack of clients gave the waitress an excuse to hang out in the kitchen, busily text messaging and largely ignoring her only paying customers. 

When she did take orders she would walk away mid-sentence, not giving us time to order extras, or ask questions about what we were getting. There were specials on a blackboard high above us, but they were never alluded to, nevermind read out by our server. And we only noticed them once it was too late.

That may have been a good thing, as it turned out (from observing a neighbouring table that eventually came in) that the promised grilled Tilapia special was actually a batter-fried fish n' chips, which someone had forgotten to update on the board. Oops!

The menu is an eclectic mish-mash of fusiony Asian and Italian items. We started with asparagus, wrapped in smoked salmon on a bed of cornbread. It was very tasty. Shame the asparagus was overcooked, stringy and impossible to cut.

We had to beg for bread, which was eventually brought out after our appetizer. When it came it was a qualty focaccia, but it seemed to have been sliced hours earlier.

My partner and I both ordered pasta dishes. She had a veal/prosciutto agnoletto (like a ravioli, it was explained) and I had linguini with scallops and shrimp. The agnoletto was unexceptional; I couldn't taste much of the prosciutto, and the tomato sauce could have come from a bottle.

I quite liked my linguini, which had lots of the promised seafood, and a  nice, very lemony sauce. I'd had my fill by the half-way point though, and wonder if the dish wouldn't have been better as a half-portion.

For dessert we shared a decadent chocolate cake (the actual title on the menu) and an apple crumble. The cake was, as promised, decadent, so hard to complain there. The crumble on the other hand tasted past it's prime, with soggy oats and rubbery (though at least real) apples.

The total, with appetizer, dessert and wine was about $100 for the two of us. Not outrageous, but given the inattentive service and uneven food I won't be doing dinner there again. May give it a shot for brunch, but I wouldn't go out of my way."}
{"text":"People of Leslieville are spoilt for breakfast/brunch places. We didn't feel like waiting in line for Lady Marmalade, we didn't want anything too fancy like Joy Bistro, something a little more classy than Leslieville Diner and Leslie Jones wasn't open (is this place ever open??)  so Toast it was! 
Ok, there was a short line but it moved quickly and before I could finish perusing the Eye magazine article on Rob Ford (noooo!), we were seated in the area by the kitchen. comfortable and interesting decor.
Our server was very friendly though I was a bit apprehensive about asking the other two servers for some milk to go with my tea as they were flying back n' forth between the kitchen, it looked difficult to break their momentum. 
My order was the huevos rancheros while my husband went for the eggs florentine. My huevos rancheros came with a slighty crispy thing (yes, not quite sure if it could be called a tortilla. kind of like that thick, fried shell you get with a taco salad at Taco Hell). It came with a nicely flavoured salad and some hash browns. The main part of my dish was slightly too salty and the hash browns were slightly too cold. My husband seemed to enjoy his dish although it looked a little on the bland side.
Toast serves up a decent breakfast/brunch and the portions are good but I just found it middle of the road. With so many breakfast/brunch places vying for patrons in this area, I'm not sure a 3-star average is enough to make me a regular."}
{"text":"Went to this place once. It was a rainy Saturday afternoon. The restaurant is really small but the food was yummy and the waiter was genuinely friendly. I will be back!"}
{"text":"Known for its brunch and even better known for attracting A-List celebrities like Clive Owen and Julia Roberts due to its proximity to the film studios on Eastern Ave.  One thing that you will immediately notice is the number of Toasters prominently displayed around the restaurant that are autographed by celebrities which are a testament to the popularity of this spot in the neighbourhood of Leslieville.

Owned and operated by Tony Barnaby, Toast Restaurant has a charming atmosphere, friendly wait-staff, awesome brunch and dinner menus and a decent wine list.

Dining at Toast feels like dining at a close friend's place - warm, friendly and inviting.  If you haven't been here yet, it should be on top of your list to check out brunch or dinner!"}
{"text":"Toast is part of the Leslieville revival! 
A small, but very inviting spot on the Queen East section of Leslieville, toast offers an absolutely amazing brunch. I happened to jump into my all time favorite - eggs Benny, and it was superb! The hollaindaise was fresh & not too runny, and the pemeal bacon ( no doubt ) was a little on the salty side - but that's ok!
The service was great, ours was very pleasant and always was there to serve our needs. The place is a little small, so expect a wait on the weekend. Don't forget to check out the stencils of toast on the ceiling...classic touch!"}
{"text":"Ever since first trying the Monte Cristo breakfast sandwich at a café near my work I can't get over the dish and am currently on a slow quest to try every one in the city (list coming soon). That said, given my fondness for the sandwich, my review might be a little biased... Toast on Queen serve an excellent Monte Cristo sandwich. Formally 'Hello Toast,' I have been told (by my boss) that the restaurant is somewhat of an institution in the east end. I've been there a number of times and most of my experiences have been great. The décor is kitschy with the mish mash of chairs, tables and cutlery giving it a boho/hippie/couture-type vibe. And if you are into this sort of thing (which I am), they have a collection of toasters signed by celebrities who have, at one point in time, ventured into the east end. On the downside, the line to get in can be a little long, as can the wait for food. So go planning to take it easy..."}
{"text":"Just a note - the address may say 993 Queen, but when you get to that location, you'll realize that the restaurant is yet to be found.... it is because it is on the other side of the street, 100 metres EAST. you will seee a sign with a slice of toast outside ... so not to worry - this place DOES exist. The decor was very cute with a variety of toasters, some signed by people. The place seemed rustic and home-style.

After walked around and around, we walked in just before 1pm on a Sunday to a whiff of HOT HOT heat! There was one ceiling fan and a large open window and door,, but don't expect any type of air conditioning. You wish it was windy outside because every bit of breeze was a gift. Expect to sweat it out here!

Drinks were brought out quickly - fresh orange juice with pulp always makes me happy. I was told by our friends that their coffee was pretty good as well. Their menu has both brunch and lunch selections and a few specials on their chalkboard. Despite always going for pancakes and french toast (it still looked delicious), their special benny spiked my interest when bechamel sauce was brought up. I have always wanted to try it so this montreal benny which had leek, asparagus and mushroom on a baguette was a must-try.

and then the waiting began... and waited and waited and waited and waited.... honestly felt like 45 minutes at least. The owner (nice little lady) was nice enough to come by to tell us our food was coming out next and the kitchen was making fresh hollandaise, so we were excited (and hungry).... but that took probably another 10 minutes, which was an additional let down.

Once the food finally came out, there was little talking as everyone was starving. The bechamel sauce tasted like a mushroom cream sauce - I'm not sure if that's how it supposed to taste but it was delicious. The baguette was soft and the mushroom leek and asparagus was a nice change to the usual bennies I've had. The poached eggs were way too soft,... it was really close to raw in my opinion, which is not my preference. But when you're that hungry and waiting that long.... you just forget about the rest.

My consensus is that if you get seated but have to wait this long, I would rather stand in line at a place that will deliver in a more timely manner. It's just the difference of sitting in a chair or standing - I'm still dealing with 30 degree heat inside or out."}
{"text":"Oh my...

I skimmed through the menu and the reviews by my fellow Yelpers before I joined my cousin two Saturdays ago at Toast for my birthday brunch. I was prepared for bad service, but was expecting a good meal. Little did I know that the two would be flipped around, leaving me very disappointed with my food and feeling a little guilty, since my cousin was treating me.

I had decided on the blueberry pancakes with peameal bacon before I'd arrived, and was looking forward to two of my favourite breakfast foods. Yuck yuck yuck! To start off, the coffee was horrible. It was so bland and flavourless and watered down I couldn't believe you could get something as easy as coffee wrong but they did. Or maybe they'd just had it sitting out for too long, I don't know. When my food arrived I immediately noticed a sheen on my bacon. Yes, a SHEEN. As in when I tilted my head around different ways I could see the sheen CHANGING COLOURS. I felt obligated to have a few bites, but the peameal tasted so strange and the unknown double rainbow that was taking place on my plate was such a turn off that I couldn't stomach anymore.
I moved on to my pancakes which weren't any screaming heck either. I like a pancake crispy on the outside and fluffy on the inside, and about a pinky's height (bottom to top). These were thin and lifeless, with some goopy blueberry jam gunk scooped on top. They were rubbery and not cooked the whole way through - PANCAKE FAIL. I don't understand why restaurants get pancakes wrong all the time, it's such a simple food! Again, I felt obligated to finish them and slap a smile on my face. The service was actually the best part of the whole dining experience!

The decor is fine and yes, there are toasters everywhere with signatures from celebrities scribbled on, but it makes me wonder if they were actually happy to sign their name or if they felt obligated after eating a shitty meal themselves.

If you want a good pancake go to Mildred's Temple Kitchen in Liberty Village (fresh and surpass my pinky-height minimum) and tasty, sheen-free peameal, grab a sandwich at St. Lawrence Market or House on Parliament.

If only my cousin hadn't been to Lady Marmalade the weekend previous, as that was MY suggestion. Shucks!"}
{"text":"Went for brunch one Sunday; arrived at 10:30, seated immediately.  By 11:00 the place was jammed.  Food is good, portions are very large.  We had French toast, which was very good, and eggs and hash.  Flavourful and fresh.  The only reason Toast gets 3 stars is the service.   Servers were indifferent, never returned after our food was served and made zero effort to engage us in any way.  News flash:  an Irish accent does not automatically qualify you as a superior being.  We 're spoiled for choice around these parts so if you're service sucks it's pretty easy to get the same offerings elsewhere.  May/may not be back, undecided."}
{"text":"The first time I ate here was before the brunch rush, and the second time was this afternoon on the tail end of a brunch rush.

The food was okay and you can refer to the \"The Good\" from my prior review.  It mostly still stands.

Today's \"The Bad\" - all about the service.

- I ordered poached eggs and they came scrambled. That was fine, they fixed this right away. It set the tone for what to expect though.
- I had to ask for a coffee refill and it came... along with some weird shit floating in it.
- I asked for ketchup when the coffee refill arrived and the guy looked at me and said \"Is there anything else while I'm here?\"  I thought he was joking and I smiled and kinda laughed and then he said \"I'm serious, do you want anything else while I'm up.\"  And looked at me with a really \"pissy face\" that let me know that he was, in fact, serious. (If you are reading this, staff of Toast, this interaction is why I only left you a 50c tip. I don't really know how to politely remind you that it's your job to get my ketchup. Why don't you just have ketchup on the table anyways? Both tables next to me also ordered ketchup ...I just want to be clear that I understand gratuities. Your 50c is a true reflection of your awful service this afternoon.)
- It was again, very expensive.  For me & Kat it was $36.  This included two $10.75 breakfasts, a $2.25 coffee and an $8 Caesar.  For $10.75, coffee should be included. Or at least refilled without floaties/me having to feel bad about asking.

In closing, I actually felt bad about myself for asking for a condiment in a restaurant today, so I will probably never go back here even though the food is good. Dealing with the people who hate you so much they don't want to bring it to you isn't worth it.  

The math associated with this 1 star rating is as follows: original 4 star rating, -1 for the floating stuff in my coffee, -1 for server attitude and -1 for messing up my eggs/not bringing Kat's drink."}
{"text":"I have to say that this restaurant had the worst service that I have ever experienced in my life.  We sat there for almost 40 min without even getting coffee and to top it all off the people sitting beside us who came in after us were already served and eating. After having to go and beg for my coffee and then go back to ask for sugar, we walked out of there without even eating!
I don't care how good people say the food is, the service was so bad that I lost my appetite!"}
{"text":"Regarding the \"friendly servers who wait in the wings to serve you\" - this has since changed and is the reason for my update. The friendly servers are long gone and have since been replaced with two new types: one is a surly, bitchy diva who acts like you're inconveniencing him when you ask for things like condiments and coffee refills, and the other is a flighty, inattentive bore that you have to flag down to remind that you ordered something in the first place. Sadly, I won't be running back to Toast if this pair is on shift."}
