{"text":"We had reservations with a group of friends on a Saturday night for 5:30pm and the timing was perfect because this restaurant was incredibly busy as the night wore on - not sure if it was because of a typical summer Saturday night or the tourists because Toca is located in the Ritz Carlton.

Almost everyone had the tasting menu (foie gras, a lobster pasta, beef cheek and chocolate ganache) and I would get it all over again.

The foie gras, though rich, was balanced by toast and get this - a red onion sorbet. The combination was the most bizarre-sounding yet one of the best I've ever had. The sorbet was sweet and cold with a red onion twist. And initially, it seemed strange with the hot and cold, but it was perfect. The lightness, sweetness and tartness of the sorbet counter-balanced the fois gras. If I could go into a Baskin Robbins and ask for a red onion sorbet I would. I could easily eat 10 of these. The only other appetizer that can rival this for me is Michael Mina's tuna tartare.

The lobster pasta was nice and light despite being pasta. The serving size was just right, giving me a great taste of it but not over the top so that I felt uncomfortably full after (with not enough space for the rest of the menu). They gave a good-sized lobster claw and with the al dente paste, perfection again.

The beef cheek was incredibly tender - cooked just right. It was tender and juicy, on a bed of potato mash and gravy. I love beef tongue and the texture was similar, except it was a thicker meat. This was also very rich.

Lastly, the chocolate ganache was lovely as well. The coffee grinds and maple ice cream were a nice compliment and the ganache itself, light and slightly rich. 

Some friends also had the wine pairing ($95 for the tasting menu and $45 for the wine pairing) and the wines (including an icewine at dessert) they said were perfectly complimentary. They said the chianti served with the beef cheek was just right.

My husband was the only one not ordering the tasting menu - we were told that the signature ravioli was one of the best dishes so he decided to get that. He loved (and so did I). I would come back and try that as my main next time.

The service and atmosphere here were bar none. The server thoroughly explained each wine we ordered (including the single servings) and when our food was brought to us (we were a party of 8), there were 3 to 4 servers who laid our food down so that the rest of the table wasn't always kept waiting. Even as one of us went to the washroom, a server just passing by would pick up our napkin left on the seat and fold it nicely, leaving it back on the table for us. 

I'm so glad we came here and I would definitely recommend this restaurant and come back. We're told that the breakfast (particularly the scrambled eggs) are excellent, so that may be something we'll try as well."}
{"text":"Food: 4/5
Service: 4.5/5
Cleanliness: 5/5
Price: $$$$

The Ritz Carlton in Toronto is located in the heart of the Financial District on Wellington Street. If you're dining at TOCA, a discounted valet fare is available for $15. When we visited, we had a chance to see the biggest gingerbread house! It was made of 100% edible ingredients and desserts, quite a sight!

The Sunday brunch is offered from 11:30am until 3:30pm, and we were only able to secure a table for two at 2:15pm. I reluctantly agreed to a late brunch, but I've got no one else to blame but me for making a late reservation! You can book a table directly through the restaurant's website or on Opentable.

We arrived a little earlier than our scheduled 2:15pm time slot, around 2:00pm. Our host immediately checked if a table was available, and within minutes, we were escorted inside. Soon after, our server warmly welcomed us and asked about our drink preferences. I opted for sparkling water and my husband went for the unlimited Italian champagne. The $85 Sunday brunch includes an unlimited Mimosa and Bellini bar which I would love to enjoy when I'm a body of one again! Our server also told us where everything was located with the brunch, which included a cold seafood bar, a fresh made-to-order Italian pasta bar, a charcuterie board, a carving station, classic brunch dishes, viennoseries, a room full of desserts, an omelette station, and a huge selection of cheeses.

Naturally, our favourite was the cold seafood bar which consisted of fresh oysters, crab legs, lobsters, and shrimp. I'm not the biggest fan of cold lobsters- they're normally rubbery in texture (at least when I tried them in the past) and tastes bland to me so I was skeptical at first to try TOCA's cold lobster unlike my husband who loves them.

I was very surprised to find myself reaching for seconds because they were so well cooked! Soft in texture while it was thoroughly cooked, juicy and so delicious! There were a wide variety of sauces and sides to enhance my tastebuds and the lobster ended up being the star of the brunch for us. I wish I had tried some of the oysters though...they're my favourite. #preggoproblems

All the seafood was prepared so that it made it very convenient and easy for guests to enjoy.

My husband also loved the carving station, which only consisted of the Beef Wellington. Though there was only one menu, it was really well done as well! There's definitely something for everyone for every appetite.

I next tried their classic brunch station, where benedicts and pancakes greeted me. I was a little disappointed to find the benedict warm but not hot, and dry from being made too long ago. I suppose that may be a down side from attending Sunday Brunch at 2pm; benedicts may no longer be in demand at that point...which make the remaining ones turn cold. The pancake was great as was my risotto, but overall they weren't dishes that made me return for seconds.

I couldn't want to check out their dessert room...can you imagine? A room dedicated to desserts!! Too heavenly. There were roughly 10 choices of desserts and sweets including homemade marshmallow, red velvet whoopee pies, chocolate fondue, cheesecake, and much more. 

Though the Sunday brunch is until 3:30pm, the dessert room was kept open until 4pm. Throughout our meal, guests poured in until 3pm. If possible, I would recommend you to make your reservation before 3pm to give yourself ample time to try everything.

Our luxury Sunday brunch at TOCA was definitely worth every penny. In fact, considering the unlimited drinks and lobster at The Ritz Carlton, the $85 is not a bad deal at all.  Hubby and I've visited many other hotel buffets that were much more expensive with much lower quality food. If you've had TOCA's Sunday Brunch on your to-do list, we highly recommend it! It's definitely worth the splurge for its quality in food and service. Everyone was friendly, helpful, and quick to help."}
{"text":"My partner still raves about TOCA as one of the best restaurants I've taken him to after all this time! A very unique dining experience, the cheese cave tour was definitely a highlight. Wonderful staff, an excellent wine list and an impeccable menu!"}
{"text":"TOCA is a welcome addition to the entertainment district. I haven't been for brunch (yet!) but I've heard good things. Dinner was very well done. I don't have much to say that hasn't been said before but it justifies it's price and has a great atmosphere. The food is consistently delicious and waiters are always helpful. Phenomenal wine list as well! The food is pleasing to everyone, making it a great spot for a group celebration. Ingredients always taste fresh and prepared artfully. The Ritz as a whole is a winner for its restaurants, and TOCA is no exception. Absolutely recommend!"}
{"text":"Nice bistro/cafe style spot. Really not what I was expecting. Not luxurious. Very casual. Not very impressive spot.

Ouch. Not bad if you want a loud cafe in a hotel lobby."}
{"text":"Toca...Toca...Brunch at the Ritz-Carlton's beautifully-appointed restaurant makes getting up early on Sunday morning a lot easier. We begin our gastronomic road trip with a glass (or two...or three) of prosecco and amazing seafood + shellfish before moving on to their healthy but yummy fresh salads. Onward to the prepared food display (delicious and cleverly-presented crab tins are to die for) and an impressive selection of cold and hot dishes (including juicy Beef Wellington).  We bypass the omelette pit-stop in favour of cheese + OMG breads....before reaching our final destination.....DESSERTS (the Paris Brest is beyond...beyond...). Incredible service  + selections + setting = a great weekend 'getaway'."}
{"text":"Was OK. Not in a hurry to go back.

Food is good quality for the most part but there was a few misses.

1) Oysters was dumped onto the seafood tray so they lose all their liquid. Generally the seafood tray was OK and not special.
2) The cooked foods were good but standard flair, no surprise.
3) Dessert was fine, read whatever you want from that.

Would be great if the price was less but they charge extra because it was mother's day weekend. OK I get why they charge more a lot of folks were the for M-day. At the price they charged (I think 80 a head + tax and tip) it should have been perfect."}
{"text":"Considering TIFF is carrying on, there is extra security, and paparazzi is outside the gate, you would assume it's really snobby, right? It was anything but and I can't wait to return! Door and bar staff were friendly and it was a pleasant surprise. :)
This is a classy place. Do dress up and expect to spend some dollars for a drink - or two. ;)"}
{"text":"Came here for their famous Sunday brunch. I'm impressed. 

Cold stuff: lobster, shrimp, oysters, smoked salmon and other cold cuts, various salads. I wish they would cook the seafood and have a hot version available. Food always seem bland when they are cold, maybe it's just me, I am not a cold food eater...

Carving station: perfect medium rare ribeye with a wonderful berry sauce. My only complaint is that it is lukewarm. If only it can be kept more heated without it being overcooked...

Hot foods: fish, chicken, omelet station, standard stuff

Dessert: my favorite part of the meal! All very high quality stuff, lots of mousse cakes and other stuff that is on par with what is offered in the best bakeries in Toronto. 

Service: Wonderful, as expected for a place like this! They did a lovely birthday cake thing for my mom. 

Parking: valet parking only. $10. Not bad for the location and service."}
{"text":"Toca Toca Toca!!!!! Before I begin to hype this place up, be assured that this is an honest and private review. So here we go...This is going to be a long one.  Third time celebrating a birthday and nothing but exceptional service, high quality products, modern and spacious layout with a selection that no Toronto restaurant buffet can come close to. If you are a seafood lover, sushi, lobsters, oysters and shrimp are offered. For the carnivores; beef wellington made to perfection, Cornish hen, two types of fish (not a fish eater, so can not tell you what type of fish were offered) and assortment of soppressata. Vegetarians are not forgotten: kish, couscous and variety of fresh salads. Then goes the standard: egg Benedict,  waffles, pizza etc.. If you have a sweet tooth, holly sh#t. There is a dedicated area just for the sweets. With no exaggeration there must have been 12 different options, from vanilla tarts to macaroons to puff pastry and we were told they bake everything in house. If you are not impressed yet... here comes the icing, unlimited bilini's and mimosas. After rereading the above, the 3 hour seating period might not be enough for the next time:) For those that are still READING - THANK YOU! Just a bit more. The little negatives that can be improved. A) The quality of oysters must be better considering the price point. B) As great as the dessert options are, they were better the first time that my husband and I visited. C) sushi can be more creative and have less rice. That is it for now. Until the next review."}
{"text":"We came here for a birthday and this was an amazing experience. This is simply the best place to go for a brunch in Toronto. Excellent food and service. Amazing quality and choice of food."}
{"text":"I went here yesterday with my friends and it was really not that impressive at all. I think the taste is probably a 3 star; nothing special, the portion is a -2 star, pea sized, and combine this with the expensive pricing is a 1 star. I had a risotto, which was really more like rice with sauce,egg, and cheese with 3 slices of truffle, that just tasted like normal mushroom. The portions were more like an appetizer. My friend ordered swordfish, and lets just say we had a great laugh at the portion. It looked like the size of a large scallop. Aside from the food, the wine selection process was awful and painful. 

Out of the wines we picked, 3 for 3 was unavailable. I find that extremely unacceptable for a restaurant their level. At the very least, please know which wines are unavailable so the \"somelier\" doesn't come back every 5-10 minutes telling me that the wine I selected is unavailable/out of stock. The somelier also had awful suggestions, kept on going off my price range and didn't bother to suggest wines from other countries to try to match what my friends and I were looking for (ie, I know you are looking at pinot grigio in Itay, this wine is from Germany but is very similar...etc etc). We were trying to get something around the $50 range and he suggested wines in the $100 range. Yea it is probably a good wine, but we aren't going to try it. It's just wasting my time. Also after the third time of \"unavailable wine\" the \"sommelier\" brought another Riesling and told us that this was a good and similar pick to the last wine I wanted to try, and told us it was \"the same price\" as the wine we had wanted, but when the bill came, surprise surprise, it was not the same price. To be honest, the price itself is not what angers me. If it is more expensive, as a customer, I have to right to know. Just tell us the price. It is close to your price range. It is $10 more expensive; it is $20 more expensive, etc etc. 

All in all, I don't think I would ever come back. If I was looking for italian food, I can get so much better at Buca or Enoteca Sociale for a much cheaper price range and much better wine. I can get better at Terroni than here."}
{"text":"This review is for the $109 four course Christmas dinner.

My family and I enjoyed a wonderful four course meal and our server Leah was wonderful.  I had scallops to start which were cooked perfectly.  Next I had squash ravioli which was delicious but my Dad's risotto with duck was even better.  For the main event I had traditional turkey with all the trimmings, they had a carving station so you could pick your favs or they offered to bring you a plate with a little of everything.
I was craving something chocolatey so for dessert I ordered off menu the gelato which was very rich.  Oh and the bread at the start was great too and they made me a delicious cocktail. 
All in all a great meal and excellent service!"}
{"text":"2.5/5! Overpriced and not that great. I was very disappointed. The rack of lambs was okay (definitely had better) and the Ravioli was nothing special. The only dish that I was impressed with was the Risotto. Overall, I think there are better restaurants in the area that this venue."}
{"text":"It's a 3.4.

This review is for the Toca Sunday Brunch at $85/person.


For the price, I was expecting at least entry level Vegas style buffet(not even close).  I would not recommend this if you don't plan on eating a lot of lobsters, oysters, and drinking champagnes, mimosa, and bellini.


The Good:
-Lobster tails were good (although not big, I would say the lobsters were 0.5-0.7lbs each and they cut the tail in half)

-Oysters were fresh (slightly better than the Spencers brunch and way way better than Spoonful/Imperial buffet)

-Really no limit on the amount of lobsters and oysters! (And they replenish rather quickly)

-Excellent service (drinks were filled without asking, plates were cleared)

-Unlimited champange, mimosa, bellini, bloody caesar, coffee, tea, etc.

-Most desserts were above average (Nothing Amazing though)



The Average:
-Lacked variety for the price. I got bored after the first 2 rounds.  I would say about 15 hot items, 5 kinds of pastries, 3 types of cheese, about 15 veggie items, 6 types of cold seafood, 3 types meat/veggie mixed small cups, 3-4 types of sushi. 

-The \"dessert cave\" most reviews were raving about had about 10-12 desserts(Although as pointed out most desserts were above average)

-Aside from the lobsters and oysters, most food items were just average or slightly above average (Nothing bad though)"}
{"text":"This restaurant is up there with the best of the city. Luxurious ambiance wraps you around with impeccable service to back that up. The restaurant is on the 2nd floor giving you the view of the streets below. I liked the openness of the ambiance.

 I came here with the girls for dinner but ended up ordering a bunch of snack-size dishes. We ordered and shared flatbread, fondu, salad, smoked salmon, cheese balls and more, which all turned out to be delicious! We especially liked fondu as it was fun to eat it , and the bread that came with was phenomenal. Mini sandwiches were memorable too. All foods we tried were exquisite, and we don't have anything bad to say about them. For the prices portions were lacking but everything looked so pretty and cute.

Foods arrived at random order but quickly. The drinks were not as good though. The waiter seemed to have forgotten about our cocktails but they were not worth the extra wait. 

This restaurant is fit for any special occasion you might be planning: Date, anniversary, birthday and so on and such. It is a romantic place also, which is perfect for dates."}
{"text":"In the newly opened Ritz Carlton is Toca by Tom Brody, notably from Canoe and North 44 who has also mentored under the great Tom Colicchio.  It's a simple elegant restaurant with a huge wine cellar and a cheese cave for you and your party to discover.  I was out with some fabulous ladies to chatter away and celebrate life, and when we walked in, we had the best table in the house at the center of the restaurant.  Maybe it was just me, but I was expecting some design elements to stick out or an ambiance dripping with luxury or mystere.  We were at the Ritz ... so it was disappointing.  The stench from the cheese cave also ruined the atmosphere for us."}
{"text":"Delicious for Brunch! 
I was surprised for my Birthday with an amazing brunch experience at TOCA. I'm a lover of everything Ritz and I can honestly say they did not disappoint with the $85 brunch. Seems steep, but you DO get bottomless mimosas, (a heavy handed server) a cheese cave and a dessert cellar. Need I say more? I will. 

The eggs Benedict was surprisingly good for buffet style, the seafood bar was to die for (oysters, lobster, sushi, and jumbo shrimps- as big as my palm. ) Did I mention there's a cheese cave?! 

Not too pretentious either- just enough for a Sunday morning. Some patrons were a little peppery, however the delightful crowd of Pyjama-sporting-I-have-too-much-money-to-care patrons soon brought them back down to earth. 

Love it here! 

Cheese cave, dessert cellar, bottomless mimosas. 

*be prepared to have transportation home, don't brunch and walk. Could hardly move and it was worth it."}
{"text":"Divine food, service and atmosphere.
Went here with friends on a Saturday night before a show and we were treated so well. 
The standout for me and always looking for the best of the best in the city was the hand-chopped steak tartare.  One of the best in this city right now.

What I do miss and wish they would bring back on their dessert menu is the \"fairy floss\". It was such a delightful and unique dessert in a high-end restaurant and I miss it. If you never had a chance to try it....it was maple infused COTTON CANDY!!!"}
{"text":"For the price, my overall experience at TOCA was not what I expected.  I ordered my $69 dry-aged bone-in tenderloin steak to be cooked medium.  It came out medium well to well.  My husband advised that I send it back.  I didn't bother because I was sharing it with my nine-year-old son, who was quite hungry and seemed to enjoy it as is, and I didn't want to make a fuss.  I did inform the server toward the end of the meal so that she could let the folks in the kitchen know.  Honestly though, when I go to a high end restaurant, I expect that they know what they are doing in the back and that I don't have to send anything back.  The flavor of the steak was good.

Their version of fish and chips, which was made with lobster, was a yummy starter.

Their heirloom tomato salad was pretty good.  I did find a few of the tomatoes to be a bit mushy, and this was a little disappointing.  A number of items that were on the menu, e.g. the raw bar, were not actually available.  Our server explained that this was because the restaurant was not busy enough to maintain the high turnover rate needed to keep those items fresh.  The lower than expected volume of customers could explain why some of the tomatoes were a bit past their prime.

I personally did not care too much for the sauteed mushrooms as some of them were a bit tough.

I did enjoy the squash side dish that was the Chef's Spring Harvest at this time.

The service was good and helped to make up for where the food fell short.  The kids' menu comes on an ipod touch that was loaded with five games.  This was a very nice touch.

Thinking back on the steak, maybe there's a difference between how Americans and Canadians define the degrees to which a steak is cooked.  My husband the cynic asked for his steak to be cooked rare although he enjoys it medium rare, and his steak ended up being medium rare.  I wish I had asked for my steak to be medium rare.  From now on, I'll just have to explain that I want my steak to be hot and pink inside and let the staff call it what they wish."}
{"text":"Slooooow service!!! Tues night, so only a few tables occupied. No reason we should have to wait 30 min even before our drink order was taken and another 20 min to actually get the wine.
Our whole meal was just waiting around for food that was fine. Well cooked, but nothing stood out. 
Definitely wouldn't recommend it. There are so many great food experiences to have in the city, this one isn't worth the cost of parking."}
{"text":"Food was very good with the exception of the pasta. The spaghetti in the amatriciana was a little too Al Dente, to the point of being undercooked. Other than that everything we had was delicious. The lobster caprese and scallops were excellent. I had the ribeye and it was cooked and seasoned perfectly.  The side of farmer's market vegetables was huge and very tasty as well.

Excellent customer service from our server Ali. He had good suggestions and knew the menu well.  Very courteous and respectful.

This is definitely on the high end price wise but the atmosphere is still very casual and relaxed.  I had a gift card and had told the server before we started ordering just so he is aware. I was worried that we would get differential treatment but this was not at all the case. Great place for a special occasion."}
{"text":"We stayed at the ritz and drop pen in late for dessert. Our group shared the molten choc cake, peach cobbler and toffee pudding all were fantastic   Will definitely come back for dinner"}
{"text":"Had a great anniversary dinner at Toca with my husband. The fillet mignon is excellent. The service is perfect, attentive but not suffocating. The desserts are super. Highly recommended and can't wait to be back"}
{"text":"Lunch with their excellent \"Raising Sun\" cocktail to start.  My son had the pasta special and I had the chicken salad.  Both were interesting and flavourful but small portions.  We had the tiramisu and caramel cream for desert which were delicious.  The ambiance is good, the service is great and the prices are high - as you would expect in a Ritz-Carlton restaurant.  I like to try new places but I will probably go back here to try their brunch."}
{"text":"Absolutely great service and meal. The specialty cheeses from the in-house cheese cave were spectacular. Branzino was prepared very well and perfectly portioned. Wine list provided great pairings. Our servers were knowledgable, friendly and engaging throughout the whole meal. Definitely will return on out next trip to Toronto."}
{"text":"We went for our anniversary!
Ordered the rib eye and wife ordered the sea bass. Both were good, but not great!
Atmosphere was nice, but not what we were expecting considering the price of the meal.
Hostess was great and made us feel very welcome!"}
{"text":"Came here for a celebration and it was a great experience.  The Sunday brunch was delicious with a wide selection and impeccable service.  Definitely worth coming to try!

Food: 
Lots of selection including wide array of cheeses, classic breakfast food (like eggs benedict, sausages, hummus), flatbread pizza, carving station, seafood bar, sushi, salads and dessert cellar.  Everything was wonderful but I have to say I really enjoyed the beef at the carving station and seafood bar.  Unlimited oysters, lobster, crab legs and shrimp that were already peeled so that it was easy to eat. The dessert cellar is amazing, lots of selection of great desserts (I think there were at least 10 types of desserts).  

Decor and Service: 
Very nice with great service.  The decor is very comfortable and soothing.  My glass of mimosa was always full and the waitress would always fold my napkin before I returned to my seat."}
{"text":"Very unremarkable in every way except for the service which deserves five stars. We had an amazing waitress who made the other waited look like dodos.
For their fish and chips they had fried avocados instead of fries...made me think Paula dean was manning that kitchen,,,could have been fried butter wedges for all the flavor and density it had!"}
{"text":"Webt back to Toca last night for the most enjoyable of evenings. There was a great energy about the place and a big group of women gave a real happy vibe to the restaurant.
My meal was simply fantastic. I had a tenderloin which I ordered well done because that's the way I like it and it was the juiciest steak I've ever had. I truly love Toca - by far my favourite in Toronto. From the serving dishes. to the elegant and spotless restrooms my entire time spent here has always been 100% enjoyable.
On to more serious matters - had the Walnut Souffle for dessert - just incredible. Was one bite in when I wondered should I order a second one but I just about controlled myself, If you have not tried the Souffle - I feel for you!!!!!
Can't wait to return - a very, very happy customer!"}
{"text":"One of the best places to \"see and be seen\" in Toronto, and one of the few places I and my friends go out of the way to make a yearly pilgrimage to.

TOCA is the Toronto Ritz-Carlton's signature restaurant, and it is one of the most interesting and classiest places to visit during the Toronto International Film Festival. Walk in here any day the festival runs and you're bound to see celebrities. George Clooney has frequented both this and the Ritz bar near the front of the hotel. Agents and reps from various film studios meet here to finalize deals for movies. It's a frequent site for people of all types to hang out and converse all things film-related.

I have been here many times over the years, and love the ambience and relaxed (but busy) atmosphere the restaurant provides. I have fond memories of hanging out here with coworkers and a pair of nice actresses we met at a party down the road, and enjoying vodka tonics as we talked about the entertainment industry.

The prices are also pretty reasonable, at least as far as drinks and snacks are concerned.

Also, if anyone from the restaurant is reading this, I apologize for the following:

1) Sneaking in the back door of the restaurant after getting turned away when I tried to walk in the front door.
2) Borrowing a Sharpie from one of the hostesses so I could draw a symbol on my hand so I could bluff my way into a Hello Canada party.
3) Fanboying over various celebrities and stars. It was a momentary thing, I swear.

That is all. If you're in Toronto, you owe it to yourself to check out TOCA. Come here on a warm summer's night and I can guarantee you'll have an amazing time."}
{"text":"I called ahead to have a single rose placed at each seat where a lady would be occupying it.  Then I arranged for desserts prior to everyone's arrival.  I actually bumped into the (6 foot 5) sommelier on my way to DEQ for a drink while I wait, he wanted to know which reservation I have made with them.  He assured me that all my requests were arranged, and he couldn't wait to see me.  

Claire arrived first and met me at DEQ, we had a drink and talked until Lucia, her boyfriend, Ruby, and...another girl who's name escape me arrived.
It was either a Saturday or Friday night, the restaurant wasn't buzzing at all, but the ambiance was as romantic as a Toronto restaurant could ever hope for.  
There was minimal décor, but everything seemed just so freaking luxurious.  I did have trouble with the lightening, as it was too dim and made it hard to see the other girls at the restaurant.  Com'on, that's a valid complaint!

All the ladies took their seats, and was very happy to find a rose designated for each of them.  They thought it was provided by the Ritz as complimentary welcome gifts, until I finally told them that I actually had to pay for it, but I did that at the end of the dinner, therefore this makes me classy as phuck.  
I ordered the foie gras, because it was on the menu.  I was less than impressed by it, but I guess it was still tolerable for me to have Claire taste it.  I sometimes feel like the goose liver evangelist, spreading the fatty goodness to all of my foie gras virgins.  Like, a high-end Ronald McDonald or something.
I got a bottle of Argentinean red at approximately $170 a bottle and shared it with Lucia's boyfriend.  Both he, and the sommelier were impressed by my unusual choice, and complimented me on my knowledge and understanding of wine.
The depth of my knowledge and understanding with wine are as follows:  If it's from Argentina or Portugal, it's probably good.  So yes, I took the compliment like a thief.  WOOT!

Was it someone's birthday?  Hell, I can't remember.  I do remember that there was exchanging of gifts.  I got Claire this ugly wallet from Michael Kors, because usually when I give someone something from Michael Kors, it means that our relationship wasn't going very stellar, and that the end was nearing.  
Lucia told me that Ruby was actually from my hometown in China, and immediately my attention shifted to her.  Unfortunately, there was a considerable age gap between myself and Ruby, and the conversation went somewhat awkwardly.  I was still, however pleased to meet someone from Qingdao.  This was the week prior to me leaving for China for a very long trip, so I found it quite difficult to shut up about things relating to China.  But that really was nowhere near as insufferable compared to after coming back, but that's another story.

The food was on par, but nobody was really wildly impressed by it.  I expect the Ritz name to keep a rigorous standard among all of their franchises, and comparing to the Ritz in Shanghai (fair or unfair comparison regardless), it fell short.  The service (for a Toronto restaurant) however was phenomenal.  
The desserts I ordered which was made at their kitchen was amazing, like, I was amazed.  That`s all I can remember.  Because details rarely go hand in hand with amazing.  

Everyone at this dinner was from Mainland China, a first for me when hosting dinners in Toronto.  I felt comfortable, despite there being a few unspoken uncomfortable circumstances.  But it was all social, and had nothing to do with TOCA.  I don't understand the name, but I couldn't be bothered by it.
I successfully given a rose to a bunch of women for the first time, and that was an monumental achievement on my part for anyone who knows anything about my utterly disastrous, drama riddled love life.  It's cheating, but I don't care.

We had such a stellar time, we all ended up retiring to DEQ downstairs for continued inebriation.  The dinner only came out to about 500 dollars for the six of us, which was DAMN reasonable!

I always say 'it's not the Ritz', but this time it actually is, so my expectation were pretty damn high.  Not disappointed I must say.
I'm really proud of myself about the roses.."}
{"text":"A place to be for a special occasion or just a Thursday night dinner. The prices are fair consider its in the Ritz. We went there after a show in the downtown. Here is the review for the place:
The service - Great, they treat you like royalties
The atmosphere - Great!
They also showed us the cheese cave where you are free to sample some and pack some home at a reasonable price.
The food - mehhh, with the prices and the ingredients they put in their dishes, I really hoped they would have came up with something more exciting. Don't get me wrong the food is great, i am just not getting the wow factor from it."}
{"text":"The highly acclaimed Sunday brunch buffet! 

Was it worth it? All in all, I'd say no, but perhaps I've been to so many buffets? 

The most impressive station was the cold bar where all the lobster tails, shrimps, oysters, mussels, and crab claws resided. All the seafood was fresh and plentiful. Oysters were small but very tasty. My favourite was the lobster tail which was perfectly cooked, sweet & tender and not chewy. There's also a selection of really tasty grilled antipasto veggies, but you don't want to fill up too much on that! Other unexciting mentionables at the same bar.. sushi (small selection, nothing special).. Salad... Some small plates of shrimp. We did enjoy the roast need carving station though! 

The hot area didn't have a huge selection. My favourite dish was a Mediterranean style pizza - but I didn't come to the $79 buffet for pizza! There was chicken, pasta, soup, and some breakfast items. Nothing to write home about here either. Actually the Benedict was pretty good. 

The buffet also comes with bottomless mimosas, bellinis and Caesars - none of these Cocktails were very very basic. 

And to end things on a high note...the dessert is served in their wine cellar - very cool! I pretty much had one of everything and it was spectacular!!! There were not hot or made to order desserts but no complaints on my end! I loved every single bite. 

Highlights again were the seafood and the dessert but all in all for that price I couldn't say it was all worth it... I was expecting more! 

For a Sunday buffet brunch at a more reasonable cost, I really enjoyed Hot House."}
{"text":"Lovely environment | Great service | Bite size appetizers | Small entrees | 3oz wines | Ritz Carlton

Came here for dinner with a girlfriend on a weeknight, no reservations needed. Sat down at a lovely two top with an artistic plate ahead. 

The menu was small but has everything you would need for Italian food. Appetizers, cheese, charcuterie, pasta, main dishes and side dishes. Though the prices are not cheap, they are known for their food. 

But when the entrees came, we were both like ... That's it? It's the portion of a child. The pasta was like 3 bites. When their pasta has a appetizer option as well, I can only imagine how small that could be. Like a bite sized entree.

Overall ... I wouldn't come back but it was okay."}
{"text":"You won't usually find me in these foo foo places.  I do prefer a good hole in the wall.  However I was here for a birthday and i have to admit the service and taste of food was great.  I had the ravioli, lamb shank, deconstructed taramisu.  The lamb shank was tasty and tender.  I was a little skeptical when I saw the taramisu since it was in separate pieces and did not look like a traditional taramisu.  The taste was on point and was definitely interesting.  Honestly speaking, I think it was pricey for what it was but it was an experience."}
{"text":"I had the Cheese Risotto with Black Truffle.
I Was pretty excited for this dish because it came with three things I really like: risotto, cheese and black truffle. But it ended up disappointing. The risotto was very tough like it was undercooked (instead of aldente). The cheese was kinda salty and overpowered the truffle taste.

The service was disappointing too. Being a high-end restaurant, I expected service to be top notch. But then I guess this is one of those high-end restaurant where you may be pre-judged if you're getting a good service or not.

I called the server to say that the risotto was too tough than usual. And initially, the server didn't even believe me and made it seem like I didn't know what a risotto is and how it should be. I had to tell him I've eaten a lot of risotto (even on authentic Italian restaurants) so it's not new to me and this was the toughest one I'd had. It's only then he'd take my dish and asked if I wanted it re-made or changed."}
{"text":"Great brunch place! Great quality food but definitely lacks variety. The service was also amazing but that's expected with the price. I suggest Toca for special occasions but I think Toronto offers better for the price."}
{"text":"Went there for a Sunday brunch with friends...it was a terrible experience as we have reserved a table at 2:30pm, we were there at 2:15pm...however, all the people were being served and we waited at the reception for half an hour to get seated...no one come to our table for another half an hour and when he came to our table, he told us last call will be at 4:10pm which we thought it should be 4:30pm...he keeps serving the others and never come to ours...we then ask the manager for assistance, the manager was so rude and ignore our comments...servers run around to clean up the restaurant while there were still lots of customers in there ...Can't believe this is Ritz Carlton services...for sure I won't be back..."}
{"text":"I came here for brunch with my gf for our anniversary and this place did not disappoint!   I was told by friends that it was seafood heaven and they were not wrong.  Lobsters,  oysters,  crab claws, seared tuna oh my!  My favourite was the lobster and crab claws as the were very easy to eat and already cracked with the meat hanging out!  I'm not the biggest fan of oysters,  but I couldn't help myself from consuming 20 of them as they were fresh and creamy!

The cooked food was were this place lacked a bit and the reason I am not giving them 5 stars.  The beef wellington was dry and the cook left about half of it hanging off my plate.  The grilled salmon was also a bit dry and most of the vegetables seemed to have been sitting out there on the buffet table for a while.

Service was great for the most part.  Our server constantly filled our all you can drink mamosas with just the right amount of orange juice.  They also folded our napkins each time we left the table.  They never once rushed us and were checking up on us every now and then to make sure we were doing well and not passed out from a food coma.

The dessert room was really nice and make sure to save some room for that, as they have many delicious treats such as macaroons, chocolate pastries, cookies and a chocolate fountain.  Overall a nice place to take that special someone for an epic occasion as this place is a bit on they pricey side.  I'll be making a return trip again for those lobsters though!"}
{"text":"Outstanding brunch. Thoroughly enjoyed the salmon, and the caprese. They had an excellent selection of tea, and the service was timely and pleasant."}
{"text":"We came here for a birthday dinner with a friend on a Friday night.  While I think it would be more lively on a Thursday night, we definitely had a wonderful time with attentive and knowledgeable service.  

Our meals were lovely - we had the lobster salad, ribeye, filet mignon and a pasta, and everything was quite wonderful...and I have to say the ribeye was spectacular. 

This is definitely the place to take someone for a special occasion but expect the price point to match that."}
{"text":"Among my favourite restaurants ever.

The first time I came here was for dinner. All the pastas were really good, the cheese cave was awe-inspiring and the service was excellent. Portions were a tad small considering the price point, and frankly would have left TOCA a 4 star rating because of that, had I not returned for the amazing Sunday brunch!

The brunch, at $80-100 pp (gratuities included for larger parties) seems really pricey--and I usually would not go out for such expensive \"brunches\"--but this one was definitely worth it. We made reservations two weeks in advance but because of our 8+ group size could only manage to squeeze in at the 2:30 pm seating. A bit late to my liking but we were determined to try this brunch. When we arrived, there was a huge line...thanks to our reservations we were able to get seated right away!

Winning points for the brunch:
- Constant refills of Bloody Caesars, Mimosas, Peach Bellinis as you dine. If you like your alcohol, you could easily drink your $80 worth to be honest!
-  Excellent, excellent service as always. This is part of the experience and is partly what you're paying for. The waitstaff are friendly, very accommodating and know how to make your dining experience as smooth as possible.
- Quality and variety of food. The cold seafood was so delicious--crab claws and lobster tails were sweet and fresh, shrimp and mussels were meaty, raw oysters were yum. They had smoked salmon, a charcuterie board, mixed salads. The tuna tartare and duck confit were especially delectable. They had a variety of hot entrees (grilled vegetables, chicken, fish, soup) and had a decent breakfast foods area (pancakes, sausage, egg frittatas, eggs benedict, assorted pastries)
- Bread and cheese. The cheese comes specially from their cheese cave, and out of all the things to eat, I could literally just sit there and eat their bread with honey & cheese all day.
- Carved roast beef. The most tender cut of beef I have ever eaten. Melts in your mouth.
-Don't even get me started on the dessert. Chocolate and fruit everywhere, a nice creme brulee and best chia seed pudding I've ever had. Cakes and tarts all on point.

Overall, giving TOCA 5 stars because every time i leave that place it's with a huge smile on my face and warm fuzzies in my stomach. Just be prepared for the bill. And beware of eating so much you can barely make it down the stairs afterward. Yes, that's a thing."}
{"text":"Visited the Ritz Carlton Hotel for our family's annual Christmas Day Brunch (2016). For the last few years we have enjoyed the buffet at Toca so hoped to do the same this year. They offered a Christmas family special held on their ballroom instead of in Toca. Turned out to be a bad choice for us. The service was extremely slow -- the waitress as trying but clearly overwhelmed and delayed by having to \"go downstairs\" for everything we asked for. The buffet was not replenished often so everytime they refilled the raw bar it was swarmed and left in disarray. People were picking food off the resupply tray as the staff was trying to refill the raw bar. Definitely did not meet our expectations of the Ritz Carlton Hotel and Toca. If we decide to go back, we will definitely refuse to be seated upstairs again. But there are plenty of better choices around the city for the money that they are charging for this sub-par experience."}
{"text":"Very nice atmosphere.  Food and cost is what you would expect. Swordfish was perfect. Yes they do charge for tap water. However it is all you can drink."}
{"text":"Have eaten here several times for the delicious brunch on Sunday's and for dinners and lunches ! My favourite simple classic is the truffle fries. Great selection for food and drinks, only sometimes I found the food to be too salty"}
{"text":"Came here for the sunday brunch for a bridal shower and the service was actually A-MAZING.  Granted it was probably because they automatically charge an 18% tip (I think this is only because we were a bigg party).  Plates were cleared fast, all you can drink Bellini and mimosas were constantly refilled, and they even gave complimentary champagne for the bride to be.

Okay, so I have to admit that the food was not THAT great.  You are paying $100 and really its only worth it if you love lobster tails, shrimp cocktail, oysters and plan to legit drink all you can drink.  They had a cute self serve caesars section and the cups were already rimmed.  The lobster tail and oysters kept running out and you had to wait for it to be refilled.  The hot food was subpar and the selection was small (the chicken and the fish were both dry).  The omelette station was fantastic though, LOVED it!  Most of the pastries were disappointing and didn't even taste that fresh.  The only good one I had was a peach danish.  My fav thing was the french toast.  It was slightly harder than i would like but I just drenched it in maple syrup n covered it in berries, so really I didn't taste much of the toast lol.  Lastly, the dessert area was okayyy.  I had high hopes for this but nothing was really that spectacular, the best thing was the cheesecake which reminded me of cheesecake factory cheesecake. Overall, just not worth the price for me."}
{"text":"I decided to give this Sunday brunch buffet at $85/person a try on my last day in Toronto.  

Service is friendly & considerate. Hostess saw me with my luggage & proactively offered to hold my luggage for me (before I got a chance to ask if they did or could give me a table with enough room to sit my luggage). This showed ne to better enjoy my meal rather than worry about leaving my luggage unattended.

Wait staff (Lynn) was a continuation of friendliness & excellent attentive service, keeping my glasses full of water,  mimosas & bellini.

The cold food section ranged from cute little glasss of salads, fresh vegetable salads,  cold marinated/grilled vegetables, spring mix/romaine greens,  seafood selection of fresh half shell oysters,  cold mussels,  jumbo shrimp and lobster tails. There was a selection of smoked salmon & haddock & other meats in their charcuterie area.  To end the table was a colorful selection of sushi rolls with purple rice, yellow or orange soy wrappers with a vegetarian selection & California,  salmon & tuna respectively. 

There was a section dedicated to cheese next to their famed cheese cave with a selection of 3 cheeses, accompaniments of olives,  grapes,  blueberries, blackberries,  strawberries,  watermelon,  honeydew and cantaloupe,  flatbread-ish pizza (with a deliciously crispy crusty crunchy crust).

There was a bread & baked goods section that I had no interest in filling my tummy with, but it's there for those whom want it. 

The hot food section was outstanding. There was lobster risotto, a quiche like egg dish,  crispy Canadian bacon (meaty unlike american \"streaky\"  bacon), and chocolate chip waffles with pure Canadian maple syrup.  There was Eggs Benedict, roasted potatoes,  green beans, chicken mushroom dumplings,  salmon and Cornish hen.

The dessert section was also a delight to the senses: paris bundt (like mini chestnut choux creme formed into a circle), apricot tarte, titamisu, chocolate bark, madelines, their signature chocolate cake,   brandied (drunken) pear, red velvet cupcakes,  mini pecan pies, mango panna cotta, creme brulee, a fondue station & so much more!

Highlights: (things I'd probably eat endlessly if I had a bottomless pit)

I was wowed by the Eggs Benedict. I'm not usually a fan of eggs Benedict but wow their's was so good!!!! 

The Cornish hen was succulent & sweet. Its only garnish was (what looked like) roasted/sundried cherry tomatoes so I'm assuming some amazing seasoning! I wish Icould taste such deliciousness every day. 

The salmon was just right,  not too dry,  flaky & most in the middle &  well grilled on the outside.

The Thai beef salad was perfectly dressed & the beef medium.  

There was a dill/herb soft loaf which went oh so well with the cheeses they had available. 

The sushi selection was okay. Some of the tobiko was tooo hard & I had to just politely (sneakily) remove it from my mouth.

Their Flatbread pizza was mushroom,  micro greens, sharp cheese (parmesano?), and melted cheese with a heavenly crunchy crust *drool*

Their watermelon feta salad yum!

Oysters tasted so fresh!!!! My one sadness was no horseradish but their various dressings made up for it. Shrimp were so plumb & juicy.  Lobsters were a bit of a struggle to get them out of their shell as it pulled out stringy like.  I felt like this should've been finger food but still so good.  Guess I'm just used hot steamed lobster tail where the meat pulls out cleanly? No matter I enjoyed all this quite well. 

Desserts...that pecan pie!! Omg, I wish I could eat them every day.  Tiramisu fresh & light although I didn't spot or taste any lady fingers. Love chocolate strawberries (fondue). Creme brulee was okay. Chocolate bark was scrumptious. That red velvet cupcake... perfect portion of deliciousness. 

Thank you for the delicious meal & fantastic courteous service."}
{"text":"Went here on a Tuesday night post-Fashion week runway show (WAY too many hipster wannabes at Fashion Week. Bleh.) and we wanted a lovely luxe meal. Toca underwhelmed a bit but overall, the experience was pleasurable and I'd return. 

It was very quiet and only 3 other tables were full yet service was VERY slow. I suppose they do it purposefully so that you don't feel rushed and can linger as long as you like but there were huge gaps in between things like asking for the bill and actually paying the bill where we sat there looking around for our waiter, and finally had to ask the maitre d. 

We didn't have too much time to really go all out with the meal. I have a one year old. Those days of long drawn out dinners are not nearly as common anymore. We, of course, had to order the cheese plate where the waiter questioned us about what kind of cheese we enjoy, what we like and dislike. We enjoy blues and triple cremes and he came back with a good yet standard selection. I really thought the cheese selection would be a little more adventurous but I found I had actually tried every single cheese currently offered on the menu (I'm a confessed cheese lover). The cheese plate came with good accompaniments, particularly the tiny olives. They also served a bread basket which was good but not exceptional. I'd like some more unique breads in there, not just a standard white bun and sourdough. Very fresh and moist considering it was almost 9 pm. 

We each ordered a cocktail (The Valentino) which was STRONG. Most of their cocktails involved fresh fruit/fresh fruit juice which is nice. They were tasty but maybe I'm a lightweight because if I have a drink, I like it to not burn as it goes down. That's just me though. Others prefer the opposite!

We both ordered the papardelle with pancetta, mushrooms and green beans (my friend's was the vegetarian pancetta-less version) and the portions were HUGE. I was shocked, really, since most portions at high-end restaurants are small. This was easily two portions in one plate. The pasta was handmade and slightly undercooked but it was good. Very rich. Neither of us even came close to finishing our plates. 

Having to get home to a toddler meant no dessert. The dessert menu looked good though but even though the meal was not perfect, it was still very tasty and the service, though slow at times, was very good. It was not quite up to par for what I'd think would be the standard for the Ritz but certainly it's a place I'd return to. The prices are also quite reasonable, surprisingly so. It's a great place for a date/special night or just a nice dinner with a friend. Everyone was friendly and makes you feel like they really want to please you. Definitely recommend."}
{"text":"We were lured in by the promise of a plentiful buffet and bottomless drinks.  Unfortunately, the brunch really missed the mark, especially for the price tag.  The bubbles, formerly Veuve Cliquot, has been replaced by a nameless prosecco and getting top ups was difficult at best.  Perhaps the restaurant was understaffed, but I should not have to chase down the waiter on multiple occasions to be topped up.  The food selection was mediocre at best, as a vegetarian, I know I'm challenging to serve but there were very few food items I could eat.  There are many, many other brunch buffets in Toronto with better spreads, better service and a more affordable price tag."}
{"text":"There are a lot of things I love about this restaurant ... and one thing I hated. Overall, 5 stars without a doubt. 

Loved:
- The ambiance was absolutely splendid. Try to get a table in the back left with the comfy half moon booths rather than the tables. 
- The service was as expected: spectacular. From the host to the waiter to the kitchen that brought out our plates.
- Most of the food was excellent. I really loved the salmon tartare (FYI it's spicy) and the cavatelli pasta is hands down the pasta I've ever eaten. The sauce is perfect, the cavatelli cooked perfectly.

I didn't love...
- The burrata appetizer. I was expecting a burst of creamy deliciousness and instead it was bland, hard, and more like a mozzarella that was in dire need of salt. The smoky flavor was over powering. The waiter was extremely nice about it, explained that the burrata here is 'different' and took it back.

An overall wonderful dinner with the expected price tag to go along with it."}
{"text":"I've visited Toca three times now.

Each time the service has been phenomenal. The ambience is great.

My first experience was my best experience, I had their burger at lunch which was amazing. It was a special burger that seemed to be on their seasonal lunch menu.

The second time I came for lunch again, I ordered the same burger but they had taken that burger off the menu. So instead , I ordered their classic burger which turned out to be mediocre. 

The third time I came was for dinner. I had a five course truffle inspired meal with wine pairing. It was specially created by chef Oliver Glowig.

It was a phenomenal experience. However, I'll admit that my palette isn't ready for such high end food yet. I don't think I appreciated the quality of the wine nor the quality of the truffles. I then took a picture with the chef. The scallops and the sweet bread were out of this world !"}
{"text":"Doctor Dopey took me to Toca by Tom Brodi at the Ritz-Carlton for my birthday.  The menu looked so intriguing - how could I resist?

We arrive around 5:45PM to a relatively empty restaurant - it was still early and they had just opened at 5:30PM.  We were seated promptly, and offered water (still or sparkling).  Then our drink orders were promptly taken.  I ordered the Chili-Lychee Collins and Doctor D ordered a Grey Goose & Tonic.  The lychee cocktail was quite refreshing and rather interesting as it contained maple-glazed chili peppers, lime leaves, and a pomegranate-poached lotus root.  It was refreshing and not too sweet.

The bread basket was brought with some butter.  A nice, crusty bread - and it was warm too!  

For starters I ordered Foie Gras - if there is foie gras on the menu I almost always order it.  Doctor D ordered the Fancy Fish and Chips made with Lobster instead of fish.  I was thoroughly disappointed with my foie gras.  What a waste of a duck's life to have it so ill-prepared.  I would expect a dining establishment such as Toca to at least know how to cook a foie gras properly.  The outside was not seared right, and the inside, while still soft and creamy was not a melt-in-your-mouth.  It was served with poached rhubarb and housemade cotton candy.  I don't discourage culinary creativity - but this combination just seemed crazy weird to me!  This was a \"trying too hard\" dish.  The Fancy Fish & Chips were amazing - we substituted the frites with the Kennebec Frites (w/ Thunder Oak Gouda) . This was definitely a redemption for my ill-prepared appetizer.  The lobster just melted in your mouth with a light batter and served with a tartar sauce.  The fries were delicious and sprinkled with gouda cheese flakes.  

For mains I ordered the Lamb Saddle.  The moment it arrived at my table I could smell the gamey-ness of the lamb.  However, when I actually ate it, it was surprisingly not gamey - though Doctor D begged to differ.  It was not what I would call tender, though it was not overcooked.  The gnocchi was a little overcooked (e.g. mushier than al dente), but I loved the spiced carrots.  

However, once again, Doctor D prevails in menu selection as his Pan-Seared East Coast Scallops were absolutely amazing!  I was blown away just by the sheer size of the scallops.  I had never seen such big ones in my life (that's what she said!).  They were seared perfectly, and served with a fava bean purée and sour cream w/ abitibi caviar.  I felt the scallops were best consumed on their own, net of the accompaniments to truly taste the flavour stemming from the natural juices of the scallops.

Verdict:

The crowd is definitely older.  Mostly form the \"old boys club\" of financial district workers.  Definitely not a hip nor trendy place to go.  The service was great - they had ample wait staff, and everyone was polite.  The bill came to $196 w/ tax and tip so it ain't cheap.  For that price point I expected more.  The foie gras was a real disappointment for me.  I would probably come back to Toca again sometime in the future for a special occasion but it definitely fell short of my expectations."}
{"text":"What a treat!  We had the best experience at Toca!

It is an expensive treat but delicately fuzed together delicious flavors from executive chef Tom Brodi.  Well worth it, it's fine dining people, so expect the price!

We started with the FANCY FISH AND CHIPS... Ummm breaded lobster!??!  With a side of breaded avocado.  It came with a sick tartar sauce... Yum. I don't usually like deep fried stuff but I ate this lightly battered delicious fish dish.

I had the MAPLE SEA BASS which was awesome, it melted in your mouth like butter.  I have never had fish like this, it was cooked to perfection!

After getting a special visit from Chef Tom Brodi, it was a treat when he escorted us to the cheese cave, and popped open a bogle of ice wine!  He selected a perfect blend of cheeses for us to sample! It was quite treat!  We got a sneak peak of the chef table too, it was quite a special occasion!  

We had some delicious champagne and great service.  Reading the last posting, I think we had Mary too and she was perfect - she recommended and listened.  They had a pro for everything a wine Connoisseur, a cheese pro (affineur).  

Great experience, one of the best I've had!  Looking for a fancy treat, go to the ritz!"}
{"text":"We came here for my birthday dinner and I have say the service was truly exceptional - service that one would expect at a restaurant located in the Ritz Carlton. 

The food was also very good. I had the fresh seafood pasta and the cod. The pasta is homemade. It is also my understanding that tomatoes are flown in from Italy for the pasta sauce.  TOCA puts a huge emphasis on fresh ingredients and it makes all the difference. Everything I have tried at TOCA was nothing short of delicious. You cannot go wrong at TOCA.

I also heard TOCA had a cheese cave (which I did not visit this time around but will definitely need to visit next time)."}
{"text":"I was taken here for a romantic date. It was just that  Lovely ambiance, great service and delicious food. The tables are nicely spaced out for privacy which obviously adds to the romantic atmosphere. It was a crazy cold night , so it was nice for a change of scenery to move down to the lobby bar(there's 2) for a port after dinner"}
{"text":"Came here for my partners birthday today for the brunch buffet, overall my expectations were more than met! We were both so impressed with the service, quality of food, and variety! It is perfect for people who love seafood, the lobster and crab legs were great, and the staff is more than willing to accommodate people and make you fresh food at your request! This place is very expensive, but an absolutely amazing experience, and the perfect place to treat yourself!"}
{"text":"The sunday bunch is defiantly an experience to try at least once. The food quality was superb in certain stations.  Every thing was very fresh and nicely plated. Really enjoyed the seafood selection. The hot plate station was nothing special. I had high expectations for the egg Benny...the English muffin was so dried that I couldn't cut it and the sauce was so blah. 
Was it worth $85.00 per person? Maybe if you eat your worth in seafood which I did...Would I do it again? Probably not....unless I want to get my fill of seafood."}
{"text":"My wife and I were underwhelmed. The decor was fine and valet parking is nice (only $15); however the food was mediocre at best. The filet mignon was fine, but certainly not great. Generally I don't bother leaving poor reviews, I just don't return - however anyone checking out reviews on Toca needs to know the school cafeteria nature of some of the offerings. For example, the Pure Di Patate ($9 olive oil mashed potatoes) could have been Sherrif instant potatoes, The diced oven potatoes were undercooked hash browns. The fine dining atmosphere can't compensate for such bland poorly prepared fare. Stay clear. Just awful."}
{"text":"Came here for a birthday surprise and ended up having one of the best meals toronto can offer! Service began and ended with Felix - who recommended great wine choices and the entree of short ribs. Delicious !!!! My bf ordered the filet mignon and still says it's the best he's had in city ( we've been to barbarians, Jacob's, and Hye's) the ambience is delightful - it is the Ritz so ... Prices aren't outrageous but expect to pay a nice penny. Mains don't come with any sides. Great meal - will visit again.... When I plan to splurge!!"}
{"text":"I've been here multiple times for brunch and dinner. I was here for a dinner party in the private room with a special dinner menu and the experience made me want to come back for more. Pasta is always an excellent here. The weekend brunch is outstanding, probably one of the best brunch places in toronto consistent with a 5 Star hotel restaurant. The weekend brunch buffet includes cold seafood, oysters, chilled prawns and half small lobsters, sushi and sashimi, charcuterie, antipasto, salads, fresh bakery, carvery items usually prime rib and another meat, flatbreads, hot breakfast items and hot entrees. I've been here for two Christmas brunches and their holiday brunch is amazing. There are specialty cocktails, mimosas, decadent hot chocolate, all made to order, tuna crudo, few types of smoked fish trout and salmon, chilled seafood table, charcuterie and cheese, carvery prime rib and turkey, hot breakfast items eggs benedict, pancakes, French toast, flatbreads, chestnut gnocchi and hot items including sea bass filet. They had mushroom risotto served to you tableside. The dessert room is outstanding and had all the holiday desserts you could wish for, loved the fruitcake bites, macarons, fresh berries, ginger bruschetta, eggnog ice cream, Yule log. In the end you can't eat it all but you wish you could. Service is always excellent and the restaurant is beautiful and elegant. Holiday brunch is pricey at $109 pp for adults but well worth the price if you like quality and ambiance. Very kid friendly. This is my favorite brunch buffet in the city !!"}
{"text":"I came here on a date for a dinner tasting experience and we had an amazing time. The food was absolutely delicious: the foie gras was to die for, it is a must try! The restaurant has a beautiful ambiance, with little touches such as cute painted plates. And of course, the service was impeccable!"}
{"text":"I came here last weekend for the Sunday Buffet brunch. Service was great, they refill your unlimited Bellini/ mimosa constantly (+1 bonus point)

The antipasto and seafood bar was fresh, if you love oysters, you'll be in heaven. The cheese bar was lacking.The pastries looked store bought/dry. The pancakes were delicious, very fluffy.
Cold appetizers - unique and tasty, presentation was nice but i wish there was more variety. The hot entrees ...not my favourite section - chicken was dry and tasteless, the fish - same thing. The dessert section: the creme brulee and pana cotta was delicious!! Macaroons didn't taste fresh.

Overall, i don't think i would go back for a while. The food was simple, there were a few unique pieces but i couldn't get over the price. After tips and tax, you're looking at over $100 per person. Maybe if you stuff yourself with 100 oysters, it's worth it."}
{"text":"We came here for brunch, and we fell in love with Toca.

From the moment we were sat, to the moment the chef asked what I wanted in my risotto, down to the moment I bit into my first lobster tail...we fell in love.

The service was amazing, the food was great and there was never an empty plate or tray of food on the floor. This is by far the top of my list for brunch.

I cannot rave enough about this place. Atmosphere was perfect, and there was just such a great vibe throughout the restaurant.

Our waiter was so nice and even brought out extra special dessert for us. 
We will be back for sure!"}
{"text":"Great service, menu and pricing.  Another one of those you get what you pay for places.  The setting is beautiful, and staff is very attentive and no matter wearing jeans or couture you experience an amazing meal."}
{"text":"Nothing short of a memorable experience! The food was of the highest quality and the presentation was immaculate. The service was personable, professional and even the chef made an appearance to ensure we were enjoying the meal. Did a tour of the cheese room at the end and enjoyed the aroma and additional knowledge. I strongly recommend the wine pairings to accompany the chef's recommendation menu. If you are looking to celebrate a special event or splurge on delicious food, nice ambiance and great service, this is your place!"}
{"text":"Toca, you won my heart!
Walking up to the 2nd floor of the Ritz, you find Toca with a Euro decor to greet you.  Not plush but neat.  Music is hip. Great place to bring a special someone for sure.
On Sundays, Toca just introduced a Tapas menu  $45 will include unlimited cold and hot tapas. You also receive a main course and dessert. What a deal.  Now let's see how it tastes.
Each course is served on a sheet of slate stone.
Cold tapas: Tuna tartar - fresh firm tuna cubes that go so well on top of a bed avocados and spices puree.  Best tuna sashimi eaten in Toronto!  I had a 2nd order.
Grilled Foccacia - with figs and italian meats. Savoury, so tasty.
Crab salad - Less sophisticated than the other 2 - finely chopped and mixed with Mayo.  Not too rich, not too salty (as typically so when done this way).  Spread on the crustinis or the fresh-baked bagettes.
Hot Tapas- Frie Gras Croquettes - You get one (size of a thumb). Good but nothing special.
Stew Pearl Potatoes, Chrizo, Peas and Eggs - nice combo of ingredients.  Very yummy and best of the 3.
Vichyssoise - Rich and cremy. probably good  but not a fan.
Main Course - Seared Branzino - a fresh water fish with delicate texture. Capers, lemon and thyme flavour accentuates the fish.  Brussel sproat leaves complete the taste.  Excellent Fish!
Dessert - Pear Frangipani - So full already. Poached pear on filo pastry. 3 small Marscapone cheese spheres can be added or not.
Overall, service is top notch - Classy, knowledgeable, not pushy. Toca, you won my heart and my 1st 5 star rating ever!"}
{"text":"Went here last Saturday for a nice dinner with a couple, and I'm sad to say we came away rather underwhelmed.  Toca had come critically acclaimed by foodie friend and Yelper alike, but unfortunately this experience did not deliver.  

Service was rather atrocious, with long gaps intervals between our drinks, incorrect orders ending up on our table, food being taken away prematurely (on more than one occasion).  Sadly the food itself was only so-so and couldn't save the day.

We had the lamb sliders, octopus salad, Brie, braised lamb shank, venison... And there was not a single dish that made me \"ooh\" or \"ahh\" in appreciation.  Given the steep price tag, I expected more.  You'll get a much better experience at the same price point at Canoe or Splendido."}
{"text":"We have been to the Toca brunch buffet several times over the past few years. It is a fun and decadent way to spend your Sunday. I especially love the desert cave! It is always really busy for any sort of special occasion (New Years day, Mother's Day etc) and I have found that the quality goes down. It's good for groups."}
{"text":"Decent service 3/5
Atmosphere 4.5/5 
Food quality 4/5
Food portion 1/5 

If you would like to go on a diet, definitely come here. The portions are so tiny, I was hungry after eating the entire bread/crackers basket and my entree sized meal (they have appetizer size meals). I weigh less than 100lb so it's not like I'm a huge eater. The portions are just so small, it's like going to sample foods. Speaking of sampling, they sell wines starting at 3oz glasses. 

Food tasted very good, but there are a LOT of other restaurants that have better or same quality food at way lower price points. My duck pasta tasted like good beef dumplings from China town for $5. 

Atmosphere is nice. 

Service was okay. I think there were several tables of business men who were regulars here, that our waitress was more focused on serving. Therefore our food was brought out by the table cleaners, not our waitress herself. He handed me ground pepper shakers that had no ground pepper in it. I tried to flag down our waitress and she was busy serving the regulars, by the time she came around my pasta was cold and I was pepper-less. 

Overall, it was good but I'm not interested in coming back."}
{"text":"Great food, great service, great atmosphere! Our server recommended us to try the Sunday night tapas and surely, it was an amazing recommendation.

I'll point out some of my favourite dishes from my meal - but I pretty much enjoyed every dish they had on the tapas menu :P
Loved: 
the vichyssoise with truffle oil, seared branzino, corn soup with chili oil (SO GOOD! The spiciness adds a unique flavour too it!)

The cheese platter display was really pretty and was also very tasty. It was crispy on the outside while the cheese is sizzling hot in the inside. They also had a few sauces to dip it in.
The dessert had 3 parts to it: chocolate mousse (shot), strawberry shortcake and mango mousse (shot).
The chocolate mousse was a little too sweet for me but the mango mousse was perfect!"}
{"text":"The lunch menu has a short selection but good plates and tasty food. I very much enjoyed the restaurant and the service"}
{"text":"I booked the private dining area for brunch for a bridal shower.  There was no extra cost for the room, we just had to spend a specific amount of money.  As long as 10 guests showed up, it would cover the cost.  I had to leave a credit card number for the reservation, but nothing was charged to it, and we were able to have separate bills at the end of the day.

Overall, I was a little disappointed.  I had been to a private event at the Ritz (in one of the ballrooms) before and was absolutely amazed at the quality of the food and the service.  Based on that, and also based on the cost of the whole thing, I kind of expected 5 star service.

Don't get me wrong, the food was amazing.  They had beef wellington at the carving station (one of my favourite dishes, that you don't see very often).  They had a \"pasta\" station.  I thought they'd cook made to order pasta, but in fact we learned that they cook one kind for the day.  On the day we went it was actually risotto, not pasta.  The truffle risotto was incredible though.  They had a decent selection of food, though it wasn't the largest brunch buffet I've seen.  Quality over quantity, however.  Everything I put into my mouth was delicious.

What really disappointed me was the service, however.  Since we had the private dining area, with 14 people, I would have thought we would have a private server, or at the very least, a server that paid attention to us!  Especially for the price we're paying.  We often had to flag down someone (usually not our server) to get re-fills on drinks, or have the plates cleared.  Speaking of drinks...do they water them down?  I had 5 drinks (asked to go heavier on the champs rather than the juice), and I didn't even have a buzz, and I'm a light weight!  The rest of my party said the same thing. 

One thing to be aware of as well, is that they stop serving food and drinks at 4pm.  We had a 2:30pm sitting.  By the time everyone arrived and we said our hellos, we only had an hour to eat.  I thought that would be enough time, but between wandering around to see everything, eating and socializing, it seemed like we were rushing.  That being said, I was completely stuffed afterwards.  If you had a small group, it's probably fine.  But if you have a large party, I'd suggest going to an earlier sitting just so you have lots of time."}
{"text":"I went to Toca for long weekend casual dinner.  I am very impressed with the service they provided.  I actually been to there a few times.  The risotto is amazing, the tomato the chef use was totally different than any restaurant in Toronto.  I also had the four courses tasting menu, but The portion is a little bit too small compare to Bosk!  I would suggest get the regular menu!  Definitely the ingredients are fresh and service is excellent.  Now it is one of the first choice if I want a romantic dinner."}
{"text":"We just paid FIVE DOLLARS per person for TAP WATER at Toca in the Toronto Ritz Carlton Hotel!  
Thank you TOCA for charging my table FIVE DOLLARS per person for tap water at your attractive--yet flavorless--restaurant.  
Our initial male waiter:  \"Would you like still or sparkling water?\"
Me:  \"Regular water will be fine.\"
Well...on the planet that I inhabit, \"regular water will be just fine\" has always meant tap water.  Based on other reviews of TOCA, I'm not their first victim of this trick.  That's a big F-You from Toca as far as I'm concerned.  
The food:
Fried Halibut appetizer: no flavor whatsoever...a recurring trend for the evening.
Foie Gras appetizer...mediocre at best.  The three drops of accompanying reduction would be more suited for a microscope slide rather than something to actually taste. 
The cod was fine, but also as bland as can be.  I'm not  a big salt person but clearly the kitchen has banned salt.  The Lobster emulsion that was added to the dish did nothing to perk it up...sad. 
The only highlight of the evening was our waitress who was also the in-house artist. She painted the chargers and they were exeptional.  Had the dinner not have been SO disappointing we would have ordered a set...the plates were that good. 
Obviously, our original con-artist waiter made a HUGE mistake by \"misinterpreting\" my water order (this has never happened to me in over 35 countries), but the food at TOCA was also a huge disappointment."}
{"text":"I took my wife for a Valentine's dinner which the restaurant had a Pre-Fix menu. I hear they do it every year. First of all the food at Toca is always incredible. The Pre-Fix menu was incredible as well. The best part was the dessert table with the Photo Booth to capture the moment. If you are looking for a great place this Valentine's Day you can go wrong with TOCA!"}
{"text":"I've been here on two occasions and in between they had changed the menus. First time around my experience was excellent. They had at the time a butternut squash ravioli which was amazing. That is now gone and replaced with a standard cheese ravioli. Still tasty because of the cheese and sauce used, but not quite as good. The serving size was terribly unsatisfying, which is unreasonable given the price charged.  But that's what happens when you're located in a Ritz. Decor and ambience are nice, so I guess that's what you pay for.  Service is courteous and professional, but the second time around it was strangely slow.

Bottom line is that the food is pretty good, just doesn't do the price justice. Doesn't matter that it's in the Ritz. All in all, personally, I'd rather head up to King Street and find something there."}
{"text":"What a difference a visit makes! 
I have been to TOCA once before and had some concerns. However as I have said before, it's not whether a restaurant will ever have a bad day, (because sometimes that kind of day is just out of their control), but rather how they address those concerns. 

In TOCA's case, the management heard and responded to my concerns and addressed them head on. My second visit was superb and there are many reasons for that. However here is what you need to know to have a wonderful experience at TOCA. 

If you haven't been there, and you are in the area, walk in and ask to have a look at the seating options. There is an area with lots of daylight which is basically on the outside the restaurant. Inside, while there is less daylight, the seating options are much greater. The lighting is softer, there are tables as well as round benches and there is a private room for power lunches. The benches ate great for intimate dining. 

Although I wish that's restaurants published a seating chart so you get a feel for the seating options, the next best thing is for you to ask to see what they options are once your there or to was reviews like this one that describe the seating. 

Yes, the meal at TOCA is not inexpensive, however the prices are fair for the location, quality of the food and the professional service. 

The Zuppa Crema (butternut squash soup) was excellent and the Branzino was tender and flavorful. Served warm with some greens. And the expresso macchiato was properly served in an espresso cup. Service by Stephanie was very pleasant and professional and we never felt rushed. I do believe my faith is once again restored in a world class brand in the Ritz Carleton and TOCA. 

If you like cheese, they have a cheese cellar and they will gladly give you a tour. The wine selection is also extensive. And they will subsidize your parking at the Ritz for 50% of the total. 

Well (re) done."}
{"text":"We were in town for a family event and decided to have a date night downtown.   After enduring endless GTA traffic (2 hours to go 22km) we got to the Ritz.   Dinner at Toca was very good, I had the pasta tasting menu that was a special that night and my wife ordered the caprese ravioli.   The best part of the tasting was the mushroom risotto, some of the best I've had.   But the star that night was the caprese ravioli, the flavors were well blended and i thought it a unique dish.   Next time I'll order that instead.   Not a big fan of the deconstructed tiramisu (i prefer the traditional one myself) and I thought the wine list was over priced (even for a Ritz Carlton)   Great service and wonderful surroundings  Not inexpensive but generally worth it."}
{"text":"The worst \"four star meal\" EVER. Bill: $500 dinner for four. My wife and I had the filet. Flavourless and dry. The potatoes were awful. Left them to rot on the table. My buddy and I ordered five beers between us. All five were forgotten by the wait staff. We had to keep reminding staff what everyone had ordered. The place was so noisy (on a Wednesday evening) that we had to shout through the entirety of the interminable two hours. The manager at one point came over and told me that \"there were a lot of assholes\" there that night. Very professional. Group parties in private rooms were so hot and loud that they kept opening their door. Of course that made it impossible for the rest of the restaurant to co-exist. We took turns at our table reminding the staff to close the door so we could hear ourselves. Terrible acoustics in that place. 
So all in all, it was the worst. Poor service, loud obnoxious business-types drunk on expense accounts, awful food and substantial bill.
Horrible beyond anything my words can convey. Save your night for a great T.O. restaurant like George on King E. Amazing service and food.

.....addendum: my wife had food poisoning today. I didn't so we suspect it was the after dinner cheese tray items. She will be calling the place tomorrow to complain. I hope they don't compensate by offering a free dinner. We would pass."}
{"text":"The Ritz and Toca management have done an excellent job at planning this fresh, innovative new Toronto restaurant. The layout is modern, but not overly trendy. The menu is distinctly Canadian, but not in your face ingredient wise. Service is very \"grassroots\" but knowledgeable and appears to truly enjoy their work. Servers have a range of knowledge, including expert knowledge regarding their unique cheese room and corresponding selection. The Sommelier had a strong background, but I would recommend a change in his clothing attire. A cheap suit doesn't convey class and management should point this out. That being said, he selected a beautiful wine for the evening and I think the wine list has potential. 

The menu consisted of a divine bone marrow infused crab meat starter. Although not as rich as  I would have thought, it was nicely presented and flavorful. The main was the lamb saddle, which was elegantly presented and full of succulent flavors. Highly recommended. A cheese selection was selected for the final course and really presented a tantalizing treat by the end of the meal. I suggest you have a guided tour through the cheese room prior to tasting.

The restaurant is not stuffy and the dress code could be considered business casual.

Good luck and enjoy Toca!"}
{"text":"I came here to celebrate my birthday. The food was delicious, the server was very kind and the venue was really nice. Highly recommend trying the scallops which were my favourite!"}
{"text":"I visited Toca for Sunday brunch and it was FABULOUS! The price is right, albeit, it may be pricey for some but you get what you pay for. There was everything from mounds of seafood to beef wellington to traditional breakfast items. I had endless mimosas and there were also bellinis. Our server was friendly and would regularly checked in with us to ensure we were satisfied. I highly recommend this restaurant."}
{"text":"Mary Mary (sorry didn't get a last name) gave us the best service and also a tip on how to brew a better cup of T.  When using delicate green tea leaves, toss in a cube or two of ice to prevent possible burn and bitterness. 

Good food, we went with several starters due to time constraints, salad, roasted roots tubers etc, shrimp.  Zowie, I just remembered, she was very generous with her time and made us feel special for our wedding anniversary celebration. Tops to her for that.  Hope to make it back someday!  Please visit this place often and keep it in business for us, thanks.  Enjoy!"}
{"text":"I was very impressed from the moment we were seated until the moment that we left, Words cannot describe the quality of the food and service that we received. The boar meatballs and salmon were moist and very flavourful, the wine that was recommended was paired perfectly with our meal. It seems like a great place to take a date since it has a quiet, romantic setting."}
{"text":"We came here for the 2:30pm Sunday brunch seating and it was the best we've ever had! Our server was awesome with making sure the table was cleared and our unlimited mimosas were pouring forever. He also accommodated any additional condiment requests and offered to make a Caesar from the DIY bar (also included) every single item we tried was tasty and top quality. The seafood, cheeses, carving station and desserts were favourites. Great ambiance and set up. It seems coffee / teas such as cappuccino and espresso are also included. For $89 pp we felt it's quite worth it. 

The only reason I gave it a 4 is because of the timing. You really only have a two hour window in either seating to enjoy and so you have to be on time for your reservation other wise it feels a bit rushed. Although there were never really any lineups, I would say extending the brunch by even 30 minutes would be nice. We found ourselves looking at our watches a lot to make sure we could \"fit in\" the experience and they start packing up and cleaning I believe around 4pm. The dessert area stays open a little longer. But you do feel that sense of \"finish up\" vibe. I'm just not fond of watching the staff clean up around you while you're finishing your meal / drinks and catching up with friends. 

We're overall happy with the experience for the quality and variety (not overwhelming) which is nice."}
{"text":"I had an amazing experience for my bridal shower last year and I wanted to bring my husband to experience the Ritz brunch for his first time. Unfortunately, our experience fell far below our expectations. Our server was extremely passive and appeared to not even want to serve us. We had to ask 3-4 times for tea/coffee and toast. Our plates were never cleared from the table until we asked other serving staff. The ambience of the restaurant is lovely, however for $79 per person, the food selection was fairly limited and the service was very disappointing. There are far better and more reasonably priced options in Toronto for a Sunday brunch."}
{"text":"This review is for the Sunday Brunch buffet, which doesn't come cheap and yet worth every penny if you are a seafood lover.

For the price you pay, it is all you can drink bellinis (or just sparkling wine if you ask them to hold the juice) - not top shelf stuff obviously, but still satisfying.

The seafood section is amazing - lobster tails (good texture, not mushy), mussles, oysters, crab claws, shrimp, along with numerous little dishes. I could just feast on this section alone!

Then there are the normal hot dishes, which I mostly ignored (since I came for the seafood) but looked decent. I had a slice of the prime rib and it was delicious and of good quality. 

On top of this, the dessert cave is phenomenal. The wait staff advised us to check it out before eating so we'll know to save our appeities, and you definitely should! All of the desserts that I have had room to eat was very tasty.

There really isn't anything to complain about for the Sunday brunch. The price isn't cheap but if you do this on a special occasion, you'll find it quite enjoyable."}
{"text":"4 stars for: Great ambiance, service, presentation, and cheese aging room. Pricey for what they served, even at a high end place. $40 for 4 scallops entree. An entree is typically 6 scallops. Wouldn't come back here again since the food wasn't stellar and worth being inside the Ritz."}
{"text":"I would say 0 star. Very bad service and management team for Ritz Carlton. Keep looking for our server during our brunch and he keep serving our next table. Food was great but service need to improve. Won't come back again."}
{"text":"Excellent place. I stop by many times and it's the place where they actually say to you \"Merry Christmas\" I usually come here and meet friends. Now they have an actual size ginger house. It looks awesome. Want to eat it with milk"}
{"text":"I came here for dinner on a Friday night. It wasn't as busy as I expected, which meant fantastic customer service and spacious seating (10/10).

Here's what we ordered: 

Carpaccio: 10/10 - Absolutely delicious! This had truffles and  quite literally melted in your mouth; was truly fantastic,  I would re-order again and again and again. 

Scialatielli Pasta: 8/10 - This was a delicious dish, perfectly cooked noodles and the quality of the meat was fantastic. That said, something wasn't memorable about the dish. If deciding between this rabbit pasta or Campagnolo's, I would always choose Campagnolo. 

Black Cod (Merluzzo Nero): 8/10 - Tasty, light, fresh, quality fish. Very small portion, and again, something about the dish wasn't memorable. 

Romana Salad: 6.5/10 - this was good, but nothing special about the ingredients or the assembly. You could very easily make this at home. 

All of this + a bottle of wine + two cocktails was $300. In my opinion, it was an extremely delicious meal but I likely won't go back.  The only dish I've craved since was the carpaccio."}
{"text":"So apparently they changed their menu! So  no more seared scallops but instead u can get a chopped up tuna sashimi with avocado and green apple. Very bland...I had to ask for chilli flakes something to bring a kick outta it! 
My friends foie gras was very good! 
My main cheese risotto with black truffles were just as bland...i ended up using the entire plate of chilli flakes! There were no offer of black pepper! 
My friends lobster mixed pasta apparently was also bland and pasta was also very undercooked! The only dish that was passed was the ravioli the strong cheese along with the pasta sauce totally made the dish the highlight of dinner! Needless to say we did not bother with dessert! Who needs bland dessert?!?! 

Oh another note, you'd think by charging $2.50 per head for water they would get it right between still and sparkling! There was 4 of us and we all asked for still, yet half way through we all got nasty sparkling water! We tried to down it but after abt a gulp none of us cud take it so we requested the waiter to change the glass, it was done with a bit of attitude! 

My recommendation, try the bar, skip the restaurant! No wonder the needed to create a \"cheese cave\" as an attraction to bring people in! It was Friday night te restaurant was less than half full...doubt this place would pay very long...
Is it me? Or are all hotel restaurants a flop in toronto?"}
{"text":"2.5 stars is the max I can give Toca for Sunday brunch.

Like some other reviews, I found that the selection is very limited and food taste average.  The highlight are lobster tails and oysters- lobsters are ok and small, oysters are small thin east coast oysters (something like malpeque).  Both are not great quality like we order separately at restaurants.  Egg benedict taste awful with the hard English muffin and tough pork layer.  Smoked salmon, prosciutto, cold small dishes etc are all not the best quality too.  When everything taste just average I don't think it's worth $89, you are mainly paying for the name Ritz Carlton.  Buffet in Vegas or Asia hotels offer much better food for this price.  Desserts cave is disappointing too, I can make better pana cotta. 

The service is also the minimal you can get, I have experienced better services in other restaurants in town.  They give you what you ordered and that's it.  I've a baby with me, when I asked for hot water to warm up the milk, my server made us wait for a long time.  I saw her busy giving cakes with candles for other tables instead of giving some special attention to my table which has a hungry baby.  Eventually we had to go around to find hot water ourselves, it drawn attention from other servers, then wait again to have it.  We were celebrating our baby's arrival too but she didn't give me any cakes with candles. 

The whole buffet experience was so rushed that I didn't have time to take photos to put on Yelp!  I was rushing through fetching food and eating.  Just got to try once of everything (remember not a large selection).  For that price, with a hotel environment I expect to be able to chat and celebrate the special occasion (which people come here for).  Today's experience was disappointing for us all. 

The only thing we like is the seating, we like the location of our table."}
{"text":"We enjoyed the pre-theatre menu at Toca and had an outstanding experience. The food, ambience and service were excellent. 
I had the pasta and my husband had the trout - both were delicious. I did not love the lamb meatballs but the pasta was great! Our appetizer was a delicious butternut squash soup. Desserts were rich, decadent and delicious!
The service was outstanding! Our server was Leah and she was excellent! All of the staff in the restaurant were awesome.
And they are so conscientious about allergies! My husband has celiac and they were completely understanding and accommodating.
I would highly recommend Toca!"}
{"text":"Everything about this place is special, from the open kitchen ahead of you as you walk in, to the funky open party space, to the cool cheese room, to the spectacular service and, of course, to the presentation and taste of the food.  This would be a great place to take someone on a special occasion or if you really wanted to impress.  

My girlfriend and I were here on a recent Saturday night for a pre-theatre dinner.  The bread basket was presented in a beautiful dish but I wish the bread was warm.  It felt like store-bought, cut up bread.  Not a huge deal for me since I am trying to stay away from starting my meal with bread and butter.  I was also disappointed with my mojito.  I have yet to find a great mojito in Toronto.

We ordered the Toca \"fish and chips\" and the seared foie gras as appetizers.  The only real disappointment for me were the fish and chips.  While I will eat lobster any way it is prepared, I found the delicate lobster meat to be overpowered by the deep fried batter.   It was tasty but it didn't blow me away.  The fries that came with the four of five pieces of battered lobster were plain and very disappointing.  I decided to save myself for the rest of the meal and didn't bother with them.   Despite this disappointing start, I still loved my dining experience at Toca and I enjoyed the foie gras much more.  If you have read any of my other reviews of high-end restaurants, this girl cannot resist the foie gras.  Totally worth blowing the diet for!

For the mains, we had the Glazed BC Black Cod and the Qualicum Beach Scallops.  Both were very good but I have to say that the scallops were outstanding.  Cooked perfectly and presented beautifully.  

Our server gave us a tour of the cheese room with it's $10,000 worth of cheeses.  Very impressive and informative.  We decided to try the cheese \"cave\" which featured four different cheeses based on our preferences as described to the waiter.  It was presented on a raised wooden board.  Great presentation!  The sticky toffee pudding with salty caramel and vanilla ice cream was outstanding.  I was sorry that I had agreed to share that since I could have easily eaten the whole thing myself but it was for the best.  Despite the three-course meal, the portions sizes are reasonable as is the norm in high-end restaurants so I certainly did not feel stuffed which is a good thing.    

This place is a must-try for serious foodies with money to spare."}
{"text":"Second time in two weeks but it doesn't change my last experience.  
Like last time I ordered the smoke salmon egg benidick.  Instead of letting them cook how they want; I told the server to have my pouch egg medium.  But....... I was Exteremly runny...... Other than the doness of the eggs; the rest of the plate is yummy.  The smoke salmon has nice apply smoke favor but is not salty.  The English muffin is the best I've ever had so far in toronto.  One thing I should highlight is the harshbrown, it was in prefect texture with a bit of carrot in it."}
{"text":"Yummy food and friendly service! They offer a salad bar for lunch now and it's amazing! They offer soup, focaccia bread, protein (meat or quinoa), cheese, greens, veggies and a variety of dressings!"}
{"text":"Wandered into Toca for some absolutely delicious cocktails. 

I started off with a \"Eve's Evening\" - Vodka, roasted pineapple liquor, bitters, cherry Heering and nutmeg. Very refreshing and not too sweet. Beautifully presented. 

My date tried one called \"Good Date\" (hyuk hyuk) which was Canadian club, date and black pepper liquor with orange zest. Definitely a man drink but he seemed to enjoy it!

At Toca you can try some \"mini bites\", \"bigger bites\" or shared plates if you sit by the bar, rather than have a full meal. We sampled some risotto balls and the braised lamb shank. I'm such a sucker for lamb shank (try saying that 5 times fast!) and the lamb here did not disappoint. 

I would definitely like to wander back to Toca for a complete meal, because the menu looks ridiculous (in a good way!)

Service was fantastic and our server knew his stuff!"}
{"text":"This review is only for the Sunday brunch at Toca. We have been twice to the Toca brunch. There are two seating are available, one at 11:30 am and another at 2:00 pm. I would highly recommend making a reservation and getting there right on time! The restaurant has great service, and you don't feel rushed at all. Both times we have sat until the end of service and the servers kept filling our mimosas. You want to eat and drink as much food as possible. 

The price for brunch is $89. This includes unlimited mimosas and access to a Caesar bar. The mimosas are awesome and your glass is never empty. In terms of the food, I know some reviews say there wasn't enough selection, but I like the Toca brunch because there are perhaps fewer items than a traditional buffet would have, but they are done very well. The seafood bar is unreal. There are oysters, shrimp, crab legs, smoked salmon and various other types of fish depending on the day you go. There is a salad bar next to the seafood station, which also has some interesting creations. Last time there was a salad with roasted peaches and goat cheese - it was delicious. But, the delights don't end here. 

There is also a beef Wellington station. The meat is juicy, tender and perfectly cooked. The pasta station is fantastic. I also am a huge fan of the breakfast items - the selection is small, but the donuts, eggs Benedict, bacon and sausage are unreal. If you have ANY room at this point, the dessert cave is pretty decent. It doesn't blow me away with items like mini tiramisu, creme brûlée, and panna cotta. They're pretty good, but not amazing. 

Sure, the breakfast is expensive. But, it's an experience. The service and food are both excellent. We love coming here for a special occasion, and feel we get really good value!"}
{"text":"Ah, brunch... The perfect alternative to a fancy dinner, because it gives me the whole day to recover! We stayed for an exceptionally long brunch since we were celebrating the anniversary, about 2.5 hours. The oysters, crab claws, lobster tails and shrimp were all super fresh and in high demand. Lucky for us, we had a table with a view of the seafood, so always saw when things got refilled. 

Mimosas constantly refilled. Napkins constantly refolded when we were away from the table. Plates always cleared. Impeccable. 

The cooked food was a bit lacking... Beef Wellington was dry. Omelette station with delivery to the table was a nice touch, but my egg white Omelette was wayyyy too salty! For the dessert room, the chocolate mousse was perfectly rich, and macarons were surprisingly on point! 

Overall, good value for me since I eat seafood like a shark, and drink mimosas and caesars endlessly. Loved my experience!"}
{"text":"I came here for Sunday brunch with a friend for her bachelorette day. I loved the variety they had as it was all you can eat.   When I mean all you can eat I mean unlimited oysters,  lobster tails,  crab class and sushi. Their menu is elaborate and their food is high end. Definitely for some email occasions and you can expect to be there from 11:30-3pm. There's bottomless mimosas too. Good place to catch up and just eat whenever you can!"}
{"text":"TOCA is hands down my favourite lux restaurant in Toronto. The restaurant is located on the upper level of the Ritz Carlton hotel, it is clean, spacious, has an amazing menu and extensive wine list. And if you cant find the wine or cocktail you want, they\"ll make it for you. The foie gras, rack of lamb, braised beef cheek and gnocchi= really well prepared and well made. Their lobster linguine is also really good (I think it might be a seasonal dish though). Love the ambiance and how nice the staff are. I always take my friends from out of town here and they all love it. You should also check out the Ritz Bar on the lower level, they serve Pilot coffee and the baristas are the sweetest!"}
{"text":"This place is nice and the food is decent. The pricing is a little high as you would expect.  In all honesty I was expecting to be blown away, and I was not. The steak I had was very very good, but the rest of the food (my wife had a lobster pasta dish, we had caeser salads, \"fresh\" bread, amuse bouche, and dessert) was just ok. The steak and good service combined was good enough to give this place 4 stars."}
{"text":"Normally I don't like eat bread but this time the burger bread wasvery crispy and I cannot resist it. Crab burger was awesome. Muahroom soup was okay I would say. The service needs to be proved cause I have waited for so long but there's only 2 tables left."}
{"text":"Chef Gaba is the crowning jewel of Toronto. Because of his fantastic food, coming to Toca is one of my very favorite things to do when I am in town.

The chef tasting menu is sure to dazzle. Every bite is special and each dish is a work of art. 

I always make sure I have the ravioli. It is the best ravioli I have ever had. Seriously. The BEST! Every bite is a treat filled with the wow factor. I crave it when I am on my way here. It makes surviving the line at customs actually worth it. 

This morning I had breakfast here. Tonight I am having dinner here. I'll be back tomorrow too. It really is that good!

If you are in Toronto, I recommend going to Toca and make sure you save room for the cheese ... because they have a cheese cave filled with some of the most special cheeses I have ever had outside of France. 

Ciao for now ... my next course just arrived and it smells so good! Yummy!"}
{"text":"Food was good if you can eat 100 bucks worth of oysters and lobster.  Other wise I think there are better options.

If you're looking for something fancy in the city Toca is a great spot. Otherwise I would suggest Spencers by the lake. It offers pretty much same quality/type of food for about half the price.  It is out in Burlington but it does offer a very lovely view. I would say the hot and cold stations are bout the same. Toca dessert is definitely better then Spencers. 

Or maybe even try the old Mill Inn. The cold station isn't as impressive nor it's dessert display.  It's hard to top Toca  wine cellar dessert station presentation.  Especially when they have 5 bottles of 95 Petrus laying around. Presentation aside I personally like the taste of the desserts at old Mill Inn just a bit more. Hot station I would say they are bout the  same. 

Overall 
Cold display: 5/5
Hot plates: 3/5
Desserts : 5/5
Service: 3.5/5 cause they messed up on my bill, and I had to pay for valet while my parents didn't!"}
{"text":"Wandered in after a meeting at the nearby RBC building, looking for a quick drink with a friend. 

Based on where the bar was located (ahem, in the Ritz Carlton) I was expecting astronomical prices... but not so! We even were offered complimentary bar snacks!

The decor was amazing - from the astroturf patio outside to the dramatic high ceilings inside, it all looked cool. 

I only wished the staff had been a bit more attentive - I discreetly asked for the cheque when my friend got up to use the restroom, and the server seemed more concerned with her coworkers at the bar than processing my payment. Service needs fine-tuning, but overall it was worth checking out."}
{"text":"Fantastic service, ambiance and decor.
The food doesn't live up to its price tag. While everything we had was well cooked, and tasted great it just wasn't out of this world. When your competing to be a top Italian restaurant / fusion red you really have to be at another level. Having eaten at Buca, Buca Osteria, Terroni, and Charisma I would recommend those before Toca. I would go back again though just not before going to the above restaurants again!"}
{"text":"Food, service, & phenomenal wine! I loved this place. My brother and his fiancé took me there for my first time visiting in Canada. He lives in the Ritz and thought it would be a great quick dinner. The meat was so tender - I forgot he name of my dish, sorry - but I'll post pictures. Would definitely go back...especially when I don't have to pay for it because it's spendy! Three of us"}
{"text":"This review is based on Toca's Sunday Brunch buffet. 

There are two sittings 11 and 230 - we had the later one and were served til the very end . 

Unlike a traditional brunch buffet the selection is smaller but the quality of the food definitely exceeds anything I've ever been to. The service is outstanding - if there is something not on the buffet that you want they are more than happy to bring it to you. Bottomless mimosas/bellinis and Cesar's are constantly flowing and my glass was never empty. Even towards the end when the buffet and service was closing our server told us not to worry and that he would make sure the prosecco was on hand for us 

If you're a seafood lover this is the place for you. The seafood area of the buffet is outstanding, as I was waiting for them to refill the server asked if I wanted a lobster tail, instead of giving me one he gave me three. Absolutely delicious, our server even gave us warm butter for our seafood. 

For the price ($89+tax) this isn't something I would do weekly, maybe for special occasions but is 100% worth every penny. 

Will definitely be back!!"}
{"text":"I came here for Saturday brunch for my birthday with my close friends and family. It's located inside the Ritz Carlton on the upper main floor. There's a large staircase in the lobby leading to the restaurant. The service is amazing, international and light Italian food is delicious, unique and perfectly portioned, it's reasonably priced with the Saturday brunch prix fix menu. I'd recommend coming here for casual brunch or an occasion brunch with the prix fix menu! I'd come back to try their Sunday $85/89 brunch and their dinner menu next time. 

Pros: Amazing and attentive service, consistent refills for drinks and check-in's felt natural. Coat check when you walk into the restaurant. I had to push back my reservation by 15-20 mins and they accommodated it ASAP. It helped that it wasn't busy for brunch, only about 1/3 of the restaurant was full. The food was really delicious, somewhat small but filling portions for the prix fix menu. I was full by time the dessert came around!  

Cons: Service was a bit slow in the beginning with 2 different servers. It wasn't too busy, only about 15-20 people there for brunch besides our table of 5, and we were given a booth in the corner. Since my reservation changed from 7 people to 5 (I called way in advance to note that), I would have appreciated a closer knit table, versus a very large booth where we were all spread out. It's a pretty quiet atmosphere, I imagine a packed evening would be much louder. The mimosa's are definitely expensive, we each got 2-3 each and a few peach bellini's which was over $30 at that point per person. Would have benefitted more from a bottomless mimosa fixed price! Not much of a choice with 2-4 choices for brunch drinks. 

Menu: Saturday a la carte is a bit more expensive but larger portions. If you want to have a bit of everything, sweet and savoury (which I LOVE for brunch) and well worth your money, then DEFINITELY get the Saturday prix fix menu. It's different than presented online on their website, and I took a photo of the menu too. For the 2-course prix fix ($27, or with a cocktail $39) and 3-course prix fix menu ($32, or with a cocktail $44)--worth it for it's price! I had the 3-course menu with a mimosa ($16, ugh) - Insalata Di Cavolo, Salmone Affumicato, Signature Banana Bread French Toast. All great components with unique twists. French toast was my favourite! We each got something different and every single person finished their portions and their meal, so it was delicious and just the right amount of food. You get an individualized mini vanilla and chamomile maple syrup! 

Atmosphere: There's a darker dimly lit space by the kitchen with circular booths and tables for small groups and larger long tables, and a more open-concept natural light space. There is a cheese cave tour as well, I saw it but didn't have time to check it out.

Summary: I'd go back on a busy night for their dinner, it was great service, consistent refills on water and mimosa's, I'd love to see a bit more variety on the menu, but I'd bring a group of friends or family back here again. The prix fix menu is MUCH better than paying the $32 or $25 per dish, when you can try more items for the same price and get your money's worth!"}
{"text":"Came here for a dinner with coworkers, but could only stay for a drink and a quick app..but the visit left me wanting to come back! The restaurant itself is sophisticated and beautiful, very romantic feel. The wine list is lengthy, and the staff is incredibly accommodating, they made a surprise mock tail for some coworkers that down drink alcohol. The bread is deeeeelicious, especially the focaccia rosemary one..I'm drooling thinking about it. As for apps, I had a side of potatoes and they were crispy and baked to perfection. Wish I could have stayed for the pasta..but I'll be back next time. The customer service is impeccable and they are very accommodating of dietary restrictions."}
