{"text":"All I have to do to make my family's eyes light up is say \"Toci Pizza\". We like the pizza and wings and the hot submarine sandwich, as well as the convenient location and the on-time delivery."}
{"text":"Awesome pizza!!  Homemade crust, crisp yet chewy. Great pepperoni.  Sauce has great flavor.  Forget the big chains.  You can't go wrong here.  It's miles out of the way for us, but well worth it.  I love the Italian sausage with mushrooms (fresh) and onions (fresh, sliced thin)!  The cannelloni are awesome, but I don't indulge very often.  Real New York pizza.  We got two pizzas and wings on Super Bowl Sunday to go.  They were ready fast for pick up.  Exceptional house made Ranch, not from a jar or bottle, or at least I dont think so!  We are out of delivery range, and we like delivery, but always make an exception for a Toci pizza. We always go for well done, and they never disappoint."}
{"text":"I would have given this place 3 stars if it wasn't for their whimsical yet stunningly handsome server."}
{"text":"My wife and I love this pizza place. There pizza is very delicious and we have gone there several times as well as gotten the pizza for delivery. Reasonably priced and really enjoy their specials. However, sometimes not the greatest customer service."}
{"text":"I can't understand some of the negative reviews unless I just tell myself - these people must be from Oregon or something and looking for vegan stuff?    This place is the real deal.  Pizza is perfect Brooklyn style, wings are great, hoagies are perfect.  Don't miss out on their cheesy garlic bread it is the best.  And they also have desserts like canolis."}
{"text":"Waiting a  1 1/2 for a pizza to be delivered . Some excuse of the driver got caught spending cops pulled him over . Still five minutes after calling still no pizza. Probably will be cold . Better give me a discount"}
{"text":"The customer service at this place is the worse I have ever seen!! Food is alright, but they treat you like shizzzzz!"}
{"text":"My family loves this place!!! We placed an order a bit late in the evening. It was a Thursday and they close at 9pm. We were at our son's choir concert and fit to Toci's around 9:30pm. They stayed open and waited for us!! What an awesome establishment!!! Thank you for being amazing!!"}
{"text":"Been going here since they opened.  Best pizza in a few miles radius. Have eaten in (very clean), eaten out (very quick), and catered (large quantity) all food good. Owner is very friendly, knows what I want when I ask for a pie, and the prices are typical of a family run pizza parlor."}
{"text":"I love this place! I love the special Carry out big pizza and wings for a affordable price I'll give it a 10 stars"}
{"text":"Rude , horrible customer service  I will never eat here again! This place isn't for my family and we love pizza ."}
{"text":"Order from here 6 months ago and it was not very good.  Figured I'd give it another shot, so I walked it today and just like EVERYONE on here says they are very rude.  So I walked out.  Don't   spend your money here, they don't deserve it.."}
{"text":"Best Pizza in town for sure! The staff here is always great huge smiles great attitudes always helpful!! The wings the sandwiches all of it is just great it comes out fast and hot and full of great flavors. If you are looking for authentic NY pizza and just a great place to enjoy it come here and keep coming here you will love it!!"}
{"text":"I love the wings! nice and crispy on the outside. Good amount of meat. I got medium and I'll most likely get hot next time because it's not enough spice for my taste. wings are great though. will definitely come back for the wings. The pizza was good as well. Perfectly crispy and a unique pizza sauce. I loved the cheese. I personally don't like like crispy pizza but my boyfriend absolutely loved their pizza. It's just not my cup of tea for the crispy dough. But I could tell it's still great quality. I got an extra large pizza with 20 wings for 22$"}
{"text":"Best pizza at a great price! Sandwiches and pasta too. The owner and staff are sooo friendly. We fed our family of five for under $50 and went home with leftovers!"}
{"text":"Straight up Brooklyn standard pizza place - nothing fancy, but what's most important is the food. Outstanding pizza and calzones, as a kid the owner worked at the renowned Queen Pizzeria-Restaurant, on Court Street in Brooklyn, he KNOWS good pie.   Toci is as good as it gets, would compete with almost any Brooklyn pizzeria, except perhaps the handful with coal ovens."}
{"text":"I came in with a friend to get their $3.75 two slice and bottomless drink special. For just 50 cents a slice, you can add a topping. We didn't have to wait too long for our slices to arrive. They were NY style and generously sized! Plenty of cheese, pepperoni, and sauce to suit my taste!   While we were there, another customer ordered a slice of cheesecake and enjoyed it so much, she turned around to tell us and went up to compliment the the server as well! Now that's something you don't witness everyday!  I could only finish one of my slices and had to take the other home or I may have succumb to the temptation of that delicious looking cheesecake as well!  Maybe next time!"}
{"text":"This place is my favorite pizza place in town I haven't had anything that wasn't good. If you want a really great slice of pizza go here. The other food is great too. I bring all of my friends here. Also the calzones are the best ever."}
{"text":"The food here is authentic Brooklyn-style and rather tasty. The one star is due to the owner asking me to write a review on Yelp, after handing me my food. How incredibly tacky. Will not be returning."}
{"text":"Not the greatest. I had a cheese napolitana pizza that was the greasiest pizza I've ever had. It wasn't very flavorful. Just didn't stand out in a god way. I was hoping to like it because it's right down the street and I hate how greasy Pizza Hut is but this made Pizza Hut look like diet worthy. I don't recommend. The 2 stars are for service. They were nice, efficient and did was delivered on time that's the extent of good things in my opinion."}
{"text":"I really like this place and they have great food.  But the girl who takes orders on the phone for deliveries needs classes in customer service. Not sure if she is family of the owner, but he should know how she treats the people that brings in money to their restaurant.. If he keeps letting her answer the phone to take orders he is losing customers. We stopped ordering from them for some time .. Thought maybe she was gone, but she's still taking orders.  Sorry to hear her unfriendly rude lack of pride in  her job voice!"}
{"text":"If I could give them zero stars, I would. They need to go back to Jersey or whatever town back east where they treat everyone like shit!"}
{"text":"They must have been having a real bad day! My husband loves this place and has to order boneless wings mushrooms and a pizza every week! It is on going I want to go somewhere new but no we have to go here. I think it's over priced for the quality. Well today we got an order home and it was wrong so he called and they said no he didn't say boneless big argument on phone he went to get them replaced and the guy was even ruder in person. Did I mention when he got home one bite of wings and he was in the bathroom throwing up yeah I don't think I'll ever have to darken their door again! Score one for the wife today!"}
{"text":"The spaghetti is fair. The pizza is greasy and flavorless. The sauce is like can tomatoes with no spice. The pepperoni is thin and my pizza was dripping with oil from the cheese and pepperoni. I am Italian and this place we have tried many times and we are done. T. T."}
{"text":"Nice quiet clean atmosphere, and the service was excellent. My friend said it was the best pizza he'd had in the valley. It was cooked perfectly, the real mozzarella cheese fresh, not pre shredded, frozen crumbly stuff & there was enough to satisfy any cheese lover. It was melted smooth, with just the right bit of browning, & no greaasy puddles. The pie was HUGE, & we got the 2 for $20 deal, so there was enough for all of us & plenty leftover, & it tasted great later too! They also had calamari sticks which were perfectly tender, deep fried in crispy parmesan coating. I was so full from one slice of pizza I couldn't eat more than one stick, & took it home for later; I would ask for extra marinara next time, & I's sure had I thought of it the staff would have provided it. They were so friendly. The also have wine & beer, & they deliver! I imagine if I was in Brooklyn, I'd enjoy this just as much. I'm so glad to find a good pizza place & can't wait to go back & try their eggplant parmesan!"}
{"text":"Great food, the pizza is amazing!  Only pizza I can say I really love. Fast friendly service too."}
{"text":"Just had the margarita pizza delivered and all I can say is WOW!!! Best pizza EVER! So incredibly delicious. The crust was perfect and the sauce!!!...I typically do not like red sauce but their red pizza sauce was to die for!  Amazing work Toci!!   Ps the delivery guy was nice too!"}
{"text":"my son swears by this so we decided to try it out.  it was pretty good but far from the house, not good enough to warrant the drive.  very friendly & family environment."}
{"text":"We had the Napaleon style, special and a order of wings for dinner tonight. Very good pizza and good wings. I was a little skeptical about trying these place because all the reviews I read on google were negative but they were all wrong. We are defiantly going to eat here again."}
{"text":"Do not order from them, especially for delivery. They take FOREVER!   I called them a couple of weeks ago, and asked them if they had a supreme pizza or pizza with everything, something like that. The person on the phone said they don't have anything like that.  What? So I decided they are clueless and hung up and called a proper place.   Tonight, unfortunately my wife called them not knowing what idiots they are. We waited an hour and 45 minutes for them to bring our pizza.  This place clearly doesn't care about their customers and seems to have no concern about whether they stay in business or not. The 4-star rating average must be bogus."}
{"text":"Great food, great price, excellent service. The dinner selections are delish, we go weekly and have tried them all, my favorite Eggplant rollatini, and the antipasto is fabulous. Pizza is just like New york, excellent. Super clean and friendly. We are regulars."}
{"text":"I don't understand all the haters here. If you've never had REAL NY pizza, this is it!! I grew up in Mill Basin, a neighborhood in Brooklyn. The sausage pizza is just like being home. My personal favorite is the small antipasto (w anchovies) and garlic knots.  The lunch special of two slices and a cup of soda for $3.75 is a great value and right out of Brooklyn.  You may claim you're from NY, but if you're living in West BuFu, Washington, you don't know diddly about pizza. Go back to eating that mush they sell at Peter Piper's or Domino's."}
{"text":"Recently moved within a couple miles, and I'm always in the market for good pizza. I read the Yelp reviews prior to deciding on a visit.    The guys behind the counter were very \"New York-ish\".  A touch of authenticity!  One of the cleanest places I've been, even taking a peek at the cooking area while I was ordering at the counter.  Since I was alone, I settled for the 2 slice special.  I won't get into the \"authentic Brooklyn\" debate, I've only visited NY a few times. But I know what I like and this was it!  Slice specials are usually heated up, but this came out with a crispy bottom crust tasting like it was freshly made!  Huge slices at a bargain price.  The menu is very intriguing and I am looking for a reason to go back in less than a week.  Stromboli on the menu!  I will be ordering that next, one day when I have a dining partner I'll give the wings a shot too.  So far, the pizza was GREAT!"}
{"text":"Love this family owned Pizzeria! Come in twice and the owner always remembers you. The food is fantastic! Pizza is amazing, garlic knots & subs are wonderful too!"}
{"text":"Straight up, I've been to a few different pizza shops out here and I came across TOCI when I was driving to work. The \"Brooklyn\" caught my eye. I've lived in Brooklyn for many years and NYC in general all my life. I was taking a shot in the dark beginning with just three slices. Brought them home and we LOVED them.   I'm going to have to experiment with the menu because TOCI has a serious one, lol. Calzones, Sausage Roles, Sicilians, Wings, I'm down!  - Eddie Ed, that kid from the Bronx.   (Always chilling in his B-boy stance)"}
{"text":"Great cheese pizza!! So flavorful, and thin. It's amazing. The crust is really good too. I stopped in after work one day to pick up dinner. Walked in and ordered and my pizza was done in about 15 minutes. Great ace and will be back!"}
{"text":"Good pizza and wings. Best place if you are living 35-59th and Peoria area. Good to go and eat in too. Friendly staff and beer."}
{"text":"BEST PIZZA IN PHOENIX. This pizza beats any chain pizza restaurant & all the local pizza restaurants.   The best thing to order is pepperoni pizza & medium hot wings.   The owner & workers are super friendly & if you're a loyal customer they tend to remember your order & name!"}
{"text":"I'm a Jersey dude and take my Italian seriously. Finding Toci was an oasis in the Arizona desert. Pizza is top-notch and the dinner dishes rock. Everything we've tried is very well prepared and the portions are nice sized.  And the folks that work there couldn't be nicer."}
{"text":"This place looks sketchy from the outside, but something was telling me it would be awesome. And you guys, it is awesome. The pizza is amazing, and the staff is also super nice. My 14-month-old daughter is running all over the place and they are being supersweet to her, and even gave her a couple garlic rolls for free. The booths are huge, the pizzas are huge, and they do not gyp you on toppings in the least. I will definitely be coming back."}
{"text":"I have only been here once but that's all it took for me to never want to return again.  There's no way in hell they could serve this pizza in New York or a even a high school cafeteria for that matter.    I actually feel bad writing this review.  The owner seems like a good guy.  He even gave me a free 2 liter of coke for my wait.  Unfortunately, the product was just awful.  The cheese was thick and tasted generic and undercooked.  The sauce tasted like it was out of a hunts can.  The bread was flavorless and had no crunch.  It was like eating a thick piece of soft cardboard.  Everything just seemed to have that previously frozen/canned and not homemade feel to it.  I will upload the pics so everyone else can see what I am talking about.  I'm no Brooklyn baby but something tells me this pizza would get booed out of the neighborhood.    I was planning on reserving my initial horrible experience and giving them a second chance but I can't do it.  No amount of free soda could make me want to eat or I should say waste another pizza from here."}
{"text":"Very rude. First time I went customer service was horrible and they were very rude but food was good so I gave them a second chance just now. The man on phone was extremely rude. When I asked what pizza specials they had he said call back when you know what you want, go and look at Facebook and call back. I couldn't easily find their online menu. Sad because their food is good but service sucks. Good luck on running that kind of a business. Crazy."}
{"text":"This former New Yorker is so glad that this pizza place is here. The slices are big and the taste is just like that of the pizzas I have enjoyed for years in the boroughs of the Big Apple. And no wonder: the pizzas are made by friendly guys from Brooklyn who really know their stuff.  This place also offers  a  great lunch special of 2 slices and a drink for just $3.75  - one of the best lunch deals in the city."}
{"text":"This place gets the job done. It's not the greatest pizza in the world, it's not the worst pizza in the world. The slices are greasy, which means the cheese isn't the best quality, but at the end of the day, it tasted good. The prices for lunch are pretty much unbeatable, and the place was clean enough. I would rather give this place 3.5 stars, but that's not an option, and because there really aren't any other great options in the immediate area, this place gets the round-up and a four. Keep it simple at this place, keep your expectations at bay, and you won't be disappointed."}
{"text":"Pizza is pretty good! Cute little place with nice lighting and decent size booths..One large dining table off to the side in a little nook.. seats about 10. Large flat screen to watch the games.."}
{"text":"Pretty damn good food, the owner is really nice, always friendly and personable. Always clean, so are the bathrooms. All the staff is friendly. It's a little expensive BUT they always make it fresh and it's worth it. I have no problem spending my money here."}
{"text":"Awesome pizza and wings. The pizza sauce is sooooo good, but the crust is even better it might be the best in AZ."}
{"text":"Ordered the special Xlg pizza $20. Should've ordered Domino's would have tasted better. There was so much onion in it, it tasted like a onion pizza. Nasty"}
{"text":"Delicious. I'm a frequent customer so they know me by my name. Every time I come in they always treat me like family. Their food is delicious! I always get the XL pizza and the 20 wings because it's perfect for my girlfriend and I and it's an awesome deal ! I love going here I stop by toci pizza 2-3 times a month because I can't get enough. Highly recommend!"}
{"text":"If zero stars was a choice that's what I would give this place. They have terrible customer service and now I know why there is never anyone there when I go. The male employee that flips the pizza is so rude. I went in with my family and he flipped out because I needed to charge my phone TO GIVE DIRECTIONS TO MORE PEOPLE TO JOIN US FOR DINNER THERE. My family has never been treated so rude and badly. It went as far as my dad asking to speak to Johnny the owner and the guy said Johnny was on a delivery and that the girl was the owners daughter so it doesn't matter what we want to talk to Johnny about anyways. That place needs new employees. I'd be embarrassed to be the owner knowing that when he's not around his daughter and young dough flipper treat the customers like shit. We will never return and I suggest if you want good service and better pizza to go down the street to NINOS PIZZA!! Thank you to Ninos for treating the customers like a priority!!"}
{"text":"really good food. we had a house salad and some spaghetti. delicious. great atmosphere. friendly people. and the Olympics on the big screen. thanks!"}
{"text":"I love love love the lasagna here!! Garlic knots so good too! I really enjoyed everything I have had here. The only thing that bumped this review down a star was the customer service over the phone. Not the friendliest but I will overlook it for the yummy food ."}
{"text":"I stopped in this place for lunch on a friends recommendation. I was impressed by the roast beef sandwich I had. The bread was toasted nicely, and the dressing was very good. It could have used a little more meat, but for $6 with a drink it was very good deal.  I would return here again if I'm in the area. Give them a try."}
{"text":"love the food.the employees give great service.& the place is nice and clean.  they also have a menu selection not just pizza."}
{"text":"I have been coming to Toci's for years now. Johnny, the owner, basically knows the whole family and extended family because we all go here. He is seriously one of the nicest guys. As a regular I love to hang at the counter and watch him craft a pie of deliciousness together. When people write these reviews it makes me so mad because they come in and expect some smily-face bs. That's not authentic New York. If you want sunshine and rainbows and crappy food -- go somewhere else. If you want the best damn New York style pizza (authentic not that BS they try to give you at Dominos or Papa John's) and maybe a little New Yorker sass -- this is the place to get it. I know because I have family from New York/New Jersey.  The Food: New York style pizza with great crisp crust, perfect portion of cheese and amazingly robust sauce. Some said it had no sauce -- well if you want to drowned in sauce go to little Caesars cause Toci's delivers a great layer of sauce that doesn't overpower the pie. Some of the family's favorite toppings include sausage, black olive, and meatball. They also can do 6 foot subs which we have had a few times for large family functions, philly cheese steaks, calzones, etc. Everything is amazing. Oh and if you ever want the best cannoli of your life -- get it here. \"leave the gun, take the cannoli!\"  The Staff: Family owned restaurant with a great guy from back east. Every now and then his daughter and other family help out in the restaurant. They all have a lot of experience making pizza. The owner admits he has had a slice of pizza almost everyday of his life. Also, the owner gives these oddball characters a shot. No, they aren't like the \"my pleasure\" crew that works at Chic-fil-a, but they know how to make some damn good food.   The Atmosphere: It's a mom & pop restaurant. They have plenty of seating and themed decor that mostly has been gifted. Nice deep booths seat a bigger group of people (about 6 to 8), and also a larger family table that can seat around 20. One tv -- but big deal you should be talking to your family and friends not staring at a tv. This is definitely a good place to have a family meal.  The Service: Another reviewer mentioned, but I will state again -- they are spot on with their timing. Also, I will ask about how much will serve how many when I have a larger group to feed -- also spot on there too. Yes, you may get some smart a** comments if you ask a dumb question, but I love that. I dish it right back while being respectful. I mentioned it above, but the staff is a great bunch of oddballs and they know what they are doing. You basically are family if you're a regular. (which I am)"}
{"text":"I'm really not sure why this place gets bad reviews. I guess there has been rude staff or customers have waited a long time to get their food. Perhaps not everyone likes their food but that is the case for any restaurant. Also, I find it ironic that some of the reviewers who claim they were treated rudely are pretty rude in their reviews (not all). Oh, and James R from Glendale, not everybody from NY is rude!  My experience (key phrase and the emphasis on \"my\") has been really great. I've been there more than a dozen times since living on this side of the valley. No one was ever rude to me and if anything they went out of their way to make my experience a positive one.  The owner takes a lot of pride in the food that he makes and this place is a lot more than just pizza and wings. Every time I have been in there I was greeted and treated nicely with a lot of respect. Being from NY, I have asked the owner is he makes other things that are not necessarily on the menu... like Chicken Rolls. It's the only place in all of that places that I have ever been that not only knows what a Chicken Roll is but makes a mean one!! I mean really good!!!  They also make Rice Balls.... Like good old fashion home cooking. I know it's a cultural thing but they are absolutely delicious! The owner was \"happy\" to make these things for me and that means a lot to me.  The pizza is good, a lot better than you are going to find at any commercial place. Pizza Hut, Domino's, Papa John's, etc do make pizza but they do not make NY pizza! Toci makes NY pizza and it's good!  I will continue keep coming back... Trust me, there is nothing more I despise then rude people who are in the customer service industry. I'm not saying that other peoples' feedback are not true... all I can tell you about is my experience."}
{"text":"Crust is firm, crunchy, slightly charred on the bottom; just how I like it.  Sauce was a bit bland for my taste, but it didn't overpower any of the toppings, which is a plus.  The toppings were fresh and generous, and I think with a little experimenting, I can build a truly great pizza here.  Even though they were located just a mile from where I was, I had them deliver it because I had been drinking/watching the game.  Delivery was promised in 45 minutes, but it arrived in just 30 minutes.  So, a quick experience (and I ordered at 6:40PM, which is primetime).    A couple of notes.  They offer 2 sizes of pizza, a \"medium\" (which at 14\" is actually a large most places) and an XL at 18\".  I ordered the medium, and they cut it into 6 big slices instead of the traditional 8.  Basically, I was able to eat my usual \"2 slices\" and get way more pizza and didn't go off my diet.  HAHA.  One of the best local pizzerias I've tried in the West Cactus/North Mountain neighborhood.    (Other reviews mentioned the rude lady, lol. In New York the rude lady is everywhere.  Who cares.  Just eat your pizza.  No soup for you!)"}
{"text":"The food here is not all that fantastic. It's mediocre at best and is a slight step up from the chain places. I've been all over the east coast and this pizza doesn't come close to comparing.   The huge negative is the attitude of the people here. I called for a delivery of one medium pizza. The only reason I even called was because no one else around delivers and I didn't want chain pizza. I was quoted one hour delivery time. The hour comes and goes. I call to see what's going on and apparently my pizza just started cooking. Ok....at that point I was willing to just go pick up the pizza, but when I asked why they quoted me an hour when the time was more like an hour and a half, the attitude I received in return made me cancel the order. I'm a customer paying $15 for a medium pizza. You are a small, local shop. You may want to check the attitude at the door in order to succeed in the long run. I'll be telling all my friends and neighbors not to give you their business.   I took my business to the other small pizza shop down the street. They don't deliver but at least I'm picking up my pizza without the side of attitude. Oh ya, the pizza tastes better there too."}
{"text":"This is by far the BEST pizza I have had in the last 7 years!  The owner ALWAYS remembers our names and orders, if you have not been here you MUST come!!"}
{"text":"Yummmmo great pizza and fast... Just moved here and already know this will be a go to place"}
{"text":"I love there Hot and BBQ, & BBQ wing. They were cooked to perfection. The owner was very nice and welcoming. The restaurant was clean and nice  The had one TV  which was good to see  The pizza was was also very good I order a pepperoni, olive, and mushroom  with lite sauce pizza was very good. Thanks for everything."}
{"text":"Pizza was delicious!!  The staff was very friendly and helpful too. We walked in and I was very impressed with how nice and clean eveyrthing looked. The pizza crust was crisp and amazing, I liked that when I picked up my slice, It stayed together. Most places make the pizza so thin and hot all the cheese and toppings slide off but not at Tocis. We will be back for sure."}
{"text":"ower has no respect for his customers... i have spent so much money eating here as well as ordering out. i called to make a delivery order and he said he would not come because it was too far although he previously has made the trip. he explained it was because he didn't have his delivery driver and he would be making the drive himself and didnt want to go out of his way which i don't accept because its only an 8 min ride. way to treat a  loyal customer. ive told so many people about this place being from new york and feeling like this place was a slice of home. the manager has a horrible attitude."}
{"text":"Our first time here ... Pizza was good and the wings were hot and crispy.  They have good service as well.  My family and I will definitely be back!"}
{"text":"The food was good but the girl that took the order was biatch. Never smiled, try to joke with her, just not a nice person. Very rude and should not be at the counter."}
{"text":"Excellent food and best Sicilian pizza in Arizona!! Great sauce. Spinach roll was best ever. Salad was fresh. And good Zanolli, their homemade desert."}
{"text":"This isn't any type of Brooklyn pizza or a place to find real calzones or chicken rolls you want real pizza go to gramaldis or spinatos also they claim Italian but no other than Albanians masking them selfs like they all do with the bad rap other than that don't waste your time  Funny guy I'm from queens and been to many Brooklyn spots and Staten Island you are no where near close"}
{"text":"Everyone needs to stay away .. the owner can screw up your order and it is your fault.. But instead of making it right he belittles you like it's your problem and yet he was proud of himself.. One would have thought that he could have just said my bad here let's JUST fix it.. But NO ..  Pour customer service.. They Just don't care about the customer... Or you.."}
{"text":"My husband and I love this place!!! Tonight is my step son's graduation ( 5/19/16 at 2100hrs) and we ordered 3 pizzas and 40 wings at the last minute, they made the pizza and waited for us to show up!!! Even thru all of the traffic, because we were at the U of P stadium, we were getting there asap!! This pizza joint is number one in my book!!! Thank you, everyone at Toci's!!!!"}
{"text":"I ordered via the Door Dash app. Food was hot and arrived on time; no fault there. The description of the barbecue chicken pizza did not mention onions, and the pizza arrived smothered in them.  I was charged for and ordered Sicilian ($17.99), but I got a Napolitana instead ($10.95)."}
{"text":"Everytime I come here I'm always treated nicely. Food is really good. Love their wings. Fast service. Can't complain"}
{"text":"I love this place.  The pizza and wings are outstanding.  I don't understand the bad ratings of this place.  I have eaten there food on numerous occasions and have had nothing but good food and good service.  The only reason I gave them four stars instead of five is that they are closed on Tuesday's."}
{"text":"Love the food! The owner is a real nice guy and genuinely wants to know his customers. Some people may be put off by their demeanor here but these guys are just authentic Brooklyn, a little rough around the edges but mean well."}
{"text":"I actually hope this place closes down they're so rude.   They don't deserve to stay open, they need to get people behind the counter that know customer service and they might work but no matter how good the food could be the service is so bad I couldn't wait to get out.   Even the wedge salad sucked it was the core of a lettuce head.   Don't bother with this place"}
{"text":"Food is decent and this was my fifth visit here tonight until the owner was RUDE. I came in and there was one  couple ordering in front of me, placed my order, one pepperoni pizza, house salad and garlic knots, and was told twenty minutes, no big deal. Couple in front of me received their order, I am still waiting, large group of eight come in order, I am still waiting fifteen more minutes go by, when the large group starts receiving their food. I finally go up to the counter and ask about my order and this guys  jumps my butt about its Friday... we are busy...blah blah blah. I turn and go back to the table. A few minutes later he calls my order up so I send my husband to the counter. I hear my husband ask where our garlic knots are and the same jerk says there are no garlic knots on your ticket. My husband calmly says yes, we ordered garlic knots, the guys proceeds to tell my husband well there is NO GARLIC KNOTS on your ticket. Finally the girl that took the order says yes there is and he throws some he had sitting out and said give him these. My husband then starts walking away, then the same jerk calls him back and asks what pizza he ordered, so he told him and he said he gave him a cheese pizza, so he switched the pizza out. An hour later, cold pizza and no apology. This guy is a genuine ass and I tipped them $4.00 on a to go order. The food is descent however I will NOT spend my hard earned cash for this treatment. You can go to Vitos Pizza on 43rd Ave and Northern for pizza just as good and be treated like an actual paying customer and not like they are doing you a favor."}
{"text":"Place is a terrible example of Brooklyn style pizza.   They pretend to be Italian but their Russian   Nuff said"}
{"text":"Delicious thin crust pizza. It was my first time in tonight and couldn't have had a better experience. Met the owner, John, who was very personable and chatted with me about his marinara secret ingredients. Very enjoyable experience and will definitely go back!"}
{"text":"If I just had to review today I would never give this place another dime. Usually my husband and I get a to go order and love it. We actually had lunch there today. Called for a delivery this evening at 6:30, the girl was so rude so we ordered from somewhere else.  When I got off the phone with her my husband said...let me guess same girl from last time you tried to call in order in?! That was 2 months ago, I am assuming it is family. Don't go to this place for their hospitality."}
{"text":"My first time going here I was brought by my Dad and his girlfriend, the environment felt warm and the food was stupid good! The pizza was so CHEESY! Unfortunately at the time I wasn't eating meat so I couldn't try the wings but they looked promising, can't wait to go back again, I definitely recommend you check this place out if you're in the area!"}
{"text":"Pizza and wings are delic.... delivery guys nice.    Eat in has a nice atmosphere.     We order from there at least once a month. Never had a bad experience.       One negative- the girl that answers the phone is not friendly at all.   She seems to be is a huge rush and on the verge of being rude.  Just calling and hearing her voice makes me wanna order elsewhere."}
{"text":"The pizza is great. The desserts are great. The wings are pretty good. The pastas are impressive portions but sometimes not as great as everything else. The owners are personable and like to talk to the customers. All in all Toci pizza is one of the better pizza places on the west side."}
{"text":"This place is a gem. I came here on a whim. As we came in we notice how busy it was for 12:30 in the afternoon. As for the pizza, absolutely delicious. The crust was phenomenal as well, especially for a guy who hates crust. They are both Italian cold and they provide an authentic slice. I recommend coming for a delicious Italian pizza and attitude."}
{"text":"I do not take writing negative reviews lightly as it affects people's livelihoods. I can infer based on my experience that other people's reviews are probably pretty accurate even though I did not have a particular problem myself with the service. I can see how people might be put off by the demeanor. The two stars are not because of attitude or bad service, it's because I really, really did not like the pizza at all. I only ate it because I paid for it. I will not be back again. Not recommended. At all. Sorry guys."}
{"text":"Good prices great tasting pizza and wings. The ranch sucks. Not really any  different then other local mom pop pizza joints.   They beat pizza hut, papa johns, dominoes by far. I have to say that. I really like that there just around the corner from me."}
{"text":"I have been here many times and the food is usually pretty good... however just bc we come in an hour before closing doesn't mean we should get Shitty service and piss poor attitudes!! We ordered a small cheese pizza and order of cheese sticks which were way cold! We wanted to dine in got a table and our order to go like a big GTFO! word of mouth does get around tocis! Next time I'll drive the extra miles for Napolis also it's very gross and disgusting for the owners to be outside smoking a foot from the door! Great job guys"}
{"text":"I also agree that I do not understand why some people rate this place so poorly. We tried them as a family three years ago and have been consistently going back ever since. Regarding their food-we have tried everything from their pizzas to their pastors and sandwiches. Their wings are amazing and their food is always freshly made and consistent. One of the things I have to point out here is that the timing on their orders is always on point. Meaning that when they tell you it will be ready in 10 or 15 or 20 minutes they are literally pulling it out of the oven we're wrapping up your order on the dot. Food is always warm and they don't leave it to sit around to get cold or soggy. I especially love their pizza and wings-always good and the wings are always just the way that I like them.  As far as the owners and the employees go-I also do not agree with some of the prior commentary. I love the fact that the owner is always present at the business. He is always politely greeted me-whether I'm carrying out an order for myself and my family are eating in the restaurant. In addition, he has always offered to help me out to my car when I have a bit of a larger order to carry. His employees are also always very polite and organized. No complaints from me here. I will continue to go to Tocci .I love the fact that a place like this is right around the corner from my house."}
{"text":"Saw the \"Brooklyn Pizza\" sign and being from there I had to stop and see if it was the real deal. Had a couple of slices and I'm in. Going back for some fresh pies and to try the Chicken Parmasean sub. Jonny, the owner is from Sheapshead Bay Brooklyn. Thanks for coming to the neighborhood,"}
{"text":"My family stopped by for a bite to eat. Very good pizza! Quick service, nice and hot pizza. Highly recommend."}
{"text":"I'm not sure if the fellow at the corner was the owner or just staff but he was rude. I ordered a Margherita pizza and it was disgusting. It looked and taste like can crushed tomates with onions as the sauce. The crust was hard and dry tasted like cardboard. Im not sure what herb it was but it surely wasn't fresh basil. This pizza had absolutely no taste to it. My boyfriend ordered a chicken calzone and said it had no taste. The wings were mediocre. Save your money and go somewhere else. I will not be returning!"}
{"text":"I order take out often from this place. Many negative reviews are probably referring to the customer service. But keep in mind, the owners are from New York. That's just the big city culture mentality talking. They're actually good people. The food is great and this is my go to place. For all those being too sensitive by the way the owners/ employees are, please lighten up."}
{"text":"My boyfriend took me to Toci's while we were waiting for Sonic's happy hour. He raved about the lunch special. You get 2 slices of pizza and a drink for around $5. The slices are huuuuge! Great place if you're feeling hungry but not feeling like spending a lot.   The default is cheese but bf got pepperoni on his (not sure if there was an upcharge). The slices were thin-crust, but still super filling.   It certainly isn't gourmet or the most healthy choice. If you're the type to dab your pizza with a napkin, prepare to grab a few extra napkins. But if you're craving yummy, greasy Brooklyn-style pizza, this place will hit the spot."}
{"text":"Not bad pizza. Great price for what you get also. Not a fan of the garlic knots but I would go back for the pizza any day. Next time I want to try one of the specialty pizzas. I was in a rush and we grabbed two slices each."}
{"text":"BEST PIZZA & WINGS you will ever have. My boyfriend and I are regulars and get treated like family by the owner!"}
{"text":"Solid 4 and a half stars. Good NY style pizza and the hot wings are definitely 5 STARS!"}
{"text":"Love their pizza!!! Garlic knots are awesome! Amazing food !!!! Having been born and raised in NYC - I can vouch for good pizza and this is by far the best I've had since leaving NY!! Go Toci Go!! Can't beat their deals either. PLEASE PLEASE do not deny yourself this great taste... If you can find better, let me know. I've tried a lot of places in town and so far nothing beats Toci."}
{"text":"This place is a local gem.  There is no problem getting what you want.  The owner will personalize your pizza, remembers his customers and what they like.  Truly great pizza."}
{"text":"Me and my dad love coming here. Besides the friendly service, their pizza is AMAZING. all of their ingredients taste real. If you want actual pizza then come here!!"}
{"text":"My goodness. The crust here is freaking phenomenal and crispy just the way I like itttttttt !!!!!!!!! The veggie pizza is is awesome.  Ahhhh.   My nephew killed the bbq wings and obsessed with his meat lovers. Haha.  Auntie nephew night, good food, good people, Watching the Chicago bears and the Philadelphia Eagles. Perfectttt!"}
{"text":"I see why the staff is rude because the owner is rude. The food really isn't that good but I went there because it was close... Well I won't anymore! The place has the rudeness of New York down but needs a lot of work to get to the standard of New York pizza!!!"}
{"text":"Awesome place to go to very nice and welcoming people, pizza is great, you have to try a slice you won't be disappointed!!!!"}
{"text":"the place was actually set up really nice. pizza wasn't good. the cheese was decent, the sauce was below average.... not bad, but below average. the crust seemed like it was made from all purpose flour, and not bread flour. also, i don't like the pepperoni being added after the pizza is almost  done, i like it put on before the pizza goes in the oven. this could be something some people prefer, but i like pepperoni to crisp up a bit.  wings were sauced well, but overcooked, yet not crispy. i would suspect the fryer temp was set too low, causing them to cook too long.   i will give it another try, mostly because the place was clean, and they seemed nice. probably try a sandwich next time. might give the wings another shot. but, i will not get the pizza again."}
{"text":"Just tried it. I thought the service was fine the owner engaged in conversation both when or ding and while I was sitting there. When I needed more oil for my sub he got it and brought it to the table.  Kids loved the pizza. The sub was ok."}
{"text":"Great food we love that theirs a variety to order from. Reasonable prices too, delivery is always fast and service is always good."}
{"text":"Owner is from NY and was probably exiled for making the sub-par pizza that he does.  How could anyone ruin pizza and salad so spectacularly?"}
{"text":"Pizza could have used a lot more sauce. There wasn't any flavor to it so I ended up adding a ton of garlic, oregano, pepper flakes,and parmesan to get some type of flavor. The Caesar salad was fantastic!"}
{"text":"Lunch special is a great deal for $3.75.  Service can be a bit surly and slow, but isn't that authentic Brooklyn?  Not a nice little shopping area either with a hookah lounge and a bunch of broken glass on my visit.  Slices were similar in thickness to Ray's in the valley here, with good silky Mozz cheese.  Would normally consider this a 3 star but the slice deal is too good, so kudos for good value."}
{"text":"I always have to check out a place when a lot of New Yorkers recommend it. The staff here are ever so nice. When I walked in there were a table of firefighters eating a big pie.  I knew it had to be good. Those guys know good food for sure. lol- If you like NY pizza then you will like it here. It was very good. Probably so far the best I have had on the West Side of town. I also think their Zannoli is, \"Oh so clever\" and \"Oh so delish!\" Hard to find Zeppoles out here anyway and the combination Zeppoles and Cannoli was fun and great. [ but not for my diet. :0( ]"}
