{"text":"We went here for dinner.  I ordered the black bean noodles and my boyfriend ordered the handmade noodles.  Overall, the experience was bad!  The tea was cold.  The black bean noodles were cold as well.  The handmade noodles were bland and had a horrible smell to it.    When I compared the supposedly \"handmade\" noodles to the black bean noodle dish, the noodles in both dishes were the same - not handmade at all."}
{"text":"I've been to this Korean restaurant a few times for the last few years. In this past year, I've been there for 2 times.  the most recent visit I took a few pictures, the sweet & sour pork with the orange slices (please see pictures)  beside the S & S pork, the 3 of us ordered the Kalbijim (Beef Rib Stew) and the Kimchi fried rice.  the banchan are good, wait, they are great. I like the fried zucchini the most, the kimchi has a spicy-sweetness with a bit of sour, and the broccoli with the white salad dressing was the best.  unfortunately the main was not as good anymore. the kalbijim was not tender at all, and there isn't any potato or radish with the stew.  while sweet and sour pork tasted ok, but the sauce was a bit thick, and the batter too. the worst was the Kimchi fried rice,  the potion was really small, almost no Kimchi in it, and it taste really sour, not in a good way. and the fried rice wasn't hot, not spicy hot and not temperature hot, yet it just came out of the kitchen less than 5 minutes after we order it. I guess they just put a pan-fried egg on top of some precooked fried rice?  on top of all, they are not busy that night, probably because it's early around 6:30pm..."}
{"text":"Todamgol is gone. It's now a different Korean restaurant under new management. New menu. New decor. I went once, and it's still yummy."}
{"text":"I love Todamgol and it's one of the places I've taken people from out of town (and earned me a reputation as a trustworthy chowhound). It also taught me that restaurants with less English on them can be the best. I didn't even know the name of the place until I looked it up online. It was just 'that Korean Barbecue place beside the adult video store'.   When I went with friends we got lots and lots of food, and the manager even gave us an extra complimentary dish. There's also the standard tea and kimchi before the meal. Great service and I've never had an order go wrong even though there may be a language barrier.  The selections are limited for me as a vegetarian, but just ask for the bi bim bap with no beef and you'll be in heaven. It's the kind in a stone bowl with the rice all crispy and golden on the bottom... mmm."}
{"text":"I have been to this restaurant more than 30 times and they always serve good korean food with great service. This is my go to place for Korean food. I especially love their BBQ table cooking and their soups.   On their menu, there are some alcohol combos that were written in Korean only. You can get real good deal with a Soju and a Seafood pancake."}
{"text":"Thanks Yelp for bring me to Todamgol Korean Restaurant!!   There are tons of Korean restaurant in the area and this one will not even cross my mind to come to eat here not because some of you yelpers been here and give it a 5 stars review.  There is NO English name outside the restaurant. It just has 3 big Korean Characters and \"Korean Restaurant\" in English. There are also a few Chinese Characters which are smaller in the window. Please be brave, just go in!!  The inside of Todamgol is roomy but quite dated. The tables are big though.. The one we were seated can accommodate at least 6 people with no problem.  The menu has Chinese/Korean and with English description of what each dishes are. Though with no photo depiction, one can order with no problem even if you don't read or speak a word of Korean.  Since we are have 3 of us and we are all sharing, we decide to order varieities of dishes to try out the menu. OK I decided.. because my fellow dining buddies Rana L, Janna and Sherry are all so easygoing!  - Spicy Seafood with Tofu Soup - Grilled Marinated Beef with Rice in Hot Pot  - Cold Noodles in Hot Sauce  The banchan has so much varieties. This is the only place I been to that offer so that offer so much fresh veggie in both their banchan and the main dish.  I though find the Cold Noodles are not as spicy as the other I have...but it is better like that then having it drain in hot sauce! Since they left a whole bottle of it on the table for us in case we need it!  The service is quick and friendly. I really enjoying visiting family run business like Todamgol when you can feel the positive vibe inside.  They do accept Mastercard and Visa and Interac.  BTW, it opens late till 1:00 AM on weekend and serves lunch specials too!"}
