{"text":"Toi, moi et Cafe used to be my favourite breakfast place in Mile End but upon my most recent visit they changed the menu and took off my favorite dish and also stopped serving their delicious baked apples with breakfast. The cafe au lait's are always great though."}
{"text":"We came here because we had planned to go to Mamie Clafoutis after dinner, however the service at the restaurant was so bad it was closed by the time we left (see review of El Gordo). Irked but still hungry for dessert, we stumbled upon this cute little cafe that has the aesthetic of an early 2000s Jennifer Aniston sitcom/romcom. You almost feel like she'd bump into Matthew McCoughney here, marry him, raise to kids, then bring their perfect nuclear familial unit right back to where it all started. 

We had the profiterole cake - was delish. Bunch of profiteroles artfully arranged in a web of chocolate mousse, berries, whipped cream, and chocolate drizzle on top.

As we mentioned before, the decor is a little confused - what is it trying to accomplish? Is it a pasta place? (There's a wine rack and daily specials to boot). is it a dessert place? (They've got dozens of cake varieties served by the THICK slice per day). Or is it, as the name would humbly suggest, just... a cafe? That's for you to decide the next time you swing by."}
{"text":"I enjoy the rich coffee collection they have and the wonderful coffee taste. This is a unique cafe' in Montreal"}
{"text":"A big fan of the Griffen Town / Little Burgundy area ~ Toi, Moi, et Cafe is another well crafted piece to the puzzle.

Atmosphere: Super.  Spacious, but busy, neat but bustling, Toi, Moi, et Cafe is a wonderful blend of activity and tranquility all wrapped into one.  Comfortable, yet unassuming, furniture provide comfort, while the seat arrangement allows for free movement yet is spaced in such a way as to make conversations further than arms length difficult to discern.  This allows for talk to be privately shared due to the crowding out phenomenons of many simultaneous conversations.  Well decorated and homely, this place is wonderful for early morning breakfast, mid-morning brunch, and even a late evening desert / coffee.

Service:  Bi-lingual staff are smart, well spoken, and extremely pleasant.  Hardworking, such that you are attended too quite often, without the need to ask.

Food:  A satisfying, yet concise, breakfast menu is sure to please many.  Portions are generous, and as a treat many dishes come with baked local apples with warm berry jam at the centre of their pitted core (literally, very sweet!).  Toi, Moi, et Cafe also has a delectable selection of deserts ranging from crumbles (apple & pear), to cheese cakes (carrot and raspberry), chocolate and caramel cakes, as well as a wide assortment of cookies (cranberry), muffins, and biscotti.  Do not under value the dinner offerings either.  The selection list is limited, but the dishes are very well done and appeal to a large variety of pallets.  A wine cellar provides plenty of vintages is also part of this place's charm.

Did you they take their coffee very seriously here? (check out their website!)

Love it ~ go & enjoy"}
{"text":"We have eaten at Toi Moi several times for dinner as well as breakfast. The food is very reasonably priced for Montreal and all of the plates I have tried have been excellent. The goat cheese sandwich is delicious, and the mushroom risotto is quite yummy! I have also tried the smoked salmon bagel which comes with a good side salad.

The only thing I will say is that at night sometimes they only have one server working. This could be okay, but sometimes he/she can get quite overwhelemed to the point where they do not have time to fill your water and one time they even forgot to enter/bring my friend's meal!

Overall, I definitely recommend this restaurant. The food is very consistent and the staff are all pleasant and helpful."}
{"text":"La Qualité a beaucoup diminué depuis plusieurs mois déjà.
Ils commencent à s'asseoir sur leurs lauriers.
Aujourd'hui, j'y suis passé pour voir s'il y a eu un changement positif, mais pas du tout.
L'internet est le pire pour un Café Montréalais.
Aucun souci du détail lors du service non plus. 
L'endroit est devenu super compact; et il fait énormément chaud.
Un Starbucks est devenu de loin beaucoup plus confortable que Toi, Moi et Café. 

Il est temps qu'un nouveau Café prendre leur place; surtout dans un quartier comme celui de Laurier Ouest.

G."}
{"text":"I have tried different items on their menu and have consistently been disappointed. French toast served either undercooked or barely battered. Fruit served on their plates is boring. Hell, they can't even get a toasted bagel right....
There are so many good places out there, why waste a meal here?"}
{"text":"Quite poor.  We came looking for a quaint French back fast place, this is a lowly American greasy breakfast hog feed (like Eggspectations) but expensive.  Terrible"}
{"text":"Been trying different brunch resto in MTL and this place just makes u feel like home, simple menu and the foods taste greatness, located in Mt Royal, they have a patio and the cappuccino was on point!"}
{"text":"Moi, Toi and Cafe is a great bustling breakfast place.  The service can be a bit slow, but it is worth the wait.  There are lots of food options and a full menu for coffee drinks which you can order in a latte bowl.  A latte bowl is, in my opinion, the perfect way to start a Sunday."}
{"text":"Went there to take a break and enjoy a little coffee with the girlfriend. I got myself a Irish creme Coffe wich was really good at a good price! Got something to eat wich was a cheese cake. It was really tasty and the size was pretty big for the good price of 5,31$!! Also I was very pleased that you could get free refill of coffe. Amazing and also relaxing. I would recommand for any student who wants a good place with good coffe to studies!"}
{"text":"I enjoyed this quaint and moody cafe. It also has a distinctly French vibe, which is great, especially if you're visiting. They have a delicious menu that's very affordable for the area. I'd recommend choosing one of their specials since they come with several other courses and a hot drink at the end. The menu items are often healthy and sometimes creative in concoction. And if you're a coffee fiend, you'll love this place since they roast their own coffee beans and a lot of their selection is fair trade. 

This is a great place to go for a late supper with friends or brunch with someone you've been wanting to catch up with."}
{"text":"I've only been there for tea (so far---but after one look at the dessert case, I definitely plan to return!) but they've got a wonderful selection of unusual coffee and tea concoctions, including \"banana split mocha\", coffees and teas with alcohol in them (grand marinier, frangelico, amaretto, etc.), a choose-your-own-flavor steamed milk or soda, the list went on and on. I didn't give it 5 stars only because the service was a bit negligent, but nothing that would prevent me from returning again soon."}
{"text":"Déjà que j'étais fan de leur gâteau aux carottes mais voilà que je découvre leur salade poulet/teryaki ! Waouh !"}
{"text":"Coffee here is surprisingly mediocre (except for some of the French press options). A full-service resto, with food that is just... okay. Open late, which is a plus. Popular with a much older and straighter crowd than all the great cafes in the area (of which there are many). A surpassed old-school cafe which has seen its day. You can do better. Dare to dream."}
{"text":"C'est un bon café, je n'y vais pas pour la nourriture, mais pour les boissons chaudes et les gâteaux ou les tartes. Une bonne ambiance ! Le soir il y a moins de monde et mes amies et moi étions dans le fond complètement, j'adore cette table parce que nous sommes confiner dans un petit espace ce qui rend le tout plus intime. Le serveur était très gentil et souriant !"}
{"text":"The coffee is good and the ambiance is ok. I don't pay with my debit card anymore in that location, but it's a good spot for an afternoon coffee or any early dinner in the neighbourhood.

2010- BE CAREFUL, I JUST FOUND OUT FROM MY BANK THAT MY CARD WAS CLONED IN THAT RESTAURANT. THE EMPLOYEE WHO COMMITTED THE FRAUD HAS EMPTIED MY ACCOUNT YESTERDAY. 

I thought I could trust that place, I have been there numerous times and everything was fine. I rarely use my debit card and only do in places I think I can trust. Unfortunately, an employee put a chip on the ATM machine, my card was cloned at the beginning of July and they used the card yesterday, along with many other customers cards."}
{"text":"J'adore cet endroit !!! Le café y est excellent!!
La carte offre pas mal de choix mais je reste toujours sur mon choix préfère soit les ufs bénédictine aubergine et fromage de chèvre !! Petite ambiance de café autant agréable pour les brunchs que pour un petit goûté sucré à 16h ;-)!
Ils proposent de très bon gâteau avec des parts bien généreuses !!
Je vous le conseille fortement !"}
{"text":"J'ai bien aimé y aller, mais on ne se sent pas toujours le bienvenu.  L'accueil est toujours étrange parce qu'on est entre les gens qui souhaite payer et au milieu de l'entrée.  Bref, en arrivant on a l'impression d'être dans le chemin.  L'ambiance est bien, mais pour travailler, je recommande d'aller ailleurs.  L'espresso macchiato est bon."}
{"text":"Good food, service slightly rude and long (took ~15min to get water and order taken), however it was a busy Sunday brunch- so maybe they were stressed.  Just wish they wouldn't take it out on customers:)."}
{"text":"Food was amazing!! I came here two separate occasions because it was THAT good. Ordered the waffles with chorizo and omelet chorizo with corn with cappuccino. Cappuccinos are delish but over priced. It was very busy so service was slow which is def ok because the food was worth the wait. Even tho it was slow I am still very happy with the service.  waitress made sure I was happy with my food."}
{"text":"Yesterday Mom & I went for brunch and it was the exception not the rule. It was pretty dead. Few servers and they were not on their game. Despite or perhaps due to the lack of a crowd service was way slower than usual."}
{"text":"\"Apathy and Indigestion: A Journey through disappointment\"

Tried it begrudgingly twice and never again-schizophrenically poor menu options and cold and lazily served food.

Coffee was good though."}
{"text":"Very bad service. The place wasn't even full when we came in but the waitress pretended to be busy with other things instead of seating us at an empty table, made us wait at least 10 min. Food wasn't great either especially for the price they charge. We asked several times for water and it never came until another server poured it for us. We asked for the bill after, and again, it never came, until we had to ask another server who told us to just pay at the counter. Needless to say, bad food, bad service equals no tip. It was our first breakfast in Montreal and good thing we tried other places or the city would have left us with a bad impression with this place."}
{"text":"Worst service ever. Took forever to get an order in. Understaffed. Unable to get basic condiments timely. Not friendly to English speakers. Tables and cutlery weren't clean. Food wasn't that good. Definitely not returning."}
{"text":"Iced espresso and an almond croissant. This was beyond most other placed but Toi Moi isnt like other places. So much yes bitterness absent and a flaky perfection."}
{"text":"I was here a few weeks ago after a Madeon concert in May. ANYWAYS Like other reviewers have mentioned BEST  hangover cure, hands down. The coffee is amazing! I'm not a coffee connoisseur, however you can actually taste the quality of the coffee. 
My breakfast was simple but delicious. I ordered a healthy style breakfast with fruits and a yogurt parfait. At the end of it all the bill was surprisingly cheap too, given the atmosphere of the café.
The reason I had to knock a star off a star was because the staff seemed overwhelmed by Sunday brunch rush. Never once asking if we needed anything. But I would go back, I love Montréal and I have yet to discover more of the Plateau"}
{"text":"What a cool little cafe in what is probably the hippest and liveliest neighborhood in Montreal. I was in very high spirits prior to walking into this cafe: the weather was absolutely beautiful and I was coming off of a long bike ride around this part of the city. I pulled over once I saw people eating and sipping coffee on the outdoor patio, so I knew I had to stop in. The people working here were very nice and helpful, and were ok with me taking a table to myself outside when all I wanted was to drink a cup of coffee and enjoy the nice day.  After sitting, I wish that I hadn't just eaten because the food here looked incredible- particularly the eggs benedict. I may stop in for a meal before I leave."}
{"text":"Okay so i thought i would write an update for this place ! 
Me and my girlfriend went there one month ago, her plate was cold (like if they just took it out of the fridge and didn't care about heating it up) and when she complained about it the guy just took the plate and it went straight to the microwave oven with the fruits and everything. We thought we would give them a chance, and for me chances are not something you usually get easilly but we where always satisfaied in the past so we gave them a chance. This time i had a hair in my plate. I noticed the cook was only weering a casket. No net! And unshaven !

This time its OVER !"}
{"text":"Such a pleasant place for brunch! They have great brunch dishes and large selection of coffee. The please usually nicely packed, with laid back patrons with their cup of coffee reading newspaper or thick Satre. The seating is tight, but cozy.
The food came in large plates, enough to really cramp the small table for two. The savory dish we ordered came with over cooked veggie, and dead poached apple, the sweet chocolate crepes loaded with whipped cream. Strangely they were great!"}
{"text":"We were served the wrong plate, which is fine, but when they brought back the correct omelettes, they did not reset the plates. The potatoes were stone cold and my wife even had the rind of the melon she ate before she realized it was the wrong omelette. Truly half-assed. And the bathroom was in a very, very bad state, toilet seat broken and absolutely filthy."}
{"text":"Great breakfast- cook refuses to do hard boiled eggs or poached hard eggs... That was frustrating- but once breakfast arrived me and my crowd were pleased!"}
{"text":"What a mediocre brunch for $20. Potatoes were saggy, eggs were ok.  Hollandaise sauce, mediocre.  And the chef really skimped on the smoked salmon.  

What's more, there was a strong smell of  lacquer, like some was doing auto body work next door!  It was a horrible and all the management said was sorry, but charged us just the same.

I won't be recommending this place anytime soon."}
{"text":"Great food and coffee selection, a little on thr pricy side though. I had a cafe mocha and eggs benedict for $21.50. Great service."}
{"text":"Definitely not what I expected, I always thought this place did coffee with some paninis and side dishes, like Presse Cafe or Cafe Depot.

This is more of a standard resto that serves steaks, pastas and fish. 
Seeing as how there are many coffee shops nearby, they have to offer a bit more than the others.

But there\"s also people that come for coffee and dessert only and sit there with their laptops for hours. The place is a bit small and packed, there were only 2-3 waiters on a Saturday.

The food was above average, the Bison Burger with Brie Cheese ($12) was very filling, I didn't eat for the rest of the day. It came with a bit of potatoes and a limp green salad. My friend had pasta with chicken Kiev (14), which came with some vegetables, the chicken was a bit dry, but the dish overall was  quite good.

Now, onto the coffee: The Cappuccino was heavenly, amazing and under $3, this places specializes in coffee.

At first glance, the food menu can look expensive, but it's actually not that bad considering what you get, and it's in a pretty upscale part of town, classy stuff."}
{"text":"Three reasons why I can't give it more stars:

1) With the Sunday morning rush my food was sloppily place upon my plate and served to me.  It did not look appealing.

2) Their inability to control how customers arranged seating during Sunday rush.  By the end of my meals I was bumping elbows with a group who squeezed in.  The server apologized to me afterward. 

3)  With the Sunday rush no one asked me if I needed anything, if my meal tasted alright.  I was served and left with the bill.  That happens to me at McDonalds.

Why did I give stars:

1) The environment is awesome and it feels like a real café.

2) Friendly staff.  If it was not the Sunday rush I'm sure I would have been taken care of very well. 

3) Despite the presentation of my food it was delicious."}
{"text":"Toujours très bon ce resto. J'adore leurs bols de chocolat chaud. La fds dernière nous avons commandé les oeufs béné avec jambon sur muffin anglais grillé servis avec fruits (ananas, melon d'eau et cantaloup) et beaucoup de sauce hollandaise, et aussi la tortilla déjeuner aux oeufs avec fronage, salsa et piments. Les deux assiettes sont servis avec des pommes de terre légèrement épicées et des \"bines\" en plus des fruits. Trèsbien situé; tout près du Marché Atwater."}
{"text":"We found this place through Yelp while visiting Montreal for Osheaga. For a monday morning, it was lightly filled with customers, and offered great breakfast options and nicely crafted coffees. 

It seems that the cafe becomes a regular dinner spot in the evenings, and by the look of the menu posted on the wall, I'd have been happy to return later that night, if not for getting on the train shortly after we left the cafe! 

Service was good, service speed was quick, and I would come back again."}
{"text":"I've been to the Toi, Moi et Cafe near Atwater, and I was happy to find another location on this trip to Montreal, close to where we were staying. The patio is narrow and intimate, but offers a nice view of the street with awnings to help beat the heat. 

Service is good, food is great, coffee is outstanding. I'd be a regular if I lived in the neighbourhood!"}
{"text":"Location: Notre-Dame West

Eats: Since I was going to be checking out the first restaurant on my #TasteMTL list later on, I opted for a Macchiato and a croissant. The Macchiato was strong as all hell and I'm surprised I wasn't bouncing off the walls by the time I was done. It was a little bitter but overall, decent. Have I had better? Yes. The croissant was fine - fat and crispy on the outside, softish on the inside. Nothing to write home about.

Service: First, despite the sign that says someone will seat you, we seated ourselves because no one bothered to greet us. The place wasn't full but the service was slow and the staff seemed uninterested in its patrons. Furthermore, this has got to be the clumsiest wait staff in all of Montreal! Not only were dishes dropped and broken on two separate occasions, but one waiter actually dropped a fork down my back (the wrong way - prongs scratching and all) and didn't even bother to apologize. Seriously? How the hell does that even happen? Really not impressed with these people. Not to mention that every time they walked behind me they would hot my chair - there was plenty of room between me and the person behind me, to avoid doing that. 

It's a cute place but would I go back? Probably not."}
{"text":"Came here on a Sunday morning. Place was relatively empty but wasn't completely quiet. I decided to order a soy Chai Latte and the Forentine Omlette. Both items were lackluster. 

The Chai Latte tasted weak and milky. Wasn't memorable at all. The omlette was burnt, tasteless and oily, and reminded me more of a fried egg than an omlette. The potatoes were much like the omlette -- very oily and underseasoned. The fruit was the only saving grace but even that had a hair in it. I informed the staff about it but all I got was a sorry and nothing else. Service wasn't the best.

I probably wouldn't come back given the chance and it definitely wouldn't be a place I'd recommend to my friends for breakfast/brunch."}
{"text":"Great place to start the day before heading to Marche Atwater near by next door.  Ambience and Coffee is superb. However, the service is so so and the wi-fi connection drops in and out.  The manager did not have any intention of resetting it.  She wanted us out soon as possible.  Nevertheless, we were there to stay to snap pictures back and forth and get a sort of a high courtesy of the strong latte coffee.  

The omlettes' side offerings are always a pleasure to nibble at.  The diverse baked apples and honey-glazed peaches provide a wonderful side addition.  Have to admit, I always have to make a stop at this favorite haunt every time I find myself in Montreal.  This place, Toi et Moi provides for rich and exceedingly warm sentments.  And it has become embedded in my psyche I am afraid."}
{"text":"My favourite breakfast spot in all of Montreal. The food is consistently good, the coffee is delcious, and it has a nice atmosphere. The best time to go is in the summer when you can sit outside on the terrace."}
{"text":"Came here for a Saturday morning brunch with a friend with our children.  Nice atmosphere. Busy but not in a way that disrupts the service or the ambiance.  Nice variety of food on the menu with lots of choices for everyone.  Good coffee (a must when it's early ;) ). Lots of street parking around. Will definitely come back"}
{"text":"Yeah, super average. I was starved so I got the breakfast burrito...there was just a really striking absence of any flavor at all.

Hubs got the salmon bagel with salad. It was all very sad looking and wilty.

On the upside, we both got the filtered decaf coffee and it was good.

Looks like they have an amazing selection of cakes, so if I were you, I'd steer clear of the food and just enjoyed some torrifacted goodness and treats.

Other upsides: service was good, and ambiance is nice."}
{"text":"Luxurban! This is the word to describe this fun, hip new cafe in Rosemere. The food is pretty good and the decor makes you want to settle there for hours. They have a great selection of coffees, meals, desserts. No chance to get bored with their menu!

Little downsiders:
1-Often full on week-ends, so arrive early (unsure if they take rsvps)
2-A little pricy if you juts want to go for a simple cup of coffee

Miam! I'm a fan!

---

Luxurbain! Voilà le mot que j'utilise pour ce nouveau petit café installé dans le coin. La nourriture est bonne et le décor vous y fait déménager pendant des heures. Ils ont une grande sélection de café, desserts, repas. Aucune chance de s'ennuyer avec leur menu.

Deux petits \"ouch\":
1-Souvent très occupé les fin de semaien donc arrivez tôt(pas certaine si on peut rsvp)
2-Une petite touche chère pour la simple coupe de café régulière

Miam! Je ssuis fan!"}
{"text":"we looked for an awesome breakfast foodie restuarant.....toi, moi et cafe....you were great......thanks."}
{"text":"Et en été, belle découverte des laits frappés, de vrais desserts bien préparés et copieux; Des biscotti extra grands. Et des assiettes brunch, copieuses et fraîches."}
{"text":"When we first started going to Toi, Moi et Café, we kept getting the same server and he was a bit clueless and slow on the uptake. BUT I have probably been there 50 times since and that includes both locations and find that the service is generally really good. The service at Notre Dame seems a bit better but I think that is becasue the space is larger and more serviceable.  
I think that this grey area of wanting to be a Coffee shop that is also a restaurant is difficult. But everyone here in Montreal tries to do that to varing degrees.  Frankly I don't particularly like the idea that well. Just because you make great coffee that does not also mean that you know how to run a kitchen. Their food is good but it is inconsistent. In fact I'd have to say that the food is a bit pricey for what you get. They do not put cheese on breakfast dishes that almost demad it. You sometimes get a big pile of potatoes and you sometimes get what I would serve a small child. Sometimes they are cut the same sometimes not. They also work the Cora formula - fill the plate with a bunch of low cost fruit garnish to make you think that you're gettng a lot more food than you are. This approach turns out to be a pain the butt because their tables are tiny and you run out of space to put all the crap you don't want messing up the flavors you do want becasue they GO WITH COFFEE. Melon and pineapple do NOT go with coffee...
What they should be doing is working on a strong and delicious selection of items that GO WITH COFFEE. Because salad does not go with coffee; unless it's fish salad on a bagel. There are a bunch of pies, tarts and cakes but you don't know what they are without sitting there and describing them to the waitress to figure it out, maybe they could put labels on them? I don't understand why they don't have a really great croissant selection? 
That's some constructive criticism because I hope they have many years of success. The coffee is the best in Montreal."}
{"text":"Toi, moi et café est un café avec service, où le café et les gâteaux sont bons. J'ai souvent fixé des rendez-vous professionnels à ce café, et les serveuses étaient courtoises. La présence d'un réseau Wi-Fi est aussi un atout. Pour dîner, le café offre un menu un peu coûteux compte tenu de leur simplicité. Cependant, je doit dire que j'ai adoré leur hamburger au fromage bleu."}
{"text":"I've been here for both brunch AND dinner! I had no idea they also did dinner until I was going around trying to find a decent place to eat around the area. 
Brunch isn't particularly special, it's just any typical brunch, eggs, toast, sausage, potatoes, bacon etc etc it's decent, but I've had better brunch elsewhere. 
Dinner is surprisingly good. A little misleading on the menu however, so be warned, you might want to ask them what exactly is in the dish. I ordered the chicken with goat cheese sauce, turns out that it was a pretty big portion, but the majority of the dish is actually pasta, and there is two pieces (be it, large pieces) of chicken and some veggies. It was still pretty good though, the sauce was quite tasty and creamy, but also heavy, I wasn't able to finish the whole dish. 
Also, there are things on the menu that they don't actually have available! We had wanted to try some of their amazing sounding desserts, but then when we asked for them, we were told that they didn't actually have any of those desserts, or any of the ice cream milk shakes... which makes me wonder why are they listed there in the first place? 
However, they do have a large selection of cakes and pies that you can look at in the glass counter and pick from, and we had a piece of a cream puff chocolate mousse cake which was pretty good. 

All in all, the food is decent, the wait staff are nice and friendly, but just be careful with the menu as it might not always have what they listed, and what they list might not be exactly what you expect (not necessarily in a bad way)"}
{"text":"Seriously disgusting! The apple cheddar caramel crêpe is a disaster. How can you make something with those ingredients and make it taste so bad??? Second time I've been there and won't be returning. Honestly, I've never witness a service so unprofessional. Waiters laughing at customers... not even discretely. You have to arm yourself with patience because you will wait for your food longuer than acceptable. It comes out cold or not as warm as it should be."}
{"text":"I bought a coupon online for this café less than a month ago. The last day of validity of the coupon was actually FIVE DAYS BEFORE the expiry date mentioned on it. When I realised that, I tried to see if they would extend it for just a couple of days.

The person I got on the phone was extremely rude. She told me I should have just come earlier, and did not care at all about the expiry date being wrong. She even declined to give me a refund instead.

Clearly customer service is far from their concern, so be warned."}
{"text":"AMAZING specialty lattes and mochas (the baklava latte = WOW!). Largest selection of beans I have seen to date in a coffee shop. Didn't try the food but the laid back environment did not hinder service at all. Would definitely recommend."}
{"text":"Stopped into Toi, Moi et Cafe on a Friday night because we were early for our dinner reservations. I had heard they have the best coffee in town. Unfortunately, i am not a coffee drinker and it actually HURT that i couldn't order an \"Honore de Balzac\" brew.

The lights were just the right soft-yellow. The wait staff was friendly, helpful and bilingual. I HATE when a waitress gets all flabberghasted when i ask \"what would you recommend with that?\" Rather, she gave me a breakdown of the benefits of each option. I appreciate when an employee has actually eaten the place's offerings.

Toi, Moi et Cafe has real food. We didn't order it. Instead, we got a The Laurier (Black Tea, Grand Marnier and Fragelico with whipped cream on top). The whipped cream was PERFECT. We compared the taste to Christmas gatherings. It was smooth and decadent.

We opted for a chocolate-dipped biscotti from their many options. I love the texture of biscotti and this one was just right. Unfortunately, chocolate-dipped means only about two inches of a rather long biscotti. A little more chocolate would have been nice. It was not the best biscotti, but it was a good one.

The chairs were comfortable, the tables clean and not woobly.

I recommend."}
{"text":"Although the prices are a little above what you would except, they still offer a variety of food, drinks and not to mention a whole selection of cheesecakes! 
The lattes are quite delicious and not to mention the shrimp salad on a bed of mixed greens with balsamic dressing! It is to die for!"}
{"text":"Awesome all around !!!

Great coffee, great staff.... Amazing chocopecan amongst other desserts. Definately recommend"}
{"text":"This place is awesome, i went there many time with my family for brunch. I use to go there with my study buddies when I was in school. Great place, great coffee, great staff! 

It's the kind of place you'll always go back!"}
{"text":"De style bistro, offre une grande sélection de cafés. Vous pouvez les déguster de plusieurs façons: espresso, piston, filtre. Pour vraiment goûter le café optez pour le café piston. Aussi, un café équitable du mois (version filtre), c'est une excellente façon de découvrir de nouveaux cafés. On y offre les classiques du déjeuner et des choix dîner. 

Ma recommandation est le soufflé au fromage Le Fleurmier de Charlevoix et pomme, service avec la pomme farcie, des fruits et du pain baguette (au choix). Le soufflé joue beaucoup sur les subtilités gustatives des différents ingrédients.  À noter que le soufflé nécessite approximativement 20min à préparer.  

Un petit conseil, la fin de semaine ce resto est très occupé, arrivé avant 11h ou après 13h, sinon il y a habituellement une file. En semaine, c'est un bon endroit pour flâner avec un café et un livre."}
{"text":"After attempting to get into Griffintown Café and not getting seated due to short staffing or whatever it was that was going on there, we left and ended up at Toi, Moi et Café. The place was super busy and we did have to wait a bit for the food but to their defense the place was full so we didn't mind. We both enjoyed our food and the staff was apologetic about the wait and were very nice. Will definitely go back. Also their coffee is really good and the prices are decent too."}
{"text":"Love this place! I always get the latte and it's perfect every time, as for the food it's okay nothing special, the dessert is better but the cheesecake always kinda tastes a bit off. Other than that super cute place with great coffee :)"}
{"text":"First of all, we were to a bad start since they didn't serve Mimosa on a Friday morning. The food was good, we had the eggs benedict which was excellent but I didnt care much about the souffle with cheese from Charlevoix and apple. We could barely taste the cheese let alone the apple. The service was ok.
The place looks good, roomy and clean. Great location and plenty of natural light."}
{"text":"I have to say, WOWW to the coffee. Good for hangovers, cure for sleeping, it literally wakes you up within seconds. I loved it so much that I even got some for home. As an probably coffee addict, this one is the only coffee that works on me to make me alert and awake.

We went there for a really really late brunch, and I had the cosmopolite(2 eggs, choice of bagel/and tons of toasts), ham, bacon, sausage, beans, potatoes, fruits! It seems like its huge, but its not that big portion, but its not small either. The price for what you get is pretty good I'd say. The reason i gave 4 stars instead of 5 is that their service was not good, the waiter was very slow, and everything took time. Nevertheless, I'd still go back here for the coffee and food."}
{"text":"Un bon endroit pour déjeuner et/ou prendre un café sur la charmante rue Laurier. 

Belle variété d'assiettes déjeuner proposée. Le service y est sympathique et efficace. Prix raisonnables.

Ils ont leur propre café torréfié \"Toi, Moi et café\". 

À 10 minutes du Métro Laurier à pied."}
{"text":"TLDR: Great space to have a coffee, or a bite, with friends or to get work done

I have been many times to this cafe and it doesn't disappoint. There smoothies are yummy as are their coffees. I recently had their chai latte which made me super warm on such a cold day.

When I know I need to work late, and in that area, it's the first place I think of.

I'm always super tempted to order one of their plates when I'm there, and I know I will sometime soon.

Overall it's a great place to chill with friends, colleagues, or when you're flying solo."}
{"text":"Once upon a time, Toi Moi et Café used to be good. In my experience anyway. This past year things have been going downhill however: Frequent lack of menu items, burnt food and an increasingly flaky service oblige me to scrape off two stars from my previous generous rating. It's unfortunate, I used to love the place...

To illustrate my point, a few colorful examples include:

The time we went and they didn't have three out of four items my husband asked for on the menu. No milkshake? Alright, a lemonade. There's none either. How about an iced tea? Nope! Okay, coffee then. Well, that they had, at least! 

The time we ordered a black burnt crème brulée. I called the waiter over and tried to explain that a crème brulée is not supposed to be \"literally\" brulée, but that the top is supposed to be a candied hard surface. He brought it back to the kitchen, only to come back to us a few minutes later claiming the cook had said it was how it's supposed to be made, that she was right and we were wrong. She's the only cook in the city that makes a charred crème brulée, but you know what, she's right! Oh well... We have never ordered this dessert we love so much there again.


There's one thing that amidst the storm remains consistent at Toi Moi et Café, and it's their coffee. It's always good. There's still hope."}
{"text":"I love this place for Breakfast but I was in for dinner tonight and I have to say I was disappointed in the level of service I received. I ordered a sandwich and a beer, the waitress brought me my beer and never brought me my sandwich, I waited over 40 minutes. Then when I got up to leave and pay for my beer, I was told I couldn't buy just a beer I had to have food with it. I sat at my table waiting for my food and the waitress never came to ask if I wanted anything. I'm sorry to say that as good as the service is in the morning  for breakfast the evening staff need some training in taking care of a customer."}
{"text":"Very good restaurant. Pleasant atmosphere, good service and delicious cappuccino and crepes. Would defiantly come back"}
{"text":"We stopped by for dessert and I went with their Ferrero Rocher cheesecake and a cappuccino. The cheesecake lacked the hype I hoped it would have delivered, honestly it didn't taste very fresh.The cappuccino was good.

The service was friendly and attentive. The price-tag is on the high side but they serve this type of stuff, so you should know what you're going in for so a few extra bucks shouldn't turn you away. I'd be back one day but I'd certainly try another type of cake."}
{"text":"Service is slow and our waiter wasn't friendly. 
I ordered the fresh fruit platter with granola and yogurt. I was really disappointed because all I got were a few slices of cantaloupe, honey dew, pineapple, few grapes and one kiwi. Considering strawberries, blueberries and raspberries were in season, there could of been more variety. 
My boyfriend is more of an eggs and bacon type of guy, so lets just say his white toast was the best part of his meal. 
Definitely not worth the price, so we will likely not go here again."}
{"text":"Beginning first with le cafe, something the French Canadians certainly do better than the French French, Toi Moi et Cafe would start the visit off right as we arrived from Ottawa low on caffeine but with big plans for the day.  A small cafe near to our lunch destination of La Chronique I entered TmeC with modest expectations only to be greeted by a wall of coffees and teas plus pastries, sandwiches, and soups made to order.  Decidedly Francophone in dialect I approached the coffee counter with a bit of trepidation only to find ordering simple as they had one of my favorite beans on roast - a rich Ethiopian Harrar full or deep earthy notes and sweet cocoa tones for $2 that would lead to me returning two days later to pick up two pounds for the ride home."}
{"text":"The service was really bad. Ordered pie and it took 30 minutes for the waiter to bring it because he kept forgetting, had to remind him twice."}
{"text":"Belle place, pour déjeuner/bruncher, si vous êtes dans la Petite-Bourgogne, bon service & belle assiette, je recommande fortement ! Leur café est vraiment bon,de plus, ils ont différentes sortes de café que vous pouvez acheter sur place."}
{"text":"Excellente place sur Laurier Ouest, au cur du Mile End. Une grande terrasse abritée pour les grosses chaleurs, un service rapide, des assiettes (très) copieuses et un café délicieux.
A la carte des brunchs classiques : bénédictines, gaufres, crêpes, ufs... servis avec une plus que généreuse portion de fruits frais et patates rôties.
Un peu loin de chez nous mais j'y reviendrais avec plaisir, cette partie de Laurier est une mine d'or pour le magasinage et la nourriture."}
{"text":"Ce samedi matin, j'ai commencé ma journée avec un bon brunch au Toi, Moi et Café avant d'aller faire mes courses au Marché Atwater. J'étais plutôt dans un \"mood\" pour rester santé, tout en mangeant assez pour me soutenir presque jusqu'au souper. J'y ai trouvé une assiette parfaite, la Gauloise si je me souviens bien. C'était une omelette ouverte avec fèves aux lards, patates rôties, beaucoup de fruits frais et une petite baguette. L'assiette est aussi venue avec une pomme farcie d'un liquide aux fruits que j'ai apprécié, mais avec tout le reste, je n'ai seulement eu assez de place que pour en prendre une seule bouchée. Elle donnait l'impression d'être suite mais elle était froide.

J'ai bien aimé leurs cafés. J'y suis allée avec le latte qui était chaud sans être brûlant et balancé parfaitement pour ce qui est de la portion espresso versus lait. J'y ai vu quelques personnes avec leurs laptops qui profitaient du wi-fi gratuit mais puisqu'il était encore assez tôt, les familles prenaient la plupart de la place du café. Ça m'a quand même donné le goût d'y retourner une autre fois pour y travailler et essayer un autre de leurs cafés aromatisés (il y en a un à saveur de Baklava dans le menu).

Pour les enfants ou simplement ceux qui aiment colorer, si je me fie à la table voisine, il y a des crayons cires sur demande."}
{"text":"Comme tous les autres Toi, Moi et Café en ville, celui-ci n'est pas si différent. Un bon endroit pour manger un brunch, même en plein milieu de semaine. Par contre, j'aime beaucoup le décor et l'éclairage de cet endroit en particulier. La terrasse qui est couverte de neige en ce moment me fait rêver de l'été. Si vous avez lu mes autres avis, vous savez qu'en ce moment, terrasse rime avec été et j'ai vraiment, vraiment, vraiment hâte que la chaleur revienne!

J'y ai été pour une courte rencontre donc je n'ai pris qu'un café, un latte, et il en valait la peine. Habituellement, je trouve que les cafés dans les chaîne sont \"so-so\", mais Toi, Moi et Café est une des rares exceptions. Il est super bon, corsé sans avoir d'acidité en arrière goût. Et j'adore les tasses, surtout le bol qui a une poignée, un peu comme une tasse ordinaire de proportion géante! Le service est très bien et on remplissait nos verres d'eau assez régulièrement que je me suis arrêtée à moitié chemin en route pour la maison pour me trouver une toilette tellement on m'a tenue bien hydratée!"}
{"text":"We were quite cold and hungry and hoped to find a place to thaw our toes at Toi et Moi. We arrived at 3 pm and thus just in between the brunch and regular menu times, and food was a little hard to come by. In the end we had to wait over an hour for simple dishes (soup & hot dog). The food was quite nice, so was the coffee and tea. But the long wait and having to remind the service repeatedly of our existence makes this only three stars."}
{"text":"Toi & moi cafe never disappoints. Much better than the chain breakfast places. Coffee is excellent. Again much more flavourful than the starbucks, second cup, etc... Prices are very reasonable and good selection of both sweet and salty breakfast dishes. Enjoy! PS: we should have a T&M in the west island."}
{"text":"The service here is fine and their various coffees and chai tea are ok. Unfortunately, I came w my family for brunch and the food left a lot to be desired. We ordered crepes and a raclette the dish. 

Regarding the crepes: we had the one w caramel, Apple, and nuts. Didn't see many nuts (not an issue), but the caramel was far, far too sweet (much more so than a typical caramel). As s result, the taste of apples was overwhelmed. Interestingly, the crepes themselves were ok on their own. Best go w something simple in the crepes front.

Regarding the raclette: there may have been one slice of raclette cheese in the dish so I feel misled by the menu on this one. The dish was potatoes, onion, asparagus (if I recall correctly), a poached egg, and a hollandaise sauce. None were executed well and the hollandaise was extremely bland (the opposite problem of the caramel above). Very dissatisfied w this dish.

Not sure I'll come again. Probably not given the large number \"certified-tasty\" options for brunch nearby.

Update: Ended up coming again recently (not my choice). Sadly, the food was still bad. The service was noticeably worse than last time as well. Given the already poor rating/review, it probably isn't necessary to elaborate though."}
