{"text":"We used a deal of the day coupon here that was $34 for $72 worth of food, boy was I fooled.

I thought you could choose up to the maximum allotted for our food, no we were choices that were bare minimum.  You were given a certain number of colors of plates of sushi.  But overall the colored dishes of sushi off the moving belt were really overpriced.  

We were limited to only one red dish and everything that looked good was a black dish which we were ineligible to get.  

At the end of the dinner I added up our total but could not figure out how they arrived at $72, I was told that the Miso soup and salads were not included with the main dishes.  What a rip off since Miso and salad are usually part of a main course.  The salad wasn't that great either.

Do yourself a favour, save your money and don't bother coming here even with a group buy coupon."}
{"text":"I totally agree with Elame G as I also used the deal of the day coupon that was $33 for supposedly $77 worth of food, and I still feel a bit ripped off even though in total I paid $33 for the deal + $7 of tips!  For a downtown sushi place on Yonge street, I was expecting better quality than the sushi I've had outside of downtown.

Basically the deal allowed you to take a pre-determined # of plates from their conveyor belt of different colors.  Something like 3 yellows, 2 red, 2 green and 1 blue.  First of all the variety on the conveyor belt sucked... After watching the same food going around and around, we kind of settled on some due to a lack of time.  Each plate only had 2 or 3 pieces, so altogether, there was maybe 20 pieces of sushi.  Looking at the menu, which seem to have sushi at about $1 per piece, that would make that worth maximum $20, since a lot of the plates were with cheap cucumber/veggie sushies.

In addition, the deal came with 1 edamame, 1 Tempura Appetizer(4-5 pieces), 1 Seafood Udon(not great, maybe 3,4 pieces of seafood), 2 miso soup and salad, 1 glass noodle (plain, not much in it except noodle).  All the portions were fairly small/medium even though some of them say large.  


I was pretty much disappointed with almost all the dishes.  The only one that did ok was the dessert, which was ice cream tempura, which was at least different and tasty.

Altogether, I can't imagine anybody would pay $77 for all this on regular price when you can go to a sushi buffet that would have much better quality and selection for probably half that for two people.

I don't think I'll be visiting Toko again anytime soon."}
{"text":"I had walked by this place many times, but today I was desperately hungry and they were advertising a Korean Chopped Steak special for $8 so I thought I'd give it a try.

Service was admittedly average from the get-go. The noon-day sun was brightening up the place, and I can't complain about it's appearance. I can complain about the food though!

I ordered a Bulgoli Lunch Special with Salad, Gyoza, Rice and Jap Chae ($8). It also came with the smallest amount of Ban Chan I've ever seen. The sprouts tasted strange, my partner says the kimchi was fine, and I was alright with the pickled radish.

The Bulgogi didn't taste of much besides onion, and was somewhat mealy in texture. I'm spoiled by Buk Chang Dong Tofu (amazing Bulgogi and cheap beer, get a Hite)

My partners Egg Raman($7) looked exactly like it had come from an instant pouch. It was a large bowl and he enjoyed it enough, but the resemblance was really unnerving. It came with some passable salmon sushi for an extra $2 for a total of $9.

There are so many Japanese and Korean restaurants to pick from in Toronto, don't waste your time here!"}
{"text":"Bijan V. said it all pretty well. Toko is good, not great, and there are 100s of other sushi joints in the city that are better / cheaper. Something that will always get me excited though.. 

.. the sushi conveyor belt! Can you think of anything better then seeing sushi train by you? I can't! Choo choo.

PROS:
-Moving sushi entertainment
-Nice staff
-Not terrible food
-Chop sticks are stored in a drawer at the table, cool!
-There is also a tea cup conveyor belt and hot water tap at the table, double cool!

CONS:
-Nothing new
-Slightly higher prices
-Staff has to turn on the table side hot water tap for you. I was really looking forward to burning myself."}
{"text":"The food is okay, though I'm not too sure about the sushi.  The service was not the greatest. I clearly pointed out the vegetable tempura on the appetizer section of the menu and he came back with the dinner option which was nearly double the price."}
{"text":"Toko Bistro and Bar is one of my favourite sushi restaurants. It is so delicious!  They have a sushi conveyor belt that brings out plates of 2-3 pieces of sushi or around 3oz of meat/tempura.

Tip:
When going reserve a table along the conveyor belt so you receive the full experience and taste multiple sushi items as they come around.

Very affordable and an experience you will want to try at least once. =)"}
{"text":"Its funny how groupons can really bite a business in the ass! Seem like Toko incited a lot of negative reviews this way. Well, I've been going to toko every once and a while for a few years now. Something about this place causes my husband and I to get Toko cravings. The moving conveyor belt of sushi is really fun (even if just to look at), and both my husband and I have our favourite dishes that we often like to return to. He always gets the seafood dinner (i forget the exact name), and he's ordered the same thing at many other sushi restaurants. Toko however, always comes out on top, with a nice quality of meaty seafood pieces to enjoy. I definitely think that if Toko is the best sushi spot in the this neighborhood, and the prices are reasonable. If you're looking for bang for your buck sushi, go to New Generation on Bloor. If you're looking to sit back and enjoy a meal that's lovingly prepared and not overly pricey, go to Toko."}
{"text":"I have avoided this place for a while due to the bad reviews here on Yelp.  But when other places in the area weren't open at 5, we headed over here to try our luck.  I was pleasantly surprised!  Was the sushi the best I ever had? no.  Neither was it the cheapest.  BUT....it was high quality fish, and pretty reasonable prices.  Overall, pretty good.  They also have a large selection of Korean items.  Dolsot bibimbap was really good. 

The service was also really great.  There are a lot of reviews on here talking about the poor service, and maybe it's because we were there at 5....but the service was attentive and quick.  We got our orders taken quickly, and our food came out quickly as well.  The service is what sealed this in as  a four star review as opposed to a three.

Overall, not the best sushi in the area, but pretty good, and reasonable priced."}
{"text":"Toko has Groupon to thank for my visit. Otherwise, I would have continued to walk past this place without regrets. It's probably the only Japanese restaurant in Toronto with a Sushi conveyor experience but the lack of customers causes the food to be left sitting there, on the belt, revolving round-and-round until its dry.

This place isn't cheap either. I had a deal for a 2 man dinner which was enough food but was not worth the everyday price. The sushi-go-round was no incentive either.

The selection is also very limited. 3 levels of sushi, each indicated by a different color and rise in price as the size of the roll increases. The food is not good to say the least. After air drying for who-knows-how-long, the items would be something you would regularly return to the waiter and ask for a new serving. 

The other items not served on the belt are fine. Nothing special again, but are edible and filling.

Overall, avoid this restaurant. If it's sushi you want, keep walking south and try Sushi Supreme. If you want to desperately try sushi off a conveyor belt, buy it from another Japanese restaurant and place it on the escalator rails. That's a bit more enjoyable I think...

Why am I so bitter? haha."}
{"text":"Ive been here at night and the place is packed  The sushi conveyor was not working at lunch today unfortunately, but the black dragon roll I had was great. Very affordable little neighborhood sushi place. Since this is the first time I've been here for lunch, they could do with a little cleaning."}
{"text":"Made a reservation for the past Friday night and expected a table right by the conveyor belt, but upon our arrival, they had given our table away (mind you, we were not late at all). They still had other tables available, which was fine but not ideal, so we just ordered food directly off the item.

The conveyor belt was a really cool concept, but they didn't have many choices on the belt and it was pretty obvious that the same plates were just circling around. The food was delicious (they had Japanese and Korean options) a bit pricey considering it wasn't spectacular.

I do have to say that the wait for our food was quite long and many options were unavailable, such as the kimchi gyoza and some of the domestic beers (which is surprising for a Friday night). 

All in all, it was a decent experience, this wouldn't be my regular spot, but definitely worth checking out once."}
{"text":"It's misleading to say that the food was good. I am not saying it was horrible neither. Just that my intention was to go there for the conveyer belt but the food on there didn't seem fresh. Despite that, they are about double the price in comparison to ordering from the menu, which means getting the chef to make it fresh is more economical. I must say I was a bit disappointed because the visit ended up being like at any Japanese restaurants. The conveyer belt? Was just another piece to the decor."}
{"text":"Pleasant service and the conveyor belt is a novelty, but that's where it stops. Sushi is mediocre though still fresh; didn't have the draught sake we wanted. In the end, I think the problem is that it's just far too overpriced for what you get... I'm assuming that the cost of the conveyor belt will take a while to ammortise... and is just out of place from the quality of food and the experience."}
{"text":"Toko is a clean Japanese (probably run by Koreans given the menu - they have Kalbi and Bulgogi too) place with a Sushi-go-round as well as a full menu of sushi, entrees, noodles, etc.

Price is just a teeny-weeny bit more than other places that have the same type of food but I was pleased. The tempura was fresh, bento's came with gyoza's which was a plus. The food overall was decent but again could have had the same thing at 100+ other places in the city.

As for the sushi-go-round, prices come out to appx $1/piece of sushi and they have a wide variety of foods to try from (although I wasn't tooo impressed - it seemed you could have gotten most of it from the menu for a bit less)"}
{"text":"Didnt expect too much from this place because I find that so many restaurants on this part of Yonge St is just overpriced and bad. 

got the egg spicy ramen and bento box with beef teriyaki.

The food was decent but not worth the price! If you're in the area, this is an okay choice."}
{"text":"Went here today for lunch as part of a work group. They do have the conveyor belt here , but we were seated in an area that didnt have it running so we didn't try the food on the belt. 
We ordered the sushi & sashimi boat along with edamame, cali rolls, unagi maki and shrimp tempura. The fish quality was quite good and it tasted fresh. It still had that \"washed with water\" feel to it that I don't get at sushi places near the coast. The portions were slightly smaller but then again they have to pay yonge street rents with moderate pricing on the menu. overall i would go back if i was in the area, but probably wouldn't make a specific trip to this restaurant."}
{"text":"Food here is pretty good - I especially love the French Kiss and Viking rolls... Good service and decent prices as well..."}
{"text":"The food here is good, not the BEST but good.  We came here relatively early and I'm glad I came here at that time and got the waiter I did.  He was probably the best waiter I've ever had in my life, very funny and relatable.  It does get VERY busy around 7pm and I saw my waiter less and less but he did still come and check up on us. 

Food was good, nothing really stands out to brag about and it can add up.  We had a coupon that allowed for $80 dollars of food I believe and we ate more than that, thinking that it would be hard to eat $80 dollars worth of food.  

I know we go to eat at places for the food but service is a huge deal to me as that can make or break my meal.  And at the end I think I left a 30% tip.  He was really that fantastic, and I usually dont leave great tips....(read my masa review)

Cost: 2 people $100.
Food quality: 3.5/5
Food quantity: 4/5
Service: 5/5

Would I Go Again: It's a little expensive for sushi, if it wasn't on my dollar 100% I'd go back...but on my dollar I'm not sure."}
{"text":"I waited 10 min my Sushi+Tempura Lunch bento and was thinking about the bad score I would give to this place.

A good Japanese meal includes extremely various tastes, whereas a bad one can give you different looking sushis or meals but with quite the same taste at all... Here, it is perfect! You can real feel the subtile meals and their great different tastes!! Really I loved it and will come again to taste other meals!!"}
{"text":"sushi was okay.  

service was VERY slow.  We waited 10+ min. just to get any service.  Usually customers sit down, and then the server comes by with water.  Here, nothing.

Food was okay at best.  If you're living on the streets or in a prison, the vegetable udon might be okay.  If you're vegetarian, check first if their veg broth has any bonito fish in it - it tasted very fishy.

The server forgot the miso soup and the green salad.  We had to remind him also about a request for tea.

What is going on today w/ service?  Shouldn't it be going uphill, not downhill?

I've got another Deal-of-the-day voucher for sale - $70.40 value of food for only $33.  I'd love to sell it to anyone who enjoys this restaurant more than I do.  Message me directly if you can!"}
{"text":"First of all, I gotta say how affordable this place is. I recieved twice the amount of salmon as usual on my teriyaki dish. I nice experience."}
