{"text":"This place has good cuts of fish that are sizable and fresh.  That's my main criteria for any sushi place.  The nigiri was quite good, and more filling than it initially looked.  I had the Edo combo, which was satisfying.  My only criticism was that the nigiri and roll combo included a sushi roll of avocado -- no other ingredients -- which I found kind of pointless.  

If you are looking for a wide variety of sushi preparations, this isn't your place.  You are mainly limited to nigiri and a dizzying list of rolls.  No chirashi or much in the way of sashimi at all.  Omakase didn't seem to be a menu option either, but to be fair, i didn't ask.  There are some other options, like a \"sushi pizza,\" which had cuts of tuna on a fried rice \"pizza\".  The rice was a little on greasy side, even accounting for it being fried.

If you are jonesing for sushi in Old Montreal and you appreciate a fresh, fair cuts of fish, Tokyo Sushi Bar will scratch your itch."}
{"text":"Don't go to this place. It is TERRIBLE. We ordered the fried crab entree and what came out was deep fried crab skeleton. The sushi rolls were coming apart, the flavors were odd and subpar. The food wasn't fresh. We couldn't even finish the meal. AVOID going here. Is there a puking emoji?"}
{"text":"Went here with a group of 10 (Sept 16, 2014). Reasonable ($300 for all), fresh and delicious sushi. Tasty tempura. Fast, friendly staff."}
{"text":"If you are looking for really good rolls and sushi with a twist of creativity and exotic flavors, look no further than Tokyo in Old Montreal. Good service, decent prices and a variety of yummy rolls to enjoy!"}
{"text":"Went for dinner last night in the old port, was my first time at Tokyo. Arrived earlier than my reservation and they were accommodating as it was pretty empty. I opted for the table d'hôte which included sushi appetizer of 3 different types, miso soup, tea and dessert. My main was the katsu crispy chicken with mushrooms, broccoli,  bean sprouts and sweet sauce with steamed rice. The chicken was very tasty Snr not oily. The food was good which I would recommend especially for the price. I rate 3 stars because of the overall service. The waiter got my appetizer wrong, I asked for the tempura and got sushi. They never asked me if I wanted a drink and did not ask my friend if she wanted any dessert. The wine glass smelled like dish soap."}
{"text":"Got back to Montreal from a day trip to Quebec City. Yes we are tourists. 

Went looking for a late dinner around 8:45pm and this restaurant looked good. Sushi was good as well as cooked meals and manager (maybe owner) was very accommodating. 

Definitely would recommend a meal here."}
{"text":"IN SUM: 2-stars because of the kind service

RATING: 4-stars for service. 1-star based on food. 2-star based on ambiance.

SERVICE: I'd really love to give this place 1-stars based only on the food, but the service by the female hostess was especially considerate and kind. The service by the other male hostess was rather the quick and hurried. We felt rushed. However, when it came time for the bill and we needed to leave the waiter was slow.

FOOD: 

SUSHI- We ordered the midi maki and sushi maki (5 maki, 5 sushi) and tempura. The sushi rice was under seasoned. The seaweed was dry. The sushi was mildly warm. The rolls were randomly given. The most I remember from my roll was the strong taste characteristic of tuna and the dry slightly old taste of the imitation crab meat. As an avid sushi eater who can down 30 pieces at an all-you-can-eat buffet, I was unable to even finish 10 pieces.  It wasn't particularly bad, but it wasn't particularly good. My mother with zero experience in sushi making made better rolls her first time than this restaurant that specializes in sushi. The rice was also not sushi rice - larger and thicker grain. I'm surprised this place lays claims to being a sushi bar.

TEMPURA- I did not eat the tempura but my table mate who frequently eats fried food - from Southern fried chicken to Beijing fried street stall buns - said the tempura was undercooked and from a pan that reused the oil.

SOUP- The miso soup was too salty as well.

My table mate said the best part of the meal was the water.

AMBIANCE- It's unfortunate that this key location is this restaurant. The high-vaulted ceilings are wasted on a cheap-looking silver ceiling. The centerpiece chandelier is a cheap silver-sprayed Christmas light spherical decoration. The gold columns are unevenly sprayed. The window columns are chipped. The windows are dirty. The only nice elements of the atmosphere is the painting of the woman in a blue dress and the art pieces above the sushi bar. Finally, the sushi bar chairs need to be repainted.

The layout was also especially awkward. There were two main doors and I got confused which one was the entrance. Next, the hostess stand was not by the entrance and I was especially lost where to stand to be seated."}
{"text":"I had dinner here this week and really enjoyed the sushi.  I had one of the sushi combo's along with several rolls.  I enjoyed everything and fish was very fresh.  Their entry level combos (which are still a bit more expensive than in California - hey it's Montreal - did not include miso or salad nor tea) but I walked away satisfied.  I'd go again."}
{"text":"Tokyo Sushi Bar has quality food & consistently.  We go there 2-3 times per month since it's in ourneighborhood & have not been disappointed!  In addition, their prices are moderate providing a good value."}
{"text":"We stumbled upon the restaurant because O&G was packed. For authentic japanese food lovers, please save your $ and go somewhere else.

I've never had chicken teriyaki with the chicken being fried and hard. Beef terikaki was close to beef jerky. 

And for lunch menu, it was over $15. Totally not worth the food that was served. 

Got a two star because server was rather friendly. That's about it."}
{"text":"If someone asks you if you want to eat here, your only response should be \"Oh, I don't think so,\" à la Ewan McGregor as Obi-Wan Kenobi in Stars Wars Episode III: Revenge of the Sith.

For a $19.99 bento box, the chicken and/or tofu (or other protein you choose) is placed on a bed of undercooked onions and cabbage. Rice is not provided in any part of the bento box, except as a component of the sushi roll you get.

The food is really nothing special. Any rolls ordered are SLATHERED with dressing/sauce/dip, which really makes the food wet and soggy. Soggy sushi, rice, or tempura is really, really not a pleasant texture.
Fruit garnishes with a green cruciferous leaf is a really big thing here, even though the fruit doesn't necessarily match the order in terms of taste combination, or edibility (do you need huge orange slices for makizushi pieces? I don't think I need oranges when I'm eating raw fish with mayo, wasabi, aioloi, or soy sauce). Strawberries with sushi is just really not appetising and does NOT work. The Tropicana is a fruit and rice combination, but do you REALLY need avocado when you already have the soft yet firm textures of mango and strawberry? Avocado is nice, but using it as a cheap filler for every roll gets old and boring quickly.

The appetisers are mistakenly labelled as \"entrée\" online in their menus (oops!) and are fairly priced. The salads are VERY boring, and the soups are run-of-the-mill miso soup. The warm appetisers, sunomono (namasu), and cold appetisers are very good. The entrées are really, really overpriced, and a lot of them are just a mix a roll of your pick with a protein of your pick and some rice. The salmon tastes very obviously frozen, and is overly fishy, tasting more like a cheap Atlantic haddock or hake. The tempura is unimaginative, being the stereotypical shrimp and few assorted fruits/vegetables that every other place with tempura serves. It's actually a bit oily; oil should be knocked off prior to serving to customers. Also, when they say \"white tuna,\" pretty sure this isn't actual Albacore tuna, but Escolar, which is NOT a tuna; Escolar is snake mackerel, and does not taste anything LIKE tuna (they're not related). The tiramisu, for a flat $6.50, was REALLY gross. I really advise completely skipping dessert here, it's really gross and just not acceptable.

Would I say \"NEVER EVER VISIT HERE THIS PLACE SHOULD BE CONDEMNED\" to everyone? No, but I don't see why I would come here over an all-you-can-eat sushi/Japanese buffet, or another Japanese/East Asian restaurant."}
{"text":"Tokyo Sushibar on Saint-Paul (not to be confused with Tokyo Sushi on Saint-Catherine street) is one of my favourite sushi places in Montreal (and I've tried many). They have very creative rolls with unusual ingredients. Try the specialty rolls, they're worth it. Yum! My eyes are usually bigger than my stomach, and I always leave stuffed. 

The wine list isn't terribly extensive or interesting, but you can find a nice, drinkable white for dinner. Service is decent. They also offer a reasonably-priced lunch special, and do takeout. Like J.F. mentioned, it's best to reserve ahead for lunch because it fills up with the Old Montreal office crowd. It's a little quieter in the evenings."}
{"text":"Nous sommes allés manger au Tokyo sushi bar un samedi soir en saison basse, nous n'avions pas réservé mais cela n'a pas posé de soucis. Nous avons d'abord trouvé la carte vraiment trop compliquée (une carte des spécialité, une carte des plats chauds, une carte des futomaki et une carte des boissons accompagnée d'une feuille listant les futomaki et d'un stylo pour faire la commande) ; mais avons été ravis par le service. 
Nous avons commander soupe miso, mix tempura et plusieurs rouleaux de futomaki. Les miso etaient excellentes, les tempura étaient plutot fades quand aux futomaki nous nous sommes régalés. Attention tout de même ils sont bien généreux sur les proportions donc ne pas avoir les yeux plus gros que le ventre. Quoi qu'il en soit, nous avons pu emporter ce que nous n'avons pas mangé.
Les prix sont très corrects : 2 miso, 1 entrée de tempura, 5 rouleaux futomaki et 2 sushi = 41$ taxes et service compris."}
{"text":"Situated in Old Montreal, Tokyo Sushi claims to offer a vast selection of 'fancy sushi' dishes. Their menu seems to be all over the place. There are 3 different sheets you have to go through to decipher the ingredients & price of a dish. It took us over half an hour to figure out & decide what we want. The food seems to be good & the Fish is fresh, but for the price (if u can decipher it), it seems to be a little too much. Also on their menu is a sushi with shrimp, Strawberry & Blueberry   O_O
        We ordered  The Rock, The King, Dragon eyes, Dragon balls (o_O), Chicken Teriyaki & hand rolls.  The hand rolls are generic and they taste like any hand rolls you get at fast food sushi places.  Dragon eyes was good. So was The rock. The King was kinda meh. 
     
So : 

Food -  Good 
Service - Freindly
Ambiance - Classy 
Worth the money - Don't think so"}
{"text":"Sushi for three!  
I am terrible at ordering sushi. So my darling friend Jen took the lead. 
We ended up with  2 appetizers - Dragon Balls and deep fried veg, and 40 pieces of sushi - not sure exactly what they were, but there were some California rolls, eel, salmon, cucumber, rice, seaweed wrap and a whole bunch of delicious things! 
Pictures to follow! 

Nice touch: they bring hot towels to your table! Service was attentive and prompt. 
The restaurant is on a quiet street in Old Montreal, walking distance to a street, I don't remember the name...sawrrrry!

Food was absolutely amazing! We couldn't finish the two plates between three of us. Next day left overs were amazing though!

Yum!"}
{"text":"Been here twice.  Everything here is \"ok\" not terrible but not stellar either.  The sushi is ok but I've had better especially on the combo plate I got. The salmon was a little fishy in the not-the-best-quality/freshness type of way.  The service is ok. I only go here because I'm accompanying someone else....would not be by choice. There are better restos in the vicinity."}
{"text":"I stopped by to get a few sushis to go early a few weeks ago and was satisfied with the quality.
I found there was too much rice and the grains were somehow bigger than I am used to (a different sort of rice maybe). The seasoning of the rice was a bit bland as well and the sea urchin had a slight metallic aftertaste. 
The service was quick and amiable and I enjoyed my sushis overall, the omelet in particular was delightful. The menu seems to offer a lot of choices and the place was small but quaint and I would consider coming back for dinner. 
Prices were fair compared to other places of the same quality in the city."}
{"text":"My friend and I stopped by here during a visit to Montreal just a couple of days ago, as it was one of the first restaurants we saw when we were wandering around Old Montreal. It looked cozy, and the waiter was friendly enough, so we decided we'd sit and have lunch there.

When we first got our menus, I was surprised to see that lunch specials were well over $15! Being from Toronto, we're used to seeing lunch specials at at least $10, even in nice Japanese restaurants. I was immediately suspicious of this, but I decided to order a chicken teriyaki and sushi combo, while my friend ordered a karage and sushi combo. It was upon ordering that we noticed that, despite the restaurant's attempt at giving off an upscale vibe, we still had to eat with cheap chopsticks that splintered.. they were worse than even the chopsticks you get at grocery stores. 

Weirdly enough, these bento boxes don't come with rice despite having various meats in one of the sections-- instead of rice, your meat is served atop a bed of stir-fried onions and carrots that tasted slightly vinegary to me. It wasn't bad, just unusual. The sushi pieces I got were alright, they were nothing special and I have been spoiled by the many GTA sushi joints that I've frequented over the years. One of my maki had no flavour whatsoever, and weirdly enough, even the ginger and wasabi were bland. My friend liked his karage, though my chicken was a bit tougher than I would have liked. I don't think our meals were worth more than $12, and I think my friend paid $19 for his. He ordered a miso soup which he said tasted amazing, but my salad was nothing spectacular-- it was good, but the vegetables could have been fresher and there could have been more dressing.

I was surprised to see that a slice of tiramisu was about $7, despite it still being frozen. As I ate, the whip cream betrayed the \"fresh\" description that was given to me by the waiter, so I was extremely disappointed. The mediocre food was already disappointing enough, but to be served a frozen slice of cake that took forever to emerge from the basement was too much. 

The waiter and the manager were both very kind, but the quality of the food was far too low for the price they were asking for. I don't know much about the Montreal sushi scene, but I would have been able to order several of the same exact order at restaurants in the GTA for the price of one lunch meal at Tokyo. I won't be returning, there have to be better options for Japanese meals and sushi in a city as big as Montreal."}
{"text":"Tokyo Sushi is my favorite lunch stop in Old Montreal, the sushi always fresh and tasty! I like the fact that when in a hurry they have lunch time specials that are ideal for takeout. I suggest calling ahead to make a reservation for lunch and keep in mind that they also do take out."}
{"text":"Very good option for sushi in old Montreal. Prices are reasonable considering the location, quality, and amount of the servings.
I ordered the Sushi Edo assortment ($21) which included \"6 nagiri and 9 peices of maki\"(this was 2 rolls for me). The rolls were large and there was actually more food than I could comfortably eat - which is unusual.
We were there for an early dinner and were the only people there; service was very attentive but I can't say how it would be under other conditions.
It appears this place is closed on Sunday."}
{"text":"Had the salmon teriyaki. The fish was good enough, and the sauce was okay, but  I was not a fan of the accompanying bean sprouts + other tasteless vegetables."}
{"text":"This place scores very high on service - in a particular manner. I've been an off-and-on regular here for a few years since the resto is close to my (now former) home in the Old Port. I would primarily come here w/ my daughter. Everyone at this resto has been so wonderful to her over the years. An order of magnitude more attentive to what makes a little princess tick. Almost every visit comes w/ littles surprises for her (e.g., a basket made out of an orange and filled w/ various fruit) and entertainment from the sushi chefs (we always sit at the bar). I truly thank this place for their special breed of attention - my daughter LOVES it!!!

The food is quite good as well. It isn't authentic but some of their inventive rolls are tasty and you can't go wrong w/ their chicken katsu (which comes in a pretty large portion!). Even if their service wasn't stellar, I would come back since it's my preferred sushi (on a quality basis) in the Old Port."}
