{"text":"Great pizza, authentic Italian cooking, don't let the location turn you off, it's a hidden gem!"}
{"text":"Off the beaten path but well worth the visit. Hot table with the usual italian comfort food like pasta, pizza, sammiches, veal, meat balls etc. I loved the meatball sammich. Make sure you got an appetite because the sammich is massive! Popular  with locals, decor is basic and clean. Staff are friendly and the owner is a hoot!  He barks out marching orders to his colleagues...quite funny. Parking is limited"}
{"text":"I can't help but say great things about this place!  I've been here for pizza and I've also used them for catering.  First, about the catering.  Tomasso's did an amazing job!  The food was incredible.  I had to order some platters for my boyfriend's birthday party.  I ordered a caprese salad - the tomatoes were perfectly ripened and the buffalo mozzarella cheese was soft and very fresh.  The salad was seasoned to perfection with just enough salt and olive oil.  I had another platter of mixed grilled vegetables, sausages, olives, cheese and cold meats.  Everything was fresh and prepared with the perfect seasoning and presentation.  I also ordered another platter of small pizzas and vegetable wraps (which were delicious!) and they were kind enough to add some rice balls (which everyone loved).  The small pizzas were of different varieties and the vegetable wraps were very unique and perfectly filled.  Guests were so impressed with the food and couldn't stop talking about how good everything was!  I've also been to Tomasso's for pizza and it was very good.  I ordered the prosciutto, parmigiano and arugula pizza.  It was perfectly cooked and the crust was nice and thin.  Thumbs up to the cook!  The staff at Tomasso's are super nice and great people.  They really care about preparing authentic and fresh Italian food.  Definitely worth using them for all catering needs and for a pizza night out.  Great job Tomasso's!"}
{"text":"Dont be put off by the look of this place. Yes, it is in a non-descript strip mall location in an industrial area, but it also serves up the best Italian food I have had in Toronto and possibly outside of Italy.   A caesar salad appetizer to start was crunchy and fresh with amazingly flavoured dressing. Complimentary brushetta, bread and olives are also served. The brushetta is laced with fresh basil, chopped tomatoes, red onions and drizzled with Italian olive oil.   For entrees, we had the Chicken Parmegian with pasta and the Spagettini with bacon and goats cheese. Both dishes were excellent, although the spagetti bacon was a little over salted. Both dishes were served witth perfect 'al dente' pasta.   The homemade Tiramisu to finish was pure greed (we were completely full by this stage). However, it was worth it. Fresh creamy layers with coffee liquor soaked sponge and cocoa power bliss.   Service is friendly and very Italian, prices were reasonable and portions were large. The 'hidden gem' term certainly applies to this place and I will definitely return. Check it out - you will not be disappointed."}
{"text":"Ok, so we are feeling like pizza, but not the Pizza Pizza / Domino kind, but something good and close.  We call Tommaso's and order a simple Margherita;  they have an electric oven not wood fired, so I'm wondering what we'll end up getting, but at least the server is from Italy and so are the owners... Then boom!  This is amongst the best we've tasted in town!  The place is tucked in an industrial part of town, but their pizza will now be forever our go to pizza!  We actually love New York pizza, especially John's and Grimaldi's, and Tommaso's gives you that experience:  is like having the best of NYC pizzerias minutes from home... We will try their other stuff at some point, but for pizza this is an awesome place at very reasonable prices... Way to go Tommaso!"}
{"text":"Restaurant look like a scene from Kitchen nightmares...but who cares its the food that counts. I have been in a few times now hoping it would get better. Lunch - prosciutto and veg sandwich to go...prosciutto cut way too thick and worst of all still had the rind on. Seriously and Italian worth their salt knows how to properly cut prosciutto. Tried a couple of days latter...had the hot table lunch...there was a good looking pork stew. The pasta it was served with was way over cooked (another sin for a real Italian restaurant) but the stew seemed to be swimming in what tasted like rancid oil. It was gross. I tried one last time as I am new to the neighbourhood...I ordered the seafood pasta...this time the angel hair pasta was cooked properly however the seafood was obviously originally frozen and had that horrible stench of a very dirty Kensington market fish monger. Seafood should not smell that bad. Again need lemon sorbet to wash it away after I tried getting through a few bits. Go up the street to Hey meatball...food is delicious and fresh. Or go to Pizza Pizza where you know you won't get food poisoning!!"}
{"text":"Tommaso's is the BEST BEST BEST.  Its absolutely delicious and very well priced.  Its wonderful to get the combo hot/cold plate for lunch and bring it back to your home/work.  The sausage in the hot plate is crazy good- best I have ever had!  I love it here!"}
{"text":"A hidden gem...off the beaten path.  My wife tells me not to write a review for this place, or else we will never go back.  Wrote a review once, for another hidden gem on another account... place was always packed afterwards.  Not my fault, as I doubt many people read my review, just pure coincidence is all!  Anyways, here goes:  Have been here many times since it has opened.  Veal and chicken sandwich, large, delicious, and reasonably, if not, underpriced, for the size and the amount of stuff packed inside...onions, peppers, their homemade tomato sauce.  Their pizzas are great.  Very comparable to some of the better pizza places in Toronto, including Vivoli, Via Mercanti, Taverniti Trattoria, Libretto is probably still better than Tomasso, but Tomasso's is definitely up there, one of the best pizza's in Toronto.  I've tried half of their pastas on their menu.  Simple, delicious recipes, the Fetteccini and Porcini Mushroom pasta is one of the best pasta's I've had in an Italian restaurant in Toronto.  So simple, I am trying to perfect it at home myself.  Although, I have not tried Gusto yet, but I hear that place is excellent as well.  Quiet, quiant, friendly, and reasonably priced.  You always get their complimentary Bruschetta, the loaf is kept together, hot and fresh in the middle, crunchy outer crust with just a few pieces sliced off and covered in olives, EVOO, tomatoes, oregano.  Unfortunately, this place is rarely ever packed, the most I've seen it full, almost half the dining room was still empty.  This can be a good thing for regulars, never have to worry about seating, consistency of food quality and service remains high, but location is not very central, a little off the beaten path, may make it not so great for business.  $15 corkage fee for bring your own bottle of wine, standard individual pizzas are roughly $13-$18 or so...but any large pizza is $30, can feed two easy!  Especially when you get their complimentary bread.  All pastas fairly priced, Mr. Tomasso is super friendly. Decor 3.5 out of 5 Food 5 out of 5 (consistency has been an issue on one or two visits) (*Edit: Consistency is getting much better, been back a few times in 2016. Raised the food rating from 4 to 5.) Staff and Service 4 out of 5 Price at lunch time, depending what you get, is great! Fair and reasonably priced for dinner."}
{"text":"The staff here is incredible.   I wanted a quick takeout dish, they basically asked me what noodles and sauce I wanted and made a couple quick recommendations and made me up one of the best pasta dishes I've had in a long time.   Can't wait to try the pizza."}
{"text":"On the strength of all the positive reviews we read on Yelp about this place, we decided to try it. I was surprised the place wasn't very busy for a Friday night and maybe that was a sign. We were seated and our server said she wasn't sure if she was going to look after us. You'ld assume that they would seat you and eventually give you a menu. We thought you might order off the blackboard but I check their menu online and knew that wasn't the case. After 5 minutes, I had to ask for menus.  We asked for wine and our server promptly talks up a bottle. In fact the table next to us is enjoying it very much. I see that it is a litre bottle and we're only two so I ask for something else. The server mentions some others without offering to show us the wine list. I only found out they had a list at the end when I questioned the price of the wine. We ordered a bottle of Chianti Classico. It turned out to be $60.  I have no qualms about the markup that place charge. Everyone needs to cover their overhead and make money. But the service should match the prices you ask for.  On to the food. We ordered the soup of the day and the antipasto. The soup is stratella. The grilled vegetable were eggplant, zucchini, artichokes, asparugus. There were 2 types of cheese ,a slice of prosciutto and some cured sauages. Just a personal prefence but proscuitto should be sliced paper thin and dry so it melts in your mouth. This wasn't. The sausages were very thick. You either had to put the entire peice in your mouth or try cutting with the dull dollar-store knives.  Vegetables had no seasoning (a little bit of salt or pepper would be nice)  She loves stratella but it didn't look enticing. There were lots of noodles but where is the egg? Worse, the soup came out cold. It had to be reheated but it still wasn't hot just hotter than before. At home I sometimes make soup with those Knorr soup mix and add an egg and other stuff. I can honestly say that the soup I make from the Knorr mix is as good.  Those nice people sitting beside us had a staggered meal. Two had ordered pasta and received those while the other two who ordered veal had to wait and wait. They were told that Chef like to put out the food as soon as it is ready and so the veal is on the pan and will be out soon. Then one person got his veal and 5 minutes later the final dinner came out as the two who had pasta were finishing their dinner!  I thought we were smart to have ordered the same dinner item as it was my only smart choice that night.  We both had the veal parmeggiano with a side of gnocchi. It was covered in sauce, heavily breaded and a bit tough. there was so much sauce that it was a soggy. It wouldn't be so bad if the sauce was great but it was alright. I've had better sauce from the Longo's store brand. Same for the gnocchi. It was covered in sauce.It had basil but was too tart. It needed something to cut the acid. We had to ask for grated cheese and chilli flakes for our pasta. Really good food doesn't need to be hidden by all the sauce.   I feel bad about giving it only two stars. I hear that the owner is in the hospital and his wife is cooking and hence the service is slow. But the place wasn't packed. And our server wasn't good. And the food wasn't satisfying, comforting or delicious.   With the wine, two appetizers, two main, after taxes and tip dinner came out to be $140. I happily paid by cash. Why? So I wouldn't have to open my credit card statement and relive this dinner next month"}
{"text":"Ordered the \"meat\" lasagna - it was just layers of pasta with sauce poured over it and barely any cheese. My husband ordered the chicken parm which was pretty bland. I will say that their pasta sauce was very nice. Overall it was totally overpriced and not great."}
{"text":"Their lasagna has fed my crowds many times: big family dinners, kids' birthday, baby showers... The \"small tray\" feeds a kitchen-full of people. The \"large tray\" feeds a buffet-style crowd. It's BIG.  And in all the times I've served this lasagna, it has been a crowd-pleasing winner! I thank the stars Tommaso's is close to my place, because if it moved out of town, I'd still drive for it."}
{"text":"I thought the food and service was fantastic. I grew up in an all-Italian town in north east Ohio and it reminded me of all the wonderful Italian home cooking I remembered as a kid and teenager. The veal parma was melt-in-your-mouth delicious and the sauce tasted like it had been made from slow roasted italian tomatoes. My husband loved his sausage and pasta and the ceasar salad was perfect. The portions were so large we wound up taking enough home for lunch the next day. The service was warm, attentative and prompt -- our waiter was charming and made us feel as if we were 'regulars.' Couldn't ask for a better meal at a very reasonable price. In fact, it was half the price and 10 times better than the more upscale restaurants."}
{"text":"Whatta shocker.   Like the other reviewer mentioned, Tommaso's is in the strangest little strip mall, sandwiched between Rent a Wreck and a computer supply shop. I was super skeptical when I was dragged here, but I was proven wrong. DELICIOUSLY wrong.   Nothing too fancy going on with the interior or exterior of this spot, but it's clean, bright, and pleasant. The staff are mostly family, and treat diners like household guests. Be prepared to be mildly shamed if you don't order wine.   And the food. Oh, the food. Southern Italy represent! The menu isn't extensive, but includes the standards done really really well. To start, a complimentary heaping plate of bruscetta, olives, and mini-loaf of gorgeous bread. The chicken parmesan tastes freakin amazing, and it's hugeness covers the expanse of an entire dinner plate (a dangerous combo). Even the starter salad is carefully crafted, with grilled asparagus and little chunks of bocconcini cheese. Stuffed to the gills! And again shamed for not ordering dessert...   The price? Super reasonable for the quality + quantity.   Hey! I can't forget to tell you that the times I've been there, this awesome little Italian dude was sitting in the corner playing a concertina and singing his heart out. The coolest!"}
{"text":"Bumping this place up. A lot. I tried their pizza for take out tonight, and I'm so glad I did.  Delicious, thin crust, with a light texture and balance of flavour that I haven't experienced in pizza since my last trip to Italy.  The wine is amazing too.  And I can't praise the staff enough.  Will go back. I have a feeling my first experience here was a blip."}
{"text":"The hot table is awesome. Straight up goods."}
{"text":"My friend lives literally 5 mins away from this place, and from the very first time we got takeout for dinner, I was sucked in!  Their pizza is quite literally the bomb. The crust is crispy, chewy and buttery, unlike any I've had in the city. Our go to selection is the White Pizza (no sauce) with Arugula, Feta, Tomatoes, and Hot Peppers.  Lord have mercy. The pizza is literally the size of a rim on a Hummer, lol. And though I should limit myself to one slice (because they are so huge), I always swoop in for a second.   I've also had their Manicotti which is sensationally cheesy, luscious, and gooey. Not good for your thighs, but great for your mental state of well being."}
{"text":"I took two of my friends here for lunch on the advice of another friend.  We all got the combination, the hot/cold plate special.  The staff were very friendly and solicitous, pushing the combo plate.  The offerings were various and I had the gnocchi, lasagna, a meat ball with Caesar salad, cold rapini and a toasted bread.  The food was clearly hand made but under seasoned and the hot plate was really a slightly warm plate.  The TV was most distracting but I imagine some patrons like it.  We all had a good time and the staff were quite lovely.  None of us left hungry and the meal came out at $16 per person with tax and coffee.  We were not dissatisfied but they could up their game a bit."}
{"text":"I really enjoy going to Tommaso's for lunch! they have an Italian style hot and cold table. There is always authentic Italian food and they run specials all the time. The best part about going to this Trattoria is that I get to support a local business and not one of those big corporation places. Tommaso's is so fresh and the flavors are fabulous."}
{"text":"wowowowow.  this place is probably the most authentic fast food itlaian place in Canada.  and by that I mean real Italian food.  They have everything you can imagine you'd get at an Italian place.  I've been there a few times and try to get something different each time.  Their pizza is great, they use different ingredients and compose pizzas you've never imagined.  Their veal is even better.  It's huge and very good for the price of $9.  They also have Mediterranean style salads.  You can take-out or sit-in.  Their prices are slightly expensive, but worth every penny."}
{"text":"They are closing in April as a developer has bought the place. Boo! Get your pizza while it's hot."}
{"text":"Extremely, Extremely super nice staff and owners. Mom and Pop Italian place. Very comfortable, great simple food and good prices. You will love it!  We finished the meal off with an espresso and Tiramisu.    Will go back very soon....  Thanks Tommaso's"}
{"text":"Previous reviews are correct...you can't judge a book by it's cover...or it's interior.  Only by eating the pages.  This place is good.  The complementary bread, bruschetta and olives were great to take the edge of my hunger.    I had the California Greens, my friend the Caesar.  Both good...mine was above average as it had some tasty extras besides the leafy greens.  I had the Fettucini con funghi (and something else, I forget), with garlic and olive oil.  My friend the meat lasagna.  Both very good.  While enjoying a couple of cappucinos, Tomasso (I believe) brought us some treats that he just baked for another customer.  Nice!  I took a quick look at the pizza, and it looked great.  From 7am - 4pm, they have a hot table with pizzas, pastas, sandwiches etc...all the typical Italian hot table stuff, then at 4 they bring out the menus for dinner.  Closed Sunday.  Quick tip...this strip mall is 1.5 blocks east of Broadview, on the north side.  There are no numbers on any of the stores in the strip"}
{"text":"food is ok. location has parking which is a plus but its sorta kinda in the middle of nowhere. I felt like I was going to board a ferry when I drove here. I find the place a tad expensive for the all around food and feel of the restaurant. Probably I should just do take out next rather than sit in and order from the menu. Not to say it wasn't good. It really was."}
{"text":"So sad to see this local eatery closing end of March. Get out and get the last good authentic italian eats before it closes March 31."}
{"text":"We passed by one Saturday night on our way to a downtown restaurant, and because the place looked packed, we thought we'd give it a try on another night. A little Italian restaurant tucked away on an industrial street in the east end, packed on a Saturday night? Must be a secret little spot that some people weren't letting out.  We weren't disappointed in our meal.  We started off with a generous plate of fresh bruschetta (happily, no melted cheese on top) and a generous basket of homemade spicy (olive?) bread served with olive oil and balsamic vinegar. Off to a fine start.  THE FOOD: The chicken parmigiana was very good, as well as the delicately-flavoured manicotti. The roast meat plate had a wonderfully spicy Italian sausage and good lamb chops. Unfortunately, they replaced the promised pork with two drumsticks without mention. These were on the dry side and didn't have a very appetizing look. Only disappointment of the meal.  There was also a very enticing-looking pizza counter. Will definitely have to try next time.  THE SERVICE: Service was very friendly, from the booming voice on the phone taking reservations and telling us that he looked forward to seeing us for supper, to the friendly, chatty waitress, and two other employees who didn't serve us but still stopped to say hello and ask how our meal was.  Pricing was average for a mid-range Italian eatery: $15-$30 for mains.  The view isn't great, the restaurant being situated on a stretch of Eastern Ave. across from a Mini dealership and a yard full of Enbridge gas trucks. However, everything else made up for it.  Definitely coming back again."}
{"text":"What a wonderful surprise.  You can't tell from the outside, but the inside is quite nice with a comfortable bright atmosphere.  That being said, let's get to the only thing that matters, the food.  First off, we ordered one of their brick fire pizzas.  Absolutely delicious.  I never eat the crust on my pizza but found myself doing so.  The crust is fluffy yet has crunch and also very flavorful.  The pizza was our appetizer!  The next thing I ordered was the house special.  Stewed lamb with homemade gnocchi.  Oh my goodness this was good.  Gnocchi wad well prepared, the lamb was fall of the bone tender and the sauce was great.   The service was excellent and I enjoyed chatting with the host and server.  The host made us feel like we should stay a while and do and typical 4 hour Italian dinner.  I and coming back!"}
{"text":"I discovered this place while having my computer upgraded at the shop next door.   Otherwise, I'm sure I would never have found it.  And that would be a real shame!  The variety is excellent, and everything is made in-house, including the addictive bread.  Value is very good.  On my first lunch visit, I had a \"combo plate\", which was essentially whatever I wanted from their large selection of dishes.  I chose lasagna, braised short ribs, meatballs and marinara sauce, Greek salad, tomatoes caprece, asparagus, grilled vegetables and a slice of freshly baked bread.  It was all delicious!  On my second visit, I just bought a slice of one of their specialty pizzas, choosing a variety with ground meat and sauteed mushrooms.  I cannot describe it other than to say it puts every other pizza maker in the city to shame.  The staff is very helpful and friendly, and the food is prepared with much skill and care.  It is located in a small strip mall and is easy to miss.  But definitely worth the trip."}
{"text":"We've been here a few times for either lunch or dinner. The foods pretty good. Love the vegetable soup, sandwich was made to order. I told her no meat, just surprise me. Came with nice chunks of grilled veggies and tomato sauce. Loved it.  That said, we probably won't go back just because the owner, Tommaso, when not busy, will sit at your table to chat. I found it awkward. Had happened a couple of times, I have no urge to go back."}
{"text":"A no fuss old school Italian joint , Tommaso's doesn't put on airs.  You get what you pay for and MUCH more.  Family owned and operated this strangely located Trattoria has generated recent buzz.  Having lived in relative proximity to Tommaso's for years and passing it many times without a sidelong glance I was curiously intrigued when I first heard it was worth stopping in.  Located within a relatively quiet strip of Eastern Ave. just east of Broadview it is easy to miss.  Despite being easy to miss, Tommaso's is hard to forget once one has had the opportunity to sample a doughy slice of pizza goodness straight from the oven or the pleasure of being introduced to the magnificent hot table bursting with comfortable traditional Italian staples.  Tommaso's is clean, spacious and provides great bang for a buck.  When compared to other trendy Yorkville Italian Ristorante's that shall remain nameless, you simply cannot help but appreciate its value."}
{"text":"We went with our kids for dinner. Our 3 year old mentioned that the food tasted salty. So, we tried it, and it was definitely very salty...so much so that our kids could not eat it, nor would the adults.  We mentioned this to the staff, to which they responded, it tastes fine to us...no further discussion, no discounts, nothing..."}
{"text":"Friendly atmosphere.  Nice bruschetta and freshly made bread.  Pizza was good, and so was the grilled calamari but the sea bass was bony, and the chicken parmesan was tough and dry (covered in sauce).  I will go back to try the pasta to see how it taste..."}
{"text":"Great Italian restaurant for lunch.  They have all the classics, veal cutlets, risotto, sundried eggplants with olive oil. etc...  It is run by some old school italian people, so you know that they know what they are doing.   It this place up for lunch, and you will fall asleep at your desk because, the portions are so huge and the food is soo good that you just can't stop!  Slightly pricey, but worth it.  12$ for a real veal cutlet sandwhich and a soda."}
{"text":"Place was pretty quiet as we came in. Service was quick and staff was very friendly. Ordered the chicken Parmesan and a Ceaser salad. Both were great and the salad definitely had a homemade dressing. Nothing super fancy about the place, by who cares when the food is good!"}
{"text":"Budda boom Budda bing. Tommaso's TRATORIA is oddly situated in one of those funny little six store strip malls on Eastern Avenue just west of Carlaw. My initial impression was that this basically was just a place you went to grab up one of those honking big veal \"sang-wiches\" and half expected to see Tony Soprano sitting in the corner slurping up some Espresso (or as you mangia cakes would call it... Expresso). Some Italian friends of mine encouraged me to go and at least check it out since they know how much I love true to form Italian food.   So last evening myself and my daughter (fellow Yelper) Meg hauled ass down for some rustic, down to earth Italian eating. We started with the house antipasto plate which came on two plates. Tommaso slices the prosciutto himself on order. The plates came piled with prosciutto, two kinds of cheese, chicory, rapini, olives, green beans, fagioli a hunk of really fresh bread and odd addition of what appeared to be small square sandwiches with rapini and sausages in them. (see the pics!) For posterity we chugged back a bottle of nice cold sparkling Prosecco. It was in our opinion not a fancy antipasto plate but very true to rustic Italian cuisine.   The waitress brought out a plate of fresh Chanterelles to let us know that this is what was part of the specials for the day and that Tommaso was cooking up the 'shrooms. We ended up having a couple of plates of pasta with his house sausage and eggplant stirred in to and for the most part I'm not a big fan of the \"saus-eeeege\" but these were delicious. The pasta was delicious but just a tad too al-dente for my taste buds. I prefer my pasta cooked a little bit softer. Tommaso told us he makes about 150 lbs. of sausage a week. Somehow or another we ended up with a bag of fresh sausages to go.   Tomasso just kept sending out little samples from the kitchen including another type of pasta that had the mushrooms stirred in to it. I really liked this pasta even more. We didn't get to the vitello (the veal) because at that point I just couldn't get any more food in. Tomasso sat down with us, brought out some sort of herb liqueur and had the waitress bring us the house biscotti. They were large with bits of dried fruit and orange in them. Very traditional and very delicious. He told us that that bulk of his business is lunch time from the film studios along Eastern & Lakeshore Avenues. I certainly could understand why as all his food is truly authentic and has a real home made edge to it.   From an ambiance perspective Tommaso's is so so because of the steam tables and the Pepsi cooler but the room is quite large, very clean and has fresh linens on the table. This is not a Splendido but then again nor is the price tag. The menu offers very basics....pizza, veal, pasta, antipasti. It is home cooking and comfort at its best."}
{"text":"This place is such a gem. Somewhat hidden in a strip plaza on Eastern Avenue, I never would have thought twice about this place except because of the oddness of the location, I was instantly drawn to this place.  As a surprise my fiance made reservations here for Valentines Days. Since both of us wanted to escape the pretentiousness and crowds that usually mark Valentines Day dinners in Toronto, this place was PERFECT! It was casual, authentic and cozy. We were greeted in the most unpretentious way with a warm Italian family hello. It suddenly felt like we had been transported from the cold Toronto winter to the warm Italy. That sat us in a nice booth and we were immediately impressed with the decor which was the perfect mix of shabby chic.   As we looked at the menus, the waitress brought us each a small sip of champagne to celebrate the occasion. As we drank our champagne and looked at all three of the menus (wine, pizza and home cooked Italian) the owner of the restaurant came over to give us a personal welcome. How fabulous!  We were immediately stunned by the price of wine, multiple bottle available for $30, $35, $45. I don't think I've ever seen such low prices for bottles of wine in Toronto. We didn't try any of those because once we mentioned that we liked Pinot Noir, the waitress went and found us a bottle off menu. To our surprise it was a delicious California Pinot Noir and one of the best bottles of wine I can remember drinking in Toronto in recent history. It was a bit pricier than the $30 bottles of wine but it was by no means extravagantly priced, especially for how good it was.   For the food choices we were torn between the entrees and pizza. We decided on pizza and the arugula salad to start. The salad was great and was brought out with delicious bread and bruschetta. As for the pizza. We got two personal sized pizzas, one with sausage and a white pizza with porcini mushrooms. Both were delicious. The pizza is the perfect mix of thin crust and doughy. We both eat a lot of pizza and this pizza was some of the best. I prefer it to a number of the other pizza places in the neighbourhood. I must say, probably the best part of the dinner was the delicious house made hot sauce! It was fantastic on both of the pizzas and put regular red chili flakes to shame. Even though we got two personal pizzas we were only able to eat half of each because we were so full. We ended up bringing it home and are happily looking forward to eating the rest this evening for dinner.  So in summary, the food was great, the service was spectacular and the price was very good too. We left as very happy customers. We will definitely return to this restaurant!"}
{"text":"I'm from Worcester but whenever I choose a place for lunch or dinner with a client, this is my place. A professionally run restaurant both front and back of house. Always delicious food and attentive service. Wines are competitively priced as opposed to other places that put wine high on the profit pocket list. Usually plenty of parking. Haven't been disappointed yet and don't expect to be in the future AND oh yeah, my clients invariably love it."}
{"text":"The food is overpriced and I know someone who worked there. They were a foreigner from another country and the owner treated them like completely garbage and like a slave. They even forced them to go and paint their house.  Do not support these people; they are rotten to the core."}
{"text":"Family style dining, great variety in the food items and everything is absolutely delicious. We come for lunch and fill our plate to the max. Love the desserts too, especially the tiramisu!!!"}
{"text":"If you're like me, you've driven by this place dozens of times and wondered what, exactly, it was. Such an odd location, right? Well, having finally had dinner there, I totally get the hype! Delicious food, and the friendliest service imaginable. The wine list is nice, and weirdly affordable."}
{"text":"It was a sentimental journey that brought be me back to late 80's and 400 Eastern Avenue in Toronto. I owned a business that was one of the first tenants upstairs when this building was brand new, lots of memories.  The main space is just as I remember it when the landlord ran an so-so restaurant there.  Luckily Tommaso's fairs much better. The friendliness is surely worth five and the food is good as well. I had was a home made soup (good) and a slice of vegetarian pizza (very good).   Will be back."}
{"text":"Service is excellent , friendly staff. The owner came by to check up on us to make sure we were taken care of. The bruchetta was fresh and the bread. Ask for the hot sauce/oil if you like spicy. Ordered the arugala pizza with prosciutto and papperdale and loved it. Would repeat."}
{"text":"This place just keeps getting better and better.  And the price stays the same.  I love the convenience of picking up dinner and then popping next door to pick up some groceries for the rest of the week.  I can't express how happy I am to have this joint in my hood.  I would recommend it to anyone looking for great rustic Italian food."}
{"text":"I was pleasantly surprised by Tommaso's Trattoria. Driving around Riverdale on a Saturday night without a reservation is more than a little dangerous, especially when you are hungry. Crippled by my growling stomach, I pulled over and whipped out the Yelp app. The closest restaurant was Tomasso's, so there we went.  Tomasso's has the strangest location. It's tucked into a strip-mall on the already morose Eastern avenue. The restaurant itself is enormous and split into two portions. One half seems to have more of a cafeteria feel, whereas the other is a bit more of a proper restaurant. They have super high ceilings (warehouse-like) and the vibe is uper casual. Like Telelatino playing on a TV, cans of preserves on the walls and a saloon door into the kitchen adorned with a pistol and a crucifix. You know how it is. The space wasn't terribly busy, and we had our pick of seats.  The menu is very italian. Pasta, pizza. Our night started with some complimentary bruschetta and extremely generous pour of Sangiovese. I ordered the rotto misto, a trio of meats served with potatoes, vegetables or salad. It was actually quite good, and the house-made sausages were really enjoyable.  I'd be remiss if I didn't mention the service here. Super homey. Kind of like Italian family dinner. Prices are pretty reasonable also. I recommend!  Obligatory Title Pun: No DOUBTING this TOM.  Menu Readability: Simple one pagers on cream with a brush typeface.   Need to mention: They have a pretty long wine list, and Barking Squirrel on tap.  What this place teaches me about myself: That you don't always have to make dinner plans in advance!"}
{"text":"You would think after visiting Italy and cooking italian food so much when I came back that I'd be sick of it by now. Nope. Can neva be sick of it!!  Stopped by here on my way home from taking a drop in local Aikido class..... Was in an odd area of Eastern, seems to be in the middle of no where but perfect spot to stop off and great parking.  Craving pasta.  After about 18 yrs since my first trip to Italy - I pretty much ruled out ever finding that similar dense pasta I had in Italy here...    First thing I noticed coming into this place: It was full of Italian customers. Good sign. (Sorta like any Asian resto - if its full of that same culture as what it is serving, it is always a good sign)  Just had the pasta - Plain ol' Spaget and Meatballs. Wasnt plain ol' tasting though. Dense heavy pasta cooked perfectly ! Hit the spot!! Had the home cooked hearty feeling.  Apparently some of their pasta is home made but not all of them, but still pretty good.  My friend loved their dish as well.  Gave us complimentary warm toasted  dunked in olive oil bruschetta which was so yum.   Very friendly staff.   Did not rush us out of there.  Prices were reasonable too.  Will go back and will recommend! For family, friends or even a date.   Yummy!"}
{"text":"decided to meet up with one of my good friends for a lunch, because this was close to his work we met up here. when we walked In this trattoria felt like home, it felt even better then home as funny as that sounds, very well lit, and a very rustic feel to the interior. I was very happy and impressed to find out that they had a lunch special and a hot table going at the same time, as well as impressed to find out that they made some pasta dishes without beef, which made me more impressed and super happy. I took advantage of the lunch special which was some pasta with pancetta, the server asked me if I wanted any more pasta, because she didn't have enough for a \"full serving\" so I went with some veggie cannoli's. my plate didn't look like a great deal of food, but when I was done eating I was stuffed, stuffed to the point where I didn't want to move. my friend had a couple drinks and dessert, and let me tell you, the dessert looked so good, but I was so full and GAH, SO FULL!  after we were done, we were actually approached by Tommaso him self, he wanted to know if everything was good, and if we had enough to eat, I was even more impressed by this outstanding customer service on his part.  the flavors and melodies that this kitchen cranks out is absolutely phenomenal. a very clean establishment on both the inside and outside, a great deal of parking, and a super awesome staff. not really a transit friendly location, but well worth the walk.  would definatly go back!"}
