{"text":"The pizza blew my mind. Seriously. My GF & I were struggling trying to decide on a delivery choice when she found this place and immediately found a bunch of things she wanted. I just wanted pizza so I was in. We got the Egg Pizza, which I thought might be a bit weird when delivered. Boy was I wrong. I'm so glad we chose that. The crust was soft yet crispy & layered with herbs. That alone tasted amazing. The eggs were not gooey or slimey but perfectly cooked medium-hard so the yolks were delicious. That pizza is good for any time of day. I can't wait to order more pizzas from here. We also got the Arugula salad which was simple but perfect enough to devour the entire thing when I only expected to eat a few bites. Very cool, authentic Italian pizza place. Very friendly staff. Can't wait to order again or have lunch there."}
{"text":"If you have ever been to Italy and return this is the closest to the real thing you will find in good o'l Lakewood. Some of the other reviews that complain about not enough sauce, obviously doesn't know how Italian pizza is made. The crust is crisp, thin and delicious. The ingredients all taste  fresh even when not in season. Caprese salad is exactly how it should be, with high grade olive oil and vinegar. Still going back since it's opening and it still is delicious."}
{"text":"Lots of good things here. Amazing pizza.  Super fresh and high quality ingredients you won't find elsewhere.  We get it for lunch quite often at work.  Standout pizza in a city flooded with pizza places.  Friendly staff and awesome desserts too!"}
{"text":"Absolutely love this pizza!  We have been searching for thin crust pizza in the area since moving to Lakewood over 15 years ago.  We have tried Tomoris favorite and several others...loved them all.  The canolli are wonderful too.  Service is excellent and staff is so friendly.  We do takeout at least once a week because its that good!"}
{"text":"Delicious thin crust pizza! We love a good thin crust and this place gave us exactly what we wanted!! Speedy service, hot and delicious pizza. The toppings are fresh -- sausage is out of this world. Our new favorite pizza place!"}
{"text":"This is my new go-to pizza place on the west side. I love the thin crust and the sauce. The arugula salad was fantastic, too. It was simple and light and reminded me of being in Italy.  If the salad and pizza are any indication of the quality of the pasta, I can't wait to try it."}
{"text":"Havent tried the pizza yet, but the giant sized subs are amazing! Will definitely be back to try out the rest of the menu soon."}
{"text":"Our family LOVES this pizza!  It is a thin crust style.  Their sauce is really tasty.  Their plain cheese is my 8 year old son's favorite pizza locally.  My husband and I have had the La Napoletana, Tomori's Favorite, Mediterranean, and Tomori's Vegetarian.  All have been outstanding! We especially love that they use kalamata olives. You won't go wrong with anything on their menu. My only regret was once ordering a medium instead of a large!"}
{"text":"Ok, I never give out 5-star reviews, and I'm guessing that odds are that I'll have less than a perfect experience the next time I go here, but today I got the house special sub (not sure what it's called), and wow. Incredibly fresh.  Perfectly toasted bun / roll, great lettuce (radicchio? Whatever that kind of nutty-tasting stuff is), killer prosciutto and other meats, cheese, tomato, onion, dressing. Just delicious. Okay, it's just a sandwich, but it couldn't have been better. And pretty big. $8.  Give this place a try.  UPDATE:  arugula lettuce. Tremendous sandwich!"}
{"text":"Had a large pizza with fresh mozzarella and basil, the penne alla vodka (made vegetarian) and arugula salad. My wife and I were pleasantly surprised. The reviews on Yelp are accurate.   Really good thin crust pizza - Italian style (close to Roman-style - definitely not traditional Neapolitan). The pasta sauce had a lot of flavor and complexity. Make sure you ask for it mild otherwise it will be made spicy. The arugula salad - as advertised by Shayna B on Yelp - fresh - perfectly dressed with just the right amount of parmesan (large thin slices are layered on top - but it breaks up nicely in the salad when eaten).   Can't wait to go back !!"}
{"text":"Easily the best pizza I've had outside of Italy. Really authentic place, uses high quality ingredients and very welcoming employees. I will definitely be back to try more of their menu. I can't recommend it highly enough- I hope this place is here to stay!"}
{"text":"Ok this is now my favorite pizza/salad restaurant EVER. The Arugula Salad was so fresh and pizza's were AMAZING- gotta try it"}
{"text":"One day I was looking for good pizza besides the ones that I already know about in Lakewood. So I googled best pizza in Lakewood and this place came up with a list of ten places. This one happened to be on the list. I tried it with the thought that it's going to be overrated. To my pleasant surprise it was slow cooked ( I think it is wood oven) Very flavorful, and well priced.  I have since ordered several pizzas without any compromise with the quality."}
{"text":"Absolutely real Italian pizza. Love the Tuscany taste. It's our new go to pizza place in Lakewood."}
{"text":"Live up the street from this place and thought I'd give it a shot this weekend and to add to a previous review, The Tomori Sub is absolutely incredible.  One of the two best sandwiches I've had in cleveland (the other being the Ban Mi at Taphouse).  I just hope they can keep making such a high qualitiy sandwich for the price 7.99.  I've never felt inclined to leave a review on yelp until now, because i need this sandwich to hang around"}
{"text":"Seriously fantastic. The pizza is crisp and the ingredients are fresh, and the pasta is the work of an artist. I can't say enough good things about this place."}
{"text":"Amazing, four cheese margarita pizza is my favorite!   Also the cannoli's are the best dessert I've ever gotten from a a pizza shop!   All in all, highly recommend"}
{"text":"My Tomori's favorite (specialty) pizza was REALLY good. I wish i had more NOW. I love thin crust pizza done correctly and this was absolutely done right. Prosciutto.  Homemade sausage (resembled summer sausage more than sausage balls). Kalamatas. Flavorful cheese. So good. Tasty. This wasn't some tasteless garbage marco's type pizza.  But...it was 4 slices for $13.99. When they say small, they mean small. 8 inches. I wasn't expecting a ton of pizza but for $14 I expect more than what was received. I get that the ingredients are good quality and it's a specialty pizza, but sweet Jesus, I feel like a chump for paying so much for so little. Maybe I'm just a fatass but i don't know that you could feasibly share this size with someone. But then again it was so good I almost don't care.   I see that is one of the higher priced items on the menu. I guess I'll just stick to the basics in the future.  It's a small spot. One or two small tables. Cooler with bottled sodas.  They offer delivery.  Homemade desserts. Pasta. Salads and subs.   Looking forward to trying their other menu items in the future."}
{"text":"Thin pizzas that are cooked just right. The hidden gem of the Cleveland pizza scene.  Almost through the list of specialty pies, haven't been disappointed yet. As someone who hates olives, these magical pies have even been able to make those appetizing for me.   Have had at least three experiences where the craving has hit and I've gotten a small to devour in the car while driving.  Have always had carry out, so I know nothing of the dine-in or delivery experience, but they've got tables with a classic pizza parlor set up going.   As if all this wasn't enough, they've got cannoli for cheap that come in pairs. Obviously this is for romantic endeavors. You know, cannoli for lovers. In my case, it just means one for immediately after pizza and one for half an hour later."}
{"text":"By far the best pizza in Cleveland.  The thin crust is amazing and they do not skimp on the toppings at all."}
{"text":"Just had Tomoris for the first time today. I created a log in to Yelp just to leave a positive review! This place is the spot for pizza. It was phenomenal! This is my pizza place from now on! I will not be going to any of the \"other guys\" in Lakewood anymore!"}
{"text":"Love Tamori's! I usually order a house salad and Tamori's favorite pizza. The pizza is thin crust and delicious. I think their style of pizza is different than anything else around. It's genuinely an Italian , not American style of pizza. I have always picked up my food and I like that Tamori's calls me when it's ready."}
{"text":"Great thin crust pizza. Got a normal pepperoni/sausage but loved the crust - not greasy and light. Different style from most of the other places around Lakewood/West Park.   The arugula salad was good, fresh, and would have been excellent, but it was a little over dressed. Pasta with vodka sauce was great - normal noodles but cooked properly and excellent sauce."}
{"text":"Ordered Tomori's last night for the first time. Excellent ingredients,  courteous staff, great experience. We ordered a 16\" (yes, they have different sizes) with peppered salami, beef sausage, and peppers.  Excellent! Definitely a do again."}
{"text":"First time trying out this little pizza joint.  We were not disappointed.  The America Pizza has great flavor and the thin crust was cooked perfectly. The arugula salad was fresh and tasty. We will be ordering from them again.   Oh, and the employees were very friendly."}
{"text":"Pizza and toppings were excellent, just a little too thin for my complete endorsement however many love thin crust. Would definitely go back with diff. expectations and smaller appetite."}
{"text":"I've been anticipating getting a pizza from Tomori's and finally got my first one tonight. It definitely tastes like a piece of Italy right here in Lakewood! I've already recommended it to two family members...and that is just in the hour since I devoured the pie. I'll be back soon!"}
{"text":"Recently had the chance to dine in - customer service was great - very polite .  The food was amazing and very authentic .  Our group tried the bbq chicken pizza , the Tuscany pizza , the caprese salad , the pasta vodka, the pasta with seafood , and cannoli for desert  .  Each of us thoroughly enjoyed our dishes . Our favorites were the Tuscany pizza, followed by the caprese salad . The pasta vodka was pretty damn delicious too (spicy and flavorful ) .  And what about the cannoli ? It was not overly sweet , it had the perfect texture between the filling and the shell - definitely worth trying .  Just a heads up if you dine in this is not a fancy pants restaurant . It's small with a friendly family atmosphere . They do not serve alcohol only offering basic beverages . Perfect for a quick bite after work.  We will be back !"}
{"text":"Wait...what?! How does this place get such good ratings?! I ordered a salad and small pizza and it took an hour to be delivered, when I was told it would be about 20 minutes. Then when it finally arrived the pizza was SMALL, didn't even take up space in the box it came in. And the salad a was fine but it wasn't worth what I paid for it. Really disappointing. Don't waste your money on this place, there are definitely better options in Lakewood."}
{"text":"Very good and distinct tasting pizza. Got the Tuscany which comes with steak, green pepper, white sauce and more, and was wishing it was possible to continue eating it every minute I was alive. Nothing was skimped on nor overwhelming."}
{"text":"I've ordered from them twice and it was amazing both times. It is a little pricey but SO worth it."}
{"text":"Some of the best thin crust pizza I've ever tasted. They made this pizza with love. Ingredients are super fresh and flavorful. The crust is thin and crunchy to perfection, holds ingredients well. We will be coming here often!"}
{"text":"Love this pizza. Thinner crust is great and I don't feel so guilty about eating a lot of it!! The only issue I have is sometimes they don't have a delivery person available later in the night. But besides that highly recommend"}
{"text":"Stopped here while traveling. Service was great, prices were reasonable, and the food was DELICIOUS! We ordered a cheese pizza, Tomori vodka pasta and the Tomori special sub."}
{"text":"This place is really great the food is delicious and very fair prices !  The customer service is great what a really excellent staff !! I am really impressed. And they deliver !!! Could it get any better ? I over order every time this is my new favorite place !"}
{"text":"I cannot begin to explain how amazing this food looks and tastes. It's so fresh and looks so good that I didn't want to ruin it by eating it but I did and it definitely was worth it! If you want delicious food that tastes amazing definitely go with this guy!"}
{"text":"Perfection has come to Lakewood!!! Top notch pizza and pasta. I ordered a small cheese pizza & the cappelletti (cheese tortellini w/shrimp, lobster & pink sauce) - it's better than anything I've had in Little Italy! Plus- it was delivered right to my door.  Pizza is a thin crust, light sauce topped with basil. Crisp, cheesy, and cooked perfectly each time I've had it.  Cappelletti is a solid mix of cheese filled pasta, whole shrimp, and chunks of lobster. They don't skimp on the seafood. Sauce is perfectly balanced.  All I can say is wow!"}
{"text":"Hands down best pizza in Cleveland. Flatbread crust with fresh basil, tomato, bocconcini mozzarella and prosciutto is light and decadent all at the same time. It would be a hard sell if my family wanted to ever get pizza from anywhere else here in Lakewood."}
{"text":"I got a Tomori's Vegetarian pizza.  It was unique and very good.  Crispy crust, the right amount of cheese, unusually good selection of toppings.  But we were surprised when we opened the box at home because no where on the menu does it state that it is thin crust.  I happen to like thin crust - it's how I make it at home.  But I think they should mention that on the menu.  I only ordered a medium.  Had I known, I would have gotten a large.  (The section on Create Your Own Pizza doesn't have the option of crust thickness, so I assume all the pizzas are thin crust.)"}
{"text":"There's definitely a reason all the reviews for Tomori's are five stars. We haven't ordered from another pizza place since we discovered them. You can tell they use high quality ingredients because the pizzas (which are thinner crust, which I usually don't like, but trust me, theirs is good) are so delicious. And their delivery is always super fast, relative to the other places in the area.   Let me put it this way. Tomori's is so awesome that my friend, who was a vegetarian her entire life (literally), broke her 25 year vegetarian streak by eating a slice of the All American because the Four Cheese Margarita was so good she wanted to try more. I did not make this up."}
{"text":"I agree with another reviewer you can't really compare this to other chain pizza spots or our beloved Angelo's because it is a completely different product and type of pizza.  We ordered the large Margarita Pizza and the Arugula Salad which was $20.98 which is about the same price as a large pizza and salad from competitors. The pizza ordered was a traditional sized 16\" large pizza with 8 slices and the salad is a one person nice size side salad or if split a very small salad.  The salad was super fresh greens lightly tossed with truffle oil and lots of wide slices of a good parmesan cheese completely covering the top and a thick cut wedge of lemon to drizzle over the top.  A very simple salad but with great quality ingredients it was fantastic.  I would love a big entree salad from here I bet.  The pizza is a thin pizza that we thought was good but nothing over the top. I am a fan of a margarita pizza and if it is on the menu I'm ordering.  The style here is not what I would consider a traditional margarita pizza which typically is a very thin crust (almost flat bread like) topped with thinly sliced tomatoes and fresh or buffalo mozzarella and lots of fresh basil which I wished for when this one arrived.  But the menu and reviews had forewarned me that this was more of a cheese pizza with sliced tomatoes and garnished of basil which was tasty but lacked any wow flavors that I longed for.  No zing!  It is basically a 4-cheese pizza with fresh, good quality mozzarella, parmesan, provolone and feta (interesting choice) cheese, sliced tomatoes and a few thin ribbons of basil.  It arrived hot and the edges are crispy while the rest offered tender bites.  The salad will bring us back to reorder but prob not this particular pizza.  Might try the pasta or sandwiches or design our own pizza and see how that goes.  Ordering was a little odd -- i could barely understand the person taking the order but this might have been that they were on a speaker phone -- I just hoped the order was what I said.  When she answered I thought I had a residence because they didn't identify the business.  A minor thing but might be something to train staff.  So, bottom line is this place offers great ingredients, okay pizza and awesome salad. Delivery was in the time they promised.   We like to support local businesses so I'm sure we will order again.  Lakewood has many independently owned restaurants that we all should be patronizing!"}
{"text":"Well, I can honestly say I am a HUGE fan as I have gotten food THREE times in one week.  All three times I've gotten carryout....I have had prob the best tasting sub I've had in a long, long time.  The Tomori sub....it has such a great and original taste to it.  Bottom line is something about the arugula and the swiss mixed w the Italian meats is like nothing I have had.  Make sure to get extra truffle oil on it as well.  I also had the Tomori's chicken dish which was also very good.  Four good sized pieces of chicken in the dish and the taste was also fantastic.  I prefer thin crust pizza so the pizza here suits me just fine.  The Tomori special pizza was great and the bitterness of the Klamata olives was great.  I would def order this pizza again.  Update 12/15.....tried the egg pizza and it is simply amazing. Do yourself a favor and try this pizza."}
{"text":"It was just ok.  After reading all the Yelp reviews, I agree that #1, the pizza's are small!  Just as folks pictures show.  I cannot justify the price.  I ordered the Tomori's Favorite, medium and was disappointed in the toppings and the size . The sausage and prosciutto were paper thin and very dry/overcooked.  I won't be going back and was really hoping it would have been a better experience.  For the Lakewood area, I prefer Humble and Dewey's."}
{"text":"Our first time eating here and there were 4 tables with 4 chairs each. The staff was very nice and accommodating. The pizza had a thin crust and there was a good mixture of toppings, so every bite was a good bite. I would definitely go back again for the pizza."}
{"text":"My favorite thin crust authentic Sicilian pizza in the area, and by far the best pizza in Lakewood.  Go for the Tomori's Favorite, the toppings are high quality, unique, and well worth the money.  Pizzas aren't huge but a large is a perfect meal for 2-3 people."}
{"text":"I haven't ordered the pizza yet but I did try the Tomori Sub for lunch.  It was beyond excellent.  Perfect ratios of meats, veggies and bread.  The ingredients were definitely superior which was immediately identifiable after the first bite.  i don't think I am ever going to any of the sandwhich chains ever again.  I don't mean Subway (garbage) but the other respectable ones.  I can't wait to try the pizza!"}
{"text":"Thought the pizza is over priced for what you get.  Very thin crust, minimal cheese and toppings.  Tasted pretty good though, kids liked it."}
{"text":"We headed out looking for thin crust pizza and came across good reviews on this gem.  This little place in lakewood has excellent food.  Thin crust pizza with all fresh ingredients was delicious.  Arugula salad with truffle oil was simple and fresh yet tasty.  You can definitely tell they take pride in the food they serve.  The service was great and owner was attentive. If you're looking for quality food that tastes great and great service you must try this place."}
{"text":"This was the first time I've ever gone to a pizza place and they wouldn't split up the pizza. We simply wanted to split the pizza as half vegetarian and half meat pizza.  They said absolutely not so we just went to mellow mushroom where it was no problem.  Mellow mushroom was delicious !!!"}
{"text":"I heard amazing things, so I had to try it. Two Italian brothers working hard and were very nice. They take orders on post-it notes and messed up a couple take out orders while we were there. Nothing wrong with old school, but this will haunt them if it gets super busy. Everyone I saw come in to pick up their orders had to wait 20 minutes or so. We ate in. There are four tables. We were the only ones there.   I wanted an authentic margarita pizza. They had a four cheese margarita. Large is $16. It was shredded cheese and very little basil. The tomatoes were cut pepperoni thin, so they went unnoticed. Sauce reminds me of Campbell's tomato soup and is a bit watery. It was good, but I'll order a Mediterranean if I ever go back.   House salad was good. Heavy dressing but otherwise perfect. Can't go wrong with a variety of greens and Roma tomatoes. I do wish there were some onions or cucumber on it though. Husband ordered the steak philly also to try it, it was dry and didn't impress us. Overall, it's good thin crust pizza but not as great as I heard it was. I believe it's baked on a pan in the oven. Nunzio's and Angelo's still hold the crowns for me."}
{"text":"Up there with the best pizza in the area. Owner is super nice and usually throws in a dessert or soda if you have to wait. Always delicious and clearly using the best ingredients. I love the pizza from here. Hoping for a sandwich to try tonight. Also hoping he tosses in a tirimisu. The best thin crust in the CLE."}
{"text":"The Mediterranean pizza was among the best we have tasted in years.  I would say 'thin crust done correctly!'  Delivery was faster than expected, and Tomori's will be one of the go-to favorites for sure.  Have suggested this pizza to friends who are quite choosy about their pies and am hoping they will like it too."}
{"text":"BEST pizza/pasta take out on the west side of CLE! Super authentic thin crust Italian pizza and super tasty and well crafted pastas. Not to be missed! I hope it sticks around."}
{"text":"This is the first time I've ordered from Tomori's and I'll definitely be doing it again. Though I wish they had the ability to order online on their website, the gentleman I spoke with on the phone was pleasant and efficient. Delivery was quicker than expected. My Four Cheese Martguerita pizza was everything I hoped it would be. Thin crispy crust, fresh toppings, cheesy but not too much, delicious sauce...the best pizza I've had in a long time."}
{"text":"Finally, a good thin pizza place that's good for takeout ( although they do have a few tables). Humble wine bar is the only other place in Lakewood I think that has good thin crust artisan pizzas. I ordered pepperoni and green peppers on my pizza. The crust was baked perfectly and I loved that they added fresh basil and Parmesan. My only negative is that it got a little too salty by my second slice. Also, do note that they currently only take cash. Will be coming back to try other items on their menu."}
{"text":"I was really impressed with this place. I have yet to try the pizza but I ordered two pasta dishes. I ordered the cappelletti and the tortellini. I also asked for chicken in the tortellini and they made it to order with out any problem. I don't eat seafood but I got the cappelletti for my bf at the time and he absolutely loved it.  The service was great as well. I ordered everything by phone and arrived a bit early. The people in the restaurant were extremely pleasant. Mind you I ordered the dinners about 30 minutes prior to closing, which I totally felt bad about but my other half could not decide on dinner and it was a last minute choice; however the people in the restaurant were super friendly, totally welcoming, not even rude or pushy. The food arrived and they even gave me a piece of tiramisu. So awesome! I will definitely visit this place again."}
{"text":"Pizza Isn't worth it. Super small and completely tasteless. Go to angelos. You get more bang for your buck and an actual pizza.   Such a disappointment especially since they are right down the street. I am all for a mom and pop shop, but for almost no veggies on a veggie pizza and no sauce, literally no sauce, it wasn't worth it."}
{"text":"The tortellini is addicting. So much goodness! Generous servings of all their pasta. I know. I've had them all. So yummy. And the pizzas are a delight!"}
{"text":"My wife and I tried a couple of pizzas. Thin crust with fresh ingredients. Very good. Since there aren't many good pizza places on the West Side, this is certainly worth a try."}
{"text":"Tomori's is the best! I have eaten there quite a few times and the food has always been delicious and the staff there has to be some of the nicest around! I usually stick to a pepperoni pizza and Hot Wings because hey are both so good. I've had wings from just about everywhere in Lakewood and as far as buffalo style wings go these are my favorite. Definitely need to try it out!"}
{"text":"So Deweys was closed and Peppers wasn't answering their phone.... What's a girl to do for pizza? Enter this little shop on Madison I barely knew existed.  So far I have tried a pizza (la nepo somthing) and the tomori sub. Both were too salty for me....but could be the incredible amout of prosciutto on each item. They do not skimp on toppings or quality here!  I liked the feel of this place when I walked in. You could hear the chef madly cooking in the back; making sure everything was perfect.  Everything I had was well made and with high quality ingredients. And you could tell he cared about the ingredients.   They have some homemade desserts on the menu but when I called they were out of everything but the cannolies. I can't wait to try a piece of the tres leches cake.   Seems like more of a take out place than sit down. Also when I called they weren't ready to take orders yet and he called me back about 20 min later asking for my order. That was nice.   Give this place a try! I felt the sub was well priced and the pizza was a little expensive but I think the fact that this is a small business  makes it worth spending the extra money."}
{"text":"Great thin crust pizza! I had the La Poletana. It would be 5 stars but I feel like the size was a little small for the price but definitely good quality ingredients. Will definitely try other pizzas here in the future."}
{"text":"Just had their pizza for the first time , it was delicious! Not greasy at all, you could tell the ingredients were fresh, tasted super authentic, overall delicious! I will definitely be ordering again soon, especially since it's so close and they deliver! (Sad it took me so long to try them out). I had the Mediterranean...highly recommend!!"}
{"text":"The pizza here is great. Taste is authentic. Not like your average boring pizza. The 4 cheese margherita is to die for and the Tuscan Italy pizza is also a thing of its own as well. The arugula salad and caprese salads are my favorite and you can't go wrong with  the capelleti pasta. Also the homemade tiramisu is fantastic. Everything here is awesome and I am never let down when I go to Tomori's"}
{"text":"It was a night when I was having car trouble so I was unable to drive to the grocery store to cook. I decided to order a pizza for delivery for the first time in years. I was expecting much less and was very happy to receive a quality pizza pie. It looks small when you open the box but don't let it mislead you, it's very filling. This is most likely because the ingredients are real food and not processed beyond recognition.  This may not be the place for you if you are looking for a giant pizza to eat six or seven slices before you pass out after drinking or whatever other activities render you searching for pizza ;)   It is however a lovely meal if you are trying to have a little more of an Italian experience. It was refreshing to have a meal delivered without the American overindulgence."}
{"text":"This is the kind of neighborhood restaurant that you hope your neighborhood has. The pizza and pasta is diverse. The restaurant is simple and inviting. The food tastes great and leaves you wanting to try next dish. A really cool, great place."}
{"text":"Seriously one of the best pies I've ever had. My boyfriend and I were feeling pizza and wine one night but I didn't want Angelo's (because honestly I don't think it's the bees knees that everyone says) and I didn't want your typical chain place. We yelped and googled and found Tomori's. we ordered the La Napoletana and omg was it amazing. It's your traditional Italian style pie with thin crust. We ate the whole pizza thinking we ordered too big of a size. It was just so good.   It's my new pizza obsession when I want Pizza. I wish i could eat it every day but I usually save it for when I've been good and need a treat :)  GO TRY TOMORI'S!!!!"}
{"text":"Love Love Their Pizzas! Small quaint place the guys speak with their Italian accents which of course makes everything taste better yet! However all kidding aside the pizza is truly delicious!  They also deliver! Just wish we could bring in our own wine and be charged a corking fee! Regardless we continue to go back and love it!! Buona Cera!"}
{"text":"As a fan of thin crust pizza and upon reading good reviews I decided to try this place. Ordered on a Sunday evening around 5:30 PM. Ordered the \"All American\" which is basically their meat lover's. The pizza was just okay for me and VERY SALTY. was also a bit over-baked (but not burnt) but it had that taste to it. Settled my appetite but I probably won't be back. There's better pizza around for better prices."}
{"text":"Really like the Tomori Sub, gonna have to try more."}
{"text":"That Tomori favorite was pretty salty. The veggie pasta had a nice creamy Alfredo sauce that helped balance the flavor. I liked the food and the delivery was pretty good."}
{"text":"If you're looking for an American style pizza: thick doughy crust, dripping with sauce, piles of mozzarella- skip this and go to Angelo's instead. It's not worth you coming here and leaving a crappy review of an amazing authentic Italian pizza. And Angelos is good too - just a totally different pizza.  If you're open to the thin, crispy wood fired version that is an authentic style of Italian pizza, go here!! It's the style you've maybe had at Humble or Vero, but even better! And the quality level of the ingredients really shines.  I honestly have craved this pizza since my travels in Italy 5 years ago, and this was the first time back home that I was transported back to a warm Sienna pizzeria.   We ordered delivery and were amazed to receive a hot, crispy pizza and crisp, fresh salad. We figured delivery was a bad choice, but by all means, don't be afraid to order delivery from here!!  When I called, I was greeted by an Italian chef who was almost comically embarrassed that they had run out of the Parmesan that they usually freshly shave. I had to convince him I didn't care, to which he promised to take care of us with another high quality cheese (he definitely did).   We scarfed down our medium Egg Pizza. Which was plenty for two people. And well worth the money. We were nervous that a pizza covered in eggs, transported in a car for 10 minutes would be gross. Not when the people who made it knew how to PERFECTLY cook an egg on a pizza. Super impressed.  The arugula salad was incredible. Simple as it should be. But unlike all of the thousands of other arugula salads I've ordered. Free from wilt. Full of flavor. High quality oil and cheese.  We were extremely happy with the entire experience and can't wait to make our way through each of the pizzas and subs on their menu.   5 stars for a warm, friendly staff, impeccable service, timely delivery, expertly prepared pizza, and the highest quality ingredients."}
{"text":"people must not have taste buds. Because you can't argue an Italian family making pizza. And the pizza is one of the best i have had since i moved to Cleveland.  Its a tough fight with Bar Cento. I live for margarita pizza. and this is by the best I've had within a 100 miles of here. Ive ordered it several times. and its to die for.   BUT.... (drum Roll)  THE TOMORI SUB. IS ON A WHOLE NEW LEVEL OF WHAT A SANDWICH CAN BE. Since I was 11, my favorite sandwich has been the Italian sub from Brothers in Warren, Ohio. Today marks the day that I have found my new favorite sandwich. The cured meats are nothing like i have had before. paired with the arugula and truffle oil. This sandwich is \"as good as it gets\". It is almost to hard to put in to words how good this sandwich is. The Oil is so rich. I normally throw sandwiches down, but the Tomori sub is nothing less that scrumtrulecscent. I savored each and every bite.   They delivered to W 117. They don't deliver all day."}
