{"text":"Excellent and friendly service !! The store is so unique and makes you want to explore the many varieties of Italian foods !! Not to mention the food is sooooo yummy ! We will be back !!!"}
{"text":"All I can say is a hidden treasure!! The absolute best Italian Sandwiches ever! Great price for all the meat you get!!"}
{"text":"Tony's is the real deal. Great selection of Italian Cuisine, and super fresh sandwiches. Love the service and fresh food!"}
{"text":"Best, Freshest sandwich in Town.  Old school Italian, the way it outta be.  Great Selection of items to make a perfect authentic meal for your family!!"}
{"text":"Italian hero was decent but probably wouldn't come back for it.  The pasta salad was old and some of the pasta was starting to get hard.  No bueno.  Overall I'd say they are coming up short in too many levels. If you want a real Italian deli go to Niccolis not too far from here.  They have one of the best sandwiches I've ever had!"}
{"text":"I worked about 20 yards away from Tony's for about a year, so I've experienced a lot of what they have to offer.  I am writing this review because I am utterly shocked that anybody would rate this above 1 or 2 stars.    They don't bother to turn on the lights in the back of the store most days.  The canned foods in the grocery area are dusty.  I ate here probably half a dozen times, and each time the sandwich had an odd whang to it that I can't identify.  It wasn't *bad* per se, but I quickly learned to spend another 2 dollars for Subway down the street.  I ended up coming here for sodas and candy because it was so close to where I worked, until I caught on that I had to check the expiration date on all the items.  I am sure that the expired sodas and candy bars weren't dangerous, but I sure got a nasty tasing one from time to time.  Also, the prices randomly change based on who is ringing you up.    It's an OK stop if you're hard up for cash and have a hankering for a sandwich with a weird taste, and don't mind rummaging through foodstuffs to find fresh items.  But certainly never go out of your way to eat here."}
{"text":"I ordered an 8 Foot Italian Hero. It was delicious, very affordable and the owner personally delivered to my house at no charge. All my quests were impressed with the hero. Everyone loved it."}
{"text":"This is a nice family run deli. The meat and cheeses are fresh. The price is affordable. The quality of the food is excellent. Try it, you'll love it."}
{"text":"Terrible bread makes for a terrible sandwich, the bread is absolutely awful! If you're from NY, don't bother, you'll be extremely disappointed. check the expiration dates on canned/bottled goods as well, they seem overstocked and can't possibly have the turnover of inventory to maintain freshness.  As a 30+ year customer that is originally from Brooklyn, I was appalled. Jason B. must be from Kansas, to talk about being \"cultured\" and \"old world quality\" strikes me as someone who hasn't a clue.  I give Tony's two stars solely for ambiance, but as to quality, I'd rather eat a scorpion."}
{"text":"So, I am new to the Sunnyslope area and work nearby. Choices when you have a half hour lunch are pretty slim around here. We have Jack in the box, McD's and a Subway. I had never seen this little place because it's so well hidden. A friend who lives in the area recommended I try their sandwiches. Since I'd like to think I'm open to trying new things I walked on in. The deli is quite the interesting little place. Italian posters have taken over the store and it's kept dark. They seemed to have a vast array of authentic Italian foods for cooking at home. The menu offered variety of sandwiches as well as pizza (sold by the slice) and spaghetti. I settled on a salami sub. Wow, I have never realized a sub can taste SO good!! The salami with the cheese they used plus the condiments gave the sub a nice little kick. Everything tasted quite fresh. The tomatoes were smaller and shiny, bright red. The prices are great. What I could tell a sub runs 2.50- 4.00. Well worth it for its size. They also have the option of getting a side with your sub. While waiting for my sub to be prepared I did grab an orange Italian ice from the freezer. Once at work, I found it had no taste. It was just orange colored ice. All in all, great experience! Can't wait to try some more sandwiches!"}
{"text":"This review is composed as a companion piece to the other positives on this page, so please read those for details I won't repeat.    I think Jason B.'s comments most accurately mirror my overall feel for this place. And, while I find Nick S.'s opinions undeservedly harsh, they do contain kernels of truth that shouldn't be entirely dismissed either.    Regarding cleanliness: I contend that Tony's operates on the \"European Standard\". So ,if you've ever been, you know. If your home has anti-bacterial soap pumps at every sink, you carry antiseptic wipes in your purse or on your person at all times, and you fixate on the illusion of a 100% microbe-free world, you may want to \"pass\" on visiting Tony's. I'd assume then, that you would also avoid any contact with street vendors and food stalls in places like Mexico, Madrid, Bangkok, Hong Kong, et al? Yeah, we're all free to set limits on our individual tolerances, but at what cost to the fullest enjoyment of all that our one, single, lifetime has to offer? Scorpions on a stick, anyone? Perhaps a chilled brewski for starters. Do you do calamari, or not?    If you're of the more adventurous sort, at least poke your nose into Tony's for the cultural experience. I consider this place a bona-fide living history museum, with a least three generations of family in evidence, and at your service. Want the lights on in the grocery? Ask. Have a question about ANYTHING? Ditto.    Also, take time to see the mementos, memorabilia, kitsch, and exotic products liberally displayed on,behind ,and above the counter and entry. Yeah, there IS dust, but for me that doesn't diminish the faded, festive charm in the least. Nor does it alter the palpable sense of eras past, and present, that this place evokes in me. See the vintage ('50's?) black and white photo of Elvis w/some past friend or relation. Or, more currently, the color shot of, and shout out from, the entire Orangewood Cheer Squad of '09.    I admit that not everything at Tony's is superfine, or to everyone's particular taste. I don't especially care for the coarse grind of their sausage, for example, but the sliced meats and cheeses are very good, and well priced. I WOULD recommend checking expire dates on groceries, since the turnover on these items is unknown. I've found outdated items at AJ's, Fry's, and  almost everywhere else.  It happens.    If you're up for a purchase, let you senses (and common sense) be your guide. I \"second\" the votes for the subs, and the standard size, traditional cannoli @$2.15 is a bargain. (compared to $7 at Aiello's restaurant on Central, which I haven't tried.)    Another bargain here is the bulk olives. While I'm not a big fan of green or kalamata types by themselves, a good tapenade is always welcome. With jumbo plain greens @$3.50lb., and Greeks priced at the upper end of $5.49lb., you can pay $11 and up for the same thing elsewhere. Let the Snoot in you decide.     To wrap, YOU NEED TO KNOW about their SICILIAN olives. They're black. They're ripe. They're wrinkled, and dry-cured, and shiny. They're salty,(very) not sour. They're earthy, deeply rich, and complex. They're meaty, satisfying, and delicious. They're addicting. They're sprinkled with fennel seed, red pepper flakes, and (on a good day) bits of fresh garlic. They conjure Mediterranean breezes, raven-haired maidens in aprons, and hillsides with goats. They're seaspray and sunshine; they're sublime. And they're $4.49. Match with a favorite wine, a crusty loaf, a chunk of cheese, and you're home.. Where the heart is... OR, you can eat them like candy. Try at least ONE in your lifetime.    Sadly, Tony's skips the minced garlic more often than not. If your purchase comes without, I strongly encourage you to add your own at home. Makes a world of difference."}
{"text":"Yesterday I tried Subway's new \"Italian hero.\"  Let me spare you the $9 mistake.  Tony's special Italian is so far superior, and cheaper.  My day is always better after I've eaten one of his special Italian subs."}
{"text":"Such a great authentic deli. Huge sandwiches, like literally 6 feet long, and all the favorites from the homeland. Cute and quaint all the way."}
{"text":"I'd been going to Tony's for 40 years - since I was a teenager. They make the absolutel best Italian sub/hero sandwich I've ever had. Lot of meat and cheese and a large, fresh roll.  So, why only three stars?  I made the painful decision to stop eating at Tony's after I noticed that when Tony's wife and daughter are making the subs, they do not wear gloves or wash their hands, handling the ingredients with bare hands.  This is after handling money from other customers, etc.  When I was younger, such things didn't bother me.  Now they do.  The owners of Tony's are genuine paisanos and friendly, outgoing people. I hope they read this review and start making the sandwiches in a more hygienic manner so I can go back again."}
{"text":"This is an old school mom and pop store, with a certain authenticity and charm that I find irresistable. I am willing to pay a bit more for their excellent quality and service. Please stop in and help keep them going. Great sandwiches and De Cecco pasta."}
{"text":"Attention everyone when I say this is the best place in town to get Sub I mean it. Me and the wife have been driving by this place for years and decided to stop in and try there sub and am I glad we did. OMG these sub's were AMAZING the flavor of the meats,Cheese just melted in your mouth. And the price of the 8 inch was under $5.00 highly recommend for all. Have to at least try this place. And the staff are real and down to earth Italians. And don't forget the cannoli."}
{"text":"man I haven't been in years to this old school deli it still has that age meat smell witch I like and think it still has food on the shelves when I was here 10 years ago JK the food is still the same as I remembered nothing grate but nothing bad what you would expect from a place like this lots of homemade food and things you can't find anywhere els and the the lady's that work there remind me of my Nonna there not rude but they don't have time for your lollygagging so know what you want don't want there time they have work to do lol the pizza is OK but you go there for the subs the bread is good the pastrami is pilled high with just right amount of mustard there not to expensive give there a try"}
{"text":"This is a small Italian grocery store, not a restaurant so some of the survey questions don't apply such as \"waiter service\" which is really \"counter service\" in this case.  The Pros: I stopped in for a sub sandwich. I ordered the hot pastrami sub, with extra meat. The guy behind the counter asked if I wanted it hot....\"yes.\"  The sandwich was large, so full of meat it was difficult to eat. The meat was really tender and juicy...the way you want it.  The Cons: After I ordered, he disappeared into the back, returned and asked if I wanted mustard. Yes, but I didn't realize that there weren't any condiments or condiment packages out, you had to trust that he would put on the amount you wanted in the back. The sandwich was \"hot\" but not because it was \"toasty hot\" it was because it was microwaved. The roll was so soggy that it wasn't easy to keep the sandwich together.   Recommendation to owner: get a commercial toaster oven or alert your customers that \"hot sandwich\" means \"microwaved.\"  This sandwich would have be extraordinarily good had I been able to add my own condiments and had it been heated in a toaster oven."}
{"text":"Great spot for a fresh sandwich at lunch and a throwback to the way foods supposed to taste.  I'll be back!"}
{"text":"I go here on occasion but the only thing I have bought is their pepperoni it's the good dried pepperoni.   The kind you used to be able to get in the grocery store but for some reason they don't sell anymore.  It's a tiny little store that dark they don't put on the light and loaded with Italian things fantastic reminds me back home in New York for some reason Phoenix just doesn't have to many Italian delis around here so for now I'll stick with Tony's"}
{"text":"This is my favorite place in Phoenix and the best place to get authentic Italian ingredients and pastries. Only place in America I've had the pleasure of having sfogliatelle and they sell them frozen now so you can make them at home! Tony and everyone that works there is so cute and sweet it's never an unpleasant experience."}
{"text":"This was a very delicious experience and quite a surprise! We've been looking for a great Italian deli close to where we live and found this. Ate outside on the patio and the price was great in the food was delicious."}
{"text":"Delicious sandwiches, excellent cannoli, and really charming, old school Italian deli like I remember from living in Brooklyn.  Prices are great, and if you can handle service that's less than lightning speed, definitely worth a try."}
{"text":"After driving past this location for several months, I finally decided to stop.  I was browsing the food specialties section, dismayed at the poorly displayed items, however I did find a package of pastries that looked promising.   The deli area was overflowing with customers waiting to be served and after waiting a few minutes, I decided I would come back at a time when it wasn't so busy.  I put the package back and walked out.   As I was getting in my car I was suddenly confronted by the man that was behind the deli counter.  (The owner?) He had the audacity of accusing me of stealing from him!  This man was actually yelling at me! Never have I been so absolutely stunned  to be accused of stealing! And to think of what those customers must have thought.   While I know this business isn't in the best location, not everyone is underhanded.  My values are high and very important to me.  He had no right to do what he did.  Needless to say, every time I pass this place I feel a bitterness and distaste by being falsely accused and confronted by such an irrational, horrid man that day.  The one star I have given this doesn't rate that high of a mark.  The reviews for the deli are good and that might be so, but I'll definitely pass."}
{"text":"These guys stock WEBER'S MUSTARD and Weber's Hot Texan Sandwich Sauce! Having lived in AZ for all my life I got turned on to Weber's Mustard from Buffalo, NY many years ago,  if you like horseradish, you must try these classic Weber products. The Fresh Frozen Pizza Dough is cheap and awesome! OMG, thaw, rise and throw. Made with the best double 0 flour you can taste the difference. Every time I go in to get dough I always leave with something from their gourmet/East Coast Grocery items. One of these days I may try their food."}
{"text":"This Place me so happy!  Sandwiches are the best, and so cheap.  So much to choose from.  My whole family loves going here to just look around.  They love the Italian ices.  This is really a cool place, that came straight out of the East Coast!"}
{"text":"Two visits on consecutive days, two awesome sandwiches and pasta. When asked if they've been here long, shared a laugh at a very well delivered deadpan 42 years. Pictures of family everywhere, clustered italian deli and dry goods, frozen, take home and cook yourself available. Cash register must be from when they opened, very charming. Had their pastrami sandwich, italian hero, very well balanced between the that-morning-baked bread, juicy meats, and refreshing veggies. Oh, and it's CHEAP! A huge sandwich will set you back $3.25-5.55. Also they have freshly made cannolis! This will become a weekly ritual for me and my co-workers, I'm thinking."}
{"text":"It reminded me of the old NY Italian deli's. I had the Italian Special that had plenty of meat and was delicious. I highly recommend Tony's."}
{"text":"Tony's Deli has been there for 48 years. Yep, right there on the corner. His family wants to renovate the store to make it more modern, and he wants to keep the Nostalgic, old time feeling. What's a guy to do?   I think he should renovate, as an Italian groceries store, I think that would add credibility and people would go there for that specifically. It's a great location, just west of a 5 point intersection, so maybe making it a bit modern with seating in a room with the collectors memorabilia would bring in more customers.  I shop at local, non-chain type places, because these people have heart. Here's a guy who descended through the family, to run this store designed to look like little Italy. He has achieved that. His heart is good. He wants to pass the store down to his son's, they want to make it more modern. see the dilemma?"}
{"text":"Had driven by this place 100 times and got a wild hair to stop in. Looked at a menu and left, came back 45 minutes and got Italian sandwiches. Browsed the store that was stocked full of great imported items you can't find at the local grocery store. The sandwiches were great, fresh ingredients, fresh soft bread, and the man was not skimpy on the meat. Prices were more than reasonable. Definitely has a new regular. I guess being in the same place for 49 years means you're doing a lot right. Thank you!"}
{"text":"First time in here, friendly service and an old school store. This place reminds me of the deli my grandmother used to take me to when I was a kid. The sandwiches are wonderful and a bargain price. Yes they keep the lights off in the back but they do turn them on. Can't blame a guy for conserving some electricity (you aren't paying his bill). Awesomely unique items in the store as well. If it had some indoor seating I'd give it a five star review. I WILL be back."}
{"text":"When my friend had took me here to eat lunch, I fell in love with subsandwich. I love it"}
{"text":"This place is so charming and wonderful. We had lunch here after a stressful afternoon and Tony was just the sweetest guy. Their food is genuine Italian food and you can tell by the taste that it's the real deal. Will be a frequent customer here for sure!"}
{"text":"I moved from NY last year and have been searching for a Ny Italian deli for awhile and I've finally come home!   Their sandwiches are AMAZING...great quality meat and care taken in putting them together,  they really care here.  Cannoli's and Spumoni are excellent.  Can't say enough good, and I've only really been here a handful of times.  (And p.s their sandwiches are better than romanelli's)"}
{"text":"Ok. One of The best Italian in Phoenix. Today we ordered the Special HOAGIE. We are from Philadelphia! The meat in this roll is the best for $7! It's a foot long! As I always have an issue with all bread in Phoenix.... it's always too soft for a real Hoagie. Amoroso is the only roll to use and u can't get it unless u fly it in from YO....Philly. Other then that it's on target for the most part."}
{"text":"I ordered a small Italian hero and it was huge! It only came out to $3.03 with tax! The store itself has so many authentic Italian groceries and ingredients! I stopped here for a quick, small lunch and the owner was very nice. The menu was very reasonably priced. I will be back!"}
{"text":"What a wonderful find. Their subs are huge and great quality. The hot dishes are outrageously good."}
{"text":"Everything in the display looks absolutely delectable. The man that took my order was very nice. The canolis look amazing."}
{"text":"Was so surprised when i walked in. Didn't know what to expect. This place is classic. Great cheeses and meats and some unusual items you can't find in a regular store.   We also ordered a sandwich. Unbeatable for the price.   Loved the Sicilian olives!!"}
{"text":"Hands down the best subs and most importantly the best people in the business. They cook the roast for the roast beef sandwiches in house and it's always a perfect!!"}
{"text":"THEE BEST mild Italian sausage out there! They don't overload it with fennel seed which if you don't like licorice you dont want that taste anyways. They have everything an Italian could want from pastas to sauce to just about everything you could imagine."}
{"text":"What a great authentic Italian delicatessen. Had an amazing sandwich there today and can't wait to go back. So great to support a family business like this."}
{"text":"The place is definitely nice and you can buy some cool stuff there. However the pizza is said to be 18 inches and it's way smaller and doesn't taste good. Don't order pizza there"}
{"text":"Cute lunch spot in the neighborhood. Everyone who was working there was friendly and kind. Our sandwiches were made to order and the bread was really well done. Lots of goodies available in the store."}
{"text":"Well worth the visit and the Special Italian sub was a great choice thanks to the previous reviews. And the next time I decide to cook an authentic Italian dish I know exactly where I'll be grocery shopping."}
{"text":"Amazing meatball sub. Bread, cheese, sauce and of course the meatballs were perfect! Hole in the wall but that might be part of the appeal. Also got some prosciutto de Parma and it was excellent as well. Not in that neighborhood much but whenever I am, I'll be sure to stop by!"}
{"text":"The Special Italian sub is the best sub  in town. The portion of meat is really generous and high quality--much better than grocery deli meat and that includes Boars Head.The bread is fresh and homemade. Also recommend the homemade Italian sausage, both the hot and the sweet.Been a customer since they opened."}
{"text":"I love the sandwiches and the prices are right.  If you are low income,  you can have a great meal with food stamps here. REAL imported meats and cheeses,  all around great place for big appetites on small budgets."}
{"text":"Aside for the enthusiasm that the owner has for the store that place was complete crap.  I ordered spaghetti and meatballs with garlic bread and salad. the salad was bag greens and 3 cherry tomatoes with a little tiny packet of ranch. The spaghetti was overcooked in a half inch of water, the sauce had no flavor once so ever, and it came with one, smaller than a cue ball, meatball, almost flavorless meatball. more like a mush ball The garlic bread was awesome  I also purchased a small jar of pesto recommended by the owner. I opened it just to put on my pasta because it had no flavor. I don't even think I'm going to eat the pesto as it wasn't that good either.  There was what appears to be a homeless man rubbing through the trash looking for food. He was more than happy to eat my leftovers that I was unhappy with.   Perhaps next time I should get a sub.  The pesto was tossed out after the weekend...99 percent full."}
{"text":"Great place for lunch.  Fantastic service.  Love the real Italian food.  We will be back"}
{"text":"This place is a hidden gem.   Came for lunch and got a meatball sub for 5 bucks. The bread was soft, the cheese was perfectly melted and the meatballs were homemade and awesome.   The deli counter has all kinds of Italian deli goodies like prosciutto and fresh mozzarella. Also got some house made Italian sausages for dinner....we'll see how they turn out.   We will definitely be back soon.  UPDATE: came back again and had the spaghetti and meatball\"s\" (only came with 1 small meatball), and the Italian special sandwich. The sandwich was great! The spaghetti was meh and the salad was bad....but the garlic bread was excellent. I'd still recommend the place for a great, cheap sandwich, but I'd stick to that."}
{"text":"This place has to be the worst and dirtiest place in town. I have driven by this place my whole life and today I said they have to be doing something right over there cause they have been here for 40 years . How they have been in business this long is beyond me. I'm Italian and I'm embarrassed for these people. This is the worst sandwich, pasta, salad, macaroni salad, and pizza. I'm so mad they have $16 of my money. I wish I would have lost that money so at least I could be happy for making the day of who ever was to find it. But instead I feel ripped off. F$%#ing disgusting, the health department needs to go in here and shut them down. What a disgrace to Italian food. They have a lot of groceries that look interesting but this place is so dirty and cluttered that I don't think they have sold anything off these shelves since opening day 40 years ago."}
{"text":"So amazing...too many yummy choices.   The special Italian hero is huge!  Very authentic.   The service was extra nice!  Dined on the patio out front."}
{"text":"Tony's.  I'm salivating just thinking about the place.  I'm a gourmet chef and so I can be picky about my ingredients. When I want Pancetta or Prosciutto I get it from Tony's.   He slices it to whatever thickness I need.  And when Mama looks at me with that twinkle in her eye and says, \"I made fresh cannoli...\" I can't resist. Nestled back in one of the frozen food cases is the most wonderful pasta sauce; I keep some on hand for a quick meal.  And it's not just the food items. Walking in to Tony's takes me back to the days when I lived and worked all over Europe and bought many a meal in little shops just like it."}
{"text":"Can't get enough of the \"Special Italian\" sub sandwich.  It's huge and stuffed with meat.  I drive all the way from South Phoenix to eat here.  Definitely worth it."}
{"text":"Great little spot to grab an authentic Italian sandwich!   They are both a grocery and deli and while I just stopped in to grab a bite to eat while I was waiting on my vehicle to be worked on across the street at Mad Hatter Muffler, I noticed that they have some great looking Italian grocery items in the store.      They handmade my \"Italian Special\" sandwich while I waited, and fixed me a side of their delicious macaroni salad.  The very tasty \"small\" sandwich was plenty for me, and I'm a 185 lb guy.  Also, for the size of the sandwiches, the prices are a smoking deal.    I will definitely stop back by Tony's on my lunch break for a sandwich in the future!"}
{"text":"\"OLD SCHOOL\" shouldn't mean just old. Have a look at the grocery items: pickles, peppers, any grocery item in liquid: SO OLD THE FLUID IS GRAY!  So how would \"old groceries\" impact my sandwich?  I don't know, but I'm not gonna try...  Tony's been at this corner forever, just not with my business."}
{"text":"So I visited Ton'y Italian Deli on three separate occasions recently. Each time was a real treat! I feel that I really need to try to drive the Yelper's who appreciate quality, authentic, simple, old world food to make stop at this place.  if you aren't cultured, and do not appreciate the simplicity of old world food, then steer clear and don't waste your time writing a negative review due to your ignorance.  To be a qualified reviewer, you must first have an understanding of what it is that you are reviewing. Unfortunately, a great majority of the younger generation in this semi-metropolis have not had the cultural exposure that many of their own age in old school and well cultured cities, such as San Francisco, Los Angeles, or New York City have grown up in and around.  With that being said, old world, simple dishes, made with simple ingredients and a whole lot of love are often under-appreciated. I urge you to research the importance of things such as bread, cured meats and olives, peppers, homemade sausages, etc. in the old world countries, and even well cultured US Cities.  A physical location that has been around for 30 years in this town that serves up old world cuisine, at an old world price, with a ton of love from the family who has been there from the start deserves a certain respect for those qualities alone.  It is apparent to me that the typical American these days, seems to consider a true sandwich incomplete without Mayo or Mustard. The truth is, that those two additions are fine, but your tongue is uncultured. A true sub should not have such ingredients to cover up the subtle flavors of the cured meats and cheese. A little oil and vinegar add the zing that Ashley C. was speaking of. Again, no disrespect to her lack of knowledge, but knowledge and understanding are power and lead to a well rounded palette.   The sandwiches are only one small item in the full spectrum of this old world rarity, in a not so favorable part of town. The fact is, that this part of town may be a couple of miles out of your daily travels, but it is only a hop, skip, and a jump off the 51.  Any true Yelper who appreciates the few, true Phoenix greats who sometimes fall into the unknown needs to make their way to this abode and see what you think and how you feel. If you feel the way that I do, then I think that the weight that I currently have on my shoulders about helping this quality place to stay afloat, will transcend to you and our team efforts will unite to get these old school purveyors back in the spotlight that they deserve to be in.  Let's keep the growth of true culture and diversity alive in this town before it ends up like Old Town Scottsdale. There, you have a bunch of places with different names and decor, but the majority of the same food and lack of culture or ambiance are spreading like a wildfire that is depleting true cultural experiences and the small and simple places that don't get the love and appreciation that they deserve.   Forget the fancy menus with a fancy plate made in China, you can find that anywhere and they are in a completely different market. Take yourself back into a different time and into a different culture, it will make life more enjoyable and you will be more appreciative of the things that you have this day in age, as well as the roots that the things of this day evolved from. it's like thanking your parents or grandparents for the wisdom that they gave you. :)  Cheers!"}
{"text":"You've driven right by this place a thousand times, of course you have. You've always seen Tony's Plaza, but never thought to stop in and see what's what. Believe me, I speak from experience; I lived in Sunnyslope for years before I found out what I had been missing at an office party. Tony's Deli is the tops - if you are anywhere near here and are getting a sandwich, pasta or anything Italian for that matter from anywhere else, you are just doing it wrong. You may be asking yourself - why go here when delis are usually so expensive? Your first time through the door at Tony's will actually have you asking yourself why you haven't been coming here all along. The uncompromising value and quality of everything Tony sells is second to none. I won't eat at another sandwich shop for just that reason - I can't find anything else as good as this. ***WARNING -YOU WILL NEED A NAP AFTER EATING ONE OF TONY'S SANDWICHES*** ;)"}
{"text":"Just order the special italian sub. Best sandwich ever! They also have the real deal Lombardo Marsala wine for those of you who are interested in chicken marsala. Youtube it!"}
{"text":"Just found the greatest little Italian deli/store in az! Food is great (and cheap), the staff is very polite, and I was really impressed by the authenticity of the whole shop."}
{"text":"What a charming shop!  Everywhere you look the shop teems with stories.  Delicious sandwiches.  I will definitely be back!"}
{"text":"I've stopped into Tony's Italian Delicatessen twice now, so I guess it is deserving of a review. It possesses that \"real\", not manufactured old world delicatessen that seems to be on the verge of extinction. The owners are very friendly and accommodating. In my two visits I've had the meatball sub and the hot pastrami sandwich, both were just okay. They were reasonably priced, so no complaints there, but they just seemed to lack the full flavor I was hoping for. I would def. stop here before a chain/franchise sub shop, but I have had better in the valley.  I still have plans on stopping in to try out their pizza, I'll update my review once completed."}
{"text":"Stopped in for their spaghetti lunch special. Everything was delicious. Had to get the spumoni for desert too,mmmmm."}
{"text":"I had the best capicolla sandwich here! Best Italian sandwiches in Arizona. If you're also looking to shop for Italian groceries then this is the place to go."}
{"text":"One of the last Mom and Pops in America- better get here. Homemade sausage homemade cannoli shells, homemade crostini homemade Italian cookies, super special spaghetti dinner for under  $7.00! Over 50 yrs same location, this Phoenix establishment is probably under appreciated by its community which is sad-what a gem! Stay away from that Olive Garden garbage come in for some real Italians groceries and hot meals to go. Ask Vince about his Sicilian family and Alfa Romero vacation! BTW- About 1 mile south of Hilton Pointe Tapatio!"}
{"text":"I walked in and was a little overwhelmed- this place was packed with specialty items and imported and domestic cold cuts. Wow! If you want pasta, this is the place to go! If you want the best authentic Italian Hero at the best price in town, this is the place to go! I've lived in the area 6 years and never stopped by or knew of this gem. My horizons have been expanded, I plan to be a regular customer!"}
{"text":"Best subs in Phoenix. Tony's hits it out of the park with plenty of deli meats, pastas and REAL, homemade sauces and deserts. If you want a real deli sub with real Italian hospitality made with genuine Italian love a Tony's is the place."}
{"text":"The authenticity of Tony's deli is quite remarkable. They are a family owned restaurant that provides fresh quality items. They are a small Italian store that has a variation of Imports and it has a deli right inside it."}
{"text":"Love this authentic Italian deli!  Great sandwiches and cannolis to die for.  The service is great!  Makes you feel like family!"}
{"text":"Great service, everything is either home made, or brought in fresh! We had the sandwiches that were to die for!!!   A must see in the Phoenix area!"}
{"text":"This place is authentic and delicious. When you walk in you feel like you stepped into a grocery store in Italy. The aroma of cheese, olives, and cured meats greet your nose and make your tummy rumble. The Italian gelato is superb and tastes fresh. My new favorite flavor is spumoni. Try this place out. You will not be disappointed with their sandwiches!"}
{"text":"Reviewers keep saying that this place is authentic??? This place is downright disgusting! The owner DOES NOT wash his hands when he prepared the sandwiches or cut deli meat/cheese. Horrible hygeine! The Health Department and City of Phoenix were contacted after my visit. The aisles of the store were so cluttered with expired canned and jarred foods. Also, the aisles had zero lighting down them.  The food itself was not even close to real, authentic Italian food. The sandwich bread was stale, like 2 or 3 days old. The meat quality was cheap. There are better brands out there to serve people. The spaghetti and meatballs were a joke. There was so much water inside the container. The sauce tasted like it was out of a can. The meatball was tasteless. I was told the sausage was homemade. It was fatty and full of fennel seeds that everytime you'd take a bite, your teeth would crunch down on fennel. The piece of pizza was obviously reheated in a microwave. It was greasy and barely any cheese on it. I am amazed people like this place. People in Phoenix obviously don't know real, authentic Italian Deli's. I am sure if you research other Italian Deli's in the valley, you will find better. This place is bottom of the barrel. You're better off eating from Subway across the street."}
