{"text":"They offer jerk chicken burger however I was curious and ask if they could make jerk Chicken pizza and the guy said they don't BUT! The guy made it for us. So ask they could be their secret order that isn't on the menu. The place is small and neat. Friendly staff."}
{"text":"Food is always amazing!!! Best bacon cheese burger and their pizzas are always hot and super stringy and cheesey!! 
Super friendly service! 
Great location!"}
{"text":"Came here twice this past Saturday. Was in the area and kids were hungry so stopped in and got a Hawaiian Pizza. Kids loved it so much they told mommy about it so we decided to return for dinner and ordered Double pepperoni pizza, honey garlic and hot honey garlic wings. 

Service is fantastic, staff is very friendly, smiles all around making the kids very comfortable. They even ripped out some pages from coloring book and handed the kids some crayon to keep them occupied while food was being prepared. They even switched the channel to Treehouse once kids were done eating so grown ups can enjoy their meal

Will be back for sure."}
{"text":"Me and my friend came here almost a month ago and we found this places thru yelp. We ordered the burger combo with one pound of chicken (mild). The burger was not so great and the chicken was horrible, it was dry and when i bit into it i saw blood inside which was not pleasant waste of money if you ask me. 

Will never return."}
{"text":"Don't like the burgers - they are way too greasy. The BBQ pizza is pretty good. Recently, they have messed up our order twice (for takeout). Last time I called to place an order and told them they messed up last time. I was placing the exact same order again- they didn't even apologize for the screw up, and nor did they assure me they will not get it wrong again. Well, when the order arrived at home, it was the wrong pizza! Disappointed. Not sure if I want to give to give them another try."}
{"text":"Halal - Pizza, Burgers, Hot Dogs/Sausages"}
{"text":"Just had my first meal from here.  It was quite good.  The pizza (pepperoni) was tasty and the wings were even more savoury.  I had the hot honey garlic wings which is a great mixture of sweet and heat.   It was all ready in 15 minutes.   I will definitely go back."}
{"text":"Excellent quality burgers! I ordered a jerk chicken burger and oh man was it delicious!! Quick and friendly service..downside is that it's quite expensive but I will be back to explore the menu:)"}
{"text":"I'm looking forward to frequenting their new joint (they moved from Yonge and Major Mac). They make a mean chicken burger/sandwich - I highly recommend the Jerk or the Chipotle. Haven't tried anything else, but that alone is what will keep me coming back. Also, they are super friendly."}
{"text":"Absolutely horrible service. Food took over 1.5 hours as they are obviously understaffed. They have one guy running around making milkshakes, operating the cash register, taking orders and serving, and one more person in the back trying to cook. When I went, there were about 20 hungry customers who all looked annoyed and fed up. Toppings was great at their old location but I'll never return to the new one. Management really needs to get their act together."}
{"text":"One of the best pizza places in the GTA. Little over priced but it is totally worth it. The owner is very friendly.
For my Muslim friends, everything at this location is Halal."}
{"text":"i just tried their meat lovers pizza beef bacon was AMAZING  cheese ON POINT this is my new favorite restaurant"}
{"text":"Very friendly service and good eats!!! Was craving a burger but the wings and pizza were so tempting. Definitely coming back again"}
{"text":"Average pizza with average toppings. Have a nice selection of halal meat toppings for many are dry. Wings are OK I've had better."}
{"text":"Service was great. Very personalized. Burger was Ok, not amazing. They had a reasonable option to add a side to your yelp burger. Nice seating area. Bbq chicken pizza looked promising for the next time."}
{"text":"Halal bacon cheeseburger!! Yep you heard that right. Nuff said!

I Came here for Yelp! Burger Binge week. I ordered the bacon cheeseburger combo. Burger was freshly made. toppings were A OK. Fries were crispy. Ask for the \"suicide\" hot sauce on the side if you think you can handle it! Great friendly service. Clean washrooms. Free WiFi.

Missed Burger Binge week? That's OK. They got the bacon cheeseburger on sale for $5 every Friday :-)"}
{"text":"it's a plane burger patty, Not much to that.  Fries are extra.  My kids wanted to eat Halal burger, so we tried this place.  it's cozy, but not really for a party.  The presentation is also not that appetizing.  I wish there was more to say about this place, but because it's Halal it's getting 3 stars.  I just think they should focus on quality, make customers happy, not just run a business for numbers, they have the potential to go up."}
{"text":"Try this place for the first time today, my wife and I ordered the jerk burger and a cheeseburger as well as a poutine and one of their milkshakes orange. The cheeseburger was absolutely fantastic and the jerk burger was perfect!
The poutine was very good and filling there was a lot of gravy on it did cause the fries to get soggy near the end, overall I highly recommend toppings great burger joint I will try their pizza next, costing is the issue and cost them a star in my evaluation, you don't get a lot for your money but what you do is pretty tasty"}
{"text":"Tucked away in northern Richmond hill, this is a true halal gem!

5 stars for the service, the counter person was really nice and the manager came and talked to every table about their experience, being a yelper, I love it when I am asked for feedback.

Their homicide sauce is one of the best I have ever had, and the combination with honey is divine, homicide and honey is definitely recommended for wing flavour.

Their burgers are nothing fancy but they are very flavourful and perfectly done, we loved the bacon(beef) and cheese burger, it had the right amount of everything and we asked them to add homicide sauce which gave it a really nice flavour.

Pizza is where I think they can improve a bit, while the pizza was cooked good and they used good quality ingredients in it, I found the taste of deluxe pizza on a bland side, will try other pizzas when I return.

I will definitely be going back for the burgers and wings though."}
{"text":"We ordered crispy chicken burger and beef burger 
The burger taste delicious but it was too small.
Otherwise service was amazing 
It's open for suhoor that's the best thing"}
{"text":"Love the burgers and the fast friendly service. The BBQ chicken pizza is good too."}
{"text":"We come here often, the place is large and inviting, the staff is there to serve you. The food choices are plenty and portions are generous. The steaks and cheese sandwich and popcorn boneless wings are amazing. You have to order at the cash and food is brought to you."}
{"text":"This is my first time visiting this place and the place was good ... I liked the burger it tasted good and crispy fries, would not say the best burger but definitely good I felt like I has similar burger before but I am not sure where specially the place is not franchises ... I liked the service the guy was very nice ... The setup of the place was good but the location was hidden, it is located beside tire services and other places that got nothing to do with food  ..."}
{"text":"Frequent visitor since they moved from Major Mac.  I love the atmosphere and food is delicious."}
{"text":"Small decent place with good service. Had the Jerk chicken pizza and meat lovers. Have to admit, the jerk chicken pizza was 'off-the-hook'. Two thumbs up! Did not try anything else but will return to try their wings for sure. Stay tuned until my next visit...."}
{"text":"\"This place is so under-rated.\"  These are the exact words from my 14 years old niece.  

Toppings serves American pub style pizzas. We ordered take out of a large Canadian pizza, regular crust, and one pound of chicken wings to feed two teenagers and two adults.  We enjoyed the pizza very much.  The dough was just right: not too thick or thin.  The texture was slightly chewy and the rim was crusty.  It tasted good, too.  The toppings were all over to about 1cm from the rim.  The pizza sauce was delicious, so was the bacon.  The chicken wings didn't look so good, yet they tasted great.  There were 10 wings in a pound, so the portion was good.

Though not \"authentic\" Italian style, the pizza was good for what it intended to be.  One large pizza and one pound of wings was a good portion for 4 people.  The total bill with tax was $30."}
{"text":"Really wanted to like this place as I am here for Burger Binge 2.
But you gotta review based on what you received, right?

Fist off there was some disappointment that there was not a large selection of toppings... your name is toppings missing out on an opportunity there.

Burger was just ok.  Slightly dry and little on the small size, but tasted decent.  I wouldn't go out of my way to have another, but if in the area might stop in again.
The fries might have been McCains, again just ok."}
{"text":"Tell me how many times we brain storm And can't figure out when it comes to decide what to eat. Ding ding ........All of a sudden your brain signals for pizza and wings!!!! Then you should try this place full of flavours. Had opportunity to indulge some of their signature item from the menu. Jerk chicken pizza was too good, moderate crust, perfectly crisp bottom with loaded cheese and toppings you can feel separately in a single bite. 

Now comes to the spicy chicken wings. If you have guts to eat super ultra spicy wings you can try their \"homicide wings\" made from Jamaican scotch bonnets peppers."}
{"text":"5-stars because of the amazing service! 
4-star food, good flavours nicely cooked but nothing out of this world. 

You walk up to order and get to pick your table. The atmosphere is nice and roomy, good for large groups. 

We ordered the Tex Mex pizza which had Italian sausage, ground beef and jalapeños. Bacon cheeseburger with fries and homocide burger with onion rings. 

The Tex Mex pizza was really good, their pizzas are more soft crusted, which is what I prefer. The toppings were ample and the medium size is good enough for a single person or two people with small appetites. 

The burgers were good too, I'd recommend the onion rings. They're nice and juicy and you can tell they keep their oil clean. 

I will definitely come back if I'm craving a burger but don't want to shell out $10 for a burger."}
{"text":"Went and ordered a deluxe pizza here, really good, the amount of toppings was just enough not more or less, the guy at the front seems so annoyed or angry for what I don't know, but the taste of the food covered that,  the food gets 5 star but the service gets 3 star"}
{"text":"I wasn't thrilled the last time I was in here. It's a great location to pick something up on your way home. But I was confounded as to why they don't offer individual slices...It actually the first pizza place I've ever been to that does that. Very weird if you ask me."}
{"text":"Fancy names for underwhelming burgers
Not many \"toppings\" to offer 
Homicide sauce is over hyped chilli sauce

I was wondering why they didn't  include description of the burgers in their menu but as our order arrived, it became apparent there wasn't much to write about

On the plus great CS our order came within a few mins. The owner was a very friendly chirpy chap, unfortunately his pleasant demeanour  dont reflect on the boring burgers..."}
{"text":"I haven't tried the pizza here, so any rating I give would be incomplete. My rating for this joint is at a 3.5 as of now.

I tried the Bacon Cheese Burger, which was really good. I loved the sauce on it - but the burger could have used more of it. The poutine was also good. The Homicide Burger was very very spicy for me - though my sister tried it and enjoyed it.

If in the area, I would definitely return."}
{"text":"Great food, especially the Suicide Burger & Chicken Chipotle Burger. 
A little pricey, but worth it once in a while. Employees are friendly and helpful. Must try if you're in the Richmond Hill/Markham area."}
{"text":"This place is legit! I just tried the wings here, and was extremely happy with them! To be honest, the flavour, size, and price was far better than All Star Wings. Homicide Honey Garlic is the best flavour! 

Here's a rundown of my favourite things to order at Toppings:

Meat lovers pizza
Beef bacon poutine
Chicken club sandwich with homicide sauce
Chicken wings 

Everything I've tried on the menu has been on point. This place is halal, but as someone who eats both halal, and non-halal, this place ranks right up there with one of my fav spots to eat.

Owner is really helpful and courteous, and the staff in general are great to talk to and make recommendations. 

Come here, you won't regret it!"}
{"text":"Came here with my friend for an early lunch, place was empty but that's to be expected at 11:30am on a Wednesday. I got the homicide burger which was spicy and juicy, the homicide sauce is made in house and adds a nice kick to the burger. The home fries have just the right amount of crisp and salt. The staff were friendly and attentive. Overall I'm excited that a new spot has opened up in this area and can't wait to try the other things on the menu! I definitely recommend this place if your in the mood for a good quick burger."}
{"text":"My absolute fav spot to come if I'm craving a beef bacon burger! The burger is super moist and delicious! The beef bacon is cooked perfectly! 
If your halal or just craving pizza this is the spot! Their pizza is always fresh and doesn't get cold quickly! Amazing service!"}
{"text":"What to do...what to do...what to do...hmmmm.  Had a late meeting, did a run through Costco.  Need something to eat.  Pizza, wings, burgers...!  Yep...that's what my bud and I wanted.

Found that Toppings had some good reviews.  Let's go \"check-in\" and check it out!

Walked in and no one sat us.  We sat ourselves - near the bar/cash station - they can't miss us there.  Also, two big guys like me and my bud - we can't be missed anywhere!  HA!

Sat there looking for someone to take our order.  Sat there, sat there, sat there...and then yet kept looking around and sat there.  Even saw the owner or manager sitting with some people and not even coming to check on us.

Two big guys, looking real hungry...what restaurant wouldn't want that!?!?!?  Cha-Ching my friends!

3-2-1...that's it.  What a waste of time.  Time that I'll never get back.  A customer that they'll never get back.

For those of you who love the place, I'm not saying don't go.  For those of you who didn't like the food - I can't be with you on that as I didn't even get a glass of water.

Alway remember, we can forget what people say and do, but you can't forget how they make you feel.  I FELT H'ANGRY!  

Had to leave and got a decent meal at Nona's Oven down a few doors.  Lucky that there is a Nona's Oven in the same mall.  They probably served the same type of food, you know Pizza.  At least there was service at Nona's Oven.  At least there was food at Nona's Oven.  Maybe the oven was working at Nona's Oven.  No...I'm not jaded or vindictive at all!  :))

Jeers to them."}
