{"text":"Been awhile since I've been to Tops due to the fact the last couple of meals were disappointing. Menu has a few Greek dishes which are good . Other than that it's your standard pub fare. Burgers were over done and dry last time. Pizza is always a hit though. Have notice that the food has been better during daytime hours as opposed night. Never had any complaints about the service. Not a bad place but food is inconsistent."}
{"text":"I hadnt been to Tops in years because of the distance from downtown where I live but man was the pizza awesome. One of the best crusts Ive had in the city. Plenty of toppings. Its a little pricey but wayyyyy better than the those cookie cutter chain pizza places. I will definitely order again when Im close by its actually worth the drive."}
{"text":"I'm not sure about the other reviews - but I was there on Thursday and the pizza was TERRIBLE!!  No flavor, and it was expensive!  Including tax and tip it was a $23 pizza (medium, 10\") and I only ate 2 slices.  

The wings were good.  We had Honey Garlic, Dill Pickle, Suicide and Thai Peanut.  Don't order the thai peanut - they weren't good, but the rest were fine.

I would go back for the wings only and not the pizza.  Tuesday and Thursday is Wing Night.  10 Wings for $2.50.  we sat in the lounge.  The service was pretty quick."}
{"text":"Great pizza! Crust was absolutely delicious. Also had salt n pepper wings, they were a bit small and dry but not bad."}
{"text":"Tops is the oddball little neighbourhood dive bar/sports bar that I would be happy to call my local watering hole. 

Cont'd below, but first off - As far as pizza goes, Tops are total champions! Super heavy yet not greasy, and loaded the hell up with tasty toppings, Tops does pizza right. We got the New Yorker half and halfed with the Spartan pizza. Steak bites, mushrooms, green pepper, onions and bacon stripes [sic] (actia;;u there were a tonne of spelling mistakes on this menu - @yycist would have a hayday) meets donair meat and banana peppers. It's unruly delicious. It's also close to $40 for an XL (14\").a Worth it? Yeah, we both had leftovers.

You start getting north and what happens? Unfortunately the bars get further and further away. You'd better hope you live next to a fits-all bar that fits you. Or, you know, you could just live a lifestyle that doesn't involve having a close to home spot where you can drink, eat, and befriend the other drinkin' eatin' locals... But I don't even want to entertain that as a possibility...

Now I say sports bar/dive bar. On first look, Tops is surprisingly nice, sporting a giant guitar in the roof. On the ground, the bar counters shadow the outline of the giant guitar. Where the fretboard is, is a long bar height table good for conversational seating for up to 8 people. But for some reason I can't help but think that it is merely lipstick on a pig... Maybe it was the human feces smeared along and adjacent strip mall glass door, and then piled on the sidewalk below, as I approached Tops... Maybe.

But Tops can't be blamed for that, it wasn't even their business! Well, yes it wasn't their business, but can they be blamed? Ehn, I have a feeling that's a different story altogether... I don't yet know the denouement."}
{"text":"Ordered a $19 Sports Burger (simple double bacon and cheese). Expected a couple awesome, fresh beef patties for that price - extremely let down by 2 frozen \"grocery\" patties that were burned and dry. Bacon wasn't cooked and rubbery - an ABSOLUTE JOKE for $19!

Also ordered an overpriced donair - $13.50 and charged me $2 for asking them to put \"a little extra Tzatziki\" as they're usually lacking! It was small and the fries were also cheap, \"frozen grocery\" McCain style crinkle fries. 

Called to inquire about the burnt burger and how that was possibly $19 - and what I should do with my burnt, inedible food - was rudely told by a girl she couldn't help me, nobody was available to talk to and so should just \"deal with it\" (ironically what I was trying to do haha)! 

Never will I order from, or go to this ripoff, joke of a pub again! You shouldn't waste your time or money either!"}
{"text":"The Pizza is pretty good, although they use false advertising for the wings.

Ordered 2 lbs of Chicken Wings to go, $21.  Came in a Styrofoam container.  Got it home, and it seemed a bit light, Put it on a digital scale, and it showed 1 lb 2.3 oz.   There are 16 ounces in 1 pound, so in reality, we only got just a little over half of what we should have, and it was 13 oz short.

Contacted Tops, they stated that the price is actually for 20 wings, and not 2 lbs.  Their site, and menu, both advertise it as weight not quantity.

I'll admit, the wings taste good, but you're paying about $1 per wing.  Unless you're going there on wing night, when they advertise it as $0.25 per wing.

Would be nicer if they advertised it as the quantity of wings, rather than weight of the wings."}
{"text":"Being that Tops is in a strip mall, I tend to assume these types of pubs are a dive, but I was totally surprised when I walked in.  It is well lit, has lots of TV's and has some nice decor, including the guitar shaped ceiling above the bar.  They've definitely reno'd. I haven't eaten food here, but at least I know it's not a sketchy place if I decide to go back."}
{"text":"This is a neighborhood bar that has been around forever; it could use some updating and some menu items could use a refresh but the pizza is great!
Local fave"}
