{"text":"Came here on a Groupon, and found the Groupon to be a pretty good deal. Ordered the lobster ravioli, shrimp and calamari skewer, octopus, and ceviche. Overall, the food tasted pretty fantastic, with the flavours not too overwhelming. Especially enjoyed the octopus texture, not too chewy which was really nice. The wine was okay, although we did get the wine included from the Groupon so can't complain too much I suppose. Service was friendly and even though we were seated at the front of the restaurant away from the other diners servers came by frequently to check on us. Only thing is that the front got pretty cold when the door opened and the breeze came in (it was negative 5 outside). While I'd come here on a Groupon, I'd definitely say the portions lean on the small size given the high price (e.g. only 2 skewers of one shrimp and calamari, 2 pieces of ravioli, and two pieces of octopus), making it a bit on the high priced end for regular priced dining"}
{"text":"Great New Spot in on Dundas, decor is well done. The basement wine cellar was hit with our table. The food was on point... Octopus was awesome. Great tunes as well. Its new they are working out some kinks, we are definitely heading back. Everyone enjoyed it"}
{"text":"Amazing food and atmosphere! The owner is super friendly and accommodating-would definitely re-visit!"}
{"text":"Brand new place cozy, great menu, amazing private room with a wine cellar
Totally very exciting place for Dundas west and dufferin area"}
{"text":"Wow, what an unexpected find. This place has some of the best ambience in the city and excellent food and wine to boot! We started with the tomato salad which is their take of a caprese and it has to be one of the best I've had in the city. Really simple and flavourful. Other highlights of our meal included the meatballs with pomegranate and chicken breast. Both had a nice blend of creamy and tang to them. The service was also top notch and the course progression was perfectly timed. As soon as we would finish one item, the server would be bringing out the next. They we're also particular of not mixing flavours of the dishes and replaced our plates between the courses. If you haven't been, the experince and the food is worth it!"}
{"text":"Toro offers a great atmosphere for a nice, yet casual dinner on the west end. The resto offers tapas dishes that are all presented well and very tasty. 

My party of 2 ordered 4 dishes - all which I would recommend:
- Pulpo - Grilled Octopus - Very chewy and the pesto accompanying the dish was flavourful. Not too spicy either.
- Fritos - Shrimp and Calamari - We only got one shrimp which appeared odd but the Calamari tasted fresh and was crispy. The accompanying dip was quite spicy.
- Chorizo - Probably the coolest presentation wise (came out on a small flame).
- Cordero - Lamp chops with accompanying sweet potato -  Was done medium. The lamb didn't have any major seasoning but I'd still recommend.

My only advice when ordering would be to request the dishes come out slower. Ours came out all at once and we were munching them down to avoid them getting cold. 

Overall, a great experience coupled with friendly service."}
{"text":"I purchased a voucher on Groupon and I'm glad I did. I wasn't sure what to expect, but two glasses of house wine and four tapas was enough to get me to try Toro. 
This place is exquisite; there's been thought into the decor and design. Simple yet modern and stylish. We were immediately greeted by the main waitress/bartender. She was super friendly and was knowledgeable in the dishes she served us. A clear example of how someone serving food should be! 
We ordered the Pulpo, Chorizo, Lamb and Calamari. All great portions for two or three people tops. We had to get the rest to go because we were satisfied and wanted to indulge in the creme brûlée. 

I found that the potatoes that came with the lamb was a little too salty; maybe not salt them too much and let the customer add it accordingly. The creme brûlée, tasty and I appreciate the vanilla bean in there! That being said, and as an avid creme brûlée eater, it was too lemony, the appearance was a little off putting because the creme is hinted with a hue of green and grey. I can't remember if it was lemon or lemon grass. I also hoped the top of it would've been warm but aside from that, I'm glad I visited this place! A great mature place to come have some wine and tapas!"}
{"text":"I really wanted to like this place, but alas, it's not for me. My brother used to say \"when someone describes something as classy, it almost certainly is not.\" This seems to be the case here. 

1. Food: it just didn't taste very \"fresh.\" It was pretty empty when we went, and I wonder if there's just not enough turnover for the freshest ingredients.

2. Service: hectic/mixed: the owner/manager was cool at first, but then I later heard him screaming at his staff (or maybe on the phone?) in the kitchen. Either way, I don't want to hear a grown man's tantrums when I'm trying to eat.

3. Wine: the wine list just wasn't inspiring or thoughtful, and the staff/owner's knowledge about the wine seemed limited. As a wine bar, I was hoping to find something unique and new, but there wasn't really a dedication to basic wine knowledge.

4. Ambience: Like I said, the manager's yelling took away from my experience, but the decor has its pros and cons-- some of it is cool, some of it is quite gaudy. I'm glad I didn't take a date here. 

According to BlogTO it's on the market, so hopefully a restaurant pro can turn it around."}
{"text":"Delicious food, good atmosphere! And they don't skimp on the alcohol in their cocktails.."}
