{"text":"Hands down, this is the best, most authentic sushi place in town. The sashimi is actually very fresh compared to other places I've been to downtown. The atmosphere is nice. It's lovely and quiet. It's one of those places you wouldn't really know of unless you just walk by it. 
We ordered a sashimi set and some tempura. Though the prices are on the slightly steeper side in comparison to other sushi place, the freshness is definitely worth it.
Service was great. Did not have to wait too long for anything. 
It is definitely the kind of place you go to to enjoy and indulge on tasty food and not just to stuff your face with sushi"}
{"text":"The service is very friendly, and the atmosphere is much nicer than Sushi Bento nearby. The portions are average size, and all the specials come with rice, soup, fruit, and salad, as well as complementary tea. The soup is full of tofu, onions and mushrooms, not just a watery broth. Tasty and well priced. I come here often on lunch."}
{"text":"Surprised at mixed reviews.  Eat sushi regularly, and this is best I've had in Toronto.  It's more expensive, but the quality is there.  Pretty unassuming/typical Japanese decor."}
{"text":"Absolutely love this place (especially their chirashi!)

I can't say whether it's the best sushi in the world.  But I can definitely say it's the best sushi in the neighbourhood.  And the staff is really nice.  Japanese restaurant nice.  (it's a certain kind of nice, you know what i mean)

The price is decent.  It's not cheap, but who really looks for bargain-basement priced raw fish?"}
{"text":"I found this place to be completely overrated. 

The only other place more overrated than this was the totally LA wannabe joke that is Blowfish.

Of the sushi we had, the foie gras sushi was an absolute standout, but the rest was mediocre and really uninspiring.

The kushi katsu sampler was good, but aside that, I don't think I would challenge the parking situation or the traffic to go here. 

The tastes have to drive you there."}
{"text":"The sushi was so good but why did I get food poisoning?!? Been vomiting for 5 hours now. It might have been the yakitori because I don't think the avocado roll made me sick. 

Wish my review of this place was better, the staff was so nice."}
{"text":"Excellent food and service-- a rare combination these days. The staff was courteous and the food arrived on time. Strongly recommend you try it!"}
{"text":"This is one of my favourite places in Toronto to eat sushi.
Why you may ask?
Simple.
1. The staff is friendly and are Japanese.  This is not your typical cheap Chinese or Korean owned Japanese restaurant where you get sketchy sushi. The service is fast, but if you wait more than a couple of minutes for your order to come they apoplogise and offer you tea (hot tea for winter and cold tea in the summer). The staff here understand how to make the diner feel welcome and number one. 
2. The fish is fresh.  There is no second guessing when it comes to their food. One of my favourites is the spicy tuna roll which is actually spicy.  We usually order a 20 piece boat which is delicious. 
3. The price is reasonable considering that you are paying for quality and an authentic experience. 
What more could you ask for?"}
{"text":"Ordered a 30 piece platter and they were tiny!!!  Quality of the fish was nothing worth mentioning either, will not order from here again"}
{"text":"This place is really close by my bf's place so we thought we would check it out. For the price point and the service, it's a pretty good deal and the food was decent. I can't say it was amazing, but then again for how much it was, I thought it was pretty good value."}
{"text":"One of the smallest sushi restaurants I have ever been to, with the simplest experiences on record.

I was waiting for my friend to show up at Cobra Nightclub; already three things I don't like.  King Street West, Nightclubs (especially Cobra), and waiting.
I thought I'd pop in for a quick and inexpensive bite so that I would have energy for the debauchery which proceeded me this evening.

The restaurant is narrow, and it has five or six tables.  On the walls hung original painting which were also for sale.  Super quiet, it was only myself, and another table occupying the space.  There was light dinner jazz in the background which I would therapeutic.  
Real Japanese people here btw.

I ordered a few dishes, and then my eye landed on the one thing I couldn't possibly refuse.  Foie gras sushi!  What on Earth?!  I MUST TRY IT!

I absolutely hate it when I am sat next to a couple who are in the interviewing phase of their date.  Talking about their goals in life, what they expect from a relationship in all aspects.  I tried to drown out the next table's conversation, but the jazz was too soft in this completely quiet restaurant.
I wanted to kill myself...I'm pretty sure I made a facebook status update about how much the next table made me want to kill myself.

The food came at a reasonable paste, and finally when the foie gras arrived..I stared at it drooling.  The piece of foie gras was definitely generous considering the size of the rice roll.  I picked it up with my chop stick, and slowly watched it enter my mouth.  As soon as it touched my tongue, the flavours exploded into a million colourful balloons of butterfly happiness.  And for the duration of my chewing, I completely forgot that a single piece of this sushi cost me $7.00.  
The other sushi were good, fresh, but hard to recall because umm....foie gras!

A light snack, the bill came out to be $60.

WHAT THE HELL HAPPENED???!!"}
{"text":"Unfortunately standards have really slipped at Toshi and I fear the King West spicy salmon roll crowd has won out. It's a real shame. Mori san has the skill to be a top sushi chef and the location is excellent. They're in need of a reinvigoration of energy."}
{"text":"I think this is the best Sushi place I've eaten at.  I think they use a higher grade of ingredient for everything.  Service is really friendly."}
{"text":"Toshi is a hidden diamond in the city. It's a great place for lunch because of their lunch specials. There daily specials are $12+. If you want another lunch special but it was on another day, you just have to pay an extra $1 for it. Dinner prices are bit more expensive if you're not looking to spend more. In those cases, you are paying for quality vs quantity. At the end of the day, I would rather cough up another $2 for better food. 

There Sashimi quality is always a hit! They always guarantee freshness. I usually go for their chirashi or sashimi dishes when I have time to have a nice lunch. I've also had their bento box specials and the serving portion is the same as any other Japanese restaurant in the city. Although I have to say their teriyaki is worth trying if you want cooked food.

Their service here is always good. They are attentive and friendly. It's a small and quiet restaurant. I would highly recommend Toshi! 4 stars for Toshi! Hoorah!"}
{"text":"The rolls are definitely tasty, no argument about it. But overall this place is pretty expensive. A specialty roll will run you almost $20 after tax."}
{"text":"Delicious fresh sushi. Some of the best I've had in Toronto. I'd like to take a second to point out that many people who review 'sushi.' Do not actually eat 'sushi' but just like the rolls with the crunchy tempura in them. I had a friend who went on  and on about how she loved 'sushi' and when we actually went for sushi she was all 'ew! I don't eat the raw fish stuff!'

I love raw fish. I love sushi and sashimi and anything to do with raw fish. So I know nice  sushi. 

The food here is of excellent quality. They will even do a tasting menu if you call ahead and request it.

It's not the cheapest, but if you truly like sushi then you don't want cheap sushi."}
{"text":"Having been to Tokyo and tasted the fresh sushi and sashimi there, I can tell you it's impossible to get that same taste here in Toronto - Vancouver, possibly, but not here in Toronto.

Here's what I can tell you:
1) This is the closest thing to Japanese sushi you'll get in Toronto at a relatively reasonable price.  REASONABLE PRICE - that's the catch phrase here.
2) Some who do not know quality Sushi may complain it's too expensive, but that's because they are comparing this place to Chinese run joints like Sushi on Queen, Sushi Time, etc.  This place has a Japanese sushi chef so to view this place with proper perspective, compare it to other joints that have Japanese sushi chefs.  Consider the costs at Hiro, Ematei and Nami.  All of a sudden the price isn't that unreasonable.
3) When I give this place a 5 star rating, I do so considering the PRICE.  
4) Do not ever order anything from the kitchen without consulting various review sites.  The kitchen chef is not talented in any way.  You come here for sushi and/or sashimi.  That's it.  

What I usually get is the 20 piece sushi party plate @ $28.

When Susur was working at his restaurant, long ago, he was often seen eating here.  The place is authentic.

If you're sick and tired of Chinese or Korean run sushi restaurants that think they can make decent Sushi just because the guy behind the bar happens to be Asian and has a big knife, check this place out and do a taste test.  A Japanese sushi chef, trained in Japan, makes all the difference."}
{"text":"My review is based on take out food only..

ordered variety of sushi, seaweed salad and miso soup
great sushi, real deal, no shortcut stuff...
perfectly cooked rice(rice not suppose to be too soft like most places do) 
perfectly seasoned seaweed salad and real deal miso soup
i think i have a fav sushi take out place"}
{"text":"I seriously think they gave me a day old bento box! The Sushi certainly wasn't fresh, the rice was stale, the tempura was soggy like it was reheated, the fruit slightly off, the portion for 16 bucks was way too small. I won't repeat."}
{"text":"Have been a regular here for quite a while. As far as Toronto goes, this restaurant's sushi is as close as you'll get to sushi in Japan. It is a little bit pricier but very well worth it if you actually know sushi.

So what's the difference between your typical all-you-can-eat Chinese sushi joint and this place? Everything. The chef, the staff, the rice, the cuts, and the soy sauce.

The rice is cooked properly. They use the right kind of rice. They season it with rice wine vinegar, sugar and salt. That right there is a considerable difference from the all-you-can-eat 'sushi restaurants' where they can't even get the rice right.

All I can say is that the sushi here is well balanced and authentic. That alone has kept me coming back,"}
{"text":"I'm a totally Wonderbread sushi eater so perhaps I'm judging this place on the wrong parameters, but overall I wasn't impressed with my meal. Service was fast and friendly. Decor was nice. I ate:

MISO SOUP: Delicious, but I've never had a bad miso soup. The needle mushrooms were a nice touch. 

CUCUMBER AVACADO ROLL: Fine; it's hard to screw up this dish!

VEGETABLE TEMPURA: Bad. I mean, still totally edible and satisfying--it is deep fried after all--but it was worse than any other vegetable tempura I've had. The different tastes of the vegetables couldn't be detected; it was totally bland. Additionally, the mushrooms and eggplant were dry, tough and chewy."}
{"text":"Don't be fooled by the exterior of this restaurant, it's truly a hidden gem. Like one of the reviewers said, the people that own this place are actually Japanese. It's a quaint mom and pop shop so don't expect anything flashy. I've been here a few times and keep returning because of the superb quality of fish and other dishes. I'm addicted to their smoked tuna sashimi! My boyfriend loves their beef teriyaki. A bonus is that the servers are are super polite and service is quick."}
{"text":"I've only ever done vegetarian takeout, so this is definitely not the most relevant review for those hardcore sushi fans, but for those vegetarians out there who love sushi, this is an amazing spot. The owners are extremely friendly and take pride in every roll. Normally, vegetarian rolls can be a bit bland, but these are packed full with flavour. Can't wait to go to the restaurant and try more of the menu!"}
{"text":"I went there for lunch last week. Average sushi at an above average price reduced it from 3 stars to 2. The lunch portion of sashimi wasn't as much as I thought it would be for the price. Fish was fresh enough, but it's sashimi so it should be fresh."}
{"text":"I'd been before years ago. I was in the neighbourhood and thought I'd give Toshi another try. I got the chirashi and found it featured a seemingly generous portion of sashimi and a wide variety, too. But upon further examination, I found that the cuts were somewhat skimpy and the selection was heavy on cheaper items such as tamago and crab stick, and light on things like tuna (and salmon, which I know isn't expensive, but who doesn't love salmon?). Fish wasn't particularly fresh, either. I expect better for $30 and can get better at places like Japango, Sushi Couture and Wow Sushi, Japango being my favourite of these three.

What really bothered me was bits of chopped up pickled ginger nestled between the sushi rice and the sashimi. Likely not a problem for most, but it was for me. I hate pickled ginger and it made for painstakingly slow and not so enjoyable eating."}
{"text":"At first my impression was that this place seems like a simple Japanese restaurant, maybe Chinese or Korean operated. The price tag also way higher than the low quality Japanese food. I honestly did not have much expectation.

However, they seems authentic Japanese food. And as I order the katsu don, which I do to every Japanese restaurant I first visit, I found that their katsu don has been the best I have had for a long time. Maybe it is the way it was marinated that taste unique and gave it a kick. Not bad to be surprised by a random selection of restaurant. Happy."}
{"text":"Only went once and I really can't see myself ever going back.  I didn't think the quality of the sashimi was very good...some pieces tasted off.  Others in my party seemed to enjoy their meal more than I did.  Having been there before, they likely had more insight into what dishes were better.  But if you can't do sashimi right, I am not really interested.  In short, I don't think the meal was worth the money and the saki prices were too steep."}
{"text":"I ordered takeout here so it's not really a complete review.
I was there on what should be a busy dinner hour, but the restaurant was empty which is not really a good sign.

I ordered the Unagi Donburi (BBQ eel on a rice bowl). The food came reasonably fast. The eel was rather dry and didn't have enough of that delicious teriyaki eel sauce to mix with your rice (it barely covered all of the eel). What made it worse is the dusting of lemongrass powder which at first made for a nice and unexpectant flavour, but was too overpowering and overbearing.
The dish wasn't bad, but it wasn't good especially at this price.

For Japanese take out I would consider going to Bento Sushi just two doors away, which is more reasonably price and more suited for take out.

While waiting for my take out, I noticed that the atmosphere is very nice. Not trendy or pretensious, just a simple and comfy traditional Japanese restaurant, well sheltered from the traffic of King Street. So I could imagine having a nice dinner there.
Next time I will dine here for sushi."}
{"text":"I had these fantastic rolls recently at an event, and I have to say I was mighty impressed! Take out sushi is often a risky little game, but not with Toshi Sushi, all of their roles held up beautifully! Granted, they were all veggie, but still: rice remained sticky, rolls remained firm and seaweed kept that nice little crunch. 

Beyond the above experience, I recently popped in for a little lunch. Freshest ebi and spicy tuna I'd had in a while, and if you're in the area and you have a hankering for some fresh Japanese, this place won't disappoint. 

Ugh. Now I want sushi something desperate and it's almost midnight. Shucks."}
