{"text":"This seems like a fairly popular spot relative to the area so I'm surprised it's not on here. The owner has large sized articles of his restaurant being featured in the Toronto Star which you notice right away as you enter.  It's a South Asian restaurant but what I like about it is that it's not too spicy. Best dish we had there was the fried fish. I found the other ones like kabobs to be a bit mediocre and most dishes were very oily. They have a cheap chicken \"zinger\" burger which is good and I would recommend their fast food type dishes like rolls and burgers however the restaurant side of the menu is so-so. The menu also has some decent looking selections for vegetarians (though I couldn't understand what most of them are), they have lamb dishes and a few hakka chinese dishes which I didn't try out (only place that I've gotten good hakka dishes from were actual hakka restaurants).  Prices are okay but the quantity isn't very good so you won't get the same amount of food for a $10 dish like you might at a Chinese restaurant. The interior is fairly nice/clean inside and not too crowded at weekend nights (I noticed most people were getting takeout). The waiter we had was very nice and made some recommendations as well.    I'd probably go here again to get a burger or roll but probably not to dine-in. As far as South Asian food goes, I'm fairly sure that there are other places in Mississauga which are better at doing similar dishes but most of them are take-out places and this is one of the few in the West end which is affordable South Asian dine-in."}
{"text":"the food is awful and will never go to that place again. Not only that the owner is proud and stuck up. I complained about the food and quality and he simply denied and start giving explanations.  Given the place couple of chances and it failed each time."}
{"text":"The food is good but the service is complete crap. There's no other way to word it.  I recently dined at touch of spice with my family. The dining experience was such a hassle.   First, we had to seat ourselves. The waiter came by and handed us menus. Get this: they weren't actual menus, it was a takeout menu, the same ones that they had at the front. At least print some proper menus for those that are dining in and not hand us takeout menus.   The waiter came and took our order. Our order was pretty straightforward: 2 canadian platters and a order of reshmi kabobs.  Simple order, right?  WRONG.  The waiter who was clearly inexperienced took our order. He didn't bother to write it down or anything. We placed our order and he left. He brought us our drinks within a few minutes. We waited approx 20 minutes for our food.  He brought out the items for one of the Canadian platter. We assumed the second one was on the way.  WRONG.    We ate through the first canadian platter. Then we waited. 5 minutes, 10 minutes, 15 minutes. Close to 20 minutes I got up and asked what was taking so long.  Guess what? Take a wild guess.  The warier only put in a order of 1 canadian platter.   I specifically told him 2 platters. Maybe if he would have wrote this down, this whole mistake could have been avoided.  There was no apology or anything given. I ordered the second platter and we had to wait 20 minutes, we were all still hungry and didn't appreciate the 20 minute wait in the middle of our meal to get the rest of our food.  The second platter came out and then I asked the waiter if we could get 2 extra naan. I don't think he heard me or he was spaced out or god knows what was going on in his mind but he said ok and guess what?  HE DIDNT COME BACK WITH THE NAAN   at this point I was too pissed off with the service and dysfunctional staff to eat. We didn't bother hounding him down for the naan and ate our butter chicken with a spoon.   I'm so appalled with  the service in this restaurant.   Their food is good. Everything was well cooked and had flavour but wasn't too spicy. but if they keep up with their shitty service the place will close down.   Train your employees, have a good product and keep your customers happy, and you'll have a successful establishment.   Is it really that hard of a concept to grasp?"}
{"text":"I would give this place a 3.5 stars.  The restaurant is quite decent size with fair bit of seating available. There menu is quite big with Pakistani and Hakka dishes. They also provide various family options, take out and catering facilities.   One thing I noticed, they were getting quite a few take outs and reading the menu you were getting best bang for you buck on the take out then site in. To give you an example the Naan (bread) was included in take out meal and the same meal we order in sit in and we had to order naan separately.  The food was decent and some dishes better than other. I loved their mix meat plater with 2 chicken kabab, 2 Beef kabab, chicken pieces on a sizzler plate. Their chicken briyani was good but the chicken pieces were huge which limited the rice in the dish they provided. Their tandoori half chicken was not the best as it was dry and felt blend with no tandoori spice. I also tried chicken karahi which was done nice but the portion was quite small. All in all the food was above average with portions a hit and miss on some dishes.  The service was slow as their was only one server but he was nice in servings us. There is plenty of parking as its part of a plaza. They also have two TVs and they had Raptors Game on one and Cricket on the other.  For my Muslim Brother and Sister - they serve Halal meat and their menu had the HMA (halal monitory authority) certification sign as well."}
{"text":"Owners and restaurant have changed. We went here for dinner on a weeknight and it was full of smoke. We left."}
