{"text":"This place is only okay. It's overpriced, and just can't compare to Sushi Kawa a block away.  Go there instead."}
{"text":"If you're looking for fast food sushi at Tokyo prices, Towa is your place.  Make sure you have a strong stomach as 3 of us at our table got food poisoning.
Big dirty rolls stuffed with cream cheese and everything else under the sun.  Really disgusting if you've ever had real Japanese food.
Avoid!"}
{"text":"I had the chance to dine at Towa with three friends last summer on the patio. The 4th street/17th avenue area is the place to be in the summer, and Towa is no exception. I found all of the offerings here to be wonderful, and I would totally go back. I especially recall an incredible duck salad that we started with. Try taking a seat on the patio if you visit on a warm day."}
{"text":"Owned by the same person who owns Sushi Boat in NW of Calgary, this restaurant serves average quality sushi for premium price due to location, even though sizes of Sushi and Rolls are bigger than those served at Sushi Boat. 

This restaurant charges fixed service charge of 15 to 20%(not sure) for a party with equal to or more than six people and upcharges if you modify the ingredients of menu. I am allergic to dairy products and requested to remove sour cream from rolls and they charged $2~$3 for removing the ingredients. 

Generally and overall this restaurant uses too much of sugar in their food.

There are better sushi restaurants in Calgary such as Zipang."}
{"text":"I don't visit the Mission area often, so I haven't tried very many of the establishments on 4th St SW south of 17 Ave.

My friends convinced me to join them here after an event for food, and I'm glad I made it down.  I showed up late with about an hour until close, but they had my favourite sushi dish (unagi, or eel) so I ordered four pieces of that.

Now, understand that I *love* unagi, and it's a shame that some sushi places in the city don't serve it.  And the portions of eel they serve here were massive!  Most places only give you enough to cover the roll of rice, but this place gave me enough to cover 2.5 rolls.  And the eel was so tender, it felt like it melted in my mouth.

Unfortunately, because I got there late, I wasn't able to sample more of their food, but I will definitely make a return trip!

25/30"}
{"text":"I think a big reason why I was disappointed by this place was that my friends really hyped it up.
Good - love Mission, service was pretty quick and friendly, cute restaurant, sashimi was pretty good.
Bad - I don't know why people love those huge rolls. I really don't like having to break apart my rolls to eat them. While they were nicely presented, I didn't find them to be particularly memorable or appetizing.
Also something that put me off a bit - I ordered a beer, and while I am fairly young, the server waited until after I had ordered and drank half of it to ID me because I look \"really young\". I don't mind being ID'd at all, I'd just rather it happen when I order my drink. I felt sort of embarrassed after that since I'd already drank most of it and I felt like some punk kid trying to sneak a beer."}
{"text":"Good tempura, ok rolls, a little pricey for what you get. 

Towa is very much a hit or miss experience. Some dishes are exceptionally tasty and others are rather bland and uninspired. 

The seafood tempura is very good, with a mix of shrimp, scallop, salmon and snapper in deep fried tempura goodness. 

The sunset rolls on the other hand are underwhelming with more cucumber than anything else. 

Weirdly enough, the ocean roll is quite tasty and unique. Think a chop chop sushi with cooked shrimp as a garnish.

The atmosphere in Towa is wonderful and lively. It is the kind of place that is noisy and busy but still really relaxed. Reminds me of a pub atmosphere with better food. 

Oh, they also serve coke in tiny glass bottles, hurrah!"}
{"text":"It's been a while since I went to eat sushi at Towa. 
 All I can remember is that there was too much rice in their sushi/rolls... as much as 'all you can eat' sushi places put in their rolls. 
 Sashimi was okay, to be honest, they didn't meet my expectations. 
 Also, their edamame (appetizer) was super salty, I couldn't even finish my first pod. 

 Overall, I wasn't happy with the food and I don't think I'll be going back anytime soon..."}
{"text":"Towa had a cool vibe from the moment I came in.  The decor and staff was very modern and authentic at the same time.  The rolls and amount of sushi Towa serves you was unlike any other sushi place i have been to.  It seemed as though almost all the rolls where extra large and the portions were generous, which is a lot to say for most sushi places."}
{"text":"It had been a few years since my previous visits to Towa, but I'm glad I gave it another chance.

I remember when Towa was the hip new sushi place in Calgary. It served huge slabs of fish, exotic (at that time) rolls, unique duck and calamari salads, and even had a delicious special of oysters broiled with cheese. It was packed night-after-night and lineups were consistently out the door.

These days the Towa experience is a bit more sedate. It still gets busy once in a while, but the crowds aren't what they used to be. Bigger, crazier rolls are now commonplace with Globefish and others.

On my most recent visit, I was surprised to see the exact same menu and decor as in years past. And I'm happy to report that the food is still good. Maybe not as distinctive, but still good. Service is nondescript and prices are average.

Not much else to say. Come for a quality meal, not for fireworks."}
{"text":"New to Calgary, so haven't been around to a ton of places just yet. But my girlfriend and I haven't found sushi as good as this place in the city yet. The rainbow roll is absolutely off the charts."}
{"text":"not somewhere that's really REALLY good, i think we just keep going cause of the tempera ice cream.
the appetizers varies from $8-$19
was really hoping that they had beef tataki, but they didn't =[ the agedashi tofu was pretty good, the portionis HUGE tho
we tried the tempura (2 shrimps + veggies) and it wasn't too oily, it was good, i liked it, but the veggie selection was a little weird...deep fried parsley?
there's a.... JUMBO tempera shrimp, it looked so good, so we decided to give it a try.  DO NOT ORDER IT!  it's expensive, super battered and it seem like they chopped up the shrimp to make it bigger or something.
we had the deluxe sashimi assortment once, the sashimi's really fresh, the portion was suitable too.  i had the miso soup last time, it was amazing *droooools
but the saba was really fishy, i couldn't really eat it... i ordered it on 2 separate visits... and they were still really bad.  best saba is at yamato
when you order sushi, the pieces are HUGE.  there's really nothing i can say about their comtemporary rolls, just don't try the fire cracker roll and you'll be good.  the prices for the rolls are all $11-$18.
one thing that was disappointing is that the rice kept falling apart
towa added 2 new desserts on the menu, so we ordered our usual, tempera vanilla ice cream, and something new, avocado tiramisu.
for me, the avocado tiramisu wasn't something that i'll ever order again...
the service was great, the waitresses are really friendly.

i would for sure go again"}
{"text":"This is my favourite sushi restaurant! The rolls are ridiculously good! My favourite is the Black and White roll with the sesame seeds, and the tempura crunch things in it. I don't know why more restaurants don't put those tempura crunch things in stuff! They really should! 

I love the decor in the place too! Especially the paper lamps! 

My only problem is that for every four times I try to go there, it's only open once. I'm not sure what the hours are now, but they're definitely hard for me to keep track of!"}
{"text":"Overrated, overpriced, and overly sized rolls

Calgary needs to step up its sushi game. The whole contemporary rolls worked 10 years ago when people were still new to sushi. Nowadays, people want the real deal. Just ask Toronto and Vancouver, cities that've gone through a Japanese food boom in recent years with the emergence of authentic izakaya, ramen, and sushi places

Highlights
- Freshness of the fish. Toro that night was especially good
- Decor

Lowlights
- Overpriced. 7 bucks for an avocado roll is pure robbery
- Comedic size of the rolls. The rolls were very sloppy, containing too much rice and falling apart as we ate it
- Greeting me in Japanese when the place obviously isn't Japanese doesn't do anything for me

Recommendations
- Less is more. Each 6 piece roll could easily be 12. That way, allow the customer to try a few more things
- Sell the freshness of your fish, not the over the top rolls. What's the point of fresh fish if you over-complicate it"}
{"text":"Had gone for dinner here today. Great sushi and a lot of different styles. Being from Vancouver, I would approve. I should post a pic but what I ordered was amazing. A little big for my mouth but still delicious. I have to figure out the pic posting soon."}
{"text":"Went to Towa for lunch a while back and were pretty disappointed. Nothing was breathtakingly bad, but nothing was standout delicious and the prices where pretty high ($12 for an avocado roll?!). We had:

Miso soup and the Special Miso soup - Generally tasty.
The special miso was a slightly sweet version from Hokkaido, advertised as cooked with vegetables (1/2 a carrot slice and 1 piece of potato) and fish (two small pieces of boiled salmon). An interesting variant on the usual miso, but nothing I'd run out to get again.

Agedashi tofu - 50/50.
Served in a comically large bowl, the sauce in the bottom was quite tasty and nicely warmed; however, the tofu itself was not particularly well cooked. I love when the tofu gets soft and almost molten in the middle (I seem to recall Zipang having great agedashi like this). This was just sorta warm.

Various sushi - Serviceable.
I really don't like the way they cut their sushi, super thin and long with ~3/4\" dragging on the plate on each side of the rice. The fish was fine, but if the fish is great, I'd rather have a shorter, thicker piece I can really sink my teeth into.

Wave creative roll - Blah.
Perhaps my fault, I should have realized that the kani salad would be mayo-drenched california roll filling. However, there is no reason why that needed to make up fully 3/4 of the contents of the roll. The red pepper was a nice touch (more please). But the tempura shrimp and scallop where segregated to separate ends of the roll. What caught my eye on the menu, beets and corn, ended up being a sprinkle (3 brunoise sized pieces of beet! slightly more corn) of veggies that I had to place on each piece before taking a bite."}
{"text":"Sushi is always fresh here. Price good for the amount received. Please note that one roll will fill you up... the pieces are huge! If you are ordering individual pieces, go for the sushi instead of the sashimi... I found the pieces to be larger. The rolls are a bit hard to eat, so try to master the skill of biting them in two or else you'll look like a chipmunk!"}
{"text":"Great sushi, romantic ambiance, awesome service - you can't go wrong with Towa Sushi.

Nestled in the heart of 4th Street, Towa Sushi offers authentic Japanese cuisine in the trendy neighborhood known for Lilac Festival, great eateries and a toned down version of 17th avenue. Although the prices are little above average, their portions make up for it. The rolls baby! 2 rolls can feed 2 generously, they serve unique dishes you won't find anywhere else in town; Duck salad served with cantaloupe and oranges, Ishikari soup (my mouth is watering just thinking about these two dishes), and deep fried ice cream.

Towa Sushi stole my heart the first time and although I do enjoy eating at Kinjo or Globefish once in a while, its always a treat to eat at Towa. I wish I checked in with Yelp every time I've been there in the past; I'd have a badge for this place for sure!"}
{"text":"My salmon sashimi was almost still frozen.  The menu was a bit pricey as well.  I would recommend the nearby Sushikawa instead...."}
{"text":"I enjoy Towa for a twist on traditional sushi.  They have a bright, modern space on 4th St and 22nd Ave SW.  The space isn't huge, so don't be surprised to find it full.  They are very quick and efficient though, so the wait is never too long.  The rolls are huge (2-3x the diameter of a \"traditional\" roll), so take this into consideration when ordering!

Some of our favorites:
- Salmon Tataki - generous slices of salmon lightly seared on one side - flavorful and melt-in-your mouth deliciousness 
- Towa Special Roll - huge roll packed with salmon, red AND white tuna.  This roll is sure to satisfy your sushi cravings
- Fire Cracker Roll - tempura'd jalepenos, cream cheese and smoked salmon - this one is for when you want something completely different!

We often get takeout from Towa, and they are usually quite quick even when the restaurant is packed.  This is a great option if you want some good food but a quiet night in!

Review #27 of Yelp's 30 Day Review Challenge"}
{"text":"Ahh~  I'm half a year late with this review.  Is it fair to review this place with my Californian standards?  I wasn't expecting super awesome sushi in Calgary, but I wasn't satisfied at all with the rolls and especially the price!  Not worth the long wait at all :\.  I will note, however, that this is my cousin and his friends' favorite place to get sushi in Calgary when they want special rolls.

The most memorable rolls for me were the Black & White Roll and the Spicy Salmon Roll.  All the other rolls we ordered (Alaska, Spicy Tuna, and :(( I don't remember the other two) were more plain.  The thing I didn't like the most about Towa was how big each piece was~  Sushi is meant to be eaten in one bite, but it is totally unreasonable to put such a huge piece in your mouth at once x___x.  I think ruins the experience of eating sushi because you don't get all the flavors you're supposed to at once.  I mean, please, shove a whole piece in your mouth but I don't think you will be comfortably or enjoyably chewing it...

I don't remember what our total was, but it ended up being $25 per person.  I wasn't even full!  /)___(\  Oh, Towa..."}
{"text":"Hands down my favourite sushi joint in Calgary. I've been going here for many years. The portions are huge and the food is amazing. My go to item is the spicy salmon roll! One of the downsides to this place is that parking is not always convenient."}
{"text":"I stopped into Towa for a little post work Sapporo and Sashimi the other day. Its a cute little spot, comfortable with prompt service. 
Of course, by prompt I mean before I could open the menu, which was a bit peculiar . The waitresses appeared to be wearing some sort of sailor moon inspired get up , which was also cute despite the fact that it fulfilled  certain stereotypes one who grew up on Anime might hold.
The sushi was quite good actually and about the standard going rate of sushi in this city. 
Realistically, I feel like Hana is cheaper and possibly a little tastier and I would probably just cross fourth street next time and eat there but Towa seems a simple alternative."}
{"text":"I'm a sushi newbie & want to get that out there!  I cannot give an objective opinion on the quality of the sushi itself, as I have not had enough in my lifetime to give anything but a bs'd opinion - BUT I still have opinions.

All in all, my experience was pretty good.  

Miso soup was tasty, however the bowls make it almost impossible to finish with the spoon & you either have to leave a lot in the bottom (or be ballsy enough to pick up your bowl & slurp away.)

Firecracker roll was awesome!  Great combination of flavors & texture. I'd eat one right now if I could.

The mugs they serve tea in are pretty cool. However given the size compared to more traditional tea cups, they get really friggin' hot & I got myself good. Ouch.

Portions are big.  I would prefer slightly smaller pieces so that it would be easier to pop them in my mouth.  I feel ridiculous biting into them and having them fall apart, but also too much for a mouthful.  Also a little heavy on the rice I found.

We had our leftovers boxed up & walked away without them.  Fortunately our server noticed & caught us at the door."}
{"text":"You know. I really wanted to like the food at this restaurant. The decor I love. The staff are great. But the quality of the fish is pretty average, and believe it or not, I've had much better quality fish at Sushi Ichiban and Sushi Ginza, and other Chinese owned sushi places.  I'm basically a sashimi guy, so the quality of the fish I what I go for.  So far, Blowfish and Globefish and Wa's is better, and I've yet to try Hiro and Zipang."}
{"text":"This is still my favorite Japanese restaurant.  It has not fail me.....not yet and hopefully it will not ever fail me.  

I went there on Friday after work to have a girls night out.  We knew how busy it could get (especially on a Friday night), so we got there at 5pm.  Yup it was an early dinner but the service and food were still amazing.  

Some people might think that it's a little bit pricey, but I think it's worth it.  They do have excellent service and the food is great (BIG ROLLS! FRESH SASHIMI!  HOOOOT TEA!)  Really that's pretty much what I ask for in a Japanese restaurant."}
{"text":"I am such a small town boy. I don't know how to distinguish the quality of fish based on texture and consistency. I don't know what shade of white rice is the best white rice, or what age the chef was just by looking at the tightness of my sushi roll.....
What I do know is this place is nicely decorated. The staff was very friendly. The rolls are HUGE, and delicious. Large Tempura, big tub of ginger... and presentation was beautiful.

Must try."}
{"text":"Delicious! Once you overcome the Parking Games of Mission, you're greeted with friendly staff, clean decor and fresh cups of tea. 

We started with their Ishikari soup, a salmon miso soup with vegetables (mine had chunks of potatoes and carrots.) Then sampled a platter with assorted sashimi, which was fresh and very generous in portion size. The fish was so fresh that we ordered more sashimi before moving onto our rolls.

Generous portion size seems to be a theme. The rolls were some of the biggest I've ever seen. All rolls seem to be two-biters unless you reeeeally can take it like a champ*. And how many times can a girl say \"there's no way that can fit\" only to have it disappear into the abyss?... Wait, what? I digress.

We had the Playboy Roll, which came wrapped and tented with tinfoil on a sizzling plate. The waitress then lit the plate tableside, creating a spectacle of \"ooh flames!\" (This was how we came about the roll in the first place, when a table across the room ordered it. It's about the only time we can get excited about any kind of Flames lately.) After the flames die down (d'oh), the tinfoil is opened to reveal a delicious roll of salmon and yam topped with shrimp and crab, with the entire roll drizzled with a spicy mayo-type sauce. The sauce really brought out the sweetness of the crab and days later, I can still remember the taste of the smokiness from the ooh flames! 

We also had the Spider Roll (pretty standard fare) and ended up cancelling our other roll because... huge rolls. The meal was finished off with tempura vanilla ice cream.

The service was attentive. Our cups filled regularly and our plates cleared promptly. And there is the running gag of \"That's What She Said,\" every time a roll comes.

Pros:
Playboy Roll (especially if you're a closeted pyro)
Portion size

Cons:
Parking
Portion size

*It's the perfect place for a first date, guys!"}
{"text":"I had wanted to try this sushi place for awhile since I always pass by it on 4th Street. Not only was I so disgusted with the food, the service was horrendous! If I wanted to pay for over priced disgusting sushi that I later threw up, I would've went to Zipang at least I know I would be getting quality sushi. To make matters even worse, I found not 1 but 2 bones in my salmon sashimi. Talk about grosssss! I brought it up to the server/manager and her response was \"Oh.\" And walked away. I suggest if you want to waste money here, you'd be better off eating a fillet-o-fish from McDonalds."}
{"text":"Great Quality Sushi and the staff is too nice! 
I hope you dont go though because if you do Ill have to wait longer in line. Some folks dis this place cause the rolls are quite large and not typical. Well go cry your eyes out Vancouver boys, At least its not a dive (well, except the bathrooms) and the workers are in Canada Legally 

Pros:
Quality
Size
Service
Price (11-14 per roll)
Free tea!

Cons:
15 min wait  (no reservation option)
Rolls to big (wahh wahh!)

Anyway order the following:

Avalanche Roll
Unagi Roll (just tried it... I liked, bit risky for first time)
Dynamite Roll (100% delicious)"}
{"text":"I love this place. I've been once with my friend Myla who introduced me to this place.  OMG  sooooooooooooooo Good but pricey BUT worth it!

I had: 

Teriyaki chicken  Roll - a must have 
Wave Roll - It was ok but too much crab meat for me
Assorted Tempura - yummy but $$$
Tempura Ice Cream - green tea  ----------------  so worth it and the main reason why I WOULD COME BACK EVERYDAY!!!

See my pics!!!"}
{"text":"Towa Sushi was a surprisingly great find on 4th Street SW in Mission.  The space was comfortable with a contemporary wood vibe.  Nice place.  Chairs and tables, no booths, and not crowded.

The best part? The sashimi was fantastically tender.  Melt in your mouth soft.  I asked the manager if the fish was imported from somehwere special and he readily admitted it was the same fish that every other sushi restaurant purchases.  Apparently it has something to do with the cut and manner of preparation (of course it does, buddy, of course)... Well, truth or not, there was a noticeable difference in taste and texture. Best sashimi in Calgary so far!

My friend enjoyed her salad.  The avocado and tuna/avocado rolls were huge, and the edemame was fine too.

Towa Sushi is a great all around sushi restaurant.  Only downside?  No Perrier, no club soda... Really?"}
{"text":"I love the sweet soya sauce and the giant massive rolls!!!! It is slightly overpriced but for Calgary sushi it's a solid choice!"}
{"text":"We ordered 3 rolls last night - ebi tempura, salmon and the Towa special. The total came up to $47.00 and it was more than enough food for us. The dynamite roll was particularly good - instead of seaweed it was wrapped with tamago. The only issue was some of the salmon still had a it of the skin of the fish. The salmon roll was quite plain I think its best to stick to the tempura based rolls. We ordered the Black and White roll (salmon, tempura) was delicious - I love the texture and taste of this roll. We also tried Sunset roll (mix tuna/salmon). The tempura roll and the Black and White roll are winners. The rice was quite nice. Three specialty rolls will definitely fill up two hungry people."}
{"text":"Cute restaurant and atmosphere. Decent sushi but wouldn't call it the best. If you like huge rolls then this is the place for you. A little bit on the pricier side with there being so many more sushi options in downtown. I suspect that the owners are Chinese as the food isn't that authentic."}
{"text":"Believe it or not, this is my first time at Towa. I'm not sure why i've never been here before as I've heard nothing but good things about this place. Well it definitely lived up to expectations. For Calgary, this might be as good as Sushi gets. If you're from vancouver, it doesn't compare, but for Calgary, it's great!

I enjoy the building that they are located in, however the inside decorations were a tad disappointing. It's almost like Towa isn't really sure what look they're going for.

The sushi and sashimi was excellent, I will definitely be back for more! The service was decent; friendly, helpful, prompt. The price was reasonable as well. I felt it was appropriate for what we got.  All in all, no complaints!"}
{"text":"Everything is inedible. The roll sizes are the size of burger patties and the cups they serve the tea in, transfers heat so much that you literally cannot even pick it up.  The flavours are nice and the ambiance is great, so is the location. Hope they make more human friendly rolls soon. And cups"}
{"text":"This place is horrible. The food is okay, but the service is awful.

My review is being posted late, but when I went with a birthday group, the host gave away our table, made us wait 45 min extra, then when we were seated he tried to fight us (yes actually fight us) because we were irritated our table was given away, then our food took another hour to get. The waiter was fine, but after we contacted the owner about our experience and received no response.....well it compelled me to write this review."}
{"text":"There is nothing negative to say about Towa. It is absolutely delicious. Not only do they serve some amazing dishes I have never tried before, their sushi is a big portion. They don't stiff you on anything here! I love that they serve coke in glass bottles too! They allow you to pack your unfinished food away, they are always replenishing your glasses with water, and they're always picking up empty plates. The service is great, the atmosphere is very sophisticated and fun.

The only downside is the parking. Boy, is it hard to find street parking. When it's super busy you're either walking a long distance or you're stuck paying at the parking lot and it's 3 dollars every 30 minutes. What a joke. But that has nothing to do with the actual restaurant itself. Just a fair warning for those that drive! I highly recommend Towa Sushi!"}
{"text":"After passing by the night before, my coworkers and I decided to stop in here for dinner the following night for some light sushi. I had read the reviews and after deciding that the only flaw people could talk about were the size of the rolls, I decided how could a roll be too large? So we went.

To start, the menu is extremely overwhelming with the amount of new sushi options that I had never even heard of before. The reviews spoke mostly of the playboy roll which I immediately knew we needed to try out and we were also attracted to the mango special roll. Once the first roll proceeded to come out we were baffled at the size. I literally had no idea a sushi roll could be so large, but yet it was a little too large. We laughed about it and the sushi was indeed really delicious, but in my opinion it was really about the presentation here. 

The sushi was good, but not great. The presentation was amazing. The atmosphere was fun and the waitstaff was extremely friendly. This is definitely a good option if you want fun new types of sushi, fun looking sushi, or a place you would like to eat good food while hanging out for a long time. There was nothing bad about my experience and we definitely enjoyed the \"too large\" rolls and I would indeed go back. Overall, I wish I could rate this 3.5 stars which is my true feelings regarding this restaurant."}
{"text":"Fave sushi place in calgary. We go here about once a week. Definitely get the bank for your buck on the amount of fidh you get in the spicy salmon roll and towa special roll. We akways order and extra side of spicy sauce. They have sweet soy sauce and have help-yourself ginger, which is awesome if you find you dont want to keep bothering the server for more ginger. Udon is my fave here. Some nights we can get in and iut in half and hour or less!"}
{"text":"Nice place, friendly staff and really good sushi. The Sashimi was excellent too.

The biggest downside is that THE ROLLS ARE TOO BIG.

You can never fit one in your mouth, it ends up falling apart or you have to wrestle it with your chopstick, which totally ruins the experienced.

you almost need a steak knife and spoon for the sushi rolls.

If only they would make the rolls fit for a Normal mouth ! :-("}
{"text":"I have always enjoyed coming here for their sushi. The sashimi is a bit expensive for the size of slice - which I feel is a bit small. But their rolls are huge! And they have a good variety of rolls. And I do like that they allow you to order half or full rolls on some of their rolls."}
{"text":"If I could choose my own execution method - it would be death by mercury poisoning due to a major sushi overload. 

Towa Sushi has a great location - right down on Fourth Street with lots of people watching. They have a great selection of rolls, traditional and a bit more exotic. The prices are a higher than average but so are the size of the rolls - three rolls can usually fill up two people. And really, who only orders three rolls - lots to take home. They always serve your Saki fast, never rush you with your bill and the mood lighting makes it a great spot for a first date. Walk south for a stroll along the Elbow River or north for a stroll down 17th Ave. 

What are my favourite rolls there? I always order the same thing at every sushi place - spicy tuna, crispy tuna, dynamite roll. I tell myself it's so I can compare places better. It's actually because I like what I like."}
{"text":"My girlfriend I decided to go to Towa for lunch recently. I had been here before and loved the sushi, but this time was not impressed at all. We ordered the avalanche roll and shrimp tempura roll. I did not realize how huge these rolls are. They are impossible to eat! The avalanche roll was literally an avalanche of unappetizing cream cheese and crab slop dumped over messy chunks of salmon loosely wrapped in rice. It looked disgusting. The shrimp tempura roll was also massive, mostly rice and impossibly to eat. I expressed to the waiter that we were not happy with the sushi and could not even see how we could eat it and he suggested I get a knife and fork. I told him in my experience a roll was usually a bite size and beautiful to look at. His response was that this is contemporary sushi and again would I like a knife and fork. I have worked in the service industry and what I would expect is to be offered something else from the menu and an apology for the presentation, even if this is how they think sushi should be served. I will never go back here, and in the long run that does affect a business. Really poor customer service and horrible sushi."}
{"text":"Towa Sushi could have been rated at 4 stars, if not for Sushi Kawa situated just half-block next to it. And in comparison, almost everything in Towa is one star less, in my opinion...

Like, servers for example: In Sushi Kawa they remember you, they smile and yell happily, they sit you at your favourite table and lower the blinds when the sun just attempts to bother you! In Towa guys are nice, but neutral, and do not recognize you the next time you arrive.

Or the rolls - Towa makes them huge, with all those strange constructions over them (the one I particularly hated looked like a frozen bunch of noodles). It is simply uncomfortable to eat, guys - though to each his own taste, I understand...

Prices are ok, food quality is ok - it is a comparison who kills the least comfortable alternative. So after a couple of attempts we were like - no more Towa. Sushi Kawa is so much better! And so it went for us. I suggest that you'll compare for yourself - who knows, maybe you'd still like Towa more?"}
{"text":"The house rolls are MASSIVE!  If you're a westerner who thinks \"bigger is better\" you'll get your money's worth here.  If you order a house roll you probably won't have to order anything else.  One fills up a person easily.  The sushi meat is pretty fresh and prepared pretty good if you're ordering sashimi and nigiri."}
{"text":"This place specializes in fotomaki, giant rolls. The fish to rice ratio is carefully balanced and the rolls are very creative. They also have an awesome sweet soy sauce that is delicious. I love all of their large sushi rolls, the chef puts a lot of effort on presentation and they're all so good. Every roll they have is unique, do not hesitate to mix it up a little. 

The sushi per dollar ratio at Towa is reasonable but you have to like giant rolls to appreciate it, otherwise the menu may appear to be more expensive than other Japanese restaurants.  Sometimes it can be pretty busy and they don't take reservations so you may have to wait for a table. Most of their tables sits 4 so larger groups beware. 

There is something about the tea here, it's really good!"}
{"text":"Towa is and has always been one of my favorite spots for sushi. The fish is so fresh and you are getting quality over quantity. Watch out though because even if it doesn't seem like you have ordered a lot of food, the rolls are fairly big and the sushi portions seem to be double what they are at other restaurants.

One thing I highly recommend you try is the spicy salmon tempura roll! The entire roll is deep fried and cut into four pieces, served with spicy mayo drizzled over top and dashes of togarashi spice! Delectable! Keeps me wanting more! Towa doesn't take reservations, so if you want to get in on their delicious rolls, you may have to wait. Don't worry though, its worth it!"}
{"text":"It's proving to be very hard to find a good sushi place in Calgary.  But we decided to try Towa as I read the other reviews.  It turned out to be great!

The service staff was very welcoming and we were able to get a table without a wait on a Saturday night.  

Their menu is a bit pricey but the rolls are HUGE!!  You definitely get enough for what you pay for and then some.  But it can be quite hard to eat.  I definitely don't recommend this place for a first date or business meeting.  

Tempura was lightly battered and a good variety of vegetables.  Their fish was quite fresh and love the ginger!  Not the pink coloured stuff the real white pickled ginger.  They leave the container on the tables which is an added bonus!

Will be back to try more rolls."}
{"text":"Excellent rolls.  Their portions are huge and everyone is nice and friendly.  Try the Playboy Roll.... it's amazing!"}
{"text":"Horrible. Fish was not fresh and smelled awful. Still had to pay for food as the server didn't understand English well enough to understand my complaint. Won't be back."}
{"text":"It's very delicious! The plate size is very big. Recommend marine salad, playbill roll with fire Lol, chirashi sashimi. It's a great place for friends hanging out."}
