{"text":"It was my co-worker's birthday and another co-worker and I were frantically looking for a place to dine that was close to our work. We always go to Aji Sai on Danforth or a Greek joint along the Danforth so we decided to check out Italian cuisine. 

The birthday event was held on a Thursday evening at around 7 PM and it was surprisingly empty. Perhaps this is due to the fact that Trapezzi is quite inconspicuous. I had trouble finding it as the lighting inside is quite dark (from the outside it's hard to tell if they're in business or not) and the sign is small, while not being eye popping at all.

Service was amazing! Now, is this due to the fact that we were the only customers? Who knows. The server amused the co-worker who was celebrating their birthday. He was very attentive that water came without even having to ask. I quickly slipped away to ask for a cake with candles and they were easily able to accommodate my request.

Food was on the 'meh' side. I ordered the risotto and it was fantastic; however, I took a little bite of the gnocchi, chicken, and salmon. They were all mediocre. As the price was reasonable, I'm not going to say that this put a damper to my dining experience. 

Definitely check it out! Greek Town no longer just offers Greek restaurants. :) The only thing to be careful for is the parking! I was literally two minutes late and was given a $30 ticket as a finale to my night out with co-workers."}
{"text":"Went here on Wed for their Summerlicious menu.  The restaurant is nice - has a cozy feeling to it. We sat upfront by the windows - which they had opened so we could get a nice breeze which was great.  The service was pretty good..a bit slow at times (considering there was only 10 people max in the place), but he waiter was pleasant and funny so that made up for it.  I didn't like what I had - the chicken, but my friends really liked their choices (spicy pasta).  The prices (from the regular menu) aren't too bad..bu based on what i had I probably won't be rushing back again....but that said i would have to try something else to see if its just what i had."}
{"text":"What an incredible find! I'd been wandering on Danforth, figuring I'd find a cool Greek spot and have hummus for dinner. After a glass of wine at The Auld Spot (and a look at their menu, which was too meat-heavy for this quasi-vegetarian), I kept walking and glanced at the menu at Trapezzi. The 'holy grail' that pulled me in? Gnocchi in a gorgonzola cream sauce with pine nuts, roasted peppers and spinach. Perfect size (small, since it's so rich), super creamy and I'm a sucker for pine nuts in anything! A glass of Chilean merlot was a great accompaniment. I opted to have their delicious tiramisu for dessert. The bartender - a friendly blonde - was talkative, which is always cool when you're a solo diner.

Shocked no one's reviewed Trapezzi yet! Perhaps they've only recently opened? I was glad to see them fill up while I ate, because they're a class act."}
