{"text":"By far, one of the best restaurants in Montreal. Excellent made fresh to order Italian dishes. Service is prompt, friendly, and very personalized - always happy to accommodate any special requests that you may have. The desserts, especially the canoli and tiramisu, are also heavenly. We keep going back and back for more!"}
{"text":"There are a lack of decent restaurants in the St Laurent area... Was hoping to have found a hidden gem, but not the case. 

Came in here for lunch on a Friday at 11:45. We were the first ones in the place, and were alone for a while, but the place had filled up well by 12:30. 

So this place is alright. But just alright. Since there isn't much else nearby, I guess it's a decent option for most people, but I won't be back. 

The lasagna tasted like it was made with those pieces of pasta that you cook straight in the lasagna (not the pre-cook, then-bake kind) and those always taste a bit weird. There was no ricotta in it either, which was disappointing - just meat sauce and mozzarella (not much of it either). 

The veal cutlet wasn't bad, but wasn't great. Portion size wasn't big either. 

The arrabiatta sauce is actually quite spicy, which is nice! Most places call their sauce arrabiatta but it's not very spicy. I'll give this place kudos for that. 

Big no-no for me is that there's no fresh cheese or pepper to put on the pasta... Just a shaker of each on the table. I'm the type to pile cheese and crack fresh pepper on my pasta so that was unfortunate. 

The bread they bring you when you sit down is hot - piping hot - which I usually see as a sign of a good restaurant. I was disappointed by most of the experience so it's not the case with this place, but I appreciated the fresh bread! 

As an Italian, I would say that my opinion of the food can be trusted. But if you insist on trying this place anyway, maybe try the pizza?"}
{"text":"We had our Christmas party there last year and it was great! The staff is amazing, and they really went out of there way to get everything done and make sure we left happy. I would definitely go back!"}
{"text":"Mamma mia! Cet endroit étant la place de choix de l'un de mes clients d'origine italienne, je m'y déplace régulièrement. Situé à Ville Saint-Laurent, cet endroit ne paie pas de mine. Menu classique italien (lasagne, pâtes, saumon grillé) plutôt mal exécuté, pas à cause de la fraîcheur des aliments mais à cause des compétence du chef, la nourriture est dans le meilleur des cas correct. Cependant, le service est toujours très chaleureux et la propriétaire d'une grande gentilles, est toujours aux petits soins pour ses clients. Elle nous acceuille à bras ouvert avec le sourire, s'inquiète quand nous ne finissons pas notre assiette et est toujours d'une à l'affut pour remplir les verres d'eau ou ajouter du pain. 

Si la nourriture était au même niveau que le service, ce serait un très grand restaurant. Dommage!"}
{"text":"The gnocchi with rosé sauce is to die for! The calamari entré is excellent.  Can't go wrong with the spaghetti meatballs.  Large portions.  House wine very good."}
{"text":"This is my favorite Italian \"just like home\" restaurant. Service is great - food delicious  and always warm and welcoming."}
{"text":"If you want to experience fantastic, warm, real service and fantastic Italian food come eat here. From the owner who greets you with her great, big warm smile. Who makes sure you are having a great experience to the great, hot meals prepared here. Had a great Parma pizza, another friend had the lasagna which was eaten up in no time. Another friend had the salmon and she really enjoyed it too.

Located in a strip mall so plenty of parking available. Go, enjoy some real Italian food :-)"}
