{"text":"One friend had the gnochi in rose sauce. Perfectly cooked, the gnocchi was soft to the bite that resisted once you got toward the middle, like biting the fat little toes of your favourite toddler. This dish is simple and delicious; pillowy soft nuggets bathed in a rich tomato sauce of cream, butter and parmesan, the generous portion dares you to finish it in one go."}
{"text":"I don't know what happened to this place. It used to be our go to place back in the early 2000's. You couldn't get a table even if you likened up for an hour. There was a singer naked Angelo who reminded me of Ron Jeremy and he really got the crowd going. The chef/owner in the back was always engaging with customers walking through the doors. The food was outstanding:generous portions, quality ingredients and pasta your Nonna would be proud of....... fast forward to 2016: no one to greet you at the door, the hostess makes it a point to tell you hat you have an hour and a half to eat and then have to leave, the food was so-so (pasta way to undercooked and sauce was soaking un oil), the pizza was lopsided with barely anything on it and it was 60% burnt, it took a while before the waitress brought the ice bucket, table was crooked and the waitress didn't offer to try to fix it after we made several attempts to do so, the parmesan cheese was awful (they used to have real parmigiano reggiano but niw it tastes like the stuff you buy prepackaged at the grocery store), the music and big screen TV make it a big distraction when you are trying to experience the trattoria experience.  Too many inconsistencies here. I won't be returning."}
{"text":"Food is too salty. Service was horrible. Only one member of our party of six received their food, while the rest of us waited more than an hour after they received their food. Was there for a birthday celebration. Brought our own cake. Waited forever for the waiter to bring the cake and then he brought out only one piece with the sparklers burnt half way down. The point was to bring out the WHOLE cake withe the sparklers still burning when they reach the table. The waiter was horrid as was the food. I will NEVER go back...despite the fact that many have told me it was an isolated incident...I think it would be too coincidental to have a terrible waiter and chef on the same night."}
{"text":"My family of 3 stopped by this Restaurant the other night for dinner. Upon our arrival we saw a few empty seats inside. We waited to be seated for about 5 mins. When the hostess hollered at us she escorted us to an outside patio. After 10 to 15 mins it stated to rain. I went inside to let her know it was raining and asked for a table inside. She literally barked at me and said that everyone else  also wanted to be inside , even though there were plenty of  free tables she never sat anyone on them. She is  very rude ! It would be best for her to not be there at all...
The food portions are large but the food is Greasy. The service is terrible. They don't have a liqueur license either.
I also witnessed a couple who were seated beside us, they had to wipe off their chairs themselves because they were wet. When they asked to move inside the waiter spent about 2 mins arguing with them even after she demanded to talk to the manager.! By the way the manager never show up!
Please, do yourself a favour and by pass it the next time you are in the area. 
Save the aggravation, the money and most important YOUR TIME!"}
{"text":"It must be 2 year I come to eat here and they just seem to have it.  The quality and quality are always there. Plus ambiance, look and feel of what Italian should be.  Tried many things over the years and i can't say I was ever unhappy with my choices.

Reservations is a must now but I can understand why. 
Bring your own wine is always a favorite with the friends. 
Portions are so big many times you have leftovers.

I'd go back, keep going back and recommend anytime."}
{"text":"Terrible food and atmosphere. Horrible experience. Don't waste your time you are better off getting a frozen pasta meal at the grocery store and microwave."}
{"text":"Here's a breakdown : the food at Piatto Pieno is excellent, but the service can get very rough at times. If not for the uneven service I would easily give it a 5 star.

I've been there several times, and the food is consistently excellent. I mostly go for pasta or pizza, occasionally a risotto. The eggplant parmigiana is to die for. And on top of it is BYOB.

I won't go into to many details about the bad experiences with the service (multiple wrong orders, extremely long service) but it had definitely been the exception rather than the norm.

I still have been recommending this restaurant to everyone I talk to about Italian food or good restaurants in Montreal."}
{"text":"Service: we had reservation at noon for a 7pm supper. They sat us near door (bbbbrrrrrrrr) thanks

Food: pizza was very good , portions are good, feta salad was super salty!

Price: a little on the pricy side, 19$ per pizza"}
{"text":"Went there last Wednesday and had one of the worst dining experiences imaginable.  Waited an hour and a half for a salad and pizza.  On complaining to the Manager about the situation he was rude and arrogant.  The pizza was awful, burnt on the corner and the salad was just so-so.  Very expensive for what it is also.  Will never go there again."}
{"text":"Very bad service avoid this restaurant not worth your money they will not accommodate vegetarians and dont seem to know  that a vegetarian does not eat fish !! Kind of ridiculous and the rest got cold meals! Awfull spend your money elsewhere on a better meal !"}
{"text":"Nous étions un groupe de 12 et avions une réservation pour 18h30. À notre arrivée, l'hôtesse ne trouvait pas notre réservation, pour finalement nous dire que nous avions réservé pour 20h30. Il est possible qu'il y ait eu confusion entre 18h30 et 8h30, mais ce qui est impardonnable, c'est la façon dont l'hôtesse est revenue nous voir dehors alors que nous étions en train de nous demander où aller sans réservation un samedi soir pour nous lancer un \"C'est quoi le problème?\". Quelle façon de s'adresser à des clients. Au lieu de tout simplement s'excuser pour la mauvaise compréhension, elle se défendait inutilement. Pas besoin d'ajouter qu'avec cet accueil nous ne remettrons plus jamais les pieds à cet endroit!"}
{"text":"The  ambiance is good, portions are big, Terrace outside is fun. Prices are reasonable. 
Food  not so great, not allot of  choices for vegetarians. No fish menu and service is way to slow. 
Desserts are small and Pricey."}
{"text":"J'y suis allé pour la fête a mon père. Le décors est pas mal! C'est plus beau a l'intérieur qu'à l'extérieur (une chance). Mais ça c'est gâté avec le menu. Je ne sais pas comment un restaurant aussi spécialisé peut arriver a faire des combinaisons aussi étranges avec leurs pâtes. À 20$ le plat, j'ai bien beau croire que la portion est très généreuse mais ça sert a rien si les goûts ne sont pas accordés. Niveau fraîcheur c'est ordinaire, probablement ce qui aurais fait la différence!

Évidement ce n'est rien car aussitôt mon assiette arrivé, j'ai commencé a manger et on s'excuse qu'on maie donné l'assiette d'un autre client... et bien oui! Jetait tellement loin de ma Puttanesca. Mais avoir su, j'aurais du garder l'autre assiette les goûts étaient de loin plus normaux. Généralement des papardelle ça se mange plus tôt sec avec une viande et une crème le tout mariné d'une alcool. Là c'était une salade...

Au moins les pizza semblaient moins pires."}
{"text":"Possibly the worst service and staff attitude i have ever encountered. We waited nearly an hour and a half for our food. When the food finally arrived our pizza crust was burnt but the salad was large and good. Our server was initially sympathetic to our long wait but when i spoke quite pleasantly to the manager to give him feedback rather than an apology i got a lot of attitude, excuses and a veiled accusation that i was being unreasonable.   I felt i had no option to not leave a tip which was received with anger from our server who then threw the credit card receipt at my wife."}
{"text":"There are some places that you really wonder how they managed to stay around for so long and even how they manage to have people queueing at the door! And it's not like there are no other good italian places around...
This is definitely such a place...
As we entered, the arrogant young woman at the door asked us if we had a reservation. As we did not, she pointed us towards a tiny table at the entrance and threw down the menus. It took about 10 minutes for someone else to show... our waitress, which was surprisingly super nice. She gave us water and asked if we were ready to order. As I saw our next table neighbours eating something that wasn't on the menu, I enquired and she bubbly answered \"oh yeah, there're the specials, do you want some?\" Well, what I would have liked is for someone to mention the specials in the first place...
About half an hour later our starter arrived - a shared plate of fried calamari - not good, chewy, oily and way overpriced (16$). Another 45 minutes later, our pizzas arrived... The dough was not cooked properly (overcooked on the botton and raw on top) and lacked in salt. The cheese was probably the cheapest cheddar you could find and the whole thing just lacked any sort of seasoning and flavours... But they do boxes, in cases you can't eat it all and want to add your own goodness at home! And all that (1 starter and 2 pizzas, no drinks, no desserts) for a mere 71$!!
Oh and since it was friday evening... we had the immense pleasure of having a live singer blast out loud shrieks of all the worst songs you can think of louder than your ears can manage making you shout to speak to whoever is with you and making sure you will leave a little deafer.
The 1 star is really for the superfriendly waitress, if it wasn't for her, we would have left before we even started."}
{"text":"Hostess / greeter at the door is horrible. She barked at me and hides in the back. She doesn't take notice or welcome customers when they walk in. She needs to relax a bit and try to be approachable and friendly. I don't understand why she so stressed out when she's not even a server."}
{"text":"Un service serviable, mais 2 heures et demi d'attente pour une commande (table de 15 personnes), ça commence à devenir long, très long..
D'autant plus que la musique est trop forte, avec un chanteur, qui certes a de bonnes intentions, mais qui empêche de nous entendre parler.

Sinon, la carte est bien fournie (autant pour les pâtes que les pizzas), pour des prix légèrement élevés. Mais cela vaut la peine vu la portion énorme des pizzas !
Les responsables du restaurant nous ont fait un beau geste en nous offrant le désert, pour s'excuser du retard des commandes.

Je vous conseille d'y aller un soir en début de semaine."}
{"text":"Very ordinary food at premium prices. Bare minimum service (menu, food, bill). Very noisy, not classy. At 10:30, 20 mins before we left (not the last table) the place stank of cleaning products from the kitchen. Not recommended."}
{"text":"This is a super restaurant in Little Italy, bustling and vibrant, and WAY bigger than it appears from the outside. There's an ample sized terrasse outside the front, and the interior is very large, but recently my family came here and we were whisked through a galley kitchen area to a humongous outdoor courtyard in the rear. Despite not having a reservation, they were able to seat our party of five. We brought our own bottle of wine, and we had some fantastic food: some ordered the pizza calabrese, one ordered the pizza puttanesca, and I ordered the pasta tutti de mar (I may be misspelling this. I ordered the seafood pasta). It was delicious, with the noodles perfectly cooked and the sauce chock full of shrimp and clams and squid. They sure didn't scrimp on the ingredients. And all the meals were really large. We brought home a lot of pizza and pasta left-overs.

The waitress was sweet and, despite manning many tables, was quite attentive. 

The only mediocre aspect of the meal was the antipasto appetizer, whose portion was quite small, and the meats were overly spicy (we ordered the kind without melon).  My advice is to skip the antipasto and save room for the wonderful main course dishes! 

For dessert we all shared a generous slice of carrot cake which was wonderful - especially the icing!

We will definitely be back."}
{"text":"Mixed feelings. 

I'll start with the negative. We were seated in the rear outdoor enclosed section, Which would've been really cool had it not been for the strong smell of humidity or mold. It was very strange. We ordered the antipasto as an entrée. It was very disappointing, tasted like everything had come out of a pickling jar.

As for the good news! The pizza was fantastic. I really really enjoyed it. And it's quite large so you shouldn't need to even order the antipasto to be full. And I really liked the service. We had a young girl take care of us, she was very attentive.

I would rather rate this restaurant 3.5 or 4 stars. But the odor got the best of me that night. I will definitely be going back and I recommend you try it!"}
{"text":"Decent pizza, large choices and big portions for the price. BYOW or booze so expect a very reasonable bill. Great terrasse and very convenient for groups and large families! Ask for their group special menu."}
{"text":"The food is excellent, but the service is TERRIBLE! It takes ages to get even basic water. I ordered a coke and it came out not after the second time I asked for it, but when the waiter came and asked \"Is everything to your satisfaction?\" I said no, and asked for my coke again. When it came, it was flat... He did exchange is promptly... Tried explaining that someone took a part out of the machine or something bogus...

The food finally came out... Well not everyone's. In our party of about a dozen, the waiter said that one dish wasn't ready. My friend had to wait another half an hour... How long does it take to make pene noodles?

I will definitely NOT be going back there. Montreal has plenty of Italian restaurants for me to eat at."}
{"text":"Unfortunately, I must agree with the poor reviews. The patio is nice but the service and food is quite slow, the pasta is over cooked, the pizza takes over one hour. Do not recommend."}
{"text":"If you are looking for a loud place with horrible music and the worst pizza you ever ate this is your place. If you are born in Italy or ever had a real pizza,stay away from there."}
{"text":"I'll be honest here... i have tried this place years ago and absolutely HATED it. But the group i was going with was adament about going.
I was SUPER disappointed that they did not have calamaris on the menu as an entree but opted for the \"mixed Piatto Pieno\" plate. Uh, a waste. Don't do it. There was a total of 1 tomatoe, 1 bocconcini, some jardinier and some sliced cold cuts.. that's it. whatever.. a waste of $12.
To the main dish; I ordered the cappelini con gamberi and it was SUPERB!! There was so much shrimp in the plate, I was astonished. It was super flavorful, a bit spicy.. awesome. One of the people at the table had the pizza with mushroom, proscuitto and cheese and that was fantastic as well.
I didn't really like where we were seated; all the way at the back of the resto where the giant tree is. Kind of smells too humid but after awhile, the armos of the food take over and you don't notice it anymore.
I would honestly go back. I enjoyed it. I've officially changed my mind about this resto and would recommend it."}
{"text":"Its going to be a short review. My question is how can a great restaurant like this where they serve you excellent pasta and appetizers also serves such a bad bad bad quality pizza hmmmmmmm  very interesting ."}
{"text":"I cannot beleive this place is still open and relatively busy... It is unedible. The food is of poor quality, the kitchen is dirty. An open kitchen should be kept clean, considering that is the first thing people look at!

The service is good, but that cannot redempt the food. I can't even understand how people think this is italian food. 

The pizza is actually not terrible, but not good either... The kind you find in a food court. 

The pasta is horrendous. The tomatoe sauce tastes like it was pre-packaged and served straight from a can. 

The appetizers were not fresh... Mozzarella was dry and the cold cuts had an unhealthy funk... I had to spit it out. Waiter did not ask why our plate remained untouched, and to be honest, I did not feel like making a big case out of it because he was so nice.

To avoid at all cost: the sausage. I don't know where that \"meat\" comes from, but I think that you can get serious food poisoning from ingesting that stuff. 

Will never go back."}
{"text":"We were a group of 12 adults and had a wonderful time.
Great pizza, salads, pasta... many thanks to Felix, Adrianna, Felipe, Carlos and everyone at Piatto Pieno. 
I don't know what happened in the past, but we were very pleased. 
The large resto catered to hundreds of people last night and was very, very busy.
It was the finale evening of the Italian Festival and this was a perfect resto. to gather, have a nice meal, evening, before the Opera.
It's also nice that the resto is located just off the busy street of activities and is a bring your own wine resto."}
{"text":"Decent byob restaurant. I wasn't impressed with anything. But i also wasn't disappointed by anything either. A huge selection of dishes from antipasto to pasta, to pizza and so on. The food is ok just a bit on the salty side for me. Original pizza toppings. The pasta was cooked al-dente and the sauces were good! Our favourite would be the mixed antipasto platter. Huge you could share it with three other guests. The waiters are nice but lack experience. The place tends to get quite noisy so be prepared to talk very loudly as well. Make sure to reserve on busy nights such as Fridays and Saturdays. Corny decor and band that was playing/singing was horrible! If i could, i would of paid them to take the night off! Luckily it's a byob! Prices are really good. It was just around 100$ after taxes and tips included for the two of us ;)"}
{"text":"Arriving on a rainy Thursday evening we were surprised when we asked for a table for 4 and were asked about reservations.  We did not have, so our host led us on a stroll through dining the room up some stairs around a corner and into a solarium type extension on the back of the building.  When we first arrived it was empty except for one other table but, we had little choice according to our waitress the downstairs was booked.  She was sweet enough to let us know it wasn't so bad, there wasn't live music to miss, that's on weekends only.
The room eventually filled up and the atmosphere became warmer both figuratively and literally.  This room would be great on a sunny day in summer as it has a whole wall of garage doors.  I was able to walk through the place on my way to the ladies room and I checked out the decor.
Lots of medium size rooms, very spread out over a huge area, two solarium, one indoor, and then an outdoor garden area.  The kitchen is open concept, along a wall and is very sleek and modern, (kick ass oven, with crust maker along the side), but is mixed with a heavy wood panellings which warm the space and makes it very appealing indeed.

We ordered the following 2 Pizza one Sopressata e pecorini, and quatro fromaggi, then two pastas, Fruitti di Mare and Bocsaiola Cavaletti.  The pasta portions are generous and the freshness of the ingredient is a standout.  The pizza is thin crust and also very fresh with a nice red sauce.  I would definitely recommend ordering as we did and sampling family style.  The wait staff is also very friendly, efficient, and accommodating.

I plan a repeat visit and happily recommend everyone try it out as well, reservations may be wise if on a weekend."}
