{"text":"I've dined at Trattoria several times since their opening and have had nothing but pleasant experiences. 

There are some menu items they do well and some they don't. I can live with that. Don't come here if you're expecting a terroni-esque pizza. Do come here for a nice panino for lunch or for their great apps (the fried cauliflower is better than my nonna's). Their pasta is also simple and well done.

Yes, I was a little--weirded out--by the fact that they didn't have bread. It's usually standard at italian places. Maybe they'll work that out, maybe it's a labor/cost thing. Big deal. 

And this is probably one of the best patios in the area. As a Ryerson student, its close and has a better vibe than the Milestone's or Jack Astor's patios (the food is also better).

Keep it up guys! Hire more hipster chicks for servers too."}
{"text":"We actually had extreme food sadness. Rushed us through courses. Rewarmed entrées that we had sent back because we were still working on salads and apps. Had to ask for everything we needed. Awful service. Too bad, because at that price, we deserved better and we've grown to expect better from there. Disappointing.

Plus the entrées, (mushroom risotto) were bland. Unseasoned. Swimming in butter. Not the great meal we had expected. And when we voiced our dissatisfaction, no offer was given to rectify the situation  (different meal, free dessert)."}
{"text":"I went here for my birthday with my friends. The pizza I ordered was good and decently portioned although the waiter that served us ruined our experience. He was very arrogant and inauthentic. When asked about any vegan options for my friend, he was very condescending and when my other friend asked if the restaurant offered any birthday perks, his tone was very rude and said something along the lines of '..absolutely not'. Perhaps it had been a long day for him but that does not excuse his behaviour. The food and service is what makes a good dining experience and this one definitely lacked. We won't be coming back here again."}
{"text":"Went to Trattoria Mercatto before going to see a show at the Canon Theatre.  I agree with a bunch of the other reviewers on here when they say that the service is terrible.  We had one of the worst servers that I have ever encountered at a restaurant that is supposed to be \"nice\".  Our waitress didn't make eye contact at all, looked like she would rather be anywhere else but serving us, we had to ask for water multiple times before we ended up getting it from someone else, we actually had to grab her and say \"can we order our food now\" because it had been so long since we were sitting there and so on and so on.

On to the food!  There were three of us that ate there that night and we all had the same complaint.... under salted.  We all grabbed the boy that brought us our food for extra cheese and that still didn't help.  

So, basically bland food and terrible service!"}
{"text":"Service was great, there were free refills on soda which was a nice surprise and food was amazing"}
{"text":"Wow I am surprised by some of the harsh reviews this place is getting. I am sorry that these people got bad food and bad service. I went to Mercatto twice already and both visits were very pleasant. A lot of people are saying that they don't like the breadsticks that Mercatto serves. I actually think it's a nice touch and very original. And as for the bread, if you ask, they will be more than happy to bring some for you with olive oil and vinegar. We asked for bread on both of my visits and they brought back very fresh bread with lots of olive oil. 

On my first visit, we shared a burrata salad appetizer, which was so fresh and delicious. And I loved the sweet marinated onions that they put on top. For the main we shared a scallop risotto, which was also excellent. 

On my second visit, I didn't have an appetizer, but I had a lamb ragu pasta, which was really good. The only tiny little complaint I have is that I wish the pasta was a bit more al dente. Nevertheless, it tasted really good. The sauce wasn't overpowering, and the meat was tender. I don't know what people are referring to when they are saying that the portions are small, but my pasta dish was a really good portion! For dessert I shared a chocolate pistachio cake with a friend. The dark chocolate was rich, not too sweet, with a nice crust and pistachios on top added a nice crunch. 

The patio at this place is beautiful and located in a nice courtyard with a fountain and a church. I really enjoyed this place and will recommend it to other people."}
{"text":"I was told to come here by a co-worker, but was thoroughly disappointed.
I was expecting some hot and fresh complimentary bread with good balsamic vinegar/oil, but instead received pre-packaged breadsticks (this totally downclassed the restaurant as I would expect to be handed this in the streets or at a convention)
I ordered a pizza with prosciotto and arugla and my Mom ordered the lamb ragu pasta.
The pizza was the saltiest pizza I ever tasted. Both my Mom and me had a hard time eating it and I had to leave some uneaten because of the high sodium content. Yes, pizza can be salty, but I've always been able to finish it, even the frozen Delissio kind! My mom who is a salt addict even remarked the same. 
The lamb ragu was fortunately better than the pizza, but the portion was very small compared to some other Italian restaurants that I've been to.
Service was good.
I'm giving this restaurant 2 stars in the end in terms of pricing, quantity and taste."}
{"text":"I really like the Mercatto on Bay St. and used to frequent it often for lunch when I worked downtown. I friend mentioned they opened one in the Eaton Centre and we decided to meet here instead as it was a move convenient location for us.

We were seated on the patio which was remarkably pleasant. I had a view of the church and my friend overlooked a grassy park. The patio alone would get 4.5 stars. It was quite, pedestrian friendly, and really enjoyable.

The decor was also really nice, as other have mentioned they obviously gave a lot of thought to the atmosphere.

As for the food - it was meh. We both ordered pizza. Mine had olives, artichokes, prosciutto and mushrooms, however instead of being distributed evenly all over the pizza each quarter was allocated it's own topping. I know this was intentional but I like having all the flavours on each piece. I spent so much time re-arranging my toppings that by the time i got around to finishing the pizza (and yes I ate the whole thing), it was cold. Also - i found the crust too thin in places (the tomato sauce was seeping through) and both of our pizzas were quite oily.

As others have commented we had the pre-packaged breadsticks - now I was prepared for this thanks to other reviews, and agree that it's a bit odd. However on the flip side I have no self control when it comes to fresh bread served at restaurants and tend to eat so much bread that I'm lucky to get half way through my dinner. But in this case I was able to nibble a bit before my meal on aforementioned breadsticks, and then for a change eat my entire entree! 

Our service was fine, they were great about keeping our water glasses full, and we didn't have to wait long to order, or for our food to arrive.

All in all it was an ok experience, I would go back for the patio but wouldn't recommend it based solely on the food."}
{"text":"Portion somehow jay disappointing. 

Get there early as wait staff has habit of dropping off food at wrong tables. When you're the first couple of tables, they're less likely to be confused."}
{"text":"If you're looking for someone to cough all over your food while it's being made, this is the place for you. I was sitting there watching the staff making food in the open kitchen... I saw one cook prepping food and cough several times with his mouth wide open... All the sudden, a big chunk of white stuff comes flying out of his mouth onto the food prep area. DISGUSTING."}
{"text":"After having finished some Christmas shopping, my boyfriend and I figured we'd try this Mercatto given we both had a craving for pasta and we knew other Mercatto locations were always a sure bet for a good meal.

This location is very disappointing. I first noticed that when we sat down it was very dirty under our table, left over food from the people before and a lime wedge to top it off (yuk). If I noticed it, when approaching the table, how could the servers or hostess not see it?
CLEANLINESS = 4 out of 10.

I love beets so I ordered the BARBABIETOLE ARROSTO (beet salad). The flavour wasn't bad but the beets were a huge let down as they were NOT roasted but straight from a can. Not my idea of a nice salad for the price. My boyfriend ordered the MISTICANZA (mixed lettuce with radishes and celery hearts) which he says was good.
INSALATE = 5 out of 10

I was looking forward to the main course as I love any pasta with bolognese sauce so I ordered the RIGATONI ALLA BOLOGNESE. When it first came out, I thought it was either a lunch portion or a kids portion, presented in the same size of bowl that my salad came in for $16.50 (the restaurant may want to consider changing up the dishes to pretend they've put some sort of effort into the presentation). In addition to the baby portion, there was ZERO flavour. There were no tomatoes or basil and you could tell that the kitchen did not salt the water for the pasta as I had to ask for salt (which I NEVER do) to give it SOME taste. It would have been nice to see some chunks of tomato or even fresh basil to top it off (again, just a bit of effort on presentation would have gone a long way). My boyfriend ordered the PAPPARDELLE which he says was lacking flavour more than mine. I didn't believe him because of the red wine braised duck ragu (how could anything with red wine lack flavour??). Sure enough, it was tasteless and again, a small portion in the same baby bowl as mine for $17.95.
PASTE = 4 out of 10

In addition to the food being mediocre at best, the service was the same. Prior to ordering, my boyfriend asked our server for some suggestions (3 most popular dishes on the menu). It took the server so long to say something other than 'UHHHH', that my boyfriend just said, 'don't worry, I'll just have the PAPPARDELLE'. The one positive thing about the service was that the food came out quickly, and thankfully because we noticed at the end of our meal that we weren't offered any packaged bread sticks until we were done (which we ate because we were still a bit snacky after the baby portions of food).
SERVICE = 5 out of 10

We skipped dessert because we were too afraid we would be let down even more than we already were.

To sum this all up, I would never go back unless the restaurant made some vast improvements on quality for the price. Unlike the other Mercatto locations, you can tell that this location is there to serve the shopping crowd who cares more about shopping than the quality of the food they are eating. I would have had a better meal at the Thai Express in the food court :( I'm glad my shopping trip was a success!

Restaurants I would choose over Mercatto Eaton Centre for the same price:
1. Cafe Nervosa
2. Grazie
2. Terroni 
3. Citta"}
{"text":"We chose this restaurant due to location for the theatre across the street. 
We found a very good wine selection and choice of variety of menu items. 
Now, allergies are a situation we have to deal with every meal. No cows dairy, no wheat no corn(syrup).
The soup of the day was terrific my wife said and I had the grilled octopus, also great.
We both ordered a risotto dish. They were able to accommodate her with the mushroom and I ordered the shrimp. Had a little hiccup when it came to the table but they took it away, with kind apologies, remade and was absolutely fantastic ! 
I would have to say Gus our waiter 2 thumbs up, Sherlock Holmes was 1 thumbs up."}
{"text":"I've returned a couple of times for a late lunch; sat at the bar, had excellent service, and was served good, middle-of-the-road Italian food. Very serviceable, it's a perfectly acceptable lunch."}
{"text":"I'm a long time customer of the Mercatto restaurants (usually on Toronto St. but now several visits to the one in the Eaton Centre), and I've never had anything less than exceptional experiences.  I rave about Mercatto to friends and look forward to each trip.  Other than the fantastic food, I also go back for the knowledgeable and outstanding service - it's to me one of the hallmarks of going to Mercatto; fantastic food and wonderful service - and this has always been my experience, until this past weekend.

My friend and I had made a reservation, arrived on time and were shown to our table as per usual.  Hostess was charming, our server was prompt to our table and all seemed well.  I am not certain if our server was new, had too many tables or what, while pleasant she seemed uncertain, offered no additional knowledge and throughout our meal we had to wave her down for everything (water, drinks, our bill).  

The most glaring example was when our mains (we both ordered the mushroom risotto) arrived while we'd barely started our appetisers (which also arrived very quickly as we'd ordered the Antipasto grande to start and had barely started eating when soup and salad arrived) so imagine our surprise when a food runner appeared to attempt to crowd even more dishes onto our table.  We asked her to take them back (she said that they'd be kept warm for us!) as we were nowhere near ready for them.  We called our server over to explain our dismay and her explanation was that she thought it was busier than it was and she'd put the tickets in all at once.  But not to worry that they'd make us new mains, not the 'kept warm' ones the food runner had mentioned.  At that time I should have asked to speak to the manager but assumed that the server would do something to make the situation right, perhaps offer dessert or a drink, but that did not happen.

When our mains did arrive they were a disappointment - and I've never said that about a meal at Mercatto - they were bland, had an excess of butter (perhaps this is how they were rewarmed instead of new ones being made?), and was not the creamy flavourful risotto we expected, no one offered us pepper and our waitress took a very long time to check on us.  

For a visit that we were looking forward to, that started out so well to turn out to be such a disappointment; well, it will make me reconsider a visit to this particular Mercatto in the future."}
{"text":"was told it would be 15-25 minutes wait for a table. There were tables visible that were not occupied. after hanging out at the entrance with my two nephews for a while one of the previously empty tables was set for us - took about 15 minutes. I was wondering if perhaps they were trying to scare us away because we had children with us?

When we asked the waiter what would be good for kids - he had no idea. I guess the restaurant does not consider itself family friendly - odd for a mall location. we ordered a pizza for the kids.

there is no bread. maybe I'm an uncouth savage but I like bread with my italian meals. there were packaged breadsticks (these are the crunchy things that taste like pretzels) on the table in a glass. hmmm. how.... continental? when we asked the waiter - he said that he was unsure if they had bread.

I came home and read through some glowing reviews on here - and some of them talk about apps involving bread.

the food was not great. we had two pastas. serving sizes were tiny (about 20 pieces of rotini each) - this would be acceptable if the taste was good. it wasn't. Don't get me wrong - it wasn't something where I spat it out. but the taste of salt was quite apparent - which is odd in a pasta dish that has what the waiter described as a 'red sauce' (I ordered a bolognese - I thought it was a little odd to describe it as 'red' since bolognese is supposed to have some cream in it. I'm probably being picky....I expect waiters to be more knowledgeable of the food.

we were not offered freshly grated parmesan on our pasta. none was visible on the plates. I tried to flag someone down but they seemed busy and told me 'one moment please' and never came back. I wanted to wait for the parmesan but about 7 minutes later I gave up and started eating - I didn't want the food to get cold. (waiter didn't come back within 7 minutes of delivering meal to check on us).

This place seems to cater mostly to people who want a drink and appetizers. That is what most patrons seemed to be having when I was there.  I saw many reviews of great food. Maybe I just ordered the wrong thing - or perhaps the chefs who prepped our meals had an off night. The kids liked their pizza though.

I would suggest to take my review with a grain of salt (there was more than a grain in my bolognese). It is possible that I expected more than I got. Its also possible that I have too exacting standards for service, since I have worked as wait staff. 

I really wish the staff was better trained to deal with offering suggestions - if the management reads this - please train your staff on how to make offerings - how to ask patrons to match their own taste to the menu, and how to make suggestions for children. 

it might have been my mistake bringing kids to this place - but its a place in a mall - and there aren't that many places to eat here other than the food court. 

one last bit that is going to seem very punitive. The menus are covered in some sort of cheaply made plastic slip cover that is a bit cloudy. With the slightly darkened lighting it made it difficult to read the menu - i know its picky - but it was something I noticed immediately on picking up the menu - and I found the need to remove the menu from this thing before being able to read it.

the ambiance was great. the muted lighting and the decor was clearly done by a professional, and has been kept up well.

If i was here for drinks and apps I would probably give this place a much better review."}
{"text":"Stopped in for quick apps. The beet salad and arincinis were great. Staff was super friendly and the ambiance in the restaurant is fun and eclectic. If you can handle the craziness of the mall definitely worth trying."}
{"text":"I love this place. Great room, good food, interesting wine list, nice staff. Whenever we are in the area we lunch here"}
{"text":"Good service. Good food. The pizza burned a little on the crust; ....and i loved it. The tomato sauce used on the pizza are actually ground tomatoes; pretty good; you must give it a try."}
{"text":"My bf and I came here on a thursday night 2 weeks after they opened. We were greeted by 3 high school looking girls and seated immediately. The atmosphere was nice, I liked how rustic and warm the decor made the space feel and it was quite lively (since there are two giant parties there).

Our server was a little slow.. she was nice but failed to refill our water many times, we had to flag down other servers to get refills. Our food was reallllllllly yummy! We shared calamari and a pizza. Both were made well. I love how there were bread sticks for us to munch on which waiting also lol.

There is also an upstairs level which is very big and spacious. The washrooms are also upstairs and they are soooo decked out! I think i spent a good 10 mins there soaking in the decor and reading the newspaper wallpaper (ok it wasn't really 10 minutes... haha)

All the servers seemed a little lost.. and some were just standing around doing nothing but I attribute it to them just opening. I would for sure come back and see how things are going"}
{"text":"We only had drinks and dessert here but I thought it was delightful.  We had an amazing waitress that was very entertaining- even on her first evening working here.  The drinks and the dessert were both very good.  The atmosphere was nice for a place just off a huge shopping center.  If I'm ever in Toronto again I would definitely try this place for food."}
{"text":"I visited Trattoria Mercatto in October 7th, 2014. We were a group of 5. We are tourists  visiting Toronto. The only good dish we ordered was tuna dish. Spicy chicken was very dry. Pizza was not like you would expect in an Italian restaurant, more like fast food, like baked from frozen. The salad!!!! greens were dirty enough that I could not eat my salad. When I mentioned this to the waitress, he did nothing just took my plate, no apology, not bringing a new one, nor saying anything like he would take it off from the bill. The bill paid by my friend, with credit card. He paid cash for the service. He receives SMS for every transaction he makes instantly. In the SMS it said he was charged 43 dollar more than the bill. He asked the reason of overcharge, the answer was quite shocking. Overcharge was for in case of we did not pay anything for the service! They said they would refund it. They do similar insalts to tourists in New York, too. I cannot believe what type of robber they are! Good luck to everyone who wants to eat at Trattoria Mercatto."}
{"text":"Good food in a relaxed atmosphere that worked out well for our group of 5 work associates. Service was OK, but not great. 
Everyone seemed to really enjoy their food with the cauliflower appetizer getting a special call out."}
{"text":"Stopped in for a quick bite and had another great experience.  The pizza diavola was spicy and just cheesy enough.  The salad was crisp? Fresh and very lightly dressed.  Clean restrooms, a working wifi and good tunes too!  Best of all the service was pleasant, unobtrusive and observant.  A lovely mid-day meal."}
{"text":"This restaurant has a great atmosphere with perfect sized portions.  You'd never think it was located in the Eaton Center!  We've been back a number of times for both lunch and dinner.

Loved the assorted meat and cheese starter (Affettati e Formaggi), Diavola pizza and the Braised Lamb Ragu (Fazzoletti).  The wine list has great choices at a great price! Everyone we talked to was extremely friendly & knowledgeable.

We highly recommend giving it a try!"}
{"text":"Relaxed atmosphere and good service however not much can be said in favor of the food. It was just OK, filled post shopping hunger."}
{"text":"Skip this place, WAY overpriced and the service is some of the worst I've had anywhere. I've been here twice, once for dinner and once for drinks. The service both times was straight up bad. It's as if they've never waited on tables before. The food is ok but nothing special and it's overpriced. The drinks are weak and WAY too expensive ($16 incl tax for a 1 oz drink). There are much better places in the area that have better food, better drinks and better service. Definitely will not return."}
{"text":"Decent place to pop by for simple Italian fare before/during/after a shopping spree.

Service is excellent and attentive. Ambiance and decor is quaint and woodsy. The big, floor-to-ceiling windows on the second floor are especially notable, and make for a very romantic date spot when the sun goes down. Big, open patio with loads of tables and good people watching. Check out the bathrooms if you have time; great matching of mirror/wallpaper/lighting.

Extensive wine list (bottles, at least), but limited and only very Italian fare. Pizzas here are quite delicious; clearly aiming for that thin crust, oven baked Neapolitan pizza. Pastas look less than professional, but are decently cooked and seasoned. Ask for fresh parmesan. Shared antipasti dishes are recommended.

Overall, there are better eateries just south of the Eaton Centre, so it might be better to head south to Red's or Mercatto at Bay/Adelaide. Similar fare, probably higher prices, but definitely higher quality dishes."}
{"text":"The food is garbage..dont waste your money there..we had agnelo pizza and duck pasta...i lost my appetite:("}
{"text":"I really liked this place. I do agree with  the others, my pasta Carbonera had a tone if black pepper, but overall it was really great. I am excited to try another location, the fact that this pretty great restaurant is in the Eaton Center is kinda a turn off though. 

The best part about my experience at Mercatto would be our waiter. He was really entertaining, very outgoing and when he saw that  I was  googling Rob Rossi ( top chef canada), he called Rob right over. 

Embarrased, yes, worth it, yes. I don't know what it is about meeting executive chefs, I just have so much respect for what they do I guess. 

Anyways, Rob your food was amazing, the staff was amazing and I cant wait to see who wins Top Chef Canada!"}
{"text":"My fav place to eat in Toronto! It's affordable but most importantly the food is sooo food! And this is every time!  The services is great . And it's conviently located in the earn center! 
I would recommend this place to anyone!"}
{"text":"Very accommodating with our limited time and the staff at the front desk were great.  The server wasn't knowledgeable when it came to vegan options.  My glass had lipstick on it, I politely requested a new one, my beverage and glass were changed but the glass still had lipstick on it so I ended up swigging from the bottle rather than make a fuss.  I also sat looking at our cluttered table and empty dishes for quite some time.  Rather overpriced and need more vegan / veggie options."}
{"text":"I've been here few times in the past 2 months. It's never my first choice to dine and wine here. But the location is convenient and there's no line up.

Their margarita pizza is pretty good. Nice cheese and tomato sauce on this crust. They have good selection of wine for bottles, not by glass.

Service was alright. Atmosphere is very casual. Food is decent. Nothing special.

I'd recommend this place if:

there's a 40min waiting at Jeoy and you don't want to wait
it's Sunday and all the nicer restaurants are closed."}
{"text":"We stopped here for a quick lunch yesterday on our way to the courthouse. The service was great, the hostess was friendly and the pizza I'm craving today! Thin airy crust that was crispy and held topping in place. We just split the pizza - but all the dishes at tables surrounding us looked equally appetizing. Good selection of beer and wine( ...but we didn't have a drink of course before fighting our traffic ticket;) hehe!"}
{"text":"Great experience.  Here on a business trip and checking out lots of local places.  The environment,  service, food, beers and price you can't beat. The arancini are delicious!"}
{"text":"Absolutely amazing! I can't find a single complaint about this place. The food is delicious, staff is efficient and prices are fair. You have to go."}
{"text":"I enjoyed the rustic Italian feel to this restaurant. I had the Salsiccia pizza - it was good. Surprisingly, what impressed me the most was the cheesecake.  I rarely order desserts but the cherry amaretto cheesecake was delicious! I prefer this place for a great selection of Italian wines and this tasty cheesecake!"}
{"text":"It breaks my heart to write this review, because until now, Mercatto was one of my favourite restaurants. Especially the meatballs. Yummy, ricotta and meaty meatballs in a lovely, light tomato sauce. Most unfortunately, the last time I had them, they came with a surprise. Spatula!! Yup, spatula. Ground up spatula with the entire tip in the third meatball. After I showed it to our waiter, he graciously offered me another entree, but by that point, I had no appetite. I'm pretty sure I ate some ground up spatula in the other meatball, and I felt sick for a few days after. The chef came out to let me know that what I had encountered in the meatball was \"spatula\"! He didn't seem too concerned but offered to take the charge off my bill. Just a heads up, people. Too bad this was treated like something pretty ordinary. I'm still off meatballs."}
{"text":"Had a wonderful dinner here after a busy day of shopping at the Eaton Centre.  Our server, Bobby, was great and so attentive to our daughter, who at thirteen, is still a picky eater!  All of our pasta dishes tasted so fresh and there were NO leftovers!  Will definitely come again."}
{"text":"Over priced. Had the dinner beet salad was tiny. A bit of greens with a few beets and a glob of tasteless cheese $16.95. Squash soup was tastee but again overpriced at $8.50. Husband had soup and pizza, said was ok not much on it.  Tried to get the waiter but he would not look at us only interested in filling our water. Would not return. Can get better value elsewhere."}
{"text":"Entrance is quiet busy two hosts guiding for a table and seating, rustic with high stools and lower chair dinning 
With reservation you will be seated much  better less bar noise, servers are attentive as its narrow aisles to each table. Menu is written in Italian, but ingredients in English. Atmosphere fun, 4 tv screens in bar section
Windows allows outdoor views and mall entrance.
Food pictures are in included-
Pricey for a spot inside mall with outdoor exit and entrance, 
pasta
Pizza
Dessert if your dissatisfied with certain food or ingredient their very attentive to switch, recommended for those craving authentic Italian with Canadian flare. I get asked why do I place photos with eaten portion, because I really do eat it, and want audience to realize it's not imported photo, that I was actually there."}
{"text":"Used to love this place. Suddenly the portions are cut.  How obvious is it when Ur pasta is a size if a slice brownie? I had to go out and get a hot dog after spending $30 bucks here."}
{"text":"Food tasted blend. Not even some real parmigianno on top of the pasta. The olive oil is DISGUSTING. Please, don't pretend you are an italian restaurant if you don't use italian products. I give it two stars for the waiter who was very nice."}
{"text":"Food was ok not too bad not too good. Service was fast, friendly and on point. Doesnt really feel like youre in an Italian restaurant though. The decor is nice however. And the separate private washroom layouts were a nice touch. 

50/50 really."}
{"text":"Situated inside of the Eaton Centre, I decided to try this place out after an exhausting day of shopping. 

First off, the service was top-notch and all the waiters were extremely friendly and knew the menu very thoroughly. My friend was a vegetarian and the waitress offered her a pasta dish that was off the menu where she got to choose the type of pasta and sauce with a unique blend of vegetables. My friend was very satisfied with the dish! 

Complimentary bread is available but you need to request for it. It was extremely dry and several people in my party were disappointed with the quality. 

The menu was a difficult to understand and very limited. Ended up ordering the seafood linguine and the portion was extremely small given the price. Flavour was good and the amount of seafood was generous but I devoured the pasta in five minutes. Remember to request for their fresh grated cheese on top of you pasta! They'll only offer you oregano at the start so you just need to ask. 

Overall, this place needs to be more generous with their pasta portions as I left with an upset stomach and wallet."}
{"text":"Adam was a great server . He gave us menus right away and was attentive. I was craving pancetta carbonara ($16.95) and was told they don't serve it at dinner time but he still asked the chef and made it possible for me. The noodle was al dente and it hit the spot . Lemon drop martini ($14) was also a good complement. My friend enjoyed her Linguini Frutti de Mare also. Ambience is casual. It's in the Eaton Mall in front of Roots and Zara"}
{"text":"I've been here twice in the last few weeks, one tip is to make a reservation.  Not that we waited long, but there was a wait..  15-30 mins if its a busy time and I tried lunch and dinner.

Good news is that its worth the wait!  The food is delicious.  The service is ok.  and the atmosphere is good (location) but so-so (very basic decor).

Pasta/Pizza ..  really tasty.  The prices are reasonable too, around $20+/person not including alcohol.

This one is located in the Eaton Centre on the street level between the Trinity Church and Zara, right outside Sears."}
{"text":"Had a great experience during a weekday lunch. Excellent service, great ambience, and we loved our dishes! 

I had the pancetta carbonara which was really nicely done. Pancetta was really crispy and added a nice smokiness. Topped with a richly orange egg yolk which gently cooked into a creamy sauce after being stirred in. 

My friend had the duck ragu pappardelle which we both loved as well. There was so much duck meat - would have been a successful dish with less, but I'd never complain about too much meat! Contrasting to the carbonara, this was a very flavourful dish, but not too heavy or overpowering as I've experienced previously with this type of pasta. 

Will be back soon!"}
{"text":"Came here while away on business with some coworkers after work. Place looks great and I love the bathroom set up they have on the second floor its pretty unique. They have an amazing wine selection and also a few drinks. Had a Cesar and even if I ask for an extra spicy one I think they forgot because it was not at all spicy but still tasted good.
They served us a very good entree of a few cheese, cold meat and crackers and everything on the plate was so good wish we had more.
I had the steak 12 oz and my coworkers all took the spicy chicken.
The steak was cooked perfectly and tasted pretty good. The rest of the plate not so great though, the mash potatoes had a lot of hard chunks but it still was tasty. It also cane with rapini and those were awful they were not seasoned and they were also very bitter.
I tried the chicken and even it looked dry it was actually very moist and well seasoned they also had some weird looking pasta as a side and that was not so great and also kale with bacon and that was amazing.
We had dessert and all 3 of then that we tried was amazing.
Service was good and very friendly.
Very happy with the whole meal and experience"}
{"text":"Had the linguine and clams here when I really wanted the seafood spagettini (it is on menu on Toronto St location).  Portion was far too small for $16 dish but good (i'll be blunt, a ripoff). I would eat here again, based on dining experience at Toronto St location, but not order the same dish.  For Eatons Centre it is one of the better restos that is still within the mall.  For the price it isn't worth it unless you are short of time or don't feel like walking a block."}
{"text":"We visited this place many times because it is so adorable: the place itself is lovely, great decor inside and a beautiful patio. The staff looks out of a fashion magazine: all of them are so good looking and hip that you end up feeling inadequate (but this is a good thing though). They make great pasta: try the lemon ricotta ravioli, but simple plates as pasta with tomato sauce is amazing too!"}
{"text":"For a mall restaurant, this place has great ambiance and pretty good service. The food is also not bad -- we got a zucchini pizza and their pappardelle. 

The pizza was cooked nicely but I don't think there was enough zucchini on it. Would have loved meatier chunks of that zucchini. Still it was pretty good -- the tomato sauce was on point and the goat's cheese added a nice touch. We had 4 humongous slices. Remember to ask for the chili oil like the other reviews have stated, it makes EVERYTHING better. 

The pappardelle was the star for me. Perfectly sized noodles, lots of sauce, lots of meat, rich flavours -- a very comforting dish."}
{"text":"we were on our way to the ACC for the raptors game and decided to stop in here for a bite to eat.

my first time here, and i was pleasantly happy with the service, the food and the price of our meal.

the server was very patient with us as we changed our mind many times on what we wanted, and didn't make a single mistake.

we had pasta, with the mozzarella balls and the tiramisu.
the pasta was really fresh, i was very happy with the portion, it wasn't 'american size' and i didn't leave there feeling stuffed and actually had room for the tiramisu!
the mozzarella balls were good, but too oily and i couldn't finish the portion because it actually started to hurt my stomach after a while.
the tiramisu was flavourful and rich, but not the best that i've had in Toronto!"}
{"text":"I've been here for lunch with coworkers, a quick bite before dinner, a romantic date night wine & dine, a relaxing drink on the patio in the dusk of summer. Holy smokes - I think I'm a regular! 

I'm so glad that as a \"mall restaurant\" it's been able to maintain integrity and offer a mini Italian reprieve right at the edge of the financial district. 

Everyone from the hosts/hostesses to the servers and manager are incredibly friendly and knowledgeable. They're fast when you need them to be and check up on you just enough. 

Soft lighting in the dining room is romantic but you can still SEE the menu, you can SEE your food, you can SEE your dining companions. holy smokes restaurants, why do you take this away from people?!

Top picks are the charcuterie plate, margherita pizza, and negroni. MMM..That's my combo #1.

TOP TIP: ask for the chili oil for any of your pizzas. it. is. heaven."}
{"text":"My favourite Italian place in Toronto! Food is always so good (we got the lamb chops --albeit a little salty -- and the fennel sausage pasta) and service is decent (however the last time I went there we got the girl with the silver hair and she was excellent :)). Would always go again, and their tiramisu is one of my favourites!"}
{"text":"The service here is better than the Toronto St location. The food is okay - I usually get their apps and pizzas - but their organic caesar is awful and their bread sticks are weird. Yes, the bread sticks are complimentary but I wish it was real bread."}
{"text":"Went in there for lunch today and left very displeased! i asked the waiter what was the top seller for pasta as i was really hungry and usually pasta comes in a large amount. He said the ravioli for sure and i asked for a glass of wine 5 oz to go with it. The Pasta came out and it was smaller then an app plate and i was not please that there was barely any food on my plate.. Even more not pleased when i got my bill it was 20.50 for the pasta and 16 dollars for the wine.. This was lunch not dinner !!! and i left and had to grab a burger after! I wont ever go back there.. Its not even the price but the lack of food you get for that price and its not a high end place.. i dont think lunch should cost 50 dollars in the eaton center for a pizza and pasta place ! Be warned you will leave hungry !"}
{"text":"Absolutely love this spot. 

I have long been a fan of the Mercatto locations in Toronto, and this one is now my favourite. 

I have been living near the Eaton Centre for nearly 4 years now and believe me when I tell you, I have completely exhausted the venues in my immediate surroundings for meals and drinks. Not to mention, the options at my disposal were nothing to write home about (Home = Yelp).

This location has two floors; a bar and semi-private dining room on the main floor, and a mezzanine on the second floor. The decor is rustic and welcoming, high ceilings and simple yet comfortable seating and tables. 

One thing I could not help but notice is how personable and warm all the staff were, I was extremely impressed even before the food hit the table. 

Along with another guest I shared a pizza and a pasta. The pizza - Pancetta e Caprino (Italian bacon, goat cheese, roasted tomato and caramelized onions) was a delicious choice. Aside from the seemingly heavy toppings, the pizza sat lightly in my pork belly. The crust was blistered just perfectly and the pizza was thin and crunchy. I loved it, with the addition of the pepperoncini, I could not ask for more. 

The pasta we ordered was the Chittara (alla carbonara, guanciale, black pepper, egg, pecorino) and it to was on point. The chittara pasta closely resembles a spaghetti but is a touch flatter. However, what truly caught my eye about this dish was the guanciale which is cured pig's cheek. I'm an absolute charcuterie slut and I love guanciale. If you've never had it before I would compare it to a pancetta, it is very very salty. It is also traditionally included with spaghetti alla carbonara. 

What I most admired about this dish was that I could taste every ingredient that was listed for it. I could taste the fresh black pepper popping throughout, it definitely had a warm eggy taste to it, the sharpness of the pecorino was noticeable, and the cream sauce with explosions of salty guanciale brought it all together for me. 

For dessert we had the much anticipated Ciambelle pronounced chee-am-bell-ay, Italian doughnuts filled with vanilla pastry cream. They were very good but I have had better Italian doughnuts so my expectations were not met. My guest was losing their mind with each and every bite and even used his last doughnut to sweep up all the excess sugar and icing sugar that was left on the plate. I found them to be a tad dry, but it is their go to dessert and they are hella popular. 

To wash all this down we had a gorgeous pint of Birra Dolimitti. It's brewed in a small town in Italy name Pedavena located at the base of the Dolomites. The reason why I decided to write this fact is because I wanted to make it clear that Mercatto takes very little shortcuts if any at all with their selection. What items and ingredients should be local, are, and what should be imported from Italy, are.  The beer was light, refreshing and aromatic, I loved every sip of it and they even had Dolomitti pint glasses which again is them going that extra mile for authenticity. Speaking of their alcohol they boast  several 100% italian beers on tap and their wine selection is staggering. They also have an enomatic wine dispenser and a preservation system in place which ensures you receive a glass of wine as perfect as it can be, or should be. 

Wow after that alcohol spiel I feel like I should be working there. But seriously, all liquor aside this is a cozy resto with delicious edibles and fantastic fluids. They also have flat screens above the bar constantly playing sports and the Food Network. Speaking of the Food Network Mercatto's Executive/Head Chef will be competing on the next Top Chef and that is big things.  

Come summer time their patio can hold up to 150 patrons...I know where I'll be having my patio treats. 

Great for coffee, lunch, dinner, dessert, drinks, groups, kids, take-out and even catering, They got it all. 

I highly recco this resto. 

Do it."}
{"text":"Every time I come here I always get the same thing and they prepare it wonderfully to my adjustments, with a smile and with friendliness. I always have great service here and enjoy my stay with my guest(s).

The food is always great in my opinion as the people I take here normally state their dishes are delicious and are impressed by how underrated this restaurant truly is. I find when people go to Eaton's they hit up the food court or venture outside of the vicinity to find food (hotdogs, streetfood, etc.) and don't realize this hidden gem is tucked right behind Zara.

I usually order the \"orecchiette pugliese\" which is a pasta dish that contains: fennel sausage, rapini, peperoncini for $16.95. It comes with jalapenos so I usually ask them to omit that. Anyway, each time I've been here I've been a fan and enjoyed every minute of it, therefore I will come back =D plus I like their desserts and complimentary bread sticks"}
{"text":"Very Nice atmosphere and delicious pasta. Recommend duck Ragusa pasta or leguine do mare. 
Also the manager is very coool !! And Dany thank you for great service :)"}
{"text":"I'm pleased to say that I am upping my review to five stars. I come in here often for a drink after work and sit at the bar. The bartenders are always friendly and funny. last night I had dinner on the patio with my best friend and her little 3 year old daughter. Not having children myself and working in the service industry, dining with a kid is something new for me.Thankfully, the child is question is super duper cute and well behaved.

We ate on the patio and it was a great atmosphere. Tables aren't crammed in and the shrubbery and landscaping were lovely.

Our server was great with everything including bringing out a new pasta without cheese for the little lass. We had a bottle of wine and some olives, arancini, fried cauliflower, then a burrata salad and the mushroom truffle pizza. The crust was absolutely perfect-- crispy and light and the toppings were delicious. 

What a show with the birds in neighbouring trees when the sun went down! They all began calling to one another and chirping wildly until it got dark and they were settled in the branches. 

I'm satisfied that this location does a solid job of everything. I usually shy away from chain restaurants-- especially ones in the mall, but I'm consistently surprised by the level of service, quality of food and overall positive vibe of this restaurant. 

Well done and Thanks!"}
{"text":"A friend came down from San Jose and wanted some Italian so I decided to make reservations at this restaurant. I just thought it was easier because we could go to the mall, do some shopping, and catch a movie after. I reached just in time and there was a line up but I made my way to the front and was greeted by a wonderful man and was seated immediately. We were sitting on the upper floor facing a church surrounded with trees, it was quite lovely. The ambience was really nice, cosy and I loved the industrial interior decor. Our server soon after came with two waters and we ordered a glass of Chanti and a glass of Nero buono. For appetizers, I grabbed the Carciofi al forno and the Calamari fritti. In about 5 to 10 minutes both apps arrived and they were delicious. The Carciogi al forno had creamy spinach and baked arthichokes, it just melted in my mouth.. Yum! The Calamari fritti was hot and crispy and the garlic cream and fennel was perfect. Our server would check up on us and refilled our glasses with wine and cleared our table. For my main I ordered the Margherita pizza and my friend got the Ravioli a Mano. The mains took awhile but the wine kept us yapping away not realizing half hour went by like it was nothing. At this point the server disappeared, but when we finally saw her she had our entrees and was coming our way. I find that my pizza was just a safe choice and I could've explored my palate but it was one of those indecisive days lol. My friend and I went half/half and shared our dinner, the ravioli was perfect and the sauce was thick and flavourful, it was so good. We skipped dessert since we decided to grab some milkshakes across the street. Overall, it was a great Italian restaurant and I will definitely try something a little more creative next time ;)"}
{"text":"I used to frequent this spot often for business lunches.  It's got a great little patio for watching people walk in and out of the Eaton center and an upstairs for larger parties (and washrooms).

Returning after a few months I'd say overall quality of food has degraded, but still OK.  Calamari is probably your best bet on the app menu, although my colleague ordered the caprese salad which looked nice.  I found the pastas to be a bit watery - as in there is a small pool of water at the bottom of my dish when I finish them.  Not a big deal and a sign that the pasta was at least cooked fresh.  My pizza was soggy in the middle and the crust on the bready side, but it wasn't terrible.  Service is excellent and so was my pinot grigio.

It's a reliable spot and probably 2nd to Joey's in terms of restaurants connected to the EC."}
{"text":"Just ate here - food was mediocre.  Had pizza with \"pancetta\" which was really nothing much more than bacon.  It was OK - but nothing great - although I did like the thin crust.  THE PROBLEM I HAD was we sat across from the kitchen and the guy who looked like chef (white coat) was preparing something.  I saw him take a bite with his fork - then use that fork to transfer the food from one plate to another.  Didn't use a different fork - just kept transferring from one plate to another.  Then, as we were leaving saw \"Chef\" use his hands - no gloves - to hold up a piece of fish to check temperature.  It just totally grossed me out.  Not a good sign!"}
{"text":"Waiter very rude to me today. I asked to use their washroom and they made a huge deal out of it. I am a regular at this restaurant and will never go again."}
{"text":"I've been back a couple of times with friends and we love the $28 bottle of prosecco (so affordable) and the menu has improved IMO. 
I had the Fazoretti with lamb ragu the other day and it was fantastic. 
Service was patient and efficient too"}
{"text":"If you work in or near the building, this is a fine bet for a quick lunch that still feels like a bit of a getaway. 

Highlights: 

Patio in the summer

Fruitti di mare (marinated shrimp, scallops, calamari, crostini)

Their Tarimusu served in a latte cup is delicious"}
{"text":"Off the chart food and drinks for being in a mall.  Not cheap mall food, but really quite impressive food and drinks, including a decent wine list.  The service was excellent as well.  If you want decent food that is not fast food, stop in here to get a good break from your shopping marathon."}
{"text":"Sat down on a Tuesday night so I would have expected no problems with service. Service is slow getting to the order and getting the food out of the kitchen.  Had the linguine w/ clams which was an incredibly small portion and overseasoned with garlic and pepper.   

Generally agree with other reviewers that this is a place you go for convenience at Eaton Centre in a place with nice amibance and where everything is sort of 'eh' but not great."}
{"text":"I have been to Mercatto many times, but this is my first review...the food, atmosphere and drinks are wonderful...highly recommend the antipasti grande which comes with a variety of salumi and cheeses...also the fried cauliflower is a must try...the mains are wonderfully seasoned and so delicious...highly recommended is the Orecchiette Pugliese.

My review specifically is about the management and staff...the management was able to accommodate us for my birthday dinner with 20 people and my mother who is not able to walk up many stairs...the management of Mercatto was very willing to change our seating from upstairs to the main level so that my mother would not walk upstairs...the wait staff, in particular our server, Ryan, were very pleasant and attentive...this customer service made our dinner such a extraordinary night...fun was had by everyone...the Eaton Centre location was great and easy to get to for everyone."}
{"text":"Was here last night....

Soup of the day was fabulous...very light yet creamy...distinct flavors...the fried onion on top did the magic...

Ambience was great, Service was perfect, was attended to whenever I needed something...

The cheese ravioli I felt was a little too bland...no really expounding flavors neither from the cheese nor from the sauce...the tomato based sauce almost felt like a palette cleanser for the cheese and not really complimenting each other. expected a little bit more from a 20 dollar dish. Perfect portion if you did all 3 courses...

Well definitely go in again to try other options out there."}
{"text":"I've been here 4 times this year. We normally decide to eat here because of the convenience when shopping or going to one of the Theatres, but each time I come I leave feeling indifferent about the place. 

The space is very nice, service is good, food is fine, but I always leave feeling underwhelmed when the bill comes. I believe it simply comes down to value for money. 

The appetizers are too small. The pasta portion sizes are more in line with a lunch menu but the prices are not. The pizza selections should be more creative and don't come out as consistent as some of their competitors. 

You won't be upset coming here. But as you walk out you'll say, it was fine, but I can't see myself coming back."}
{"text":"After having tried 7 different neapolitan pizza places lately, I was shocked to find that one of my favourite pizzas was from a place in the Eaton Centre that doesn't even have a wood fired oven.  But there's no getting around the empirical truth.  This place has the best pizza crust I've found so far.  While it's as thin as you'd expect in a neapolitan pizza, it's crispier than most.  Every bite has a satisfying crunch to it while still having a nice doughy chew.

I have tried the pizza here on a few different occasions - just to make sure it wasn't a fluke.  Nope, this place consistently delivers and exceptional pizza.  Highly recommended (despite the location.)"}
{"text":"Came here with my friend who just landed in Toronto. Made a reservation in advance, was taken to the upstairs area. Decor makes you feel comfortable, and different types of trendy foods that you can choose from. Portions are relatively large, and the price is quite reasonable as well. Would definitely come here again with friends."}
{"text":"Trattoria Mercatto was a great discovery inside Eaton Center in Toronto. A great restaurant with delicious food and beautiful views that are the perfect rest stop after a shopping day.

The restaurant is beautiful and with a lot of windows that provide a lot of natural light that makes it very bright.

The service is good, staff is attentive and efficient and the food is great! I got the linguini and it was delicious! The seafood was full of flavor and really took me back to the Mediterranean.

Really good restaurant to try and enjoy their great food."}
{"text":"Went for lunch and we both had pastas. Tasty enough, but not really that much food. Busy and noisy atmosphere, and not much elbow room....not at all comfortable. However, good service and friendly staff.  Might suit the \"trendy\" crowd, but not my cup of tea."}
{"text":"Ate here for lunch with party of 6. We all enjoyed the food,  which was surprising after reading some of the mediocre reviews.  The only negative was the unisex bathrooms.  My wife hates any place with unisex bathrooms as she finds men's washrooms much \"messier\"  than female only bathrooms.  I would eat here again but my wife wouldn't."}
{"text":"Overall not a good choice. Came in and sat at the bar as we were planning on having a quick meal before a show.  Ordered the ravioli with lamb sausage, my date had pasta with duck.  The meals came out surprisingly quickly, we were off to a good start. Unfortunately I kept wondering when I was going to hit the lamb as I was eating my dish.  The waiter never came by to ask how things were going, so I had to flag another one down. When the waiter finally did come over I asked how the lamb was supposed to be served, he gave me a somewhat accusatory tone that perhaps I had already eaten it. I'm a fan of lamb, that's why ordered the dish, I would've known had I eaten any.  Finally he agreed after consulting several people to correct the error. He actually asked if I just wanted some lamb on the side to put on top of my cold pasta.  Thankfully a coworker suggested that they should just make me a new dish.  The remade dish took forever, and as the waiter put it down he asked \"are you *sure* there wasn't lamb on the last one\"?  Seriously?  Never offered another glass of wine (my glass was empty for the entire time they were remaking my dish) - while not expected, it would have been a nice gesture to have given me one for the wait. Had to pay the bill as I was still eating my dinner, can't see me going back."}
{"text":"I loved this place. Truly. We came on a beautiful Saturday afternoon and enjoyed the back patio overlooking the VERY green Trinity Park. This is a very hard-to-come-by thing in the heart of Downtown. It was quiet and beautiful.

Service was truly lovely. Our server was incredibly helpful and when we asked her for reccomendations gave some very thoughtful answers and didn't steer us wrong. We split a pizza (wood fired, thin crust - not Libretto good, but very little is) and the ravioli with brown butter. Which was absolutely to die for. They have a nice set of craft brews on tap and some reasonably priced wine by the glass. Free bread service, and excellent gelato.

Can't say enough about the service, really. The smilingest group of servers I've ever seen, two hosts at the door, guys stopping to goof around and entertain toddlers... just top notch. I'd take it over Terroni ANY day of the week."}
{"text":"Came for a friend's birthday. Good for Italian food around the mall. Would still prefer Terroni or Gusto for pizza and pasta but for this area this is pretty good pizza and pasta. Food is quiet flavourful and love the decor inside"}
{"text":"nice place, best spaghetti i've had. just wish the portion sizes were bigger. i guess the portion size is good for if you want to get dessert afterwards.

cool thing was that they offered either water or sparkling water. even though i don't drink sparkling water."}
{"text":"I like the food here, but a dinner here does not come cheap. We easily spent $60 for 2 people, with appetizer, 2 mains and dessert and one drink. It's great that there are some more decent options around the Eaton Centre area, and this is one of my first choices. 

Good italian food, simple. Has the similar menu items to it's original locations, however what's the website doesn't seem to reflected in reality. 

I like the decor here, trendy but not pretentious. During the summer seems like they would have a nice patio on the courtyard. There are big tables so it's nice for groups. 

I would recommend it for groups, grabbing a casual meal or drink or dessert when in the area."}
{"text":"A good place to rest your tired feet after a long day of shopping at The Eaton Center. To boot, their food is commensurate with their prices. 

This is one of my go to places for a healthy comfort food when downtown. Additionally, their patio comes in handy in the summer."}
{"text":"Mmmmercatto. The food here is delish! First off, the decor and layout here is lovely. It's quite the surprising find in the Eaton Centre - I couldn't even tell I was inside a crazy busy mall! The service was delightful and the food, completely yummy. I had their daily special which was a taggliatelle with brussel sprouts and other delicious goodies. Seriously, it was stellar. I cannot wait for my next visit to Mercatto!"}
{"text":"Selection seems a little limited but the food was fresh and delicious. However ravioli portion was rather small."}
{"text":"Spontaneous dinner here on a week night after shopping. We entered from Eaton centre. This place is bigger than it looks!

Unfortunately I was too hungry to take photo.  The decor is kinda casual chic with some country charm.

We had the beetroot salad, which was nicely balanced with fresh bed of arugula. Then we shared a thin crusted funghi pizza. The smell of truffle oil was very appetizing.

For dessert I had the caramel peanut ice cream. This was too rich and I couldn't finish it 

Our server was very nice and attentive, despite being busy. Each table came with breadstick and she brought us more when we were finished.

The only thing I think will make this a better experience is

-if the breadstick were house made 
- if our salad and pizza didn't come at the same time.  By the time we finished the salad, the pizza was Luke warm and the sauce made the dough all soggy..."}
{"text":"A great place to grab a glass of wine and sit out side on a nice day. The meat/cheese plate we got wasn't overwhelming, or really enough for a hearty snack, but it was just enough for some peckish shoppers looking for a tasty bite and a couple sips."}
{"text":"PROS:
-Friendly service and free packaged breadsticks! 

-Food was great, but I think I've had better Italian (Terroni).

-Nice selection of foreign beers.

CONS:
-Not mind blowing. I had the raspberry chocolate cake and it was not smooth and more gritty. Not my cup of tea. 

OVERALL:
- If you're in the Eaton Centre and get hungry for non-court food food and its too cold outside, this will do the trick."}
{"text":"Save your money and eat in the Food Court get better food for less. The portions were tiny and tasteless. Very disappointing.

Roasted beet salad was pickled beet slices from a can. Goat cheese was a boring chunk of nothing special. Regular salad was nothing but lettuce. When they were served, we thought they had taken one order and split it. But each was $10-$12.

Margaretta pizza had bland chunks of plastic cheese, very little runny sauce, and doughy pizza. Could hardly eat it because it slid apart.

Service was friendly enough, but only one glass of water each - no refills.

Sad experience."}
{"text":"AFFETTATI      e      FORMAGGI
----------------              ----------------
COPPA                     MOZZARELLA DI BUFALA
BRESAOLA              TESTADURA

Selection of local and imported artisanal meats and cheeses($16.00)

********************************************************************

During 2215 hour, we were at T-M for Bar Menu and Liquori.

Classic example of how times have changed for better or worst.
                                         ---------------
Servers were West of Bathurst imports; clothes, ages and attitudes.
He truthfully said he had no idea what Cocktails were T-M Favs.
It was pure jokes when he stood quietly awaiting behind my Friend.
As Friend took \"questionable\" photos and spooked when she realized.

Restrooms were unbelievably impressive, I heart T-M restrooms.
Individual room per person, along with a speaker for Music enjoyments.
Wallpaper of Italian Newspaper theme for your reading pleasures.
I did not at all feel the need for a Television & Sports combo here.

********************************************************************

Back to Food...

Meat & Cheese selection brings me back to my school years.
My roommate being Prosciutto di Parma savouring, De Cecco
Pasta boiling, Parmigiano Reggiano chomping Italian Canadian.
Selection here might not be as comparable in Fame but nonetheless.

Testadura(Goat Cheese/Italy) brings me to a lush green pasture in Italy.
Mozzarella(Buffalo/Woodbridge) brings me to Woodbridge, my area.
I've never encountered a Buffalo on my daily route thru Woodbridge.
Cheese is Made-in-Woodbridge(LOCAL), Buffalo Milk import elsewhere.

Coppa & Bresaola variety were good contrast as well, as a theme.
Obviously I like Coppa as oppose to my lean non-fatty eating Friend.
Wrap the cured meat around a breadstick to mellow the saltiness.
Take in some oiled Olives to end an excellent night of le DOLCE VITA."}
{"text":"Had an early dinner here on a rainy Friday night..  We had a reservation which was cheerfully honored.  The service was attentive, friendly and knowledgeable.   We brought our kids, boys 9 and 10.  It's not kid unfriendly, pizza and dessert, hello! But there is no kids menu and there is no basic pepperoni pizza.   kids shared the salisicca pizza.  Loved it!  DH had seafood pasta with fresh PEI mussels.  I had the arctic char with vegetables.   So have the pizza and be happy.  Have the pasta and be happy.  Have a regular entree and be happy.  Wine and beer lists were great and the desserts were amazing,"}
{"text":"I came here for lunch today. I wasn't impressed. I ordered margherita pizza for my little one and they refused to add chicken. I guess they work on a line and there is no room for real cooking or options in the kitchen. After that exchange with the server I opted out of ordering more items from the menu and they missed out on orders for a cocktail, appetizer, and dessert. Prosciutto pizza was decent. All the pizzas are soggy and you can't hold it up to eat because of the thin crust. I had the pork scallopini and the chop came out pink and raw on the inside. I told the server picking up my plate and he said he would mention it to my table server. They did nothing and the bill came. Pork was also super salty tasted and bitter. I had this dish here before and this very same location and I know they can do better. Pizzas were bad today. Very disappointed at the food and service. Not returning to this location."}
{"text":"atmosphere here was very nice and a good date spot 
the menu was a little confusing because it was in Italian I think but the waiter was happy to help
I got the seafood linguine as recommended as the waiter as a popular dish 
The food took quite a while to arrive but we did get free bread with olive oil but it was quite hard and dry so I did not really like it and didn't eat it
when we got the food we were quite disappointed by the portion as it was expensive for the small portion we got. we easily demolished  the noodles in 5  min and felt hungry even after spending around $25. the noodles themselves were very tasty and flavourful and they add cheese at the top but definitely not worth the price so only come if you're willing to splurge or have a small stomach
overall I would not come again due to the high price tag and the small portions"}
{"text":"Underwhelming!! Pasta portion was small with barely any tomato sauce and one small piece of mozzarella - the sauce had a weird spice combo in it - tasted more like clove/cinnamon than tomato sauce. The marguerita pizza was mainly tomato sauce...maybe 5 small pieces of cheese and 4 small pieces of basil. Service was minimal- the server kept guessing what we were going to order and then pointed at things on the menu without saying anything- we think this was his way of suggesting what we should order although he didn't say anything so we weren't sure. We barely saw the server - he gave us one menu for two people and we tried to get another one but it never happened. 
 I would never return to this restaurant- there are so many other options for great Italian food in the city...don't waste your money here."}
{"text":"My friend held her birthday celebration here and the staff was very accommodating of such a big party. The food was good, but very overpriced. I ordered a margherita pizza for $15 and the pizza was literally paper thin! The pasta portions were even smaller. There's other Italian restaurants I would recommend downtown but this one is conveniently inside the eaton centre."}
{"text":"Bit of a hidden place for dining if your shopping around the mall, I only figured this place out from a co worker, wish I found out sooner because I'm always walking around the mall wondering where to eat on yonge st and if I should walk towards college for options. 

This place gets really packed so avoid coming here during rush hour dining times, anytime after 4pm should be okay tho. I really enjoy this place because you can order freshly made pizza to your liking and it's perfect portion just for yourself. I got the margarita one, which comes with basil, tomato and cheese. If you wanna feel all Italian, the bottles of wine here aren't priced too high for typical brands. 

Overall..Place is great, I just wished the seating weren't stools, it would've been more enjoyable."}
{"text":"Had a slice of the agnello pizza (lamb sausage, calabrese olives, charred onions, fior, oregano, san marzano). My brother did the ordering and the bringing home, so I had no idea what I was eating, other than \"pizza\". Guessing before looking up what I was eating on their menu was fun. I definitely tasted the lamb sausage, the olives, and the oregano. The oregano, when I bit into it, was quite overwhelming. I would prefer it in slightly smaller pieces. Fresh oregano though. The olives were nothing to write home about (wow. Yelp has influenced my writing style.) The lamb sausage was pretty fantastic. I thought it was ground beef, upon first glance. Chunky ground beef. Decent amount of it. Then I tasted it and I knew it wasn't ground beef, but I couldn't immediately place what it was. Then it hit me that it tasted slightly of lamb, but not strongly of it. I wasn't sure until I looked at the menu. It's brilliant though. It's subtle but distinct. Sounds like an oxymoron, but that's the definition that fits. The pizza itself is thin crust and all in all quite tasty.

What I'm giving it four stars for though, is the sausage."}
{"text":"I just had lunch for the first time at this restaurant. I had the braised lamb shank and paired with a glass of red wine. The dish was good and I ate it all. I have no complaints about the food. Perhaps bread instead of breadsticks would be nice.

The problem was the service. It took them 10 minutes to get me water. Then it took another 5 minutes to get me my wine. Then it took 30 minutes for my dish. Not impressed. I came at 1pm past the lunch crowd. Service didn't feel welcoming or pleasant. As a business professional, I need good service so I can get back to work as soon as possible. For that reason I will not be coming back."}
{"text":"Came here for a lunch meeting my first day of a new job with my new boss.

She had made a reservation prior however we inexplicably had to wait 10 minutes for a table which was a bit disappointing.

While waiting for our food, we were given little packs of italian breadsticks which were tasty and appreciated (I was STARVING).

We shared the fried cauliflower appetizer which was very tasty, complete with cheese on top and some type of aoili.

As for my main I selected the arctic char and my boss got the tuna. I enjoyed my dish however the chickory (?) puree on the bottom of the plate was actually cold, which was a bummer.

Overall the space is gorgeous and the food has potential to be great but I just wasn't wowed by my experience here."}
{"text":"Food is okay and came quick. The service is not very good. The servers are unfriendly and slow. You are not allowed to even bring a Starbucks into the restaurant, they will not seat you."}
{"text":"A pretty good first time experience, went there with a friend on a Sunday after the ballet. The hostess/waiter/food runner were all pretty friendly. I loooved the calamari, it was really good, way better than I thought it would be. My friend got the seafood pasta and I got a pizza. Meh, they were just okay, nothing too spectacular. The dessert wasn't great either. It was just a standard pre-made tiramisu. But it took 15 to 20 mins for the runner to bring it to us... and it was pretty disappointing, not a great way to end a meal. The waiter was really sweet though, which made up for the bland dessert."}
{"text":"Had high expectations of this place, was very unimpressed. Food was not good at all. I've eaten at a lot of restaurants downtown, and expect the prices but the food was not even close to being worth the price. Bad service (took forever to order). The only positive was the design of the restaurant, looked great inside. Unfortunately everything else left me very underwhelmed."}
{"text":"I ordered: porecchiette pugliese = $22 (w/ tax + tip)

Recommendation: Great for any occasion (brunch, dinner, etc.)

(0.5/1) Price vs portion

(1.5/2) Taste + food presentation 
- Right amount of blue cheese
- Served hot
- Balance between meat and pasta
- Cute bread sticks 
- Experienced better pasta for the price
- Nice dishes = great for pictures
- My friends really enjoyed their sea food pasta and pizza

(1/1)  customer service
- friendly greetings
- server asked about the meal

(1/1) Setting - Wow!
- Beautiful restaurant beside a beautiful church = nice ambiance
- Chic chandelier and decorations"}
{"text":"Solid Italian food with a nice selection of pastas and pizzas, but service could use a little bit more work, as staff seem quite busy and understaffed. Portion sizes are on the small end, but you can get dessert afterwards here or along Dundas if you'd like. Food is very well presented and fairly priced considering it's in the heart of Downtown Toronto right in Eaton centre, but it was on the salty side."}
{"text":"Holy shit. I think I'm going to stroke out because of all that salt!
A simple plate of pasta was destroyed due to a chefs non functioning tastebuds. 
Service was ok. Patio was on point."}
{"text":"I came to Trattoria Mercatto one day for lunch with some relatives who were visiting Toronto from overseas. 

The restaurant is a good and clean establishment that is decorated well and definitely a good option for a restaurant that is located in a mall when you want a sit down restaurant and don't feel like eating at a chain that is typical of shopping malls.

I ordered two appetizer dishes for my meal:
1) Misticanza - mixed lettuces, celery hearts, radish, aged sherry vinaigrette ($8) - this was a good salad and a decent sized portion for an appetizer
2) Frutti di Mare - marinated shrimp, scallops, calamari, red onion, crostini ($11.50) - this was like a ceviche (although with cooked seafood) or a seafood salad with a vinaigrette-type dressing served in a dish with two small and rather thin pieces of crostini on the side. If you order this dish, I would recommend that you get a salad too because you receive much more seafood than could possibly fit on the two pieces of crostini, so I ended up using the left over seafood as a topping on my salad.

Our server was attentive and our guests enjoyed themselves. Overall it was a good experience."}
{"text":"Stopped in for lunch while at the Eaton Centre. We split the Diavola Pizza and Orecchiette. Both were excellent and service was great. Highly recommend."}
{"text":"Had a very tasty dinner here with a friend.
Our server was really friendly, helpful (and handsome). 
The place has a casual yet still upscale and trendy vibe about it.
We had the calamari fritti to start.  It wasn't the best ever but it was tender and crispy- still very good.
I ordered the butternut squash ravioli and it was DELICIOUSS!  The brown butter sauce was rich and slightly acidic with a kick of balsamic.
My friend ordered a pasta dish with rapini and fennel sausage.  He isn't Italian (unlike my 1/4 self) and was kind of thrown off by the new tastes of fennel and rapini, but he enjoyed it after all.  I love both flavours and from what I stole from his plate I really liked the flavours too.
We ordered a couple of cocktails too which were fun and delicious.  The bartender even came by our table to ask us what we thought of his newest creations.
I'd definitely come by again when I'm shopping or out with friends in the area."}
{"text":"Amazing location, very very convenient with cute decors but food was mediocre, small portion (but nice presentation), and service isn't consistent. My friend and I had Linguini di mare, Chitarra alla carbonara, and Calamari fritti. Hopefully the service and food quality will have improved the next time we visit."}
{"text":"Good, fairly priced wine list. Very tasty bread and crunchy breadsticks. Good beet salad. Amazing lamb skewers and solid tuna entre. Solid pastas. Great lamb shank. Great steak. Very good looking wait staff. Come here all the time. For the price - you can't go wrong."}
{"text":"Server Brooke is a bit off track. Each table she have been served have biscuits sticks except us. Ordered a lamp chop but end up with pork chop on the table. One glass of water being poured from start as we sat down. Food is good but need to polish up on the service. Price is not an issue but my first experience might not get me back for the second time. I tipped her 15% based on the quality of food which I enjoyed."}
{"text":"Another addition to the Mercatto family now located at Eaton Centre!  My friend and I came here on a Monday evening.  Service was fairly fast.  Nothing too different from the other Mercattos.  However, I was a little bit confused by the pre-packaged breadsticks that were offered.

I ordered myself the bucatini.  It was good - had a little kick to it the spices, but it was a bit salty as well.  My friend and I ordered ourselves the affogato on the menu.  Espresso was a bit too strong, and the gelato provided was a chocolate one (I would've preferred something else - like vanilla).  I found the one at Terroni much better.

Overall, nice place to go to in the Eaton Centre area versus Mr. GreenJeans or whatever."}
{"text":"I don't know why this place is always over looked but it has a great quality to price ratio.

We had:
- Pizza with aged balsamic goat cheese and cured beef
- Filet Mignon
- 3 cocktails
= 75$ plus tip

Honestly, the food was delicious. Not a big fan of the sides that was served with the steak, over battered onion rings and oily stir fry, but the meat was perfectly done.

And that pizza..I will go back there just for that pizza.

This is my casual weekday meal place! Awesome

Bonus: In the mall!"}
{"text":"No reservation at 7pm on a saturday? unheard of, but we were seated as soon as we arrived. +1 

As a descendant of an Italian, I am all for Italiany-things, but we all need to be clear that this restaurant is translated to \"Market Restaurant/Tavern\". Kinda lame. 

As an example \"Sedia di Legno\" would sound like an Italian restaurant I would happily throw my money at. Also \"sedia di legno\" translates to 'wooden chair\", further proving that it doesnt fucking matter what you call your Italian restaurant, as long as it sounds legit.

But sounding legit, and being legit are 2 vastly different things.

Unboxed breadsticks in a package that resemble chopsticks is hardly an inspired choice. I dont know what part of Italy they aspire to represent, but simply nowhere in Italy does a restaurant not serve bread.

I overheard a waiter, tell another waiter \"never to put the ketchup bottle on the table, it must be poured into a small bowl\". This kinda is the problem with this restaurant.

Food first should be the modus operandi

I ordered a Diavola pizza and a Buffalo, pomodoro and spaghetti pasta. 

Diavola is devil, so the pizza is supposed to be spicy because the devil would be a spicy fella, apparently.

The crust was good, chewy as hoped, a wee bit charred. The salami provided a mouses fart worth of heat, in fact generally I got more salt than heat. It was fine. 

The pasta. 

First of all, we think medium to obnoxious when we think of Italian food portions. 

As long as you operate as though the order is for Tony Soprano, then you should be fine.

I got a serving fit for an Olsen twin.

Food quality over presentation is key - not here. I get it, you have learned to turn your wrist when plating a long pasta. OK. But in the end I got a chickadee's sized nest of spaghetti. I ate it in 5 twirls of a fork.

The Pomodoro (red sauce) should be fresh and it was, should be simple, and it was. It was sweet and it shouldn't have been. It is confusing, unappealing and highlights that more basil, olive oil, pepper (or something else) should have been added. I commented to my friends that it was almost as if there was teaspoon of white sugar added.

Thank you for the 2 small pulls of Buffalo mozzarella. 

Our waitress played hard to get the entire time. We saw her at the beginning, and the end.

This was a mediocre restaurant experience."}
{"text":"This is the most reliable place to dine in TO. Not only is the atmosphere pretty cool - especially on a warm summer evening on the patio - the food rocks. Don't be fooled by the fact it's attached to a mall. Mercatto at Eaton Centre is awesome for dinners with friends, co-workers, colleagues, or anyone - even dates.  I've never been disappointed with any meal I've ever had there. I often recommend it to friends and always to out of town guests. 

I do miss the bucatini though. Wasn't on the menu last time i was there and i loved it! Last thing I'll say is that last time I was there a few weeks ago, dishes seemed smaller than usual... hopefully they're not skimping or I'll change my vote after next visit."}
{"text":"It is a great place!

Delicious food, great selection of wines, amazing coffee, perfect service, and you get free Italian breadsticks :)

I love this place, it is pricey, but the quality is impeccable. You can pick anything from the menu and it will be delicious! And their coffee really won me over (not your coffee-shop generic coffee, but a really good high-quality kind).

I really can't imagine why anyone would not enjoy this place."}
{"text":"Came in for dinner around 6pm on a Saturday.  There wasn't any wait, we were seated right away although the place was almost full.  

Ordered the following:
Zuppa di Stagione - soup with mussels (very good and mussel tasted fresh)
Calamari fritti - with garlic crema (kinda too salty for my taste)
Linguini di Mare - with bay scallops, mussels & calamari (hubby ordered this, a little spicy but still tasted good)
Maiale - 10oz bone in pork scaloppine, chickpeas, caper vinaigrette, baby kale and fennel salad (just so-so for me.  Tasted kinda \"soury\", and there's a portion near the bone that's still rare). 

The interior decor is trendy and hip.  I love the bathrooms with its own white sink, big mirrors & dryer. 

For the food, I'd rate this 3 star for the decor, 4 star.  I wouldn't come back here for the food if I'm in the Toronto area."}
{"text":"Shopping at the Eaton Center makes you hungry! My friend and I stopped in because the ambiance was cool and Italian sounded good. It was early evening on a Thursday night. 

The wait staff was friendly, attentive and helpful. I don't care for sweet tea so the server offered to brew some for me if I didn't mind a short wait. Very impressed by this and it was perfectly brewed!

We ordered the Funghi E Olive and the Malalina (fenel sausage pizza) to share. It was the perfect size for two. The food was excellent! 

Loved it!"}
{"text":"Heard good things about the place n gave it a shot, but turned out way below my expectations. We ordered bunch of food but the lamb sausage pizza was disgusting, way over done, lamb sausage was just a black tar it was burnt. We notified the server n she just looked at it, smiled n walked away. That was the biggest turn off."}
{"text":"It wasn't the best Italian.  Why are the pizza slices cut so large?  Why so much cocoa on top of the tiramisu?  Why almonds in the beet and arugula salad and not candied walnuts?  Why were we seated next to 12 screaming, annoying 15 year old girls and not at the bar like we have asked?  On a happy note, the mall is amazing."}
{"text":"The menu has changed from what I remembered.  However, despite losing the flare of its old menu, the food is still amazing.  I just want the old menu back.

Trattoria Mercatto has always been that posh but very quiet bistro-esque restaurant tucked away under the escalator at Eaton Centre.  It's the quiet but very trendy, very hip cousin of yours that you don't say much to at family gatherings.  However, once you get to talk to said cousin, you're amazed at how much like this person.  The same can be said for Trattoria Mercatto.

I was first here after going through a midterm with a buddy, back again with family, and back again with friends, and this time, back again with visiting relatives.  Every time, I have come back and have been thoroughly satisfied.

I've never given 5 stars for a restaurant before, but this one deserves one.  It's not pricey to the point you'll cry, but it's enough to make you appreciate what you're paying for.  

The grilled chicken normally would bring forth a sense of dryness due to being over the fire.  Wrong.  It's juicy and tender as if it was pan fried with juices.  It was on the old menu, and still here (but with a different spice) but never ceased to be amazing.  The choice of vegetables not only brought forth a very nice Italian feel, but it had a hearty feel without being outrageously super-sized or overfilling.

Pizza is always an interesting choice when coming to a restaurant like this.  However, they make it amazing.  

I may have oversold it, but I think it's entirely worth your while to give this place a shot.  Friendly service, casual and relaxed atmosphere, and good food, hardly a way to go wrong."}
{"text":"Underwhelmed. Pizza was ok, not great.  Arancini was cold on the inside.  Salad was blah.  Our server was quite nice, and did well.  Nothing jumped out at us on the menu, and I'm always a bit disappointed to see truffle oil in multiple dishes on a menu.  It's not a cure all for a boring dish so do something creative instead please, otherwise you're a just a below average Italian joint in a mall.  Which is my summary."}
{"text":"The food is good, although I could do without the pre-packaged breadsticks. 

As a parent, I'm impressed by how flexible the kitchen was about making a pasta that my 5 year old would like. They have no kids menu, but they basically let us throw anything together that we wanted. Ended up with a rigatoni in a cream sauce, with mushrooms and peppers. It was yummy and my kid was quite satisfied. Although the Disney action figure that we bought him just before dinner may have biased the review. 

The food came very quickly, especially since we arrived during Saturday dinner rush. Our waitress was really helpful and attentive. 

Ambience is on the noisy side. I love open kitchens and this one had regular fire flares from the oven that made dinner exciting. I can only hope that their sprinklers are up to code."}
{"text":"(2.5 stars)

Sorry to bring the rating down, but I was pretty disappointed with my experience here. Came on a Friday night, so it was busy. My friend and I waited 15 minutes for a table, which was fine. The place was buzzing and the decor is warm and rustic. Service however, was ridiculous. It took around 15-20 minutes before *anyone* came to our table to take our order or pour us some water. We asked one guy if we could order, he said he would tell our server but even after that it was a long wait. Now, it's Friday night and they should anticipate the rush. There actually were tons of staff, but some of them seemed to just be hanging around... So, the poor service was really puzzling. When our waiter finally came, he was pretty indifferent...

Food was good though. We had the eggplant appetizer ($7) which came in a jar with some warm bread. Mmm... I had the spaghetti carbonara ($16)(they had some other name for it, but essentially it was spaghetti carbonara). It was creamy and flavourful, although they could go easy on the black pepper. My friend had the panini with lamb and banana peppers, which she enjoyed but said it was spicier than she expected (she wanted more water, but nobody came...). It came with a choice of salad/fries. She had the salad and it was a good portion with grated cheese on top. 

We were too annoyed to stick around for dessert/coffee.  

In summary: 
- I have been to the Mercatto on Bay St., Toronto St., and in the MaRS building and felt this one did not measure up to those. 
- Great to have a decent dining option in the Eaton Centre (this is a step up from City Grill which used to be in this space). 
- I would maybe give this place one more shot (the pizzas and the gelato looked amazing, and a lot of people were ordering the fried calamari), but if the service doesn't improve I would take my business elsewhere."}
{"text":"Amaze balls, I've eaten here several times just because my hotel is next door but it has always been great. Best restaurant attached to a mall ever! Carbonara was off the charts, pizza was amazing, red wine is properly chilled, what else do you want!"}
{"text":"Ingredients always fresh, although portions are small for the price. Service is sometimes slower than expectations. Nice decor, stylish ambience, nice menu. Great wine list. No wifi"}
{"text":"I've been wanting to try this restaurant for so long but never got a chance until recently.

My friend and I ordered the arancini (chive risotto, provolone, spicy tomato sauce) for $10.95. It came out so quickly and it was extremely delicious because it was so cheesy! There were 3 nice pieces for the price.

I got the ravioli (lemon ricotta stuffed, lamb sausage, golden beets, brown butter) for $20.50. I thought that this dish was slightly expensive. I wouldn't say this is the best ravioli I've ever had. However, it wasn't bad. My favourite part of the dish had to be the golden beets, it gave a nice crunch to the dish.

My friend got the rigatoni alla bolognese and I had some to try. I thought that it was very flavourful and set at a good price.

Lastly, I ended off my meal with a tiramisu. It came in a small ish bowl which was fine because I found it a bit too sweet. Keep in mind that I have a major sweet tooth and even I found it too sweet!

I think the only part I didn't enjoy from this meal was the complimentary bread sticks. It's just odd that it's in a package and not made in house. The service was decent on a non busy Thursday night. I would definitely come back here after a day of shopping!"}
{"text":"Full disclosure...We only did the charcuterie and drank (and did this all while sitting at the bar).

First, we entered from the mall entrance... behind an escalator, a bit of a weird entrance...

The décor is great and the atmosphere seemed to be nice. We had the large charcuterie plate which was yummy.

The original bartender we had was not super engaging and didn't help us much when we would ask questions... or just try to be playful, but the second one we had was great and helpful with suggestions.

The staff were interacted with were mostly pleasant.

The atmosphere was nice, food looked good, and the items we had were good."}
{"text":"Walking back to the hotel, I met up with some friends at the Eaton Center.  The mall is huge!  Many different levels.  Since I had some churros during the movie, I was hungry for something a little more.  We didn't want to do food court food, but this restaurant was inside the mall, so why not.  

I ordered the beet salad with arrugula.  The others weren't hungry, but we shared a bottle of wine.  The salad had goat cheese and some sliced almonds, and was good.  The service was great!  They were just at the tail end of the lunch crowd.  Our server told us some tv show was filming outside and some of the cast and crew came in for lunch.  I thought about going out there to take photos, but it was hot...LOL!"}
{"text":"Food was underwhelming. I went with with a group of 4 and we got the antipasti grande (a charcuterie board) to share. Originally I wanted to get it for myself but because of it's hefty price tag ($26.95), I thought it was gonna be big and that I wouldn't be able to finish it. It was described to us as \"grand\" and \"big\"...it was anything but that. It came with 4 crackers 3 types of cured meats, 4 slices each, 3 small portions of cheese, some pretzel knots and some condiments. The taste...nothing mind-blowing, and for the price, I was not impressed. Because I had such a small helping of the appetizer, I also got the pasta special for the day. Again, not impressed. It was very small and very salty. So so so so salty. Needless to say, I did not finish it. The waiter was nice though. I'd rather go to the food court next time"}
{"text":"Service, ambience, décor, and food here are all A-OK, but nothing seems to surpass expectations. I came here on a Friday night and it was not very busy but it seems very loud inside. It's not the best spot to relax and unwind in peace and quiet, but should we really expect that in The Eaton Centre? Perhaps I'm asking for too much?

I ordered the tuna and potato entrée and it was pretty tiny - they don't serve breadsticks unless you order them from what I can tell, but I didn't realize this until I was nearly done my meal. The fish was tasty but the serving of potatoes and greens was rather stingy - it wouldn't hurt to fill out the plate!

The individual bathrooms are private, clean, and designed with a rustic nod to glory days of yore. Cute."}
{"text":"I tried Mercatto on College before coming here so I already had positive feelings toward the chain.  I'm glad to say that Trattoria Mercatto just added to the positivity!

I've been twice now-once with friends and 2 babies, and once for a girlie lunch with a friend of mine.  Both experiences were really good.  It's busy there-especially the downstairs section. I don't think I'd wanted to be seated downstairs if I wanted a quiet lunch.  It's fun to people watch though and they have TVs over the bar if you want to catch up on a sporting event.  The staff are friendly and smiled even when the 1 year old decided that she really really wanted to try to dance on the table.  I had a bean soup the first time I went which was very tasty and came with some foccacia.   The girls were extremely happy with their calamari (and their wine).

For my second visit, we were upstairs which was much quieter.  I tried butternut squash soup which was just OK.  I found it a bit bland.  I had to ask for bread to go with it but our friendly (and attractive) waiter provided me with a plate of fresh, crusty bread in a snap.  My friend had a panini which came with a big bowl of fries.  She found her panini tasty.  I thought the fries could have been tastier but still managed to deplete her serving so they obviously weren't that bad!  We deliberated over dessert and luckily the waiter wasn't annoyed-he just offered suggestions.  We decided to try the doughnuts some other time and shared the caramel copetta instead.  I think my friend described it best as \"like a fancy Snickers ice-cream\".  It was a great sweet and salty mix and there was enough to share if you just want something a little sweet after a meal.

It's by far the nicest place to eat in the Eaton Centre and you kind of forget where you are in there.  Service was great both times I've been and I've seen both the buzzing side and the quieter dining room.  I liked both.  Must go back to try those doughnuts..."}
{"text":"Nothing says comfort like a good old-fashioned and well-cooked Italian meal. With Toronto's abundance of restaurant choices - it's hard to find one that stays true to authentic Italian cuisine. However, I found just that when I attended Trattoria by Mercatto located inside Toronto's Eaton Centre. 

From the outside, the restaurant seems unassuming but once inside you're greeted with an abundance of delicious and fresh flavours in their menu with a beautiful selection of cocktails. Our luncheon started off on the lighter side of things with the rustic flavours of the Barbabietole Arrosto ($11.95/dish consisting of beets, burrata, arugula, almonds and aged balsamic). The dish was classic and simple and executed almost to perfection. 

As some Prosecco Serenissima was passed around the table, the next course which was all about seafood! Beautiful bowls of Frutti Di Mare ($11.50/dish and consisting of marinated shrimp, bay scallops, calamari, red onion, and crostini) were presented. Hits of citrus popped into my mouth creating a flavour explosion with the subtle lemon-lime undertones that matched my glass of sparkling. It was a match made in heaven.

The best was truly saved for last and that was the Short Rib Crostini ($12.50/dish) and the Polpette ($11.50/dish for 3 veal and pork meatballs, roasted eggplant and tomato caponata) which both had balanced and complex flavours with wonderful finishes. The short rib was juicy and tender filled with an immense amount of au jus whereas the meatballs had hearty sauce (which you couldn't leave on the plate). 

From the beautiful windows, communal tables and most importantly, the warming atmosphere. Who knew that a little slice of Italy could be found in the Toronto Eaton Centre at Trattoria? If you're just looking to re-charge those batteries after a day of shopping or looking for a great place for cocktails and antipasti - then look no further.  Be aware: menu items do change seasonally and some items mentioned may not be available upon visiting."}
{"text":"I had the Diaviola and the Margarita pizza, they were both amazing! On a trip from NYC and this place was by far one of the best food highlights."}
{"text":"I had a late lunch today at Trattoria Mercatto.

I ordered a Diavola pizza (spicy sopressata, fior, basil, san marzano).  It was a thin crust pizza and tasty.  The sopressata had a bit of a bite but wasn't too spicy.  The tomatoes in the sauce had a lot of flavour.

Steven was my server.  He was friendly and took good care of me."}
{"text":"As far as restaurants in the eaton centre goes, this is a nice place. 

As far as comparing this to other locations, it's nothing to write home about. 

As far as food quality goes, it's good, but it's still a little on the pricey side. 

It's not a bad restaurant by any stretch of the imagination, but it's not amazing either. It is very clearly a chain now."}
{"text":"Food is over priced.
20$ for a small pizza with poor cheese and poor bacon and meat.
Service is not that perfect anyways
food quality and service are not that perfect for the money I paid.
I am really amazed by how crowded this place is! it's really not worth it!"}
{"text":"Okay so, first of all, I got to say that I have no clue how this place is rated the same as \"Trattoria Nervosa\", Yorkville on Yelp. My experience at Trattoria Mercatto was close to terrible.

To start with: 
The staff was friendly overall but they were VERY slow in taking orders and giving me and my friend a seat. Although there were only a few customers in the restaurant,  I can honestly say it took them 10- 15 minutes to take our orders.
Around 5 minutes after our orders were taken, our appetizer arrived quick, too quick, which was great! UNTIL, we tasted it. The appetizer was \"Calamari Fritti\" meaning fried calamaris, I understand that they were fried but all I could taste was the grease. There was only a little bit of sauce and it didn't help outweigh the flavor of grease all over the calamari.
Additionally, in an Italian restaurant, you'd expect there to be served olive oil and some fresh bread from the house as an appetizer. There were packaged crunchy bread sticks. I mean, it didn't look appetizing and it did not taste any better.

Considering the main course: aaahhh... Where should I start... We had Risotto Di Gamberetti and Risotto Al Fungi. The taste of Risotto Al Funghi was OK! Our issue was with the Gamberetti. The Gamberetti was one of the worst risottos I've ever eaten. It had no seasoning (Definitely NO SALT), the sauce had no taste (we did not even taste the cheese on the food.) We were not served complimentary parmesan with our risotto which is another thing you'd also expect from an Italian restaurant that serves overpriced food. 

Conclusion: The decor and overall ambiance raises expectations but, the standards will definitely go down once you taste their food. Here's the worst part:  We had 1 appetizer, 2 risottos, and 2 glasses of wine = $99.5 before tip. How terrible!? 

Will not come back again."}
{"text":"We came here on a Friday for lunch to get away from work (hoping for patio but ending up being inside because the patio was packed) sat down and our waiter dropped by and offered drinks. We decided and he came back, took our order and left some pre-packaged breadsticks on the table. That was the last time we saw our waiter at our table. And, quite frankly, the last time we saw him doing anything other than running up and down the stairs and glossing over us when checking the status of the tables on the upper level.

First off, this is supposed to be a really great Italian style place and you're giving each person pre-packaged breadsticks? Wasn't terribly impressed with that, its just plain lazy. That and the fact that right behind one of my coworkers was a wood slab with beautiful fresh bread on it (which we weren't served until we asked for it) was annoying. After waiting about 20 minutes, during which time the upper level became much busier and fuller, one of my coworkers asked the bus boy for some of the bread on the aforementioned wood slab and he brought over 4 slices (one for each of us) and some olive oil and balsamic. Gotta say, that bus boy? FANTASTIC. Seriously, he was great. Refilling water, brought us bread, did his best to make us happy.

I think it had been about 40 minutes from the time we ordered that we got our food delivered to the table, and none of us were pleased at this point. I ordered one of the panini sandwiches, and while the portion size was good, I was not pleased to see other people around me ordering the same thing and being given an option of a side. The menu doesn't specify whether there are sides so we assumed not and my waiter asked nothing about it (i.e. do you want salad/fries/whatever) so I took that as no sides. I got a salad, which was yummy regardless, as the side but other people had these wicked looking fries that I would have chosen over a salad HAD I BEEN OFFERED THE CHOICE. My coworkers got 2 pasta dishes and a pizza; the pizza was a great size but the pasta dishes were small. Overall, at this point, we all felt as though what we got was not worth what we paid for.

So my feelings about the food: I didn't try anyone else's dishes but the general response was that they were good but not great. I could have gotten a similar sandwich to the one I received at another place nearby for half the price (and probably with a side as well). It wasn't anything special, nothing to write home about and I wouldn't order it again. It wasn't terribly offensive, it just didnt knock my socks off. If you're only going to offer 4 sandwiches, they should be original, fantastic creations. Not something I could order at subway for half the price.

We sat for at least 15 minutes after finishing our meals and NO ONE came to take our plates. One of my biggest pet peeves. You see a bunch of patrons sitting at a table with empty plates and you walk away? They had enough bus boy staffers that our table should have been emptied immediately, or at least within 5. We had to call over another waitress to get our bills, who then cleared our table and we paid her.

Now it wasn't until we were paying for our boring meal and terrible experience that the waitress told us that our original 'waiter' was actually the manager and the section was short staffed and technically all the tables were hers and he was helping her out. As a former server I get that.

However, also as a former server a few tips to management:

if you're short staffed, don't seat the bloody section! If you don't have the staff to give good or at least decent service to all your patrons, section off a portion of your restaurant and do NOT seat it. I am certain that we were not the only patrons who were disappointed with their service today. For a server, over-seating a section is a disaster and quite frankly, you get less tips because you have less time to care for each table.

If you're short staffed, TELL YOUR TABLES. We were coming from/going back to work and if we had known that we were going to spend an hour and a half here for lunch, we would have gone somewhere else or we would have been more patient. If you don't tell the customers that things are running behind, you have no one to blame but yourself for poor management.

I was SO excited that I was finally getting to try this place out because I've always wanted to go to the Mercatto location on Bay but never had the chance. I was looking forward to some great food and I was incredibly disappointed. I will not return and neither will my coworkers. We all agreed that the quality of food was lacking for the price, the amount of food was lacking for the price and the service was ABYSMAL."}
{"text":"I had the same problem with my server as most reviewers.  He would disappear and not take my order.  It took the manager to come and explain everything to me about the food.  He(the manager) was very knowledgeable about his wine.  I was really impressed.  The food is small portions makes me want to plan ahead and order an appetizer before hand.  Anyways good food and good wine.  At least they gave a sample of the wine unlike some places."}
{"text":"I'm leaving... Hungry..going to burger king
Had a pasta dish and my boyfriend had the chicken diablo.  The food is good but there isn;t a lot of it! AND its expensive!!"}
{"text":"The night that my sister and I tried this place out, they were having a private function on the 2nd floor.  That meant that there weren't as many tables available, so the wait time was a lot longer than you'd expect for a Thursday evening.  I completely understand this, what irked me, however, was that they didn't initially tell us about the private function and kept saying that it would just be another 15 minutes wait time - when, in fact, we waited well over 1/2 an hour. 

When we were finally seated, it took another 5-10 minutes before our waiter even came over to greet us and offer us water (and to explain why it was so crazy busy - though we had deduced that there was a party going on above us by the blaring music).  We quickly placed our food order while we had his attention because by this point we were ravenous.  They provide you with these dry pre-packaged tiny breadsticks...ya...no thanks... How about some fresh bread and olive oil for dipping? That'd be way more appealing.

Against my better judgement, I ended up ordering a glass of wine even though it's ridiculously over priced here. 8-12 dollars for a 5 oz pour! Outrageous! They really need to lower their wine prices, I felt completely ripped off.

The redeeming component of this restaurant is that the food is actually quite good.  Much like the wine, I found a lot of it to be overpriced, but there are ways around that. We split the spicy crab cake appetizer to start and it was delicious (it is quite spicy though, so be wary of that). We then split the margherita pizza, which is definitely enough for two people (well, two girls anyway). The pizza was my favourite of the two dishes we had, it was simple but had very bright flavours and the mozzarella cheese they use is perfection!"}
{"text":"Nice place inside the mall. Outdoor seating when it's nice enough out. Great food, I had the duck pappardelle at the recommendation of Vanessa... she was right. It's fantastic! Also staff is well trained on their wines, and could explain the various bottles about which I inquired. A solid place, nice atmosphere, and very friendly. I'll visit again. Next time I'm in the neighborhood."}
{"text":"I had the margherita and the pachetta pizze. Both had a good flavour. Pretty decent restaurant. Doubt I would come back though. Service was good, food was average. Maybe should have ordered something else."}
{"text":"Does the trick. Quality Pizza and Pastas, efficient service. Pretty exposed brick decor, on a nice historic lane. Certainly raising the standards of Mall Food."}
{"text":"The service was okay. The pizza was dry, so I tried another one with more oil but it too was dry. The worst of it was that both of us got bad stomachs from eating here; I could feel it as I was on my last slice."}
{"text":"Chapter 1: The PaliSADe
All those hours spent waiting to repair my i-____ and never repairing my I and I. The torment. The colours. The insidious off-gassing. On a hot day, Apple had tied me to this crystal palace of polyester ether and I was roaming like a sick cat finding a culvert to die in, which is to say, I hadn't eaten or checked my emails All Day.

Chapter 2: Pleasure in a Dark Corner
I always avoided Mercatto's corner of the mall because the vertical neighbour (Greenjeans?)'s vines and lights looked like a bayou molester. But I noticed this spot below - a surprisingly nice Italian restaurant that looks onto a courtyard! 
\"Que l'inferno!\", I thought. Meaning, what the heck, in Italian. 

Chapter 3: Apologeum

I have been \"tolerant\" of new agers telling me that spiritual repair does not come in the form of fried calamari and a glass of Canonnau, but let's not kid ourselves. The space was dark, lively but still breezy from the outside access. The wine was the thing - a nice cannannou for $12 tasted like cherries dipped in chocolate and mud. The calamari was crunchy and hot and bad for me. A glass of pinot grigio finished it off, crisp and clean. I sat and munched and sipped. I thought about nothing and it was good. Maybe I drew a bird.

The waitress was spot on with service and very kind, especially since I was on a date with a computer.

Conclusion: Don't Get Anal at the Mall, Get Bacchanal and Have It All!"}
{"text":"Excellent dinner!  Pizzas were great, pasta bolognese was delicious. My son had lamb chops, sooo good with Farrah side delish!  They made my little one a bowl of spaghetti, he was very happy. Our waiter, wish I could remember his name, was fantastic!!!  Sorry we didn't stay for dessert but we bought last minute tix to the blue jays game and had to run. Can't wait to come back to Toronto, will eat here again!"}
{"text":"Nothing's better than wine and dessert on a cold snowy day! I'm glad I picked the right spot to enjoy both. The waiter was very polite and friendly and made an effort to make my first visit a memorable one. I also tried an appetizer called \"fruiti di mare\" if I spelled that right, which is a cucumber/onion salad with an assortment of calamari and squid with olive oil and lemon juice. I had never tried this anywhere else and I'm glad I tried it out. It was very tasty. The wine menu is big. The atmosphere upstairs is lively, but not too loud. I'd definitely come here again"}
{"text":"Went here for lunch with coworkers. Ordered two appetizers and a pint. The zicchini and crab fritter was delish and very enjoyable. The artichoke dish however was kinda a miss. The artichoke was way too strong and pugent in flavour. It also came highly recommended by the waitress.  Had a hard time finishing it. Portion was really big. Other dining companiobs had pasta and pizza dishes they all seemed to enjoy. Coworker had a zuhinni pizza which she enjoyed. Overall one of the better options for dining in the eaton centre. Also order the free bread!! Tasty and hot!"}
{"text":"My friends and I were around Eaton centre and decided to come here to try their dessert. Our waitress said the desserts are all made in the restaurant so we were excited to try it. I ordered the Tiramisu ($7.95) while my friends got Torta cheesecake ($7.95). They were both delicious and I recommend them. 

The atmosphere was great for hanging out and the service was good."}
{"text":"Went here with a big group and had great service.  The food however was mediocre.  Calamari was amazing as an appetizer but the pizza i ordered was full of grease and very salty.  It is an expensive restaurant for sub-par Italian food."}
{"text":"Late Night Menu at Trattoria Mercatto doesn't have a lot of choices... but I am ready to eat as I just walked off my dinner at Maroli up at Korean Town.

I have to say the wait staffs here are all a little off... wackily off... just have this strange vibe of being nice but with an attitude.

We ended up ordering 

Selection of local and imported artisanal meats and cheeses($16.00)
and some drinks..... with my Yelp Friend....

The meat and cheese selections were quite nice (details which I don't remember), goat cheese, mozzarella cheese and cured meat.

I hope I am not getting use to the idea of snacking on delicacy and sipping drinks every night as a midnight snack...."}
{"text":"The seafood pasta was delicious and the service was excellent.  If I had one complaint it would be the portion size was a bit small compared to other restaurants."}
{"text":"Pricey food..not worth the money.  Like the ambience. They did well with our party of 30 people. Their service was a Lil slow to be honest and it wasn't even rush hour. Their pasta dishes are good however the pizza is not worth the $ you pay for it. Overall a place to visit once or twice."}
{"text":"With this, my 300th review, I was hoping for something a little more exciting than a chain Italian restaurant, but that's just the way the cookie crumbles.

I was looking for somewhere near the Eaton Centre for a gathering of four people, and Trattoria Mercatto seemed to fit the bill. I was easily able to make a reservation, and it's a good thing I did because the place was surprisingly packed at 1:00 on a Saturday.

We decided to begin our meal with a couple of starters:

FRITTELLE DI CAVOLFIORE (\"sicilian fried cauliflower, truffle crema, pecorino\"): This is a really unusual dish that's unlike most similarly fried appetizers. For one thing, the chunks of cauliflower have been deep-fried in a very thin, almost tempura-like batter which allows the taste of the vegetable to shine through. The accompanying dipping sauce is pretty much perfect. This was a big hit.

Arancini (\"chive risotto, provolone, spicy tomato sauce\"): I mean, you can't really go wrong with Arancini and this was a particularly tasty version of the venerable dish. The risotto balls arrived to the table piping hot and they were full of delicious, melty cheese. The tomato sauce was quite flavorful as well.

For my main, I decided to go with:

RIGATONI ALLA BOLOGNESE (\"veal and pork ragu, basil, grana padano, tomato\"): This is a decent yet somewhat forgettable variation on bolognese. It tastes fine and the pasta was cooked well, but the dish was lacking in bold flavors. The big chunks of meat were appreciated, however.

We decided to finish with: 
 
TIRAMISU (\"Italian cookies, espresso, mascarpone, coffee liqueur\"): Like the main, this was a decent yet unmemorable version of this dish. It was prepared well, though it did seem as though the Italian cookies hadn't quite had enough time to soften. (Maybe it had been prepared that morning?)

I should also note that the service wasn't great. It took an extremely long time for us to place our dessert orders and the bill was non-existent for far too long. An unfortunate ending to a decent meal, to be sure."}
{"text":"Came here for dessert and coffee.  The place is really to take some cool IG pics.  Their chocolate banana bread pudding tasted like regular chocolate pudding.

The latte was a little too milky for me But my cousin enjoyed their tiramisu.

Prices we're ok but I have to try the regular food the next time I visit."}
{"text":"Sitting outside is a nice break from the bustle of downtown.  Situation across from Trinity Church this is a bit of an oasis.  But I have to say is sort of goes a little downhill from there.  The server was amazingly nice and quick once he came over but took ages to get to us.  The carbonara was a win, the pizza just couldn't keep it together.  Great when you actually got it in your mouth but the crust couldn't handle the sauce.  All in all... fine and what you'd expect for a chain.  Would be a super choice for a busy tourist needing to rest their feet."}
{"text":"Great service and great food.

I always order the Diavola which is always delicious and chewy.
My friend and I have always tried the short rib crustini and a pasta dish (both of which no longer available on the new 2013 menu). Both were good but I definitely prefer the pizzas here. However, with that said, I still prefer Libretto's pizza but this is a great alternative as it's more centrally located."}
{"text":"The tiramisu here is my favourite tiramisu in the city. I've come here just to have a coffee and tiramisu. The seafood linguine is hit and miss. On their off days it's average at best. On their good days, it's very good.

My favourite item on the menu used to be the blood orange juice - not the blood orange sparkling water - the juice. Unfortunately, they no longer carry it :-("}
{"text":"Swanky atmosphere and great service. The pasta dishes were too salty and over seasoned though. 

//THE ATMOSPHERE//
I've always seen this 2-floored restaurant located in the Eaton's centre from the outside, but never had the opportunity to try it out until now. Walking in, there's a long bar, wooden barrels wall decor, stairs leading to a spacious 2nd floor area, and they have really nice washrooms haha! The crowd is mostly people dressed in business attire coming from work I suppose.

//THE FOOD//
Arancini (5/5) - a breaded fried ball filled with risotto and lots of cheese. There was a perfect amount of tomato sauce topped on it too.
Seasonal soup (2/5) - the night that I went, it was a Caramelized onion soup with a piece of bread soaked in it. It's lighter than a French onion soup but nothing special.
Pappardelle Pasta (3/5) - Too salty, peppery, and I didn't like the overpowering taste of celery. I enjoyed the texture of the duck though (similar to pulled pork) and I could tell the pasta itself was hand made and fresh!"}
{"text":"3.5 Dishes I had were the carbonara, octopus and the funghi pizza. 
Carbonara was really good. Definitely would come back for this! I'm tired of places making carbonarra with just a white cream sauce. This place has the nice raw yolk that you mix in, great noodles and flavor. Maybe just too much salt from the bacon but otherwise great dish. 

The octopus was made really well and its pairing with the citrus pearl couscous with it just added the next layer of flavor to it. 

The pizza was good, I would not order it again - nice thin crust pizza and good flavor, but I am not a fan of pizzas that only put the toppings in the middle and do not try to fill up toward the edges. You're left with just plain ol crusts, we got a pepper oil topping condiment to make it go down a bit better."}
{"text":"Situated in the north-west corner of the Eaton Centre, it's a prime spot for tourists and locals alike. Service is attentive and friendly, although we did have two servers argue over who should be seeing to our table.

Food is priced accordingly for the location, and although portions aren't particularly large, they are adequate, and we left satisfied rather than full.

Pizzas are thin and light, enough for one, but not really to share unless you have other dishes too. The pasta is fresh and cooked well, but again not a huge amount in the bowl."}
{"text":"Things started off well. I met friends for a Sunday lunch at the mall. 

Overall the food and service was OK. Your typical lower end pizza pasta joint. Prices were moderate but you got what you pains for."}
{"text":"The Fungi Risotto here was absolutely terrible! It was super watery and bland. I also ordered the short ribbed appetizer and it was Not worth both the quantity and the quality. The service there by Ryan A on the patio was great however, but we will not recommend our friends to this place for food ever. I ended up paying $42 for these two dishes... I'm still pretty upset about that. Highly unrecommended!"}
{"text":"Excellent service, speed of food was amazingly fast. They got the order wrong initially but was able to correct within 5 mins. Had the funghi pizza, really thin crisp crust. Love it, 100% will come back again."}
{"text":"The Calamari was hot and fresh but a little tough - one minute less in the oil would have been perfect. Pizza with pancetta, goat cheese, caramelized onions and grape tomatoes was luscious. Service was a little uneven during the lunch rush, but I would go there again."}
{"text":"Came here on Saturday for Dinner after a day of shopping and craving some pizza.
Our waitress was very friendly and took our drink orders and gave us time to review the menu,
Sooo many good options I couldn't settle on one appetizer. I always like to try the rice balls and meat balls at as many italian restos as possible so I had to order both and for main we decided to split a Margarita pizza. The waitress asked if we wanted apps first or everything at the same time. We decided to get everything at the same time and she then
brought us prepackaged thin breadsticks to nibble on as we waited for our meal. I didn't particularly care for these as I would have preferred real bread.

The Arancini or Deep fried risotto balls were delicious, very crispy on the outside and nice and cheesey inside with peas.
The meatballs were hugeee, the biggest I've encountered so far! Topped with cheese and tomato sauce also very good, not dry at all, cooked perfectly & super moist.
The Margarita pizza was great very flavourful. The crust was thin but soft not overly crispy.

Our waitress then offered to bring us the dessert menu but we were sooo stuffed we couldn't handle another morsel.

Overall really good dining option for the Eaton Centre and great service. I would definately return and save room to try the dessert menu."}
