{"text":"We've been there 3 times.  The last time we were there it was packed and ended up waiting 45 minutes even with my reservation.  Everyone seemed a little over their head with the number of people.  The food is good, don't have a problem with that.  What I do have a problem with, is when I'm told by the waiter that the chef accepts NO substitutes.  Kind of \"Soup nazi\" like.  \"I would like risotto instead of potatoes---NO! How about green beans instead of asparagus---NO!\"  The waiter was apologetic, but give me a break, any other decent restaurant would be happy to make substitutions like that.  Kind of an attitude thing that the chef needs to work on."}
{"text":"Awesome, as always!  Had family in from NYC and everyone had a great time.  Great service and outstanding food!"}
{"text":"My wife and I had a rare date night, and we wanted to got some place local but good.  Thanks to Yelp, I found Trattoria Antica.  I made reservations thru the link that Yelp has, and I am very glad I did.  They only had 2 times available-5:45 and 8:30.   I grabbed the 5:45  The restaurant was busy at 5:45, but they had our reservation, and we were seated promptly.   The service was fantastic!  They held out the chair for my wife, and made sure that we were all settled, and got our drinks ordered.   No beer on tap, or liquor, but a great selection of wine, and a couple of good beers.  The menu had a good amount of things to try.   My wife got the eggplant parmesan and a house salad, and I got the pasta with Vodka sauce.  We also got an order of the garlic bread, which came quickly and was very good.  Not an over powering flavor of garlic, just enough to give you the taste.  Dishes and glasses were removed very quickly, making sure that we had room to eat.  My wife was a bit disappointed that a salad did not come with her order.  I really enjoyed my disk.  The pasta was cooked perfectly, and the vodka sauce had nice bits of home made sausage.  It was very tasty.  My wife enjoyed her dish, but had a comment that it should have a little more sauce.  Other than that, it was the perfect size, and the eggplant was prepared properly, according to her (she is an eggplant parmesan fiend!)  We got a piece of tiramisu with two forks.  It was delicious.  It was a bit more pricey than expected, but in my opinion, worth it.  This will be a place to take family when they visit.  When we left, there was a wait.  So I suggest getting a reservation."}
{"text":"Excellent service and scrumptious food...what more can one ask for?"}
{"text":"Pleasantly suprised by the claiber of the food here - a nice addition to the Waxhaw restaurant selection, and a far cry better than the shockingly bad Mama Lena's. We went in at about 7:30 on a Friday, and although it was very busy were pleased to be seated right away at the one avaialable table. The waiter was a bit over the top, and fawningly effusive, but not to the point that it ruined the evening - I got a little laugh out of some of his ingratiating comments - but it came dangerously close. The food was very good, pasta cooked perfectly, and everything seasoned well. I do agree with others about the marinara dipping sauce for the calamari not being anything special. Overall a very nice meal, although the prices are a tad steep for the location/ambiance, and I'd recommend it as one of the best dining options in Waxhaw, and a step up when you want something a little nicer than pub food."}
{"text":"Cute clean place. The service was excellent. The food is very very average. I would only eat there again if the prices were equal to their food."}
{"text":"Been here many times and very consistent experience. Food is good (not great) and always know what you are going to get. Service is very good. In terms of places to go in Waxhaw area, this is top of the list."}
{"text":"My wife and I enjoyed Valentines dinner last night. When we were seated near the front door, we asked to be moved because it was very cold outside. We were accommodated with a table that was close to the back of the restaurant. My wife ordered the fish which was halibut. She was still talking the next day about how good it was. I ordered the risotto with lobster and scallops. It was cooked perfectly. We were too full for desert, maybe next time."}
{"text":"This was our third time eating here and while the first time was good the last two occasions have been awful. We ate at the restaurant near Christmas and the service was  terrible.  We decided to give it another chance tonight and unfortunately this visit was the same as the second one. Our server who called himself Favio was a bit a arrogant to start the evening. We had reservations and were seated at 7:30 pm. He introduced himself as our sever and made a comment that everything is made to order and it is prepared in 20-25 mins. He then said keep in mind that the customer is rarely right and it you change your order it will cause a problem so make sure you know what you want. We were not quite sure if he was kidding but his lack of personality led us to believe he meant it.   We had a party of six and ordered a bottle of wine before ordering our meals.  He took our order at  8:00 pm and we did not see our meal until 9:25 pm. The restaurant was only a third full at that time and we were getting agitated that our food had not come out nearly an hour and half after placing our order. Favio could see that we getting irritated that we had not gotten our meals yet he never once came over to explain the delay. When the meals arrived he served us yet again never apologized for the long wait or offered to see if he could accommodate us. When we finished and the check came a20% tip was included in the bill though no one mentioned that when we made our reservation nor did Favio.  We confronted Favio about the unfair tip and poor service and he blamed the Chef for the delay. He said he could do nothing about the 20% gratuity because the cash register automatically added it in. He said he couldn't remove the tip while we said we were not pleased with the service and he didn't deserve 20%. He became belligerent and argumentative continuing to blame the issue on the cooks and he said he deserved the tip. His language got vulgar and offensive as he described his disdain for  the cooks. We again let him know that we were not pleased on giving him a $60 tip because they automatically included it in our bill. We asked to speak  with a manger and he said there was no manger working at the restaurant. Of course we didn't  believe that and realized he was not going amend out bill for the 20%. He acted like he was just a server but we believe he was the manager. This encounter convinced us to never return and everyone should ask upfront if they hit you with a gratuity regardless of the size of your  party.  Their poor customer service and sneaky gratuity policy should make you think twice before eating here.  Oh by the way the food was also just average this time. We will be notifying the BBB if Union county  about their practice of arbitrarily including s 20% tip automatically without any warning. Not sure why  they get to decide that we will have to pay 20% for service. When we might prefer 15 or  18% or in this case none at all.   Very shady."}
{"text":"We love Trattoria Antica , is close to home ( we live in Waxhaw ) food is always superb and the service is top notch . Need to make reservations on weekends , they are always full !"}
{"text":"This is probably the second review i have ever written.  I believe in the ideal that if you love a place, you continue to eat there and support the local business with your wallet.  Comments are nice but I believe the owners prefer your wallet share.   On occasions such as this, where I am disgusted beyond belief, I am compelled to leave a comment. The \"Italian\" food here is awful. I am not a person who claims to know anything over the average person about what real Italian food is, but I was raised by parents born in Italy that came here in their 20's.  I am a first generation Italian who also lived in Italy for three years in my 20's. No, I am not a food expert, but I know real, homemade Italian food (the sauce where your mother and grandmothers pick the tomatoes every September themselves to jar).  This place is so bad, they couldn't even cook the pasta 'al dente'.  The sauce must be canned because if its made fresh there, they must be using potatoes and calling them tomatoes.  On top of it, they made an Eggplant Parmigiana with ricotta (not mozzarella, mind you) and didn't even cook the eggplant!  I respect the 1 star rating because their Carpaccio app was decent. Other than that, this place should be called Trattoria Sporca. If you know what that means, spare yourself the money and eat somewhere else or cook the Italian food yourself....I bet anything it will be 100% better."}
{"text":"Went there last week because we just moved closer to the area and we had a gift card.   Food was awesome.  We all got something different and  tasted each others dishes.  The short ribs were perfectly cooked.  I highly recommend getting dessert.  The ricotta cheesecake was excellent.  If you have ever experienced Mikes Pastry in the north end of Boston, you will appreciate the ricotta cheesecake.  I would go back just for that.  We will definitely return.  The manager was super nice and thanked us all for coming in and the atmosphere was casual and classy.  Our kind of restaurant, and local, no going uptown for good food."}
{"text":"The wait staff is very professional and efficient.  The decor is attractive although there is something about the accustics...there were only a few parties and it was very loud and it wasn't like any of the customers were speaking excessively loud.  There seems to be a lot of waiting.  Even though we did not have to wait for a table it took approximately 1 1/2 hours from the time we were seated until we got our check.  The food was just okay. The sauces on the food were thin and watery in consistency. There are other italian restaurants in waxhaw that have much better flavor and more reasonably priced.  Apparently you are paying for the atmosphere at Trattoria, not really the food as it is just marginal."}
{"text":"Had a great date night with my wife.  The food was great and the service exceeded my expectations. The entire staff was friendly and helpful from the time we opened the door until we left.  My wife asked to substitute a side with her meal and the staff accommodated her request with no complaint.  Great food great atmosphere we will be back soon!"}
{"text":"Exceptional service, Antonio made us feel like family. The food is truly outstanding. The calimari was so good, I could make a meal of it, but then would have missed the vitello marsala, my husband had the vitello romano, we shared bites and agreed it was wonderful. I highly recommend this restaurant. We are visiting fom California and thank our family for introducing us to the Trattoria."}
{"text":"We enjoyed \"Antica\" again this week and tried some new things from the menu... as usual the pasta and sauces are as we recall southern Italy.  simple and excellent.  We also tried the Antispasto appetizer.  It was absolutely fantastic.  a well kept secret I think.  Yes, saw another being delivered and had to  have it. Thursday also happened to be 1/2 price bottle of wine nite.  That was a bonus of course we ordered a more expensive wine had it not been on promo.  Server John make excellent suggestions on the wine style and taste."}
{"text":"A great place to go for a casual Italian experience.  Reservations will enhance your experience."}
{"text":"Nothing but delicious food, great service always pleasant. The bartender will make you very happy with his delicious and very creative drinks."}
{"text":"The food is fabulous. The service is not what you would expect. We were there on time for our reservation and had to wait 1 hour and 15 minutes for our food. Our appetizers came out quickly, but the dinner was another hour wait. We have friends who returned a few weeks later and had the exact same experience. When you have such a wonderful menu and great food, what in the world is gong on with your service staff??"}
{"text":"Waxhaw is pretty hit or miss when it comes to dining. Thankfully, Trattoria Antica has quickly become a big hit in a town in dire need of a dining big hit. Tucked away in a strip mall, Trattoria Antica delivers superior and authentic Italian cuisine. The portions are homemade and plentiful; I've hardly had any plates that that seemed like they were cutting back on portions!  I've eating here four times now, and neither time I've left disappointed or hungry for more. It's a pleasure eating at a restaurant like Trattoria Antica where they take traditional dishes from the old country seriously, without the overindulgences a lot of chefs make these days. Simple, rustic, just like your mama would make. Your mama would approve.  If you're willing to make the drive down to Waxhaw, down Providence Road South, you won't be disappointed. Take my word for it."}
{"text":"My wife and I had a wonderful dining experience at Trattoria Antica.  Everything was top-notch from the owner/host greeting and seating us; to the attentive wait staff; to the very good pasta entrees and calamari appetizer.  They still haven't moved Mulberry St. from Manhattan to Waxhaw, but they're getting closer.  This is a very good Italian restaurant with enough diversity on the  menu to please all discerning palates."}
{"text":"Average quality food with an expensive bill. It took 45 min before our foods are served. I would prefer to go to Bravo next time."}
{"text":"This is a great place! I read the reviews before coming here and they were absolutely correct. We have the bruschetta for appetite and it was delicious."}
{"text":"Been here maybe 10 times.  It's always been good.  Service depends on the waiter.  The Rigatoni is freaking awesome."}
{"text":"As a restaurant owner myself I am very particular about what I experience at other establishments. I have to say that our time at Antika was very pleasurable. Nice atmosphere,great food and very good service. If there was a 4.5 that's what I would rate it but I'll go 5 because 4 wouldn't be fair."}
{"text":"I recently visited Trattoria as I had heard good things about it. My experience was at most OK simply because it is not my type of place. There were multiple things that bothered me about the restaurant. After sitting down I was optimistic, but this outlook soon ended once the server gave me a root beer when I asked for Dr. Pepper. I know this may sound harsh but it shocked me that he didn't give the right drink. I asked once again for it and they told me they had coke (Does that mean he doesn't know what dr. pepper is or they just didn't have it?). I decided to be ok with coke, which came from a can rather than from a tap system. I am used to unlimited refills as I love to drink ample amounts of soda with my meals. To my dismay the restaurant begins charging for refills after the second soda. I ordered the cheese ravioli. The menu claimed that the raviolis were handmade, however I believe differently. They were sort of tough to be pasta and the cheesy sauce was hardly flavorful. Overall I simply was not impressed with the experience of my dinner. I am not sure if this place is somewhere in which I would like to return. But who knows, I may decide to give it a second try again one day."}
{"text":"Wonderful restaurant but the lighting could be better.  Overhead lighting is too bright."}
{"text":"This was my first visit to this restaurant, but not my last. Everything from the bread, salad, wine and entree were outstanding. I had the Penne a la Vodka and it rivals some I had in Rome this summer. The bread was crusty and delicious. They also have a good selection of reasonably priced wines. The staff was attentive and friendly. I am looking forward to a return visit and hopefully next time I will leave room for dessert!"}
{"text":"Good food not so good service. My wife and I dined here last night with 2 other couples. We had a 6:45 reservation and were seated promptly. Then the wait started. After about  ten minutes the waiter greeted us and said he would be right with us. Ten minutes later he showed up. So after being seated for twenty minutes we ordered a glass of wine which then took another ten minutes. We finally ordered at about 7:15. The meal arrived just after 8:00. So much for the service.  The food was another story. I had the veal park which was wonderful. The veal was fresh and the side of pasta was nicely done. Oh yeah, I started with a Caesar Salad which was good but very small for the $3.95  price. Wife had the cannelloni which she said was great. Both dishes were nice size portions. We left completely full and had no room for desert.  All in all not a bad place. I would have preferred to give it a 3.5 star rating because of the service. We will return but certainly not on a weekend night. If you decide to go be sure to get a reservation and if it is the weekend you may want to prepare for a two plus hour night."}
{"text":"Tim and I decided to finally give this place a try and since Restaurant Week is going on, we decided to make a reservation just in case they were busy. As it turns out, we went on Thursday at 7:15 and there were plenty of open tables.  The place looks nicer inside than you would expect from a restaurant in a strip shopping center. It was also a little larger than it looks from the outside. However,  I had high expectations about the food since it is owned by the Conte Restaurant Group (Toscana, Luce, Mezzanotte,  and Malabar) & they did not disappoint.   Even though they were participating in restaurant week,  you could order off the regular menu if you preferred. I decided to go with the  3 course menu for $30 and Tim ordered off the regular menu.   I started with the Fritto Misto which included calamari, shrimp, and zucchini.  It was served with lemon ailoi, which I did not eat because I do not like mayo... Tim however tried it and said it was very good. (My preference would have been a marinara sauce.) The calamari was prepared well & not overcooked and the shrimp was very good as well.  Tim started with a Ceasar Salad. I tasted it and it was very good...dressing was made with real anchovies, housemade rustic croutons,  and nice large shaves of parmesan.   For my entrée,  it was a tough choice but I decided on the Mare which included scallops, calamari, mussels,  shrimp, clams, & peppers over linguine and choice of red or white sauce. I chose red and was very happy with my selection.  They did not skimp on the seafood!    Tim decided to go with a more basic tried & true favorite - Chicken Parmesan. Wow...that was one HUGE Pollo parm! I didn't taste it but it looked fabulous and Tim definitely had enough left for another meal!  We decided to just split a piece of cheesecake for dessert and it was good.  Since it was Thursday night, they had a selection of wines available at half price....so we were able to get  a nice bottle of Italian red for just $24.  Overall, our service was good... not quite 5 stars but it was solid and we didn't have any complaints.   The only \"issue\" was that they had the A/C and ceiling fans cranked up so it was a drafty & a bit chilly in there. I was ok but I did hear several people around us  mention it to the manager.  (I am sure if the restaurant is full of people when it is hot & humid, that temp is fine but since the place was half empty & it wasn't that hot outside, the air was a little much. If you are cold natured, it might not huurt to have a sweater or jacket in the car just in case.)  All in all, we were very pleased with our meals & overall experience and I am sure we will be going back."}
{"text":"we have eaten here several times. Each meal was fantastic, the service great and the atmosphere perfect !!   We will definitely returning to enjoy this restaurant often."}
{"text":"This was our first visit to Trattoria Antica since it's opening a couple of years ago. The fact we waited for a return visit suggest our first impressions. After reading countless 4-5 star reviews we decided to try TA again. Our server was pleasant, an interesting Italian accent and prompt delivery of wine and fresh crusty bread. We each ordered a  Parmesan entree, one chicken and one veal. We also shared a Caesar salad.    The shared salad was fresh romaine, a small amount of bland dressing and a very very dry anchovy. Quite disappointing! The chicken P was a generous portion covered with bland sauce and under melted mozzarella cheese. The breading was rather soggy. The veal was a smaller porting albeit adequate with similar bland sauce and under melted cheese.  We asked for some additional bread, as the oil and white bean app was very tasty. Unfortunately this serving of bread was from yesterday and was crusty in a bad way.   We also asked for additional sauce because the perfectly cooked pasta was barely dress. More sauce was a mistake as we hadn't tasted it as yet. You got it bland.   For an Italian restaurant to call this red liquid a marinara sauce must be an acquired taste.....similar to that served in the high school cafeteria.    Waxhaw's restaurant scene needs all the quality restaurants we can get but other than their convenient location TA won't see us back anytime soon especially at their inflated prices."}
{"text":"My husband and I have been here a few times now and just love the place!   Nearly everything we have tried has been delicious and the charming European-trained waiter was very welcoming and attentive. He was always making sure we were happy with our food and asking if we would like another drink. Water glasses were repeatedly refilled before they were completely empty.  The calamari was fresh, not frozen, and melted in my mouth. The Cozze Napoletana (mussels) was delicious, perfectly cooked with just the right amount of garlic. Fresh warm bread was served with a white bean and olive oil salad. The bread was delicious but I wasn't a fan of the white bean salad. I would much prefer plain old butter.  The short ribs and sausage with Sunday Gravy is amazing! The short ribs are tender and tasty but the runaway favorite is the hot italian sausage. It was fabulous, blended perfectly with the exquisite Sunday Gravy. My husband kept reaching over and dipping his bread into my gravy. I finally asked if we could have a small side of gravy for his pasta. My only minor complaint is that the pasta served with the dish is just okay, like something you would get from a box. The dish would just SING if they served it with fresh pasta.  The Seafood Fra Diavola was very good, but next to the Sunday Gravy the \"spicy plum tomato sauce\" was just ordinary. The shrimp, clams and mussels were cooked perfectly, as was the linguine, but again the pasta wasn't anything special. Fresh pasta would have been a great compliment to this dish.  The salmon filet served in lemon pepper and EVOO was divine. So light and flaky and seasoned perfectly.  The only truly disappointing dish we have had here was a special, the seafood risotto with parmesan. The risotto was cooked perfectly, but had no flavor at all. I added a ton of pepper to it, which helped, but it really should have been seasoned better while cooking. The scallops were cooked perfectly and very tasty but there were only 4 scallops on the risotto. For the price, I would expect more.  Each time we have been here we were way too full to order dessert, but the next table over was raving about the Tortino Di Cioccolato (chocolate mousse cake, ganache, hazelnuts, crema) so much that I will make a point to have a lighter dinner the next time we are here so I can save room for dessert!  I would give Trattoria Antica 5 stars but for a couple of minor things. I would love to see fresh pasta with all the dishes and not just the few that they offer specifically on the fresh pasta section of the menu. Next time I will ask if I can substitute the fresh tagliatelle for the boring penne included with the short ribs. And I realize that good food takes time, but it seemed like, even on a slow night when there were only a couple of tables filled, it took an extraordinary long time for the food to come out.  Overall we are very happy with Trattoria Antica and will be back again soon."}
{"text":"The meal was definitely not worth $75. The service was okay but not great. We started with the bruschetta appetizer which was very good and a good price! The bread that came out was very good and clearly made fresh. It was served with a bean salad so we asked for olive oil and balsamic which they brought out.  For the meal we had veal marsala which was tough and the sauce was greasy. The noodles are very undercooked. The flounder special was not impressive.  It didn't taste fresh, the side of spinach had no flavor. We arrived around 6 and got our food close to 7...the restaurant was almost empty when we arrived but full by the time we left. Not worth the cost."}
{"text":"Another great dinner with neighbors. Am beginning to feel like a pimp for them, but can't think of a better place with which to be associated.  Superior service, excellent food and portions and a bar that excels.  Owner greets all guests and don't get in the way as HE wants to seat the ladies in your party.  Give him the thrill.  He is a charmer and puts everyone at ease.  We have about four dinners under our belts and will add to them on an on-going basis.  It is truly a great restaurant and experience."}
{"text":"Not what it used to be. Started with the Trattoria salad which was excellent. Wife had the eggplant which used to be in a different sauce. Now in a tomato sauce which is just okay. I had the Chicken Tuscan which was just fair. Also had the cheesecake which my wife loves and creme brulee which is still good. Good waiter but not as friendly after turning down his $60 wine suggestion.  One other tip. Don't sit at the tables facing the kitchen. The florescent lights will blind you."}
{"text":"Just had an exceptional dining experience! Service and food outstanding. Calamari appetizer with spicy pepper sauce fabulous. Beefsteak exceptional. Risotto made with squash,cheese and tiger shrimp delicious. And some sort of decadent chocolate mousse. And a great gin Cosmo and a great wine ...  One of the truly best meals I have experienced in a very long time"}
{"text":"Went there on a sunday around 5 pm.   Place was empty.  SO...service was great and the food came out fast and hot.    Love their bread with the bean spread/oil.   Had Veal Parm and it was really good.  Got their homemade cheescake to go and it was awesome.   Will go back for sure.  One of the better places in Waxhaw and worth a drive if you live in CLT.   Only con was that I thought it was a bit pricey.....especially for the area."}
{"text":"Food is always good, atmosphere is spot on. Started with the delicious bruschetta and calamari, our family favorites. Would have given five stars, but the fish special was flounder. Why flounder as a special, which is not special. Still one of my favorite restaurants with fantastic food!"}
{"text":"Had date night last night with my wife.  This was the first time either of us had been here.  Service was amazing.  Food was fantastic.  My wife had the Chicken Parm and I have the Faralle.  Both were out of this world.  Definitely will be going back."}
{"text":"Hard to review!  Partly because I'm usually NOT a fan of most of what I would call the different \"Regional Italian Cuisines\" (I'm guessing)... This is not my first, nor second choice of \"style\" I'm looking for in an \"Italian\" Meal... We saw reviews on yelp, were in the mood for Italian and checked it out!   The Service was Exceptional!  We had four people help with our table, not counting the Manager... ALL were very pleasant, made us feel at Home!  Bread was very good, probably made there, probably right out of the oven... Very Smart to have GREAT Bread!  Off to a very good start!  The Fried Calamari had Very Good Flavor! 4.5 stars!  In my life I have only eaten a few that I thought were better!  The batter was thin and light, just the way I like it!  Thankfully the flavor was very good on it's own because the \"Marinara reminded me of something from a jar and I was hoping we would not see that sauce with our Pasta dish...  Linguine with Marinara was the \"test dish\"... If a plain Sauce is good...then... The Linguine  was the usual width and thicker than many... It had a good flavor (as in three stars) and it was firm (not mushy) and well drained (not watery) Oh No this Marinara was the same as the one served with the Calamari!  The Pasta gets 3.5 stars and the Marinara gets 2 stars.  Swordfish is probably my Favorite \"fish\" so when I noticed \"Swordfish\" as a Featured Special, on the \"Specials Menu\" I got very excited and since my Girlfriend had never tasted Swordfish and she is more of a \"Fish fan\" than I... When the entree came out it looked Fantastic... I gave her the first bite and she replied : \"NOT Bad\"... ... ... Hummm?  Just to confirm I asked her what she meant and then I tasted what she meant...  OK, when describing something, my aim is to tell the listener what it is, instead of what it is NOT!  My Girlfriend knew how excited I was that she was getting to taste Swordfish for the first time... It has been a little while since I have eaten Swordfish (months, not years) This one had a more common taste... The flavor was good for fish, no better than good!  Good as in about 3 yelp stars... Of all the Swordfish I have eaten this one (maybe the Kitchen made a mistake) was my least favorite!  Maybe the Market made a Mistake or perhaps I made a mistake? 3 stars at best!   The Grilled Vegetables with the fish were Very Good!  Eggplant, Onions and and Yum!  Grilled here means Grilled (not sauteed) Dry and slightly crispy.  The Mashed Potatoes (or whatever they were) had a good flavor, though they were Cold! 4 stars for flavor...  Aioli Sauce... This was Very good (I Hate Mayonnaise) so this was something I was going to taste just for the review... I liked it!  Capers and Dill may have made it for me!  4 stars  Desserts : :   Ricotta Cheesecake... I'll give it 3.5 stars because it had good flavor... I LOVE a GREAT Ricotta Cheesecake and have only eaten it in two other places (about 10 pieces in one place over about a three year period - I enjoy Ricotta Cheesecake more than all other Cheesecakes, this one, though it tasted good was mt least favorite of ALL Ricotta Cheesecakes!  The more \"Spongecake\" version is the one I prefer, though I bet I'm in a minority on that one!   Cannolis with Pistachios, Pretty Disappointing!  I prefer a sweeter and richer filling... 3 yelp stars is generous for this one"}
{"text":"This is the best italian food in the area, and I think I've covered all of them. Been there three times and it hasn't disappointed.  Had parties of 2, 4, and 8 and each time was fine. Service is excellent. Manager is great and on top of everything. Food is delicious. I've had the Veal Parm and the gnocchi. Both were fantastic. Prices are reasonable. Can't recommend this place enough."}
{"text":"Tonight we dined at Trattoria Antica for New Years Eve. I will give them two stars, and that's a gift based on the food alone. I recognize that New Years Eve is a busy night for restaurants, but we had a reservation, and we weren't sat until 30 minutes after the time of our reservation. We were offered no apologies, and were told that there was no management on site and that \"they\" (whomever that is) had overbooked reservations.   Once we were sat, and not before, we were offered a minor apology in passing, and our drink orders were taken. We ordered two bottles of wine, which took around 20 minutes to arrive. The gentleman didn't come back for another 15 minutes after out wine arrived, and we ultimately ordered over an hour after our reservation time.   Things were slightly better from here as the food was fairly good, but the service was never redeemed. I actually considered writing the review as I sat there, at the table, ignored and unfed, but I refrained myself out of fairness having not yet eaten the food. The food was good enough to raise my review from one to two stars, but just enough.   Again, it was a busy night, but we had made reservations. Things in the restaurant seemed a bit strained, but the acknowledgement of that strain was ad hoc and disingenuous. The service, in total, was horrible, and it's not as if New Years Eve sneaks up unannounced. We actually had intentions of ordering desert and having coffee, but the complete and total ineptitude of the service prevented it. Two stars was a gift, and based on the chef alone."}
{"text":"Consistently great meal!  Our favorite restaurant in the Waxhaw area.  Highly recommend it!"}
{"text":"Food is always good, not inexpensive, child's plates are quite large.  I did place a to go order recently and went to pick it up... I arrived at the stated time and was told it would be about 5 minutes... I didn't see anyone for about 15 minutes...  when I did, I asked about the status and was told it would be 5 minutes, \"they were sorry the had gotten busy\".  I was pretty frustrated but have learned to give it time for me to cool off & to give them a chance to fix it.  They did in fact bring the order within the 5 minutes and offered to adjust the ticket for the inconvenience.  I think the fact they recognized their mistake and tried to fix it warrants them another chance."}
{"text":"Went to Trattoria Antica for restaurant week.  The restaurant advertised a wine special for restaurant week for $18.  We were told that the special had been removed by our waiter, very disappointing!  It took a while before our order was taken but once it was things moved smoothly.  We were a party of 4 and had the mussels and eggplant appetizers, the stuffed pork chop and the catch of the day (branzino).  All were happy with their meals.  The chocolate mouse cake was light and delicious.."}
{"text":"Amazing from beginning to end. Service, bread, anti pasti, pasta, veal, sauces, wines, desserts have never let me down. Veal saltimbocca is a must if you are lucky enough to find it on the menu that night. Gnocchi is their weakness but OK if you've got a craving."}
{"text":"We tried this restaurant last night with some friends & found it to be absolutely terrific!  The best Italian restaurant in Charlotte without having to drive Uptown.  Don't expect chain food Italian, as this is real authentic Italian cooking.  The atmosphere & the staff were extremely friendly.  We started with bruschetta & calamari, the best we have had....calamari served with fried zucchini strings, just wonderful.  My husband & I both had the seafood pasta dish and it was awesome!  Our friends had rigatoni & veal, both commenting that it was very good.  We followed dinner with tiramisu & expresso's, again....they truly know how to do Italian!    We will definitely eat here again & would recommend it to anyone!"}
{"text":"Consistently fabulous little Italian gem. Highly recommend it!"}
{"text":"The food was very good. We started with the calamari, had Ceasar and house salads and then a variety of pasta dishes. My husband like the spaghetti and meatballs. I had the gnocchi, chicken piccata was ordered along with other pasta dishes! Chocolate mousse cake for dessert. We will definitely return. The service was very good also."}
{"text":"It's a little overpriced for what you get, but it's semi-authentic (for Charlotte anyway), the service is impeccable and it's a great spot for an out-of-the-way evening out."}
{"text":"I am very picky about Italian restaurants and found this to be the best in the area. The food is fresh and the servers are professional."}
{"text":"The atmosphere is okay but not something special and the bar is the focal point of the entire place with no seperation for the dining customers.  The food can be good but very inconsistent.  The staff has a tendency to try to over-do-it with niceness to compensate for all the other small things they do wrong.  This has the potential to be a destination restaraunt in Waxhaw....But it's not there yet and unless they can fix the issues...won't be around much longer."}
{"text":"It pains me to have my first review of the new year be a bad one, but here it goes...  We live in Waxhaw, but hadn't tried Trattoria Antica so we decided to give it a try.  My husband made reservations via Yelp for 7:00 and our party of 4 arrived at 6:55.    We entered the restaurant and we liked the style and décor.  It's very small, but comfortable and stylish.  We were also feeling optimistic about the food since every table was full.  We checked in with the host and was told that there was only 1 party ahead of us and that we shouldn't need to wait more than 10 minutes.  The host was friendly and went out of his way to call us by our surname...that was a nice touch.     We sat in the tiny waiting area and our wait began.  Within minutes a steady flow of people start coming in...some with reservations, some without.  After a few minutes, the host returned with glasses of Prosecco for the party waiting ahead of us.  The delivery was just in time because they were getting antsy and we overheard them saying that they had been waiting since shortly after 6:00.  As luck would have it, the first two tables to open up were for larger parties (6-8) so two walk-ins were seated pretty quickly.  Finally, at 7:25 the party ahead of was seated.  By this time, the waiting area was packed and there were even people waiting outside.  The host came back with glasses of Prosecco for us and assured us that the next table was ours.  We were finally seated at 7:45.  We were given a dinner menu, a wine menu, and the Specials menu.  The server took our drink orders and went on his way....no greeting, no small talk, and no mention of their specials.  I guess he was too busy for the small stuff!  He returned at 7:55 to deliver drinks and take our food order.  Within a few minutes we were given a basket of bread and a dish of marinated white beans....both were very good.  My husband's diet coke was completely flat so he ordered a fresh one.  The second one was just as bad.  The host happened to be walking by when we were discussing it with the server and he told us that they use cans, \"not the gun\" so he asked the server to open another fresh can.  The server came back and told us that the cans were from the Olympics...so...they were expired.  They should reconsider \"the gun\".  I had a Kir Royal that was very good (Prosecco and Chambord).  Salads and the Calamari appetizer came out pretty quickly.  The salads (Caesar and Greca) were good as was the Calamari.  The Calamari was lightly breaded and cooked just right.  It tasted fresh and the yellow peppers were tangy, but not too spicy. The Marinara was nothing special though.    Then we waited....and waited....and waited some more.  The server cleared our appetizer and salad plates, but never mentioned our food.  I had my cell phone out and the host came by and made a funny remark about texting at the table and I told him that I wasn't texting, that I was telling all my friends on Facebook how long it was taking to get our food.  He asked how long we had been waiting and I told him approx. 50 minutes.  He left to check on the food for us and came back to apologize that the order had been placed 49 minutes ago and that it would be up soon.  He said that the delay was due to how busy the restaurant was at the time.  Understandable, yes...acceptable, no.  Our food finally arrived exactly 1 hour after we placed our order.  To make matters worse, our food wasn't even hot!!.  It was warm, at best.  However, we were so hungry at this point that we just ate.    My husband and son both had Chicken Parmesan with Spaghetti & Marinara.  We all tried it and we all agreed that it was just \"ok\".  The chicken was decent, but the Marinara was very bland.  My Mom had the Double Cut Pork Chop with Marsala sauce.  The chop was cooked perfectly and it was very moist and tender, but the Marsala Sauce was thin (broth-like) and seriously lacked in flavor.  I had the Mussels.  They were ok, too.  Again, nothing was hot so that wasn't great for mussels, but they were cooked well.  The broth was interesting as it reminded me of Tomato Soup....unfortunately, I don't like Tomato Soup.  I also had some grit in the last one I ate...and that's why it was the last one that I ate.  My son ordered Tiramisu and my Mom ordered Crème Brulee for dessert.  Both were pretty good.  Then the bill came and the cost vs.value equation began to play out in my mind. As I have said in other reviews, I will gladly drop $150.00 on a great meal, but it pains me to spend even a fraction of that for a bad one.  Well, this 2-star rated meal was $118.00 before tip and we all agreed that it really wasn't worth it.  It's a shame because we REALLY wanted to like this place.  We love to go out to eat, we love Italian food, and we live in Waxhaw...it could have been perfect.  So disappointing."}
{"text":"I really enjoyed my pasta dish with sausage and sweet peas in a tomato cream sauce. It had a lot of flavor and was cooked perfectly. The complimentary bread with beans and olive oil was also very good.   The atmosphere is nice and relaxed. They had a nice drink selection as well. I  felt like the pricing was reasonable.  So why not 5 stars?  My mom ordered a pasta dish with shrimp but subbed penne for angel hair. They brought out the wrong pasta which wasn't a big deal, but I think they rushed the noodles out too quickly and they were still sort of hard and stuck together. When she mentioned this to the server he didn't have much of a response. Overall the service was a bit unusual.He had a super-dry dead-pan sense of humor but his delivery made us a little uncomfortable.   I didn't feel the service would keep me from coming back because I did enjoy my dish quite a bit and that trumps ok service in my book!"}
{"text":"We LOVE Trattoria Antica!!  The food and  service are always outstanding.  I'm partial to their gnocchi...molto bene!!"}
{"text":"Our second visit was our last.  The few items we noticed failing in the 1st became more so on our 2nd visit.   Waiter was too pretentious calling my daughter \"signorina\" and my wife \"signora\"  ... for what ... for charging $20.00 per plate? . Ok fine, he's trying to create an atmosphere - but failed. Did not come across credible at all.   He was watching the soccer game and made statements that left the three of us in our party scratching our heads --- we found out later were his attempt to be funny.   Note to waiters: If you suck at being funny, don't even attempt it. You were not funny and in fact annoyed us with your comments.   Finally the food failed on all levels. I had risotto with peas and basil and seared scallops. It just didn't blend well. The rice was very undercooked with hard centers - not even close to being \"al dente\".   My daughter's gnocchi were the opposite - overcooked to the point of being mush balls.   Sorry - this place should be charging 30% less and then I'd find its failings excusable. At $20.00 per plate for just the entree, plus drinks, plus desert, plus side dishes - - inexcusably poor quality and service.   First time all year I tipped a flat 10% instead of my 20-25%.  I should have tipped ZERO."}
{"text":"Wife and I ate here for date night. Service was A+. Friendly and attentive. Food was OK. I had the tortellini and it was good,  not great."}
{"text":"We have been wanting to try this place ever since we moved to Waxhaw back in October '15. We got to the restaurant fairly late at night (9pm) and were seated right away. The place has a nice ambience and seemed like it was going to be a great meal. But our disappointment started to begin when the server started to wave the menu at my wife's face to get her attention about the drink order - apparently a simple \"excuse me\" wasn't on top of mind for him. We got a few salads (Casa and Trattoria) and couple of pasta dishes. Casa salad was drenched in dressing as if it had been prepared for a while. We got our pasta dishes, which were actually fairly tasty. The Eggplant Parmigiana was pretty good and the spaghetti with it was great. The fettuccine Alfredo was pretty descent and flavorful as well. The Gnocchi was kinda hard and a bit bland/tasteless. So two out of our five dishes were disappointing.  Now the ongoing painful service we were receiving throughout the night. We asked our server for straws, which we never got, had to ask him for bread, had to ask for water refills. Additionally, we ordered croutons on the salad, which was a generous charge of $1. I've no problem paying for it, but there were only 4 croutons. To top if off, our server took the liberty of adding 20% tip to our check, for a party of five. Really? Not cool. We won't be making it back here again."}
{"text":"In my opinion, this is the closest to authentic Italian you can get in the greater Charlotte area!   They really put a lot of love into the dishes here.  I have had numerous items off of the pasta menu but nothing really beats the good ol classic cheese ravioli!  I always like to add sundried tomatoes and artichoke hearts just because they are delicious.   The owner is there a lot and always very welcoming.  He usually helps us select a good wine because we dont really know the difference between mediocre and the top notch stuff.. So, he usually educates us.  Overall, we always have a great time here and have never been let down.    Enjoy!  -Ian M."}
{"text":"Once you get used to eating in a strip mall you can come to terms with the fact that this is a really decent restaurant. Good service, good food, and Michael the owner/manager is very attentive!  It is worth the long drive down Providence Road to enjoy some of the best Italian food in town."}
{"text":"Had a reservation and we showed up a few minutes early. We were asked to wait at the bar or these two chairs they have set up in the small lobby. The bar wasn't full but the people were spaced out enough that there was no where to go, but seeing how it would only be a few minutes the lobby was fine. 40 minutes later, after watching other parties of what seemed like regulars flow through the door and be seated ahead of us, we were finally brought to our table. After the pedigree of the other restaurants the company owned we never thought that would happen.  The food was good but it seemed like the people, one guy in particular, tried to make you feel like they were doing you a favor. I can't see us going back again but it's a shame as we live so close by."}
