{"text":"This place has just reopened and my boyfriend and I went for the grand re-opening. I was really unimpressed.

First off we walked in there and were completely ignored. The staff stood like 5 feet away but never said anything so we went ahead and seated ourselves. 

The menu wasn't anything special really but it did advertise as fresh cut fries which are my favorite. 
I ordered the \"burnout\" and added sautéed onions and tomatoes to it but when I got my sandwich it had no tomatoes and sautéed mushrooms on it and not onions. I told the server about this and she just brought me one singular tomato slice. Cooool. 
My boyfriend ordered the \"super bird\" which is a chicken sandwich with cheese, bacon and ranch. He received literally a piece of chicken and one leave of lettuce on a dry bun. We told our waitress this and she said that those things don't come on that sandwich but she'd bring them anyways. BY THE WAY before we left we asked for the menu and showed that it did come on that sandwich and that our check also said \"super bird\". Go read the menu I dare you.

The worst part was that the fries werenot fresh cut!!! 

The service, atmosphere, and food (and accuracy of the food ordered) was a flop.

I live down the road and really wanted to try this place and almost as soon as we got there I wanted to leave."}
{"text":"Overall: Mediocre

Atmosphere is fun, with lots of old oil and gas memorabilia. 

Food was really unimpressive. Burgers were dry. Portions were very small. Flavored were bland. 

Listing says good for kids, but no kids menus, no high chairs, no boosters, only about 3-4 tables with low enough seats. 

Service was okay, a little slow and our waiter never brought any refills for soda or water, while we were sitting inside at the closest table to the bar/kitchen. 

Would not recommend. Won't be back."}
{"text":"Cheese curds were pretty good, coconut shrimp too, but too much breading on shrimp. Margarita not bad, fries ok, music too loud, overall ok."}
{"text":"So-so. Nothing to brag about but not bad either. Service was really friendly though and prices were decent. My chicken breast was cooked well with a delicious char on the outside and still juicy inside. My husband enjoyed his burger too. The sweet potato fries were pretty terrible though. My frozen store-bought ones are better. These didn't even taste like sweet potato because they were so crinkled and over-fried."}
{"text":"This was awesome. Great service, good food, and fun atmosphere. The cheese curds were awesome and I had a burger with a few beers. Talked to the owner who seems like a really nice guy. 

The outside of the bar could use a little work but the inside and the patio, wow very cool. Great theme. I'll be coming back for lunches and Sunday's again, the specials are too good to pas up.

Definitely give it a shot, and if you're a car guy/girl you're sure to meet like minded people if you park your pride and joy out front."}
{"text":"Went to this place last Sunday with my wife.  Good deco and very clean.  We had wings and a burger with a few beers.  Food was fresh and good.  The service was great.

Could not believe the price...  so fantastic... 2 bucks per a beer..."}
{"text":"Went to Treads the other night and my boyfriend myself and his brother were harassed by their drunkin cook! We were the only 3 people in there besides one other lady. We were eating our dinner i'm 4 months pregnant and the cook is instigating a fight asking me what my name is getting my boyfriend all upset. I want to see that this cook is fired and not allowed back near that building!! He's short with dark hair and a beard and has a fat ass mouth on that little body of his! The food is always good and the poor bartender lady was super nice and apologetic but really that guy should have been kicked out or had the Verona police there to escort him out! Yes that's how bad it was getting."}
{"text":"Seemed like an average breakfast. Under $20 for two meals. I got scrambled eggs and they needed salt to be OK, but I still didn't feel like finishing them. We both got the daily special: cinnamon raisin French toast. It was good enough to make up for the eggs. The menu said the special was $6, but I guess the special was more special since it was $8.

The only other people at this place were a family and some people who were probably over 50."}
{"text":"Go in with the expectation that this is a townie bar. Cheap beer and fried appetizers are a plus. 

Don't expect fancy things from the bar (nothing more than beer and simple rails). Bartender was friendly but didn't know how to make simple drinks or standard bartending terminology.

Food was underwhelming but cheap. I had the Cadillac burger. The fries were good but the bun was soggy."}
{"text":"Fish fry and French fries are good.  However they gave me sour cream instead of tartar sauce.  I also ordered a Cadillac burger without cheese and they ended up putting cheese on the burger.  When the burger came back from the kitchen they didn't give me fries that were supposed to come with the burger.
I think they might be under staffed however that doesn't excuse customer service.  There were no refills on drinks unless we asked for them, and food service was very slow and sporadic coming out to the table."}
{"text":"Limited menu which is good due to the small kitchen.  Great look on the inside. A couple of the TVS are up too high to comfortably view (but they are in a place you can't lower them). It would be nice if one of the TVS was hooked up to a DVDs player to watch car related movies.  I think they need a speciality drink like a 608. They also need to upgrade their napkins.  Overall it is a pretty basic place nothing over the top. I'm looking forward to coming back in the summer."}
{"text":"I love this place! Best bar food in Verona! Great burgers! Fun atmosphere! The outdoor patio is a great spot on warm days! Personal friendly staff too!"}
