{"text":"Usually go for the half price wings deal but that is no longer offered. Ordered the rib/wing platter to split between 2 people. 

1. Wing/rib platter 
- Big wings with good amount of meat. Ribs were tender and not dry. Fries, a lot. Also comes with vegetables. Good deal for $17 to share."}
{"text":"Probably the best wings in the city and cheap beer! I've been going here for about 11 years and every meal I ever had has been amazing.  My issue is the owners brother, we had nowhere to sit in the bar and he was taking up an entire booth to himself just staring.  Yes your brother owns the bar but come on, give the patrons a seat."}
{"text":"We were the only table in the restaurant, a table of 6. We waited over an hour for the food. During this hour, each person sat with empty an empty glass, until someone walked over to the bar to find the only waitress in the place, to order refills. Eventually, we each received 1 refill. 
Alas, the food arrived. A young man arrived with the waitress and set one plate down. When we asked him what dish that was he responded \"I have no idea.\" It was the wrong dish. We were told the kitchen could redo the order but after waiting over an hour for the food, we just took what the young man brought. 5 out of 6 entrees arrived. Entrée #6, a burger - the waitress checked the kitchen and reported \"The chef dropped your burger on the floor. He will have another one ready in 5 minutes.\" We had waited an hour, yet the chef would remake an entrée in 5 minutes? Or would he just pick it up off the floor... we wondered. 
The \"liver special\" was so overcooked it was inedible. Leathery, no flavor and black as a hockey puck. The roasted potatoes, accompanying half the entrees, were firm and cold. The veggies, all cold. The \"warm spinach salad\", cold; and the spinach was wilted. The gravy accompanying the lamb chops was thick and solidified. The last entrée arrived, and exactly like the other burger entrée, the bacon was overcooked and the cheese was hard, as if it had been sitting for a while. Needless to say, most of the food went back to the kitchen. After waiting again, we walked through the restaurant to find the waitress to request the bill. When paying by card, we had to leave the seats and stand on the other side of the restaurant because that area did not receive reception.
By the end of the evening, I must admit we were laughing. The entire experience was awful, so bad in fact we had to laugh. Upon arrival we wondered why the place was literally empty. By the time the evening was over, we knew exactly why. This is the last time we will ever go to Triple Crown."}
{"text":"Since the owner changed, this restaurant was just not the same. Service is always very slow. Food is average but takes forever to cook. Staff has high turn over rate. Oddly, the business always serves Chinese food."}
{"text":"Ever since the place was sold this summer, the service and food quality have nose dived.  We waited 30 min for wings, and when they were brought it was brought out one serving at a time, there were 5 of us.  Not to mention the flavour was wrong, it's wings, not rocket science.  We won't be going back."}
{"text":"New owners at The Triple. They are having challenges. Inclined to give it a pass for the time being."}
{"text":"Service was pretty good, prices a little high, and food quality was pretty decent.

Went to this venue after looking up \"wing bar\" on Google Maps, and seeing some pretty decent reviews on there and one 5-star review here on Yelp. It ended up having one flavor of wings, claiming it was the best kind there is :-S

A man who looked like the manager was taking care of the venue in every way he could, and he was overall pretty helpful. He did however seat my group of 5 right in front of one of the largest speakers I could see around, which made it hard for us to socialize (and that was the main reason we went there).

We had 3 different waitresses throughout our stay, which I found to be a bit odd, but all of them were friendly none-the-less.

I ordered calamari, which was pretty good. It came with one little piece of lemon wedge and the guy who looked like the manager offered to bring me more, which was nice.

Also in terms of a bar scene, it seemed to be more-so of an older crowd. That wasn't why I brought my group there though, so it wasn't all that relevant.

However, the area that had the pool table which we would've liked to use was closed off to a private event. The jukebox was also in that area. Being able to use the pool table would've likely made it easier for my group to socialize.

So would I return there? Definitely not when looking for the type of environment I was aiming for. It did seem like a pretty decent place all-in-all, however."}
{"text":"So disappointed. The server gets 4 stars for being patient and upbeat but didn't know what anything on the menu was. It's already a bad sign when each person has to explain to the server what is stated on the menu - grab a pen and paper and write it down at least! The food was abysmal. Got the calamari (super greasy and overcooked) and pork souvlaki (the salad was the best part, potatoes were home fries and when I asked for the tzatziki it came with she had no idea what I was talking about and brought \"ranch\" that tasted nothing like ranch. My friend ordered a burger and fries (greasy and soggy).

Used to come to this restaurant 10+ years ago up until 2013. Food and service was great and can't complain about the increase in prices over the years due to the consistency of quality and service. 

Now someone new owns the place and it's not what it used to be. 
Save your time and money and go elsewhere."}
{"text":"DRINKS: The selection is lacking. I wanted a girly drink but they were out of pretty much everything. No mint, no lime, no anything. 

ATMOSPHERE: So ghetto. 

The ladies washroom was clean when I went at 4 pm. It was also UNDERSTAFFED. There was only one waitress working the dining room and bar patrons. 

VERDICT: Avoid this place. How is it still alive?!"}
{"text":"I loved this place. M friends and I went there for appetizers and a few drinks before heading downtown on New Year's eve. The BBQ chicken pizza wasn't the kind I'm used to, but it was utterly fabulous. My friends had the hot wing, I'm not usually a hot wings person so I was just happy with my pizza and white zinfandel. 
Not expensive at all.."}
{"text":"Wow, what a shame, the Greeks are gone and so is the quality,customer service and good staff. Another one bites the dust."}
{"text":"Mt girlfriends family has made a tradition of going here every year for dinner on New Years Day (why we keep going when one of the kids got their meal AFTER everyone else ate last year)
Anyways, I tried a few things on the menu until I came across the souvlaki (the meat, veg and rice was nothing special, but wow did I ever fall in love with the dressing on the Greek salad).

So this year I knew exactly what to order, the chicken souvlaki.
Was I ever disappointed, not only had the price gone up, ($18.00) but there was almost no dressing on the Greek salad.
The only reason I bothered with the souvlaki was the salad, they used almost no cheese (I understand with prices going up and whatnot) but the worst part was that they skimped on the cheapest ingredient.

Ah well, I only go there once a year, next year I will have to find something else. 
."}
{"text":"Food was very good. Souvlaki and, I bet, homemade tzadzicki. Staff friendly and efficient (3 pm). Only negative, really, was a really loud, really foul mouthed, regular. Makes me wonder what you have to do to get tossed."}
{"text":"Good bar food at the back at a good price. Lots of tv screens to watch. Always a game on. Plenty of draft choices on tap."}
{"text":"Let me first off state, the star is strictly because the bartender was friendly and I think he was even embarrassed about the situation. 

Had time before a meeting in the area and wanted to grab a bite to eat. As I pursued the menu I was told there is no chef, but he should be there in ten minutes.  I've been here in the past, but the bartender told me there had been a change in ownership. Which made me immediately open my Yelp app. The new ownership has received less than favourable reviews and seems to be deservingly so. As thirty plus minutes later there was still no chef after the bartender made several calls to find out what was going on, and where the chef was, and when he'd be in.   

As I asked to settle up he said the chef is here now, sorry too late. The worst part was as I was trying to pay these street peddlers walked in trying to sell electronics at bargain prices, likely some kind of scam. And the bartender which I hope didn't fall for it was really interested, more so than settling with me. I got out of there with barely enough time to eat at this point, and very dissatisfied. 

So it seems the new owner has hired unreliable staff, and that'll cost business in the end. I'd be hard pressed to come back here, especially considering there is a great spot across the road."}
