{"text":"Pleasant family spot!  Definitely your no bells and whistles community eatery.  You know it's good if the fire department are regulars and they are here!  This is a community over aesthetic atmosphere spot.  Food is stellar and quick!  No cut corners in the food department here. 

Pro tip - if you wait to be seated you'll be waiting a while. Walk up to the counter to order and sit anywhere you like. Your food will be delivered to your table.

Update to review:  We brought it down one star because the second time we went we notice some grim and spiderwebs.  Most notably on the widow sill.  After see it there I looked around a little more and in my opinion with little effort the place could be a bit cleaner."}
{"text":"We love Trolley Barn and stop here for breakfast most Fridays.  We only found this hidden little gem in the last several months but I wish we had known about it before.  Fresh, made to order, well seasoned, tasty food.  High quality breakfast meats and buttery home fries are the highlights for me.  My daughter is crazy about the chocolate chip (super chocolatey) pancakes and sausage patties.  Come here super early on a weekday and the place is full of regulars who settle in as though they're at home.  On weekends, it's packed with families, couples, and regulars.  This place is nothing to look at; if you're looking for ambiance, look somewhere else, but prices are low and breakfast is delicious."}
{"text":"This is one of my favorite places! Love the food, all of it! Also love the family that owns the restaurant, good people!!! Just like eating in MOM's kitchen, never disappointed!"}
{"text":"Trolley Barn Eatery is located in a plain white strip mall on Route 88 so you probably wouldn't think to stop here for diner food. The food here is pretty decent and the prices are very affordable. My husband and I both got large breakfasts for only $13 total. What a steal! I can't speak on the table service but takeout was prepared quickly and the food was still tasty when we brought it home. My only complaint is the limited hours, which are hard for me to catch with my working schedule."}
{"text":"This is a very cute, friendly and nice place to have a meal. I came here for breakfast. 

It's a little small but there were plenty of tables available. You place your order at a counter in the back and also pick up your coffee and silverware there. You pay in advance, give your name, and them the meal is delivered. 

I got the #1, which had eggs, potatoes and toast. The standout was the potatoes-- you could tell they were prepared with fresh potatoes, not frozen, and were quite flavorful. The toast was also very good. I chose the bread, and the bread was thick and also fresh tasting with plenty of
butter. Eggs and sausage links were likewise of good quality. 

The price was $5 for the breakfast and $1.50 for the coffee. These are excellent prices for the quality and quantity of the food. I'd definitely come back."}
{"text":"Love this place, been here a few other times & always delicious, had eggs sausage potatoes a pancake & toast, all for $8!!!!!! Guess the line out the door speaks for itself lol. Always the best breakfast in the area, beats the \"diner\" around the corner by a mile, will be coming here as long as it exsists"}
{"text":"Classic diner fare - good quality food, nice portions, salt-of-the-earth friendly staff and owner.  No frills, an overall great experience."}
{"text":"I have lived in Pittsburgh now for 10 years and have hunted for good breakfast spots since I arrived.  My husband who was living here years before me but not a native took me to a few places he loves.  He still goes to them and I am still looking - until now. Yes I have done the chain restaurants and some other plaes with recommendations but I hate paying for disappointment.  I FINALLY decided to stop in to see why all those cars are parked there on a Sunday morning.  It is just as another reviewer described with going straight to the front and ordering and then stepping to your right to get your utensils and syrup.  Very friendly staff, quiet atmosphere and DELICIOUS cinnamon swirl pancakes.  Cracker Barrel has absolutely lost a customer."}
{"text":"Even though I pass this plaza almost daily, I never even thought of eating at TBA until a recent Saturday morning when I was craving something tasty. We arrived around 11. About half of this tiny (maybe 10 tables total?) restaurant was full of happy, smiling patrons. The inside was covered with what I would describe as years worth of memorabilia of the locals celebrating the community. We ordered at the counter and awaited our food. Within a few minutes, my huge chocolate chip pancakes arrived. Soon after came a large cinnamon roll covered in a rich icing that was melting down the sides. The pancakes were the lightest, most fluffy melt in your mouth deliciousness I have had in a long time. The cinnamon roll was equally as delicious. Overall, everyone was pleased with their food choices. Now the reason for 3 stars. The drink selection was sparse. Cans of soda, plastic containers of what some call \"juice,\" coffee you pour yourself. I feel that these options are in need of improvement. The tables, chairs, floors and walls were also in need of a deep clean. The other customers didn't seem to mind but as a self proclaimed germaphobe, it would prevent me from coming back."}
{"text":"Love the atmosphere here. Lots of regulars who all get along with each other. We even witnessed a gentleman take the serve yourself coffee and top off other patrons cups to be kind. 

The food was good and hot. The pancakes were delightfully fluffy. The menu is simple and everything you want out of breakfast. 

You order at the register and they bring your food to you at your table. Great home style food and feel."}
{"text":"This is definitely an old school place.  While it is cool to eat at a place that has been around forever, to me the food is just too basic for me to get into.

The menu at the Trolley Stop is pretty much your basic breakfast options, eggs, toast, sausage, French toast, omelettes, and a few other options.  I will say they do cook the food well and it always comes out tasting very good.  Having said that, it would be nice if they would add some excitement to the menu.  I get that part of the idea of this place is the basic look, menu, etc., but I still feel they could do something to attract a younger crowd.  It is difficult to pay money for a standard breakfast of eggs, toast, and sausage, when you can make the same quality of food at your house."}
{"text":"Came in for Saturday Morning breakfast and enjoyed a number 1 and supporting a local business.  Prices are great and portions are large.  Yumm!!"}
{"text":"Great food and staff! Highly recommend to anyone who is looking for a reasonably cost breakfast/lunch!"}
{"text":"This is a cute place to catch brunch in the South Hills. I loved their cinnamon rolls, home fries, bacon, and french toast. The service was efficient and friendly (the customers were as well). Yet another strip mall secret gem!"}
{"text":"A no bells & whistles kind of place, but the food is quite good.  Most of the breakfasts are $5.  Last fall, we ordered the pumpkin pancakes - they are a game changer!  There's a lot of cool historic photos on the walls that are fun to look at while waiting.  Order at the counter and seat yourself.  The servers do come around and refill coffee quite often as well."}
{"text":"Solid establishment with friendly, engaging service and great prices.  No yuppie food - straight forward eggs, home fries and pancakes.  They also serve lunch, but I have only been there for breakfast."}
{"text":"What you see is what you get. Nothing remarkable or out of the ordinary (this is not meant to be disparaging). For $10 or less, you get a good, plain, well prepared meal. Order at the counter, pick a table, eat, clean off your table (if not offered assistance), and leave. 

If you are looking for something more, look somewhere else."}
{"text":"Classic hole in the wall... Super nice staff. Food took a while to arrive, but solid good breakfast fare! Would definitely come back."}
{"text":"Sure wish we had tried Trolley Barn sooner! Friendly service and delicious food. We ordered takeout, 2 orders of Breakfast Combo #1 eggs over easy with sausage patties and Texas toast, and home fries. Also an order of French toast with bacon. Everything was perfect, particularly the sausage patties and home fries. They also have daily specials and the waitress said if we call before ordering we can find out the specials. Will definitely try again! Their prices are lower than Bob's Diner up the street but no less quality or quantity."}
{"text":"My mom & I stopped in here for breakfast.  We both had the western omelet!  It was so good!  The atmosphere was pleasant & so was the staff.  We will definitely be back!"}
{"text":"When I was but a young pup, I'd usually squander holiday dough on music or comic books. 

Nowadays, I tend to use those free greenbacks for dinin' out!

With a bundle of belated X-Mas cash I received last night jolting me from my brief, economically-induced (consumer overboard!) Yelp slumber, Kay and I were on the hunt for more unreviewed plunder this frozen morning. I recalled that the Trolley Barn Eatery, another suburban shopping plaza enigma known only to local residents, had not yet been discussed. On a trillion occasions I've passed TBE during hours when (of course) they weren't open. A little research confirmed my theory that they were only open for breakfast and lunch. Further delving indicated that they were open only until 12:30PM on weekends. It was 11:15! Kay and I still had pajamas on and overnight crust in our eyes!

\"Kay, we gotta go, NOW!\" I told my ladylove. 

\"Damn you and your Yelping,\" she grumbled back at me. 

As we strolled in, we immediately noted the interior scenery, which is appropriately trolley-themed. Vintage signs that appeared to have been lifted from scrapyards line the walls as an \"I\" beam that runs across the ceiling. Black and white photos of Pittsburgh streetcars from ages ago hang above your heads as you indulge. 

Noting us in this secret hashery were the regulars who ranged from elderly couples to gaggles of teenagers. The lively, amusing conversation seemed to stand still in the nearly overloaded bean wagon for several seconds once we were seen. 

Heads turned...smiles formed. 

Waiting to be seated, a helpful white-haired woman advised me, \"Hon, you gotta go up front, order and pay there, gather your own silverware, THEN take a seat. That's how they do it here.\" 

We both made our way through the narrow dining room, dodging fellow patrons who only patted me on the shoulder and chuckled when I bumped into them. 

\"We've never been here before,\" I explained to someone. 

\"OHHHH, you're gonna be back,\" she replied.

Once I placed our order, we sat near the entrance, getting up only to hold the front door open for someone in a wheelchair who was leaving, the warm atmosphere keeping the winter chill from affecting me. 

Not knowing what in tarnation to order, I simply went for a burger. Since they were still primarily in breakfast mode, I had to settle for homefries as a side, but for dessert, it was an abundant helping of sliced-down, buttered Pecan Roll. 

A classical diner burger, the top of the roll was as crooked as a wino's hat, and the attendant bacon strip stuck out as if said drunkard was giving me a good-natured raspberry. Flanked by doubloons of dill pickles, its cold, fresh l-t-o, and fluffy bun were held in place with a decorative toothpick. The patty could have been a little juicier, however, but I suspect that fears of trichinosis keep these burgers from being cooked less than well-done or medium. Nonetheless, I moderately enjoyed and hardly finished my hard-luck, hardscrabble burger. 

The home fries appeared to have been cut from Red Gold or Norland Red taters and came in magnanimous chops. 

\"We gave yinz extra, for both of yinz,\" the greying cook told us as he brought out the broiling hill of spud on a large, alabaster porcelain plate. Rich, nutty, and slightly sweet, I had to take half of them away in a container for later, the helping proving to be too much for my stomach to hold. 

The aforementioned pecan roll should be renamed pecan toast. The whipped butter almost spread itself onto each crispy, caramelized tile within which I'd get a toothful of an occasional drupe nugget.

For just $21 and some change (pre-tip), it astonishes me how much food we both recieved for our money. Again, generosity seems to be TBE's forte, their stock and trade if yinz will. You'll pay a pittance and get a fortune in return, not only in terms of the food but the colorful, wisened clientele and service as well.

\"Dont forget us next time yinz feel like eatin' aht,\" our waitress said as we departed, matriarchally putting a purple sheet of a menu in my hand for future reference. The room that was packed upon our arrival was now almost empty.

\"Too bad we're closin' for the day. Yinz coulda had the whole room to yerselves!\"

God bless places like Trolley Barn Eatery.

P.S. The menu board behind the cash register and counter said \"FREE ENTERTAINMENT -- $0\"

P.P.S. Our small table couldn't hold all the food! Luckily, a table next to us was unoccupied. \"Yinz got a banquet goin' on over there?\" A fellow customer inquired.

P.P.P.S. Since TBE has no official website, and putting up menu links in the listings that do not originate from a restaurant's website is unallowed, here's a link to TBE's menu from the official website of Castle Shannon, the neighborhood this diner is located in...

http://www.castleshannoncommerce.com/tb-menu.asp

P.P.P.P.S. TBE caters and serves breakfast all day."}
{"text":"This is your local diner.  Reasonable prices with good food and friendly service.  Had the No. 2, which is two eggs with bacon and a large pancake.  It arrive with sausage instead of bacon and I decided to have the sausage since it looked good, and it was!  My eggs, pancakes and sausage were $5.  Now that is a good meal at a good price.  Better than the diner around the corner in my opinion."}
{"text":"Love this little place! So affordable and the woman that works in the mornings is so friendly. She always remembers us and genuinely takes time to talk to us. Super down to earth mom and pop style place."}
{"text":"Service here was great, thanks to Mia,  Who's been waiting and tables around Pittsburgh for more than 20 years I believe.

She asked me if I had tried the pumpkin pancakes because this is the last week for them. I said no and I thought I'd give them a try. I have to say the most flavorful thing about them was whipped cream with cinnamon spice on top. It was golden brown and light and fluffy,  just disappointingly nearly flavorless."}
{"text":"When we first moved to Pittsburgh, our landlord recommended the Trolley Barn. For some inexplicable reason, we waited over a year before we first tried this spot. It's one of the greatest regrets of our young lives. Now, rarely a weekend goes by that we aren't here. For the cost conscious, this place can't be beat. The two of us regularly eat breakfast here for about 11 bucks total. We often arrive, after a night of drinking, craving cheesy eggs and savory sausage patties. Though we often feel like fetuses here--the place skews old--the staff and patrons are always friendly and welcoming. Our order has changed minimally in the times we've gone. Though they serve lunch, we always choose breakfast. After an ill-fated order of pancakes, a lackluster french toast, and a disappointing cinnamon bun, we've landed on the perfect Trolley barn breakfast. Scrambled eggs with American cheese, sausage patties, home fries, and hot, buttery Texas Toast. The home fries have a nice blend of thick potato and crispy griddled bits. All in all, a great breakfast for about 1/3 of the price of many local places."}
