{"text":"This is on the top of one of my all time favorite golf courses in America.  I played both the Monument and Pinnacle Course.  Conditions, top notch.  Excellent service and staff.  Surprisingly they space out the tee time pretty well, didn't see many other golfers at the time I played.  Maybe it's the desert, Cactus, and large boulders, I feel so peaceful and relax.  Maybe I like it because that is where I got my first Eagle.  The Monument course has a short par 4, hole #6.  Drove it on the green and made a short 6 footer for an eagle.  Balls flies far in Arizona, you can add 20% further distance than my yardages in the Northwest.  This is a must go place if you go to Scottsdale.  Much better than the PGA Scottsdale."}
{"text":"Course layout was nice the greens were a disaster. All bumpy no  divots  repaired, covered with Paw grass. Greens should be noted under repair or something. Pro shop didn't seem to give a crap after just complained. For $250 a round they should be pristine."}
{"text":"I played the monument course on a recent trip to AZ for business. Wow, the views were incredible. Absolutely stunning views on every hole. Neat wildlife everywhere with rabbits, lizards and roadrunners. I can't imagine how many snakes there must be in the summer months. Thankfully they were all hibernating when I played there in late January.  The staff were very nice and gave us the private club treatment which is what you would expect for the cost to play which was around 300 bucks per person.  In spite of the fact that I played my worst round of golf in several years, I enjoyed it tremendously."}
{"text":"With such amazing golf courses with exceptional guest services, I think Troon North is the place to visit if you love playing golf.  I'm a novice golfer, but I will definitely rank this place as #1 on my book.  They have two courses; I thought the Monument was a tougher than the Pinnacle.  Nonetheless, they are both well maintained with challenging layout that every level of golfers can enjoy.  One more thing, do wear a long pants.  It'll allow you to go into the bushes to look for your ball.  Those bushes/cactus sure will hurt ya!"}
{"text":"Pinnacle course shines at Troon North - a real treat.  Monument course nice, not as inspiring. Course conditions good, but not great.  Nice selection of golf merchandise in the pro shop."}
{"text":"Somehow, someway I was able to score a round on the Monument course at Troon North for half the going peak playing time rate.  It is definitely a must play (at the right price - more on that later) for any local and snowbird's golfing vacation.  I cannot speak on the Pinnacle's layout, but the Monument, on this particular brisk day in December, was in immaculate condition.  Except for a few holes, the tee boxes were cut perfectly, the fairway had adequate delineation from the rough, which was surprisingly difficult, and the greens were the fastest I have played here since arriving from the east coast in October. The condition of the fairways and rough were a testament to the fact that the overseeding done here in the fall was very successful. Please note that the Monument is not an easy course.  It's uphill par 4s and 5s rival those of SunRidge Canyon.  There's plenty of variety as well offered by this track.  Some holes are flat vistas, others are carved into downhill canyons and still others lay adjacent to massive palo verdes and mini buttes. The course definitely had the most cacti of any course I've played here in the Valley of the Sun.   Some may be asking: \"Why only four stars for what is routinely ranked as the two best golf courses in state of Arizona by Golfweek, Golf Digest and Golf Magazine?  Answer?  One word: Price.  I was able to get on the Monument course at half the price they were charging at the time for peak play.  This isn't a  knock on the course at all.  It's just that while there aren't many courses in the Scottsdale area that rival the quality of Troon  North, there are a few I'd consider it an equal of and which you can get on at much cheaper price point.  There are those that hold Troon North is overrated.  I would never go that far but you can play other courses that rival it's majestic layout at three-quarters to half the price."}
{"text":"One of the best public courses in North Scottsdale. It very family friendly and they are used to having young junior golfers on the course. I find the course to be in very good condition whenever we are there. The staff in the pro shop are always pleasant and helpful. The snack bar could be better. It has a very limited selection and it is a little hidden. I doubt most golfers even know that there is one there. Usually we end up going to the restaurant instead, which is great, but does not have a very good kids menu. It would be nice if they had a more elaborate selection at the snack bar for quick and cheap grab and go food."}
{"text":"First, Troon North is a very fine golf course.  I only gave it 3 stars because I usually rate golf clubs by value received for the money paid.  I would play it again but not at 240 a round.  We played Monument which was challenging and in great shape.  The greens were fast and the layout was typical desert.  I tried to play several shots from beyond the fairway and managed to ding up my irons pretty good.  Very nice and helpful staff and had some decent food in the bar afterwards."}
{"text":"Troon monument is my favorite course in the Scottsdale area. It's a true desert mountain course with breathtaking vistas and abundance of wildlife you don't see in the city of Scottdale (more than just rattlesnakes, may see deer, javelinas and bobcats as well). The fairways are lush with numerous elevation changes and the course is set up to be playable for the higher handicap golfer while remaining challenging for the low handicapper. The greens are almost always in great shape and aren't at all glassy like so many greens are when the heat starts. They stagger tee times so that you aren't right on someone's heels, nor is anyone right on your heels throughout the round. My only complaint is the price...if you play the course when it is cool enough outside to really enjoy it, you're probably paying $200+ per round. It's hard to justify more than once in a great while."}
{"text":"My wife and I decided to try the Dynamite Bar and Grill at Troon North Golf Club for breakfast while staying nearby at a local resort.  We didn't have great expectations but we figured the food would be decent and the views of the course would make it even better.  My wife ordered the southwest omelet and I ordered the eggs benedict.  We were blown away by both dishes.  We couldn't quit eating and we couldn't quit commenting to each other about how tasty the food was.  My poached eggs were cooked to perfection and the hollandaise sauce was light and flavorful.  My wife's omelet had just the right amount of spice and she fell in love with the hash brown potatoes.  Our server told us that the cook responsible for this fabulous breakfast was named Pedro and that he had been cooking at the grill since 1995!  Pedro....you knocked it out of the park when you cooked our breakfast.  Thank you for adding to our wonderful vacation."}
{"text":"When it come to Desert Golf not many places beat Troon North.  Consistently rate one of the best public courses in the country.  The Pinnacle and Monument courses both have their own charm. I like the Pinnacle, the newer of the two, a little more.  The club house is better than most private clubs I've been in.  The beauty of the the courses and the land around are breath talking.  If you love golf this is one place you need to play....5 stars in every single way you could possibly think of!"}
{"text":"I'm sure the golf course is amazing, but there happened to be a monsoon the day we were there, so we had lunch and left. This review is strictly about the Dynamite Grille. The food was, well, awful. At least what I had.  I ordered eggs Benedict, and a side of scrambled eggs. The ham was tasteless and rubbery. I believe Hollandaise sauce is primarily three things: egg yolk, butter and lemon juice. I could taste none of those ingredients in this Hollandaise. In fact, it had very little taste, and I'm guessing was faux Hollandaise. The English muffins it all sat on weren't the least bit crisp, and quickly got soggy.  The poached eggs on the Benedict were fine, but the scrambled eggs on the side appeared to be the kind that come out of a carton. Again, fairly tasteless. My buddy confirmed they were horrible.  The service was good, but I would have thought such a nice, high-end facility would put a little more effort into their food."}
{"text":"The Monument was one of three courses I played while trying to get away from the Chicago cold for a week in late March 2014.  For the money I paid, the best way to sum it up is that it still beat a good day in the office.  The course staff was friendly and courteous, and we played in about 4 hours, which is about 30 minutes faster than time par, but that may have had more to do with a 2:10 pm tee time on a Monday afternoon, so the course was pretty empty.  You do get a feeling that you're golfing in the middle of a desert, but I don't feel that the course was anything special as far as being picturesque.  The only time I felt like taking a picture was on the third hole, which had the Monument rock in the middle of the fairway.  I did like the sand in the bunkers.  It was actually sand, as opposed to rock (admittedly I wish I didn't have to discover that; fortunately I only experienced two of them).  The greens were horrible.  I have no doubt I could find a smoother putting surface on a Chicago city street during pothole season.  I've never seen so many bumps and jostles between the ball and the hole.  My playing partner was affected more because he was generally left with longer putts than me, but on at least 6 holes I watched him miss a putt because the ball bounced within 6 feet of the cup and subsequently fell off line.  On three others where he had long putts, I know his ball stopped shorter than he was planning on because of those bumps.  The wind affected my shots enough that I often had to chip and putt, but the bounciness of the greens cost me strokes with the putter as well.  I'm glad I had to chip and putt, because given the condition of the greens, that probably saved me from multiple 3-putt holes.  I feel that the only reason the price is justified is so they can run the animation for the course flyovers on their website.  This is NOT a course I will play again when I come back to Arizona.  The course I played earlier in my trip, for half the price, had smoother greens than this."}
{"text":"Incredible views. the course was in excellent shape. The only reason I didn't give them a 5 star is that I expected a GPS with $295 green fee."}
{"text":"This review is for the venue of Troon North and the golf course    This is one of my favorite places to eat in Scottsdale. The golf course is exceptional and would totally recommend golfing here with a couple of friends or for business.  I have dined here a couple times but recently went for Easter brunch. When we got there, the staff was very welcoming and got us to our table quickly which was great. Once we got to the table it was time for the buffet. Their were people all around to help us with what the food was and, what was the best which was very helpful. The food was nice and warm every time and, the staff would bring over new batches of food every once in a while which was good so the food didn't get cold. Overall great place to dine the venue is great and all around totally recommend it for breakfast, lunch, and dinner."}
{"text":"Terrible all the way around.... Rude unfriendly people in the pro shop signing u in  monument course is in TERRIBLE shape The pro shop's answer....\"it is going to close soon for overseeding so we don't maintain it as much.\"  This is not posted anywhere and you are charged full green fees.  Nice way to ruin a trip to Scottsdale  Avoid like the plague!"}
{"text":"Golf lessons....   Recently signed up for a clinic at Troon North with Ryan Mahoney.  I was so impressed with his teaching style in the clinic, I signed up for private lessons.   He's a great, skilled instructor (I've tried several!) who has obviously mastered the skill of clear, simple instruction!"}
{"text":"The monument course is the best golf course I have ever played. Amazing views, perfect conditions, well designed, fair, fun...bite the bullet and play this great course. Absolutely promise you won't regret it."}
{"text":"Troon North was a testbed for what 20 years ago played out as a novel idea: A daily fee course that gave the end-user - the player or corporate group - a country club experience for a day. All of the bells and whistles were included: cart, range balls of higher quality, 10 minute tee times, outside service personnel who were attentive and knowledgeable, rangers who were NOT intrusive, food and beverage services that were well above average, 30,000 square feet of clubhouse with all of the amenities found in a private club (even though it was and is a daily fee, they still catered to a very limited number of members, mostly through the Troon corporate shell) and a pro shop that was slammed with high-end hard and soft goods logoed with the Troon North Horned Toad. It was the quintessential desert golf experience this side of Palm Springs and, at the time, had no real rivals.   Fast forward to today: Gone are the $295 advance tee-times; now there is the Monument Express. They have \"created\" an executive course that can be played quite quickly in the afternoons (I remember when, in the summer, they would simply close off tee-times after 12:30). The service is much lower quality as are the course conditions and that certainly is dictated by an economy that has taken a large dump on the golf industry in general. Weiskopf-Morrish designs are brilliant things, multiple tees allow all level of players opportunities to enjoy their courses. And the Pinnacle and Monument courses still stand up from an architectural point of view. But these are no longer days of wine and roses - just look north and east a bit and recognize that what was perhaps AS GOOD a design by Tom Doak at Apache Stronghold in Globe no longer even exists. Executive courses made to be played in a quick time frame, created by sticking tee markers in the ground at various distances and angles is not an indice of great golf.   It's an indicator of: Good Lord, how do we generate more revenue without throwing up the third finger on the downward plunge... Lower pricing for locals not just in low season but in both shoulder and HIGH season may be a way to find that lost revenue stream. Troon Cards are all fine and good. Put the egos away and offer a bit more than what you THINK we should be happy to receive. Offer us actual value and you may find more sustainable revenue generation. A handful of tee-times on Golf Now at an inflated price ain't gunna do it."}
{"text":"This is one of the most beautiful golf courses I've played since Pebble Beach.  Very challenging and the views are outstanding!   The food was tasty as well."}
{"text":"Wow. This course was incredibly beautiful and incredibly difficult. Bring lots of balls if your handicap is above 10. I absolutely loved every minute of it though. The greens were extremely fast but stayed true. They didn't break as much as they looked. I shot an 88 and usually shoot low 80's. The views were breathtaking. Fairways were narrow on most holes. If you have the time and $ I definitely recommend this course!"}
{"text":"Had a group of relatives(15 of us) in town from the east coast . Paid top dollar to play this highly rated coarse. The Ranger was over aggressive to a point of following our foursome. Telling us we were 4 minutes behind at one point, we accommodated him by missing s hole and then playing a scramble format to move things along. Then its 4 minutes behind. He then said we were driving too close to the green on one of the holes. Give it up! Listen, it's a top rated course, we paid up for this place then got an annoying ranger that frankly ruined the exprerience.  This is our annual get together and we play 3 -6 rounds each. There's a lot of courses in AZ, Scottsdale. I can't say we will return to Troon North."}
{"text":"This is a first class facility with excellent service.  I have been to the Dynamite Bar & Grill on several occasions--mostly for lunch.  I have never had a bad experience here.  All of the sandwiches are excellent as well as the salads.   The golf course is always in excellent shape and consistently has the best greens in the valley.  The Staff is very friendly and attentive.  I would say this is probably the best golf experience in the State."}
{"text":"For golf. Great service from bag drop to check in to cart guys to starter to cart guys in the end. I was fortunate enough to have the Head Golf Pro to check me in. Great personality, great service. Starter was very thorough in explaining everything from carts, repairing divots, to pace of play. Pinnacle was a great course, very target oriented with desert and homes framing the course. Hope to be back someday to play the monument course. Lunch at restaurant was good, prime rib French dip could have used a bit more meat to balance the big bread roll."}
{"text":"Went to play a round yesterday at 3:25.... Well, I attempted to. When I got there, I asked the guy in the pro shop if it was crowded - his response was - not at all... couple of twosomes, maybe a threesome but you'll be fine. The first 5 holes were somewhat slow but figured what the heck- it's Troon North. By the time the 5th hole came it was stopped dead due to a group of 5 playing slow because they were behind a group of 6! Never in my 30 years of golf have I seen anything like this. Place was packed. Three groups on one tee. Called the pro shop, same kid answered, had a horrible attitude- didn't really care and told me it was Friday afternoon and it was crowded. Told him about the ridiculously large groups and he said we'll take care of it... I ended up going backwards and playing the same holes I started on... I paid $50 to play 16 holes, the front nine twice. On my way in I passed the same groups on 17. They had joined to be a group of 11, yep that's right 11! They were driving over tee boxes, greens, acting stupid and blasting music. Telling the cart kid what happened- he said - Oh, that was a bachelor party and we kinda expected it... Shame on you Troon North! Shame on you... My advice- go somewhere else and save some money."}
{"text":"Brought a group of 24 experienced golfers to play each course and no one was disappointed.  The staff did an outstanding job in getting everyone to their assigned cart and starting hole.  Each course is fantastic and the restaurant service was very good. Overall a very positive experience for everyone."}
{"text":"i loved it! i played the pinnacle course on tuesday. the price was great the employees were super friendly and the course is probably the best i've played in arizona! ive played tpc and wildfire and a few more in scottsdale, but troon is my new favorite! i am still ranting and raving about my experience there to my co workers, family friends ect. its a pure desert course and about as good as it gets in scottsdale!"}
{"text":"The golf course was in great shape and was beautiful.  The only negative thing I can say is that I left my ray bans in the cart and when I called to get them, somehow they were not found.  It's pretty obvious someone has a new pair of sunglasses"}
{"text":"First, I want to thank the staff at Troon North for being so kind and helpful. From the time I pulled up to the time I left, the staff gave A+ service.   Now for the course. I've been playing golf for 15 years, and Troon North Pennicle course is the best golf course I've ever played. The course was in excellent shape. Yardage markers all over the fairway, which are very helpful. The greens were in excellent shape. Not to fast. But def not slow. The view was amazing. Looking at the beautiful homes, mountains, and city of Scottsdale could not ask for anything better.   The marshall came around 4 time and was very nice. We talked military and life. Great person. I can go on and on. But I just want to thank the staff at Troon North again for making this experience great. Cannot wait to return.  Robert Townsend played 6/10/2014"}
{"text":"these courses are absolute monsters and beautiful too...solid service, practice facilities and the courses are simply amazing.  play them both they are well worth the price of entry."}
{"text":"Troon North is an ideal golf and instruction facility. I have been working with Doug Hammer (Director of Instruction) and he has dramatically improved my swing and overall game play.   The two courses (Pinnacle & Monument) will challenge even the most seasoned professionals and give amateurs a challenging yet fun day of golf."}
{"text":"I'm a caddy at Troon North. Exceptional golf course with the purest greens in AZ. Perfectly maintained and quality layout. Ask me to caddy for you if you get the chance to play here!"}
{"text":"I was excited to see a discount for a 25% coupon by checking in. Unfortunately it was not accepted. The manager said it had expired and wouldn't come out to even look at the Yelp coupon. That was disappointing.  The waitstaff was nice and efficient. Our waiter kept our drinks full and cleared finished plates quickly. The food was delicious"}
{"text":"Troon North is a solid, challenging course. It will eat your lunch. I do like the change they made a few years ago when they flip flopped 9 holes with the other course. So the experience on both 18s (monument is my favorite) is much improved. I have noticed that the houses on the course are multiplying like crazy and it has taken away from the views and the scenery of the course. I used to like it much more from a visual standpoint but the course is a great challenge. T"}
{"text":"Nestled in and around some wonderfully sculpted landscapes, rocks and houses are the Troon North courses.   The courses wind their way up and around some beautiful views and greens.   The Monument course is #1 in AZ and #21 in the USA.   Clubhouse is very comfortable, service friendly and food is pretty good at some very reasonable prices.   I have been around the Monument course once and was at Pinnacle course for a tournament."}
{"text":"Played yesterday with 2 foursomes back to back. Teed off around 11:00 am. The starter said they like to run a 4:20 min round. If that's the goal you may want to book tee times 12+ min apart like We Ko Pa, Wickenburg Ranch and other premier courses in the valley. We quit on 16 after 4:45 min and 2 foursomes waiting on the tee. The course Marshall was out but obviously just for a drive cause he didn't remotely do his job.  The cart girl was parked just short of the 18th green and as we were driving through asked us if we needed anything? Did they train her how the game is played? We hadn't seen her since Hole 8 and it was a solid 100 outside.  Course conditioning was fine but the rest above puts this on the never coming back list for $175."}
{"text":"My girlfriend bought me a round at the Pinnacle Course for my birthday (I don't even want to know what she paid, but it was August so at least it was the summer rate).  This place pretty much ate me for lunch, shot in the low 3 figures but I did birdie the Par 4 6th, so there.  However, it needs to be said, this course is gorgeous and you are treated like a king, which more than makes up for the high score.  The only lowlight were the 4 snooty old women who were behind us and played like their cars were double-parked.  I could go on for hours about these idiots, but who in their right mind plays a course like Troon from the freakin' red tees and constantly tells those in front of them to play faster (when we are keeping up the pace with the group ahead of us), excuse us for wanting to enjoy ourselves.  You may have more money but I still know how to enjoy life and appreciate things as opposed to you old fogies, so deal with it."}
{"text":"Do not plan an outing here!  Set up a 16 man tournament here.  Setting it up was a pleasure and golf course was beautiful.  Only thing is we booked a tee time the day before, missed it because of an emergency and the course had no mercy and charged the entire rate, disappointing since we already were paying for another 16 tee times over the weekend.  Given the cost of tee times I wish they were at least a little flexible.  ruined an otherwise good experience and we will never come back.  Would  recommend grawhawk instead."}
{"text":"There's a reason this course is one of the most sought after golf destinations in the country.  One word... immaculate.  If your a golf nut and like a challenge this is it.  Sure, you may pay a little more but ask your self how much is your time worth.    Sure, I played one day after a heavy rainfall which is ideal for AZ golf because it softens the ground for ideal playing conditions.  Also, this course (pinnacle) is so pristine that I did not see a single brown patch of grass anywhere and that is rare, especially in AZ.  If your coming to Scottsdale for a golf outing make Troon a priority.  You will not be disappointed.    5 stars every time I golf here.  Bucket list item scratched off.  If it's not on your bucket list...add it!  Ps. if your an ok golfer bring a BOX of balls.  You will lose them every time.  But being at this golf resort you will not care much about losing a ball here and there."}
{"text":"Course is 5 stars but fairways are really tight and you need to know where they open up on some holes.   Pace of play is 1 star.  Have never played this course in anything respectable summer or winter.   Condition is 5 stars.  Very well maintained.    Club house is 5 stars.  One of the nicer ones around for sure.    Price is 1 star in the winter.  Ridiculously overpriced in peak season but hey it's not for the locals at that point.  Summer is 5 stars as I played it for $50 the other day."}
{"text":"This club is in horrible condition.  The fairways have large dead spots and play is slow!  Don't let them stick you with the pinnacle course!  Four tees on one tee box."}
{"text":"I decided to pony up and pay the expensive green fee (185) because this course came so highly recommend. I remember playing it a number of years ago, but it had been some time and it all felt very new to me. Anyway...  The course was in great shape and played true to the yardage all day. I was striking the ball really well and the weather was perfect so I had little to complain about, except the greens. Holy moly were they fast and tough to read. Seriously some of the tougher greens I've putted on in a while. Apparently they are about to rip up all the greens and replant. Just an FYI, the monument course is shutting down for the next 3 months so call ahead to confirm.   All in all it was a solid day. The staff was attentive and friendly and made for a five star experience."}
{"text":"Amazing course, top 5 that I have played. I played the Pinnacle course which is the tougher of the two and certainly is hard.  Although I played relatively bad, I shot in the high 80's, it had a blast playing it.  Extremely well kept fairways, bunkers, and greens. The greens where playing a bit slower to my liking, however.  Staff was very nice especially the ranger who stopped by for a chat twice throughout the round.  Scenery was amazing. You feel completely emerged within  the tropical desert theme.  The only thing wrong with the course is that I love so far away, California, that I will only play it once in a blue moon. :("}
{"text":"We just held our wedding at Troon. Honestly, go visit, and just book it - there is no need to look around. It was the most beautiful venue and the staff is absolutely wonderful. The ceremony lawn is gorgeous, the terrace for a sunset cocktail hour doesn't disappoint. The grounds are beautifully maintained and the desert landscape doesn't get any better than at Troon.  Ania, the coordinator and Ari, her captain are 2nd to none. They made our wedding day so special and amazing, I just can't rave enough!  Outstanding!"}
{"text":"The course is beautiful, the pro, starter, bartenders, cart girl, and Everyone at this course went above and beyond, and the food was amazing. Definitely worth the high price."}
{"text":"Great course. Pricy but very good course. Don't bother unless you are quite good and well off. It is pricy."}
{"text":"Great day on the course today. Got out and managed to get around before it got too hot. Troon is well known for taking care of their beautiful courses. I play the country club regularly but this time of year I like to branch out.  Troon north has 2 courses, today we played the Monument. The course is scenic and plays fair. Also a good amount of wildlife including 3 rattlesnakes we saw today. In general I would always recommend having a club in your hand if walking through the desert. Plenty of snakes around.  Two reasons for not giving 5 stars today. First, when I made the reservation there was no mention that the greens had been punched the day before. We tried to switch to the other course as soon as we found out but there were no openings. Second, was the poor state of the driving range. I understand that it's hard to keep the grass looking good but it was hard to find anything green where it was set up today.  Overall the is a great course in a city of great course. Will be back for sure."}
{"text":"From the clubhouse, to the driving range, to the staff, to the course, I have not played many courses any better than Troon North.  I absolutely loved it.  I played the Pinnacle course, and every hole was amazing.  I would say that a very high handicapper would not enjoy this course as almost every hole you must drive over some portion of desert just to get to the fairway.  Many holes had unbelievable views of the valley and the course was in amazing condition, especially for the extremely hot August that the area had just experienced.  In my mind, this is a must play if you are in the area."}
{"text":"Absolutely amazing golf course. Having played all over the world, this is one of the top courses I have played. The condition of the course was impeccable; the staff was very professional and courteous. It blows my mind how a course practically in the middle of the desert can be so green and beautiful. What a wonderful experience! On top of that we got to play for $80, and despite it being July the heat was manageable. Highly recommended!"}
{"text":"These courses are great, sadly I am not.  We had a nice golf package through the Four Seasons and played both courses.  First up was the Pinnacle course.  My wife and I are a couple of hackers and got paired up with a scratch golfer that played in college.  Wow, this dude was putting for birdie on like every hole!  Is that the way you play this game?  The Pinnacle was so tough.  Even the forward tees required a long carry to reach the fairways and then you had to typically clear trouble on your approach.  It was really tough, but it sure was beautiful and well maintained.  We even saw a rattlesnake on one of the greens.  The Monument course was a bit easier, but just as nice.  They sure could have loaded up the carts with bottled water for what you pay to play here."}
{"text":"In reviewing Troon North Dynamite Grill, you have to ask is it a bar with many food options or a restaurant with limited food? Your perspective on that may influence your feelings about the place. The grille itself is rather small given the two golf courses as well as the numerous surrounding  homes of North Scottsdale. The bar is well stocked with a few local craft beers in addition to the other usual offerings. The bartenders are friendly and always make you feel welcome. The food menu is limited to appetizers and a couple of entrees. I suspect if they offered more options the dinner crowd would grow. Until then they seem content to host just the golfers describing their rounds, shot by shot!"}
{"text":"Top notch golf course and top notch staff great people all around especially Mike Friend and Steve Leon great bunch of guys"}
{"text":"Gorgeous course. Outstanding views of the city. Some high points with great viewpoints. Its tough to play, but well worth the time. The greens were perfect. Everyone at the course was so nice. This place needs to be on your list of places to golf. Its that good."}
{"text":"Played on Easter weekend.    Two golf courses with a great practice area, both the driving range as well as a large area for chipping.  The course is in great shape, though the greens were a bit on the slow side.  Frequent stops by the beverage cart, and pace of play was around 4 hours - 15 minutes, so very good by public course standards.  I'm a single digit handicap player and played from the Gold tees, which are a pretty good test.  It's a very tight course, so keep that in mind when choosing tees.  Careful going off the fairway to look for balls, we spotted rattlesnakes on two holes.  Overall, a good track, though on the pricey side ($200 on a weekend).  It is one of the better courses in the area, just not sure it's worth the extra $$$ (played a few other tracks for about half the price...all were very nice, though I admit Troon North has an edge)."}
{"text":"Played the Monument Course and it was a blast.  The course overall was in great condition.  Coolest hole was #3 \"The Monument.\""}
{"text":"One of the most difficult things about playing golf at the Monument Course is all the distractions from nature and the way that Tom Weiskopf has rearranged the thousands of huge boulders to create a masterpiece of desert golf.     The only downside is that everyone wants to play here. On a Friday morning, we had a 6:30 tee time and were the first group off. The managers decided to double book the tee sheet because there was also a big tournament starting at noon.    We made great time, the course was in pristine condition, and everybody was enjoying themselves when we ran into the extra bookers on hole #11. This group was staffed with some serious duffers and our pace of play came to a screeching stall.     There are many classic short par fours here that are designed to eat your lunch. They are short but so deceptively difficult. The par fives seemed easy and were reached in regulation. The drivable par four, Canyon Pass is 283 yards from the gold tee box. The tee is elevated high above a tiny green in a bowl surrounded by boulder outcroppings on both sides. Neither gold tee golfer came close, they both wound up in the left desert.    The #16 hole Lone Mountain is way over 100 feet above the green. The distance from the copper tees is 213 yards and most of this is carry.    The greens are putting true but you can be easily tricked into giving away the hole. They are set to be replaced this year because of some poa annua infestation. This morning they were rolling.    What an impressive golf course, this is my favorite in Phoenix so far."}
{"text":"Beautiful view, good food , particularly the burger! We will be back! I don't know what more to say, good food and prices"}
{"text":"Exceptional desert golf experience.  If you never have played a desert course this is top notch.  Come to this course you will feel like a pro.  When you step on this property they got you covered till your wheels roll off it!  Wonderful course with some stellar views.  Thanks to all the exceptional staff for a great experience, I can't wait to return!!"}
{"text":"Attended a very nice wedding ceremony/reception here and enjoyed it. The ceremony was in a grassy clearing, and while it was in the evening and in the fall, I still would have liked more shade from the hot sun. And there was a glitch with the speaker system during the ceremony.  The reception was well done, except for the food coming out too slowly. But the food was very good, the sunset on the verandah was a great touch, and the dinner set up very functional. Speaking of functional, my dress shirt was not, but the helpful guy in the pro shop came up with some string for me to fix it.  Directions - go north, go really, really, far north, then keep going. After a long time, go west for a while, then it's on the right."}
{"text":"This review is for the Monument course.   First the negatives -Greens were slower than I hoped for. Hopefully this is seasonal thing that when the hot season is over the green will get faster.   -There are too many homes too close to the course.   Now the positives -Everything else was perfect, deserves 5 stars despite the negatives."}
{"text":"Played at a charity event enduring 40 mph wind gusts which taints this review and clouded views of the valley. Course is a LONG way from most of the valley and about 10 degrees cooler so winter visitors would be better off going to Gold Canyon. Pace of play bogged down on the back even tho we were playing a scramble. Greens were not as great as described by other reviewers; many unrepaired ball marks caused some bouncy rolls. Pinnacle course does not return to the clubhouse at midpoint and had us looking for a restroom LONG before one appeared after hole 14; read that as the course is not \"friendly\" to seniors, women, and beer drinkers who tried to seek a bush not visible from homes surrounding every tee, fairway and green! You will undoubtedly need food before and after the 4.5 hour round and find satisfactory sustenance at the Dynamite grill. Overall, one and done for me."}
{"text":"Easily one of my favorite golf courses in Arizona, Troon North is a blast.  The course is modern, well designed, and well kept.  I've played in several charity tournaments here and personal rounds of golf with friends and colleagues.  The Monument Course is my fav of the two.  Very picturesque and full of wildlife.  We've seen rattlesnakes, hawks, rabbits, coyotes, roadrunners, various types of birds, and bobcats while on the golf course....amazing!  The clubhouse meeting room is kind of small though.  Post tournament lunches and ceremonies are kind of cramped.  Parking can get tight if the tournament is large and well attended, so get there early if you're playing in a tourney.  In the summertime, it's blazing hot and it's a desert course, so not much shade to cool off at on the tee box.  Staff here is always friendly and professional.  Return Factor - 90%"}
{"text":"I played the Pinnacle course this morning in 4:20 minutes.  Everyone was really nice- from the pro shop, the bag handlers, to the starter. Hey Even the ranger was NICE! Haha.   The course condition was the BEST.  The rough was perfect. Bunkers raked and clean. Fairways tight. Greens were receptive. (Pull the ball back. Zip) and the greens were very quick. (10+. Maybe 11+?)  All in alll. A really great round of golf."}
{"text":"Outstanding course and for the most part was in great shape until we reached the back nine. The greens had two different types of grass growing which made putting somewhat challenging. Other than this, awesome views and the staff were great."}
{"text":"This may be one of the best courses I have ever played in the world.  We played the monument course which was in excellent shape and every hole offered something different, both challenging but not too hard to play fo a 10 handicap golfer.   The course is surrounded by desert and huge homes but really the course design is what sets this place apart.  The practice facility is included with your greens fees and everything is run top notch."}
{"text":"4 1/2 stars.This Troon Golf resort was rated by Golf Digest in the top 75 resorts in the north America in 2009 and is next to the Four Seasons Resort. The club has 36 holes of golf. The Pinnacle and the Monument. The current rack rate is Monday - Thursday is $175.00  & Friday to Sunday  $220.00 per round. These rates included range balls.  We played the Pinnacle course today and the service here was good but then again what would you expect from Troon golf management?  The Pinnacle course is very scenic although last time I played it there wasn't fairways lined with multi million dollar mansions. This is a con in my opinion and takes away from the beauty of the natural desert surroundings. Play from five different tee box locations to fit your handicap. The group in front of us was playing from the back tees and some of them could not hit the fairway on their tee shot - this is a real negative and slows down the play. During the whole round I didn't see one Marshall on the course!   The course is in good shape and the greens are fast and undulating. Not much water here except for one hole I recall. Miss the fairway on this course and kiss your ball goodbye here! The sand traps here are deep and ch alleging but in great condition.   Some of the cons here are the carts have no GPS and there aren't many yardage markers on the fairways. Another con was the men's locker room was dated and needs remodeling.  The Troon North Pinnacle course is in my top five of best courses I've played but then again for the money your putting out it should be outstanding."}
{"text":"I have played here several times now and Troon North never disappoints!  The course is always in fantastic condition.  The staff is always very friendly and provide prompt service.  The course is definitely worth the price in my opinion!  I will be back every time my travels bring me to Phoenix!"}
{"text":"Best public course in the valley. I live right next to the course so I try to make it here at least once a month. After you get used to coming here it's tough to go anywhere else. The views are just phenomenal and the course plays so well"}
{"text":"This review is for the golf course only. Played 18 here on the monument course.   Course is beautiful. It cuts through the desert and rocks. There are a lot of homes on it. I thought it was going to be less, but most homes are pretty nice and it's something cool besides the scenery to look at.   Greens were very nice. Rolled very true. Cart gps system was very up to date and very helpful.   Staff was friendly.   My tip...don't even bring the driver to the course. Plays short. Not target golf, but long iron to 3 wood is what you need. Keep in on the grass...if not, you're in trouble."}
{"text":"Amazing place. Doug and his staff are amazing. They treat you like family? from the minute you walk in the door. It's a great place to visit and food is excellent as well. Highly recommend and cannot wait until we come back. Thanks for everything Doug."}
{"text":"I'd like to start with a bit of context. I have lives in North Scottsdale, have been an avid golfer for 27 years, and have played Troon courses ~25-40 times. The 3 guests I brought Friday were all from out of town and naive to Troon North.   I'd like to share with you that Friday's round was unenjoyable, frustrating and fell far short of the expectations associated with the cost of a premier experience. The reason for this, which also led to our round being cut short, was the total failure of the staff to regulate pace of play. We played the front nine in over 2 hours and 40 minutes (a 5.5 hour pace) because we waited on every shot for the 2 slow groups ahead. The course was far from sold out; the 2 groups ahead were simply allowed to play at this pace. Additionally, we never had the opportunity to voice our concerns to the Marshall as he never stopped during our round to ask about the experience or provide updates as to why the delay. Ultimately, we ended up skipping 3 holes just to leapfrog the 2 groups. The course was wide open in front of them; empirically proving the entire delay was due to their painfully slow pace. The group behind us gave up all together and quit after ~12 holes.   Premium-priced golf offerings are abundant in Scottsdale and the experience is what motivates customers to return. After Friday's round, it would be difficult for me to recommend the option to others. However, the email to management has been responded to and handled in the proper manner of a course of this magnitude.   The course is beautiful and is a must see when visiting the Scottsdale Area."}
{"text":"Troon North: Pinnacle Round played: 06/14/17 @ 6:30AM Price: $112 per person \"Pure. Desert. Classic.\"  Troon North Golf Club was the third and final round for our most recent golfing trip. We were actually supposed to just hang out on this last day but with all the online golf reviews raving about Troon North, we decided we weren't going to leave Scottsdale without giving it a shot. Troon North actually has two golf courses, but Monument was currently closed down for maintenance.  Just like all the other Scottsdale golf courses we played on this past trip, the setup is basically standard. Drop your bag at the bag drop area and have the guys load up your cart. Check in and head over to their complimentary driving range/putting green and warm up until they call you to head over to the first tee box. FYI, we saw mainly Callaway club rentals here.  Because we were the first group scheduled for the day and we got there with ample of time, the starter allowed us to get out even earlier which was perfect. The weather was going to peak at around 115 degree by the afternoon so we wanted to get off the golf course ASAP. The golf carts are loaded with GPS but surprisingly, it doesn't keep score for you. The first tee box had plenty of complimentary Troon North wooden tees and pencils/scorecard.  Troon North was exactly what I envisioned Arizona desert golf to be. This was the most precision, target golf course on our list. Plenty of desert type environment, plants/cactus, wildlife, huge rock formations, and beautiful homes lined up against narrow fairways. Bunkers are plentiful and always strategically positioned. When and if you venture into the desert because of your errant golf shot, be careful for spikey cactus and potential rattlers. I donated a couple golf balls to the Troon North's golf gods but they did reward me back with a few Pro V-1s and a single Kirkland Signature ball that I found. My buddy on the other hand depleted much of his golf ball stash and almost had to start borrowing from me. Doesn't that incur a penalty of some sort? LoL ;)  Although, you have to bring your precision, laser-guided golf skills to Troon North, I found the golf course to be pleasantly pleasing to the eyes. I truly felt like I was on an Arizona desert type golf course and could not help soak up the beauty of the landscape. The golf course itself was in great shape. The starter did warn us that the sprinklers may still be on some holes and/or it may still be wet from the watering. Because of this, the course was still pretty green on this day. Troon North is definitely no easy feat. If you tend to slice, hook, or shank, you may want to load up your bag with an ample amount of golf balls.   The staff was friendly and helpful. The course was in great condition. The greens were semi fast at first and started rolling pretty well later as the day got hotter. The memories and pictures we came home with are amazing. The pride was a bit shot but I would still definitely come back to Troon North especially to try out Monument course."}
{"text":"The Monument course is fun to play but could find no where on the net where you could book a reservation. There are two courses at Troon North (Pinnacle and Monument). We had to call the pro shop in order to book a tee time for the Monument. Their own website doesn't allow course choice! This was pretty inconvenient when trying to arrange a week of golf at various courses at night."}
{"text":"Very nice place, the food was a bit expensive for the quality.  The staff was excellent and very professional.  The facilities were very nice and the views were amazing!!  The golf course was excellent and a lot of fun!  Arizona is an amazing place to visit with a lot to offer, thank you Troon for an amazing time!"}
{"text":"Played the Monument course on 7/15 at 6:41. First off, we got a great value by playing in the middle of summer. Rates were $69 a round. We showed up and our bags were taken and placed on the carts. Service was great and everyone was friendly. The practice facility was really nice. Right away, we knew we were in for a good round. Once our tee time arrived, a guy escorted us to the first tee and explained everything. I was s tad disappointed that the carts were not equiped with GPS. However they did have yardage sheets for every hole and the course was decently marked. The course was in great conditions. Fairways were nice and green. Hardly any burnout areas. Rough was short and bunkers great. Te layout was nice too. There was water at every other hole. And we saw the cart lady quite often. The marshall was seen after 8am and a great  job regulating. All in all, a really nice course and great value."}
{"text":"Played the Monument course. A very nice golf course with gorgeous scenic views.  It is difficult in that you must place your shots strategically.  Hooks and slices will not work out well. Bathrooms on the course are very nice."}
{"text":"I've played some tough courses, Trump (CA) and Pelican but this course takes the cake!!!! Holy crap what a tough layout.  Beautiful and clean, greens fast, true and fun but if your handicap is high, stay away...it will make you quiet the game of golf! Great club house and amazing course"}
{"text":"What an absolutely stunning golf course. Admittedly, I haven't played many rounds of golf on upper-echelon golf courses like this one, but I will happily and confidently put this one up against any of them.  The views alone from hole to hole are breathtaking. The combination of mountains and desert vistas with the almost emerald glow of the fairways and greens makes it almost difficult to concentrate on the task at hand.   This is why no one on the golf course is in a hurry. Many of the tee boxes act as pedestals for golfers to take in the incredible views. Sometimes you just need to take a moment to appreciate where you are and what is around you. This is perfection.  From tee box to green, you would have thought we were the first to ever play the course. It was in absolute immaculate condition. While there isn't much room off the fairways, the fairways themselves are fair and allow for different club selections off the tee. The bunkers are soft and deep. The greens can be tricky but they roll true and aren't too fast or hard that a good approach shot won't bounce or roll off. This is a course maintained at a PGA TOUR level, but still fair enough for the rest of us to enjoy playing.  This is the best golf course I have ever played. And although I still have a few courses to cross off my bucket list, this may very well end up being the best golf course I ever play.  Also, make sure you make some time for Dynamite Grill. Maybe have your significant others join you for dinner after the round. Order the Kobe beef sliders, a basket of their amazing fries, and a round of cocktails. Then sit outside on the patio and watch golfers finish their rounds on that beautiful 18th hole."}
{"text":"Great golf course and challenging. Bring your \"A\" game"}
{"text":"Once upon a time, when in high school, I was a hell of a golfer. I played multiple times daily, and could shoot high 60's low 70's on a regular basis. Well, those days are long gone and I only get out once every 3-4 months or so. I don't mind paying a lot to play a nice course because I hardly ever play. Monday was about my 15th trip to Troon North, and it has been spectacular every time until now.   It is absolutely obvious that they are hurting. In December, on a nice day, they had 17 tee times, ouch! Because of a lower amount of play, they aren't spending as much on maintenance and are not manicuring the golf course like they have in winters past. Patchy grass, sandy greens, long fairways, etc. They are playing 90 degrees now, which is something they NEVER do in the winter. It has always been cart path only from October to May to preserve the grass. Well, if the grass isn't as expensive, you don't have to be so hard up to preserve it.   It's still three stars because it is an amazing track, has beautiful views, and is a great facility. The service is always nice enough, but never the same quality of Grayhawk, Talking Stick, or any other top tier courses. The gorgeous cart girl on the front side brought us half price Miller Lite and amazingly I had 4 beers for $12 including tip. That is pretty penomonal for a golf course. The chicken salad wrap was the most dried out, crumbly, piece of junk sandwich I've ever had, and was $8 :-(  Hopefully the economy picks up soon and they can get back to being the 5 star experience they have been every time I have been there before now. Here is to hoping.   P.S. shooting a 91 is pretty painful for someone who used to be 20 strokes better than that. Troon brings out your highest scores, no matter what."}
{"text":"This is where our Arizona Troon golf card saved us a  bundle of money.  We purchased the four players card as we were in Scottsdale for a week of golf.    We looked at Troon tee time website, and found Troon North was available daily.  We booked tee time 3 days in advance.  Temperature was over 100 every day so we booked tee times at 6:40am. the first time and 6:35am the second time.  The first time we played it was a Friday.  My sis & I both felt the other players were stick in the mud.  Not friendly at all.  And no other women.  We're thinking it's gonna be that kind of a day.  Not to fear, no drama.  We played the Monument course the first time.  Difficult course but lots of fun.  The second time we played Pinnacle.  We came on a Tuesday.  Friendlier crowd.  And other women!!!  Of the two courses, we thought Pinnacle the more difficult.  Challenging of the mind for sure.  We loved the boulders, the rocks, the cacti.  Everything was perfect.  The pro shop was super friendly.  The 19th hole was great too.  Where else can you get a huge basket of fries for only $5.00???"}
{"text":"Have to say, probably the most beautiful course I've played. Not as difficult as I had thought it was going to be but not at all easy by any standards. It's amazing how much easier this game is when you hit fairways off the tee box! Great pace of play, I never saw anyone ahead if us and no one behind us pushing even though I know there were groups surrounding us.  One older gentleman told us at We-Ko-Pa, \"I golfed Troon before they built all the houses. It was ten times more amazing then.\" My friend, if you ever read this, yeah. I see it. Still gorgeous now though. A definite must play in the Scottsdale area."}
{"text":"Beautiful golf course! Glad I live only 5 minutes from here.   When you're not stuck outside playing golf in the great scenery, you can hop right inside to the Dynamite Grille that offers amazing food.   This course may be a bit pricey but after reading all the other reviews, it seems like it's worth your time and money!"}
{"text":"Played the Monument Course on 12/7/17. Monument course completed an enhancement project that resulted in new bentgrass greens, new bunkers, etc. Pinnacle to be done next summer. New greens putt perfect and course was in great shape. Personal favorite holes on Monument include 3, 15, 16 and 18. TN is consistently ranked at the top of AZ must plays. Golfweek has both in Top 100 for '18"}
{"text":"This course has the best greens in the valley!  I just played in the middle of July and could not believe how soft the greens were!  I was actually making ball marks and sticking my shots, something I haven't done playing in Arizona since March.  Also, I am a terrible putter, but I putt better on these greens than anywhere, they must be doing something right."}
{"text":"This place rocks! We played both 18s in one day and this was our groups favorite course by far. Nothing against the other courses in the area but Troon north had the best kept fairways and greens. And the way the course was setup was just awesome and fun."}
{"text":"Love Troon! Troon and The Boulders are my top 2 favorite courses in Arizona. Highly recommended. Not cheap, but worth it once you're out on the course. Very well maintained and just downright gorgeous. Awesome desert views and vibrant green fairways and greens. The entire staff is so nice too! Everyone seemed to really enjoy working there and were happy people. Always a plus in my book when you receive great service. I am looking forward to my next round at Troon!"}
{"text":"Great course, had some ruff spots in a few fairways but would be expected in September. Would play again and recommend."}
{"text":"A religious experience for me, a life-long avid golfer.  Gorgeous layout, immaculate conditions and a staff (pro shop, starter, rangers) who take pride in their slice of heaven.  BY FAR the best experience of the three courses we played last week.  Also played We Ko Pa and Grayhawk.   We Ko Pa had ZERO ranger presence and you couldn't find a cart girl with a GPS.  A 5+ hour round that was nothing short of a rip-off for the $250 we paid.  Grayhawk was somewhere in between, in my opinion.  If you have time to play just one round of golf when you are near Scottsdale then go to Troon North."}
{"text":"This review is for Troon as a venue and not for the golf course.  First, the venue is beautiful. Desert setting at sunset is magnificent. Service during cocktail hour was outstanding.  After the brief golf course ceremony we were instructed to the terrace for cocktail hour. Since this venue is in the boondocks we opted for nonalcoholic bevs. My cola was served in wine glass but yet my father got his soda served in a beer glass.  Passed hor d'oerves were excellent and made us excited for dinner.  Mini prime rib sliders with fries were great. Watching the sun set was spectacular.  Ushered into the ballroom to start dinner.  Salad course served was really good with a perfect crouton and a tangy vinegar based dressing.  Refreshing berries in white wine for intermezzo was amazing. Would have been a 5 star review with just the salad and berries.  This is where the positives end. Entrees took fffffffooooorrrrrreeeeevvvveeerrrrrr after intermezzo course. My beef even though plated beautifully did not get eaten. Steak was overcooked and after two slices had a large piece of gristle throughout the rest of the piece. My husbands steak very rare, my fathers medium, no consistency on the cooking. Wheat Roll was hard and stale like. Everyone at our table had a different type, sourdough, wheat, white, poppyseed, again no consistency and I would have preferred sourdough. Mashed potatoes were ok but had some sort of teriyaki or Asian style tasting glaze. Green beans standard frozen variety that I would have preferred to be cooked just a hair longer. My water ran dry and I had to take one from one of the place settings from a no show at our table.  Overall it was a beautiful wedding but the ballroom is a little dated and the food just didn't live up to Troon standards, or maybe this was their standard fare. For the reputation and cost I expected a little more."}
