{"text":"This is my first time here, and I ordered the azuki whipped matcha latte and the tsujiri parfait. The matcha flavor is wonderful, and I appreciate very much how carefully crafted the items were. You can actually expect your order to look similar to the photo. The staff was very friendly, polite, and patient, and I feel like they really take pride in their menu. I loved my experience here, and I wish that we had one of these shops closer to where I live. Well done, Tsujiri!"}
{"text":"Does not close at 10:30 pm. When we asked they says it varies. Generally it's empty at the store maybe they need to update their information so people know when it's open"}
{"text":"Let's say I'm a sucker for all things matcha, so I am thrilled to see it open a franchise in the heart of Mississauga.

In terms of their green tea soft serve, 5 stars, as you can really taste the strength and bitterness of the matcha in a delicately smooth and creamy consistency. 

However, this review is only 4 stars as I found their desserts disappointing, which I have ranked in order from best to worse (in my opinion):

Matcha Cookie Puff ($3): Despite this being the cheapest of the desserts, I thought the green tea soft serve paired best with a savoury doughy exterior. The downfall was you craved more of the interior than the exterior, which was nothing to take home about.

Matcha Daifuku ($5): A true disappointment as I'm generally a mochi fan. This was super bitter (even though I like bitter matcha) because of the thin layer of the mochi and the generous dusting of matcha powder on an already strong matcha soft serve. Essentially it is bitter on bitter.

Matcha Rare Cake ($5.75): You expect a lot out of the visuals and price, only to have it fall short below expectations. Personally the cheese and matcha layers were very odd when you ate it together! I would have preferred it separately, as the cheesecake layer and matcha layer tasted great separately on its own. But together it was a weird bitter cheesy taste that was surprisingly a bad combination. 

Consensus: Come here to indulge in just the pure, unadultered matcha soft serve or drinks. Avoid the desserts, but if you have to try one, the puff seems best."}
{"text":"I haven't been to this location since it opened due to the long, never-ending lines - so it was just my luck that there were no lines when my friend and I went last weekend!

After much debate and internal struggle (it's difficult to balance what you truly want with the price and the money you have in your wallet, especially since prices here are on the high end), I ended up selecting the ice blended matcha. I also bought my friend a matcha vanilla swirl (she's a beginner to matcha and so wanted the lighter flavour).

I completely forgot to ask for less sugar in the matcha ice, and so I found it slightly too sweet. That said, it was a very refreshing drink! My only complaint is that it was quite small for the price. I also sampled some of their lattes (matcha and houjicha) and would appreciate if they were less sweet as well... I guess I have a low sugar tolerance! My friend's ice cream was of a decent size and very creamy! She was very happy that she chose the swirl; I believe she found it slightly on the rich side."}
{"text":"Was there last week after I heard the news about it opening. Its a tiny place with 1 table inside in the corner to sit. This place alwyas has a long lineup but service is fast and the wait time is not too bad. I got the matcha ice blended which was good but I preferred the matcha shaved ice since theres more to it than just ice n matcha. But it still was good and I would go there again."}
{"text":"Love this Tsujiri location. They have super friendly staff that are very attentive to you and they let you know right away if something is out of stock! It's always a lovely treat to walk around the mall with too!"}
{"text":"I'm a huge matcha fan and it doesn't get better than Tsujiri. I'm glad they finally opened up another location in the GTA.

Whether it's their drinks, soft serve, or their pastries, everything is quality and totally worth the money. There have been a few competitors but nobody comes close to Tsujiri's quality. 

It's a lot more than an ice cream shop and certainly not a bubble tea shop. Tsujiri is a category of its own. I came by and they now have something called Au Lait. It's similar to a latte but at a lower price point. You can get it paired with their new pastry series: match dorayaki and pound cake slices. It's the perfect coffee replacement.

Their soft serve is already super famous so nothing more I need to say. I really encourage people to try their other products, especially their drinks. It's addictive and much healthier than coffee. It's certainly going to cost you more than Tim Hortons but it's totally worth it if you care about quality."}
{"text":"There's lineups on weekends and holidays but the staff remains pleasant in spite of the waves of people. Tsujiri offers so many variations of matcha soft serve \"sundaes\", matcha beverages and matcha cakes. If matcha is your thing, this is the place. If you've never tried matcha, it's recommended you start with the matcha vanilla twist. There's just enough sweetness from the vanilla soft serve to compliment the matcha for the uninitiated."}
{"text":"This place is amazing! Even if it a more take-out style, the ladies there are always so sweet! 

A little on the pricer side, but it is worth. I usually get the double fromage cheesecake (AHMAZING) and the yuzu tart. The yuzu tart is so creamy, and crispy and citrus-y. I am drooling just thinking about it. 

I've been to the Toronto location and they have the this brown tea ice-cream there (forgot the name, sorry), and I prefer that to the matcha. But this location does not carry this flavour."}
{"text":"Mississauga, time to rejoice! Tsujiri is here and what a treat is it to have it in Square One. Tsujiri's signature teas are powerful and aromatic, and true to Japanese style, everything is subtly yet perfectly sweet.

We came here on numerous occasions in the evening and despite being in the Square One mall, it's nice to know Tsujiri opens late so you can still get those soft serves after dinner or warm drinks in the winter! (It's never too cold for ice cream).

The tsujiri latte was the perfect balance of creamy and their deeply powerful matcha. You could almost say it's bitter, but it's actually rich and flavorful. What I liked the most was just how hot the drink was, which was absolutely perfect on a cold winter night. 

Likewise their famous soft serve ice cream is always a delight; incredibly smooth and moist ice cream. Their matcha soft serve can't be beat. Try their cone for some added sweetness and crispiness. The matcha ice cream goes down all the way to the bottom of the cone, to the last bite.

The cold yuzu tea was incredibly refreshing and quenches any thirst. Perfect for those long shopping sessions without feeling the need to be guilty of consuming an extra sugary drink."}
{"text":"If you are looking for strong flavour, go to other places. 
The matcha was alright. 
Some people say it's bitter, I had authentic matcha in Japan, it's supposed to be bitter. But honestly, the matcha here is just okay. The only reason it's busy is because there are not many other options to choose. When a thing is rare, it becomes precious. 
I ordered the one with a cake on top. It was 8 dollars I think. Not cheap,  but the whole thing tasted like water except for the cake was a little sweet. Matcha ice cream looked nicely as green matcha but not much flavoured. And they worked very slowly. That was a weekday afternoon. We were the only customer at that time. I was disappointed. I would never go back."}
{"text":"Believe the hype if you're serious about your matcha. 

No line, but no real sit down with the exception of a few benches. That's your trade off from the TO location. 

While most of the pastries were gone at my visit, all I wanted was a good matcha ice cream. I had a vanilla twist to share with a child expanding their palette. 

I've had my fair share of matcha ice creams and can tell that this one has solid taste. The sweetness doesn't over power the matcha flavour, and the matcha used in the ice cream is mellower in its \"floral\" taste. It was kind of like the orange pekoe of matcha. The soft serve was rich, creamy, and smooth. Less water content in soft serve is optimal for smoothness. 

The Sakura cookie was a basic sugar cookie with a salted and dried cherry blossom in the middle. It was small, but tasty! The cherry blossom middle was a surprising bite.  

I'll be back to try the drinks and the pastries. 

Awesome, kind service as well. The folks behind the counter were kind to the kids and served with a genuine smile and hope that we enjoyed the food."}
{"text":"I've heard good things about this matcha place so I was very excited to find out that they have a location in square one. I've been to square one many times but didn't know this place even existed. It was on the lower floor, tucked away in a quiet corner. 

The store was a clean, quiet place with a few benches to sit on, but quite difficult to find anywhere with a table to eat at in the area. 

The cashier was helpful and friendly, guiding me to choose the ice cream, as it wasn't clear to me what the ingredients and components of each ice cream was. 

I chose the ice cream with the mochi balls and red beans. It was very good! Not too overwhelmingly sweet and refreshing for an after meal dessert. Overall very positive impression. Just wished there were more places so I can sit and enjoy the ice cream."}
{"text":"Love this place, so thrilled that this location - sans line too! - opened up in the mall.

When I went, Chatime/Tim Horton's on either side of Tsujiri had long ass line-ups.  Tsujiri?  Empty.  I think it's 'cause most 'burbanites still don't know about this place, so I hope the secret doesn't let out!  Sorry guys.

Sure, green tea soft serve is $5.75 small, but I'd much rather get this than Eva's Chimney.  Small is shareable between 2ppl, soft serve is quality stuff, not too sweet, and waffle cone is nice and crispy.

I'd much prefer the drinks here than Chatime, Starbucks, or any other coffee chain!  Here's to no-line whenever I go..."}
{"text":"Got the machi flavored slushy w the ice cream on top. Tasted okay, it's not very sweet, which isn't a bad thing. The service is excellent though. Cost around $7 so a little pricey. Interior is very nice and clean."}
{"text":"When I saw long lines at Chatime, I decided to try Tsujiri next door. Due to my less than stellar experience at Tsujiri's downtown location, I wasn't expecting much. I just wanted a cold tea to drink. So, I tried Yuzu Houjicha this time, and it was okay. The blend of sweet yuzu taste and somewhat bitter green tea made it a unique drink. There are pieces of yuzu in the drink. Despite lack of crowds, I waited long to order and eventually got my drink."}
{"text":"3.5 stars... growing pains knock this down a bit.

A Mississauga outpost of the very busy and popular Tsujiri just opened up in Square One.  I'm so used to seeing the line ups out the door in Toronto that I dont even bother trying.  Here, this store was empty and the line up was for the Tim Horton's next door.

This little store is clean with no seating ... though there is some shared hallway tables for the nearby Chatime & Timmy's.  With it's 2nd day of opening, it's still feeling some growing pains and thats why it's not a 4 star.  I first ordered a specific drink on the menu and the nice lady told me it's not available because it has a bowl and there's no seating.  Oh ... ok.  Then I ordered the Matcha Maple Latte with soya milk.  After some searching in the fridges, they came back to say there's no soya milk... oh ok?  So I ended up with a Match Maple Latte with lactose free milk and 2 daifuku's to enjoy later.

Before going into the review about food & drink... I'll say that it is definitely more expensive.  The drink was over $7 and the daifuku were $5 each.  So a simple snack was easily towards $20.  Pricey... definitely.

Matcha Maple Latte - So I know Tsujiri claim is to use ceremonial green tea grade... so it has a natural bitterness that is unique to lower grades.  You can definitely taste the difference in the latte ... it is bitter but it has a nice vegetal note to it and with the maple, it is lightly sweetened to temper it.  Would I say that it's one of the best tea's Ive had in Toronto... hm, maybe not especially at $7 for a medium size.  3.5/5

Matcha Daifuku - I love mochi and this particular one was the size of a hardball!  For $5, it is probably the most expensive mochi I've bought in Toronto.  I did find the mochi skin to be tender & soft.. really lovely.  The cream inside was a vibrant deep green cream inside.  The matcha was really prominent in the super light whipped cream.  I would tell anyone if you're expecting a sweet treat... don't get this one.  It's quite strongly matcha with no sweetness.  3.5/5

Kinako Daifuku - Like the Matcha, this one was $5 for a large size.  I actually preferred the Kinako more as it was a nuttier note from the roasting and it was an unique flavour.  This had a lighter sweetness and more enjoyable than the matcha.  4/5

Overall, I think this is a nice option for anyone in the GTA west who didnt want to trek downtown and wait in line.  I honestly had the entire store to myself... zero waits.  Just be careful with your selection if you're not too picky on overspending and you'll find some nice tastes."}
{"text":"Finally a Tsujiri close by! Don't have to go all the way downtown Toronto, when im craving. Plus there is no line up. The items are more on the expensive side but good quality matcha. I had the green tea parfait & it had a strong matcha flavour paired with red beans. I would definitely come back and try their matcha drinks."}
{"text":"Start off with saying quality of food is good. Similar to the flagship in Toronto , however the location is smaller and appears to not handle volume as well. Waited for 30 to 35 minutes in total. The main concern is logistics we had are  the store supposedly ran out of Matcha ice cream. We were not made aware in the lineup process until purchasing. Understandable. However when people before you are still getting Matcha ice cream dispensed it makes me wonder if the Matcha ice cream is out - then stop serving it as the remainder of the consumers will feel cheated. The cashier kept saying the Matcha machine is broken...when it clearly was not. An explanation should be made to the line and an adequate supply of ice cream should be ensured moving onward. I was disappointed in my shaved ice as it compromised the taste I originally wanted and since I had already lined up for 35 minutes, I did not want to leave empty handed. The Toronto location usually will post stickers to show which items are sold out. 

I hope you improve based on these comments as I do value the quality of food Tsujiri provides as a long term and loyal customer."}
{"text":"This review is for Tsujiri Square One , i am reposting my review and pictures   since it got merged with  some other place created by someone that is not called Tsujiri Square 0ne.. Now onto the review..
The wait is finally over. . Tsujiri  has finally arrived at square one mall. I went for  the matcha  sundae.  This is the item to try whenever you go here. The sundae is a blend of red bean paste layered over rice and topped with a smooth rich matcha soft serve .  I'll be back to try more signature items and enjoy the foodie journies.
My recommendation is to get the Tsujiri Sundae, chiffon cake sundae and the shiritama  sundae"}
{"text":"Got my hands on their new opera cake! My friend and I were excited to try this one.. apparently it's their newer cakes. They didn't have any till around noon on their grand opening date so we waited and walked around the mall till then. I had the cake when I got home and it was so good and had so much matcha flavour in it. The center was a layer of chocolate fudge (wasn't that thick) and matcha cake then matcha syrup or something.

The cake was really small and was expensive for the size it was.. :( but it was so good. I don't think that'll stop me from buying it again though hahh. 

I was also thirsty so I ordered a latte. I asked the cashier for her recommendation and she suggested the latte in my pic. It was good! But more on the sweeter side because they use brown sugar."}
