{"text":"Really dissapointed. Stale buns dried out dogs. I won't be back.  They are closed.  Good."}
{"text":"Stopped in to Tucky's for the first time this weekend and was pleasantly surprised. Ordered 2 Coney Dog to go. Prompt service and excellent tasting dogs. Though I will agree with the other reviews that for $3.50 a peice I would have liked to see a larger portion. Though it does keep me wanting to go back for more."}
{"text":"I was out running errands over the weekend and remembered a friend of mine telling me how much he liked Tucky's.  This friend of mine has good taste in food, so I thought, \"what the heck?\"

Good choice... I had a \"dog biscuit\" which is a hot dog wrapped in biscuit and deep fried.  I dipped it in stadium mustard and devoured it.  I also got an \"ultimate bologna sandwich\" which is flat-top fried to a nice crispy doneness and put onto a hot squishy pretzel roll with two slices of American cheese.  Divine.

I got a Boylan root beer which is excellent, and left satisfied.

Later that night, I had more errands to run, and couldn't find my wallet.  After a franitc search of the entire house, and some questioning of my sanity, I finally called Tucky's, the last place I paid for something.  The guy that answered sounded so happy to hear from me - he had my wallet.

So, I went back to Tucky's, this time with my wife, to pick up my wallet before running our errands.  I ran in to get my wallet and when I turned around to go back to the car, my wife was standing behind me.  \"They have hot pretzels.  I want one.  And a milkshake.\"

OK, I've never been here before, so why not twice in the same day?  This time, I got a Cleveland dog and a chocolate milkshake, which is made with custard, and is super creamy and delicious.  

I was actually unimpressed with the Cleveland dog.  It wasn't bad or anything, but it wasn't anywhere near as good as that bologna sandwich or the dog biscuit.

The folks working there were very friendly and took good care of my wallet.  I'd like to try some of the other division dogs (hot dogs done in the style of various regions, like Detroit coney island, Chicago style, etc.).

This will be one of those \"special occasion, I don't mind walking away feeling like I just gained 20 pounds\" lunch destinations for me."}
{"text":"I'm upgrading Tucky's to 4 stars now that they serve bigger dogs. It used to be that your dog got lost under all the toppings, but now you have plenty of dog. They also started toasting the buns. Props to Tucky's for listening to the people.

Had a Cleveland and a Kansas City today and both were delicious (and 2 for 1 because it's Monday).

If they can make a better chili they may yet reach five stars! (Not that there's anything wrong with the chili, it's just not particularly special. I think any chili that goes on a dog should be good enough to eat by itself, and theirs is not good enough that I would eat it on its own.)"}
{"text":"On this chilly, rainy day, I had a craving for fries while we were out and about.

Initially, we went to Fatburger, but sadly, Fatburger is now an ex-Fatburger and out of business.

So, we drove down Mayfield on the way home, searching for a random place to get fries (and a burger to go with it).

\"Hey, that place Tucky's says hot dogs, shakes, burgers... Wanna try it?\"

Tucky's has a limited menu, with 6 different types of hot dogs, a few burgers, and shakes, but what they lack in diversity makes up for it in taste.  The shakes are made with custard, which gives them an extra depth of flavor.  The butterscotch shake I had was delicious.  I had a cheeseburger and chili cheese fries, both quite good.  They have an extensive condiment bar so you can customize your burger as you like it, and several different spices out as well so you can add any additional flavor you like.  

Our food came out fairly promptly after ordering, which is another plus.  The only nit-picky thing I would say is that the hot dog (at least the Coney) is a little bit smaller than I would imagine it to be, for my husband seemed to gulp it down in just a couple bites, and then looked sadly at the empty hog dog tray, wishing for more Coney goodness."}
