{"text":"Love this place!   Food is always very good and plentiful.  One combo meal with egg roll usually lasts me 2-3 meals. They accommodate special orders when I have them and they have an extensive menu."}
{"text":"Very good Chinese food. Great food and prices. Very quick delivery. I love the bite sized sweet and sour chicken."}
{"text":"The only thing that makes this place even close to authentic is that I SHOUT.  MY.  ORDER. SO. THEY.   CAN.  UNDERSTAND. ME.  But seriously, it's good, hot, local, well portioned and I don't go anywhere else for my take out Chinese food.  General Tso!"}
{"text":"Yummy food and very friendly service. We have gotten takeout from Turney China several times now and have been highly satisfied every time."}
{"text":"Not good Chinese food. Fried rice is bland. Thick, greasy breading on the chicken. Sure, there's such a thing as good, cheap Chinese food but it's definitely not this."}
{"text":"Used to go here when I lived in Maple Heights and happened upon it recently and things haven't changed. Clean with what I think is the best takeout in Cle. ginormous portions with lots of veggies!!!! VERY tasty too!!!  Nice and clean and I enjoy the barking out orders in Chinese too!!! Me likey!!!!!"}
{"text":"Great Chinese takeout. My family orders from here pretty frequently and most of the time get delivery. Good food, very friendly and pretty fast."}
{"text":"I have been coming here for 13 years, and I have to say it is one of the best Chinese food restaurants I have eaten around here. They are always very friendly and everything is always very, very fresh. I absolutely have no complaints about this Chinese food restaurant. They are also very clean unlike a lot around here!"}
{"text":"I do love  this place!! they are SUPER nice, the food is very good , and the selection is large!! I go probably once a week at least since it is near work.  I have never had a bad meal. I would feel completely comfortable telling her--just make me something and I will pay for it  The vegetable soup is my new favorite thing!"}
{"text":"Went there for lunch. All the employees except for one was outside in cars. They all came running in. I ordered Beef chop suey, it was beef and cabbage only and very little beef at that. Won't be back."}
