{"text":"Love this place, rice and peas with ox tail gravy and curry chicken  my all time favourite"}
{"text":"Really awesome foods- outside is deceiving! excellent jerk , bbq chicken and oxtail; yummy!
They were kind enough to let us try before we bought, lots of people can into the place- very busy, no seating,"}
{"text":"We ended up here as our usual Jamaican spot was closed for \"vacation\" lol.

AS we had a large order for the office,  we expected that it would take a bit of time.  The orders included: fried chicken, jerk chicken, stew chicken, oxtail, festival, curry chicken and rice n' peas. 

The chicken dishes were all pretty good. Nicely spiced and decent portions. The oxtail was a bit pricey and a bit sweet for my liking. If we go back, I probably wouldn't order the oxtail again as I prefer a more savoury oxtail stew. Overall, its a good spot for lunch. Always busy. 

The people who work there aren't the friendliest but efficient.  

Give it a try if you're in the area- they have lunch specials daily."}
{"text":"The new location is very clean and nice.  The rice and peas is rather bland.  However,  the jerk and BBQ chicken is pretty amazing."}
{"text":"Been wanting to try this place out for a while now especially since I live nearby and was finally able to, thanks to my friend.  Place is extremely casual and the staff are friendly.  One had complimented Ms. Kathleen's homemade pineapple and ginger drink and after having a sip, I was in sold! Definitely give this a try when you're there and if there are any in stock.

Oxtail - Had the oxtail with rice and peas, which is probably my fave Jamaican dish so I'm a little picky.  Theirs seemed to have a little bit of a sweet flavour with some nice heat at the same time.  I couldn't pinpoint from what exactly but it was good.  The meat was also nice and tender.  One thing though is that the pieces were small and I got quite a lot of bones. Thankfully, you get a good helping of oxtail. Wish they'd add more gravy, though. 4/5.

Coleslaw - This was one of the best I've tasted.  Just the right amount of creaminess to it with the perfect crunch.  5/5. 

Festival - Love me some festivals and theirs was quite good.  Definitely something I'd go back for and next time, I'll add some gravy on the side to dip in. 5/5.

Pineapple and Ginger Drink - As mentioned, I was in heaven.  This is great to simply quench your thirst as it's very refreshing, especially with the bit of slush.  I still have some left and although the slush will be gone, I'm sure it'll taste just as good.  A MUST try when you're here. 5/5."}
{"text":"Best chicken. Rice and peas with gravy was awesome and the coleslaw was perfect. I tired Jerk King down the road last night and Twice As Nice killed it. Only wish they had some fried plantain."}
{"text":"Best place for authentic Jamaican food. Taste just like good from back home in Jamaica. Oxtail is probably one of the best in t dot, their jerk chicken is so nice oh my. I travel here all the time. Was cheesed when they were closed to relocate literally across the street, but I'm glad they're open again. When they were closed, I found another authentic Jamaican food spot that's almost as good as twice as nice. It's named p jays take out."}
{"text":"I'm baaaack! And it was awesome once again! Ignore Jr, this place is still great. I don't think they deliver, so he's probably got the wrong place, but I could be wrong. 
Like I've said before it's always the fried chicken and oxtail for me, but on my last visit I couldn't resist the jerk chicken, which looked and tasted fantastic.
If you like things even more spicy than the Jamaican standard, they have the most amazing fresh, house-made Scotch bonnet pepper sauce, and I absolutely guarantee that stuff will make it hot enough. I douse it on heavy and then enjoy my meal with tears trickling down my cheeks.
Love this place!"}
{"text":"Yikes...I don't seem to be on board with the other reviews here. I actually did not like their food very much. It was ok but I would not come back. The server was really nice to me which is my reasoning behind the two stars. She gave me the last festival for free but probably because she knew it was hard like a rock. Being west Indian i definitely know good jerk and this was not up to par. Mind you it was better than the fry chicken. The fry chicken had a weird taste to it that I did not enjoy. The jerk was way too mild and didn't satisfy my craving. It could have been an off day. However i will not be returning."}
{"text":"My favourite jamaican spot in toronto,  their yellow pepper sauce is the best I've tried.  Love when they bring out the drums and BBQ the jerk pork, unreal."}
{"text":"There are plenty of places to get Jamaican food in the area, but Twice as Nice is probably the best. Their chicken tastes the closest to oil drum cooked chicken that I have had from a restaurant. It's pretty hard to find someone in Toronto actually cooking the chicken in a drum, especially in winter, so this is my go to place for jerk. The extras like rice'n'peas, coleslaw, festival, and plantain are all good, too.
There can be a lineup, and we all know how fast Caribbean service isn't, so you might have to wait a while. Because of the popularity of this place, it is not uncommon for them to start running out of some dishes by 7pm, so be forewarned.
Me, I don't care about the line, the lack of ambience, the tight parking lot. When I want my jerk, roti, goat, fry chicken, oxtail, whatever, I will tough out the line and then happily stuff my face."}
{"text":"This is the best place for ox-tail rice and peas I have ever had.. Their BBQ chicken, BBQ jerk chicken and jerk chicken is also the best as well...
I highly recommend this place..."}
{"text":"Been going here for 2 years now & its still my absolute favourite the taste is consistent they've never disappointed. Large portions for a good price"}
{"text":"I wanted good jerk chicken and it was suggested that I come here. The service was pretty friendly, and I really liked the Jerk chicken. It had a lot of different flavours and different tones. I enjoyed the hot sauce they give with the chicken, it had that great mixture of sweet and spicy which makes food really good. I want to eat here again, I really liked it."}
{"text":"Working in area for a week so visited four out of five days for lunch 

Two days at no later than 1:30 they had no food (provisions)

Last day (not going back) I had to wait 30 mins for food that was sitting ready right in front of me and they substituted white rice in for my rice and peas; I wanted food in the first place so ended up throwing out the nasty rice

Upsetting that they could have made more rice in the time they made me wait but so it goes

Snapper was a good 3/5
Service 2/5
Food availability 3/5

Would have got a 3 on Third visit but not worth more than a 2 after seeing its downside"}
{"text":"This place is OKAY. Got the goat and jerk chicken. I was disappointed in the amount of jerk chicken we got (3 small pieces, and this was a medium) but the amount of goat curry was okay. 

The food didn't taste too different from West Indian food in my opinion. HOWEVER it was yummy and a decent meal for the price. The coleslaw was nice and tangy. 

I can see myself coming back here on a whim, but I don't think I would crave this place. I like Ritz a lot more."}
{"text":"My go to place for Jamaican food., been here over 100 times. Only disappoint twice. I usually order stew steak( my favourite) it's actually real steak cut up; the only Caribbean restaurant I know that offers real steak. Or sometimes I get the curry chicken and stew chicken. I've tried almost everything on their menu. The food is delicious ; they do use a lot of ginger in their food which I like. They give hefty portions . I almost always get a small and I'm I always stuffed. The convienece  store beside the restaurant offers drinks for .50 cents. I always grab. The downside to this restaurant is it is strictly take out. No tables or washroom. They are usually busy ; wed-sat;Long lines. But they move fairly quick. I would say this is the best Caribbean restaurant in gta. They open early which I like. 10:30 am. Nice ackee and salt fish. The best hot sauce I've ever had. You can also buy a bottle for $7. There prices are reasonable. Like I said not cheap with the servings. Definitely recommend for an evening at home or quick lunch on the road."}
{"text":"The jerk was not great. Had a BBQ sauce flavor to it   There's a lot of better options in the area"}
{"text":"Well. I did come here and had to leave because it had no tables to eat on.. our house is far and we didnt want it eat food in the car so i didnt order anything. I google best jerk chicken in Scarborough and this place came up so i wanted  to try this with my wife."}
{"text":"Best bbq chicken and fried chicken. Servers are friendly but service can be slow at times. I've been going to this place for years and they have never disappointed me with their food!  I always stop in when I'm in Scarborough xoxo"}
{"text":"We were driving by and thought we'd stop and give it a try. Even though they were minutes from closing we got our orders of jerk chicken in. I'm so glad we did because it was the best I've had since moving here. It was tender and tasty with great flavour. We will definitely be making the drive to try out more of their menu."}
{"text":"This place has gone down. Flavours are good but jerk chicken and bbq chicken are overcooked and DRIED out. Curry goat is oily, bony, and tough, (heart attack central).  Delivery way too long almost two hours. Coleslaw still way too sweet.  Over them, moving on."}
{"text":"Absolutely the best for jerk chicken in the gta for me. Not going to ruin it with more words.  I've stopped everywhere it says Jerk the last 15 yrs. Absolutely the best I've had."}
{"text":"Service is definitely slow but food is worth the wait. It's my go to caribbean  food spot, food is tasty at a good price. Has a lot of in and out traffic of people. Also try serve chicken and waffles which are so good. Would recommend to try if you were in the area."}
{"text":"Sigh* 
This place is and will always be my first love.
I know I know , there is no seating area at all. The customer service is lackluster but I mean in their defence the place is always busy. Which usually means the food is amazzzing!
Which might I add it it beyond such.
I used to always jus get fried chicken and my bf jerk chicken. Well I found out via another yelper you can do mixes. *mind blown*
Most places would never let you have two options and if so mayb two types of chicken but that's it...so I took full advantage here
I got half oxtail and half fried chicken w xtra oxtail gravy on my rice & peas. 
The oxtail was definitely the right amount of sweet and savory. Seasoned to perfection and lol pieces of fall of the bone meat in the gravy to add flavour to the rice the way it should be .
My niece got curry goat which she absolutely loved. She said it was quite spicy but still sat there eating it all through the complaints lol. She loved it.
Last but not least the bf got half fry and half jerk chicken w rice n peas and oxtail gravy.
Chicken was fried to perfection the skin nice and crunchy full of flavour and the flesh well seasoned. 
We all got medium plates which were the size large that we get else where and actually filled till it could barely close. I mean is it Christmas or ....
I am clearly one happy girl.
I appreciate you Twice as Nyce I really do.
Will d3finitely be back everyone I come into the east end well worth the drive.
Always a 5 star, they also hve new girls working at the front here Nd they do catering.
A women was there picking up her catering order while I was in line. 
5/5 for what matters the FOOD"}
{"text":"Twice as nice is the best Jamaican restaurant you can find in Toronto the food is great i give it 3 star why did i say the food is great and i only give them 3 star ? because the employee's are rude and disrespectful. on July 30th 2016 i call twice as nice to place an order to be deliver to my home and the person on the phone was not nice at all. but i must say there food is great but the customer service is very shitty."}
{"text":"Highly recommended!

The ambiance in this restaurant is quite basic and you're not able to dine in. Don't let that fool you because their food makes up and exceeds all expectations!

I had an order of rice and peas with ox tail and cole slaw. The cole slaw was absolutely perfect. It was flavourful but not overwhelming and there was plenty of it! It complimented the rice perfectly! I was quite disappointed by the rice and peas however. It was quite bland and some of it were clumped together as if it's been kept in the fridge overnight. However, the gravy from the ox tail really enhanced it. It gave the rice flavour and taste and it tasted as good as new! This was some of the best ox tail I have ever tried! It was very tender as how it should be but the flavour exceeded all expectations. The quality of the ox tail was very rich and tasted very authentic. *highly recommended!* I had a taste of my friend's jerk chicken and it was juicy and rich in flavour!

The service was great! However, I waited about 15 minutes for the food. There was only one person doing the final preparation and packaging of the food and that made the finalization process very slow. But they were very polite and loved to smile which made me feel great! 

The price for my medium meal was just above $10 and the small jerk chicken was $7 which is fair.

Great place if you want some great authentic Caribbean cuisine!!"}
{"text":"I was in the mood for some curry goat. We went to this place and it was so packed! I thought that was a great sign. The service was okay, lady in the counter was not so nice. We waited about 15 minutes for our food. I ordered the rice and peas with curry goat and my husband ordered the rice and peas with oxtail. When we got home, we were both very disappointed. The portion size was terrible, they packed the rice and peas and gave such little meat. Both curries tasted delicious but it wasn't enough. Won't be going back."}
{"text":"Clean place with decent service. Food is really good, fried chicken is always very juicy. Portions are good size.  Jerk chicken is better then a lot of people in scarborough"}
