{"text":"Three words that will change your life for the better: Beer Battered Fries.... Great food!"}
{"text":"I've been visiting the twin oaks two or maybe three times a month since I moved to the area.  I would like to say, my first five or six expedience were fine.  I went in this evening with my wife, she got the eggplant parmesan, me, hot meatloaf sandwich.  My wife was satisfied with her meal, as was I, until I found a bread tie in my mouth. A plastic coated, wire bread tie.  I don't know if it was inside the meatloaf, or between the bread and meatloaf, never the less, I found it while chewing.  I calmly got the waitress attention, told and showed her, I even shushed her when she exclaimed \"oh my God!\". She asked if I wanted it remade, I declined, she was nice and apologetic, possibly embarrassed.  A few minutes later she returned with my bill, she took off the meatloaf.  I think, if the Oaks wanted to retain a local, regular guest, they would have taken everything off my bill.  To be fair, the appetizer was fine, wife's eggplant was fine, the two cokes were fine, so I guess it was fine, I just won't be back.  Sorry Oaks, we're 3 months into a 30 year mortgage, you really should have tried a little to keep a local customer."}
{"text":"Had dinner with the fam today...home made potato chips were the bomb!!! Service was very prompt..waitress Hannah could't have been more attentive...had the Philly cheesesteak which was very good as well...go check it out and ask for Hannah for an enjoyable experience at the oaks!"}
{"text":"Food was good, my husband got the steak sandwich and he said it was one of the best he's ever had. The meat was real steak, not generic steakum meat. I got seasoned wings, they were slightly overcooked but seasoned well. Service was terrible. I would probably not go back just for that reason. Waitress moved like a snail, didn't bother to check on us or refill drinks. Not very friendly. They need to train their staff a little better."}
{"text":"Awesome restaurant hidden in an outdated strip mall. The sizes of their hoagies & sandwiches are huge and yummy. I always get the steak and cheese hoagie. The meat is not cheap Steak-um meat. There are caramelized onions and sautéed mushrooms on it as well as melted, gooey provolone cheese. I get half a hoagie but can only eat half of it. The homemade chips that accompany it are delicious. The reason I gave 4 stars is because the service can be hit or miss. They are friendly but not always attentive, especially when it gets busy."}
{"text":"Best place in the world to gather with friends. Have never found better wings anywhere and we have looked everywhere around the country. Sometimes we crave their Reuben sandwich."}
{"text":"My husband loves their blackened wings. Just okay and sloppy to me. As for their famous homemade chips, every time I've ever gotten them there were burnt and tasteless"}
{"text":"My wife and I go here about once a week on average. The food is good at a reasonable price. I come from a small town, so this place makes me feel at home.  The food is good, the homemade chips are unique and pretty tasty. I often get the Nacho Grande, which is like eating a field of vegetables covered in nacho chips and sprinkled with a dash of ground beef. For $7.99 it is very worth the money.  If you looking for a cozy place to grab a drink and get some food, this is it."}
{"text":"Appetizers are half off on Wednesdays,  which is an excellent deal,  you get a ton of food.  Wait staff is very friendly,  and service was good.  Portions are very large,  and there is always a lot to take home.  Try the chicken Philly and the nachos grande"}
{"text":"This place was just OK.  A friend and I sat at the bar and the bartenders did not seem very friendly.  They gave us drinks but we never had a chance to ask for a menu.  After about 20 minutes of waiting, I spotted some menus and grabbed them.  A few minutes later, someone else finally stopped over to get our food order.  The food was not bad, just typical bar food.  The beer I ordered was good, but when I switched to a mixed drink it was not made correctly and tasted off.  I think we had maybe 4 different people waiting on us at the bar which was a little bit of chaos, but unfortunately there are not many other options in the area."}
{"text":"Usually really like it here. Just had the shrimp salad and it was a small side dinner salad with 4 shrimp on it.  I usually get the chicken salad but since it is lent I went with the shrimp. The chicken salad was served in huge bowl and I could never finish it. This was very disappointing and not enough for dinner."}
{"text":"The sandwiches here are huge and really good.  The soup is homemade and the cream of mushroom is fantastic.  Service may not be speedy, but it's worth the wait.  Not gourmet, but who cares?"}
{"text":"We love going to twin oaks for their wings, the tuna melt, and the sandwiches. They have great prices. And it seems like they always have something different going on in the bar area. I do wish they had a bigger tap selection. However they did have an IPA on tap the last time I was there and that's awesome!!"}
{"text":"Ordered a couple of take out fish sandwiches last evening at my daughter's recommendation.  Half way through I took a bite and got a large hair ball with it.  It was disgusting.  I will never order take out from or dine in at Twin Oaks again.  If you want a far better...and sanitary...fish sandwich I recommend Primanti Bros."}
{"text":"Have not been here in years. Remodeled a bit. Very good food and lots of it! Enjoyed the dinner. New specials everyday and atmosphere was great!"}
{"text":"Apps are good, food portions are large and reasonably priced, service is fast and friendly  Correction, some of the service is friendly...Mel and Mel are fantastic"}
{"text":"Disappointment! We always get the Reuben. Usually a big sandwich!. Went today, husband orders the reuben, out comes half a reuben. Waitress says the owner only offers half sandwich choice now. Menu does not say Half Sandwich! Price not reflective of only half a sandwich tho! We always told friends to go here for the Reuben, not anymore, very disappointed...husband left hungry! Bad m ove Twin Oaks, we wont be back, or recomnend!"}
{"text":"So we stopped back agian... an interestingly enough the only side open agian was the bar side.  The dining side was closed for a private party.. It appeared to be a 40th birthday party.  Now if you have never been here the bar side has a large bar with another room behind it that includes a small stage area with a little seating.The main dining side sits to the left of the bar side and has a separate door out side as well as inside to it.  With that said and this being our 2nd time here... we both ordered diners and both were very good.  I wanted to get that part out of the way, since the food was hot and delicious as well as being fairly priced.  Here's the part that gets me... so... they seem to have a good clientele that seems friendly and outgoing and with  various age groups. They also seem to have some new staff that have been thrown to the wolves sort of speak. Since what do you think happens when you are a bar/restaurant with a good flow of cutomers and then all of a sudden without warning on a Saturday night your dining space gets cut by over half? ... I just can't imagine in this day in age where most businesses are starving for customers and this one is letting them walk out the door, literally! I witnessed during our time there well over 30 people turn around and leave because there was no place for them to go or even stand to wait for a place to sit.   Our server was a new gal who was doing her best, but when a woman who seemed to be running the place stoped by to grab our empty plates, I asked if she was an owner... since I really felt the need to express my feelings... she said she was not an owner just a person woking there... I asked her name.. it was Jocelyn (I hope I spelled it correctly) Well whomever owns This establishment should be thanking what ever god they belive in that you have the employee's like Jocelyn ...  You have a pretty good place, stop screwing it up. I really want this to be our new go to place but if we go back and it's the same mess.... well, I just can't! Please stop screwing up... if you want a banquet hall buy the empty radio station next door and expand."}
{"text":"Typical bar food with mediocre service; one of the few \"bar/restaurants\" that are available among the area in which it's located.  I *want* to like this place because it's local and privately owned (non-chain/non-franchised) and so close to home, !but the service keeps turning me off.  Of all of the times that I've been there, I only had good service twice. The one time, the guy that waited on us went to school with me.  The second time, I was there with a group for a meeting and the lady was very nice to us!  Overall, I'd give them a chance to redeem themselves (on service) because they do have some winning food products here.  PROS:  Convenient location appears clean food is consistent Large menu!!!!!!!   :) Menu/Food specials/features Sunday-Saturday  CONS: 1.)  Bathrooms are a bit sketchy 2.)  Service is very mediocre 3.)  They gave my husband a nasty rusty can of Miller Lite!  WTF is up with that?  No bottles of miller lite AND they served up the NASTIEST RUSTIEST can they could find??!?     ...ught-uh! 4.)  The Bartender staff does not warm up to anyone other than regulars which is crazy because you live off of tips when you're a bartender, not that stinky per hour wage!!!  There are no bad shifts, just bad bartenders!  I've been there on several occasions and the bartender's were the worst.  Sit @ a table!!! The customers were nice--a couple of regulars chummed right up to us and were very nice and chatty with us for about an hour before we were so thirsty that we had to leave because another bev was clearly NOT in our future here.    TIPS:    Order the Sweet Potato Fries--they are quite yummy!!!!!!!    :)  PRICING:  low, to mid-range $$ PARKING:  shared lot in Rainbow Shopping Plaza WAITRESS:  yes FULL BAR AVAILABLE GOOD FOR GROUPS:  Yes GOOD FOR KIDS:  @ the tables, yes ACCEPTS CREDIT CARDS::  yes ATTIRE:  casual OUTDOOR SEATING:  no  http://www.twinoakslounge.com/"}
{"text":"Typical bar food.  Wings here were quite good, as they were the whole wing.  That was the only highlight I experienced.  Be prepared to walk through a smoke filled bar before you go to the dining room area.    Really bad service.  Although we had a new waitress, she wasn't even friendly.  Screwed up orders and everything was super slow, and just unprofessional.    I have no reason to ever go back."}
{"text":"They have 2 dining rooms to choose from and a bar that is usually full.  Take out orders are filled pretty quickly, and I'm impressed with the low prices and extra large portions.   The service staff is friendly, but never perfect.  The fare is your typical suburban  family oriented bar menu.  The portions are HUGE, so if you are hungry and stuck in White Oak, this is the place to go.  I wish there were more appetising healthy choices on the menu.    I don't know why everyone is so impressed with the home made potato chips; every time I have had them they were overdone and tasted of old grease.  Really could have been MUCH better."}
{"text":"One of my go to places to go to in the area. After today though I probably won't go back again. I don't think the kitchen can keep up with the busyness. It was a busy night but it took over 40 minutes to get a Reuben, tuna melt, and meatball hoagie. As soon as the food came we had to ask for boxes. Even though we had somewhere to go, we thought we would've had plenty of time. The waitresses seemed miserable and it's probably because they had to deal with the complaints of the wait. I felt bad for them because it wasn't their fault. They also changed the menu and replaced the pizza with flatbreads and the home cut fries with beer battled ones."}
{"text":"Always great service and food one of the best places to eat around the area great wings hoagies and sides"}
{"text":"Very old crowd. Not a hip place at all. Staff was pleasant. Beebwas cold. And its freindly but boring. Boring. ."}
{"text":"Good food, especially liked the home made chips. Prices are fair and the portion size is better than average. The atmosphere is a little run down but all and all a good value. I'll return."}
