{"text":"If I could give it a half star more I would. The food was great! Just took a long time to come out. As we first walked in there was a pungent odor of either sulfur or sewage? Maybe they forgot to empty the grease trap I don't know. After a while it went away. We started with the artichoke, awesome! My wife had scallops which she said were very respectable. I had the Alfredo with shrimp, very tasty. This place isn't a two dollar sign place. Out bill was over 100 for two people. A lot of people might be enjoying the happy hour and lunch which are reasonable. Going to dinner here ordering entrees will bring your bill high but if you stick to cheese plates and bruschetta you will probably be happy"}
{"text":"Excellent!  The salmon starter is just superb.  They have great service and really go overboard to please.  We want to try the happy hour and the lunch menu and the wine tasting."}
{"text":"This restaurant apparently changed owners recently. If you are looking to experience Amy's Baking Company before kitchen nightmares, this is the place. The service is bad, the food is worse. With a large group of people we experienced an array of bad food. I.e.

1. The salad has an incredibly offensive and intense onion flavor. Strange because there were no onions on the salad.

2. The chicken dishes tasted like salt block.

3. The burgers were undercooked, salty, and dripping grease. Fortunately the large roll they were encased in soaked up a lot of the greasy salt and could be discarded. 

4. Soggy fries.

5. Iceberg salad. I would never order iceberg anything, but the unfortunate individual who had, received nothing more than a chunk of iceberg with strange onion flavor.

6. Salmon burger. Standard farmed salmon steak, skin on, greasy. Very salty like everything else. I can't imagine how much salt they go through, I'm imagining daily deliveries of 5gallon buckets.

6. Ice cream (fried?) desert. I don't remember exactly what it was, but the ice cream was good.

Long story short. Go here for the novelty of enjoying a truly terrible restaurant experience while it lasts. I don't think they'll be around much longer."}
{"text":"We loved everything about The Twisted Rose! The service, food, and hospitality are above and beyond everytime we go. Highly recommend!"}
{"text":"Excellent service, friendly atmosphere from Hostess to the entire staff! Server was a 10; food was excellent; menu was good; the restaurant decor was theme appropriate and pleasant-very nice. Next time I would try the well designed patio. I recommend tasting their wines. Paul R."}
{"text":"I don't usually take the time to write reviews, but the people at this place went out of their way to make our anniversary special.  This was our first time here, and what a darling place it is, very warm and cozy you feel right at home here.   Our waiter was very attentive without being overbearing.  The owner came over and spent time with us and educated us on the different wines.  I am not much of a wine drinker, but he listened to what I like and made a perfect recommendation, and to my surprise I loved it!  My husband who likes fine wines was in wine heaven here.  We ordered the scallops and the salmon, and I have to say they were done to perfection and sooo very good.  We also had their charcuterie board that had some cheese and meats I was not familier with but they were excellent.  We split a chocolate chip, banana bread pudding with caramel sauce that was out of this world.  We bought some wine at a wine sale they were having just that evening for Thanksgiving, we ended up with a case for Christmas presents.  Who would have thought we would celebrate our anniversary and knock some presents off of our list at the same time.  All in all this place was fantastic and I can't wait to come back.  They had live music, which they said they have 3 days a week.  There was a really cute patio, but we stayed inside to hear the music, but next time we might try outside.   One last note the place is a little hard to find, there is construction and the road they are on is closed at the one end, we had to go around to the Raintree, but it was worth trying to find."}
{"text":"This place has an awesome lunch menu! My next review will come after I've had a chance to eat dinner and enjoy some wine!"}
{"text":"My husband loves a good hamburger and the picture on Groupon looked so good, I thought we should try it. It is tucked away and not easy to spot, not much ambiance, but the food was delicious.  His Hamburger was cooked to perfection and very tasty. I had the Vegetable Risotto which was superb!  The best Risotto I have ever had!! We had the bread pudding and wow this was so good - to die for.  If you want good tasty food,  I suggest you try this place. It is so worth it and I would go back in a heartbeat."}
{"text":"We went for a late lunch and from the first friendly greeting it was wonderful. Awesome service and my house salad with salmon was fantastic, perfectly cooked salmon with a crispy edge. I feel like I probably looked like a pig to everyone else; it just tasted so good! My husband was very happy with his fish and chips and thats one of his go-tos so he's particular. I had their Bella Rosa wine and it was good, especially if you are a fan of a little lighter fruity red. We are from OR but if we were local we'd be regulars."}
{"text":"Purchased a Living Social deal to try out the new place...WOW. it is a great addition to the area. We had an amazing dinner paired with wine. Staff was prompt and helpful. Interior was nicely done. They serve lunch and a Sunday brunch. We will be back to try again for both of these meals!"}
{"text":"My wife and I went for dinner the other night and we loved the place.  We went on Thursday night because they had a guitar player with a great voice singing some old favorites that went well with a dinner setting.  The Scottish salmon ($20.95) was some of the best tasting salmon I've ever had.  The sauce on the side was different and very good.  The Farro salad we liked too, although it did seem pricey at $11.95.  The bread pudding was killer good ($7.95) and a large enough portion for two.  My wife thought the house Chardonnay was good for only $6.  The Lagunitis Pale Ale on draft ($5) was nice too.

Our waitress was very nice, friendly, helpful, and attentive.  She couldn't have been better.

One of the owners came by to greet us and see how things were going.  She was very nice and friendly.  We enjoyed talking with her.

The interior of Twisted Rose if nicely decorated and it's comfortable.  The tables aren't crowded close together like many restaurants.  They have a nice patio area with some big plants to screen out the parking lot.

Overall we like Twisted Rose and we will go back.  I hope you go too so this fine place will prosper and stay open."}
{"text":"Read about the Sunday brunch on Chow Bella and decided to give it a try.  Was very impressed.  The food was delicious!  The french toast was out of this world, and the omelet was perfectly prepared.  We will definitely be back."}
{"text":"Love this place! Have introduced several friends to it and they loved it, too. The Happy Hour items are so tasty; I don't even like pork that much but love the stuffed apple and the ribs! The deviled eggs are scrumptious and the prawns were big for the 'shrimp' cocktail. My son has gone several times for meals (not happy hour) and has always loved everything he has gotten but I do not remember now what they were.The servers are friendly and easy-going. My only wish is for a light beer on the happy hour menu (my friends are the wine drinkers!), although the 3 offerings are great! I know they could be much busier if they would get a sign out on Northsight! It's hard to find even if you kind of know where you are going, as there are so many strip malls around that area. (Once you walk in, you will never know that you are in a strip mall!)   I like that it is a quiet place where my friends and I can actually talk instead of yell to have a conversation. It is very clean. I think it would be a nice place for a birthday/graduation/retirement get together with a group of adults."}
{"text":"Found this place on recommendation from a friend...I must say we were impressed. The location is a little off-putting given how my friend had raved about the food but i have learned to not judge a fab restaurant by it's strip-mall location.

We were a little leery when we walked in; no hostess, a server had to seat us, and we didn't see our server for almost 10 minutes. Beyond that everything was great!

I had the Pulled pork sandwich with house made fries. He had the twisted burger also with house made fries. Shared bruschetta, and it was great!

Ticket times were a little lengthy for pulled pork and a mid rare burger, but we weren't in a rush.

Server was awesome, very knowledgeable regarding the wine and made great food recommendations. He was very energetic, lively, and truly seemed to enjoy his job which is always a plus for us...hate sullen servers. 

Want to go back and enjoy happy hour, only because the wine by the glass outside of happy hour is a bit pricey. Most priced at $9-$11 (glass) , but the HH list has a few great glasses for $4-$7.

Overall, great restaurant, great atmosphere, great food, we will be back."}
{"text":"Very busy and fun Friday night. Music was great!! They need more help for poor Matt behind the bar. If he just had to pour wine and beer fine but he's mixing cocktails too and got very backed up!"}
{"text":"Went back for our 3rd visit and so disappointed that Happy Hour has changed: now must sit at the bar for the Happy Hour menu.  The couple coming in after us returned for the same thing and were disappointed with the change."}
{"text":"The food here is great and a nice atmosphere too.  The pretzel with fondue was delicious and the bruschetta is perfect. Great beer here as well even though it is a wine bar so double plus."}
{"text":"Food was decent but the service was horrible. I had to ask for my drink multiple times before it even showed up. Seemed like they only had 1 server working the place. 

I will only come back if my friends drag me here."}
{"text":"I'm being generous with two stars. As we walked out, everyone in our party said \"worst meal and the worst service in the Scottsdale / Phoenix metro area.\"

I've read the other posted reviews and wonder if we ate at the same place.  I even called the two other couples who dined with us and they couldn't believe the praise.

Lowlights.
1)  I don't drink, so this was not a problem for me, but they didn't have the mix to make a cosmopolitan and another friend in our party asked for three different wines (listed on their list) but they didn't have them.  Finally, he settled on one of their wines, which, and I quote,  \" was acceptable'. 

2) Executive chef was on a cell phone ( on and off) throughout our meal.  Standing, I might add 10 feet in front of our table.  As the service was so slow, we wondered whether he was calling in for supplies?

3) Served bread drowning in olive oil.

4) slow service

5) 6 entrees were ordered.  Only one person in our party liked what they were served

Highlights:
NONE.

Who are the people who wrote the favorable the reviews ... paid PR personnel?"}
{"text":"My wife and I went here for a date. We typically try new restaurants each time we go out, and we were excited about trying out Twisted Rose and Winery. Unfortunately, we were disappointed with the food. 

I ordered a medium-well Twisted Rose burger and ended up with a bloody burger that was oozing. I did not end up eating the entire thing. I should have sent it back. The homemade chips with the meal were good though. My wife had a mixed green salad with shrimp. She enjoyed her salad, yet there were only four shrimp that came with the salad.

The food was average at best and the portions were small for the price. Hopefully it was just an isolated case."}
{"text":"\"Affordable GOURMET - Upscale yet Unpretentious\"

Lovely ambiance and magnificent gourmet food at affordable prices. The Twisted Rose in North Scottsdale is hidden in a strip mall center, next to Corleones Italian. The owners were exceptionally friendly and genuine.  A really nice couple who are anxious to provide a very positive experience. The service was right on, but the highlight is the food. The chef has updated some old loved standbys to perfection. All was absolutely delicious and beautifully served. We had two appetizers; charred artichoke with an aioli sauce, and unbelievably delicious barbecue ribs.  Each were fantastic and filling, but we already had ordered a steak to share, so oh well with the diet.! Incredible food, and an adequate selection of wine (and beer) all for less than one expects to pay in Scottsdale. We were advised to come back for the weekly happy hours when drinks and appetizers are half price! Now that would be a deal! This is an impressive place for a romantic date without being too trendy, stuffy or overly priced, nice retreat from typical Scottsdale. We can't wait to go back."}
{"text":"The prices are a little on the high side for the portions you get, which is the only reason this place gets four instead of five stars from me. That, and they were out of the blueberry wheat beer that I really wanted to try.
The food was way better than I expected from a strip mall restaurant - literally tucked into a bunch of shops on Northsight - right next to Corleone's (P.S. how is Corleone's still in business? Separate issue.).
I had the mushroom risotto and my husband had the pasta of the day (which was pasta primavera). But really, we split both. They were both delicious, but small. Which was fine, ultimately, because we got bread pudding. We would go back just for the bread pudding (my husband was reluctant about getting it, but ate more of it than I did).
If you're in the area for lunch or dinner, give it a try."}
{"text":"Love this place.  I have been here with my girlfriends and my husband for lunch.  The food is always great and the service is lovely.  I highly recommend the pulled pork sandwich.  My husband enjoys the fish and chips.  The prices are so reasonable and enjoy one of the beers they have on tap -- you will not be disappointed."}
{"text":"Perfect night out!  It is a rare thing to be completely overwhelmed by excellence.  That is what you get at the Twisted Rose.  Excellent wine, excellent food, and excellent service.  All of this and the prices are very reasonable.  They age and bottle their own wine onsite and in talking to the award winning executive chef (who we complemented on all the food and what we considered by far the best bread pudding we have ever tasted) he does not have a freezer or a microwave on the premises so everything is purchased and made fresh that day, with a unique twist.  You will not be disappointed ... even with the highest expectations.  This is very clear by the number of 5 star reviews being added by others.  Thank you Twisted Rose for a perfect night out and we will be back soon!"}
{"text":"Excellent food and service. The meet and cheese plate was delicious.  Server was attentive and enjoyable."}
{"text":"Great atmosphere!  Went here for dinner with my girlfriend and we enjoyed our experience. We ordered the Mac and Cheese for an appetizer and it was delicious. I had their burger which was exceptional! They have a great selection of wine, but I enjoyed one of the beers on tap they have."}
{"text":"Yesterday was my second time visiting Twisted Rose and everything from the service to the food is absolutely wonderful. When I first had lunch at Twisted Rose I was by myself and decided to sit at the bar. My waiter told me the specials and made a few suggestions since it was my first visit. He really went above and beyond to make me feel right at home. Chef Nick's food is top notch, especially the \"soon-to-be-famous\" bread pudding that is definitely a must-try. I was equally as pleased on my second visit, and plan to be a frequent customer at Twisted Rose for lunch, dinner, and Sunday brunch."}
{"text":"Everything from the atmosphere, to the service, to the food was amazing. The live music adds the perfect touch to the evening. We will definitely be back in the near future!!!"}
{"text":"This place was a nice little surprise!  We went out after work one evening to check it out and it was wonderful!  They brought a tasting sample first off, I don't remember what it was....but very nice.  We all happened to order the chicken picatta for dinner and we all but licked our plates clean!  Service was top notch, the Chef came out and visited with us....great place with wonderful ambiance!!"}
{"text":"The Twisted Rose Winery and Eatery is a little gem tucked away in a strip mall on Northsight Boulevard.  Here are some comments:

Pros: easy to access location, plenty of parking, warm and friendly service, relaxed/casual atmosphere, no pretense, delicious food cooked with a \"wine\" theme.

Also, we'd like to give a  big shout out to our server Kyle, who was excellent and incredibly knowledgeable.

Even better: we came here on a Groupon and were given great service (unlike some restaurants who don't like Grouponers)

We definitely recommend this restaurant. The only sad news is that we don't live in Scottsdale, but we'll definitely be back on our next trip."}
{"text":"My Husband and I enjoy ourselves every time we visit this establishment. The food is always delicious (especially the Strawberry Bread Pudding for dessert), the wines are tops and the service is impeccable. Such a great find. We will be back many times to this friendly place. BTW: ask about their many wines and perhaps what has just been bottled. They have some amazing wines. This place is not one to pass up you will be pleasantly surprised by this choice."}
{"text":"We hadn't heard of this place until my mom got us a gift certificate from Restaurant.com. It sounded interesting enough in Yelp reviews that we decided to finally try it out. For starters, we ordered the artichoke hearts. They were nice and tender, and were served with a garlicy butter. For dinner, I ordered the pulled pork sandwich. The bread was flaky and nicely baked, and the pulled pork was juicy, though it had probably a touch too much sauce. I would have liked to taste more of the pork, but the sauce was good so it wasn't too much of a drawback. My hubby ordered their special for the day, which was a fettuccini alfredo type of pasta (unfortunately, I don't remember what it was called) that was served with a variety of veggies, and he added chicken at an extra charge. He really enjoyed it; he doesn't usually like brussel sprouts, but in this case he did. 

The restaurant itself was clean and charmingly decorated. Service was incredibly friendly and attentive. While the menu is not particularly extensive, it is varied so each person in the party is likely to find something to pique their interest. Overall, it was a pleasant meal and somewhere we're likely to return."}
{"text":"The brunch food was less than average.  The bottomless mimosas were weak.  I was charged erroneous charges on my credit card.  The \"manager\" Cory was supposed to resolve my wine club membership charges from Aug and Sept where their sister winery Casovino was not even open and charging my monthly fee.  This place is disorganized and has poor customer service."}
{"text":"Loved it!  Came here for lunch with the family on a Friday.  I tried a sampling of the menu:  bruschetta (4 types!), Twisted Salad, Tuscan chicken sandwich.  All Delicious!!  My kids loved the Mac N' cheese - happy to see there is a grown up option for this tasty dish as well.  Great wine specials.  The owners were present the entire meal, checked in with us frequently and shared there amazing future plans for this gem.  We will definitely be back!"}
{"text":"Very good appetizers and wines.  Reasonably priced.  Recommend coming back if you want a quiet evening for Two on the patio."}
{"text":"The wines here are fantastic!!! We ordered the flight or sampler and the servers were so helpful and informational when pouring. 

We ordered dinner because we had a groupon and my fiancé had the fish and chips which he said that it rivals the fish and chips he had in Ireland. My dish was okay, a little heavy on the dressing but we both would recommend this place. 

It's a hidden gem!"}
{"text":"My wife and I had a much more negative experience last night. The overall atmosphere of a mostly empty area and almost empty establishment on a Friday evening added  to that.
To begin, we were served warm water from a cutsy wine bottle that had no room for ice! Had to ask for a separate glass with cubes. Another basic item missing is a pepper shaker on the table. Also lacking is a basic bread offering.
We found the wine list did not offer less expensive wines by the glass. Two glasses cost more then many entrees.
We will not be back."}
{"text":"What a wonderful way to spend a quiet evening! I love using Living Social (or other similar coupons) to try new restaurants. At least if it's a clunker, your wallet doesn't suffer, too.

Not only did we spend over the coupon limit, but we added the yummy bruschetta -- a fig, a marmalade and a caprese -- and the Don't Miss Dessert (the best bread pudding I've ever had!) Our waitress explained that they change it up. Tonight's was made with a red wine reduction, apples and cranberries. The crispy glazed topping was the magic touch. 

Clearly, this place didn't skimp on the chef. He knows what he's doing! Who knew that scallops beurre blanc would be exceptional served over seaweed salad and grilled pineapple? My companion had the chicken piccata and was pleased with the tender chicken breast served over sliced potatoes. I believe all of the menu items are prepared with at least a splash of wine.

The waitress explained that the current \"bottomless Mimosa\" brunch was a good deal, but that the staff was challenged by the onslaught of diners. From what I can tell, they will definitely do everything they can to improve there.

The greeting felt authentic and our waitress (Mary) was capable, warm and attentive. 

Next visit for me is going to be a TuesdayLadies' Night when the Wine-Tini's are only $7! 

Nice concept and great job for a relatively new place!"}
{"text":"Service here is top notch, and the wine and atmosphere is lively and complex.  Make sure to sample multiple dishes, and check out the sliders... you won't be disappointed.  They not only specialize in great wine here, but also barrel and age some of their own.  The Malbec was fantastic, spicy, and fruit forward.  Definitely check out this local gem."}
{"text":"We have been to this location about four times now. We keep going back for the food and service. We always try something new when we go and the food is great is great. The service is also excellent, attentive but not overbearing, and very knowledgeable about the wines and menu. They really make you feel welcome from the time you enter until the time you leave.

The reason for only four stars is more the ambiance. I would have to agree with some of the other posts. It is an open floor plan and just doesn't give the quaint feel that the food and service deserves. I think if they broke it up a little with dividers, booths, or something to give it a little more charm or personality it would be five star all the way. 

We will be back for the food and service!"}
{"text":"My wife and I enjoyed our dinner here last night.  She had the salmon and I had the steak - both well prepared and presented.

The stuffed mushrooms we perhaps the best I've ever had.  Tasty stuffing with a cap just the right size to consume without cutting and loosing the filling.

The menu here is small but the items are done well.  The wine list is extensive and the wait staff can make excellent suggestions.

This night they had a keyboard and singer.  The keyboard was great - even played Christmas tunes.  The singer - not so much."}
{"text":"Its nice inside, not busy, wine was not good, its super quiet so no privacy for business meetings. Our server must have been new and we felt awkward for her. It took several minutes for her to open the wine bottle at our table. Chicken sandwich was so good Id go back just for that."}
{"text":"Food was superb and the wine is great! I'm from Texas and I wish we had a winery that made this same Viognier! I had to leave with a bottle! I can't compliment their service more, it was great being served by Shawn. He was a great guide to Phoenix/Scottsdale's food scene and made us feel right at home! Highly recommend!"}
{"text":"Wow! It's too bad I can't give this place 10 stars, because that's what it deserves.  The moment we walked in,  you feel welcome and at home.  The selection of wine is fantastic and they are as passionate about their wines as they are with the food.  We had a house red blend, that was perfect and smooth.  
They gave us a plate of bread, brushed with oil, garlic and cheese.  My mouth is watering for more as I type this.  Looking at the menu, everything looked delicious.  We decided on the bruschetta trio, with amazing pairings like fig spread with goat cheese, and other excellent flavors  that will take you on an amazing culinary journey.  We also had the poached salmon roll, which was so delicious, it will tantalize your taste buds. 
Of course we had to save room for dessert and you should too.  The bread pudding is a must!  I'm trying to find the words to describe the how incredible it was.

I could go on and on about how amazing the food was, but what made our 1st visit even more special, was having the pleasure of meeting Chef Nick and his business partner when we were there and nobody could be more passionate than they are about the food and wine they serve and it shows 100%.
We will return soon and look forward to seeing this jem succeed."}
{"text":"Wow.  Where to begin...I went here with 14 women from my church for a women's social.  We reserved a table for 15 during happy hour.  The tables had menus featuring the happy hour glasses of wine and the half price appetizers so that's what most people ordered.  Our waiter was very nice, but wasn't at all quick to take our orders.  Two of the ladies waited 30 minutes just to order a glass of wine.  After being there an hour we had to request that the owner send over our server so we could order food.  The food was good, the music and ambiance were very nice.  If my story stopped there I would have given this place 4-5 stars.  So, about 30 minutes after I left I got a call from one of the girls that had stayed to finish her drink.  She was sobbing.  She said that she and three others had stayed, two of whom ordered dessert and coffee.  The owner walked up to them and chewed them out for 15 minutes about how our group hadn't spent enough money, were loud and took up too much space.  OH MY GOSH!  Who does this?  First of all, the place was half full at it's fullest.  Secondly, everyone would have ordered more if our server had been more attentive.  Three, we ordered from the menus they provided - the prices were low and they were promoting happy hour.

Will NEVER go back."}
{"text":"I hate giving a 1 star rating, but here is the experience or lack of.

The food was \"unique\" to say the least.  The server said and I quote \"it's a new chef and his dishes look really great\".  To bad the new chef didn't put a lot of emphasis on the quality part.

The pasta primavera was, unfortunately to say, nothing short of inedible.  Pasta that was under cooked, a sauce that was non existent and literally no taste at all.  Basically horrible.

My significant other had the fish tacos.  Now I've had a few fish tacos in my life, and this was basically deep fried fish in a tortilla with tartar sauce.  No kidding!!!  We sent it back as it wasn't anything like the menu described.(way way to much breading and not a hint of spice or seasoning).

There was only one female server who seemed disinterested in the customers and more focused on talking with another server.  Tried to rationalize how the fish tacos where really good and \"if I was sure I wanted to send them back?\".     

So quick recap- service not good, food horrible and I don't even want to go into the Jack and Coke that was again \"unique\" but not in a good way."}
{"text":"Finally used a living social deal that was about to expire. They had a limited menu the night I went because they are apparently in the middle of making changes to it.  Too bad because I was looking forward to the salmon. The salmon and steak dishes we had were undercooked.  Salmon looked like cold sashimi in the middle and the steak (ordered medium-rare) was more like a flash seared.  I didn't mind the temp but my friends weren't big fans. The best dish was actually the pappardelle bolognese. Portions are not very large for the price...we ended up at in n out after our what-would-have-been $90 dinner. Not worth the drive from central Phoenix imo."}
{"text":"BTW:  open face sandwiches are a fancy name for bruschetta.  Very good!!  Also, Shawn was the BEST server!  So fun, friendly, knew the menu (great recommendations) and we didn't want/wait for anything.  Bravo!!   Going back for their wine deals during the week!"}
{"text":"Ok, yes - I admit, at first I was a little hesitant... Three courses and three wine pairings later, I found that it was fabulous. 

I started with the artichoke appetizer--Delish.  Salmon was tasty and was made with a Little spice (red crushed pepper on top). I love when the fish is made with a wood fire oven, or at least seems that way.  The broccoli and rice was made with cranberry fruit!! Such a unique twist (get it??). I split the bread pudding and pear dessert with my friend. Both great - pear could have been made to warm at would have been better. 

Good Resturant week visit!! 

I'll be back for a regulor visit sometime soon!! Friday night vibe was good (little bit older crowd) but nice and relaxing - live music and I loved the decor."}
{"text":"My last experience was much better because now the bruschetta feels like nothing special and they don't offer the grilled artichoke hearts either., They have cut down on quality. I would not go there again."}
{"text":"This is a very small and cozy place.  We really enjoyed our dinner and our nice quiet time there.  We had the calamari and stuffed mushrooms for appetizers.  Then we shared The Twisted Salad.  We then each had the 10 oz Sirloin.  For desert I had the chocolate lava cake.  My husband had the bread pudding.  Holy Moley!  It was all DELISH!  I had the Dry Rose wine and he had one of their IPAs.  The only thing we would do to make this a 5 star place would be to have a little bit more comfortable seating and table linens.  Otherwise this place is just perfect!  The owners even came over to make sure we were enjoying our dinner and thanked us for coming in.
We'll be back!"}
{"text":"My steak was exactly as I requested, medium rare! The wedge salad was yummy too! Everyone at our table was pleased with the appetizers and their chosen dish. The portion sizes were perfect, not too big and not too small!  

Courtney was great and very helpful in selecting a wine. She offered tasting before we settled on a 2012 Cabernet. Their label wine, Gold Petal, was delicious!!! 

Thursday, Friday and Saturday night has live music. There was outdoor seating but we chose to eat inside! :) very nice dining experience and very reasonable prices!!!

-Sammy Goodfella (with Mila, Angela and Misty)"}
{"text":"This is a great addition to the area.  I am glad we have another choice where to go for mom's night out.  It is a cute place with and interesting menu and wines.  I was not aware until I went there that they make their own wines, and some of them are pretty good.  I was also surprised to see Four Graces Pinot Noir in their list. That was my latest discovery in Oregon and is one of my new favorites.  I couldn't believe they have it, since it comes from such a small winery in Oregon.  I loved the Shallot marmalade bruschetta, it was very tasty.  The salmon roll was really good too.  On Mondays they have a deal for a chef's choice pizza and a bottle of their wine for $20.  When I went with my hubby for Happy Hour, we had the sliders, they were very tasty.  Good place to hang out and my hubby could have his margarita since they have a pretty full bar."}
{"text":"They are not just a wine bar, but a winery.  They make their own wine.  I happened to be invited into the back room by Frank, the owner after chatting about Napa and Sonoma counties.  Frank let our small group sample some of the wines he is about to bottle and even some that needed to age more before he would bottle them.  It was a tutorial for my pallet.  I could perceive here better than my Napa Valley wine tours, that different elements in play, Tannins, residual sugar, think I too can now tell when wine is too young.   It was a lot of run

For happy hour food, there are (sliders), which were large enough I didn't order anything more.    

After a while a couple of guitarists started setting up to play music.  We order another round to see if they were any good.   But, \"Wow!!  right out of the gate their first song was a Gypsy Kings favorite of mine, \"Moorea!!!\"  We stayed for their whole first set.  These guys were great!  They reminded me of the flamenco shows that were  at the Hyatt Gainey Ranch a few years back.  

Great winery with live music on the weekends!"}
{"text":"My wife and I had dinner and wine here during their last week open. The food and wine was fantastic as always. It is unfortunate that Twisted Rose closed its doors. They will be missed."}
{"text":"I really liked the decor and the laid back atmosphere of the place.  The wine was also very tasty, I tried a couple of very explosive tasting wines.

The stuffed mushroom was not very good.  4 comes with an order and its like 7 dollars (no they're not giant mushrooms, they're normal size).  They overstuffed the mushrooms with a giant glob of meat that tastes strongly of breakfast sausage.  Its good.. just wish maybe they'd halve the filling and double the number of mushroom caps.  The glaze was good too.  Just too much breakfast sausage to mushroom ratio.  A little something green would have been nice on the dish too, like parsley or chives to brighten it up a bit.

The steak medallion dish was decent.  Nothing to write home about, it came on a pad of mashed potatoes and a few stalks of asparagus that they cooked the hell out of.  They also had a few slivers of pepper on top too...  weird..  maybe just for presentation?  You can tell it was sitting there a while too because it was barely lukewarm by the time it got to me.  The potatoes were hot though.

The fettucine alfredo was actually the best dish there.  The shrimp was slightly undercooked, but preferable to overcooking.  Lots of cheese in the sauce.  The oil separates out when reheated, so best to finish the dish there.

All in all, I like the decor and the wine.  Food wasn't great so just snacking on appetizers is probably best."}
{"text":"Cool, new place to grab a glass of wine in Scottsdale.  The bartender was great - super friendly and explained everything to us.  We tried a glass of white and red and really enjoyed the wine.  The clientele is definitely older, but worth checking out in the afternoon for a glass of wine."}
{"text":"My wife and I stopped in for date night the other day. Very nice place. The decor is very nice. The owner/bartender was very pleasant. Service was great. They have a nice patio area but we sat at the bar since it was hot that afternoon. 

I had a taste of their Chenin Blanc which I really liked. I also tried the Estrella Chardonnay. I didn't like that as much, it was a bit tart for my taste. I do prefer creamy, buttery chards though. I also did a whiskey flight which I really enjoyed. It's not on the menu, ask for it.

I had the steak sandwich for dinner which was delicious! Their chips were very good as well. 

We had a great conversation with the owner. Hopefully they will start doing regular wine classes. If they do that I can definitely see us being regulars their. Regardless, we will definitely be back. We have already invited a group to join us for happy hour there."}
{"text":"My husband purchased a groupon here and so we decided to have our date night there last night. We have a 1 year old so a date night out is a rarity and we had the best dining experience. The service was the best! I believe the server's name is Sean and he is absolutely wonderful. Very patient and helpful with the menu, also very attentive. 5/5 and more if I could rank the service. Now on to the food: Wonderful! We split the bruschetta with sweet fig, shallot marmalade and proscuitto and they were all wonderful. I had the chef's special of the scallops, they were seared and seasoned to perfection and the seaweed salad was to die for. My husband had the salmon which he also liked. For the wine I couldn't decide on red or white so Sean graciously brought out samples of the legacy white and the malbec. Both wonderful but I ended up going with the legacy. Hubby had a Dogfish IPA which was very smooth. Did I mention they also had live music? And not the booming/\"can't hear your own thoughts\" kind, but the timeless Spanish guitar and singer. All in all I absolutely plan on coming back here again and again. Great food and service to self-proclaimed foodies... sold."}
{"text":"I think Twisted Rose is the best kept secret in North Scottsdale. It's my new favorite dinner spot. It has a vibe of a quiet, local neighborhood restaurant in San Diego more than the corporate chain experience that permeates most of North Scottsdale. It's easy to park and they have a really cute little patio area. The staff is friendly and helpful.

I am a serious foodie, so regardless of the atmosphere, the food has to be good or I am not going to be happy. I've loved everything we've gotten there.

The stuffed mushrooms with crab are beautifully presented with a very tasty sauce...not sure exactly what it was, maybe chipotle mayo. The other things we've tried and loved are the chicken piccata, burger, short ribs and cheese and meat board.

The prices are a bit lower than the average North Scottsdale restaurants and the portions are big, so it's a good value. They have of course a large wine selection including some wine flights which are always fun. 

Highly recommended. Net time I go I'll remember to take some photos. The entrees come on triangular shaped plates which is a nice change from ordinary plates."}
{"text":"I'll start with the reason why I gave 3 stars and not 5 stars.
Ambience was terrible. When I go to a winery I don't expect it to be like a night out at a club; however, when you go out you want the environment to be appealing. There was no music (non that I remember), few crowds, quiet, and the servers were in jeans. 
Bruschetta was not up to par. It was made on regular toast, small, thin, and flavorless.
Mushroom risotto, Twisted burger, and Mac and cheese were on point!! Like amazing. The risotto was vegetarian so if you have a larger appetite I recommend adding a protein.  
The service was excellent! 
Overall, my husband and I enjoyed the meal but the overall experience may be forgetful when deciding on a future date night."}
{"text":"The service is good. The people is welcoming, but the food is cold. I do not enjoy cold food. The flavor was good, but its too bad that they are not watching the temperature. Got a feeling that after it was prepared, it sat on the counter too long waiting to be picked up. Because we did have a long wait for our food. I ordered the burger. Well-seasoned i must say, but too bad that it had a flavor as if the grill needed to be cleaned out of the burned ashes of previous burgers. My husband liked his chicken, but the price was exagerated for only one piece of chicken... Almost $20. I thought it was pretty abusive.

The rest was fine. The ambiance, service, music, patio, cleaningless, location, atmosphere, and they get an A for effort. But boy! They need to pay attention to the quality of the food."}
{"text":"Good food, Great wine, Awesome ambiance, and Fantastic people! We had a great time and LOVED the unique and very reasonably priced wine as well! Had a great time and can't wait to get back!"}
{"text":"I took my mom here for brunch on Sunday and we had a great experience! The food and wine was amazing and the staff was very warm and welcoming! The chef even came to our table to make sure everything was to our liking.  I will definitely be back!!"}
{"text":"I'd purchased a deal for this restaurant, not having heard of the place before, and I'm glad I did. The service was good, the wines that we had were great, and the food was amazing. I had the chicken piccata and my husband had the steak and we both thoroughly enjoyed the food. We usually split dessert if we're out to eat, but we couldn't agree on which to get, so we both got our own. I chose the bread pudding and he got the lava cake. My husband enjoyed his lava cake, and the bread pudding was AMAZING. I didn't share any of it. ;) We live a ways away from here, but if we're in the area again, we'd definitely go back."}
{"text":"The lunch specials are awesome as well as the beers and wines. 1$ draft Tuesdays and Thursdays... Amazing"}
{"text":"This place needs some customers! Last night my husband and I had a great date night at this place... It's not in the best location as it's within a business complex that you can't see from the main road. The decor is nice and they have worked hard to make the patio a nice place to hang out too. 

We both tried some of their Gold Petal wines, I tried 5 wines and I really only enjoyed one of them... although I finished all (no alcohol abuse on my watch). I do consider myself a wino; my pallet is for a creamy chardonnay to a dark fruit bomb like a petit syrah. To me the wines I had were lacking something; it's hard to say exactly what though, opened past prime time perhaps? The wine I liked the most was the Chenin Blanc. They do serve other wines as well so don't let this sway you from going and you never know, your pallet may enjoy their wines. If wine isn't your thing.. try a scotch flight (my husband did and he said mmmmm). They have mixed drinks as well so you can find something you'll like I'm sure.

The menu isn't very large but I think it's a good mix of food. They have a 4-5 food items offered on their happy hour and some savings to be had on drinks too. HH is at the bar and it was posted to be from 4-6:30 M-F. My husband and I both got sandwiches and they were both made well. 

The owner was working the night we went and she told us of some of the ups and downs of the restaurant business... she was very nice and attentive to our needs. 

I do have some suggestions to the owners based on my previous experiences with other wine bars. 1. Events? Where are they posted? I couldn't find any calendar of events on your website or on a Facebook page. Check out WineEvents.com... I find a lot of wine events on there. Events help to bring in customers... my old stomping grounds had a \"wine class\" every week where 4-5 tastes would be offered and an education about those wines would be presented by the wine maker or the wine distributor. A small buffet of snacks offered as part of it and the fee would be $5-10/person. It's a good way to start to develop your regulars. 2. Relax/Lounge area? A lounge area is always good... a few couches setup in a separate space with tables to place your glass and small plates... you have the perfect spot for this by the TV on the wall next to the wine room.

That is all for now, we'll be back and we'll be bringing some friends!"}
{"text":"I tried this place about one year ago and had a great experience. However, we just went back last week and it was not very good. The food was poorly cooked and not very good..the server was rude and you could tell she was just trying to do very minimum to keep us happy, and that was pretty bad. Also, we asked questions about the wine and she didn't really know what she was talking about and over charged us on the bi, as well. I am sorry to say that I will never go there..ever. Waste of time and money for a horrible experience.,"}
{"text":"Awesome lunch spot.  Turkey mango sandwich and mac was fantastic.  Fast and perfect service at the bar.  Every dish has a nice surprise to it.  Definitely coming back."}
{"text":"This place was incredible! We found it on Groupon and decided to give it a try. We went for Sunday morning brunch and it was busy. All I can say is that the food is superb, the wine is divine and the service is exceptional. Definitely go and check it out. You will not be disappointed!!"}
{"text":"We went on a busy Saturday night.  Service was good and the server helped us with making wine selections based on our preferences.  We settled on the chardonnay and we both enjoyed it.  The food menu is a little limited with the entrée choices, but everything we ordered was prepared well and very tasty.  The chef even came out to check on several of the tables, including us, while we were there which is nice to see.   

We live nearby so we are excited to have a fun new restaurant in the neighborhood."}
{"text":"Went to lunch with my wife today, and we decided to go here because I have haven't been. My wife got a cheeseburger and I got the pulled pork. We were quickly seated by one of the co-owners, and our server arrived shortly thereafter with waters. 

He took our drink orders and disappeared inside. We sat on the outdoor patio, where there was a nice breeze and plenty of shade. He came back later to take our orders and after a fair wait the food was brought out fresh. Pork was delicious. It was topped with a blended vinegar and mayo coleslaw and served with hand cut steak fries. 

The portion sizes were good. The sandwich came out on flaky bun that somehow seemed crispy at the same time, it was delicious. After we had finished eating we were sitting waiting on the check, and the other owner came out to check on us see if we enjoyed the meal and how things were going. Once we got the check paid we were on our way. 

Overall, the food was very good. There was a large selection of wines if you're into that kind of thing. The place looks relatively new, so everything is clean and shiny and well kept. The only really negative comment that I would have to say is that the service was on the slow side. For dinner this would not have been an issue, but for a lunchtime crowd, who is most likely on a time constraint, quicker service would probably do them well. 

All in all, I would absolutely come back here and recommend it.  But unless they speed up their service I would say to stick with a dinner visit if you have time constraints for lunch."}
{"text":"New owners, bad decisions.  Over seasoned and inconsistent dishes. Same dishes at the same tabled that you would think came from two different restaurants. The used to be one of my top three go two places. Now I'm embarrassed that I took a large group here.  So sad about the changes."}
{"text":"A nice selection of his own wines and others. Food was fantastic!   Had the stuffed mushrooms and pulled peek sliders. Yummy!  And everyone was very friendly!   Great combination. . Loved the atmosphere!"}
{"text":"Went to this new place to try it out on their opening night. Excellent atmosphere, and the staff really had it together! Their wine selection is excellent and reasonably priced. I look forward to going back to try Chef Nick's food - it looked excellent! The owner Frank came over to introduce himself and chat for a bit, which was awesome. Keep up the great work!"}
{"text":"Not a bad place if you're in the neighborhood.  

The roasted artichoke was OK but not a great value when priced at $12.  Our three choices for bruschetta were the prosciutto, bell peppers and caprese. None of them really stood out to me.  The gold standard for bruschetta in the Valley remains Postino.

I have to say they have fantastic prices on their wine even if you pay full price.  Their pinot noir was passable but certainly won't win any awards."}
{"text":"Great service and food. My strip steak was cooked to perfection. One of the owners greeted us as we were leaving, opened the door and talked with us for a while, very nice. We would definitely go again."}
{"text":"awesome spot. live music on Fridays and Saturdays. We had the petite Shiraz. I had the beef medallions, and the sauce was delectable. My wife had the Alfredo with chicken as they had run out of shrimp ... the entrees are spendy, but their happy hour (3-6) is very fairly priced. the service was great; our server was well-versed oenophile. definitely worth it if you can find it!"}
{"text":"Great food. Great service. However, we used a Living Social for two dinners with two glasses of wine... We upgraded our wine to a bottle... The manager did not grant the correct price discount. We had to argue the price difference. Shady! Just take advantage of your voucher and get out! Mary, server, was awesome."}
{"text":"They get a 5 for my experience thus far.  This is the crew that runs the most excellent winery in Fountain Hills, Casavino.  They have many different wines unique to this shop though.  The Orange Muscat is very tasty.  The woman was very happy with her \"Wine-tini.\"  The bread served while we had a couple drinks was nice and tasty.  The crew was good, the bartender was good too.  Only as talkative as you wanted but not bothersome.  We have yet to try the food...as we ate before we stopped in.  But the menu looks delicious and we are anxious to come back and try the food menu in addition to more delicious wine.  The decor is also very nice.  I hope they meet with success.  We are anxious to get back there."}
{"text":"Have been back twice now.  The people that work there want your business and will bend over backwards to ensure you're satisfied.  Great flavor on the food.  We've tried the pork stuffed apple which was amazing as well as the artichoke and several bruschetta offerings.   All were great!  Entrees were huge and we needed a to go box because we HAD to try the bread pudding!!  Holy knock my socks off divine!!! Chef came out and spoke to us and BethAnn made her rounds and always had a smile or witty comment for us."}
{"text":"Came here with a coworker for the happy hour since we were both late taking lunch (arrived around 3:15 p.m.). We had a very good time! Our server was very friendly and welcoming - I didn't catch his name, which I regret. 

I had the Angus burger. My coworker had the pulled pork sandwich. We both had fries for our sides, although the also offer side salad, coleslaw, and house-made chips. The Angus burger with cooked exactly as ordered - medium. My coworker complimented the sauce on the pulled pork sandwich and said he would order it again the next time we go. 

Our server made white sangria that he offered us samples of, and it was incredible. Sweet and tangy, without an overwhelming alcohol taste, and I don't usually like white sangria, but I'd order this again next time! This time I opted however for a white wine, the Savignon Blanc which was on the happy hour menu. Side note: their happy hour runs from 3 p.m. to 6 p.m. Tuesday through Friday. 

Peter the owner was extremely nice and easy to talk to and checked on us before we left. He and his wife are the new owners here.  I will definitely be returning to this location in the near future and giving other things on their lunch menu I try. 

They are a little hard to find because they are tucked away, but they are in the same parking lot as the Savers store. It is worth looking for their location for good food, outside seating, and nice service. Next time I go here I would definitely love to give the Chocolate Lava desert a try!

Overall: A
Great service, tasty food, and ambiance make this a great lunch / happy hour locale!"}
{"text":"My fiancé works near by and told me he comes here for lunch often. I finally got to try it and was amazed. Very creative menu!! I had the salmon sandwich and Mediterranean salad. Wow!! I was tempted to like my plate clean. We got Creme Brûlée and it was like none I've ever had before. Really great recipes going on in this place. The atmosphere and decor is warm and romantic. Great for dates or group dinners/lunches. I can't wait to go back!"}
{"text":"Heather R. and I had the absolute pleasure of happy houring at Twisted Rose yesterday evening! The cuisine, service, wine, prices & quality were superb.  Both the partner & the executive chef stopped by to chat for quite a while, they were quite delightful! I can't stop raving about the bread pudding, it was distinctively summery due to the raspberry addition.  I adore that the chef uses their wines creatively in the menu, the addition adds another level of flavor.  Sidenote: the powder rooms are adorable and spotless! I'll be back with a crowd very soon."}
{"text":"The menu isn't as sophisticated as I had expected, but the prices are very reasonable and the food is very well prepared.

I had salmon, which was prepared and presented perfectly. This is a well-hidden place so pay attention where you're going or you'll pass right by it. 

Definitely will be returning there!"}
{"text":"I was in Fountain Hills looking for some good wine and food.  Walked in not knowing what to expect. Bartender gave me a menu of wines and food and asked if I had questions. He then informed me that many of the wines were made in house, which sparked some good conversation. They are very well educated in their wines and their wines tasted great.  I was very happy with finding this place so far.  As I looked at the menu, i was intrigued by the interesting dishes. I ordered the Salmon, and it was incredible. Perfeclty cooked, flavors have to be experienced to describe. I highly recomend this dish. I met the Chef Nick and he seems very passionate about his food.  He was a pleasure to talk to and he enjoyed meeting other patrons. Also met the owner who shared good stories.  Overall one of the best wine bars I have been to! Wine bar may be too limiting. One of the best restaurants i have been to."}
{"text":"We have been going to Twisted Rose since it opened. We have enjoyed many unique and delicious meals with a variety of wines they offer. There is always something different to try and the staff is tops and welcoming! It is a great place to be able to wind down at the end of a busy day, or to have a delightful dinner for two or with friends. We wish them years of success!"}
{"text":"The viognier was great but my salad tasted like someone poured 10 lbs of salt on it! Go here if you like your food super salty."}
{"text":"I'm just going to come out and say it - I would not come back. I had high expectations for Twisted Rose Winery and Eatery and TRWE fell below on every single one.

My husband (J) and I came here for lunch during the middle of the week. There was ample parking outside and as we walked up, we commented how nice the small patio looked. There were quite a few patrons enjoying the patio but no one inside. It was completely dead - not even a waiter in sight. J and I waited near the hostess stand before I abandoned J to use the washroom to wash my hands. The bathrooms are cute with wine barrels and kitschy signs about drinking wine. When I came out, J was finally being seated outside. J said a waiter took pity on him and seated him; apparently there wasn't a hostess during lunch. 

We waited on the patio with menus for a while before our official waiter showed up to take our drink order. Just water for us boring folk - the waiter tried to talk us into iced tea or an Arnold Palmer. We politely declined and he came back later with two empty water glasses and a wine decanter filled with water. He then disappeared for quite some time. At this point, there is only 3 other groups of patrons dining on the patio - one older gentleman, a group of 3 women, and a middle aged couple. The place is not busy, but waiters are scarce. 

Looking at the menu, all lunches come with kettle chips. The menu does not go into detail about the chips. However I overheard a waiter describing the chips to another patron and he said they were Lays Kettle Chips. I was a little disappointed because at a fancy winery/eatery, I would expect them to make their own in-house chips. Vetoing the chips, I decided to splurge and pay an extra $1.50 to upgrade my side to bacon mac and cheese with tomatoes. (Another disappointment as it wasn't very flavorful and the promised bacon was non-existent.)

When our waiter finally came back to take our order, my husband decided to order the lunch special of white fish tacos for $10. He did not upgrade his side and received Lays Kettle Chips with two tacos. The tacos consisted of white fish (probably mahi mahi) with a drizzle of some sort of green sauce. The flour tortillas seemed hard and stale. He didn't enjoy it and the one bite I had wasn't anything special. 

I ordered the Fresh Turkey Delight - which is a turkey, mango, gruyere and mustard sandwich for $12. I will say that it tasted good, but after about 6 bites, it was gone. It was the tiniest sandwich I have ever received at a restaurant and for $12, I expected a lot more bang for my buck.

I would also like to point out that it took well over 20 minutes to get our food. When we finally did receive our food, my husband asked for the check since we had to get back to work. Our waiter took his sweet time getting the check to us and when he finally did, he told us today was not a good day.  I could not agree more and we hightailed it out of there. 

Overall, my experience here was rather lackluster and disappointing.  It took forever to get our simple food, the actual food wasn't that good, and for the price, the portions were tiny. Definitely will not be back."}
{"text":"Seriously amazing dinner tonight for the Wine Club! Strawberry Spinach Salad, Pheasant for dinner (yummy) & the most amazing Bread Pudding for dessert! I can't drink tonight but everyone had a 100 point wine plus a $500 wine & $1000 wine & said they were awesome!"}
{"text":"It's true, you can't judge a book by it's cover.  Hesitant to try a place located in a small strip storefront.  Shows what I know!  I agree with all the other reviews, good food, wine, atmosphere & service.  Expected glorified bar food but was pleasantly surprised to find a creative menu.As a pescatarian it's hard for me to find something on the menu at the places my husband likes to eat (heavy on burgers, Mexican, chicken and fries) but I had a number of choices and my husband loved his chicken salad sandwich on a croissant.  PLEASE EVERYONE GO THERE, as I want them to stay so I will have a place to eat that I actually like.

Also, my server Kyle (?) was as nice and accommodating as it gets."}
{"text":"What a wonderful experience.  My wife found this place on Yelp so we thought we would give it a try.  The food was excellent.  

We ordered the bruschetta to start.  The mozzarella was amazing and the bread fresh and light.  I had the flat iron steak, which was prepared medium rare, with a spicy light tomato sauce for dipping.  My mouth is watering just thinking about the taste.   

My youngest daughter had the Mac and cheese, which she proclaimed better than Morton's (which is saying something).  

My oldest daughter had the hamburger, which was freshly made and quite delicious too, although she felt is was bit overdone ( I liked it).  

My wife had the salmon, which was a little dry, but sooo good.  

The wine selection is excellent and I suggest you have the waiter make some suggestions, cause they know their stuff.

But the best part about our experience was the atmosphere.  This is a family owned place and the owners make you feel like you're at their home.  Olga, a regular, was celebrating her 50th birthday.  We were offered cake and invited into their conversation, which made the whole experience better.  The owners showed us their wine bottling area and gave us a brief history of all the vino that flowed so freely.

I cannot recommend this place enough and hope they continue to thrive."}
{"text":"There are times when you find a hidden away treasure. Twisted Rose is one of them. The wines are locally made and rival much more expensive wines from California and other regions. They have an obvious passion for their craft and are happy to share it with their customers. Prices per bottle are the same as some places charge per glass. This family owned winery is too fun. They love their wines and it reflects in their generosity to provide samples and suggestions. The food complements the wines and is a delight to enjoy in this classy, upscale atmosphere. They are a little hard to locate at first but once you find them you'll be back very soon and with a group of friends to share your new amazing discovery. Get over there ASAP and enjoy some great wine, fantastic food and warm friendly people who obviously love what they do."}
{"text":"I wish I could give a 3.5. We made last minute New Year's Eve dinner reservations for here and I'm glad we did. I made them for two and at the last minute our sons decided to join us. When I called, they upped it to four no problem.
Very welcoming. Cozy space. Everyone was very friendly. Our server was nice, but we felt like it took a while to order. Once we ordered, it took a while to get our food. Even the Charcuterie, which one would think the kitchen could get out fairly quickly.
The owner or manager came by and was very friendly and accommodating. Offered me a taste of the Cab Franc which was quite tasty and I ended up ordering a glass. When the food finally arrived, our sons' burgers and fries were tasty, but not hot. My beet salad was good, but I thought heavy handed on the walnut butter (I think that's what it was). My husband's steak was perfectly cooked and mashed potatoes were quite tasty (albeit not that hot temp-wise). 
We are friends of the food-service industry and let them know about the temps, not to complain, but just for their own future improvement. They were extremely apologetic and offered new orders, but we declined, as that wasn't our intent. 
All in all, great place, great wine, great food, with some room for improvement regarding execution. We'll definitely be back!"}
{"text":"4.5 stars!

Today was my second visit, and I like this eatery!   The ambience is laid-back, despite the gorgeous marble bar counter, distinctive winery flourishes (I looked for beer taps,  but didn't see any), including cut-out kegs doubling as decorative shelves, and one flat-panel TV (this isn't a sports bar). Matt and Shawn (the latter had been the former manager of neighbor Four Peaks) are gracious as  always.  Chef Indy remembered me from my first visit, as the guest who ordered the spare ribs without the BBQ sauce and the chocolate bread pudding, which he made a chocolate ganache especially for me, because I couldn't have the regular chocolate sauce laced with corn syrup.

This afternoon's dishes all tasted terrific, and I enjoyed the textures:

Calamari app- Menu says $10, and 3.5 weeks ago was half-off during happy hour.  Menu still lists the price at $10, but my receipt said $9, with $2 off during HH.  Loved the crunch!  The calamari was prepared just the way I like calamari to be, and I know Mom would love it, as well.  The accompanying garlic aioli and marinara were great, as well, with the aioli being a little saltier than I'd prefer.  My only gripe is that for $9 original price, I didn't get a lot of calamari, so I'd only order it during HH...  http://www.yelp.com/biz_photos/twisted-rose-winery-and-eatery-scottsdale?select=Tc4nAKLyAECUuNVzJH0o2w#Tc4nAKLyAECUuNVzJH0o2w

Twisted Burger- $14, and comes with house fries.  Matt had told me about TR's mac 'n cheese more than three weeks ago and said that he could sub it for the fries, if I wanted.  The burger came with brie, perfectly-crisped thick bacon (!), arugula, and tomato jam, which I'd asked for on the side.  It's made with sun-dried tomatoes in a white wine and sugar reduction.  It added a definite sweetness to the burger and complemented it well, but for someone with inflammation issues, I'd skip it next time.  (Tomatoes, part of the nightshade family, is one of many inflammatory foods.)  The mac 'n cheese was DELICIOUS!  Today's preparation consisted of cheddar, parmesan, and provolone, and a little bacon.  I had to stop myself from eating too much!  Again, this dish is a little pricey for me, especially since I can't have the tomato jam...  The great quality of the mac 'n cheese kind of makes up for the price, just a little.  http://www.yelp.com/biz_photos/twisted-rose-winery-and-eatery-scottsdale?select=SAuXcPnQ-Quc8EI3W6e2uQ#SAuXcPnQ-Quc8EI3W6e2uQ and http://www.yelp.com/biz_photos/twisted-rose-winery-and-eatery-scottsdale?select=AZl3l-786NTEWyX8ephxKg#AZl3l-786NTEWyX8ephxKg

Double Chocolate Lava Cake- $8, and usually comes with vanilla ice cream, which contained corn syrup that I can't have, so  Chef Indy (sp?) offered to whip up some fresh heavy cream and granulated sugar.  He also offered to make a caramel sauce when I asked if instead of whipped cream, I could have some creme anglaise.  He wasn't sure which of the two I wanted, so he decided to give me both!  After the first bite of one lava cake, though, I knew the whipped cream and the caramel sauce were not needed.  This dessert should be called Better Than Sex, and really, what better metaphors for sex are there but volcanoes and lava, eh?  And boy, was this dark chocolate lava hot, thick, and decadent!  I'm getting excited just thinking about it!  ;)  I'm sorry I didn't take a photo of the lava oozing out... I couldn't stop eating to take other photos...  If only there weren't other people present, I'd have licked that plate clean!  http://www.yelp.com/biz_photos/twisted-rose-winery-and-eatery-scottsdale?select=fLYO4YN5-mYty5nbRGvlFw#fLYO4YN5-mYty5nbRGvlFw

Btw, Thursday night is Ladies' Night, which means happy hour* deals ALL DAY for women.  Also, live music entertainment is held from 6p to 9p.  I enjoyed it, and so did the other women who filled up the main dining room.

*Happy hour deals changed since my last visit three and a half weeks ago.  It used to feature half-off appetizers, but now it's just $2 off the apps.  There are wine specials, too, both by the glass and bottles.  If you feel like splurging, try the Sexual Chocolate by Slo Down Vines, $45.  Very good!"}
{"text":"Highly recommend, this place is a gem!  We went out for a date night on a Saturday night.  They were busy, but the service was impeccable.  The waiter that served us was very knowledgeable and patient.  He spoke with us about their wines and the best item to pair with our dinner choices.  

The wine was EXCELLENT!  I had a white and my boyfriend had a red, we both got a second glass (uncommon for us) because we liked it so much. 

We both loved our meal, I had the chicken and my boyfriend had the steak.  My chicken had this amazing chili sauce that was outstanding."}
{"text":"I'm sure this could be a 4-star place for me, but I had a good time, not great. A coworker and I came in after work to catch up after HH. We shared the grilled artichoke and shrimp cocktail over a few glasses of wine. The service was good and the food and wine was okay. Might have been just average choices on our part which is why I wasn't wowed. I'd definitely come in again though"}
{"text":"Came back for dinner recently.   A couple things set me off.

1) The wait staff was very friendly and accommodating however they were both obviously smokers.  The gentleman who seated us absolutely wreaked of smoke and every time he spoke I wanted to gag - and I'm sure he was totally unaware.  This did not set the tone for a good experience.  

2) The menu is very wine focused.  The food items have NO descriptions so if you want to know what Tuscan Chicken Sandwich means, you have to ask.  Same with everything else.  Okay, I get that it's a winery but if you are going to serve food, you need to atleast give a little detail about WHAT you are serving.  

Enough rants.  We weren't drinking and the food was okay, not spectacular and not horrible.  Just not very inspiring and not enough to make me want to make a special trip back.  One surprising positive was the side salad.  It was just a simple lettuce salad but the dressing was perfection.  I could have passed on the sandwich and just enjoyed the salad alone. 

I still like the looks of the patio but with the smoker thing going on, that scares me a bit.  If you want to do some wine tasting and have a bite to eat along with it, I think this might be your kind of place."}
{"text":"We were surprised that this place changed hands.  The menu is the same, and the food was quite good.  The wine is no longer made in Fountain Hills but is locally made.  We had a white cab that was on special and it was quite good.  I still love the bruchetts and artichoke.  This is a casual place, but still nice."}
{"text":"I am not sure why other people gave this restaurant more that 2 stars. I had a terrible dinner.

 The appetizer called a Charcuterie plate was dry, bland toast triangles, squares  of cheese like we used to have in high school, some dried cranberries and almonds. 

Their Twisted Burger, which was supposed to be their specialities, had so much overly sweet onion jam, barely cooked bacon, unmelted cheese and tons of mayo that it was inedible.. The fries were cold. And the most surprising part was the wine pour, barely 3 oz. in a big wine glass. The owner was running the bar. and the waitress told us that's all  he allowed.  The wine was really good, and was from their own winery. You would think they would give at least a normal pour as bottles are available for purchase. Talk about poor marketing!  After commenting to the waitress, the second glass had a little more. I asked to taste a wine and was told the bottle wasn't open and i would have to order a glass. Wouldn't it have made more sense to open the bottle, as I may have purchased it or at least had 1-2 glasses. Poor marketing again.

This was the second time I tried this restaurant, knowing it was bad the first. But wanted to give them another chance as they were new the first time.  I would have thought they would cater more to their patrons, as this time of the year, most of us in AZ are residents and it could become one of our favorites.  I hate to see restaurants destroy themselves when a new chef and some better customer service, along with a customer-friendly owner could surely help.

* By the way, the food pictures below were not even on the menu."}
{"text":"My wife and I decided to try this place after seeing a Groupon. We went Friday night and the place was very nice. Not many people there so we got seated right when we arrived at 7:00pm. The owner spent some time with my wife explaining the various wines they make on site. She gave her a few tastes at no charge and my wife ended up getting a wine flight which she was very happy with. I got a hefe beer which was an excellent choice. We both ordered the burgers which were delicious but a little pricey at $13.95 each. The margarita flatbed was small and nothing special. All in all we enjoyed the food and wine. The wait staff were attentive and the owner couldn't have been better! I hope they survive as the location is not the best and the outdoor patio is basically in the parking lot. They have done a good job of \"hiding\" it from the parking lot. We'll be back but the Groupon really helped."}
{"text":"Twisted Rose has a lot of pluses and a few glaring minuses, so, depending on what is important to you, it is anywhere from 2 to 5 stars.  

The good stuff:  They actually cook here.  For example the french fries are clearly home-made, fresh and tasty.  The fish in fish-and-chips is hand-battered in house, and the fish was a premium selection - halibut.  Three good size chunks of fish plus the fries for $12 is a bargain if it tastes good.  And at Twisted Rose it does.

The chicken picatta was also very tasty, although the chicken was a shade on the tough side.  The faro salad would have been exceptional except that it was served on a flood of whipped goat cheese that looked and unfortunately tasted a lot like mayonnaise.

The service was attentive - maybe a bit too much so - and the ambiance was comfortable rather than luxurious.

Sounds like five stars, but ...

The bad stuff:  Most of the wines are Gold Petal brand, and the one I had, the Chenin Blanc, was not very good -- over acidic with no aftertaste but acid and sulfite.  Other than these house wines, there are only about a dozen unimpressive selections.  

Prices vary, with some good values and some not so good.  Some plates are large and some are a bit small.  You'll just have to sort it out.

Overall, I will be back to try a couple of other menu items and maybe give the wine another chance.

HINT:  Happy hour is 3 to 6:30 weekdays, but it isn't much of a bargain foodwise.  Appetizers are all $2 off, but that's not a lot when a shrimp cocktail goes from $12 to $10.  However, the pulled pork slider is discounted from $4 to $2 and it is a bargain."}
{"text":"Too good to be true. Groupon brunch deal, 4 people, four entree's, bottomless mimosas and bloodmary's for $45. Review were stellar, all is right in the world. We arrived at the rose and once inside, we had a wait time of 25 min.( even though 5 tables sat empty). Who cares, did I mention the bottomless bloody Mary's?  Once seated, I ordered a Bloody Mary and the chefs signature cinnamon roll pork chop. Bloody mary was so so but what are going to do? Well, apparently no pork for me.  They ran out after being open for a whole our. I mean, who would have thought they would sell alot of the chefs signature dish? So I went for the french toast stuffed with mascarpone cheese and brandied grapes. What I got instead was 3 pieces of bread that tasted like they were dipped in grape cool aid and microwaved. A sloppy, doughy mass resembling silly putty formed in to a square.  Who cares, did I mention the bottomless bloody Mary's.  I ate the crust from the silly putty concoction and ordered another Bloody Mary. Well, apparently the bottomless bloody mary has a bottom. I was told they ran out of mix. Perhaps the pork chop order got mixed up with the bloody mary order and then was tossed in the trash.  So instead I had a mimosa that tasted of orange juice and orange juice with a hint of OJ. 

In closing, the servers were over worked, under staffed, the kitchen didn't have a clue and bloody Mary's and pork chops are not for breakfast."}
{"text":"This is a great hidden gem! We went for Father's Day and had the salmon blt and grilled chicken sandwich - both were fantastic. Great homemade chips and kids had the BACON mac and cheese - excellent. We also a sampled a few wines - merlot, malbec and house white wine sangria and each were great. They have many more wine varieties - which we will definitely sample on our next date night!"}
{"text":"This can be a hard place to get to, but once you find it, you are immediately welcomed by one of the staff when you get in. I came with a small party for dinner.  I wanted to have something light because it was still so warm out, so I opted for the beet salad for something light, another had their burger, and the third had fish. The server didn't really explain the beet salad after I asked about it, but I was thinking greens--lettuce and maybe arugula and spinach. Instead it was a strip of beets with lots of cream beside it and a very sugary portion of walnut butter. This was more or less the description in the menu, but again thinking a salad salad. Needless to say I was not filled up. It was $10.95.
Meanwhile, the other people in the party liked their meals  and the bread pudding for dessert was very delicious and well liked by all of us (hence the extra star). 
So if you go, I would skip the beet salad."}
{"text":"I'm so glad that the Twisted Rose is close to where we live, since we've quickly become regulars there.  Today we were there for brunch, which was excellent, as always.  We feel like family whenever we go there, since we're greeted by name by everyone from the owner to the bartender.  The food is fresh, high quality, delicious and reasonably priced.    And the service is always top-notch.  

I had the build-your-own omelet, which I like, since I can choose exactly what I want in it.  My husband had the Eggs Benedict, which he devoured.  The eggs were perfectly poached and they were sitting on thick slices of grilled Canadian bacon that looked fabulous.  

Their wine club is the best bargain in town, since it includes a monthly tasting, as well as many other benefits, including a free brunch each month and two bottles of wine.  They appear to be building quite a loyal following, since we ran into several people at brunch that we've met through the wine club evenings.  

I'm glad to see that they are doing well, since it's nice to see a local business flourish - particularly one where the owners and staff clearly work hard to make every patron feel like a VIP.  I hope their business continues to do well, since we love having a place close to us where we can go for everything from a casual brunch to a romantic evening for two."}
{"text":"Better than I expected! I'm a sweet wine person. Loved the Legend. Also loved mix and matching the flights of wine. The chimichanga was light and refreshing. Not what I expected."}
{"text":"Tried this place for the first time. The atmosphere was ok, seemed to have a decent patio. Service was good. I enjoyed the calamari but wasn't impressed with the farro salad. It was very bland and didn't have almonds like it says on the menu. My friend had the burger which he said tasted like the grill needed to be cleaned. The wine list is a bit confusing, but very reasonable. I would probably go back for happy hour."}
{"text":"I took my girlfriend there for a Valentine's day dinner. It was great, a very nice menu with wine included at a reasonable price. The ceviche was wonderful and the NY Steaks were cooked perfectly. I will return and bring friends next time,"}
{"text":"HIGHly recommended!
Was in the area and wanted to eat good food
Found this hidden jem restaurant
Didnt plan to go here
Awesome food
Great atmosphere, great decor of the place
Fine staff service
delicious chicken plate and tasty steak sandwich
so good we ate allllll of the food and did not stop to take a picture
They make their own Wine and there many choices
We even got the apple crisp
Every bite was heaven
Fine dining with a fair menu price
Already thinking about next visit
Gonna get the same thing again
Hope  u enjoy the food as much as we did"}
{"text":"Awesome food, and a very personable owner. He suggested something I would never have chosen on the menu and it was fantastic. We will go back!!"}
{"text":"Went there for the Sunday Brunch with Sarah.  A nice place.  She had the eggs benedict and I had the chicken piccata.  Both dishes sported a bit of sweetness that was interesting.  The mimosa and bloody mary they served were on the weak side.  I would have given it five stars if the prices were a bit lower and the drinks normal strength.

I just read three reviews that gave TRW&E one star (steve r., Glendale, AZ, 8/25/2013; Jacque R., Peoria, AZ, 9/8/2013; Jeff R., Peoria, AZ, 9/8/2013).  I'm not going to go so far as to drop my rating (still four stars) because the service was good and we left nicely fed (actually, Sarah was full, but she's a small lady), but I can totally understand where they're coming from."}
{"text":"After reading great reviews we thought we would try it and we were definitely disappointed. The music was great, staff friendly but we did feel a little rushed; we were in and out within an hour. The food is tasty due to a chef who can make great sauces but the food quality mediocre at best. We had the beef tornados which probably was tri-tip we doubt it was filet but the waitress did say it was \"like a filet\". The caprese bruschetta had a nice balsamic reduction but was difficult to eat since it was tiny balls of tomatoes and cheese which kept falling off on slightly stale ciabatta bread. This is probably a good place to join co-workers after work for an appetizer and drinks; definitely not worth a trip from Carefree."}
{"text":"I personally love this hole in the wall little wine bar/eatery.  First of all, they bottle their own wine - and let me tell you it is awesome.  It is a little hot now, but the patio is super cute and has a great ambience - bonus they are dog friendly!!.  The food selection could be a little bigger, but I have never had anything I don't like.  My favorite is the ceviche."}
{"text":"We had a very nice Valetine's Day Prix fixe dinner at Twisted Rose.  We had spent the day at the Arabian Horse Show at Westworld and wanted to try a local eatery close by.  I searched *Yelp for something close and this looked perfect.  I was able to make a reservation online which was very convenient.  Although I didn't know about the Prix fixe meal when I made the reservation it turned out nicely.  $90 for a shared appetizer, salad, entrée, dessert and a bottle of wine with dinner and one to take home.  We shared the bruschetta which was very good.  The salads were nice. The house dressing on the house salad a terrific vinaigrette.  We each got the NY Strip with lemon buerre over sauteed veggies.  Outstanding.  The dessert was bread pudding and tasty but kind of a let down after the hype.  A very calm and pleasant vibe.  We saw an old friend and the young man who helped fill water was wonderful.  Glad we went."}
{"text":"I love local businesses who love their customers. This is not a big restaurant, but the plates come prepared full of love! You can just tell when people care. 

We came during restaurant week, it really wasn't too busy (which worried me a little bit) but the food was actually pretty good! I had the baked apple stuffed with BBQ pork to start, which were an interesting combo of flavors, but they seemed to work together. For the main course I had the grilled salmon with rice.... it was perfect, not overdone, and the rice was so good! It was kind of a sweet and savory dish. Dessert was simple, a wine poached pear with a fruit sauce. I think the whole meal was an A+.

What was especially impressive for me were the wine pairings. I honestly think that the wine was what really made the whole meal. Which makes perfect sense to me, as the restaurant has the word \"Winery\" in it's name before the word \"Eatery\". The owner was really nice, apparently, they do make their own wines! (much of the grapes coming from California) 
He took us back into is wine cellar where they have quite a few wine casks brewing up some magic inside them......

Service was great, as I said, even the owner took time to talk to us and show us around. This is definitely a great local spot, and definitely a perfect place for an excellent glass of wine and some good grub to go with!"}
