{"text":"Great place to eat Thai food. I've eaten Thai food at several different restaurants throughout Florida and they are all different, but this place was really good. I ate the green curry( I usually order red curry) and it was really good. The rice was even served in a heart shape. Price was ok. Service was good."}
{"text":"To be honest, the food was 1. Horrible and the 2.service was even worse. Wouldn't recommend it."}
{"text":"Snuck into this place early on a Friday night with no reservation.  Guess we got lucky.  The atmosphere in the restaurant was very comfortable and upscale.  I had the vegetable spring rolls which came out piping hot and crispy.  My friends got the fish cakes for an app that they liked but were not blown away by any means.  I tried one and found it a bit soggy and fishy tasting.  For a main course I had the vegetable green curry.  The sauce was very flavorful but not as spicy as many green curries I've had before.  The flavor more than made up for the lack of spice though.  I was relieved that the tofu in the curry dish was not fried as often tofu becomes a big grease sponge in sub-standard Asian cooking.    The interior is bright and clean and the service was prompt and friendly.  Overall this was a very enjoyable experience off the beaten path in the Tremont district."}
{"text":"My husband and I came here for our anniversary.  We appreciated the private lot.  Got there a bit before they opened and were just hanging out by our car.  The owner came out and told us to just come in.  This was super sweet.  We really appreciated this gesture.  Decor was nice and service was fantastic.  The food was good, but honestly, I don't remember what I got or what it tasted like.  It was really good, but not exceptional.  I appreciated that there were a lot of vegetarian and vegan options.  I liked that my rice was shaped like a heart.  That was cute.  We really enjoyed our food, it wasn't a lot for the price and it wasn't anything super special.  The service, ambiance, and quality will probably have us returning and we would (have) recommended to others."}
{"text":"The only Thai restaurant that is authentic in Cleveland.  tad expensive but worth it"}
{"text":"This was some of the best Thai food I've ever had. I haven't tried one thing here that I didn't like. It can get a little pricey for being a small Thai restaurant but I would still recommend it to anyone."}
{"text":"Nice and cozy bistro. Nestled in the trendy nd up and coming Tremont area. I had the Thai spring rolls and basil fried rice. The spring rolls were crispy and totally savory. The fried rice was was too notch as well. I only wish it was a little more spicy. Still the best Thai food that i have had in Cleveland."}
{"text":"If I could rate zero stars this is what this restaurant would get. We drove 40 minutes to get here before 11pm and the rude server told us the kitchen closed at 10:30. Must change hours and make it known that the kitchen closes at 10:30. Don't waste your time driving here and finding parking unless you get there at least an hour before to order your food before the kitchen closes."}
{"text":"The venue is small but cozy and well decorated. Probably not great for large groups for that reason. There is a small patio for outdoor seating as well. We came on a Wednesday night in a party of three and the restaurant was nearly empty. This made service more personable and fast. I had the kra pow. The chicken was tender and the vegetables were crisp. I felt the sweet basil threw off the spice in the dish. The steamed rice was served in the shape of a heart.  I felt it would have tasted better if the underlying sweetness were omitted.  Overall I would come back again to try something different.  They have various specials throughout the week."}
{"text":"D. and I went here on a Friday night around 8 pm. Despite the cold, there were about 5 parties in the small restaurant. I generally hate going anywhere in Tremont on the weekend due to lack of parking, but Ty Fun is located next to a parking lot and has it's own parking, which is a bonus.   The restaurant itself is small, with maybe only 8 tables and a tiny bar. Although there were other parties, the restaurant was unseasonably quiet. D and I felt like we had to whisper to avoid being rude and loud (this could be because we're used to louder bars, but I really feel like the music could've been louder). Decor is generally comfortable but appears upscale, roses on the table and all that nonsense.   I ordered Gari Gang Kai, a yellow coconut curry with potatoes and white chicken breast. The curry was very creamy but was surprisingly bland. It was actually on the same par as the canned curry sauces you can buy at the grocery store. Presentation was nice and portions were moderate for the price. D. had Ped Talay, duck with squid,  scallops and mussels. He enjoyed it but didn't finish. The waitstaff was very nice and attentive.   Overall, I don't think we'll be back. The food was good, but not excellent for the price and amount."}
{"text":"The curry is incredible!   Try the crispy cup appetizer - it was the best thai appetizer I've ever had!  I would highly recommend this place as being healthy and delicious."}
{"text":"I ordered takeout via Skip the Dishes. Worst Thai Ever. Flavorless, missing the sauce and veggies in my main dish!"}
{"text":"Had THE most boring massaman curry last night - the sauce was bland, potatoes not cooked, and the dish had very few other ingredients. It came with mushy rice which I sent back & exchanged for brown rice, which was also too soft and tasteless. Omg.  I complained, & they discounted my meal 20% - which was nice. However, it was my 2nd bad meal in a row - many months apart - I hope I never go back."}
{"text":"We like Ty Fun a lot. They have a liquor license, a major plus for any dining experience. This is known in local parlance as \"being civilized\". The owner/operators, Sonny and Greg, are fun, friendly, and gregarious. The place is beautifully decorated and clean. The menu is even good looking! It is calm and pleasant; no glaring lights or crazy views of the kitchen (sometimes that kind of view can get a little chaotic). A reservation is recommended;  there is no waiting area and the room is small, although you may be able to drop in on a week night. Give it a try. The food is consistently good, as is the service. Commenting on what a couple of other reviewers have said: I have never seen chopsticks on the table in any Thai restaurant, even the grand places in San Francisco on Clement Street. It's always a big spoon and a fork. And, yes,  there is green papaya in the 216. I saw some the other day at a place on St. Clair. They just didn't choose to offer it at Ty Fun. Maybe the quality and supply were not consistent enough to put it on the permanent menu. That's one of my favorite salads, too. (They do have it at #1 Pho on most occasions.) Maybe Ty Fun will offer that as a special salad in the summer. I would like that. I agree with the comment about family-style, since this is the way we like to order, too, and the tables are small for all of the dishes that we'd like to have on the table. We have always had very satisfying meals at Ty Fun, and everyone we have ever taken there has raved about it. We even got a \"best restaurant in Cleveland\" comment from a friend of ours who is an extremely sophisticated 80 year old and has traveled the world in high style. Prices and portion sizes are reasonable, and the warm welcome is priceless. I love Ty Fun. There is a small outdoor dining area. Be careful parking in the lot if it's raining. It can be  muddy."}
{"text":"This is a very small restaurant. You find it busy on most nights. I think the presentation is better than the food itself. However, its the only ethnic restaurant in the area. If I am in the area, I would go."}
{"text":"Visited Ty Fun for weekday lunch with co-workers. I've only had Thai food a couple times before this but generally like anything spicy. We ordered the chicken massaman curry, pad thai and kra prow with chicken. All were excellent. Kra prow was spicy and delicious. Small dining room and a couple tables outside. You can hit up the Flying Monkey next door for drinks afterwards. Liked it and would go back for lunch or dinner."}
{"text":"If you like authentic pad thai, I highly recommend this place. Their food selections are amazing. Nice atmosphere and cute decoration."}
{"text":"We visited Ty Fun, last night to have dinner with another couple before checking out the midnight shorts at the Cleveland Film Festival.  I was a bit worried about parking as we drove into the maze of streets in Treamont, but was very happy ro find a PARKING LOT right next door.  Upon entering, the small dining area looks small, but was very comfortable.  The tables were arranged well so that there was room to get around without difficulties.  The ceilings were also tall which made the space feel less claustrophobic.  On to the food - Bill, 1/2 of the couple we went to dinner with, suggested the restaurant and reported that he felt that it was pretty authentic, as he has traveled to Thailand many times on business.  Anyway, my bar was set pretty high.  We all decided to get two aps and four entrees to share amongst the table.    You will have to excuse if I don't remember the names of the different dishes - we tried the chicken on a stick with peanut sauce, which was fairly good.  The crispy spring roll like app was really good.  For entrees, we ordered the duck, green curry pork, pai tai, and a moderately spicy chicken with cashews.  The pai tai was decent and par for the course with most pai tai that I have tried before.  The chicken with cashews was pleasant - the cashews were very good and made the dish for me.  The green curry pork was very good and tasted very similar to the green curry that I have sampled over in Lakewood at Thai Hut...  The crowning dish to this meal was the duck - it alone made me give this place 4 stars instead of 3.  The duck was sooo crispy and the sauce was really good.  Another important factor of this meal was the veggies that were cooked and served with the meals.  They were very fresh tasting and matched well with the various sauces.    One more thing - the staff of Ty Fun really did treat us very well.  They took time to speak with us and were very concerned about the quality of the food and about making us comfortable.  Overall - food - try the duck - service - very good - location - excellent."}
{"text":"Absolutely love their Thai fried rice and green curry, will come back for more!"}
{"text":"Ty fun have the best Pad Thai I ever have,and their curry is very good also. i thought Peppermint was good but Ty Fun Is better!"}
{"text":"Love me some Thai and this place is great. They grow their own herbs and some produce. Plus it's a nice location in Tremont to get out and explore on a warm summer evening."}
{"text":"Our luncheon party of four was lucky enough to dine at Ty Fun today.  Everyone's food was out-of-the-park amazing.  Even my hot and sour soup was to die for, full of shrimp and with just the right amount of heat.  The portions were perfect - generous yet not too over the top.  The decor is beautiful and tasteful; the service, impeccable.  It was nice to meet the owner, too!  I'd recommend this very nice option in Tremont to anyone."}
{"text":"We went here on a Wednesday night and it was pretty busy so I thought that was a good sign off the bat. It's a super small space with tables almost on top of each other so if you're afraid of confined spaces and strangers, I would get takeout instead.  As for food, the Papaya Salad was some of the best I've ever had but the Basil Fried Rice was a little bland. The Massaman Curry with Shrimp tasted awesome except they left the tails on, which is a pet peeve of mine and made the dish quite annoying to eat.   Overall, the food was good and like most Thai food, tasted even better reheated the next day after the flavors set in. Service was decent too considering there was only one server for the whole place. I'd definitely hit up Ty Fun again if I were in the area."}
{"text":"Went here for lunch with a friend. Fast and friendly service. The food was excellent. I had the pad kee mow and my friend had the satay and tom yum soup. Would recommend for people looking for quick, cheap and quiet lunch spot!"}
{"text":"If you are in the mood for some of the best pad thai, this is the place. The decor was spot on perfect and had quite a zen-like atmosphere. We went for lunch and the place was not crowded at all. I found the pad thai perfect in every way and quite delicious. It had the right amount of spicyness and was cooked with a few vegtables that I don't normally see in pad thai but welcomed. The small dining room adds to its coziness and the speedy service and reasonable prices puts this place at the top of my list. I highly recommend to all."}
{"text":"Big portions, lots of flavor. Great thai restaurant in Cleveland. Not the best thai food I've had, but certainly up there."}
{"text":"Had plate #31 with Snapper. Whole fish arrived. Loved it!  Sweet and sour sauce was just as I recall it having spent much time in Thailand. My wife had the #60 Tofu dish with yellow curry sauce and it was authentic Thai. Great tiny place!!"}
{"text":"Really, since moving back to Lakewood..the best new restaurant I have found.  GOOD STUFF:  Great food, good service, nice place, AND BYOB!!!  Wow.  Very rare to find a place like this.  No wonder its gotten so busy.    BAD STUFF:  I heard they were getting their liquor license which would Ky-bosh the whole BYOB thing.  Can be loud at times.  PRICE:  Medium.  Two people no liquor about 40-50$.  OVERALL:  Great date place.  Small, lively, really good food.  Definitely a winner.  Great location too in Tremont with good bars and galleries within walking distance."}
{"text":"I love the venue here it's tiny but looks very sleek and inviting. However I do not love the food here. Its by no means is bad and actually is super fresh and good quality. The only issue as others have noted is that it's just not great and kind of expensive for the quantity you get.  Any appetizers I ordered were not really large to even share including their tod mun which was tasty but consisted of three tiny fish cakes. I did enjoy everything I ate including the basil fried rice and pad Thai  but would not go back because I feel like I could get more bang for my buck somewhere else."}
{"text":"Love Ty Fun!  This is a consistent stop for a quick weekday meal.  Great choice of vegetarian items.  I've never been disappointed with a meal here.  Great for takeout!"}
{"text":"Love love love this place! Take me out for coconut curry anytime! We come here a few times a year. It's fun to take other couples here. Small space and might awesome food. So grateful for one decent Thai place in CLE!"}
{"text":"i've never been to thailand, i've never been to culinary school, and i grew up in bfe.  what do i know?  i know when food that hits my palate is good or when it sucks rocks.    no, not sushi rock.  but when it sucks rocks.  ty fun does not suck rocks.  i felt like this place was trying too hard to be trendy, upscale, and fancy pants (my terminology) it's small.  if you're looking to go on a weekend, you definitely want to make reservations.    the wait staff seems a bit uppity, but then again, the entire place seems a bit uppity.  the people sitting at the other tables seemed to either be on: business meals making business deals, older people from the suburbs that are slummin' after hearing tremont was the trendy place to go to dinner, or older bachelors taking their lady friends for a special outing.  REGARDLESS.  the food is good.  again, i have no reason except for their curry was flavorful, their chicken wasn't dry, the seasoning was spicy without being too spicy, and the rice was fluffy and not uncle ben's.  well, hell.  it could have been uncle ben's.  but they sure fooled me.  musta been the bougie mc bougerson who took my order.  so i'm a bit put off by the stuffiness of the place, but the food is good.  the end."}
{"text":"Quick tip: the Chicken Massaman curry is the best item on the menu! I can't believe I've been here like 8 times and never had it before. Amazing."}
{"text":"Ty Fun has decent food, but I didn't realize how terrible the service was until I tried sit down instead of carryout for the first time. The flowers in the vase on our table were dead, and we sat for 15 minutes after being seated without any additional interaction from wait staff or even water. We then went and asked for water, and the wait staff stood and chatted for an additional five minutes without bringing us anything, so we left. There were at least thirty other people in the restaurant and no one had any food in front of them."}
{"text":"Last night was my first visit to Ty Fun.  Overall it was good, but nothing that really stood out as fantastic.   We shared a couple of entrees- the Thai fried rice with chicken and the green curry with beef. The fried rice was a little boring. I enjoyed the veggies in the dish, but other than that, not a ton of flavor. The green curry had a lovely, creamy consistency and was flavorful and tasty.   All in all it was pretty typical Thai food.  I have to say that I prefer Bac because it's more unique and interesting."}
{"text":"Always a great experience here.  Solid food.  Big flavors.  Food served piping hot.  Attentive service.  I order #18 every time!"}
{"text":"Hands down the best Thai food in Cleveland.  I could go on FOREVER about why this place gets 5 stars, but I will just sum it up: - Private parking lot (this is like GOLD in Tremont) - The best yellow curry I have ever had (not too sweet, but has great, creamy hints of coconut) - Classy, comfy ambiance without being overdone - Thai tea that I dream about! - The owner has a garden that he actually picks a lot of his veggies from and he may be the cutest little Thai man I have ever met. - Great teamwork with service!"}
{"text":"1st time at Ty Fun and everything about this place was excellent ! Would HIGHLY recommend a meal here ! I'm no expert on what authentic Thai food is supposed to be like but, everyone in our group loved their choice ! Well worth a visit !"}
{"text":"Delicious but traumatic is the best way I can summarize my first visit to Ty Fun.  While the service and food were most acceptable & enjoyable, the dining experience is not.  The owners have literally crammed as many tables as possible into the dining space.  The result is tables with approximately 6\" between them and that dreaded feeling you get on a plane when seated in the center seat between two 350 pound travelers.  One of the diners in our party literally had to leave the restaurant as he was on the verge of a panic attack.  At 6' 4\", he simply did not fit into the seating configuration. Another diner dropped her napkin mid meal.  Retrieving it from the floor was something out of a tragic 70's sitcom.  Lose 6 tables, create a normal/positive dining experience and I'll be back.  All four of us agreed that no matter how good the food (and it WAS good), we would never considering going back on a Friday or Saturday night."}
{"text":"Really good.  Best Thai food I've had in Cleveland.  The Laab was fresh and flavorful, and the atmosphere was relaxed.  Will definitely be back."}
{"text":"A little topsy-turvy experience my first time there to eat.    Granted, we were a little late for our reservation (recommended for peak times Thursday-Saturday) but the server (one of two so far as I could tell) ignored us for a good 10-15 minutes.  One member of our party mentioned it and the server apologized.  Our table of four had a bottle of wine, and a wonton appetizer, and some Thia hot/sour soup.  The entrees were great as we had duck (14) and Chicken (18) dishes.  All were well-presented and tasted great.  This is where it gets a little hairy though.  Right before we got our bill, the server said that because of the delay in service, he would remove the single soup and wontons appetizer.  Great! We're thinking, not necessary, and even gave him the out but he insisted and confirmed we would not have to pay for the two items.  We get the bill, however, and lo and behold, they are still on the tab.  I searched the ticket for a handwritten \"psych!\"  under the items in question but it was not apparent.    So, although the food was great, the service gaffe left a bad taste in my mouth."}
{"text":"We first discovered this place during the Tremont food festival when visiting Cleveland a few years ago. When my husband and I recently relocated to the area, we knew we had to go back! We definitely were not disappointed.   Having frequented many Thai restaurants over the years, we feel that Ty Fun is up there with the best of them. The food is reliably great, the flavors and textures perfect. We visited recently with my cousin, who has never had Thai food before, and she fell in love with their kra pow. She also ordered a lychee martini, which we both thought was delicious. She actually described the drink as 'sexy' and tasty. They have a good menu with a variety of dishes and drinks.   I feel like one of the best things to judge a Thai place on is their noodles. So simple, yet very easy to mess up! Rice noodles can go from perfect to mushy and clumpy in no time. I've found the noodles at Ty Fun to be perfect each and every time we've been back there. And when the base of a dish is perfect, it can only go up from there!  The atmosphere is laid back in the restaurant and the service is friendly. I'd say the restaurant is on the casual side, but you wouldn't be out of place in dressy-casual."}
{"text":"The three-top patio is lovely and private. The food was OK, but I've definitely had better. Plus it was expensive. Two entrees, spring rolls, thai iced tea, and two drinks rang in around 60 bucks. I know this is Tremont and all, but come on,  it's THAI FOOD.  The service was attentive and quick, so that was a good thing. I really wanted to like this place, but I was not impressed."}
{"text":"My meal wasn't bad by any means, but just nothing extraordinary.  My main beef with this place is that the tables are PACKED in there.  I literally had to walk sideways through the restaurant to avoid knocking over people's plates.  I'm not in the least bit overweight so if you are, you definitely will not be able to maneuver in this place.   The dish I got came with a sauce that was the consistency of water.  Very tasty, but water.  I was also not pleased with my chicken.  There were several pieces that were full of fat.  Discussing to bit into. Others at my table got good meals so I won't totally write this one off yet."}
{"text":"This is a great little Thai restaurant, but can be noisy due to the small size when a large party is present. It is still far quieter than similar restaurants in NYC. We started with Tom Yum soup, which was very flavorful, but not very spicy. I ordered boneless duck at the extra spicy level. The dish was very flavorful and had a slight kick to it. It was nowhere near the spice level that one might expect on either coast, but this is likely to cater to the clientele. The flavoring was good enough to overcome the shortcomings on the spice level. The staff were extremely helpful with suggestions and attentive. This is an excellent Thai restaurant for the area."}
{"text":"The wontons were excellent but my food was just okay. I would wanna com back and try something else bc I think any option would be better. Mine was flagged as hot but really wasn't that spicy."}
{"text":"I will never eat here again!!!! I enjoyed my food until I poured soy sauce on my rice noodles and discovered almost 30 flies had died in the soy sauce container. My dad had just finished his soy sauce covered rice unaware of the flies he had just  digested. Needless to say the flies ruined the rest of the meal and we received our meal for free. Lastly, I would like to say this has been the grossest restaurant experience of my life!"}
{"text":"Delicious Thai food with fresh ingredients.  We got the Tom Yum Tofu soup, papaya salad, and duck with red curry sauce with pineapple. Unique and well balanced flavors that makes this my favorite Thai place now.  The service was excellent and the coziness of the restaurant made this such a refined but personal dining experience.  I was especially happy with the quality of ingredients; I had real mushrooms in my soup, even!  It's also refreshing that there was no fish sauce smell overpowering the food, and yet the food was amazing.  Hope to come back sometime soon."}
{"text":"this is the best thai restaurant i have never tried it before. My family ordered 5 dishes and 5 of them all good. i recommend u to try the thai style fried rice and the curry. It was so good. i wish i can come back again for my next vacation. i give them 5 stars."}
{"text":"Some of the best Thai food in Cleveland, the major ding against Ty Fun is that the restaurant is very tiny, meaning that you're often crammed in if you have a large group or have to wait for a long time if you're a small group.  At one point, there was a three-week waiting period, though hopefully that's cooled off.    However, this is hands-down the best Thai Iced Tea in Cleveland that I've found, and the curry is tasty if a little mild.  It's not adventuresome Thai food by any means, but there's a lot to choose from here and I've never had a bad dish.  Recommended."}
{"text":"Thanks to yelp we discovered this place. Small but cosy place in Cleveland. Soup was good. Curries were regular. A big positive for the vegetarians is that they put a lot of veggies in their food. Might want to reserve if going during peak hours."}
{"text":"I had been dying to try Ty Fun for a long time and my fiancee and I finally got the chance to meet up with some friends there last night.  And I'm sad to say that I was let down.  The food wasn't bad...but I thought it was just typical Thai food that I could have gotten anywhere.  We started off with the wonton appetizer.  I was surprised to discover they were just chicken pieces wrapped in wonton.  Nothing more...nothing less.  Pretty bland, especially if you had already been seduced by the wonton chips and pork Rangoon at Bac like I had been.  My fiancee ordered the three lovers dish and said it was \"ok\". I had the shrimp Pad Thai and said the same thing.  I will give them two thumbs up for the shrimp, though.  There were 6 large prawns in my dish and they were fresh and cooked perfectly.  But shrimp aside, the dish didn't wow me.  I've definitely had better Pad Thai in Cleveland. The service was another thing that disappointed me.  I felt we were rushed and weren't able to have the nice, catch-up dinner with friends we were looking for.   We had ordered bottles of wine, appetizers and meals but were given the impression that they wanted us out of there asap.  After we had paid for our hefty tabs and were just chatting for a few minutes more, the server came to our table, picked up the credit card receipts and scooped up our glasses that still had water and wine in them!  Now that is just plain RUDE.   I wish Ty Fun was worth my time, but it isn't.  From now on I'm taking my eating talents to Bac."}
{"text":"As I was dining the other night at Ty Fun Thai Bistro, I realized the restaurant fits a category that's kind of on the rare side for Cleveland. It's not a dive bar/restaurant (plenty of those around) but it also isn't a \"wow\" restaurant that brings with it some sense of pretentiousness (Which seems like almost every place that's started up in the past 5 years). No, Ty Fun is right in the middle with the relaxing atmosphere, very decent prices and welcoming dishes of a dive but with better care and thought put into the food. The seating with run-of-the-mill chairs, tables and booths are slightly crowded but the staff is conscious of spreading out the sets of customers as much as possible while the replicated classic paintings get you in the mood for Thai food. We had the Crispy Cup appetizer ($7.50) which consisted of six small pastry cups filled with diced chicken, shrimp, corn and curry powder. The chicken on its own could use more seasoning but as a whole it is quite tasty and I enjoyed the contrast of texture between the crispy cup and the soft insides. For main courses, I had the Massaman Curry with chicken ($15). The sauce was a nice consistency and aromatic. The portion size was just right with plenty of chicken, potatoes and red pepper, though I wouldn't have complained if there was more of the perfectly cooked rice. The potatoes, on the other hand, were on the razor's edge of being undercooked but that was my only complaint. If Pad Thai is on the menu, my wife will get it (except at Bac where Pho has to be the choice) and it was no different at Ty Fun. She said the Pad Thai with chicken ($14) was enjoyable though she wasn't exactly raving about it. We did not save room for dessert this time, but I remember previously being blown away by a Key Lime Cheesecake. Yes, I'll definitely have to look that up again. I also appreciated the drink menu with it's Pacific slant. There are beers from Thailand and China and wines from Australia and New Zealand while most of the specialty cocktails had citrus elements. We enjoyed how our cocktails each had at least four elements but did not taste muddled.  For me, Ty Fun is a great place to have a relaxing Sunday dinner or maybe to unwind during the week."}
{"text":"Took one bite of my meal and instantly knew this was the best Thai food I'd ever had.  No shit.  I've traveled the world and had Thai food in Asia, the Middle East, the UK, Los Angeles, and New York.  This was the best.  What else do you need to know?  Cleveland?????  Who would've thunk it?  Notably, we're vegetarian, so keep that in mind as you read my review.  Can't speak to the dead things they serve, but all patrons seemed extremely happy with their meals."}
{"text":"I spent 2 months in Thailand just this winter and know Thai food very well. Having gone to several different cooking classes while i was there, i would like to know Thai food.    Ty Fun Is a wonderful Thai Food. I loved it and it satisfied me for my desire for Thai food. They do a hell of a job for food from all the way around the world.  I admit, it doesn't seem to be able to reach the true spiciness (and i like it EXTREMELY THAI SPICY) but that's because most Americans couldn't handle it (So its more to be able to serve to the masses then to miss the real goal. I completely understand).   They have all the right flavors, veg., and dish choices.  I really enjoyed the Green Curry with chicken (WONDERFUL WONDERFUL!).  And the Spicy Chicken Soup is AMAZING: ITS EXACTLY LIKE IT IS SERVED IN THAILAND. I had the same strong lemon flavor that i love!  What i love about them is that hey hold true to Thai Cooking. In Thailand, the meat is not the most plentiful on the plate, its the Veggies.  Ty Fun follows this rule and really does it well. Your plate is always full.  They also use Jasmine Rice (which is the rice grown in Thai- Its amazing in the cooking dishes).  Ty Fun also does not substitute in too many foods that don't actual grow in Thailand.  So  i like that the food is real to the traditions.    Over all i would say its an amazing place to eat. The inside is very nice, very clean, and modern. It has large windows so its works well and gives you a wonderful feel while you eat.    I know i know, you can never compare the country to the food you find here, but this place does the best job i have found so far.  I would definitely go there over and over.   (just a note to the person that wrote the review above mine: the reason they don't have chopsticks is that people in Thailand have never used them. They use one spoon and one fork. It is impolite to eat from the fork, so you use it to load food onto the spoon. So it makes sense that they wouldn't have any chopsticks.  If you do find them in a Thai rest, then that would actually be the miss. Just a thought.)"}
{"text":"I have eaten here several times, both takeout and sit-down, and am always pleased.  The servings are a good size and I've not been disappointed by the flavor of anything.  They are prompt with takeout service as well."}
{"text":"By far the best Thai I've had in Cleveland. The owner, Sonny, is always pleasant and a treat to talk to. High recommended for anyone looking for a smaller, cozy dinner setting or a quality lunch deal."}
{"text":"Cozy place in upscale urbanTremont. Clean, very nicely decorated and a VERY pleasant surprise- music that matched the food! Friendly staff too! The soup was great and had vegetables in it; have never seen that anywhere else. We ordered the Pad Thai and a curried dish! Excellent! They even sell local art!   They also have a nice patio with plants and flowers! Had fun with the lady explaining the paintings of the traditional Temple Festival. Unfortunately, smartphones have taken the place of good old-fashioned fun, even in Thailand. This is a Great place to take out-of-town guests!"}
{"text":"I've been all over the country and this place had way better Thai food than I expected to find in Cleveland!!!  Highly recommend stopping in."}
{"text":"Found this little gem after moving here from Houston. Pretty much everything we ordered was made perfectly. The restaurant itself is small, but comfortable. I love how friendly the owner and the waiters are and how authentic their Thai food is. Next time if you are there for lunch on the weekdays, ask for their off menu specials, those won't disappoint you."}
{"text":"Ty Fun is a lively and energetic little bistro in Tremont! Prices are very reasonable and staff couldn't have been more kind."}
{"text":"We came here for lunch after a recommendation for their basil fried rice. We ordered the pork spring rolls and ended up with two hairs in one roll. We handled it quietly. The waitress apologized and took it away from the table. She was a very nice and friendly lady. I ended up ordering the fried rice and couldn't eat it all. I asked for a to go box and the container was very dirty. I ended up not packing up my food. The food was really good but it's not the cleanest place. If I ever come back for some rice it will definitely be a pick up order."}
{"text":"We ended up here with my in-laws- one of whom is Thai, visiting from Thailand- last night.   And that's where the 5th star comes in.   My niece is about 7 and lives in Thailand. She wanted sticky rice, which wasn't on the menu and seems to take a while to make. But she shook it off and we enjoyed some great spring rolls and a tofu dish for appetizers. However, they whipped up some noodle salad and she was happy.   I had the grilled chicken, which was served with vegetables and some sumptuous rice. For some reason I forgot to take pictures this time, but the plate presentation was great. My husband's duck dish was awesome as well. The genuine peanut sauce was fragrant with ginger, and I daresay it was better than my bastardized Yankee version. (And mine is good!)   We're all having a nice time, enjoying the appropriately volumed music; \"This sounds kind of Indian,\" according to an in-law, and my Thai sister-in-law is chatting in Thai with the owner's wife- and here comes a staffer and gives my niece a bowl of sticky rice!   THAT'S HOSPITALITY.   Even without the sticky rice we would have had a great time and enjoyed ourselves. But that bumped this up to a five star. Yay for Ty Fun."}
{"text":"Decided to try this place because of hype from our friends. They have a full bar which was nice. The food was average Thai food. Nothing special nor memorable."}
{"text":"I see other Yelpers indicate this place as hit or miss but I've eaten here probably 7 to 10 times over the past several years and it's always been good, whether lunch or dinner.  Yes it's  a little more pricey than Lemon Grass or Mekong, or High Thaid but to me it's a step above those places.  Food is always flavorful and served hot from the kitchen, service consistently good.  Will keep going back."}
{"text":"Excellent Thai meal. All the dishes were delicious - fresh and tasty - as were our cocktails.  The restaurant is small but very tastefully done. No complaints whatsoever.  Parking via an app in a lot alongside is also a nice convenience.  As a Bostonian visiting Cleveland I was super impressed with this little gem."}
{"text":"So I'm a little behind on my knowledge of the places in hipster, artsy Tremont. This past weekend I went to Ty Fun with family to try to fulfill my constant need for Thai food. The restaurant was pretty empty for a Saturday night. Granted it was 10 pm when we got there and they close at 11 ...supposedly last order is at 10:30? And I get it. My people eat late so it wasn't a deterrant. There was actually only another group of people in the restaurant...and they also happened to be Indian...ha! The restaurant is pretty small, the furniture is adequate.   The food was good, not great. Nothing I'm going to fantasize about on days I have Thai urges like I do with certain other Thai restaurants. Pad Kee Mao and Green curry were the highlights. The Massaman curry felt like it was lacking something. I noticed some reviewers commenting on quantity, my brother/dad finished their plates and both me and my mom had leftovers, enough for an appetizer but not a second meal. I'm not sure how this compares to when they first opened. They had the typical alcohol options, nothing worth commenting about. I'd go here again primarily because of the location and wanting to go to other places close by. The food is also a lot cheaper than Lolita next door.  Summary - Decent, but not amazing, Thai food."}
{"text":"Two words: Generous portions.  Food tasted great and authentic. Thai food is great here and has the right amount  of kick to it. I ordered their soup Tom Kha Kai, which had some cocunut milk which helped offset the spice it had. It's good different and tasted great on the palate. For dinner, I had their Goong Ma Mung, which is jumbo shrimp with vegetables and cashew nuts. A generous portion, I brought the rest home.   The space is small but it's a great place for a romantic dinner  or bringing a group of friends. Very warm and inviting. I recommend this place for anyone who frequents to Tremont and prices are reasonable."}
{"text":"Ty Fun is worth trying; it's miles ahead of Lemon Grass, which is the only other Thai food I have tried in Cleveland (I went to Ty Fun while visiting family here).  I live in the San Francisco Bay Area (where there are over 100 Thai restaurants), and I have very high standards for Thai food, so take my opinions with a grain of salt.  When visiting a new Thai place, I usually try Tom Yum Goong (hot and sour soup with shrimp), Som Tum (green papaya salad), and Kra Prao Beef.  Hits:  The tom yum was pretty good, with a strong lemongrass and lime flavor.  However, it had little galangal, and a curious addition of celery that seemed a little out of place.  The shrimp rolls were simple and excellent -- large shrimp rolled in an egg roll wrapper, fried but greaseless, and served with a sweet-and-hot dipping sauce.  My brother enjoyed his chicken in red curry, which I did not try.  Portion size and presentation were good for all entrees.  Service was attentive and courteous.  The atmosphere is nice -- high ceilings, small pendant lamps, and square plates.  On a Sunday night around 7:00 p.m., most tables were full.  Word on the street is that a reservation is recommended.  Misses:  1)  No som tum was on the menu or available by request.  As a classic Thai dish (and one of my all-time favorites), this is a puzzling omission.  Is green papaya available in the 216?    2)  No chop sticks are available, even by request.  This is easy to fix, but a little surprising.  3)  While I appreciate that the waiter allowed me to order Kra Prao with beef (instead of chicken) and snow peas (instead of green beans), the dish was very greasy; I had about two tablespoons of oil on my dish after I was done eating.  Nevertheless, the dish was very flavorful, pretty spicy, and used fresh ingredients.  4)  Ty fun has no liquor license, but they do allow you to bring your own.   I did not ask whether they charged for corkage.  5)  No sticky rice with mango was available for dessert.    6)  Menu items are served individually, not \"family style\" for sharing.  This is not a huge problem, but I enjoy trying several entrees at a Thai restaurant, and this makes that more inconvenient.  7)  The Tod Mun Pla (fried fish cake appetizer) was small and a little soggy.    Ty Fun does okay with the fundamentals, and most of these \"misses\" are relatively minor and fixable.   Dinner for three with soup, appetizers, and entrees was $67, not including tip (i.e., $80).  I'd expect better quality for that price in the Bay Area, but given the lack of competition, perhaps that's okay for Cleveland.  I'm going to check out other spots on my next trip here to see how they stack up."}
{"text":"So I can't speak to how authentic the food is, but the tom kha (i usually get tofu) is addictively delicious.  I've only dined in there once but when I lived in downtown Cleveland I regularly got take out and it was never a disappointment.  The only thing I've had on the menu that I didn't love was the green curry - I thought it was a little bland; I'd prefer a curry with bolder flavors. Even though the place has a small \"parking lot,\" its in shambles - it's nothing more than an empty lot that's been somewhat cleared.  They may have paved it since the last time I was there, but it used to have tons of deep potholes and get really muddy when the weather was wet.  If they haven't put down pavement yet, your best bet is to try to find some street parking."}
{"text":"Awesome food--try the chicken masaman curry! This place is great for both dine in and carryout. Nice atmosphere inside and the patio is great on warm days. A little pricey for lunch but well worth it for dinner."}
{"text":"I have been to this lovely little Thai resataurant in tremont 9 times and have not been disappointed. Soups are delicious. Good bar, nice cocktail and wine choices. Quality of the food is very consistant. Very good vegetarian options. How mok tofu wrapped in a banana leaf, tofu and veggie khi mow, basil fried rice, veggie spring roll And tom yum tofu and vegetarian curry dish are fantastic. Portion size is good. Usually don't have any room for desert. Service is efficient and courteous. Definitely recommended."}
{"text":"This is one of my FAVORITE Thai places in Cleveland! They have a smaller wine list but have an organic wine for only $20 a bottle.  The owner is always there and will greet you with his kind smile!  The service is good too, fast! This place is small so I would AWALYS make reservations.  They also have a small patio! I am a vegetairan and they have a great selection!"}
{"text":"Really wonderful Thai food. Very fresh authentic Thai. Friendly staff, with a fantastic menu. I've always really enjoyed my meals here and have eaten and numerous top Thai restaurants in various states and many cities. This one is at the top of the list for me!"}
{"text":"Best Thai food in CLE!  Great Vegetarian/vegan menu....VEGGIE DELIGHT appetizer is amazing (taro root!!!) and I always get the TOFU MA MUNG (no matter how hard i try to get something new). They have a parking lot, which is hard to find in Tremont. Not the cheapest thai, but defiantly the best.  Cozy little spot, clean, and nice outdoor patio."}
{"text":"Every time I go here I never have a bad meal. The Thai chicken skewers and peanut sauce were delicious as always. We also ordered the spring rolls and we were not let down either. For my main dish I ordered TOFU MA KEUR  Sautéed ginger, Japanese eggplant, basil leaves & crispy tofu in chili garlic sauce. 12 Best dish ever !!!  The server also said the ginger honey tea is perfect for a pregnant girl and boy was it perfect for me !!!    Great for girls night out or a romantic date night on the quaint patio !   definitely would go back !!!!!"}
{"text":"Great food! A bit expensive but well worth it with the ambiance. Service was helpful with knowledge and we were very pleased."}
{"text":"Great Thai food!  The menu and preparation at Ty Fun rival (and maybe surpass?)  the authentic flavors of Thai restaurants I've enjoyed in NYC and Chicago.  This is one of Tremont's tiny gems.  Seems to do a brisk carry-out business but dining room service and atmosphere are right on the mark as well."}
{"text":"Great experience over all!  Love the intimate atmosphere. Had the Crispy Cups and Fresh Rolls for an appetizer and loved them both. And I am a huge fan of Yellow Curry so I had to try it here.  It was perfect!  Sweet, savory, and the right amount of spice!  I cleaned my plate! And to top it all off, the owner and staff are just lovely!"}
{"text":"Best Thai I've had! Great atmosphere and location, perfect date spot. Staff is all super friendly and helpful, food is consistently amazing. A must stop for me, every time I'm in Cleveland."}
{"text":"Good food and quaint atmosphere. Cute stop for Thai food. Perfect amount of spiciness. Prices reasonable."}
{"text":"Well, a long time has passed since I've been to Ty Fun (I think it was 2009), but from my memory the green curry chicken was impressive for what I've found in the Cleveland area. (I cook green curry chicken often for myself so I'm familiar with the ingredients).  The ambiance wasn't much to speak of and it doesn't seem a very intimate or quiet setting. That being said, they served up some pretty decent Thai food."}
{"text":"One of my favorite cuisines! I wanted to like this place, but it is overpriced and oversalted. Got pad see ew and it was kind of...awful. It tasted like the only seasoning they used was soy sauce. :(   Service was good and I really wanted to like this place, but unfortunately it did not meet my expectations."}
{"text":"Pad Thai was good. All the ingredients taste fresh. Its a little pricy for quantity though,  and I wish it were a bit spicier."}
{"text":"Maybe my tastes have changed over the past year, but I'm starting to see what some of the other yelpers have been saying. Ty Fun is good, just nothing to write home about.   First of all, I pretty much always order the same thing. But, for some reason I remember getting a lot more for my money. This past visit resulted in me hunting for a fourth meal less than three hours later. I can't even blame it on getting my typical vegetarian version of the Pad Khi Mao since I ordered it with shrimp. Not even the extra protein stuck with me. Womp.   I did notice some upgrades to the space to make it a little more bistro-like and they finally got a liquor license. Score! Of course I chose to imbibe. I mean, who do you think we're talking about here?   Like most yelpers have said, the food is very tasty. My whole party finished their plates, but again, mostly because their wasn't much on them. And I just can't jive with the 30-minute speed-meal. I get it, Asian cuisines cook up quickly. But I want to enjoy my meal a little bit. I want to talk,  sip cocktails and enjoy the company of my guests. We literally had our food 5 minutes within ordering and it sort of killed our vibe.   Not the Friday night meal out we were hoping for... I'm sure I'll be back eventually, but now I know what to expect."}
{"text":"Ty Fun is amazing! We tried Ty Fun for lunch on a week day, during the week they have different specials for dinner every day heads up!  I ordered the vegetarian red curry and my partner had the yellow curry- both were awesome. The coconut milk flavor was very well balanced , no spices were overpowering and the service was great. Our entire meal was under $20 - and tasted delicious."}
{"text":"Love duck!  They have four kinds of duck, my favorite is the one with seafood. Also had the soup, and three different appetizers, and all great. The Key lime pie was special, as the coconut cream pie. The price for four, with six cocktails was $181.00 but worth the money. One of my must go places in Cleveland."}
{"text":"Good place to go, but I don't know it would be a 4 or a 5. The food we had was good but we have had better. Green papaya salad was good and so was the pad Thai. Tom Yum soup was ok as was the spring rolls.  We would go back, if we were downtown."}
{"text":"Everything I've had on the menu is great!  My sister said it's the best Pad Thai she's ever had.  My recommendation is to go for the Massaman Curry, and have them add in some extra veggies.  It's truly wonderful.  I would recommend making a reservation or calling ahead.  It's a small place!"}
{"text":"I challenge anyone anywhere to find better Thai cuisine. This place is shockingly good! Highly recommend you come and try this place if you enjoy Thai food."}
{"text":"Lets be clear: Mediocre Thai food is still pretty good.  That said this was a meal I could pass on.  The Tom Kha Kai soup was just weird. It almost tasted like it had a Campbell tomato soup base.   The rolls were too heavy and overdone in oil.  The Tofu dish was okay, ob woon sen.  If you have a real craving for Thai that would hit the spot.  Overall, I was disappointed..  The bar is set really, really high in Tremont for quality eats and Ty Fun misses the mark."}
{"text":"#AsianFest @TyFun. The lemongrass garlic sauce with turmeric chicken leg is delicious! Nice to try your food.  We'll be back."}
{"text":"First off, I'm not a Thai food connoisseur, I just know when good tastes good. So if you're a purist like some of the other reviewers, skip mine. That being said, This is a great little place in a cool neighborhood with good food. I've only eaten lunch here a few times but it's always been fresh, delicious and hot. Last visit I really enjoyed the Kai Ma Mung with chicken. The spring rolls appetizer was hot, crunchy and really good with a little sauce on them. The decor is pleasant but this place is small-maybe 12-15 tables. Look, there's so much garbage Asian food out there, when you find a place like this it's worth it."}
{"text":"I asked a friend for a recommendation to follow up my great experience at Phnom Penh when we ate there together.  I said I wanted something with big flavor, and that was about my only criteria.  Ty Fun Bistro was the suggestion, and a good one it was.  I took what has become my typical approach, simply ask them what the most flavorful item on the menu is.  Now, you have to pay attention to the server and how they respond to this request.  Sometimes they'll point you to the most popular item (at Thai places, that's the pad thai), or to the least offensive item (chicken curry), or the most expensive item, or give you energy that says \"I don't believe you.\"  It can be helpful to let them know you've eaten the cuisine before and that you're open to trying new things and maybe a bit more about what you like.  But, at some point you have to make a call - trust they're pick or go it alone.  I went with the server's suggestion: a fried snapper with a brown sauce and vegetables from their \"signature fish\" options.  It was fantastic!  I picked off every piece of flesh I could, and the crispy skin provided a great textural balance as well.  The sauce and vegetables, along with short grain white rice, made for tasty bites from start to finish.  I can't speak for anything else on the menu, but the fish was very good.  Plus, I found the staff and atmosphere to be quite inviting."}
{"text":"I'm honestly heartbroken- Thai cuisine is my absolute favorite, and I'm quite disappointed with how my visit to Ty Fun went down.   I was so excited to see a separate vegetarian menu with so many options. I informed our waitress that we are strict vegetarians for religious purposes, and she assured us that the vegetarian meals and soups did not contain any meat or fish products. I ordered the Tofu Tom Yum for my sister and I, a noodle dish (Khi Mao Puk) for myself, and a Vegetable Curry (the Red Curry) for my sister. I also asked my waitress to make sure there was no cilantro on top of my meal-- I personally can't stand the stuff haha.   We started with the Tofu Tom Yum, which according to the menu, was made with vegetable broth. After having a spoon, I realized that something tasted off. My sister in the meantime, had already downed her soup when I went to ask the waitress, who admitted that she could smell fish oil coming from our soup. She apologized profusely, and dashed into the kitchen. She later came back and offered to give us another Tofu Tom Yum to go.   Next, our meals came out. My noodle dish was placed down in front of me, with TONS of cilantro on top. Taking one look at my face, the waitress again apologized profusely, and went to serve another customer. A little surprised that she didn't offer to take my dish back, I decided to just dig through my dish and pluck out all the cilantro.   Our food wasn't even that great- my sister's curry had tofu with raw broccoli, basically sitting in coconut milk that had been coloured with tumeric-- it wasn't even red curry. My noodle dish had overcooked noodles with barely any of the chili/garlic gravy. Nothing we ordered was appetizing.   The restaurant was very well decorated, and super cute-- however, I do not think we will be returning."}
{"text":"Delicious, consistently.  This family owned business reflects why it is such a pleasure to deal with a small organization, carefully run with customers' interests paramount.  Each item is individually prepared and the results are apparent.  I have been coming here since it first opened.  My only complaint is that it is not located closer to my home, however the drive is worth it."}
{"text":"Amazing service! Friendly, attentive, and a warm space. Food was delicious. Will definitely return :)"}
{"text":"This is a cozy restaurant with delicious food and friendly service. We ate lunch, everything was well prepared, and healthy. Beautiful atmosphere too."}
{"text":"Cleveland is pretty much a barren wasteland for Thai food, but Ty Fun is like a gleaming oasis in the desert. Excellent apps and entrees, good service, friendly owner. This place is a true gem."}
{"text":"Excellent service and food, one of the better Thai restaurants in Cleveland"}
{"text":"Wow. This place is awesome. Native to California, I know Asian food. Ty fun does it well. Fresh noodles, oodles of flavor, and just all around tasty and delicious. I would bring my family here if they visited. And they would definitely enjoy it. The only difference between Ty Fun and the Thai restaurants back home is that they play up the atmosphere and jack up the prices, but I guess you get what you pay for. One of my favorites."}
{"text":"Americanized Thai food.  Food was not bad, but I've had better.  My date got the Chicken Massaman curry which was yummy.  I got the Pad Khi Mao, which is usually one of my fave dishes to get at Thai places.  It had different vegetables than normal and was just okay. The ambiance was nice and the service was good, but in my opinion its pretty overpriced for Thai food."}
{"text":"Twice we have taken out from Ty Fun.  Very nice people and they seem attentive to the detail required for consistency.  The value is decent.  Tofu Ma Mung and Pad Khi Mao seem to be things we like from here.  I do love some Chinese Broccoli.  Worth the roll down into Tremont for this.  Charming spot."}
{"text":"Had dinner here last night. This is the third or fourth time I've been to Ty Fun. Last night, I had Pad Thai (Chicken).  PROS: Great atmosphere Great service Walking distance to great Tremont bars/coffee shops/dessert joints  CONS: Food is avg, not memorable   My rating of top Cleveland thai restaurants are as follows: 1) Mint Cafe, 2) Mekong River, 3) Ty Fun, 4) Lemongrass  As far as restaurant atmosphere goes, Ty Fun easily tops Mint Cafe and Mekong River. The restaurant interior (and patio) is intimate and modern.  However, 3 stars because the food has not stood out to me in the 3 times I've visited the place."}
{"text":"One of the best if not the best Thai restaurants in Cleveland! Great service on several occasions. The owner cooks with love and it comes through. On my second visit after ordering a lot of food , to my horror I forgot my wallet . The waiter summoned the owner at my request. After explaining the situation he said \"No problem! Just send me a check!\" He didn't even take my name. I was so greatful. That won my loyalty. The  food is great and the place is located in the heart of Tremont's entertainment district."}
{"text":"OMG! I ordered takeout from Ty Fun Bistro via UberEats, and was BEYOND pleasantly surprised.   To begin, this felt like super authentic Thai cuisine. The ingredients were all fresh, everything was spiced appropriately and the portion was generous. I ordered the Gang Keow Whan--Green curry cooked in coconut milk, eggplant, red bell pepper, string beans, zucchini & basil leaves.  This is not a drill: I think this was some of the best curry i've ever had in Cleveland.  The curry had an excellent, smooth texture that was milky and addictive. The vegetables were crisp. When mixed with the perfectly cooked jasmine rice, I could eat an entire meal alone with just the curry on rice. I can't wait to come visit this Bistro directly in the future. The menu is HUGE and the pages of options make it impossible to choose. Definitely check this place out!"}
{"text":"Love, love, love this place. The food is amazing and the drinks are pretty good too. Make sure you get there early because it is small with limited seats."}
{"text":"Great little place... Went to Ty Fun last week for the first time and was blown away....  The Food is wonderful, very colorful, lots of flavor, and fresh and crisp.  Service was very friendly and fast.  We sat outside in there small garden and it was very nice.... would tell anyone to go... try the duck to die for"}
{"text":"I wanted to like this place.  Maybe I'm just picky when it comes to Thai food?  Maybe we just ordered the wrong things?  I've never been to Thailand, but the Thai food here is distinctly different from every other Thai place I've been to.  For instance, they don't have certain dishes that are practically staples at other Thai restaurants I've been to - pad see ew, duck in tamarind sauce, country style pad thai, etc.  So either this place is the only authentic Thai place in Cleveland, Boston, or LA, or it's just bad Americanized Thai food.  I suspect the latter.    We had the Thai spring rolls for our appetizer.  They were in much need of the dipping sauce (read: bland), and the skin was very thick.  For her entree, my girlfriend ordered the Pad Thai.  The noodles were undercooked and tasted tough.  There was also a red spice in her dish that gave it an off-taste (no, it didn't make the dish spicy).  I ordered the crispy duck in sweet and sour sauce.  The sauce was so intense and sour that it overwhelmed the whole dish.  Plus, the duck was overcooked and... basically burnt to a crisp.  I could taste more crisp than actual duck.  The service was decent, except at one point during the meal, without so much as an excuse me, the waitress stuck her arm right in front of my girlfriend's face, mid-bite, reaching across the table to refill her water glass.  We both thought that was... kind of rude.  Sorry, Ty Fun, I don't think I'm going to be coming back.  For good, authentic Thai cuisine in the Cleveland area, I would suggest going to Peppermint Cafe in Pepper Pike."}
{"text":"Every place can suffer an off night and tonight was one.  Perhaps it was because the owners were both out of town, The food was mediocre-something we had never experienced before. I took the recommendation of another reviewer and ordered Massaman Curry-big mistake.  Next time I will order one of MY usual dishes."}
{"text":"My husband and I drive 30 minutes once a week for dinner because we love this place so much. We love Thai food and have tried nearly every Thai restaurant in town. Ty Fun is the best! Try their green curry. It is the best green curry we've ever had. All the curry is fantastic. Love their fried wontons and their veggie cups for an appetizer."}
{"text":"Great atmosphere. Great food. Great pad thai. Well priced for the area. Make a reservation on the weekends."}
{"text":"I ordered Ped Grob via UberEats and this is really one of the worst Thai dishes I've ever had. The duck is very overcooked. Dry and chewy, like chewing on leather. I added special instructions for it to be \"super extra spicy\" and it is very blank without a kick.  Wasted $25 today. Hopefully the spring rolls are better."}
{"text":"Ty Fun has some pretty tasty food, but I would not recommend coming if you have a large group.  We made a reservation for 11, and they would not let us do individual checks.  The closest thing they could do was split our order into 3 bills.  As a result, we all had to bring cash for our bill.  Service in general was not very good.  It took a long time for us to get our food, and the waiter got confused with one of our orders and brought the wrong thing.  They were also slow with refilling water, soda, etc.    The food itself though was pretty good.  I had a dish with tofu and veggies in red coconut curry.  The presentation was very nice.  The curry came in a banana leaf that was cut and shaped so that it was in a flower shape.  The vegetables and tofu were cooked perfectly, and the curry was very flavorful."}
{"text":"My sister and I ventured out on a cold night to Ty Fun for our first time. It's not a huge place, but I found it warm and inviting. If only the weather matched my island state of mind while drinking Mai Ty Fun, which was fruity, boozy and didn't taste like they used syrupy sweeteners. They had a small patio, but it was dusted with snow.   They had a lot of menu options, for vegetarians too.  I was in a pickle trying to decide what to order. If you have ever went to a restaurant with me, you know that I almost ALWAYS ask my waiter for their fave things on the menu. Though I love original Pad Thai, I opted for something a bit different: Pad Khi Mao with chicken. It had more veggies and the perfect amount of heat -for me at least- my sister thought it was spicy.  My sister got the Kai Ma Mung and thought it was one of the best Thai dishes she's ever had. The service wasn't super quick (I feel like a lot of Asian food is ready ASAP- is that just me?), but we were on a sister-date! No rushing allowed!  Overall, it was a positively FUN dining experience."}
{"text":"i'll keep this one short........food is OK, good, but not great. VERY tiny dining room, attractive, but if it were a busy night, would be uncomfortable. service is very average. waiter was dressed in sloppy street clothing, nothing professional at all, never asked how things were, if we needed drinks, etc. we had to ask for everything. never replaced silverware after each course, simply asked us to \"pick up our forks & knives\" so that they could remove plates. server recommended we go someplace else for dessert, what a way to upsell!!! don' think i'd go back, not very memorable.........."}
{"text":"I have waited years to try Ty Fun, and now I regret doing so. The curry dish I ordered (Massaman Curry with chicken and shrimp) was delicious. It had a great coconut flavor, with just the perfect amount of spice, and tender vegetables. You don't get a large amount for the cost ($20) but it is very filling, and I haven't had a curry so good since my last trip to Chicago.   The spring rolls (4 to an order for $7.50) were NOT impressive. They lacked flavor and if they were home made, they weren't the best.   All in all, I will get the curry again, but skip on the appetizers!    Pros: delicious curry, friendly service Cons: a bit pricey, a lackluster spring roll"}
{"text":"I had a craving for some good Thai food today, and being that this is only my second time in Cleveland (the first time was when I was driving from New Orleans to Dallas, true story but not for here)  I reached out to the Yelp for some help.  I found this was only 3 miles from my hotel, or 30 minutes (are there any straightforward directions in this town?  or roads without potholes?).  I found the restaurant, and was able to find the last parking space.  It is quite a busy area of town, and parking is at a premium.  Upon arriving, Sonny guided me to my seat.  The inside was small and cramp and the only audio in the room was people talking.  The people next to me didn't have indoor voices, but that is not this places fault.    I ordered my Panang Curry and Great Lakes Brewing Edmund Fitzgerald (excellent brew, and I am a beer snob).  I asked for my curry Thai hot and reiterated spicy.    Rice portions were small and were shaped in a pretentious way.  I took a few bites of my curry and it tasted good, but there was no heat.  I told the waitress that it was ok, because I am English, and we never complain, well not to the staff, just a nod and a \"good thanks\".    A few more bites, and then all of a sudden I broke out into a sweat, and started breathing fire.  My nose was running.  It got a lot spicy, almost spicy enough.  The beer helped cool off the heat.  Overall a nice place, just needs a little background noise, and maybe a soundproof area to put people who don't have indoor voices.   Even my 2 year has one."}
{"text":"Never ever have I been disappointed.  Incredible seafood, best \"tom yum goong\" soup ever."}
{"text":"Was there last Friday - simply the best Thai food in Cleveland. ordered the spring rolls and shrimp Pad thai.  It is very small and you need to make a reservation.  Great experieince overall."}
{"text":"As always we had an amazing time at TyFun. The service was top notch and the atmosphere on point. They never let down with quality of food and presentation."}
{"text":"Parking is confusing. My car was towed even though I parked in the appropriate spot and double checked with the bartender, who assured me it was safe.   When I called Kufner towing,  they said the restaurant owner called to have my car, and one other, towed. We were there with a party of 10 and I'm still confused why this happened.   $110. later, and an uber to a sketchy part of town at 11:00pm was not on my list tonight, so I'm really angry.   The restaurant owner is suppose to call me and reimburse the towing cost. I'll let you know if he does but for now, I'd say save yourself a shitload of trouble, and go somewhere else!"}
{"text":"Used to frequent this place a couple of times a week. Their vegetarian menu was always pretty good. In the past couple of months they no longer advertise many of the vegetarian entrees, they've doubled their lunch prices, and they've cut portion sizes. In addition to that they've lost their authentic touches and for all of that I believe that there is better Thai food around Cleveland for an incredibly better price."}
{"text":"Always consistent food. Great service we totally enjoyed sitting out on the little patio. One of our favorites."}
{"text":"Great Lunch choice Tremont.  There was a pretty decent lunch crowd when we arrived but we were instantly greeted and given great service.    Never having been here before, but hearing so much hype, I was surprised at how small it was inside.  I loved it.  It made for a nice quaint ambiance.    My friend ordered Chicken Massaman curry and I got a Pad Thai.  Both seem to be very staple dishes here.  After smelling his curry, I definitely regretted my choice.  It was delicious.  The pad thai wasn't bad, I just wanted something with a bit more flavor.    The lunch portions were perfect.  I definitely could have eaten the whole thing without going into a food coma, however I decided to be responsible and box up the last 1/3 of my meal (which went to waste before I ate it).  There are just too many eating out options to look in my fridge first."}
{"text":"Went back on my trip home now that I'm a big fancy New Yorker....  Honestly its better than any Thai I have had in the \"Big City\"!  So much flavor in the Chicken Ka Prow its hard to stand.  Brought the parents and they loved it too!    Thanks Sonny and Greg!"}
{"text":"I don't really have any complaints about Ty Fun but it's just okay in my book.  It's not my go-to for thai because I feel it's a little higher-class than what I need to satisfy my spicy Asian cravings.  This isn't a bad thing for those who prefer sit-down service and pretty presentation--you will find both those at Ty Fun.  The prices are on the higher end, but you do get what you pay for and it's a great place for a nice date night.  There's some great cocktails along with a full bar.  I give it 3 starts because the description is perfect---Ty Fun is A-OK."}
{"text":"I was sitting around tonight, thinking about food. I kept hearing that this was a good place in the neighborhood to try out. I thought it was pretty good. I had enough of one meal to break it down into two and have leftovers, so I am pumped about that. For approximately $13, you could have a decent meal for takeout. Since there are not too many other options in Tremont, I will go here more. I still prefer Thai Kitchen in Lakewood."}
{"text":"Finally found great and authentic Thai food in Cleveland. I had the red curry dish with chicken and it was amazing! I would certainly recommend Ty Fun for fresh and authentic Thai food, can't wait to go back and try something else off the menu."}
{"text":"I consider the food here to be overpriced like most of the Thai food here in Cleveland.  The food is Americanized although it is good.  I would rate the Thai food at Ty fun to be one of the top 5 in Cleveland with Charm Thai being up there as well.  If you dont mind paying a lot of money for Thai food, then Ty Fun is for you.  I recommend Thai origin as well which is decent.  Everything else is subpar.   I gave this restaurant four stars because I think it is overpriced, but due to little competition in the Cleveland area they can charge that much."}
{"text":"The Chicken Satay starter (#1) was good. Nothing special in the chicken or the peanut dip, but perfectly cooked, not dry, and quite enjoyable. The #18 was also very good. The smell was amazing, the spices just right and with a mix of veggies and chicken you can't get healthier. I really liked the food. The atmosphere was peaceful to an extent - it is designed to be peaceful. If you get seated in the middle row you need to watch your elbows because you are right in the center of traffic - kind of like eating on the median. Once you delve into the food though you don't notice enough to be bothered much. I also have one pet peeve about restaurant servers and it happened here. When I have my knife and fork sitting on the side plate and the waiter comes and picks them up, puts them on the table, and takes my plate..... I know I don't need that plate, but I hate my silver wear sitting on the table - just ask."}
{"text":"Tried dropping in on a weekend a few weeks ago and this place was PACKED. I definitely recommend getting reservations if going on a weekend. I finally made it there and....  ..it was middle of the road for me. I don't know if it was the built up expectations from recommendations i've been getting to go there but I was really hoping for more. Usually when trying a new Thai restaurant, I always get the panang (peanut) curry while it was good, i've honestly i've had better at cheaper places. The appetizers were actually better than the main course. I'd go back to give it another try but at a first glance, it didn't live up to what i've been told."}
{"text":"Ordered Pas See Ew and they made it with Fettuccini noodles instead of the flat white noodles. This is my favorite dish because of the noodles and this place managed to ruin it!!!"}
{"text":"A wonderful gem. One of the best Thai meals I've had in years. Too bad I don't live in Cleveland. This would be a go-to spot for me. Great location, great light, really good food."}
{"text":"Excellent food every time both dining in and taking out. The space is small and cozy. Friendly staff."}
{"text":"Ugh. Disclaimer: We ate carryout here.   Ty Fun is ok. It's not very flavorful though. Its not very authentic tasting - although it is probably a little more \"fusion\" than \"authentic\" that they're going after. I don't know... I'm just not a big fan.   I thought it was expensive and kind of bland. I would much, much rather take my business to Banana Blossom."}
{"text":"only time i tried ty fun was at the taste of tremont... and it was great, would dine there defiantly"}
