{"text":"Stopped by Te when I was in Pittsburgh and loved it.  Quaint little place in Squirrel Hill with a fantastic selection of loose teas.  The staff knows their teas and is friendly/helpful.  And the atmosphere is comfortable and neighborly.

If you're new to tea, this is a great place to get started and learn more.  And if you're a tea veteran, you'll be happy with the variety.  Cream Earl Grey is delicious, as well as peppermint rose."}
{"text":"Good selection of tea, plentiful seating, nice atmosphere. I had an iced hibiscus tea that was pretty great. I will definitely be returning.

Also, they have outdoor seating (though it's on the Murray Ave sidewalk and a little noisy) and a clean bathroom."}
{"text":"The Te Cafe gets a 5 star rating because they really have everything going for them.  

The teas themselves are wonderful. I have been lucky enough to have a long time boyfriend who will order a pot that is a different tea than what I choose so that we can try as many flavors as possible.  Recommending the pomegranate rose-hips tea. It's a tea I used to get when I lived in the city and biked to squirrel hill. -okay, so I did that once. I couldn't hack the hill of Forbes- it was still refreshing.

Five stars for their biscottis also! So many people tend to be drawn in for the grilled cheese, but if you ask me it's the biscottis that should really be talked about. They're large, with great texture and a huge variety of flavors.

Lastly I love the ambiance of Te Cafe.  It's decorated nicely with art for purchase on the walls. A generally relaxing atmosphere is also complimented with a game of chess.  They have a really nice chess set with nice carved pieces."}
{"text":"I recently  moved away from Pittsburgh, but this is one of the spots I miss the most. I spent many hours here working on my thesis, but also many hours here just hanging out with friends or reading a book. The people who work there are very friendly and very patient. When I first started stopping in, I knew very little about tea, and they always took the time to explain different properties of each type of tea and were able to make thoughtful suggestions for things they thought I should try based on my current mood and goals for the day.

One of the best parts of this place is the insane selection they have. I felt like there was always something new to try. I loved the hot cider in the winter.

The space was almost always neat and clean, including the bathroom. I enjoyed the little flowers they kept on the tables, and the music selection was what you would hope for in a cozy little tea shop. The atmosphere is inviting, and only rarely would it be too crowded to find a place to sit. The wi-fi was much more reliable than other places in the area.

I love this place! If I ever make it back to Pittsburgh, I'm going to make it a point to stop in. Keep up the great work!"}
{"text":"This place is such a great place to hang out with friends or study.  They take tea seriously, which can be a little intimidating but is on the other hand reflective of the quality of the product you get here.  I also really love that they have H&H bagels and a grilled cheese/tomato soup combo."}
{"text":"Great staff, huge tea selection as well as the best lemonades and hot chocolates in the city. The tea selection is extremely extensive, and the staff is very knowledgable and willing to help you out if you don't know what you want. This is the kind of place where you can sit at the bar and chat with the baristas, and there will be a regular sitting next to you reading the paper and ordering \"the usual.\" While the tea menu is huge, if you get the teas of the day listed on the board (which are color coded by type: black, green, white, or herbal) you'll get them for a lot cheaper. I recommend hanging out for a while with a pot of a tea of the day, which is only $3 for the pot with 2 hot water refills. I also highly recommend their grilled cheese paninis with tomato, which are overpriced but too good to pass up if you're hungry. The hot chocolates are great specialty drinks in the winter (better than any coffee shop I know) and their specialty lemonades rock in the summer. I've known a handful of the baristas who worked here and all were happy and had fun befriending customers during their shifts, which gives this place one of my favorite cafe atmospheres."}
{"text":"Horrible tea... Came there to get a bubble tea. Was made a concoction that was neither an edible drink nor a tea.  Total waste of time and money."}
{"text":"I came here with a friend and her young child for my first visit.  What a nice and friendly place!  The staff was super sweet and helpful and suggested some different teas for my friend.  I ended up getting a white tea which was nice.  

The cafe has both tables and comfortable side seating (long comfy bench).  I believe they also have a couple of comfy chairs.  In addition to the internet, they have made this a cozy place with games that customers can play with - both for adults and children!  My friend's child ahd the time of his life.  

I'll definitely be going back!"}
{"text":"I'm a graduate student here in Pittsburgh, and this is one of two main places I go when I want to get work done. The tea selection is excellent, and the staff was excellent - everyone knows the teas very well."}
{"text":"Can't vouch for the sushi as I only stopped by for a lunch time snack.  Tried the sandwich of the day which was a grilled cheese pannini and I have the iced chai latte.  Both were tasty and reasonably priced.  Staff was friendly and place was clean and comfortable.  If I was living in this area I could see myself coming in here on a pretty regular basis."}
{"text":"This is my favorite cafe in Pittsburgh. I'm not much of a coffee drinker, I prefer drinking tea or smoothies if I'm sitting at a cafe and Te Cafe is perfect for that. It's a very chilled out place, got big windows and all kinds of seating. It's not the fanciest cafe around, which is actually nice, because it has a very comfortable vibe to it. They have free and unlimited wifi. The ambience is great for doing your own thing, but I've also played board games there.

They have all kinds of teas there. They have specials every day in each variety, and they give you a pot of it, which is around 2-3 cups. You can also order a pot of any loose leaf tea on the menu. Or, you can buy loose leaf tea as well. My all-time favorite is the Panetonne. It's a black tea with vanilla and orange, and just the right amount of it too. I also really like their Green Tea smoothie, they make it with Maccha powder. They make grilled cheese sandwiches and have some biscottis and muffins.

Great place, check it out!"}
{"text":"I came in for the first time, sat down to setup my computer, and within 2 minutes had a server telling me that if I do not order anything I will have to leave. I'm not sure if I was being judged by the way I looked (wearing sweatpants and ratty t-shirt), or if this is standard practice. I was planning on staying and purchasing a drink, but found this treatment extremely rude and uncomfortable. Do not plan on returning."}
{"text":"Te Cafe does tea well.They have an outstanding selection of teas, and they are very careful with brewing and all of that.

They also have a nice selection of board games and big tables to play on, which is a nice addition.

One thing kills it for me: the music is ABYSMAL. New age, strummy folky wispy Lilith fair crap every time. I still keep coming back from time to time when I have a tea craving but WOW."}
{"text":"I'm writing from Te Cafe right now.  I love this place and always made an effort to come here when I was visiting Pittsburgh from other locales.  It's sad that I don't come out here more often, now that I live here again...

Anyway, they have a fantastic beverage selection (not just tea), high-quality loose-leaf teas you can buy by the ounce, comfortable enough seating, free wifi, and friendly staff.  The music's a toss-up; right now, it's some pretty good oldish rock, but apparently there is \"wispy Lillith fair crap,\" sometimes?  On the bright side, if you show up on a bad day, it is definitely quiet enough to allow you to just listen to your own on headphones.  And the clientele is pretty varied, which I also rather like."}
{"text":"Wonderful place to read, work and snap! Tea pots are exquisite. Every sip makes you want to cherish life more!"}
{"text":"That's my second time here, and I'm so happy that i've discovered that place! Very comfortable and relaxing atmoshere, delicious teas and huge variet varieties them! Friendly, always kind and heping stuff! That's one if my favorite places now!!!!"}
{"text":"Huge fan of Te!  Always a great experience every time I come.  The atmosphere is cozy, nice friendly staff who all know what they are talking about.  Not sure what to order? they will for sure help you out!  I'm a fan of Dragon Pearl Jasmine...yum!  Great place to read a book, do some work, or just hang out with friends.  

They have awesome fruit smoothies, made with REAL fruit!  I've gotten them for breakfast a few times, also NYC famous H&H bagels, you cant go wrong grabbing something on the go here.

I get some tea to take home from time to time, there are tons to pick from its hard to choose!

Their daily teas are always changing and are a great way to try something you may not think you would have chosen yourself.

All in all I think Te is great, I don't how they do it but they do it well."}
{"text":"I only wish they offered sugar. However, good atmosphere. If you wanted to have a decent conversation with a friend of interest, this place is currently ideal. The Chai is amazing."}
{"text":"A neighborhood gem.  Don't come here looking for lattes or other fancy coffee drinks, though - it's a TEA shop.  The sushi is pretty good by Pittsburgh standards (no offense, Pittsburgh, but sushi ain't your strong suit).  It's bright and sunny, which is a huge plus, but that means it can get a little warm; layer appropriately."}
{"text":"Not a tea drinker myself, but I stumble in here about three or four times a year to buy tea for my mom for various gifts. Every time I've been in, the staff's  been great with suggestions, samples, patience, etc. Went in again yesterday, and again...totally great. For being a clueless meathead, I was treated with no condescension, just the barista's enthusiasm for tea.  

One of the good businesses in Squirrel Hill I'm happy to support."}
{"text":"Started going to the Te' when they first opened. The two ladies that run the place are very nice and good to talk to.

The teas are excellent! I have yet to find a better place to get good, loose leaf tea. The presentation is top notch and the variety is excellent.

The atmosphere of this little tea shop cannot be described. I would stop by towards the end of the day to finish up some work. The relaxed setting and fairly quiet place made it easy to focus and get things done.

I don't work in the area anymore, but I'll use any excuse to get back there.

Seriously, it is worth fighting to find a parking spot in Squirrel Hill for this place."}
{"text":"You can purchase from a huge variety of loose leaf teas. It's one of the few places I know that really pays attention to brew times and water temperature. The smoothies are fresh and taste very natural. If you order in, they'll give you your drink in a cup that looks smaller than if you order to-go. They have nice metal counters with lots of plug in places for your laptop. The benches aren't terribly comfortable, but the couches are. Plus, the people behind the counter are great!"}
{"text":"This is my favorite cafe in Pittsburgh.  The ambiance is nice, somewhat modern and chill, but still comfortable.  There are board games available for playing, but most people seem to either be there with one or two other people to chat, or on their laptops making use of the wi-fi. The staff is very knowledgeable about different kinds of tea, and if you need help picking something, will ask you questions to figure something out - green or oolong?  floral or fruity? - and then bring out several teas for you to smell before choosing one.  My favorite so far is the silk oolong, which is a smooth and slightly creamy oolong tea.  I also really like the tea cups they use for Chinese teas."}
{"text":"Really interesting tea flavors. Stop by if your in the neighborhood."}
{"text":"Looove the sushi in there! I was invited by a friend to go over and join him. And I tried salmon sushi, and it was so wonderful! I've never had such tasty sushi before. And the boss there speaks Chinese, which also helped me as a newcomer feel soothing and at home."}
{"text":"I love buying a pot of tea and studying here. It's always quiet, there's a ton of outlets, and you can always get free refills of hot water. It has a great, relaxing environment. Their lavender lemonade is great as is their plum berry white tea. I wish they had more room. The one thing they can definitely improve upon is their bathroom. The toilet is almost always broken and it never seems too clean."}
{"text":"Perhaps one of the best tea/cafe experiences in Pittsburgh. Hands down, this place is off the charts. The ambiance, employees, and tea are the best in Pittsburgh. Their selection of tea is impressively large. The cafe is also a great place to study."}
{"text":"I love this place, it's become my go-to take out sushi place. The owners are very friendly people, the atmosphere is charming and quiet, the tea is very delicious and varied, and the sushi is excellent at a cheap price. I come here at least once a week now."}
{"text":"Not as fancy as Dobra Tea across the street but it's a comfortable place to meet people work, study, read comma or relax. They have a great selection of Teas and coffee the staff is personable and if asked will give her a recommendation without a lecture about tea."}
{"text":"I can't think of a better to way to spend a lazy sunday afternoon than a pot of oolong, a copy of the sunday times, and just sitting back and relaxing at the Te Cafe."}
{"text":"A very welcoming environment! The sushi was excellent and so was the tea. However, we ordered the bubble tea and they told us it would take 30 minutes, which we were happy to wait. Then after waiting about 35 minutes we received are bubble teas minus the tapioca balls, which wasn't very pleasing considering we waited so long for it. Overall this was a nice place I would come back to."}
{"text":"The barista is really friendly and nice.  He'll bring your order to you.

I enjoyed the tea timer that indicated the type of tea and when it was finished steeping!  The Bohemian Raspberry tea and pumpkin spice latte were delicious (the latter was much better than the Starbucks version).

The atmosphere is cozy."}
{"text":"I wouldn't have guessed that a tea cafe would sell sushi but my friend recommended to try this place. Ordered the Twin City Roll which had tuna, salmon, avocado, and cucumbers. There was more sushi than rice so the ratio was good. The sushi looked good and I thought the price was reasonable. But when I was eating it, the sushi didn't seem fresh. There was a strong fish smell and the aftertaste left a slimy feeling on my tongue. The interior of the cafe also had a weird smell... I don't know how to describe it exactly. I don't think sushi and tea smells go well together? I don't know if I would recommend coming here for sushi. Maybe their tea is better as it is a tea cafe."}
{"text":"We've stopped here a few times for sushi, made fresh to order and excellently prepared. Everything we have had has been very very good. And the price makes it a real bargain.

If you are in a hurry, I recommend ordering ahead. Otherwise, sit down and relax and know that it is worth the wait."}
{"text":"Nice basement/attic feeling where it feels like it's probably what your house feels like"}
{"text":"I I'm not sure what happened with this place. They put quinoa in the rice now and you cannot build your own sushi roll. I don't know if it's new ownership but the people that were there were not nearly as friendly or helpful. And when I asked why they put quinoa and Sushi they didn't have a real reason. I am a traditionalist when it comes to sushi rice and to put a dirty tasting earthy grain in with it is just off putting so I walked out and it will not be going back again. This review went from five star to a one-star. Never again will I be there customer."}
{"text":"I loved coming here with my friends and enjoying tea with talking about our little adventures around town. My favorite part and the most memorable part for me were the people around us! I experienced some of the oddest and most interesting people in this cafe and there is something so unique about the energy that has me wanting to go back.

I also love the 3 different colored sand glass timers for green, white, and black tea."}
{"text":"I have trouble ordering tea when I'm out because it's such a simple thing to make. I know there are a lot of nuances to the preparation, like everything else, that can give you a plethora of subtle variation that you wouldn't get if it was made incorrectly. However, I still can't stand paying for it.

However, Te Cafe has a great selection of gourmet teas that make the stop worth it. It's the kind of stuff that, unless you were a tea connoisseur, you would never be tasting. Their menu is full of teas all with names that vary from mundane, to Japanese, to just plain odd. I've been to the Te Cafe a few times but last night I ordered the \"Kokeicha\". It's a kind of smokey green tea that you steep for 3 minutes. I tried to order a tea by the name of \"gunpowder\" but they were sadly out of it. The man behind the counter informed me that the \"Kokeicha\" was very similar.

The tea was great and, honestly, even when something's not your cup of tea you have a fun experience. It's something you usually don't get to try on your own. Who would honestly buy 23 dollars worth of loose leaf tea that they've never tried? I'll leave it to the Te Cafe to let me sample them a pot at a time.

Every time I enter the cafe the staff are friendly, accommodating, and most of all informative. They know their way around tea so someone who is completely ignorant, as I am, can get a little guidance. It's a fun place to relax and enjoy a beverage you usually wouldn't; how often do you drink gunpowder at home?"}
{"text":"Delicious green tea latte and tea mulled apple cider. Cozy atmosphere, generally quiet, would recommend for reading or studying and enjoying good tea."}
{"text":"This place hasn't changed a bit. Still awesome tea, great service and friendly faces. Although, the owners have changed, Te Cafe remains the same. 

So good to be back and sipping on my favorite iced lavender lemonade."}
{"text":"Certainly up there as one of my favorite spots in town to study.  The overall ambiance is very conducive to being productive: comfortable chairs, good lighting, a great selection of music at the appropriate volume, and of course the warm tasty beverages that are an absolute steal.  This place has the most robust hot chocolate lineup I have ever seen, with the Mexican chocolate being my favorite.  Free wi-fi, with no necessary password, makes things all the more convenient.  I also love how this place caters to those who want to study/read.  Sure light conversation does occur, but I hope it stays that way such not to detract from the great study vibe this place engenders."}
{"text":"Good tea, comfy chairs.  I hear the food is also good, but have not tried it.  Nice quiet place to relax."}
{"text":"Excellent looseleaf tea served on a platter complete with tea timer customized for each variety of tea. Nice and quiet inside; this would be a good place to study or read a book."}
{"text":"This place doesn't even need anymore 5 star reviews. But it's just so damn good that I had to.

The employees and owner(s?) are soo nice and recommended some pretty good teas! They also have a convenient water boiler where you can refill your own pot. 

Their sushi is spot on. Honestly, better than some sushi places around the area.  The ambience is really nice, although wish their tables were a tad bit bigger. Still, a great place to study!"}
{"text":"I love Te Cafe. I buy loose leaf tea here and also like to come in and occasionally drink a pot with a friend or my fiance. The atmosphere is great. I love it here."}
{"text":"Great selection of teas.  A very clean and comfortable space with nice plants.  Highly recommended as a place to meet a friend or to study.  The staff is very friendly and helpful.  The food is very good, although I mostly buy the tea."}
{"text":"With a calm, peaceful atmosphere, a very friendly and knowledgeable staff, and a wide selection of great quality products, I would definitely recommend this place.  Both the iced chai tea latte and the sparkling tea were excellent, and I'm sure that their other stuff is great too.
I'm definitely going to have to make a point of coming back."}
{"text":"I'm a former fan of the Te Cafe. I came here regularly for years when I visited Pgh, often using it as an office. I have no complaints about the tea or the food. I've been disappointed three trips in a row that the cafe did not open at the posted time - twice not even close. Consistency and reliability are important, and I've made friends with another Sq. Hill cafe, sorry to report."}
{"text":"Oh what wonderful, delicious, unique drinks they have! I'm a tea person and I was extremely impressed by their selections (with prices better than Teavana, mind you). It's small but beautiful (think Ikea beautiful). And damn good people work there. :)"}
{"text":"I dropped by Te Cafe a week ago with CM to check out their offerings. As a tea lover, having passed it many times on Murray, I'd long been curious about it. My friends who live nearby never wanted to go, however, since they prefer Dobra Tea across the street. Last week, CM wanted to get a hot beverage in the area, and he was game for checking it out, so I was able to do so.

When we went to order, the menu had loose leaf teas listed by type (columns) and by grade (rows), which determined their price.  While you can buy them by the cup, if you're with other people or you're planning on hanging out for awhile, it usually makes more sense to get a pot, since each pot provides 2-3 infusions, and hot water is free.  We decided on a pot of the milk (?) oolong ($4.50), recommended by the barista, which was on the lighter side and was quite pleasant.  Once we'd had a pot and refilled it with hot water for a second infusion, we also got a pesto grilled cheese sandwich with tomato as a snack ($4.75), which was crisp and super-flavorful (thanks for the recommendation, fellow Yelpers!), and complemented the tea well.

My favorite part of Te Cafe, however, was the board games that can be found on the back shelf and front table.  Unfortunately, not all of them are complete, as CM and I found out when we picked up the Ultimate Scenario Game (?), but those that are make for a fun time!  We ended up playing dominoes--which I'd never played with as a game before (just setting them up in rows and knocking them down ;-) ). Since the first two games went quickly, with each of us winning one, we played best out of three. The last game went on to the point I thought we were going to run out of dominoes, but I eventually won.  Yay!

While I understand my friends' preference for Dobra, given that they have a more extensive menu of tea and snacks and a more unique Asian tea house-like atmosphere, I enjoyed Te Cafe for a change of pace. I'd definitely return for another visit in the future to sample more interesting teas--and to play another round of dominoes!"}
{"text":"Before checking out a matinee at the nearby Manor Theatre, my friend Marla and I decided to have a little bite to eat.  We'd never been here before.  It's amazing how a place can be right around the corner from you, yet it's ages before you try it.

But this is a neat little place in Squirrel Hill and it's one of the reasons why I love living in this neighborhood so much.  There are so many individual stores and cafes that make it so preferable to \"Strip Mall Suburbia\".

This is a tea house and not a coffee house.  So don't go looking for ye olde cup of Joe here.  They have many varities of teas here:  blacks, reds, herbals, whites, greens.  They might seem a little pricey here, but they do serve you a 16oz pot here.  And they have all kinds of sandwiches and baked goods here including a cashew butter and jelly sandwich (which I didn't try) and a Southwestern Wrap, which was very good.

If you are looking for gifts for the tea drinker in your life, they have all sorts of gifts available.  They also have Kosher teas too."}
{"text":"Te Cafe is one of my favorite spots in Sq. Hill! In the winter, the windows are usually nice and foggy, providing the coziest feel when you're settling in with a hot cup of tea. They also have a nice selection of pastries and sushi, so you can snack or have a tasty meal while you're there to compliment your drink. Their chai tea latte is deeeeelicious as well, highly recommended! Great prices, great service, great food & drink :)"}
{"text":"Best. Sushi. Ever. I go to Té Café at least once a week, not only for the fantastic sushi and tea but also for the great study environment. After several visits I have never been disappointed and I don't plan to be. If you're ever in Squirrel Hill the Té Café is a MUST!"}
{"text":"Mulled Apple Cider Tea. Deliciousness in a hot steaming cup.

Lots of space to lounge in. Friendly service."}
{"text":"Came on a weekday afternoon to study and it was a good environment to do so. I got salmon sushi for a great price, and the pots of tea with free refills are a great deal too. The employees are friendly and attentive. This place seemed like a nice casual place to spend a few hours studying, and I'd definitely recommend it to others."}
{"text":"One of the Best sushi in Pittsburgh, sushi bowl is outstanding! Service and owners are extremely friendly. The place always clean and very welcoming. The bubble tea great. All food and drinks made with love and attention on front of you.
Love this place !"}
{"text":"Named after Té Leoni, and a favourite haunt of her ex - Fox E Mulder.

This is a posh, trendy, quaint and tiny little cafe aimed at college students, and the products sold here are pretty good. Their teas are nice, and soothed my throat after a night of singing. They let me play here awhile back, and even though less than 10 people showed up to see my concert (loud boos in the direction of my Pitt fan base), it was still a cool place to play. I appreciated the opportunity. It's also right in the heart of the coolest and cutest shopping area in the region."}
{"text":"They have outlets almost everywhere and the seats are extremely comfortable. I had a Kyoto Cherry Rose tea that was absolutely incredible. The staff really knows their tea, the presentation is wonderful, and the atmosphere is beyond pleasant. They also have a few board and card games. Go for work or a game night with friends!"}
{"text":"This quaint cafe is located conveniently in the middle of Pittsburgh's Squirrel Hill neighborhood and is the perfect study spot for university students living in the area. As a student at Pitt, I frequently took the 61C, 61D, and 59U to the shop, which all drop you off basically right at the front door.  Also, with an extensive offering of teas, the menu can please just about anyone... I'd often bring non-tea drinking study partners to the shop, and they were always pleased with their first tea experience, or with the variety of other drinks and snacks available (smoothies, hot chocolate, drip coffee, etc.) 

Not living as close to the area anymore, I still visit Te Cafe as often as possible and I'm never disappointed, and I particularly enjoy the addition of the creative seasonal creations that the staff add to the menu... their latest concoction: Maple Mate Latte... delicious. This place is definitely worth the visit."}
{"text":"Te Cafe is going to be one of my favorite places in Squirrel Hill.  I feel it.

So here is the quick summary:
-  Loose leaf teas served by the cup or pot at reasonable prices!  Cups of tea were around $2, and I got a pot of peaches and cream tea for $4.01 with tax.  The Cream Earl Grey is amazing as well!  There is also free hot water so you can keep going!

- If you are not a hot tea drinker, there is also iced tea, lemonade, and hot chocolate!

-They sell grilled cheese sandwiches with pesto for $4.50 ish.  I don't remember the exact price, but I remember that the pesto grilled cheese was amazing.

-This place gets packed with wifi hogs.  You've been warned.

I really like the vibe of this place.  It's a good place to catch up with a friend or study, and I like that it's on the quiet side of things.  They usually are out of most of the teas on the menu, but there are still at least 50 types.  I will definitely be returning here soon!"}
{"text":"With wireless internet and a relaxing ambience, this was a place I was looking for during my two years in grad school.  Coffeehouses in Pittsburgh often were too loud and rickety uncomfortable chairs.

The owners are often attentive and bring a certain unique warmth to the place.  Sure, a large part of the cafe is devoted to them.

I loved coming here for an after-dinner conversation with a friend or for studying.  Normally I would order a pot of darjeeling or a green tea.  Great selection of teas.  Very attentive service.  They give you a timer to help you remember how long to steep the tea.  The cups are all selected for the particular type of tea being served.

When I was in the area, the cafe closed on Saturdays (being in Squirrel Hill), but I hear the hours may have changed.  Also, the owners seemed to have hired some of the younger crowd in the last few months which changed the pace somewhat.

Still, when I visit Pittsburgh, I will return to this place."}
{"text":"Great selection of teas. sushi are fresh, but I don't like the sushi rice they used, much sticky than I thought for sushi rice"}
{"text":"Yes, I like this place.
They have a wide variety of teas including bubble tea.
And they also have good sushi.
Nice combination.
It was also good atmosphere to talk with friends.

When I paid, I used Samsung pay.
And it worked very well like videos below.

https://www.youtube.com/watch?v=fpPapvJNpWo
https://www.youtube.com/watch?v=czcb5dXjlZA"}
{"text":"Great service and atmosphere. They have all sorts of light drinks, from a variety of teas to lemonade to coffee. The eating area has a number of different sized tables and chairs, including some with throw pillows and others at the counter. There's outdoor seating on nice days as well. It's very ideal for a quiet conversation or work environment. There are also random books and reading materials lying around if you're bored, and I noticed board games in the back as well.

The staff member who served us was very friendly. He even brought over our drink and panini to our table--very exceptional!"}
{"text":"I'm assuming this place has such high reviews because of the tea? I wouldn't know because we didn't order any. Came here a couple weeks ago to relax and drink some coffee. I ordered the grilled cheese panini and the spicy tuna roll. The grilled cheese was really good, but it's hard to mess that up anywhere. The spicy tuna roll was more like a Korean style gimbap with \"spicy\" mayo drizzled over it. While it was ok, it just didn't taste like sushi to me.

As for the coffee the boyfie ordered... HORRIBLE! He took one sip and looked at me with a sour face. I smelled the coffee and it smelled like watered down 2 day old coffee from the 2L pot. So gross. Never again.

This place is not the best, but it's not the worst."}
{"text":"We have been to Dobra tea multiple times, and were always curious about how Te Cafe is. Seeing nice reviews on yelp, we had to check it out!

Pros:
-Barista was extremely attentive and suggested us drinks
-I got the black tea (apricot) and it was delicious!
-Free refils on water, although my pot had already brewed 3-4 glasses of tea
-Interesting collection of books and board games to be engaged with.

Cons:
-Lots of items on their menu wasn't available. (the woman said that the owner hadn't refilled the tea leaves)
-Less extensive tea menu as compared to Dobra
-Place seems a bit run down, and lacks maintenance. Even the tea pot seemed kind of old and was chipped at the spout. 

Overall, this place seems much quieter compared to the other cafes in the other area. If you want to come sit and work for a few hours or study, this is the spot!"}
{"text":"First visit here the other evening and it turned out to be the perfect place to sit and relax after a long busy day at work.  I didn't even look over  the tea selections because this café had me the minute I saw the featured drink listed on their outdoor sidewalk sign.  I thoroughly enjoyed sipping  my  hot cider tea drink on  the cozy corner seat near the window while reading and watching the world pass by.  Truly a good place to unwind and be refreshed."}
{"text":"It's a nice tea shop that also offers sushi.  Think of this as a BYOPC cafe, where you replace the coffee with tea. The tea selection was impressive. 

Sushi was alright. It's about $10 a sushi bowl or rolls. You can what you pay for.  Decent, but not best in town.  

Lovely place as a place to handout or catch up with friends."}
{"text":"This is my favorite place to go in Squirrel Hill. There's so many different drink and tea options, I have to keep going back to try everything! The atmosphere is really nice and chill too- perfect for reading, sketching, studying, etc. I only wish there were more pastry/dessert options, other than just tarts and biscotti. It may actually be a good thing (for my wallet) though... haha."}
{"text":"I can't believe all this time I did not write a review for Té Cafe. Since I came to Pittsburgh 4 years ago, this place has been my favorite location for some serious work. Hmmm, maybe I didn't write the review because subconsciously I wanted to keep this little gem all to myself. 

They have an extended selection of teas though I usually just go for the easy option: the tea of the day. I've gotten their yerba mate every once in a while and I like that they tell you to properly time it at 5 minutes. Nowadays they make smoothies too though I personally haven't tried them (it's nice and quiet without the constant blender buzz). For snacks you can go with the grilled cheese sandwiches or some of the regular coffe shop sweets. Sometimes I complain about the lack of options in the snack department but I have to admit it seems wise to keep the food choices simple, after all you have more than 50 teas to chose from.

If you're looking for a mellow place to work (with comfy chairs) and few people mostly working at their computers or reading their ipads this is the place for you. 

Side warning:  I love the comfy chair and I'll give you mean stares if you happen to occupy it :)"}
{"text":"This is a cute little shop that you might miss if you're not paying attention. The person behind the counter was very helpful and the tea I ended up getting was very delicius. The atmosphere is nice and relaxing, it's worth stopping in."}
{"text":"I would order from them everyday if I could! They make such amazing and fresh sushi and bubble tea! And they deliver! I love the fact that they honor customization to their food too. I'll be back again and again!"}
{"text":"Went here with my girlfriend and really enjoyed this place. Great atmosphere. I'm not that into tea, but I had a couple cups from the pot my gf ordered and enjoyed it. We ordered 2 biscotti, a medium coffee and a pot of tea (which comes with a free refill) and it cost just over $7. The Barista was really nice and helpful."}
{"text":"This is a cool place to read or write or maybe a little of both. The chairs and tables are comfortable and there are plenty of outlets for computers. 

Like the name suggests Te Cafe is known for its tea. The problem is I know little about tea and usually just order lemonade (which comes in different flavors and is really good) or chai. But it seems as if you are a tea lover you'd love this place cause there is hundreds you can order from. 

The staff is nice and seem helpful for those asking questions about the tea.

The negative aspect of this place is that sometimes some of the patrons use Te Cafe's small space as their platform to loudly talk about their political and social hot-botton issues. Seriously dude, i'm hear to read, not listen to your rant.

If I was a tea lover im sure I'd give this place 4 to 5 stars, but i'm not so 3 it is, but a very strong 3."}
{"text":"My favorite place for sushi and tea in the neighborhood. The rolls are big, extremely delicious and also fresh! I usually get philly roll accompanied by green tea latte, it's just wonderful. Brought here a lot of friends - all of them liked the place. Cozy atmosphere and kind service. Definitely recommend this cafe :)"}
{"text":"Aw, I love it. It looks like a really great study area. I would come here to study. Also they give you a pot of tea with free hot water refills. That would be perfect for studying. Also, the guy working there was really helpful with suggestions. And the place inside is just super chill."}
{"text":"Great tea and amazing service.  The only thing that is sad is they don't have bigger space, since this is the sort of place you want to camp out with a cupa.
The lemonade is as good as advertised!  The lavender was bright and delicate.
The person who was working was very gracious in explaining how ordering worked.  She also had many great tea suggestions in case you were feeling intimidated by the robust list."}
{"text":"Really delicious tea and a good atmosphere. Everyone who works here are nice and helpful. I never feel rushed when I work on my computer. The owners are also great, and bring a nice sense of community to Squirrel Hill when you walk in. 

I tried the Sushi here for the first time, and was surprised that they made it on site. You get a lot for $8-$9, and it tastes yummy. Would recommend. 

The mulled tea is my favorite though. I'll miss it in the summer."}
{"text":"Love how they serve their tea if you get a pot of tea. It's also a great study spot, especially since you can get sushi for lunch here. I usually get the spicy tuna roll, and it's a pretty large portion size. There are plenty of plugs and the wifi is usually pretty good too."}
{"text":"Every tea and tea-related concoction I have had here has been great. The atmosphere is bright and warm. They must have taken the other poster's music complaint into account, because I have heard a wide variety of great stuff every time I have been in there.

The staff is always super-friendly (without being annoying) and the clientele is usually a good mix of studying students/laptop users and people actually having conversations.

In short, good tea, good tea-related creations, good service, good music, good place to study or have a chat."}
{"text":"Te Cafe has an extensive selection of teas including dozens of green and black teas as well as a few other variations; you can also order coffee, hot chocolate, and pastries. In terms of ambiance, it is one of the coziest establishments that I have been in making it an ideal place to read, study, or complete some work. It's also a nice venue to meet up with a friend for a pot of tea and some quiet conversation. There are also some board games (including Chess, Backgammon, and Dominoes among several others)"}
{"text":"Great selection of fairly-priced teas. Good food, too. Could be bigger, but never had a problem finding a comfortable seat. Not much to say, check it out!"}
{"text":"Even if you're not in the mood for something from Te Cafe's diverse tea selection, there are plenty of other drinks that satisfy: tea lattes, lemonades (both plain and with unusual flavors like ginger, lemonade and hibiscus), hot chocolates and more.  The pleasant staff is knowledgeable about its teas and can offer great recommendations.  The loose leaf tea is also sold, and some of the more unusual tea blends can make neat gifts for people.

The atmosphere is calm enough that I can concentrate if I bring work to do.  It's also really helpful that in terms of food, Te Cafe offers more than sweets--while I loved baked goods, sometimes I need something more than sugar to fuel my noggin.  Grilled cheese sandwiches and vegetable soup are recent additions to the cafe's menu.  While the soup is clearly from the can, it and the grilled cheese are nourishing.  I definitely appreciate not having to pack up all my study materials and leave in search of a decent meal.  

I really like the feeling of community that Te Cafe fosters with an area for posters and fliers for upcoming local events and work by local artists on the walls.  The cafe also hosts occasional poetry readings, but unfortunately I've never been able to attend one."}
{"text":"This is a really nice place in Murray Avenue to study and/or hang out with friends. They have a wide selection of teas, maybe not as extensive as Dobra tea across the street. Nevertheless, I have mostly liked what I got here. They also serve Sushi and some nice food options. In addition to their teas and Sushi, their other drinks like, flavoured hot chocolate and ginger lemonade are also very good."}
{"text":"This place is ridiculously cute, colorful, and cozy, with a huge selection of loose leaf teas.  They offer teas by the pot only, except for iced teas (during warm months) which come by the cup.  They range from $3 to $4 per pot depending on how fancy the tea is.

The staff here has been friendly every time I've been.  They are always keen on offering suggestions if you ask!  Last time, I was struggling between going for a fruity tea vs. a chocolatey tea, and the girl working suggested this chocolate peppermint tea blend that was not on the menu but that she had made for herself the other day.  I tried it, and it was AMAZING!

My experiences with the food here (from at least a year ago) have been great as well.  They have their own pastries as well as a selection from a nearby bakery.  Savory offerings include grilled cheeses, soups, and sometimes specials.

One small gripe I have is that their teapots tend to, for whatever reason or another, leak some tea leaves and residue when you pour into your cup.  I suspect it's because the filter is not super fine and so small bits from the tea mixture can fall through.  It's never been a major problem, though.

You can always find fun, seasonal specialty drinks here too (e.g. hot apple cider in the fall), in addition to coffee, if tea isn't your thing.  Newspapers and reading materials are usually available to pick up, and there are board games in the back.  This is a great place for a rainy (or cold) day!"}
{"text":"Simply put: my favorite working place in Squirrel Hill. The tea selection is huge and the very friendly staff will be delighted to offer you advice or some to smell if you need guidance or odors to help with your decision. There is a nice selection of biscotti, donuts and various other hot-drink complements. Oh and if tea isn't your thing, try the six amazing hot chocolate flavors (raspberry is incredible) or there's also decent coffee.

The ambience and decor are bright and friendly and you will never run out of outlets. I once calculated that there are 3-4 per person when it's full (seriously!). So, if you run out of outlets you are carrying way too many devices with you.

If you end up hungry for something more substantial than the sweet snacks, they also offer grilled cheese sandwiches for $5, which will give you that extra boost when you need something more savory.

This place really can't be beat."}
{"text":"I've come here twice and have to say their tea selection is fantastic. There are so many different kinds of teas and I appreciate the variety they offer in terms of food + ambiance + teas. 

I would give this place 5 stars but I am not a fan of their bubble tea. They microwaved the boba (they pre-make it and then put it in the fridge) and the flavor didn't even taste like tea. It was $4 and I don't feel like it was worth it. I was hoping it would be better since they do specialize in tea but I do realize that doesn't necessarily mean their bubble tea would be good since in my opinion that is a whole different category.

I would come back strictly for their hot teas but definitely not the bubble tea."}
{"text":"This is the BEST tea place in all of Pittsburgh! They have a great selection, a cozy friendly environment, and great sushi! I love their teas of the days they feature it has helped me branch out of my usual. Their sushi is also some of the best I have had in Pittsburgh as well."}
{"text":"The people who run this place are very friendly and the lemonade I had was really tasty. The place has a great ambiance. I plan on going back."}
{"text":"Whether it's a quiet afternoon, a first date, or simply a pitstop to grab warmth during the 'Burgh's frigid months, Té Café has set the scene for many of my memories over the past few years.

There's something magical within the smaller details. The cozy interior. The way the large pane windows steam up in the winter, encasing you from the outside world. Colorful outdoor seating in the warmer months. An assortment of high-level academic texts left by local grad students for your perusal (seriously, I saw an Intercontinental Ballistic Missile A.I. Design textbook once). Or maybe just the most important aspect: a large rotating stock of dozens of high quality teas, and a friendly barista staff who is delighted when asked for suggestions.

Inexpensive. Huge selection. Top Quality. And without any sort of pretension. If you are looking for a tea shop that has a 60pg menu with leaf oxidation guides, this is not the place (however, there is another, more ostentatious tea spot in Squirrel Hill that you can try for that sort of thing). Instead, come to Té Café to soothe your soul."}
{"text":"LOVED THIS PLACE.

It's like a coffee shop (/it is a coffee shop ha), but also has sushi. Good vibe and fairly quiet, which I always appreciate. There were about 5 other people working in here when my friend and I stopped in for lunch - and it's sad that this is rare - but everyone respected the fact that everyone else was working and stayed reasonably quiet.

The sushi rolls were good and priced well for sushi. They were a good size too, which meant I ate just the right amount of food for lunch by ordering one roll with a seaweed salad.

The best part for me was by far the service. Very friendly throughout my whole experience. As my friend and I were leaving, the people behind the counter even asked us if needed anything else. We said we were all good and they sent us off with a \"have a good day\" and a smile."}
{"text":"This place is super cute! I went here with my bestie (visiting from CBus) and she said it reminded her of Zen Cha, which I can see. You can order pots of tea, sushi, other drinks and real meals! We got a pot of their Apricot black tea to share. It had enough for about 2 refills and the set it came with was adorable! Taste was rich and fruity and made me want to go back for another flavor!

My friend got their sashimi bowl and it looked awesome! It made a nice, light lunch for her and the price wasn't outrageous. I see that they have crepes too so will definitely have to drag the hubs here to order all new stuff! 
They also have some games in the back but I was happy just chatting with my friend in the laid back atmosphere. 

Some other reviewers mentioned this but the smell of this place really wasn't appetizing--must be due to the combo of fish + tea? The owners were nice enough but they don't start selling their savory dishes until after a certain time which was not listed on the menus. So don't come here too early on the weekends!"}
{"text":"This place is great, it has everything you need! I highly recommend the lemonade, and the sushi is always perfect - I like it all, but I especially enjoy that you can \"make your own!\""}
{"text":"After browsing a little in Squirrel Hill I decided to stop here briefly before heading out and I was so glad I did! Located at the opposite corner of Beacon and Murray Aves from the other tea place I had visited earlier, this place has no particular theme to it.

They serve your tea in paper cups whether you want it cold or hot. The server let me actually sample some of them before deciding. They had an apple cider tea which is a holiday special and it tasted like apple cider. He had a plum and berry tea so when I sampled that I could taste the sweetness. I ordered a cup of that and sat down. I noticed that they offer free WiFi. They are noted for the grilled cheese paninis but they also serve various kinds of sushi. In addition there were dessert offerings as well.

I was very impressed with my tea and definitely wanted to buy some to take home. He normally sells it in bags but I saw a cute Japanese girl tin and asked about how many ounces that would hold. He measured it and told me around 3. I decided to go with that. My 3 ounces came to around $6-$7.00 max and he gave me instructions on how to successfully brew it and how long to leave it in my tea cup to infuse. He wrote it down for me. I thanked him very much and told him I would return.

He showed me plain teapots that had infusers built in them for a reasonable price but since I already have an infuser I didn't really need it. If I had more of an appetite I would have tried the sushi but that will be on my list when I return here. I was extremely pleased that such a plain establishment would let you sample and serve great tea at reasonable prices."}
{"text":"AMAZING sushi, especially considering the price. You can watch them make it and each roll is made slowly and with the utmost care. Extremely kind people as well. Better sushi than all the \"fancy\" sushi restaurants I've been to in Pittsburgh."}
{"text":"Amazing place to read or just relax, lots of loose leaf teas to choose from. Some of their lower priced teas aren't thrilling (especially the greens) but you get what you pay for. 

The only problem I see arising is, if you buy a pot which is the best deal, you get a neat tray that comes with a timer, a cup for drinking, and a cup to hold the used leaves. If you're drinking on your own or with a single friend, that's fine and dandy- but it's near impossible to have a proper meeting with three or more people without forcing everyone to use inefficient mugs instead. I might be mistaken but they really should have party tray type tea sets. 

Still, 5 stars for sure. Excellent service, eclectic music (classical one day, indie the next), good ambiance, good price, decent hours (I wish they would open a bit earlier, but they close so late that it makes up for it), and some really amazing teas mixed in. Free wifi makes it even better."}
{"text":"I dig this place because it usually is pretty quiet and a good place to do some work; the staff is good though they've had a lot of turnover since I lived in PA. The selection is solid but usually not everything is in. There are a decent number of outlets."}
{"text":"This is a tea lovers paradise!  If only they would serve high tea and I'd be in Wonderland!

They have a large and varied list of teas in every kind of flavor and kind (herbal, black, floral, oolong, red, etc.).  All their teas are loose leaf and you can buy it by the cup or the pot.  Um, of course, I had to get it by the pot!  

They give you a tray full of the goods.  A pot with the loose leaf tea of your choosing, a little cup to dispose of your leaves, a mug (of course for the tea) and a hour glass timer for you to time out if you want it light, medium or bold.  I mean, how cute is that?  I almost thought the Mad Hatter was going to appear and we would toast to Alice!  

I tried the Pumpkin Blend and it was delectably fall!  I love black teas because, as I am of English heritage, I must have milk in my tea.  It blended beautifully together.  I actually want to come in every day and try every single kind of black tea!  

They also offer other kinds of specialty drinks, like hot mulled caramel apple cider and Mexican hot chocolate.  Honestly, everything sounded delicious!  How could I ever stray from tea?  But with the look of the other drinks, I probably could once at least, for the sake of being fair!  

The ambiance is totally chill, lots of people on lap tops.  They have old books for you to read.  Tables for groups or your computer and comfy chairs to sit and chat with a friend.  

For realz, I've come home!  Tell the Mad Hatter I'll be there tomorrow!"}
{"text":"This is maybe my favorite study spot in Pittsburgh.

The PLACE: All of the employees (and owners?) are so nice! I've stayed here for hours without ever feeling rushed.
It's usually not too crowded - I've never had a problem finding a seat. The wifi is reliable and there are plenty of power outlets.

The TEA: they have a great tea selection. I personally like black teas, so my favorite is probably the Assam. If you get a pot, you can get as many hot water refills as you want. I find a pot is a little to big for me alone - I can't finish it before it starts getting cold, but it's perfect for 2-3 people. There's no extra charge for sharing. They serve pots on a tray with a timer, so you can tell how long you need to steep the tea for. I also really like their chai latte, and their hot chocolate is AMAZING!

The Food: they make their sushi/bowls here fresh to order. I have liked all the ones I've tried, but I'm not exactly a sushi expert. The roll of the day + tea is a great deal"}
{"text":"Good sushi, nice and helpful staff, and my first taro bubble tea experience was delicious!"}
{"text":"My go to place to study!  They play great music at a volume where you can still hear yourself think.  It's almost never crowded, and the people that come there generally are reading or studying.  They have an amazing tea collection, with equally good food and even grilled cheese sandwiches (with the option to add tomato :) )  One of the walls has some cute benches that are padded, making it a perfect place to wrap your hands around your warm cup of tea and read a book.  I agree with Rachel C, I wish they had high tea, that would make it perfect!  The only drawback is that it's small, and there aren't a lot of places to sit.  If you are the mood to try a variety of tea, or just need a place to study/relax this is it!"}
