{"text":"Best sushi in  Bolton.NOT even a competition. Authentic / Passionate owners, VERY fresh ingredients. A great meal comes out to about the same as other local AYCE places but is miles ahead in quality. Tempura, Teriyaki, Sashimi, Maki, Sushi. All great! Most importantly everything is Fresh. The pillar of good Japenese cuisine."}
{"text":"We came late, restaurant was closing in 45 minutes. Service was still great. The owner was really sweet. Sushi was fresh and they even were open to customizing our order. We ordered plum wine and it was served with an ice cube shaped like a lotus flower. Really cute."}
{"text":"Sushi are so freshly made that if you want takeout, you have to call them ahead of time. Food is great but they could benefit from a quicker cook, even when eating in restaurant. Small family operated business."}
{"text":"Great quality sushi & sashimi, especially for a local sushi eatery in Bolton. Every time my bf and I came for dinner, we would order one of the boats. We would always leave more than satisfied with the nice service and good food.  Only complaint was, we found the cucumber maki rolls to be too simple and surprising to be found on a boat since it is nothing special. In addition from the appetizer menu we were not too fond of the floury, slimy texture of the takoyaki.   Got a chirashi take out another time and was not disappointed! (Had to wait an hour for it because they were swamped with orders, but it was worth the wait. Got my sushi cravings satisfied!)"}
{"text":"Great place for high quality sushi with fabulous service from passionate owners.  Love this place for local sushi."}
{"text":"Very surprised to find this gem in Bolton when passing by. Quality pretty on par with good Toronto sushi restaurants. The sashimi boats were so tasty and fresh!! The decor are very cute and cozy. Owners very tentative. Would recommend for sure."}
{"text":"Fantastic service, quality food and quality prices.  The owners go out of their way for their customers.  John, the head chef has a passion for his work and you can tell from the presentation of his food.  Definitely the best place around for Japanese and Korean inspired Japanese dishes."}
