{"text":"Had the fish sandwich on Friday and loved it!  It was a little spicy so watch out!  The chips and salsa were very good too.  The menu had a good variety of food to choose from.  I thought it would be more like bar food but that is not the case.  I am looking forward to going back and ordering something else off the menu.  Yeah, it's a bar with video gaming machines."}
{"text":"I have ate here more times than I can count. If you leave here hungry it is your own fault. I highly suggest the $1 chicken tacos on Tuesdays and there chessy jalapeño rice."}
{"text":"good fresh food with great prices. quesadillas and chips with salsa.ample portions and not too salty or greasy with just the right spice and toppings. good drink specials, fast courteous service, . only thing I hesitated in giving 5* is their kid screaming behind me. also they could use some new booth upholstering. they are duct taped, but this can be overlooked by the good food or getting take out!"}
{"text":"This place has the perfect bar food.  Let me set the scene for you.  It was the first truly gorgeous day after a snowfall, and the air had both the crispness of fall and the promise of warmth that spring brings.  My husband and I decided to take advantage of the day to go hiking.  Somewhere along the trail, we began fantasizing about the food we would eat when we finished hiking.  Tortas?  No.  BBQ chicken, no, fried pickles.  Fried pickles and hamburgers, and cheap beer.  When we had worn ourselves out and built up that lovely kind of appetite you get after a good few hours of exercise, we headed back to Champaign and pulled into Uncle Martin's Sports Bar.  It was uncrowded on a Sunday afternoon and there were 5+ TVs showing all kinds of sports, including a soccer game.  Wayward Son was playing at just the right volume.  The waitress (who was friendly without being too intrusive) brought a pile of warm tortilla chips and salsa with fresh cilantro to our table.  We each ordered a very cheap Bud Lite.  We munched on chips and salsa as we decided on appetizers, fried pickle spears and, just because, well, we had to, chicken wings with the \"House\" sauce.  Somewhere along the way, Hotel California started playing and the appetizers arrived.  The wings were perfectly fried and meaty, not too fatty, and the \"house\" sauce was delicious, a little sweet and spicy.  The fried pickle spears were crispy and had dill mixed into the batter.  My husband asked, \"Is this place real?\"  and I replied, \"I'm not sure.  I think it's possible that our car crashed on the interstate, and then we died and went to heaven.\"  Our main meals, mushroom swiss burger and the philly cheesesteak, were both really good.  And we had leftovers.  In summary, perfectly executed bar food, nice atmosphere (on a Sunday afternoon, anyway), cheap drinks."}
{"text":"I have been here several times and this is my go to in Urbana. The Philly cheesesteak is the best! I just had the Buffalo chicken Philly and it was great, too. The staff are always a delight. Free chips and salsa are excellent. I plan on coming back for my birthday and graduation dinners."}
{"text":"I'm giving this place 5 stars. I'm not sure of the stipulation on the free chips but I came in around 1:40 in the afternoon and was a parry of 1 and did not recieve the free chips. I was looking foward to the chips and salsa but not a big deak for me that I didn't get the. I ordered a make-your-own burger and it was pretty good. The toppings were all fresh. I also ordered the seasoned fries, extra crispy, and they  were done just to my liking. The fries weren't disgusting greasy like some places can be. Wait staff wasn't very personable. The place was very clean. I'd definitely go back again since the food was good."}
{"text":"First of all, free chips and salsa as soon as you sit down. There's TV's plastered every where so most seats will give you a good view of any sports game you'd like to watch. The burgers are absolutely packed full of goodness while still maintaining a reasonable price. I got a California Burger with fries and shared a pitcher of Long Island with one other friend for just $12.00. The service was amiable as well. This place also features some dance nights, but I'm not sure when those happen."}
{"text":"This is my favorite sports bar in Champaign-Urbana.  It's a true 'sports bar', in that there are TV's playing sports, deep fried foods, and cheap beer that keeps on coming.   Wait staff is great, place is clean, cheap, and fun.  I'd come back any time."}
{"text":"I finally got to try Uncle Martin's a few weeks back. It was pretty amazing! It's a lot of standard bar food but with a twist. I had the buffalo chicken philly. It was super gooey and came with a side of ranch dressing! We all commented that the french fries are very reminiscent of a famous fast food restaurant and absolutely delicious! The prices are great! Thursday night is $1 domestic drafts! What a deal! I will say that the night we stopped in, there was quite a rough crowd. A fist fight almost broke out! No lack of entertainment....not sure if I'd bring the kids though."}
{"text":"Not a very good place if you want a good old-fashioned hamburger from a bar no self-respecting bar would use frozen hamburger patties you can get that from McDonald's worst experience I ever had was there tequila burger and it was absolutely hands-down the worst hamburger I've ever had anywhere won't go back . There are other restaurants seem to use fresh products I don't know why they would use frozen products in this little bar they're trying to get off the ground poor excuse no excuse."}
