{"text":"If you are looking for authentic and traditional Italian delicacies that tickle your palette then you have to experience Uncle Matteo's.These items are better than anything I have ever tasted in Brooklyn or Arthur Ave. in the Bronx...  Frank H."}
{"text":"Absolutely the most wonderful cannoli you can find in the Phoenix area.  His baked goods are hand crafted and truly made with passion to please.  We found Matteo at the Uptown Market in Phoenix--and are so glad he is there!  Thanks, Matteo!!!"}
{"text":"These cookies were just what I needed to remind me of home.  I don't live in Arizona so I had them shipped and they were perfectly fresh-it was quite the win!  Thank you so much for putting your heart in these goodies!"}
{"text":"Delicious and authentic Italian butter cookies! We are happy to have found you guys!!"}
{"text":"I've had the pleasure to have Uncle Matteo's pastries twice and they are so delicious and authentic Italian. You can taste the love in every bite. I especially like the ones that have a filling similar to Nutella!"}
{"text":"These bakery items taste just like the ones your favorite Italian grandmother makes (if you happen to have an Italian grandmother.)  So fresh and delicious and pleasing to look at!  They deliver locally or you can order from anywhere in the U.S."}
{"text":"Uncle Matteo's is fantastic! I absolutely love the nutella pastries.  They are a delicious sweet treat and the owners are just as sweet!  I highly recommend the pastries for anyone looking for authentic Italian delicacies."}
{"text":"We've placed two separate orders from Uncle Matteo's and each time the goodies are gone, we keep wishing they were walking distance from us! The doughnuts were scrumptious and fresh and the Italian Christmas cookies were a huge hit at our holiday parties. Yummy, yummy! Everybody should be so lucky to have a taste of Uncle Matteo's baked goodies!"}
{"text":"As someone who knows and enjoys Italian pastries, Uncle Matteo's delicacies are authentic and delicious. You won't find any better in The Valley."}
{"text":"The original one in town is uncle Matteo!! The freshness of the ingredients is something unique!!! Just one word EXQUISITE!!"}
