{"text":"Service was horrible, food was terrible The spaghetti was drawn in water Burger was burnt Don't recommend"}
{"text":"I work across the street from this place so I'd say been here over 20-30 times but I'm done with this place. Yes there's been times where the service has been good but the amount of times where you wait for 45 mins to an hour for food and then have your order wrong is unacceptable. The place was empty today and still it took forever. It's too bad because the place itself is great and the food is generally good."}
{"text":"Really nice set up with great view looking over College.  The Caesars are to die for and on Sunday they had them on special for only $5! Most of our party ordered the three eggs any style- which no one could finish, the chicken and waffles was also tasty.  Will definitely be back for happy hour and cocktails! I only chose three stars because the service was a little slow and we felt abandoned at times- we repeatedly had to ask for water and coffee refills and the waitress for our neighbouring table kept hitting into us.  Maybe it was just an off day!  Otherwise, food and drink-wise = A+"}
{"text":"Two of my work colleagues and me went to Upper Deck by Frans on Wednesday, January 18th, 2017 specifically to try the $5 shareable menu. Everything listed under the shareable section of the menu is $5.  This is located above Fran's Restaurant and appears to contain two levels, the main level and the upper level. The decor of the place was really interesting and unique and I liked it quite a bit. It was like a rustic futuristic diner type of vibe and I was really digging it.  Food I ordered the Fried Chicken Poutine, Steak Tacos, and the Chicken Tostadas as well as a Pilsner to drink.   I was really curious to see what the size of these 3 shareable places were, and well, I was not disappointed. The portion size, as described by our waitress, was quite large. Honestly, I was almost regretting ordering 3 shareable plates for myself, but it looks so good that I couldn't resist.   The friend chicken poutine was amazing for only $5, it was a generous portion that almost could have been a meal on its own. I do wish there was a little bit more cheese and that the poutine could have been a little bit hotter. Minor inconveniences aside, it was great.  The 3 steak tacos were amazing and very filling. I was worried that with the 3 steak tacos that there would be minimal filling of steak and maybe too much of the other toppings to compensate. I was totally wrong. There was more than enough steak that was stuffed inside the tacos and plenty of other toppings as well.  The chicken tostadas were flavorful, very filling, and the chicken was not skimped on at all.   Drinks  I only had the Pilsner and it was good for the price. They don't have the most extensive beer, wine, cocktail, cider, etc. selection in the world but it was more than adequate.    Service  Our waitress was really great and gave awesome recommendations for the food. There was a little bit of wait time between getting our drinks and placing our food order. But, it appears that our waitress was setting up the dining room and the other tables. She could have certainly used a little more help and she was the only one there taking care of all the current customers and doing setup.  My only other issue is that on the website it states there is a happy hour from 3PM to 6PM. When our table went to sit at around 5:15PM or so, we were told there was no happy hour. Again, not a big deal, but I'm not sure if that was a onetime occurrence or what was going on.  Overall  I have to say that Upper Deck by Frans is something you should check out if you're going solely for the $5 sharable menu. It completely blew my expectations out of the water and I would certainly go back again."}
{"text":"Huge Disappointment  We reserved an area of the rooftop patio for a birthday event on Friday. The server decided to change the area because there is a basketball game on TV without notifying us beforehand.   In addition, the kitchen also lost the birthday cake we brought in and only told us that they will email us when they find it- no intention of compensation or any kind of making up. Maybe they are not used to hosting a birthday occasion, however, as a restaurant that has taken the reservation one week ahead, they should have prepared in advance for things such as letting their kitchen staff and waiters coordinate on storing the cake in the right place or getting a server who is not on her first day of work to handle such a big crowd, thus reducing the chances of making big mistakes. It is not even about the value of the birthday cake but the fact that their service seems to be so messy and created such an unpleasant experience.  It is definitely unfortunate to have such a terrible service and experience at Upper Deck by Fran's and we even have to pay 18% gratuity with this. Overall, we tried to have a good time at the restaurant but if you are someone looking for a place with comfortable atmosphere and decent service, you definitely want to find somewhere else."}
{"text":"I didn't even eat here. I came here one Sunday for Brunch because there was tons of space and there was a line downstairs. The menu looked decent, but service was horrible. We asked for water and got glasses, after 30 minutes the waiter finally took our drink orders and we reminded him about water for our empty glasses. After another 20 minutes we still hadn't gotten our drinks and he hadn't even stopped by to take our food order, keep in mind this place was practically empty. Finally we just left, told the guy we were tired of waiting and went downstairs to the real Fran's where food was great and service was quick. So to recap, upper deck by Fran's is terrible, there's no way the food is good enough to justify the bad service, but somehow regular Fran's is still awesome."}
{"text":"I came here for brunch a few times and it's always been delicious! This place is located just on the upper level of Fran's. The servers are great and the decor gives the patio feel but  indoors. I highly recommend this place for a brunch date with your s/o or even with a group of friends.   I particularly like their eggs benedict. The hollandaise sauce is made with dill for a little bit of an extra kick of flavour."}
{"text":"Came here a while ago when they just opened a couple of days before, so there weren't many people in the place. Went to watch a euro match but since it was empty it felt a little awkward lol . I ordered the veggie burger which was actually pretty good. The sever/bartender was really nice and friendly. The food was mediocre I don't remember anything that stood out to me much but it has a nice atmosphere. I would go back"}
{"text":"Food was good but quite salty for me. It was $10 brunch special. The upper deck is really good in hot summer.  Misting is awesome."}
{"text":"Great little hidden gem in my neighbourhood.  I've walked by countless times and never been up until now.  Nice space, including a retractable roof in the summer.  Tons of seating - our group was 8 people and fit comfortable around two tables.  Service was great, a nice patient server as our group grew and grew.  We started at happy hour with some great food specials, although what came out was a little small.  Still, multiple orders can be shared among a big group. Happy hour prices for beer pitchers are great too - even at normal prices they are reasonable.  Overall, a really nice experience for my first time.  I'd happily come back again and again - nice new spot to discover where I live.  Good service, good prices and great space.  Doesn't resemble anything like the diner below it.."}
{"text":"Food was alright, place was really nice! Come for the atmosphere and drinks it's a fun place to hang oht"}
{"text":"One should keep in mind that when they go to the Upper Deck, they should not lump it in with the quality of the lower level.  I found that comparably my experience was not as exceptional with the Upper Deck.  Unlike the lower level, where one can dine on all-day breakfast items, the Upper Deck serves more contemporary American fare.  You have the option of having poutine, tacos, fries, chicken wings, and other items that complement alcoholic beverages.  We went on a Thursday during Happy Hour, so several beverages were discounted to $5 per drink.  If you're a beer person, most of the draft beers are part of the Happy Hour deal, with the exception of the cider.  If you're into mixed drinks, you are somewhat limited, unfortunately. You get the basics like gin and tonic, one tequila shot, etc. I had the gin and tonic, a concoction that has become my new personal favourite after a co-worker introduced it to me at a low key Chinatown bar.  To my dismay, I felt that there was far more tonic than on average, so it tasted like regular soda with an undertone of lime and alcohol.  It was still refreshing, but it could have been so much more.     We also tried the poutine, tacos, and the $7 deal of 1lb chicken wings.  Everything was nothing short of average, so I would not see the benefit of coming here for the food either.  Price to portion-wise, the Happy Hour deals pale in comparison to what you could get in North York at the fried chicken joints, like Cheers outside Finch Station.    However, I believe that one notable property of this floor is the decor.  It mixes retro with the modern, topping it all off with a snazzy light-up design of Marilyn Monroe above black-red couches.  If you're a fan of Fran's for the lower floor (like me), it's worth a try to come up here for some drinks with friends.    In regards to its suitability for dates, it's a good choice, but maybe not for the first date."}
{"text":"Great selection for seating, fun location, cool vibe, yet lacking in more ways than one. Strangely slow service even when there was little traffic, servers were noticeably uneducated on the menu items, and our meal was totally different than what we expected. No ingredients are listed on the menu. At all. Sure they're pretty simple dishes, but who really likes a surprise when you've been waiting for your food? Not planning to return."}
{"text":"We came here after Nuit Blanche for a drink. Upper deck is amazing especially near the window. Cheap pours ($5 vodka). I didn't try their food, Many vegetarian items but very few were vegan. Quick and friendly service. Overall I'm very pleased with the experience and I'm definitely coming back when I'm in the area."}
{"text":"Who am I to turn down a sangria pitcher special and a $5 food menu?!  They didn't have the Upper Deck Crispy Ribs and the Smoked Salmon Pico de Gallo Roll did not sound appetizing when the server described it. But we did settle on the following dishes on the $5 menu: - Bacon Cheese Bomb - Chili Lime Shrimp Cup - Deep Fried Ravioli - Tenderloin Skewers  The Bacon Cheese Bomb was very bready, and kinda like a pizza pocket; the Chili Lime Shrimp Cup was a cute little hors d'oeuvres with a creamy dill sauce; the Deep Fried Ravioli was lightly fried and had a nice ricotta filling; and the Tenderloin Skewers (which should not be plural as it only came with ONE skewer) was dry and bland.  There's nothing really to rave about, but for $5 a dish, I guess you can't really complain. You come for the rooftop patio, drink specials, happy hour, and cheap eats."}
{"text":"An extra star for the location and deck design. The large open concept bench design was a cute touch. However, food and service fell flat for me. I got the salmon benny - and while it wasn't terrible, the amount of smoked salmon was pretty sad, and the \"side of fruit\" was literally just a slice of orange. All for a grand total of $16. Not to mention the 35 minute wait time for our food and another 5 minutes to wait for our change. While our waiter was apologetic, I can't say I would ever want to come back again, considering better and faster brunch places in the city."}
{"text":"A nice little hidden gem in downtown Toronto just located above Fran's restaurant near College station. I haven't heard about this place but my friend suggested it for one of our dinner outings. When we were walking to the restaurant, I never realized there was another restaurant on top of Fran's as the entrance with a staircase leading upstairs is kind of hidden. To get to the restaurant, you have to go up 2 flights of stairs to a heated rooftop patio. Our server was very nice and informative in recommending some of the $5 shareables.I have to say I was quite impressed with the amount of the $5 shareable of the Fried Chicken Poutine as it was a pretty good size. We also ordered a variety of shareables like the fried green beans, chicken toastada, steak and chicken tacos , deep fried ravioli, crispy beef wontons. I was very impressed with all these dishes as it tasted quite flavorful and delicious. My favorites were the chicken toastada and the fried chicken poutine. I was pleasantly surprised that I was full after consuming all 3 of my sharebles. Overall, it was a wonderful dining experience and a great restaurant for cheap eats. I highly recommend this restaurant."}
{"text":"I was quite impressed.  Fish tacos were interesting with the homemade fried bread as the taco shells.  Be careful if you're sensitive to spice b/c there was big chunks of jalapeno in the pico de gallo.  It was too spicy for me, but I was able to manage with lots of water!  I didn't care for the fish tacos myself, but they didn't taste too bad.  Just didn't love the taco shell.  My boyfriend had the burger.  I had a few bites.  It was delicious!  Definitely homemade.  Fries were good too.    Relaxed but friendly service.  We came late on a Sunday evening so definitely appropriate given the time of day.    Lots of TVs to watch sports on the big screen.  Very large rooftop patio, and then an inside area on the floor below as well.  Great for groups and will definitely be coming back for drinks this summer.  I may have just found a hidden gem!"}
{"text":"Upper deck is a funny and unexpected place on Yonge and college.  Considering the size of the space and what it offers I was surprised it was not packed. As a part of Fran's I expected a more diner experience out of habit. Instead I was met with this really chill bar experience.  Yes tv screens playing sports can be found. The real funny thing is the water mist that intermittently sprays guests. Something I'd expect in a club. Made me laugh every time.  Picnic style tables except by the window area.  Specials run every day. Food was pretty decent. I expect it to run from the same kitchen as Fran's. So home comfort food you can't go to wrong with.  They have a 5 dollar food menu so if you come just for drinks. You'll be happy as a clam.   I'm glad I checked out this place. Its definitely a nice surprise"}
{"text":"Came here to check the place on staterday night. Really loved the place the view is amazing from the upper deck which was under expected with a cheap prices 5 bucks for vodka. Got some fries as well which were good. Serves were nice and hot. Our server was the hottest. Definitely will come back for this location."}
{"text":"Came here on a Tuesday around 5pm and place was 25% full.  The decor looked like it was recently renovated and had a modern diner feel.  The service was attentive and friendly.  My friends and I wanted to check out their $5 menu.  I got the fried chicken poutine and cheese burger skewers.  The fried chicken poutine was good.  Chicken was crispy and not dry, fries were crispy and gravy wasn't too salty.  The cheese curds was more like a few pieces of melted mozzarella cheese.  Overall the dish was really good for $5.  The cheese burger skewers were disappointing.  Burgers were dry and came in two small skewers.  Not worth $5."}
{"text":"Great hidden gem downtown! Walk up a couple flights of stairs and be transported, away from the hustle and bustle of Yonge and College! The all-season rooftop patio is a great place to get brunch or drinks with friends. And if you're seated near the window, you get the added perk of doing it all while people watching.  The menu is smaller and different from its parent restaurant downstairs. Food is decent and good for the price. I got the '3 eggs any style' off their weekend brunch menu, which comes with a side of bacon, homefries, and toast--pretty average breakfast that you can get almost anywhere else. However, when I come here I tend to come for the atmosphere more than the food (so don't come here expecting a gourmet meal). Servers are nice, but service can be a bit slow, even when they're not busy. They have amazing daily deals, including $5 Mimosas, Bellinis, and Caesars on weekends!  All in all, I highly recommend the Upper Deck on a nice summer day. If you're looking for a patio with decent food and a cool atmosphere, this is what you're looking for!"}
{"text":"You know, it's really too bad I have to give this place 2 stars. Their food is what you expect, nothing spectacular, but their menu of daily specials is awesome. Now, here's where the two stars come in. I've been here a couple times and every time the service is painfully slow. It never gets busy there - they get a few tables, but nothing that would cause a server to be in the weeds. Every time I finish my drink at this place I either have to go to the bartender or flag a server down. I mean come on! I can't recommend this place to anyone because the service is so poor, but I would love to come here on Sunday's for Caesars or after work one night.  Please get it together so I can justify coming back and enjoy your specials again. I'm just too frustrated with your awful service..."}
{"text":"Decent spin off of the ever famous Frans breakfast franchise. I went for dinner and tried the Sweet Onion Chicken Burger which was pretty decent. My friends ordered the fried chicken poutine and the ribs. The fried chicken poutine seemed very good for its value but the ribs were somewhat small and lacking in flavour. My other friend tried the chicken and waffles and they said the chicken was good and juicy but the waffle was kind of soggy. We originally wanted to go up to the top patio level but there was some kind of special event.  Overall it was a good try, but I think I would prefer the original Frans resturant"}
{"text":"Came again for brunch on Sunday. The wait this time was superbly long, although our waiter was trying his best and being very nice about it all. The Bellini I ordered was a mess to say the least. Although I'm giving it 2 stars doesn't mean I won't be back as it's such a convenient location for me and the patio is such a nice setting for summer brunch."}
{"text":"Came here with colleagues last night. I had reviewed the menu online to get a sense of their prices, drink options and food range. Unfortunately there were no prices online except for their $5 menu, and I could not find the drink menu. The venue itself is large and comfortable, and the third floor was packed but the 2nd floor was empty. I generally order draught beer, but found the options limited (craft beer options would have been nice), so I got a glass of wine instead - something I almost never do. I also ordered the fried chicken poutine from the $5 menu. The poutine was good, but salty and the gravy tasted like powder. A friend ordered the cheese bomb (can't remember the exact name), and it was awful and no one would touch it.   I would return for the venue, but I'll likely eat beforehand & stick to a glass of wine."}
{"text":"The sign on the street, and the decor give the place an attractive and inviting atmosphere. It's kind of throwback 50's styling with modern flare. The burger was delicious; thick, juicy patty and plenty of toppings. I ordered a side of what I thought were deep fried dill pickle pieces but then they brought me fries with dill pickle flavouring. They were good nonetheless, but they left the fries that came with my burger, a little lacking. I would have got the salad option if I'd known. There are as a Saturday through Thursday late-night \"misery hour\" with decent deals on drinks like pitchers of Sangria and beer, but we didn't indulge."}
{"text":"Overall, would not go back again. We were a larger group (12 - 14 people) on a Friday lunch hour but waiting over an hour for our food just isn't acceptable. When I asked if that is normal, the response was yes when there are a lot of people. So essentially they don't have the kitchen staff to support their rooftop adequately so expect very long waits. Too many other more efficient options to deal with such a wait.   In terms of the food, the Lasagna was probably 2 out of 5 stars. Nothing to get excited about. In addition, I asked the waitress if they had any wheat beers to which I was told they had one that was Raspberry flavored so I went with a Cider - guess what, they serve Blue Moon on tap... more than a little annoying. I ended up tipping 10% because the waitress gave the impression she was possibly new, but I hated myself for it.   Not recommended at all."}
