{"text":"Have been walking by Uptowne twice a day, waiting for a good occasion to go have a nice meal there.  This review marks my first time there, and my experience was all but fine for a good portion of the meal.  Ambience was nice, service was attentive, menu looked sophisticated, and the bread was soft and still hot.  I expected to be treated to a delicious meal, but was greatly disappointed when the food arrived.  My chicken over saffron rice was nothing more than that.  Seasoned with a few spices and topped with slightly carmelized onions, the dish tasted rather bland.  My friends had similar experiences- eggplant parm had four rather small, not fully cooked pieces of eggplant over a boring red sauced pasta.  The special of the night - rack of lamb was apparently made well, but portion size left a bit to be desired.  For $17+ entrees, I was expecting much, much more than what we got.  Wine seemed overpriced as well.  It was quite disappointing for a $82 check. (3 entrees, 1 glass of wine, 1 dessert, plus tip)  For what you get, the prices are outrageously high.  If you're looking for class with fine cuisine included in the experience, I would highly recommend L'Albatros the next street over.  My $60 meal there (2 entrees, 1 glass of wine, plus tip) was well worth the money."}
{"text":"I cant speak for the others on here, but I'd love the lamb shanks and the paella here.  its hella good.  the freebie bread is really good too.  make sure they put butter on it and toast it."}
{"text":"We had a nice meal at the Uptowne Grille on a Saturday before the Symphony.  The waiter was prompt and polite and the wine list was good.  I didn't enjoy the Chicken Fez- too much like cinnamon coated chicken in sauce.  My husband did enjoy the very tasty lamb chops.  His house salad was good, but my pear salad had a very large and plain piece of polenta as the prime feature.  It wasn't bad, but it wasn't what I was thinking it was."}
{"text":"This place is alright.  The bar is kind of nice to grab a drink, and the higher prices (as opposed to those found at the bars on Lee and Coventry) keep the college crowd mostly out of it.   The food is good, but it seems a bit expensive for what you get."}
{"text":"This restaurant looks like and tries to act like a trendy, upscale bar and restaurant. The reality is that it puts out some alright food at moderate to slightly above average prices. The service is okay, but pretty unprofessional. It really is best as a late night spot for college kids to go and get some drinks.  The bar? okay. The food / restaurant? Don't bother."}
{"text":"Man, I really hate writing reviews about places I'm just not thrilled about. It's like yelling at a pet... who ever really likes doing that? No one.   It's my job to be honest though, and I have to say that everything about this visit was below sub par, except for the phenomenal ladies I dined with.  I came here for a quick lunch meeting, had great conversation and that's what made the meal. The server was kind of awkward, not bad--just weird. The food was, well...let's just say it wasn't for me. Granted, I ordered a turkey and swiss wrap, but it was lunch! If you're going to offer lunch options, please make sure it's worth ordering. There was way too much mayonnaise-y stuff on it and it just had no taste. To top it off, the \"diet coke\" or generic soda was just not tasty. I thought the redeeming quality would have been the delicious looking fries, but alas, they were not.   I know Uptown has been around for a while, but I never got around to going here even when I lived in Cleveland Heights. It was just understood that there were better restaurants all around the area--for the price and the food. Sorry. Maybe I should have ordered something different, but I don't think I'll return to try."}
