{"text":"We were planning on going to Outback, but because the steaks were so bad the last time we were there we opted to go to Urban Roadhouse.  There were 6 of us and, and we were all very happy with our service and food.  I personally would recommend going to this steakhouse over Outback, and it is about equal in quality to Longhorn.  In some ways I prefer this steakhouse to Longhorn too.  It is closer to my house, and doesn't have that horrible smell that Longhorn has....can't figure out what that is, but you get use to it after you've been there for a while.  Urban Roadhouse is just as good without the bad smell."}
{"text":"We made reservations at 1pm on a Saturday for 8 people at 4:30 . When we arrived there were 3 tables with people at them. But we were told we would be seated at 2 different booths!  We came together and wanted to eat together! The Longhorn had no problem meeting our needs.!!! Will never go back"}
{"text":"We've been here a couple of times and we were very pleased with the food as well as the service. Portions are plentiful with a wide variety of entrees to chose from. Definitely recommend it (I already have)."}
{"text":"Have to say we really enjoyed our meals. Steaks were cooked perfectly, quality very good. Good value, priced like outback, etc, but better quality. Entrees come with two sides. One of us had the stuffed flounder, also very good.  Though open only a short time, service was very good even on a busy Sat nite. We'll come back here again soon."}
{"text":"My new favorite restaurant.  Bonless rib-eye was the best steak I ever had.  Appetizers were great too.  Had some a good drink menu, and prices were low for such great steak.  Waitress was very friendly.   Will definitely be coming back here whenever I can go for a steak!"}
{"text":"Had dinner at this new place with a party of 7 yesterday ,they were very busy and very accommodating . We shared three appetizers and each of us had a different steak,all were cooked perfect and this is our new favorite place to go."}
{"text":"We have been twice  while in town.  the food was super and the service was extraordinary. Our waiter both times was James. wonderful personality  and very proficient.  A great time was had by all  The   Brown Family from Kentucky."}
{"text":"We had great time at dinner went last night food was amazing the service was great the décor is amazing Everytime you look around you are seeing some thing different. Recommend stoping in if you are around."}
{"text":"My family and I ate there for my birthday. It was a pleasant experience due mostly to our male waiter who was very friendly and attentive to our needs. For example, while olive salad, I eschew croutons and cheese. He brought me one quickly after I told him. Food was good, though not memorable. Boneless ribeye was unremarkable. I'd opt for the bone in the next time. Ambience was okay though unremarkable. I would return again."}
{"text":"Bad service, had to send a well done steak back 3 times to get it with no pink. Automatic 20% gratuity added to a six person table with the bill split three ways. Don't chance it."}
{"text":"Good food, service and a fair price. You will be very satisfied with your visit to this restaurant. This business deserves the stars for the effort their staff gives to serve the public and the value of the product you receive for your money"}
{"text":"Service was good, food was good- we both had burgers and they were cooked as we requested. Menu had many selections and prices were reasonable. Will return for sure to try something different."}
{"text":"A great impromptu night out with my wife. I tend to support local businesses, so this was a natural fit for us. What a great choice for us. I had the special (24z ribeye), and my wife had the pulled pork. Both items came out perfect and at a reasonable amount of time. Now for the service. Wow, just wow! Absolutely spot on. Needs were anticipated, and very sensitive to a gluten free diet as well. Cocktails were perfect too."}
{"text":"The salmon was delicious and cooked perfectly. I really liked the seasoning they used on it. The inside is very nice and clean. The staff is super nice. I would definitely recommend."}
{"text":"Service and food were terrible. My husbands meatloaf dinner came out and my steak didn't arrive at the table until 10 mins later when the server realized there was a problem. Drinks were never filled and when my steak finally arrived it was tough like shoe leather. I informed the server who just walked away. She gave us a free cheesecake for our trouble but it tasted like wax. Sara Lee store bought is better. Date night ruined!"}
{"text":"Great bone in ribeye dinner $21.00! Love the decor too. My wife enjoyed a run dinner and the service was very good."}
{"text":"Not sure if employees are the ones posting the good reviews. Worst steak I have ever had, cold cooked wrong, and took 2 hours. I don't see this place making it. The one star is for the blue moon, it was good."}
{"text":"Came here on a Sunday afternoon and had prime rib and salmon. The salmon was phenomenal and cooked perfectly. Same with the prime rib. The servers were on top of everything. The inside decorations were great and had great music choice."}
{"text":"New restaurant in Mentor!!!  My husband and I visited this restaurant on a late lunch early dinner on a Sunday.  The menu is very diverse.  The food is fresh, no  pre-package here and it is noticeable in the quality of the food and the display of the rotisserie and steaks and deserts in the display case.   My husband ordered the T-Bone dinner which came with two sides, the steak was cooked perfectly and tasted amazing.  I order the country fried steak..OMG!!!  I have never ever had a better country fried steak in my life.  The gravy to die for, the mashed potatoes perfect, the steak, and I mean steak, was awesome and flavorful.  The décor in this new restaurant is very nice and suitable.  Atmosphere is relaxing and suits everyone of all ages.  We will be going back again, again."}
{"text":"I had the 12 Oz ribeye. It was done to perfection.  My wife had the meatloaf. She said it was very tasty but was filling. We needed a container.  Service was excellent, very attentive and pleasant.  We will return."}
{"text":"This is a great place we found in the area. We we seated and James was our Waiter. We ordered our food and James was very helpful with our menu selections. He came by the table multiple times to speak with us about the restaurant and was very attentive with our orders as well as suggestions. James is an excellent waiter and a great asset to the establishment. The food was excellent and cooked to order. The prices are about average for the menu selections. Everyone enjoyed our meal as well as dessert. I would recommend The Urban Roadhouse to everyone for a great meal at great prices."}
{"text":"Great bread with yummy butter! Reasonably priced or even better? Ordered sirloin green beans and potatoe. Sat in the bar. Steak was chewy but had good flavor. Green beans had obviously been staying warm throughout the night. Baked potato was perfect. I like this restaurant and can't fault a chewy sirloin for ruining it. It is an animal and they vary. Brittany the bartender was polite and great"}
{"text":"Stopped in and had a drink and some wings. Sat at the bar. I was VERY impressed with the service we received. The atmosphere was esthetically pleasing decorated in an industrial-western type style that was casual and comfortable. The TVs were ample and visible, but smaller. My drink was a very generous pour for the price. The bar staff brought a complimentary bread basket. The wings were large and meaty. The menu stated they were naked, but they were breaded. The sauce was basic, nothing special but they were good. The restaurant was full, but there was no wait. I could see them having a good base of regulars and with a couple changes giving them a special draw, they could really be a destination. I hope they succeed here. One of the best places to give this location a go so far!"}
{"text":"Stopped in for lunch and got burgers. We didn't have to wait long at all.  They were HUGE and cooked perfectly pink for us.  Very very good. Suggestions would be to offer more cheese selections...only American and Provolone...and offer sliced bacon instead of bits on the burger. )The bits get buried in the meat.)  Tons of fries. Thick cut petals, very yummy.  Excellent coleslaw!  Definitely a great meeting spot.  Very nice atmosphere.  The steaks looked awesome as we passed a table walking out.  Anxious to go back to try them"}
{"text":"I must say I was surprised to see yet ANOTHER attempt at opening a restaurant in this location so you have to give to the owners, they have guts and so do we so we gave them a try.  I was shocked when we straggled in mid-afternoon, the place was bustling, there was probably more people in there then the past 3 businesses combined.  The ambiance is Texas Roadhouse American  (McDowell's from coming to America comes to mind) .   We were quickly seated and the staff was pleasant and helpful.  We started with the calamari, it came out fast and hot.  I had the Prime rib, my gal had the catfish. My prime was done med as requested and required minimal cast offs.  My gal liked the catfish although I tried a bite and it was a bit too seasoned for my liking.  We would go again, overall it was good."}
{"text":"We went for dinner on Saturday night at 5:30. We were greeted at the door and welcomed to the restaurant. A hostess also greeted us as soon as we got in the restaurant. We were shown right to our table by the hostess. The restaurant was about 2/3's full. Our waitress came by for our drink order within 2 minutes of being seated. We got our drinks and ordered an appetizer of Fried Pickles. They came out right away and were piping hot. They tasted great with a Cajun mustard dip. Cold Salads were next with very good dressings, bleu cheese and ranch. A loaf of whole wheat sweetbread with cinnamon butter was a good accompaniment to the meal. The entrée's were well timed to follow the ap and salads. We had a bone in ribeye and the filet Mignon. Both were cooked as ordered, med rare, and medium. My ribeye was covered with large mushroom slices that I shared with wife. The steaks were both very good. We both ordered the sweet potatoes with cinnamon butter that came hot, soft and very tasty. We tried one of their Mule specialty drinks and it was very good. The deserts looked great but we did not have room for them.  We will be back and hope this restaurant stays with us for a long time."}
{"text":"We thought we would give this restaurant a try we did and will never go back. It was probably the worst steak I have ever had, no flavor, fatty with hard pieces you couldn't chew.   No one at the table was happy with the food."}
{"text":"I had high hopes for this restaurant. Very disappointed. I ordered a medium rare filet, and got a well-done strip steak cut down to 6 oz. The manager was nice and offered to recook or take it off the bill. Since my boyfriend was already eating his meal, I didn't feel like waiting, so I just ate the heavy garlic season green beans. The Raspberry drink wasn't any good, since the canned pineapple juice was rancid. I also chose not to send it back after I heard the rude bartender talking 'ish very loudly about a customer who sent their drink back. Didn't feel like getting into a fight, so I just let it go. The server and management were very nice, but the food was awful. Don't go there. You're better off going next door to McDonalds."}
{"text":"The New York strip steak is very good  My third time and been good each time Steak salad was good and reasonably priced Pulled pork nachos are good as appetizer, very large The Urban dark draft was also good ,with frosted mug, reasonably priced"}
{"text":"Just went for Saturday lunch. Highly recommend this over our last few disappointing long wait visits of poor service and quality of food at Mentor Longhorn, Outback, and Willoughby Texas Roadhouse.  I had huge 1 inch thick 12oz. Prime Rib and garlic mashed potatoes. Meat was cooked rare perfect served with AuJus and a creamy horseradish sauce.  Boyfriend a a large very meaty slab of BBQ ribs with an extra large sweet potato. We shared a large wooden bowl of salad with carrots, tomatoes, cucs, cheese and croutons. Rolls with cinnamon butter were tasty. Both ranch and creamy Italian dressings seemed homemade and awesome.  We both took leftovers home. Thanks to James for the friendly service. SUPPORT LOCAL"}
{"text":"I can't say enough about this place. The food is REALLY GOOD, the service is awesome and fairly priced, and we often have difficulty in deciding what to order, because there are so many great things on the menu to choose from!! If you're looking for a really cool place with great food, great service, and won't kill your wallet, then the Urban Roadhouse is the place to eat!"}
{"text":"We had absolutely great food! But honestly the best thing about tonight was the service! Athena was seriously one of the best servers I have ever met. She was sweet as she could be and Johnny on the spot with every single thing, we didn't have to ask for a thing! We will definitely be back."}
{"text":"This was my first time at the restaurant.  The menu selection was good but lacks a sampler option for appetizers.   My wings were great and the waitress, Shannon, was very prompt and sociable."}
{"text":"Salad and rolls were good. My husband and I both ordered the 8 oz Sirloin medium rare which came out more well done. My husband also had the ribs, which were definitely not fall off the bone. Broccoli was ok. Probably will not return."}
