{"text":"Ordered a skillet. Huge amount! Less than 10 bucks and you can be full! Great place to have brunch. The price of the waffle is a little bit high though."}
{"text":"This is a family run restaurant that fills the need of home cooked food at a fair price.  There is a comfortable feel with wait staff that calls you Honey. On Fridays they tend to have a all you can eat special, deep fried walleye or fried chicken. Is this the best food I have ever eaten, No, but there is lots of it and it is always good and reasonably priced.  They open at 5am till 10pm, daily.  If I am hungry, this is my goto place."}
{"text":"Just popped in for something quick before our conference down the road. Soup: chicken & dumplings. Excellent! Lots of meat & flavor. Friendly waitress. The decore didn't bother me (like some previous reviews). We're going back the while 4 days were here."}
{"text":"Our food tasted like feet, and I have felt sick for the past four hours after eating there. None of our meals were good, and we think the milk that was in the waffles and pancakes may have been spoiled. Horrible."}
{"text":"This is the place with the big EAT sign in front of it.  For four years, I was afraid but enticed to enter.    Finally I caved to that EAT sign and said, \"I must EAT there.\"    What a surprise it was! Here are the surprises 1. Their coffee sucks  2. Their fried chicken is AMAZING 3. All their pies (especially the pecan) is like awesomeness in your mouth 4.  The breakfast omelettes are a frown... which is so unfortunate because I can never find a unbusy good brunch place.   If you're suspicious like I was, it's worth a try."}
{"text":"Typical diner that serves bad food at okay prices. Severe lack of vegetarian options. I got the \"Big Breakfast.\" The waiter wouldn't let me substitute orange juice for my coffee, even though I offered to pay the additional 45 cents and give him a handjob in the bathroom after our meal.  Overall, pretty lackluster restaurant. Looking back, the only positive aspect of this place is the giant EAT sign."}
{"text":"Lot of food, if volume is your criteria, this is the place.  Good food, no, sort of like I remember army food.  Cabbage roll was way too salty.  Rack of ribs too fatty."}
{"text":"Meh is about right.  The service was good.  The main reason we picked this restaurant (for a large group, about 20 people) was because of the All-You-Can-Eat ribs special, which several people ordered. Only after we placed our orders, turns out they had run out of ribs.  They also refused to substitute the pork ribs for the beef ribs, which was very disappointing.  Salad bar was OK.  The broiled salmon was really good.  Probably would try a different place the next time we visit."}
{"text":"Just your standard diner.  Nothing special, but good food, salad bar, good size portions.  If your not looking for anything fancy, but just want to get something to eat it's the place to go.  Meatloaf dinner with mash potatoes and green beans, with soup or salad was $8.95.  Was hot tasty, maybe too much gravy."}
{"text":"The food was amazing.  Amber was so sweet and accommodating.  Great experience.  Definitely will be back ."}
{"text":"I like going out to eat and my wife likes the chicken they serve here,so we went Friday the 13 and it was the worst experience we had there my wife had chicken and it was terrible it was nothing like it usually is. it was greasy seemed under cooked, I only go there for my wife to me the food taste cheap . the service was terrible. my wifes not sure she wants to go back which is to bad because that was her favorite place to go for chicken. the management was terrible that night."}
{"text":"Got in for breakfast before the sun rose on Homecoming weekend. Friendly staff and super quick service.   Ordered biscuits and gravy with home fries and 2 eggs scrambled. It was hot and tasty!  Only thing preventing 5 stars is the coffee. It was weak. Probably Maxwell House"}
{"text":"The food is okay. In my opinion this restaurant has that rustic diner feel but a diner that has been renovated to look modern. The seating is very comfortable and the staff really friendly. They have pretty good specials throughout the week as well.  Over the weekend I got a Denver omelet, no potatoes, and 2 pieces of toast. The omelet was alright. The onions and green peppers were raw and made me feel they just threw them in at the end. It was still good but I wished they were cooked a bit more.  The toast was dry and a bit hard even with the minimal butter they put on. I had to put jelly on my second piece to be able to finish it.  Overall I would continue to come her because I like older style sit down restaurants despite the food being mediocre."}
{"text":"Had breakfast there.  The menu wasn't impressive.  The coffee was awful.  Service was prompt but lacking any warmth.  Had a skillet.  The food was unremarkable but not bad.  I wouldn't say not to go here to eat, just go with modest expectations."}
{"text":"Came in on a Wednesday night while passing through for work . Got the \"All You Can Eat Broasted chicken \" and it was delicious . Hot, fresh, crispy skin with white moist chicken inside . Sure, it took time to prepare (maybe 20 mins ?) but was so worth the wait - colonel sanders would roll over his grave cause this is one family's chicken I'd choose before the KFC that's attempted to be sold . I'll be sure to be back soon . The only thing that I wish they fixed ? The exterior sign and etc since it didn't exactly look appealing, and if it wasn't for the recommendation of the hotel I may have totally missed this ."}
{"text":"Great place to eat. Large portions. Huge list of daily specials. You won't leave hungry!"}
{"text":"I just went there for lunch with my family today. Everyone there is really nice and the service was good. The waitress we had was really on her game. The food came out hot and quick. Honestly no complaints. The reason I'm giving it four stars is because the waffle I got tasted a bit off but everything was still good. Their bathrooms are clean, everything is honestly amazing here. I will come back again."}
{"text":"I have been going to Urbana Garden for years to get fried whole catfish!   Where else can you get that?   Went today and discovered a new menu with the fried whole catfish gone!! They no longer serve it!   They had one order left, that the waitress discovered after taking our order.  It was good, as always.  BUT...when will I ever return?   Not sure. I was told that they offer it on special sometimes on Thursdays.  So, I am to schedule when I dine there, now? Very sad and disappointed that they no longer have the fried whole catfish on the menu!!"}
{"text":"I used to eat here a lot in my early 20s. Fast forward 10 years and I eat here every now and then. They have fully renovated their restaurant and it's nice.   So, I used to love their Monte Cristo. At some point their recipe changed and now I won't get it anymore.   Their soups are usually very good depending on the day, but their chicken rosemary is my favorite. Beef vegetable is good, too. I like the salad bar and thought that was a good edition to their renovation.   My S.O. and I came here yesterday because we just couldn't decide what to eat for dinner. He got the chicken fried steak and mashed potatoes. I got a Belgium waffle and 2 pieces of broasted (that's right, it's one of the only places that has broasted chicken in town. It's pressure fried and when ordering the machine, they have to be specially trained to use it) chicken and mashed potatoes. I wanted chicken and waffles, but only one place I know serves it and we didn't want to go there.   Chicken rosemary soup was delicious. My chicken was good, but not the best chicken in town. Waffle was fine like it always is. Basically my food okay.   My S.O. said his food was good and the chicken fried steak was huge. He had trouble finishing it.   It's inexpensive, diner food. You can get breakfast, lunch, dinner at any time during open hours."}
{"text":"Went here last night as it was near to our hotel.  Just fine, nothing earth-shattering.  The salad bar was good, chicken &  rice soup also good.   Two of us had the 1/4 chicken meal, another had the perch.  Average around 30$ for our group of four."}
{"text":"3 star might be reaching but whatever. The staff was very nice and friendly and never let my drink get empty. The food... best if you're drunk I would guess. Got the meat lovers skillet with no ham and asked for crispy hash browns. The food came out so fast it surprised me. But everything was already prepared in the back. The food was greasy and warm at best. Overall not bad, but I'm not planning on returning."}
{"text":"Our server was excellent- she was cheerful and on top of things and attentive without giving the sense that she was hovering or trying to smother you.  I had the vegetarian omelette and had the intestinal fortitude to forgo the hash browns (oh, do I love hash browns!).  It was good-sized, but a bit on the bland side.  It was nothing that salt, pepper, and a bit of hot sauce can't fix, however.  The coffee was good- it was hot and it woke me up, just like it's supposed to.  I'd probably go there again if I was in the area."}
{"text":"Really nice waitress but they really need to up the ante on their vegetarian options. They don't even have a plain marinara sauce option for spaghetti!"}
{"text":"My brothers and I ended up at a hotel next to this restaurant.  We always use yelp when trying to find a good restaurant in a new location - and when yelp gave us this restaurant as the #1 in the area, we were doubtful it would be right for us.  It looks like your typical family greasy spoon but we decided to try it because of the yelp reviews & we were hungry.  This is the only restaurant in the vicinity of at least 5 hotels but we quickly realized why.  The food came out in what seemed like 5 minutes and everything was fantastic.  My reuban came with a bowl of soup - chicken rosemary - huge chunks of real chicken breast and perfect flavor.  The salad bar was very fresh and had a nice variety of choices - you can order the salad bar instead of the fries but the fries are nice steak versions - which usually are served uncooked in the middle because they are too thick.  Not here - every one was perfect...and we all ate every one.  The service staff was very nice & friendly. So we went back for breakfast the next morning.  Again, everything tasted great and we had wonderful service and the prices cannot be beat. I would give this restaurant 5 stars but both times we were there, there were kids whining in the back ground.  Not the restaurants fault but it is a family style restaurant and as long as you can put up with a whining kid the whole time you are there, then this is the #1 choice in the area."}
{"text":"Fast, friendly service, reasonable prices, reliable diner food.    My husband ordered a pork tenderloin sandwich \"deluxe\" which includes fries and a cup of their delicious homemade chicken noodle soup. It was hot and tasty, as were the steak fries!  I had a chicken salad sandwich with a cup of soup - the bread was a little stale, and the chicken salad rather plain - just chicken and mayo.   We were out of there in under 25 minutes and for under $25.00 - will have to stop in and try their breakfast next time."}
{"text":"My friend and I came here for brunch on Christmas Day. We first were just very grateful to find a place which still opened on Christmas Day. The food quality was ok(I would give three stars for the taste) I wish the cheese could be melted a little bit more. The service was very good."}
{"text":"This is an Update (July 2011) to my original review from December 2009. This place continues to provide solid workmanlike meals, well-run, nothing flashy, just good food, served by pleasant staff, reasonably priced. Breakfast any time of day. Dinner any time of day. A huge menu, but who needs it they will cook you anything you want and they gladly allow substitutions. Want a cup of chicken soup with your sunny-side up eggs? No problem. Totally remodeled in the summer of 2011, it has a new, traditional American interior, just updated from the 1980 look which is a good thing."}
{"text":"Very good food! Huge portions that are served hot, fresh, and fast. My only complaint is that our waitress wasn't seen again after she served us until she brought us our check. The establishment was extremely clean for an old building. Will be a frequent stop for us!"}
{"text":"It's a place with known-by-name regulars. So that should tell you it's at least good enough. It's a qualified 4 stars in that nothing was exceptional, but nothing was bad. It's a family restaurant with half food service frozen stuff and half solid homemade stuff. You need to enlist your waiter or a local to sift through what's worth ordering. Decent salad bar and soup. Probably could get away without ordering an entree. If you've been to a greek owned family restaurant in the Chicago area, then you can kinda picture what its like here. Overall,  I'd come back, but it's nothing incredible."}
{"text":"I can't believe some of the other Yelp reviews I've read about this place. Seriously, if you can't handle a glass bottle of ketchup, then stay at McDonald's. Hopefully squeeze packets and/or paper cups are more your speed.  I had beef tips...tasty! Just didn't care for the noodles. My friend had the AYCE walleye special. She is usually very picky about her fish and she LOVED it. My dad had the meatloaf and said it was good. Salad bar had everything I would have liked. Our waitress was very friendly and my friend got her fish refills very quickly. I would definitely come back!"}
{"text":"Stopped for a quick breakfast and found that here. Great pancakes and fast, pleasant service."}
{"text":"The chicken and dumpling soup is fabulous! I had a pizza burger and fries, too. So yummy! The portions were big and reasonably priced. Fast, great service. I will definitely be going back soon!"}
{"text":"Just pulled in to Urbana on Business and I am hungry after my 5-hour Drive.  I checked my YELP app and found this gem.  Was seated quickly and met by my great server \"Ginny\"!  I ordered the chopped steak, mashed potatoes/gravy and corn. OMG!  The plate had enough food for \"two\"!   No hotel breakfast for me in the morning....I will be back here bright and early!  Thank you again for being everything I hoped for in a real family restaurant!"}
{"text":"This is a wonderful mom and pop style diner. Its quite the hidden gem in the area too since its a bit away from the U of I campus.  They have a huge menu with tons of options. Our group got a bunch of things off the menu and shared. No complaints about any of the food. Oh, and the portions are gigantic especially for the reasonable price!"}
{"text":"Good diner food. Casual atmosphere and very fast service. I had the Belgian waffle and eggs-standard. Husband got the house skillet \" and it was good, I would order it again.\""}
{"text":"I had not been here in almost 15 years, so when the family and I were out looking for someplace different to eat, we decided to give Urbana Garden a try.  Since the last time I was here, the outside has been renovated quite a bit, but the inside is almost exactly the same.  It appeared to be reasonably clean, but it is very dated looking.  They have a HUGE menu, which was a drawing card even 15 years ago when I was last here.  We were there on a Friday night, when they have a AYCE Walleye special (fish, side, soup or 1-trip salad), which is what I ended up getting.  There was a small salad bar at the front, but it didn't look too appetizing, so I chose soup.  The choices were broccoli cheese or clam chowder.  I chose clam chowder, as did one other,  and the other two in our party chose broccoli cheese.  One of the broccoli cheese soups had a single piece of broccoli in it that -- I am not joking now -- took up more than half the size of the cup.   The clam chowder was nearly inedible.  It was basically a really bland cream of potato soup that was gritty sludge, and had no clams in it that I could taste at all.  Orders: - AYCE Walleye special + fries - Monte Cristo sandwich + fries - 2x Bacon cheeseburger + fries  The Monte Cristo was not fried crisp at all, which meant the bread was soggy, but the meat in the sandwich tasted good.  That's a shame, because the whole point of the Monte Cristo is the toast.  The burgers were average at best, and that's about what was expected.  The fries were just barely warm all around.  The fish was good, but was VERY greasy and I was only able to eat a couple extra pieces on top of the original portion.  I think they would probably be good for big groups, since they have large dining areas that can accomodate multiple tables put together.  I just couldn't get past the glaring issues with the soups and food quality issues.   Sorry, but we won't be coming back.   At that price point, there are too many other better options out there."}
{"text":"The waitresses are very friendly. Food is not highly over priced. When i went i had the all you can eat ribs. The ribs were kind of dry and i had to dip it in bbq sauce since they didnt already have it on the ribs. Other than that not going to complain. Kind of what i expected anyway since it was $12.99 for all you can eat."}
{"text":"Definitely better than Denny's or IHOP, and a great breakfast after a night of drinking at U of I.  Steak and eggs looked good and was a large portion. I got a sausage and egg sandwich, which was better than expected. French toast was meh.   Service wasn't too shabby, she conveniently gave us all separate checks and we were well stocked on water and coffee.  I'd probably go back, we all had a hearty breakfast for under $10 and it was better than the drive thru."}
{"text":"I met a friend here last Friday night. We got here a little late fo d dinner, the crowd was thinned out. The salad bar was freshly stocked and looked great. She had lasagna, I had the country fried Steak. Neither of us could eat it all. Great service,  tasty food, good prices. We will be back to try the rest of the menu. LOVED IT."}
{"text":"This is a great place for senior citizens as it has its own separate page dedicated to senior citizen specials. I would highly recommend the breakfast options here. Their homestyle cinnamon french toast combo was awesome. It includes four slices of round cinnamon bread, two eggs, and two bacon strips or sausage links for $6.99. The service also proved very convivial."}
{"text":"This is one of my Dad's favorite places to eat. I don't know why. I've tried many different selections and nothing has been very good. Our last visit the I had the soup and salad bar and I'm really not sure what meat was in the beef vegetable soup-- it was square and grayish and mostly cabbage for the vegetables, even my dad said that was awful and he never complains. I know I'll be back because of my dad but I try my best to go anywhere else."}
{"text":"Wow. Not good.    Salad bar was a mix of browning iceberg lettuce and slightly fermenting beets,  three bean salad etc. I ordered the Broasted Chicken,  blah! not seasoned and thickly coated in a batter. Mashed potatoes were unseasoned Luke warm powdered blah floating in a puddle yellow canned sauce.  not a good meal, disappointed after reading good reviews."}
{"text":"This is a great place to come with a large group when you're hungover and all the good expensive places are full. That's exactly what my friends and I did last weekend. The menu has a huge selection - something for everyone (unless you're eating vegan of course). There were about 8 of us and they had plenty of tables but for some reason, we had to wait 15 minutes for a table. When one of us asked if we could sit at the empty ones, they said sure if we didn't mind being split up, which we agreed to. When we were about to be seated, they asked if we wanted the tables pushed together (all of us were wondering why they didn't just do that earlier) but we said no, it's fine to keep them separate. All the food had that fake butter country crock flavor and the toast had huge slabs of margarine on them. Also, one of our waitress was considerably faster than the other which made our experience a little more strange since we were already split up at two tables.  All in all, this place was one of those places that's so bad it's kinda good and when you're hungover, I'd choose this place over Merry Ann's any day."}
{"text":"Ate here a few times because it was close to my hotel and easy to find. You cant miss the giant EAT sign out front. Listen, all you need to know about this place is that it is a homestyle Denny's or IHOP. If you dont expect too much, youll be pleasantly surprised. The cinnamon swirl french toast was delicious, as were all the breakfast items I had. The service was stellar and very friendly. This is what it feels like to eat at a family diner in the Midwest."}
{"text":"Good attentive service, very friendly, and the food that I had (French toast) was really good."}
{"text":"Glass bottled ketchup is so difficult to use. And the check takes 15mins to be handled. It is at 2:50pm, not busy hour."}
{"text":"While traveling, I was in the mood for some comfort food after a rough night out with my business associates the night before.  After perusing Yelp for a while, I settled on this restaurant as my destination for dinner. True to its name it is a simple family restaurant. I sat in a booth and must admit that you could use a little sprucing up as the tabletop was blemished and the cushions on the seats were a little tattered. However and they had a nice salad bar and the chicken dinner that I had was good in the mashed potatoes were good as well.  The waitress was not exactly friendly, but I didn't break the bank on dinner either. I'm not sure it was what I was looking for but it fit the bill for a low key dinner while traveling."}
{"text":"My friend and I had dinner there on Tuesday night and both of us vomited for the whole night. We went to the clinic the second day. Btw, we got a ribeye, a shrimp pasta and some salad. We will never ever ever go back here!!"}
{"text":"Restaurant review: I had high hopes for this diner in Champaign-Urbana, but I left feeling disappointed. If you like a cheap meal or breakfast item this is likely the place to go. Also if you are eligible for a senior citizen discount, this is a great place to grab a meal. For everyone else, there is so much left to be desired. I don't care about the drab interior that reminds you of a restaurant from the 80s. If the food is good I am there. The prices are cheap for dinner and they have multiple specials everyday of the week. Today was 11.99 all you can eat bbq ribs or pasta. I took at pass an tried the grilled salmon for 12.99. A couple issues came up. First there is no warm bread with butter, you get a trough of saltine crackers so this is clearly wrong in the menu. Second you can chose soup or salad, I went with the soup based on the other reviews. The beef vegetable had a lot of veggies, but no pieces of beef another thumbs down. Finally the meal itself came without any other fixins instead a slice of tomato and lettuce. I have no idea how that goes with salmon. A couple of steamed veggies would have paired nicely. Salmon was okay, nothing special that you couldn't whip up at home. Finally that amazing pie that people wrote about, if you look carefully at the shelf, those are store bought pies. All and all this is a place for 10 dollar ish meal, but I think I might have been better off eating at a fast food restaurant.   Pro: cheap breakfast/lunch/dinner, daily specials, seniors discount  Cons: store brought pies, no fresh bread with butter which is in the menu, borderline poor-below average meals  Hidden gem: Daily specials. Check the website, although it does not appear to be updated and constantly shows a Monday special"}
