{"text":"Great little place with some of the best cold brew I've had in awhile. Will definitely be back."}
{"text":"URBO is super adorable, super convenient coffee shop/conscience store (soon to be bar) right on 6th Ave and Fillmore.  You can buy everything from your morning joe to a bar of soap to a single condom here.  It's quite incredible.  Cute dog-friendly patio outside and amazing waffles! Soon they'll have more breakfast and lunch foods as well :-). Great place - and Xavie (the bartista) was SO welcoming and wonderful."}
{"text":"FIVE STARS if you live here!  Argh...this is one of those reviews that is both a 5 STAR review and a 3 STAR and it pains me to 3 star it. However, I believe that most of whom will read my review will not live here or in the surrounding area and as such the 3 Star review will more aptly apply.  Like I say above, if you live here, in the apartments above, or immediately surrounding this is an awesome little place that has a few sundries as well as a great cup of coffee/late, and a pastry/snack. They also said they were going to be adding some beer taps for happy hour on your way into your apartment. In fact I would probably be stopping by everyday on my way in and out if I lived here.   Now, if you don't live here, there are much better places/coffee shops for you to take your time to seek out and stop at.  Access is not easy, at least when I was there it did not readily have access from the street but you instead need to walk through the apartment entrance.  This creates a small annoying issue of being asked by the sales office what they can do for you every time you're just trying to get a cup of coffee. Actually, a lot of the features that make it great for someone that lives in this building are reasons it makes it not so great for those of us seeking a place out.   If you life here, GO HERE (without a doubt), If you don't, then seek out another good spot."}
{"text":"Delicious coffee drinks!!! The menu is typical, but you can tell from the spirit in the atmosphere that they give so much care and attention to each drink then your standard chain store. Great spot to pick up some quick necessities and snack as well. URBO fits in perfectly with the downtown atmosphere and urban vibes of the local Phoenix neighborhood. Craftful, artisan, soulful and true to the spirit coffee drinks establish this place as a worthy local spot, however the wonderful friendly staff whom all seem to take ownership make this place a regular stop for me now. I can tell  each time a drink is sold, a part of their soul goes with it."}
{"text":"I recommend the nitro cold brew!! And I can eat the turkey sausage & egg bagels all day long! They're unique and delicious"}
{"text":"URBO is brand new, conveniently located right off Fillmore and 7th Ave easy to get too from any location.  URBO is located on the ground floor of a brand new gorgeous Apartment complex.  URBO opened 4 days prior, and it still preparing menu and drink menus, very excited to see in the next few weeks.  URBO also has a section of items needed such as snacks and drinks, for customers.  Very convenient for Apartment renters as well as patrons from local areas.   Food;  Waffle with Nutella and Strawberry, was delicious - waffle crisp with nutella drizzled on top with Strawberry bites.  Ordered a Iced Latte, and Barista recommended adding Jasmine, the hint of Jasmine was just perfect to add a little sweetness.  Service;  The Barista was outgoing and friendly, very patience with me looking at everything."}
