{"text":"Best chicken in town hands down go try for yourself and the Philly cheesesteak tastes authentic and great"}
{"text":"5 Stars isn't enough for US Chicken off Sugar Creek. I order from them quite of bit about 1 or 2 times ever other week I can't say NOT 1 thing bad about them. Chicken is fried to perfection and taste great. Burgers are huge. Cheese cake they give you a nice big slice.  My wife likes their beef patties. I ask them to prepared something for me without the salt (High Blood Pressure)they do it and it still taste great. I give them 10 star for service and great food. But try it for yourself as y ou will not be disappointed."}
{"text":"2nd time I ordered food over the phone and it wasn't fixed when I arrived. Owner is has no value in his customers or customer service. I have seen him arguing with customers numerous times, and wrong most of the time.. Very bad business."}
{"text":"This place is amazing and it has very good prices. I love the burgers, okra, and desserts! They deliver so that's how we found out about it. They always bring the order in 30 minutes or less. Soon, I will have to try the chicken!"}
{"text":"If your looking for Italian cheeseburger similar to the ones up north this is the place. The owner Mi'sael is really cool and he made the food which was great. The burger was fresh (he slapped the burgers in front of us) and the fried were crispy. I will definitely be back."}
{"text":"Had to make last minute dinner plans for the family. As always these guys have my back. Courteous service. Hot fresh, REAL fried chicken in minutes. Everything is made on the spot. Some sandwiches I've had to wait for but I haven't been dissapointed yet. Whatever you do you have to get the fish. Don't let your friends and family know. Just hide, eat and enjoy! If there's a party or gathering...there's no question what I'm going to bring."}
{"text":"By far The Best Fried Chicken! It's always Crispy and fresh! I have never had chicken this good! When you get it to go, there's always a good amount of hot sauce in the package, which is great to dip the chicken in. Do yourself a favor and try US Fried Chicken, you won't regret it!"}
{"text":"Great fried food in town.  fresh and right sides.  Thank Ahmad for bring chicken to the shop."}
{"text":"Order delivery at 3pm on a Friday and it can in 25 mins. Chicken Cheesesteak was bomb!! The fried chicken is always great."}
{"text":"This hole in the wall restaurant in Derita shopping center has changed hands several times in the past three years. First it was the India/Pakistan Kabob House, then Anthony's American Cheesesteak, and now it is US Fried Chicken.  The restaurant is small but has enough tables so that it's not too cramped. You order and the front counter then get called when your order is up.  I suppose I should have tried its namesake entree, but I'm more of a burger guy. The burger was cooked to order in just a few minutes. I opted for the double cheeseburger which came Big Mac style - using three buns.   This was a good sized burger, but the patties weren't too think. The meat was nice and moist and it felt like the patties were hand made and not machine pressed and frozen. The fries were not soggy or overcooked but not really special either. The double, fries, and soda cost around 6 bucks.   Overall I'd have to say the food was better than I expected."}
{"text":"Amazing fried chicken. This place is on point from service to cleanliness and most importantly for the food. If you don't try the fried chicken you are missing out, seriously, and it's hard because the menu is loaded with options for everyone and I mean everyone. Will definately be my hidden spot when I'm in the Charlotte area!"}
{"text":"Wings are amazing!!!!!!! I had the Lemon Pepper, ordered them for delivery and were still crispy when I got them! The double cheeseburger is unreal! Bigger than my head and that's pretty big lol everything was sooo good."}
{"text":"Ordered lemon pepper wings here. Very tasty.  Had a variety of flavors to choose from. Loved the fact that they ask if i wanted fried with or without the skin.  They also asked if i wanted them crispy or less crispy.  Very friendly. I'll be back"}
{"text":"AMAZING WINGS!!  I had a party a few days back and ordered 200 pieces obviously got a great price on it which is why i ordered from them, at the party there wasn't a single person who didn't ask where i got those amazing wings from at that time i was secretive about it but just realized i want people to experience the amazing customer service and food i experienced! + They had my order ready exactly on time not a minute earlier or later so it was perfectly fresh&hot! Very satisfied, now i go there every weekend!"}
{"text":"Pretty tasty and made to order.  Hidden gem because of its location but it didn't disappoint.    Be sure to ask for condiments and napkins because they're pretty stingy with them.  Also, don't be fooled by the pastrami and sandwichs pics on the wall...theres no deli."}
{"text":"There seems to be really mixed reviews on this joint so I'm here to put in my 2¢.  Keep in mind, my review is based on delivery.  Short version: Service was friendly, food was hot and fresh and the order was delivered correctly with no missing items. Flavor was ok. Not the best I ever had but would really give this place 3.5 stars if I could.  Long version: Hubby and I called directly to the number in one of their pics here on Yelp. The phone number listed for this business will ask you to order online and thereby charging a delivery fee. They charge the fee regardless.  The gentleman who took the order was friendly and mention there was an hour wait time but that he would try for it to arrive sooner. It did, food arrived in 28 minutes!   We ordered a 5pc combo with fried okra and a gyro combo with fries and a sweet tea. Everything was hot and fresh. Except the sweet tea which tasted for like a syrupy mix instead of fresh brewed tea. The chicken was nicely fried; crispy on the outside and moist on the inside. My qualm with the chicken was that it wasn't all that seasoned and it tasted a lot of grease. The chicken itself wasn't greasy but it just tasted that way. This really almost caused me to give them 3 stars instead of 4 because, I believe, if you are a fried chicken joint, your fried chicken better be off the chain. However, I realize that this is a matter of preference.  The fried okra was perfect. The seasoned fries that came with the gyro were really good to. The gyro itself was alright. It was nicely wrapped and freshly prepared with fresh lettuce and tomato but the gyro meat itself just lacked flavor. I mean, I get it, why order a gyro from a fried chicken joint?!  Bottom line, it's ok. You are just going to have to try it to make up your own mind. It is definitely worth, at least, a try."}
{"text":"Great little neighborhood restaurant.  Ordered chicken dinner, cheeseburger combo and banana pudding.  Yummy, well prepared, quick service and very reasonable price. Got a new place to go when I'm craving a burger!"}
{"text":"Horrible food. No seasoning. The Mac and cheese tasted like paper. The chicken was disgusting."}
{"text":"Tried the fried chicken.  Bojangles is better.  And the subs why would you put lettuce and tomatoes on a steak sub that in nasty"}
{"text":"As far as Chicken goes... it's pretty good, especially if you are afraid to fry it like me. Lol The employees are pretty nice and attentive. They know the menu inside and out. The only thing that I didn't like is smelling like \"FRIED EVERYTHING\" when I left from picking up my order. I mean, it was in my hair my, clothing and a day later my car still smells like  \"FRIED EVERYTHING\".  I'd hate to see  what the actual employee smell like when they go home for the night! LOL   they definitely need a better ventilation system or fans pushing the greasy smell out the door. All-in-all a pretty good spot II just pick up a quick gyro or chicken Philly cheese steak sandwich or chicken wings or even just plain Fried Chicken. But I'll let you be the judge so go check it out for yourself even if you just get 3 wings fried..  it's delish! Just be a little patient on the timing factor... Patience is a virtue!!! LMBO"}
{"text":"Ordered at 8, first driver showed up and said the food wasn't ready (they never made it) so I had a second driver stop by and they said that \"someone else took my food\" (they never made it) so how it's 3 hours later and they said they won't make the food because the they are about to close. Do not order from here, they will not make your food. Now it's 10 and everywhere is closed. Complete waste of time, I will never order from here again."}
{"text":"This is right down the road from my work and there are few options in the area. This is one of the best. Their fried chicken is really good, but don't think they only have fried food. The grilled chicken sandwiches are tasty as are the phillies.   They have these really awesome sweet potato and cream pies, they are not what you think of when you think sweet potato pie, they are amazing and you should go try one.  They recently changed ownership and it seems a little cleaner."}
{"text":"Exceptional food with fast service Halal. Good for family But wish for a better location"}
{"text":"Cheap and good fried chicken. Food is cooked fast and they offer delivery. However if you call in an order they will always say 15 minutes. Show up 10 minutes late and your food will probably be ready. They can always flash fry it for you if it's cold by then."}
{"text":"In my opinion, this place has the best Chicken in the city hands down.  Ive always been a fan of KFC.  Have had Bojangles, Popeyes, Chicken Coop, Chicken Box, Chicken King, none of them compare to this chicken!  Its always nice and crispy with great flavor in every bite.  The seasoned wedges are great also.  I come here often to order chicken in bulk for events and family get togethers.  They have yet to disappoint."}
{"text":"The chicken was fresh and cooked fast, but overall the size  of chicken pieces were very small and the chicken breast looked as if someone had cut some of it off.  This was for every breast.  Also the batter was pretty salty for my taste.  The potato wedges were very bland, and the fried okra was from a package. This might be with this location I will try a different location later on.  But for now I will just stick with  The Chicken Coop."}
{"text":"Never thought twice of eating here but my son wanted to try it. I'm a sucker for customer service but these people or one person that answered the phone e was a jerk. Before I placed my order I asked this individual about how long will it take. He didn't tell me but kept asking my order. I placed my order then he just hung up. I called back 4 times to finally get somebody to answer the phone so I can ask him how much was the meal and how long it's going to take. He said 20 minutes but I called back an hour and 10 minutes later for him to say he put it as a dine in. I will NEVER order from here again. NEVER"}
{"text":"Honestly some of the best fried chicken I've ever had. And they don't give you itty bitty chicken, they are some solid size pieces. I think they're better seasoned than places like KFC. The staff is really nice, too. Always greet you with a smile. I love this place. It's close by to my house so whenever I get chicken I always come here."}
{"text":"Are you kidding me??  Ordered at 5:02pm.  Said delivery would be here at 6:03pm.  It is now after 7pm and still no food.  Never again.  2 sandwiches and an order of onion rings takes 2 hours?  Pathetic  customer service.  When I called, they told me, \"we were so busy.\"  Won't have to deliver to me again."}
{"text":"as an amendment to my earlier review: I neglected to say that regardless of two locations in Charlotte sharing the same name of US Fried Chicken .. my favorable review is for the Tuckaseegee Rd location only.   :)  try not to confuse the two .. different owners and the food taste different."}
{"text":"Not a fancy place by any stretch of the imagination, and it can be a bit of a challenge to get into if you are not paying attention, as they are right at the intersection, so you need to be looking or you'll miss it.  But once you are there, they are very friendly, even for folks like us who look like we've never been there and have no clue what we are doing (which we don't). Old skool menu board, which lists their offerings, most of which are fried chicken, but they also have sandwiches (mostly fried chicken), wings and a few other options.  It seems that what you get is prepared fresh, as it takes a few minutes to come out, and then you get plenty of it - also looks like it is reasonably decent quality, as you are not getting monstrously-sized portions of chicken either, that looks like it has fallen off the hormone truck. Perhaps not farm-to-table, and they probably don't have a pen out back, being that we're talking the middle of the city here, but it's not bad. Well worth a visit."}
{"text":"The chicken looked real good! It tasted good, but it was super salty. So for that I gave it one less star.  They do have a lot of options on their menu.  Will I visit again? We'll see."}
{"text":"I get the feeling that US Fried Chicken hasn't been open long at this location.  The wife and I stopped in today for some fried chicken take-out.  This will be a quick review and will go more in depth when we have tried a few other menu items.  The atmosphere: Clean, new, fresh not a lot of silly decorations.  The place was devoid of patrons except for me and 2 girls getting a chicken plate each.   The service:  Competent, counter man smiled and was eager to please.   The food:  Chicken was very good. Hot and crisp with a slightly spicy, crispy salty crust and hot moist meat inside.  Onion rings were beer battered and crisp.  Potatoes and gravy were OK but neither tasted homemade.  Same for the slaw, I have tasted this supermarket type brand before.  They were out of fried okra.  The menu was extensive with lots of options.  I look forward to trying some of them and reporting back."}
{"text":"OMG!! This joint(and i use that word like as in BBQ JOINT)has some of the best chicken ever. I grew up on a farm with a granny who was a true southerner,kentukey to be exact.this chicken is so close to hers that i just about flipped!!and they deliver too!? How great is THAT.. For some folks it may seem tame(they offer hot sauce) but for someone who grew up on a farm with country ways it sure hits the spot. Now if they could just add some cobbler to the menu I'd be in heaven."}
{"text":"If I could give this place - 5 stars I would . Food not good at all , pricey, not clean and kind if sketchy place . Please save yourself the trip and go to KFC"}
{"text":"My fiancé loooooooooves fried chicken. Like, a legit love. He got an attitude with me one time because I said I think fried chicken is \"just okay\". So, he was super excited when he saw this place had four stars on Yelp.   I went in and ordered for us while he waited in the car. I ordered a three piece with fries for him and the buffalo chicken wrap and a side of fries for me. I also threw in the mozzarella sticks because, well, YOLO. When I ordered the buffalo chicken wrap, there was some confusion over whether or not they had it. I pointed to the picture on the wall of the wrap and another guy came up and finished my order. He then walked away. I had to ask for a copy of my receipt.   When I got my receipt, I noticed there was a gyro listed instead of a wrap, plus he made it a combo instead of just the wrap. I went up to the register to inquire. He told me that they don't have the buffalo chicken wrap in the system so he put a gyro, but that it would be correct. I then asked about being charged for a combo and he admitted the mistake and offered to pay the difference, which I appreciated and accepted.   After about 10-15 minutes, a guy came out from the back and called out the gyro order. I didn't get up because I didn't order a gyro. The guy that took my order called me over and bagged up the food. As we drove home, I told my fiancé that I would be shocked if the order is right.   When we got home, I went to change out of my work clothes and when I came in the kitchen, my fiancé was laughing. I asked what was funny and he said, \"maybe this is what they consider a buffalo chicken wrap\".  I looked down to see grilled chicken on a pita with lettuce and tomato and melted American cheese. It looks NOTHING like the picture they advertise on Yelp or on the wall. What I got was grilled chicken on pita - not a buffalo chicken wrap. I scraped off most of the American cheese and tried it. Did it taste terrible? No. Did it taste great? No. But most importantly, it did not look like, taste like or have the ingredients of what was advertised.   My fiancé loved his fried chicken and the mozzarella sticks (I had one and didn't like them because they tasted like frozen, baked ones). The small roll that came with his meal was delicious and out of pity, he gave it to me. The other positive I will note is that the food was made fresh.   My tips: - only go here if you just want fried chicken - check your receipt for accuracy - ask questions before ordering because items aren't always as they are advertised"}
{"text":"This place is all bad from the neighborhood to the service to the food which is greasy and not that great the cleanliness of the eatery is not impressive either the restrooms are disgusting and the floor is covered in a layer of grease which makes walking a challenge. This is connected to one of those seedy motels that rent hourly/daily/weekly if you stop here to eat bring your gun and expect a substandard meal and service"}
{"text":"I ordered dinner tonight. I tipped in addition to the $5 delivery fee, almost $10 total gratuity and Del fee. That is normally acceptable that my order was missing items I ordered, so when I called the restaurant the person answering was very rude and proceeded to blame Eat24 for the error referencing the menu posted. This is not be case as the web site menu lists identical menu items. US Fried Chicken = Rip off."}
{"text":"The owner got my order wrong and refused to fix the problem. He is very rude. I order a chicken salad and that's all I got chicken and lettuce. I advised friends and coworker's not to eat here. Terrible customer service."}
{"text":"It's your typical urban fried chicken. Sort of reminds me of the type of spot you would find in DC, like chicken in a box \"Chicken Box\" type of spot. The have a great menu though, if your craving something fried this is the spot. From fried chicken and burgers to seafood and salad. Priced around $8 avergae for a meal."}
{"text":"Man... I know it isn't the best place in terms of looks... but the food definitely makes up for it. You need to taste it to understand."}
{"text":"I ordered the fish sandwich combo with wedges and coleslaw through Postmates and didn't receive the coleslaw. When I called the restaurant, they stated word by word \"I forgot, i don't know what you want me to do about it\". Talk about horrible customer service. Bottom line is, I won't be ordering anything from here again."}
{"text":"The man in my life wanted chicken. Fried Chicken to be exact. So of course, I used my handy dandy Yelp app to find the best and closest place for fried chicken. So off we went to US Fried Chicken based on their 4.5 stars.   Service here is very friendly. Their menu is good with many choices. However, this fried chicken was just alright. It was good but nothing to write home to momma about. Their French fries are honestly kind of awful. I did love their spinach. It was seasoned perfectly and had little chunks of meat through out. We had  side of mac salad which was not bad but you had to be a huge fan of vinegar and dill relish because it was the dominant flavor.   But let me tell you what deserves a 5 star about this place - their sweet potato pies. I asked if they had any because I saw it on the menu, but did not see any out and he went and grabbed two but told me they were frozen. No problem, I knew we could easily thaw them out. These sweet potatoes were AMAZING. I would definitely come back just for those bad boys."}
