{"text":"I'm glad they branched out here in Toronto area! They make the best Filipino pastries/desserts in North America! I like their pastillas de leche, espasol, bulilits, pandesal, etc."}
{"text":"The Biko and workers were enough for me to give five stars. I may be hyping up the Biko but it's so friggin delicious. Reminds me of how my Lola makes it and NO ONE beats the way my Lola makes it. 

I love how it doesn't get hard after awhile either. Sometimes when you put Biko in the fridge it gets hard and doesn't taste as fresh. Not this one! Stays soft and gooey once it gets back to room temp! The texture and sweetness is perfect. There are also a few little pieces of jackfruit throughout the dessert. 
I could probably eat the whole tray but I don't want my family getting mad at me. 

To be honest, I think 7.99 is pretty hefty, but literally it was flying off the shelves when I was there. Sooo people will buy it! And because it's so good, it's justified.

My mom also bought some ensaymada from the display case and damn, they were surprisingly on point too! I usually don't like store bought ensaymada but the plain ones here are perfect! My mom actually fell in love with them too! I like the \"plain\" ones because there's no cheese on it. I know that might be weird but I prefer my ensaymada without the cheese. They sugar the bottom of the ensaymada instead of the top.

Servers were sweet, respectful and fast. They referred to my mom as tita (aunt) and I heard them call other patrons the respectful way in Filipino.

We came pretty early on Boxing Day and their shelves were pretty bare. Not sure if it's because it was early or things fly off the shelves. *shrug I'm just glad we got Biko and ensaymada."}
{"text":"This Filipino bakery just opened up recently beside Congee Queen in Heartland and after visiting 2 weeks ago, I already know that I'll be back when I'm in the area!

I've tried the bibingka (fluffy cake on banana leaf), ube ensymada (purple yam sponge cake) and chicken empanada here so far. I'm a fan of their bibingka - delicious, not overwhelmingly sweet and it's best enjoyed warm. Bibingka was one of my favourite treats growing up and this one was definitely one of the best versions I've tasted. The ube ensymada had ube filling with a bit of shredded cheese on top and some ube flavoured crumble as well. I also enjoyed this one but it's more of a once in a while kind of treat since it's on the sweeter side compared to the bibingka. The chicken empanada was also tasty, a good portion and it was more flavourful than I expected. 

There were many other offerings in this bakery  such as fresh turon (deep fried banana spring rolls), pandesal (sweet buns), biko (glutinous rice dessert), coconut flavoured desserts, and many different types of sweets and breads. It was busy when I came here on a Saturday afternoon but it was nice to see food still being made throughout that time I was there.

To top it off, they had friendly staff who were helpful and efficient. Most items were also reasonably priced. I'm already looking forward to my next visit and wish this bakery continued success!"}
{"text":"Heard that Valerios Bakery was opening  and decided to check it out.  . It is a Filipino bakery located by the recently opened Seafood City and sells  baked items and various other foods  . I got  some pandesal bread to take home as I have heard its quite good.   The pandesal  was soft l tasted nice and sweet . On my next trip here I will try other items to broaden my foodie experiences.  

The Service is quick and the store is very clean and neat. All customers are made welcome. with warm greetings.  I would recommend getting the hot breads since they will go well with home made soup on a  cold winter day ."}
{"text":"Probably some of the best tasting Filipino bakery goods I've had. My family and I are super happy this place finally opened up!
 
The fresh pandesal is amazing and is a steal for the price - you get 16 pcs (which are quite large) for about 3-4 dollars. The bibingka is also very tasty. All of the other items are very delicious too. 

My only complaint is some of the younger workers. For the most part, they are nice and accommodating but some of the younger workers working behind the counter don't seem like they know what they're doing nor do they know what some of the bakery items are made of. I asked one of them a question on one of the items and she simply said \"I don't know\". She didn't even take the time to find out for me.. she could've asked one of the managers there. It didn't really bother me but I don't think this would fly with customers of other races who enter the bakery for the first time.. especially those customers with food allergies or ingredient concerns."}
