{"text":"We ordered beers and a pizza to share.  My husband also had minestrone soup to start.  The service was friendly and attentive without being overbearing.  The food was good and the atmosphere was nice.  The beer was a bit pricey but otherwise a great experience. We'll definitely visit again."}
{"text":"I am 100% disappointed

I ordered margarita pizza, the most basic of pizza's. I was sent cheese. When I called he tried to convince me that the basil leaves were blended into the sauce because basil burns. Please tell me in what universe basil leaves burn on margarita pizza. To say the least I was disappointed and unfulfilled in my pizza wanting heart. 

What a waste of money."}
{"text":"A group of four of us when out to Vannis about 3-4 years ago and had a really terrible experience. Being the \"second-chance\" kind of person that I am, my wife and I thought we would give it one more go. 

What a mistake.

While the service was adequate, there is no possible way to give this restaurant more than one-star. From the near-rotten limes served in our water, to the oddly spiced, vinegar-ed and over-cooked Eggs Benedict with a side of near burnt to a crisp bacon, Vannis is somewhere that I would advise not even my worst enemy to eat at."}
{"text":"This place isn't terrible, but the very standard and pedestrian food doesn't match the decor or atmosphere.  We dropped in for dinner on a whim when walking by, and it was reasonably busy.  The food was fine, just not good enough to talk about or go back.  If I want food that is just \"fine\" I can get it for less all over the same area.

Update to this:  the weekend breakfast is pretty good, and cheap!"}
{"text":"Came here for Winterlicious with some girlfriends and had a good time! The place is quite small but super cute with nice decor and a great ambience. I really liked the service- our server was super nice, attentive and gave us really good advice on what to order.

The food was alright- the portions were quite large but didn't taste that great. I had the minestrone and tiramisu which were pretty good. For my main, I had the risotto de marre and it was okay. I found it quite bland and not very flavourful. 

Overall, not a bad place to visit but if you're looking for good pasta/risotto, I wouldn't recommend it."}
{"text":"A surprise on St. Clair..!  A steak to die for....very tasty....the  TV ambiance did not distract from the  prix fixe selection....including warm rolls, salad and dessert...
and....considering it was \"Salsa-On-St. Clair\" night...the waitress was busier than an Air Traffic Controller at Oshkosh.....
The three of us enjoyed the meal , and got change back from $$ ...!"}
{"text":"Vannis is nestled on a small strip at St Clair West and competes with some of the best bistro style Italian food in the city such as the longtime staple of the St Clair area Ferro and it's trendier new family owned extension The Rushton. 
So what differentiates Vannis from the rest?
Well, in simple terms, it comes with a great story. The difference lies in its philosophy and approach as a restaurant and the modest roots from which it began complimented with a really top notch chef/owner who really know the business well. 
Now most people would probably laugh at the idea of giving anything but an afterthought to the philosophy and roots of an establishment  whose primary function is to fill your belly, but for those who don't like to be caught up in the wavelength of trendy and overpriced venues which seem to care more about the sleekness of their appearance than the quality and value of the food it serves, Vannis stands as a great Torontonian example of perseverance and success in a very tough industry.
Over a decade ago Vannis's head chef began chopping onions and washing dishes just down the street from what would later become his very own restaurant. Where did he work? Ironically he worked at what is now his biggest competitor; Ferro.
Even more ironic, is that he is as far away from Italian as you could imagine but now cooks food which easily rivals and usurps Ferro as the best overall Italian food on St Clair. 
After working at Ferro for 12 years, he decided to launch his own venture and with the knowledge he obtained there he decided to step up his game and give the area an even more authentic experience. 
His home made ravioli's are phenomenal and always cooked to perfection and his pizzas are always perfectly round and perfectly cooked. As a former pizza chef myself, I know this is not the easiest task in the world.
As a person, he is an incredibly modest and warm hearted guy who is always happy to entertain his guests when approached. 
I would recommend the butternut squash stuffed ravioli's in cream sauce, it's some of the best pasta I've ever tasted. Compliment that with one of his fantastic pizza's and you have the perfect meal for you an a special someone. Vannis has a far more humble decor than its immediate competitors and caters more towards small gatherings and dates and in no way fronts the same chic image that surrounding restaurants work so hard on.
The only downside of eating here can be the service, some of the servers I've had there have been sub-par, but if you are fortunate to get a good waiter, you're in for a treat. 
Perhaps most important to note as well, is that unlike Ferro's $30 pasta, you can get a great meal here for under 20 dollar tip included and the food is simply better than the other Italian places within a 10 km radius. 
Vannis= Great Italian food- snobby yuppies. Sounds like a plan to me."}
{"text":"Empty pizza with barely any toppings including cheese and sauce and 0verpriced!"}
{"text":"Ordered pizza and rice balls from Uber Eats. The pizza was burnt and dry and the rice balls tasted funky. Would not recommend!"}
{"text":"Went there last week with a friend. We got there around 5 pm so we were the only customers. The waitress kindly told us what the special was and recommended us which pizza were popular. The speed of the pizza and the burger was a little bit long but acceptable. The service was great. Definitely going back, maybe try some pasta :)"}
{"text":"An excellent experience here at Vannis. I felt like I had to write a review after seeing the lower than expected rating on this restaurant -pricing was affordable for what I got: seafood linguine - pasta was perfect Al Dante, flavourful and seafood super fresh. My boyfriend also got the 3 course meal for $25, which I thought was a steal- we had tiramisu for dessert! Service was amazing - the server was so nice even though they were short staffed and despite coming in late and she checked up on us throughout the way."}
{"text":"Eeek. We tried this restaurant because they had a nice patio. The atmosphere was nice on the surface but in tatters in closer inspection. All of the chairs are peeling apart. The accents and decor were all damaged and low quality. It looked like there were a lot of dollar store items. The server was friendly but obviously inexperienced. She checked on us way too often. It got annoying. \"Yes, we are still fine. You asked 2 minutes ago.\" 
We were brought a basket of home made flat bread that tasted about the same as a box of premium plus crackers, and I don't mean the crackers, I mean the actual box. It came with a tomato eggplant spread that was very bland. It was not good. We ordered 2 pizzas and a pasta. The food took forever. Close to 45 min. I don't mind waiting for good food in a packed restaurant but we were the ONLY table in the place. The server came by our table every 90 seconds to apologize to the delay. Both pizzas looked amazing. Unfortunately the taste did not match the visual. The crust was made out of the same bread as the cardboard box they served us before. The toppings were fresh but under cooked. One thing that was really odd was that the toppings were different than what was listed on the menu. One pizza came with mushrooms that were not listed, the other was missing the bacon but they went ahead and substituted with sausage without asking. It was like the cook did not know the menu. The pasta was in  a cream sauce that was actually really tasty. The tortellini it was served on was about the same quality as one of those 10lb bags from the $10 freezer at no frills. The server asked how we wanted our bills and we said separate (there were 3 of us). The server came back a few minutes later with one bill and said someone had already printed it. She did offer to find a manager to get it reprinted. She should have just done it. We already made our request. And how hard is it to find a manager. It is a tiny restaurant and we are the only table. Sorry, not sorry. Won't be back."}
{"text":"After scanning through all the Winterlicious menus, we decided Vannis was where we wanted to go first. We just beat the Saturday lunch rush, because shortly after our order was taken several people showed up.

We both started with the Caesar salad, which was ok. Too much dressing for my liking, and pretty bland. Could use more garlic. Good portion size, though.

For the mains, I got a pizza with pepperoni, artichoke and goat cheese. It tasted absolutely amazing - better than Pizza e Pazzi, Frank's Pizza House and maybe even Marcello's! It was bigger than I thought it would be and cooked perfectly. Thin crust that was soft and a bit crispy on the outside. My partner got a chicken parmigiana sandwich. It was delicious and came with a large side of fries.

For dessert, I got the tiramisu. It was cakey, chocolatey and oh-so good. My partner got creme caramel, which had a gel-like outside and was creamy on the inside.

The wait staff were pleasant, attentive and friendly enough to make small talk. The food came quickly. We will definitely be back!"}
{"text":"Love the food here.  is a lot cheaper than it's neighbor.  people are relatively nice.  simple layout and good Napoleon food.  the Americano pizza is incredibly goood!!"}
{"text":"This place was once fantastic and we would order from there once a week.  We enjoyed almost all their menu items and always looked forward to ordering again.  

Over the last several months, it has taken a turn for the worse.  The quality for food has declined, consistency has disappeared and the staff who once knew us by name are no longer there, replaced by staff inexperienced with customer service.  

When we called to complain about this last delivery, my wife was spoken to rudely, and then I got on the phone.  This unfamiliar voice of the staff member tried to basically explain that I didn't know what I was looking at.  I have been ordering from there for 5 years...I think I know by now what I should be getting but on this trip...not even close.  Even the hot sauce has changed and my wife commented \"It tastes like ketchup and had no spice\"   Instead of trying to correct it, they preferred to educate us on Italian food.  

In short, this was their last shot...I wouldn't order from here again."}
{"text":"This place has amazing food. I go here often for take out. The only thing is that every time I order something its slightly different than what the menu says. Like a pizza will be missing several toppings or the sauce will be the wrong kind. I'm not picky and I'm always already home by the time I realize. But....it just seems a little careless? I only mention this as it has happened 3 times now. I'll continue to go back though."}
{"text":"Been here twice now and both times it was great. The first time got a pizza and penne pasta to share. Pizza and a pint is $17 which is amazing since its wood oven cooked and the crust is a perfect chewiness. The toppings are good and lots of selection in choices. There's a small but adequate patio to people watch. You get bread and a salsa type spread while you wait which is delicious. The second time we had calamari grilled and pizza to share as well as a goat cheese salad which was delicious. You really can't go wrong with anything you choose. Servers are polite and the food great. Price point is good too and less expensive than the place directly next door with same quality."}
{"text":"Cute little spot, great coffee, particularly welcoming in an area with few commercial establishments."}
{"text":"Poor food for the cost.

I am familiar with good Italian food. This is not it.
I had the daily special pasta with scallops for $20. 
The pluses-- 
The pasta contained a nice number of large and small scallops and the fettuccine was cooked al dente.
The minuses--The tomato sauce was from a can.  What?  Really?
The larger scallops were overcooked.

The people, ie. cooks and servers, were nice, but the food...just no.

Though it is just down the street, I won't be back."}
{"text":"I just ordered from here using Just Eat. It was excellent! We had the breaded wings and the pollo parmigiana with penne. The potions were very generous and the quality was above par. The wings are well seasoned, meaty and cooked to crispy perfection. The large portion of chicken was moist and the sugo is simple as it should be. I do wish that I could have had the option of sauce on the wings seeing as it is offered on the menu."}
{"text":"Quite frankly the worst pasta dish ever, the brunello was supposed to have sausage with vegetables and olive oil, it did but had so much noodle the dish was flavourless. 

I'm not one to write bad reviews but need to in order to deter patrons from wasting money. Sam the manager is a corrupt man, sounds like a used car salesman, he told me Julio is the chef and Italian, not a chance in hell is Julio Italian. 

Don't waste your money here. I'm done!"}
{"text":"Great Italian here. Reasonable prices. Service is good, owner comes to make sure you are enjoying your food which is a really nice touch. Tables are a little tight, not much romance if your on a date, however the food more than makes up for it. Open kitchen, so you see who's cooking your food which is nice for all my fellow germaphobs. Kitchen and bar area are clean. Would recommend over the other Italian Restaurants in the St Clair West Area. No attitude from staff or owners when you walk in, like the other two Italian  restaurants nearby. Would highly recommend. Try the mushroom app. Most delicious thing ever."}
{"text":"I took my family to Vannis for the first time tonight to celebrate my wife's birthday.  It was during Winterlicious so we knew ahead of time that it would be quite busy.  Overall I was pretty happy with our experience.  

For the appetizers we ordered the arugula and caesar and minestrone.  The salad portions were just massive, and were very well dressed.  The soup wasn't too bad, nothing really brag about.

For mains we ordered the rissoto de mare, fruite de mare, pizza bufala and pizza diavola.  Both seafood dishes were very good, but I thought the rissoto was a bit better than the linguine because it was more el dante.  I was a little disappointed with the diavola pizza as I found it a bit soggy.  The bufala however was very good.

For dessert had the cream caramel and tiramisu.  I originally ordered the mini cream puffs, but once I saw that it was merely the frozen cream puffs you would by from Costco, I immediately changed my order to the cream caramel.  The desserts were pretty good, nothing to complain, and nothing to really brag about.

The only complain I had was the service.  Our server wasn't very pleasant.  For such a small restaurant I expected her to remember, or at the very least write down who ordered what, instead of telling us she forgot when the food was brought to our tables.  During the middle of our meal I was taking a bite out of my pizza, and she asked us \"if we were still working on everything\" which was pretty obvious, so I thought that comment wasn't really necessary.  It was clear that she was on auto pilot mode.   

The one gentlemen that sat us down appeared to be the manager, and he was very nice. 

At the end of the night, 4 adults had each consumed a 3 course meal, and the bill was a very generous $113, after taxes, before gratuities.  I would definitely recommend this restaurant to anyone that likes good Italian food, at a very reasonable price."}
{"text":"After a more than 6-month hiatus, Vannis is open once more.  I dropped in for the breakfast last week, and I had to update my Wychwood breakfast list.

1) There's a perfect range of optionson the menu - a real brunch spread, without overwhelming you with too many choices.

2) I love having the option of ordering salad instead of homefries or yam fries.  The salad is a light mix of greens in vinaigrette, not too pushy for morning consumption.  If I'm already having sausage, eggs, french toast, I don't need homefries too.

3) The sausage is a real, fat, flame-grilled sausage.  Wow.

4) Two big breakfasts in a lovely ambiance with refilled coffee = about $20.  I'd drop about the same at Boom!, but here I leave relaxed and satisfied.

5) The hollandaise on the eggs benny is divine - not too thick, not too runny, and tangy with citrus.

We were concerned at first, when we were the only two people in at 11:10 am on a Saturday, but by the time we left at 12 the joint was jumping.    

I do wish they'd be a bit freer with the jam packets at the table - one of each kind isn't enough when you're both using syrup or want the marmalade.  They're happy to supply more, but should I have to ask?  They're quick with the free coffee refills, though."}
{"text":"I tend to come to Vannis quite often for good Italian food at a great price. Food is prepared well with fresh ingredients and portions are very generous. One of rare Italian restaurants that knows how to do proper al dente pasta."}
{"text":"Food quality: low
Food taste: low
Service: medium
Ambiance: medium

The food the 3 of us had was at best mediocre. Truthfully, the place seems like a pizza joint and the customers eating pizza seemed really pleased. None of us ordered pizza and were let down. The waitress we had was really sweet and helpful, but she was way overworked (not her fault at all, just too many customers and no support for her)."}
{"text":"Ordered via Ubereats .. got calzone and bruschetta .. everything smelled great, the spicy call one was spicy and salty"}
{"text":"There are few times when a meal can be as hopelessly awful as the one I had at Vannis. I went with my wife and parents and 1 year old. 

Service was friendly,  but the food... my parents and wife had various pizzas, all bland and with rubbery crusts. I ordered the veal marsala, a favourite of mine,  which came with a side of fettuccine Alfredo. If there was a drop off marsala wine in that sauce I'd be amazed. The veal itself was a sad, grey, piece of meat, cooked like it was beef jerky, except with no flavour.
I actually stopped eating the meat, which is the rarest thing for me to do, and decided to console myself with the Alfredo. Bland, starchy sauce,  and,  a piece of SHARP PLASTIC in it!! For real!  In my many years of eating at restaurants around the globe,  I never found anything more than an errant hair! 

The waiter,  or manager, came by,  suitably concerned, and said he wouldn't charge me for my meal.  But he charged the rest of us. He gave me a pizza as we left, nice, but the wrong move, since I didn't want his lousy pizza.

I think the only one who had a good meal was my boy, but that's because we packed his dinner for him.

Just a lousy 'Italian' restaurant trying to siphon business from Pizza & Pazzi next door."}
{"text":"Seafood pasta tasted like the ocean, gnocchi had chicken in it and wasn't supposed to oh and the sauce had NO FLAVOUR which I guess is better than tasting like the ocean. Pizza smelled like dog food. Ugh will never be wasting my money or stomach on this place again. gross!"}
{"text":"Nice place and nice ambiente with a small patio to the street. 
I was there last Saturday. Good received. Food was great. I had grilled salmon with veggies. Highly recommended! And later the dessert got the amazing caramel cake shown in the pic. 
The only thing I did not like, she brought me used dirty cutlery!! The food was still on it !! I don't know how did she did not see it at first."}
{"text":"I have only ordered take out from here and it wasn't too bad.  They have quite an extensive delivery menu which was nice.  I ordered a capraese salad and spaghetti with meat balls.  It came to about $30 with tax and delivery fees.  A little over priced for what you get, but it's convenience!

The Capraese salad I was a bit disappointed with.  There were 4 slices of tomato, 4 pieces of cheese, a bit of arugula and a small thing of olive oil to put on yourself.  The problem was that they stuck it in a hug take out box and by the time it got to me the salad was just splattered all over the place.  

The spaghetti and meatballs weren't bad.  It was a huge portion (I had lunch for the next day).  It was very basic.  Not a ton of flavour, but did the job.  It came with 4 large meatballs, which were very tasty.  I wish there was more sauce on them though - they were just placed on top, and even when you mixed it around there wasn't too much extra sauce to cover the meatballs.

For the price you pay, it's not really worth it."}
{"text":"Great all day brunch! Still can't get over the $6.50 price tag which includes any omelet or sandwich, choice of side, and a drink....certainly makes this place a 4 star despite the 3-3.5 star food. 

The food portions are done so as to be slightly gourmet, but they don't quite hit the mark. The omelets have all the right ingredients eg (California - asparagus, avocado, sundries tomatoes, caramelized onions, and goat cheese) but are served a bit on the small size and lacks the softness of a well whipped omelet. As well the salad of mixed greens tends to be a little on the sauggy side but has a nice house dressing drizzled atop. Instead I'd go for the sweet potato fries or their delicious chip style garlic home fries. 

Service is sometimes slow bc there is usually only 1 server, but it's nice to come for a casual cheap brunch in a modern, clean, venue."}
{"text":"Went for brunch today with my wife. My eggs were horribly overcooked, toast was slightly burnt, bacon was beyond crispy. 

My wife ordered the pea meal eggs benedict - the eggs tasted of too much vinegar in the poaching water and the hollandaise was so thin it was barely there, plus the English muffins were stale. 

To top it off, the so-called home fries with the brunch meals are really just soggy french fries dusted with a nasty garlic seasoning. 

Do yourself a huge favour and go elsewhere. I would rate zero stars if I was able to."}
{"text":"I ordered take out from this place so I can't speak to the quality of service or restaurant. I ordered 20 wings and a large pizza.

Let's start with the good:
The delivery was quicker than expected by a good 20 mins. The wings were actually pretty good, a little soggy but I think that's to be expected with takeout wings. Sauce came on the side and I asked for a mix of sauces and everything was hunky dory. Everything smelt really good and I was ready to dig in. 

This brings us to the bad stuff: 
The pizza was straight up bad. The dough was mushy and the pizza just wasn't good. On their site they boast their oven and authenticity but you can see those grate marks on the bottom of the pizza. I really wanted to like the pizza because the wings were decent. When ordering online, 20 wings is the smallest amount of wings you can buy which is too much for me. Everything was luke warm and I think that it might have been better if it was hotter. It almost seemed like they pizza was made a few hours earlier. 

We ended up throwing out about half the food which isn't a common practice in my house. They got my order right and it was delivered quickly but for the price point and lack of quality I won't be ordering here again. Honestly, Pizza Pizza is better and cheaper and I don't like Pizza Pizza."}
{"text":"Randomly passing by and decided to have brunch here. Everyone was super friendly and took our orders right away. I had the smoked salmon platter and my husband had the scrambled eggs. They give you a lot of food for the price, so I would say it's great value especially because the food is super fresh. We had the chance to meet with the owner as well which was very special. Their menu covers a lot of different types of foods so I'm sure there's something for everyone to enjoy!"}
{"text":"My wife, kids and I were looking for a place to eat and enjoy the weather. This was our first visit to Vannis. The waitresses were very nice and greeted us, sat us at the patio. My son ordered a pepperoni pizza and he was invited to make it himself (which made his day). We opened with a very tasty beef carpaccio. My wife had tortellini and it was good. I had spaghetti carbonara, it was very even better.

Food was great, the service was amazing (which I find rare these days). 
I strongly recommend this place. They have a Summerlicious menu, 
I'm glad we ran into this restaurant, we're looking forward to coming back"}
{"text":"Ah, too bad, so sad. Discovered that they have now closed shop.  (I can't make a N/A star rating so hence the 1-star)"}
{"text":"Don't order the pasta. The sauces are watery and don't stick to the overcooked, generic brand noodles. I'm eating it as we speak and two bites later it's going in the trash. Massive disappointment. This place use to be a lot better but after yet another awful order never ordering again."}
{"text":"Nova Era Bakery
O Cantinho Bakery
Vannis Ristorante
E
M
B
E
R

Vannis Ristorante is our Third stop for our November crawl.

Brunch Time is good time at Vannis Ristorante!! 

Brunch Specials for $6.50 that includes a choice of Omelette or Sandwich with Fries or Salad with Coffee or Tea or Pop! Talking about choices and decisions to make!

- Smoked Salmon Sandwich on Brown Toast/Salad on the Side/English Breakfast Tea

- California Omelette with White Toast/Salad/Green Tea

Both nicely done and I definitely NOT complaining with this price! OK I did complain about the salad not being too fresh.. maybe should have the fries instead!

Services was excellent! I really don't expect much at this price point but our waitress was so friendly and attentive and patient.

I definitely recommend coming to Vannis Ristorante for their All Day Brunch if you are in the area!

NEXT!!!"}
{"text":"Very cute little spot and a small size to have that homey feeling. Little on the pricey side but very worth it if you want to have a nice dinner. Overall I loved it and would definitely come back!"}
{"text":"My girlfriend and I have brunched our way up and down St. Clair and Vannis has quickly become our favorite.

They have a great range of brunch items, and their breakfast potatoes are amazing. They have great service too and are quick on getting meals out.

My girlfriend can't stand runny eggs and at most other places she ends up having to send them back and watch us all eat while they remake them, but Vannis always gets them perfect. 

They even let em special order a Benny with avacodo, tomato and goat cheese one morning and it was phenomenal.

Definitely reccomended."}
{"text":"We've ordered from Vannis a few times through an online delivery service. Every time, we did so only when there was a big discount promotion being offered through said delivery service, as the prices at Vannis are pretty high and I wouldn't pay full price. 

The pizza is pretty decent! BUT I really kept ordering because I looooooved the chicken wings! They were perfectly crispy and came with a sauce on the side that was some of the best I've veer had. Unfortunately, we ordered again recently and realized they have completely changed the wings. Gone is the delicious, unique, thick sauce, replaced with some generic nothing-special hot sauce. 

Don't think we'll be ordering from here again."}
{"text":"The only reasons this place is getting a star is a) you can't  not pick one, b) the coffee was decent.
Decided to visit today as our first choice next door wasnt open  yet. A decision we soon came to regret. I went for the classic chicken parm on a bun (something i felt would be best from an Italian place). Our food arrived  quickly, but that was the end of the positive experience. Chicken was poorly seasoned and dry, the sauce had zero flavor and the bun seemed stale but heated in an attempt to cover it up. The house cut fries were not seasoned and over all...the grapes put on the plate as garnish could have been considered the most flavorful. My friend took the recommendation of the server for eggs benny and I could not believe the look of disappointment in her face. 

Side note...they also have very strange knives as part of their flatware. 

Save your disappointment and money and go elsewhere."}
