{"text":"Love this place. Sure it was way out of town for me. Sure I can't figure out a way to get there with public transit from Toronto... BUT it's worth the trip, however you get there.  To be honest, before we went there I thought it was just going to be danishes, which was actually exciting in and of itself, BUT it had a variety of other Danish baked goods (like marzipan cookies, and kransekake ) as well as vegan chocolate bars, chocolate soft serve, cookies, brownies and biscotti. And little grocery type items like fake tuna and non-dairy cheese.  The woman that runs the bakery is so sweet and friendly, I felt like I could talk to her all day about food and not get tired of it. Another great part about this place is that it's inside of a costume shop. Can't go wrong with that."}
{"text":"Tried there Oreo cheese cake. It was good. My non-vegan friend seemed to enjoy it a lot more then I did and I am vegan lol!  Service is great!  I'll be back to try more."}
{"text":"I've reviewed this business elsewhere, but am happy to take the time to do it here, too!    Wow!  I. Am. So. Glad. This. Place. Exists!    I went there yesterday, and was pleasantly surprised by the expansion.  It is now a much more welcoming space...and beautiful, too!  When I returned to my husband waiting in the car (parking is in the back; driveway next to the salon), I mentioned how they'd expanded and renovated, and how it is now like a little French café, with a large display case for the baked goods, classic cabinetry, and several, little bistro tables and chairs to have a quick bite in-house.  (Bakery customers are asked to no longer enter from the rear, through the costume shop, but rather from the front door on Yonge St.  To make your way from the parking lot, opt for the driveway, rather than the little path on the south side of the building, as it is a bit tight and muddy.)  I bought several bakery items, plus a grocery item I'd forgotten to buy at the grocery store. (A small section of the display case offers grocery items, such as vegan sour \"cream\", cheez, whipped coconut cream, etc.)  There are also snacks, books, and pet food available on the far shelves.    Yesterday, I tried the pumpkin bar, and it was delicious, albeit a bit on the sweet side for me.  ...But so fluffy and lovely!    Many times, I buy the chocolates and peanut butter cups.  But, everything is pretty good.  (I had a chocolate cheezcake here, once, and it was divine!)  There are freshly-baked Danish desserts and breads.  In the summer, there's soft-serve (vegan, of course), chocolate ice \"cream\" available, as well.    I'm hopeful the expansion means business is good, and this business will continue to do well.  Unfortunately, I live too far away to be a regular customer.  But I go there as often as I possibly can.  You should too! ;)"}
{"text":"An Amazing spot in Thornhill! Took my gf here for lunch and we both had an excellent experience. Very classy decor and jolly customer service. I really love how everything is vegan! Plus the staff here are very knowledgeable and helpful. Definitely come by here often."}
{"text":"Over-priced.  Bland. Stale. Pretty terrible.  I tried a number of things and they were all a let down.  Mint chocolate cookies---Although they we super cute, they were SO DRY....they tasted as though they had been on the shelf for a few days too long.  Shortbread cookie---It wasn't bad, just also a little too dry.  Peanut butter raspberry cookie---Dry and super boring. Couldn't tast the raspberry at all.  Black Forest Cake---the icing was nice and thick, and the whipped cream was really really good and had a great consistency. The cake itself was SO DRY.  Baklava---tasty but really needed a little salt. Also, I'm pretty sure it was just store bought phyllo pastry which is not something I look for in a place like this.  Lastly,  Danish---This was just bad. The pastry was just a stale dough and not a pastry at all. The inside was again, you guessed it, DRY. I bought the last one which was blueberry and it looked like a spoonful of frozen blueberries had just been plopped right in the middle of the dry dough.  I really didn't want to be this let down by this place. I've been looking forward to going to it for quite some time now.  THIS type of thing is what gives vegan baking a bad name.  With everything being stale and dry I can only imagine how long it had all been on the self for. Also, I'm curious where the actual baking is being done?"}
{"text":"Great cupcakes and i loved the calm and sweet atmosphere! It's a very cute little shop and can be sort of easy to miss because its on the side of the road but it was worth the little search!   I loved everything about it and I'm so glad to be vegan!   I highly recommend!"}
{"text":"My parents bought me cupcakes and a blueberry cheesecake from here for my birthday. And my oh my were the delicious or what? Absolutely loved them! I gave a cupcake to a friend my mine and she couldn't even tell it was vegan and gluten free! The ladies who bake these delicious treats know what they're doing and this place has now become my favourite bakery in the city! My drive from downtown is well worth it! You will not be disappointed!"}
{"text":"Everything is super tasty, including the soft serve, which is to die for! They also sell some unique vegan chocolates, treats and grocery items."}
{"text":"Found this Cute little cafe/bakery on yelp and went in search of some vegan desserts!  This was my first time tasting vegan dessert and they were so good! Ordered a pumpkin spice pecan muffin and a blueberry danish which I had eyed up on yelp from previous reviews!  Service was a little slow considering it is such a teeny cafe, they were nice and friendly but we weren't acknowledged for the first few minutes.. also as I predicted, vegan desert is expensive.. which in my opinion shouldn't be. It's the hype to find vegan is rising the prices up which is unfair..  All that said, I was expecting them to taste similar but not to the extent I couldn't tell the difference... the deserts were delicious, with my favourite being the blueberry danish.. it had almonds on it and it was so so good!  They also had one or two cheeses and vegan mayonnaise which I may try the next time as I've had trouble finding it in stores.. just the prices put me off.. Will be coming back for some more yumminess!  They also heated up our blueberry danish for us which was nice of them (can you tell I recommend this danish?!)"}
{"text":"I ordered the blueberry \"cheese\"cake.....AH-MAY-ZING! My non-vegan friends were happily surprised and said it tasted pretty much just like a real cheesecake. The blueberry sauce was da boom - perfect consistency, and fresh blueberries, not frozen.  I asked for it to be made with less sugar, they were very accommodating and it tasted just right. Yea, it's a bit pricey ($33 for a 6 in 'cheesecake, but less for the other cakes), but I felt like it was worth it for my dietary choices.  I chatted with the friendly lady who worked there and she informed me that the bakery is owned by a family of long time vegans who also owns the costume rental shop that is attached (there are lots of intense costumes too! (storm trooper, disney's snow white, sully from monsters inc, to name a few... great for Halloween!).  I look forward to my next trip and purchase!"}
{"text":"I love the danishes here. They are the best vegan danishes I've ever had! It may be expensive here, but it's worth it.  Their soft serve is really good too. It tastes close to real dairy. I also ordered a chocolate cake from here for my friend's birthday, since she is vegan. The cake was really rich, but it was good and moist. I wish this place was in Toronto, then I could come more often. Overall, I give this place an A+."}
{"text":"I love the vibe and the people that work at the Vegan Danish Bakery! It's run by 3 sisters who make delicious cakes and pasteries in Thornhill.  Though not a vegan myself, I do enjoy coming here because everyone who works there is so warm and welcoming and the cakes are to die for!  I've bought several cakes here throughout the years and was never left disappointed.   It is a little pricey, but that's to be expected from a speciality shop.  I hope to come back soon and enjoy a piece of cake in their new seating area, now that they've moved next door from the costume store."}
{"text":"There are a few things targets that need to be hit in order to receive a 5-star rating (to me). You need good service, a nicely decorated and clean environment, and of course, good product. It hit all of these points for me.   I'm trying to get around to trying all of the vegan options in the GTA and so far this may be my favourite, including restaurants. It was very small and cute, the staff was very friendly, and the sweets were satisfying. I grew up a child of a baker so I've had many (non-vegan) sweets in my day, and have visited many bakeries; with this in mind I found the cheesecake and cupcakes (the two things I tried) very good, and the prices were standard for a local bakery. The cupcakes were $2.99 (if you bought more than one, which I did). I also had the cappuccino which was good. I will definitely be back to try more. This will probably become a regular place that I visit."}
{"text":"Lovely staff, cute miniature coffee shop, with a nice selection of all vegan treats. Prices are a tiny bit high, as one expects due to the extra effort, special ingredients, and smaller demand for vegan products, but the quality is also very high, and all of the goods I have sampled have been really excellent. Being an omnivore, I have been pleasantly surprised with everything I have tried, most of which has rivaled or occasionally even surpassed their non-vegan equivalents, which is certainly not always the case with vegan food products. One note for the uninitiated, when you purchase, staff will inform you that a number of the vegan products require refrigeration, like those with buttercream frosting example, so they don't travel long distances well on hot days, plan your shopping and travel appropriately. I particularly enjoyed the black forest cake, the cupcakes, and the cheesecake was also surprisingly good. The imitation Reese's Peanut Butter Cup  was decadent and awesome , only the butter tarts and pecan tarts gave the impression that compromises were made to keep things vegan. Bottom line, this is a great spot to get treats for the vegan or vegetarian in your life, I highly recommend them."}
{"text":"Definitely a great spot for vegan deserts by far. I tried the vegan pumpkin pie for thanksgiving and it was alright except I tasted way too much refined sugar. I prefer the one from the Whole Foods Market. Otherwise, their sundaes are great. My favourite was the strawberry shortcake sundae. Im a health conscious person so I'd only come here on rare occasions."}
{"text":"Bought a cake from here once and it was awful. Every bite tasted like a spoonful of sugar. There was too much icing, and the texture of the cake was dry and crumbly. Wouldn't come back."}
{"text":"I always drive by this place so I decided to check them out today. I ordered two cupcakes to go, chocolate and mocha. Both frostings are creamy and sweet. Tastes so delicious.  Store itself is cozy. Few chairs available if you would like to dine in. Friendly service. Parking is in the back.  Overall this is a cozy bakery that sells vegan cakes and cupcakes. Sweet and delicious. Worth checking out."}
{"text":"Finally made it to the VDB for the first time, even though I've been meaning to go since it opened 2 years ago. It's just that I never have a reason to go to Thornhill. And I guess I can't justify driving that far strictly to indulge in vegan treats. But the right opportunity finally came along this year.  I was surprised to find VDB inside a costume shop. It has its own entrance, but basically is an off-shoot of the shop. I think it's amazing that a vegan, Danish-themed bakery even exists. I can't think of any other ethnically-themed vegan bakeries I've come across in all my veg-aholic travels, so this one wins a unique award. I just wish it was in a most accessible location.  We picked up three danishes; one apple, two blueberry, some cookies; maple and peanut, a strawberry yogurt snack made from cultured pea protein and some Danish-style almond cookies called kransekake, that came recommended by Michelle G.   The pea yogurt, was very interesting and I would recommend giving it a try if you're into dairy-free yogurts. It's not like any other I've had and was more dessert-y. The maple and peanut cookies were not the soft kind I enjoy but rather like the hard, dry variety you find on grocery store shelves, so I wasn't a huge fan. My partner gobbled them up joyfully, though. The kransekake was softer and chewy, as you would expect an almond-based cookie to be. Definitely, worth trying as part of an authentic Danish vegan experience. As for the pastry danishes, I've never been a huge fan of these (I'm more the croissant or pain au chocolat-type) but I did enjoy the one I had, toasted with  coffee the next morning. I honestly could not tell the difference between it and the non-vegan versions.   I think the element missing from my visit was chocolate. Chocolate improves everything. I went in the evening on a weeknight and they didn't have a big selection of goods that day I was told, so I'll definitely have to return. After seeing Jennifer K's photo of a black forest cake slice and knowing that they do custom cakes, honestly, I'm very, very tempted to order one for myself. I've actually been trying to think of occasions for it as an excuse. They also have vegan soft serve, that I didn't get to try. That will have to wait for the next trip north."}
{"text":"Vegan Danish Bakery, Im a fan!   As I live in the area, this is my go-to bakery whenever its my parents' birthdays. Not just because its close to me, but also because they have one of the best tasting cakes in the GTA. You would not even think youre eating vegan. We love their Black Forest Cake the most! Its so moist, delicious & has a perfect level of sweetness.   During summer time, you definitely have to come here for their vegan soft serves! Those are to die for, simply scrumptious!   Their cupcakes are also oh so moist! I super love this vegan bakery in Thornhill. They have also upgraded their shop and they now have a few beautifully set up tables and chairs. What a perfect spot to get your sweet and coffee fix.  The staff here are also very nice & knowledgable about  their products.  Highly recommend!"}
{"text":"For an uptown Vegan Bakery, it merits some bling bling stars just for being a Vegan dedicated Bakery.   The more you reach Thornhill, Richmond Hill or Markham, the less Vegan friendly the area becomes.   Anti-vegans if you will.  Those bling bling also translates into the prices the Bakery charges. That's probably a reason why I'm not Vegan, I can't afford to.   Bad excuse, I know I know.  I'm closer to EATING Vegan, if you know what I mean.  Apple Danish($3.99) - Like a mini-pizza with limited Apple, some almonds, and frosting. - Sorry I'm ignorant but could veg margarine help the bready dough?  Black Forest Cake($6.99) - I was happy to eat this. - Denser then regular cakes slightly but easily overlooked. - I was happy.  Vegan Yelp Rating    -  3.5'd Normal Yelp Rating  -  3.0"}
{"text":"Pros: Absolutely decadent and amazing vegan cupcakes and cakes! So moist and yummy :) Had some chocolate cake, a vanilla lemon cupcake, and a chocolate coconut cupcake and all were delightful. My only wish is that they had mini cupcakes too! I'll definitely be ordering cakes from here in the future :D  Cons: Partner had the cheesecake but unfortunately it didn't taste like cheesecake (though the crust part of it was delightful). Whereas the regular cakes could easily fool any non-vegan, the cheesecake wouldn't fool anyone. At $6 for a small slice, this was disappointing. Also, the icing on the lemon cupcake could use more lemon flavour - possibly via the addition of lemon zest in the icing.   Result: Will definitely go back, but the price prohibits regular visits - it'll be a special occasion kind of place"}
{"text":"Fantastic! I don't even like cupcakes but it is so good! How do they make it so moist and tasty while keeping it vegan? We bought a dozen assorted cupcakes, a muffin and some mini cookies and ALL of it was great! The place might seat like 20 or so and it is a cozy atmosphere. People who work there are super nice to boot."}
{"text":"First time trying this Vegan Danish Bakery.  the variety of dessert. Had the mocha cake.It was amazing"}
{"text":"If u want to really enjoy amazing strawberry soft cream top, vanilla cupcake that will blow ur mind and taste better than any non vegan cupcake out there.... If u want to show off or convert a non vegan or just impress them. Then take them Vegan Danish Bakery. Everything from their packaging their cute shop, the welcoming attentive vibe to their prices, flavours And freshness. Go to the Vegan Danish Bakery.Their products will have u like this emoji ="}
{"text":"This bakery blew me by surprise! They have an enormous variety of options for a snack or dessert but what shocked me more was the fact that they had a lunch and brunch menu as well! I had a cherry cheesecake while my friend had a matcha green tea latte and a carrot cake. My friend and I both agreed that they tasted great! The place is decorated nicely with classical music playing in the background. It gives off a formal vibe and I loved it!  Would I come back? Most definitely!"}
{"text":"The soft-serve ice cream is in and it's delicious.  It's almost a cross between regular soft-service and frozen yogurt.  they have waffle cones as well.  Just hoping they add sprinkles or chocolate dip...  Also available - Daiya brand \"cheese\".  Melts better than any other non-dairy cheese on the market."}
{"text":"I came back just like I said I would & loved what we got. I ordered a cake for my wife's Birthday dinner. The bakery also added \"Oreo\" cookies to the cake last minute when she noticed she could eat them.  The cake was a big hit. Even non vegans loved the cake. I got myself a \"butte tart\" due to allergies & the tart was scrumptious. I would get it again in a heart beat. We spoke to the woman who was helping us & she explained how the bakery was part of the costume shop. It run by a Mom & three sisters who became vegans with sweet tooth's. She told us how they added on the bakery to the business. I think that's adorable."}
{"text":"As a vegan my friends thought it would be awesome to get a cake from here for my birthday. And they hit the nail on the head on that one. One of the best tasting cakes I've ever eaten."}
{"text":"Ordered a gluten, dairy and nut free chocolate cake because my family has food sensitivities and allergies. It was amazing. The chocolate sponge cake was moist and rich. The coconut whip cream was light and yummy. The chocolate icing was as good as real buttercream! They did a great job. I think we are most fortunate to have this gem of a bakery creating treats for those with different food preferences, allergies and sensitivities. While I am not a strict vegan, the fact that their products are vegan is a plus. They deserve a big thumbs up for the quality and care they put into their work."}
{"text":"Nice place.   Delicious food. Very competitive prices as compared to non vegan items. Wish it was bigger or had a patio.   Either way very nice place"}
{"text":"I have been to this bakery a handful of times, long before I was on Yelp. The storefront faces Yonge Street. However, the parking lot is shared between the bakery and the costume store next door. If you do park in the lot at the back of both stores, you can cut through the costume store and get to the bakery that way. You get to peruse the various costumes that are displayed as you work put an appetite.  I like vegan bakeries, mainly because I don't have to guess whether I can handle the amount of dairy in the desserts or if I'll be okay, as I am borderline lactose-intolerant. The first time I was there, I got a butter tart and a chocolate cupcake. They were both sweet. I expected that with the butter tart, which was yummy. However, there was too much sugar in the chocolate cake for my liking.  Since then, I have taken my good friend, who is vegan, to this bakery whenever we hang out. We went during the summer when soft-serve ice cream was available. The ice cream is made with coconut milk. We both had the chocolate. It is so good. It is a must!  There is typically one person manning the bakery. Everyone I have dealt with is helpful and friendly.  (58)"}
{"text":"Picked up a chocolate mocha cake for my daughter's birthday and it was absolutely delicious.  Went back a few days later with her and she chose a piece of strawberry vegan cheese cake.  She had that eaten in the car way before we got home and said it was heavenly!  It was a bit pricey but worth it."}
{"text":"When my \"meat loving will eat anything\" yelp friend wants to take to try out some Vegan delight at Vegan Danish Bakery, I was more than surprise. I wondering if he started seeing the light....  Vegan Danish?!   I will skip the Apple Almond Danish ($3.99)... as without the generous use of butter... the danish itself was so doughy, chewy..I might as well eat a loaf of bread. Bring on the BUTTER and be FAT and HAPPY!  Black Forest Chocolate Cake ($6.99) was surprisingly good. It is almost like eating the REAL thing.. The Vegan cream frosting was creamy and heavy went well with the dense chocolaty brownie tasting cake.  My Yelp friend was happy... you know is not easy to make him happy...  I just happy that I can share a piece of cake with someone as I realize this Vegan Black Forest Cake is not calories or fat free.........."}
{"text":"As a non-vegan individual trying out some vegan treats for the first time, I was pleasantly surprised!  Location: Not a lot of parking, mostly near the back of the building unless you would like to park across the street at the nearby Tim Hortons. Great location (store-front facing Yonge Street)  Food: Ordered the cupcakes (chocolate and vanilla). The cupcakes were very filling! I understand why they were a little dry (lack of milk and egg products) but were still very good! Prices a little bit on the high side but does make sense due to the vegan food (vegan food is usually a lot higher).  I originally went because I heard that they were selling vegan dog food (why not), but unfortunately the nice lady at the counter told me that they stopped it 'a while' ago... not sure why. Overall a very cute bakery/cafe right on Yonge Street, with a wide variety of snacks, desserts and goodies for a nice quick bite!  4 out of 5 burps."}
{"text":"Came here to check it out and I was a little disappointed because on their lunch menu they serve empanadas and they didn't have it that day.  They were still making and would be ready by the time they close.  Their lunch menu isn't that extensive so you would think that would be available.    I just had the vegan pesto scone and vegan pizza swirl which were pretty tasty.  I would only go back if I'm in the area."}
