{"text":"Awesome food!  Finally found a healthy place to eat lunch!  We're always on the run and it's nice to eat something yummy AND heathy!  Well done!  We need more places like this out there!"}
{"text":"The quality of the food is incredible.  I'm not Vegan, but have to say, this was extremely delicious.  The thing they could improve on is the dark signage and bland decor inside.   When you drive by, it looks closed when it's not."}
{"text":"I have been here a half dozen times.  Never had a bad experience.  Friendly staff. Great tasting food for vegan fare."}
{"text":"I dropped by around 1 PM on a Friday and the restaurant was half full. They had about 4 tables, a couch, and window seating. Menus for dining in were already on the table. I ordered their smoked gouda mac and cheese with bacon bits as a topping. Vegan cheese is something I always had trouble with and I'm always on the hunt for the best vegan cheese.   A large bowl of warm brown rice pasta coated in a yellow sauce arrived in front of my after about 8 mins. The bacon bits reminded me of the artificial bacon bits you'd get in caesar salads. On first bite, I was disappointed since it didn't taste like real cheese. The bacon bits weren't as smoky as I'd like them to be and I noticed they were a bit too sweet for my liking. They did add a nice meaty texture to the dish. After the 3rd bite however, the meal started to warm up on me. I started liking it - not because it finally tasted like mac and cheese but I started to like it for what it was: vegan mac and cheese.  My server told me that they use a blend of daiya cheeses. As a person that never really enjoyed daiya cheese, I think it's fair to say that the lack of real cheese flavor is not their fault. Maybe someday a vegan scientist can finally create vegan cheese that tastes exactly like dairy cheese. I think this restaurant did a great job though - they have something unique and although it's not a perfect replacement for non-vegan food, it sure does come close. I even think they did a great job of making Daiya cheese taste way better since it's not really the best when it comes to cheese. My craving for mac and cheese was satisfied and I took half of the serving home. I also ordered a chocolate cupcake with French Toast icing. The cupcake was moist and not too dense. Not bad for a vegan, gluten free cupcake.   It was a bit pricey. My total bill came to $25 before tip. But I'm not surprised considering how pricey certain vegan and gluten free ingredients can get. Plus, being able to create comforting vegan dishes like mac and cheese and burgers takes a lot of creativity so they deserve the support. The dishes weren't small, although they might look that way but when you eat slowly, all that fibre gets to you and you're full. Save the rest for take out.  Overall I enjoyed my time at VegeBitez. It is a fantastic addition to Halton Region's vegan cuisine and I'm sure I'll come back for times when I'm craving something meaty."}
{"text":"Great vegan food. Quality ingredients. Very friendly staff. Cool vibe. Great overall experience. Potato waffles were pretty fabulous. Same with the nachos."}
{"text":"excellent customer service and comfortable atmosphere with pleasant seating. The portion of the mac and cheez was small I thought. I ordered the toasted marshmallow milkshake and it tasted very similar to the salted caramel milkshake my friend ordered.  i highly recommend vegan people have lunch or dinner at vegebitez!"}
{"text":"I sincerely wish I could score this place higher. The owner was wonderful and genuinely cared about if we enjoyed our experience or not... But other than the caring owner, there was a lot left to be desired.  At 7pm they were sold out of tempeh and waffle hash; these two are huge components in most dishes. We waited quite a while after being seated before we were served and made aware of the sell through so we had to choose outside of what we wanted; I ordered the Roma burger and my partner ordered the goudabello.  As we were waiting, I saw the staff and owner overwhelmed and creating a less than peaceful ambience; an order was sitting at the pass for nearly 12 minutes before it was served to a patron at table three. This should have been a red flag.  When we received our order, we we're appreciative of the service again as they accommodated with a plethora of hot sauces and wanted to make sure we enjoyed our meal. The Roma burger was messy, as we were told it would be. However, it was so oily that my lettuce was drenched and dripping oil. The burger fell a apart due to lack of a binder and would have been better served if it was just in a wrap. One bite and the entire burger was on the plate. It lacked flavour in the party... The only flavours I was getting was from the sundried tomatoes and onions on top. Messy, lack of flavour and over all... Just not enjoyable to eat. My side of a corn fritter (again, great because they substituted since they were out of the waffle hash) was doughy, under seasoned and very one note. The Goudabello burger seemed very small and over priced for the size. There was not enough in the burger and again the flavours weren't bad but would not entice me to come back for me. The spudz (potato salad) lacked salt and seasonings; it was rather bland.  I really wanted to enjoy this place. I told everyone I was going. I was so excited and I counted down the days... At the end of the night, I felt like we wasted forty dollars on a meal neither of us wanted to eat after the first bite. Over priced, under seasoned. The only redeeming factor was the staff and that is th only reason I gave them two stars."}
{"text":"Grabbed takeout for lunch and it was fantastic.  Not only were the staff super friendly but you could see they genuinely cared about their product.  We all thoroughly enjoyed the food and will be back....very soon.... Like tomorrow"}
{"text":"Finally Finally a vegan restaurant in Oakville! Delicious food! Beautiful atmosphere! Friendly staff! Definitely check it out!!!"}
{"text":"I feel slightly iffy about a full 4 stars as there were aspects that were great and others that were good. The staff for one are a 5 star, some of the friendliest people I think I've ever met! But the time it takes to get your food is pretty long, so if you came in hungry you may get a bit hangry before you get your meal.  The place is quite large, the lighting inside is perfect, I hate when places use super bright lights. However the sign for it on the outside is way too dim! They should find a way to make the Vegebitez sign nice and bright so passerbys can spot it!  Let's get into the food! I got the Roma burger with the waffle hash. The burger was fantastic, seriously top-notch. The patty was delicious, toppings worked well with it and the GF bun was super crispy, just the way a bun should be! I was sadly under-whelmed by the waffle hash, I had read such good things about it. I thought it was going to be crispy but it was soft, any softer and it would be soggy. The dip it came with was really good.  My boyfriend got the Pineapple Express burger. It is made with black beans, roasted pineapples, really yummy combo. For his side he got the spuds which is potato salad, lots of pickles in it so if you're not into that steer clear! I liked his potato salad better than my side.  Randomly I would like to mention that I like the room temperature water. For dessert we got the cookies with 'whipped cream' in the middle. OH YES this made my night! It was so delicious, the cookies were crunchy and the middle was amazing. I have recently gone off dairy and I haven't had many dessert options and this just hit the spot. I would love to come back and try some different items off their menu, and get another cookie sandwich!"}
{"text":"Really delicious food !!! Not a vegetarian or vegan and I loved the meal. It's also great because Dairy queen is next door :) I loved the sweet corn waffle that comes with the bowls. One thing that I do find is that I think of vegebitez as more of a cafe - but then there is a server who will seat you and serve you. It feels a bit out of place to have service here. But would totally come back many times !!!!"}
{"text":"I don't want to even give them a star. I walked in all excited to order some dinner being a vegan and gluten free it's hard to find options for myself. I walked in the guy at the counter  has his backed turned to me because he's on his phone and says unless you're going to order a smoothie we're closed.... excuse me?! You close In 30 mins. Yelp said you closed at 9(it's 730).. I will never go back here. So disappointed. Good luck trying to keep your business."}
{"text":"A hidden gem in oakville 5/5 would come again.  Amongst all the vegan resturants around the gta this place is by far one of my favorites. In both food quality and service, its amazing.  I ordered a buffalo burger (can't remember the exact name) and it was absolutely divine, it didn't taste gritty or sandy like you would imagine vegan alternative foods to taste like, it was very dense and meaty in texture, and the buns were the best part. Apprentice they get their bread supplied by a local bakery somewhere and it is sooo fluffy and yummy, better than a lot of regular bread. The hashbrowns were also incredible, they press them in a waffle mater and cooked to a perfect crispy golden brown. I also got the chai latte, and it was very rich, creamy, with a nice layer of foam on top.   The service was also incredible, everyone there was so friendly and cheerful, making the experience an overall joy!"}
{"text":"My boyfriend and I decided to try this restaurant based off of a recommendation my friend made. The location is easy to find. The restaurant itself looks very nice, the atmosphere is inviting.  I ordered the Goudabello burger and it was beyond delicious. It was fresh and flavourful and the perfect portion. I ordered it with waffle hash and oh em gee..this dish was perfect.  My boyfriend ordered the Pandora bowl (it is the only cold bowl on the menu) and he thoroughly enjoyed it. It had a lot of different component and again it was very flavourful.  Finally we ended it off with whoppie cakes (I hope that is what it is called). They are chocolate chip cookies with a whipped filling. We were lucky enough to order them fresh out of the oven. We couldn't resist eating them in the car on the way home and they were phenomenal! The perfect amount of filling between soft, warm and chewy cookies, this dessert hit the spot!  We 100% recommend this place and cannot wait to visit again to try something new! You really can't go wrong with delicious fresh food and great service! 5 stars well deserved!"}
{"text":"Great concept - poorly executed. I've found that the food is either burnt, undercooked or in short supply. Even when they have everything that's listed on the menu and your meal is cooked properly, the presentation leaves much to be desired and the flavour palate is pretty amateur for the price."}
{"text":"My family of 10 from the US happened to be staying in Oakville for a wedding and found this spot nearby our house. We called ahead because we had a large party and they were more than happy to accommodate a table for us (and even stay open a little later than their posted hours). The menu was HUGE. Full of delicious vegan comfort food including Mac and cheese, salads, milkshakes, quinoa bowls, nachos, and burgers. Everything we got (with 10 of us, was most of the menu!) was amazing! The restaurant is located in a shopping center, so parking was a breeze, and the inside decor is cute! Very fast and friendly service! Would recommend for any vegans traveling through or who live around the area! Whatever kinks other reviewers have noted, they seem to have ironed out!   Note: A couple other reviews said they were out of things on the menu, and this was also the case with us, but they were clear and upfront about what was currently not available, so I had no problem with it."}
{"text":"Absolutely terrible experience, and very sad because I really wanted another veg/vegan option in the area.  Things were off to a rocky start from the get go. The first three items I'd asked for weren't available, 7PM on a Saturday night. No big deal. We ended up ordering a sandwich and a bowl.  The restaurant is fairly busy and smells good, great, we're excited. However 40 minutes after we'd placed our order a table walks out because they haven't received their food and its been awhile (how long I didn't hear). My wife is concerned. Oh well, we've been here for 40 minutes, we can wait it out.  An hour in we're getting ansy and I begin to watch the food being prepared. There is a girl cutting peppers into her hand, i.e. holding the vegetable in her palm with the knife facing her and cutting. This is beyond being a 'trained' cook/chef and goes to just basic knife skills.   Shortly after that our food arrives, they've run out of cutlery so we get dessert forks (sorta goes with the flow of the evening I guess). My wife overhears the other chef tell the woman who brings the food that they ran out of guac, tell the customer. Unfortunately that was sort of one of the key flavours/draws of my wifes dish. The waitress doesn't tell us. My sandwich was ok, it felt like it was missing something flavour-wise (I couldn't taste the fake bacony bits, they may have been missing). My side 'waffle' was a little burnt which detracted from it, but it was definitely the highlight. My wife's bowl was really a lot of quinoa and not a lot of flavour. B.Good in Oakville makes a dish almost identical to her bowl, in 5 minutes, and is muuuch better spiced (also they don't just run out of guac and not say anything ahead of time...)  The fruit smoothies were nice flavour combinations, but they were just frozen fruit. For $9 each I really would have hoped for better..  All and all, the two dishes and two smoothies were $55 + tip. Pretty steep for the food quality, regardless of the wait. We tipped and left, never to return again. I really REALLY wanted to like this place. The combinations are all things I really enjoy, but the executed product doesn't taste great. As mentioned earlier, B.Good in Oakville does similar quinoa bowls (and can make them veg/vegan) and they're much better spiced.   Sorry Vegebitez, definitely not a great night out. An apology for the wait, mentioning or apologizing for the missed ingredients, might have made me want to try again."}
{"text":"Let's just start off by saying WOW is this place a GEM! Vegebitez gives you that perfect mix of food and friendly everyone wants. They got a modern decor and service with some heart. From the second we got in there we were greeted by there owner and told how to order and such. After a few minutes of grazing the menu, we decided and trust me it wasn't easy!  I got the some kettle chips and the Smooth Criminal Burger, basically a tofu burger with peanut butter, jelly, \"bacun\" bits and caramelized onions what's not to love. My mom went with the option of the Piñata Bowl, a quinoa based bowl with a fresh Mexican Twist with corn, cashew queso and a whole whack of other fresh veggies and toppings. The food didn't take to long to arrive no more than 15 minutes and boy was it worth the wait! Not only was the portion perfect for one person, but man the flavours were spot on. If no one told me I wouldn't of even known that burger was tofu. The fresh hot gluten free bun and all those yummy toppings like fresh salted Carmel peanut butter and the crisp cheez made it a burger I won't forget! I would suggest eating the burger with a fork and knife with it being a little on the messier side LOL! After all that goodness I couldn't stop myself from getting there fresh brownie and it was GOOD!  Another thing I can't get over is how friendly and inviting the workers are they make you feel like your at home in your moms kitchen constantly making sure everything tastes good and is ok. All and all this place might be a little on the pricier side but if you're vegan or not and looking for a fresh healthy meal you'll like love this is your place to go, I will be returning!"}
{"text":"Awesome place! I'm not vegan but my friend is so we opted to have lunch here. We had the Viva Fritta with a side of Spudz and absolutely loved it. Staff and owners were very friendly and food arrived quickly even though they were very busy for a small place. Looking forward to going again!"}
{"text":"Love vegebitz. Thanks so much for staying open late and making my delicious mighty Cesar wrap and waffle hash. So good I ate it in the car on the way home. I will be back soon."}
{"text":"The flavours lacked taste, and the presentation was not very appealing. The only thing I enjoyed was the waffled hash...which isn't even the main dish, it's the side. Other than that, the place is cute and the owner is very sweet but neither enough for me to pay $16.95 for a subpar meal again. Recommend to pass and head somewhere else."}
{"text":"Extremely poor customer service. The staff there are great but as for the owners... cheap and don't care! Tried ordering online and asked for sauces on the side due to avoiding the burgers getting soggy. Owner complained that it was too expensive for the takeout containers to put everything on the side so they were more than happy when I cancelled my $120 order. Seriously how do expect customers to return? (Btw i had been a regular and visited over five times before & told all my friends about how amazing they were). Such a shame..  that poor service could lead to not returning. Now that boon burger is coming to Oakville I couldn't careless.    You guys can keep your expensive food & takeout containers. I'll take my business elsewhere, where it's appreciated!"}
