{"text":"Just ate here about 2 hours ago and I'm already planning my next visit! I had the salmon tartar which was perfect, pasta was excellent. The wine choices went well and were nothing I had ever had the opportunity to try before. The chef came out to ask each table how everything was..... Twice!  Waiters were on top of their game and the setting is classy, comfortable and welcoming.  Go here, try it, enjoy!"}
{"text":"We have been to this restaurant about 6 times now and have yet to be disappointed. We haven't sat inside yet as we had a fairly extended patio season but it's a great location and the interior looks very cosy. We have tried many of their mains and apps and all have been great. One night there we found the salt to be verging on heavy for my pasta dish but the next time there it had been pulled back to perfection. The service is very good also."}
{"text":"Overall, the best restaurant in The Beach by far.  We've been here a number of times and never been disappointed.  From attentive service, great food, great atmosphere, they have it all.  Usually pretty crowded on weekends so call ahead.  Generally order the short ribs whch are absolutely outstanding!  A number of gluten free items as well to satisfy those with dietary restrictions and the staff is always willing to work with you on a special item."}
{"text":"We had tried Veloute originally when it first opened and to be frank were impressed neither by the food, or service. Being of an open mind and having read a number of reviews on a local Facebook page we decided to give it another whirl :)  So, here we go .........second first impression very favourable :) server polite and attentive.   I went with the Calamari starter and my partner the Salmon tartar.. Fortunately my partner and myself like to swap ( keep it clean please) so I got to taste both . Lovely jubley two thumbs up :)  The sweet potato gnocchi and lamb shank received wonderful reviews from Ms. Katie and the Muscovy duck with mushroom risotto was also very good. A tad over seasoned for my salt sensitive palate but not too much so and super crispy.  Again two thumbs up. A wee bit skimpy on the serving size and the table bread was average but otherwise a solid meal. I wonder what dessert has in store for us.  mmmmm real cool Dark chocolate mouse and a wonderful creme brûlée, so let's see...3 courses and six thumbs up. They have acquitted themselves well. We shall will return."}
{"text":"Very bad experience: - waiter greeted us by saying he was very hungover (\"wrecked\") due to all-nighter party - which was useful because it explained his inattentiveness, attitude and stumbling.   - food was cooked opposite to what was requested. Salmon was undercooked when specifically asked to be well done.  Steak was medium/well to well done when asked to be medium rare. The steak was expensive (although portion small) so I sent it back. Not interested in overcooked 45$ steak.   - a new steak comes out (cooked properly) and the chef himself comes out a few minutes later. He asks if its ok. I say yes thank you.  He pulls out the original steak from hiding behind his back and presents it next to the new one! He says the original was med-rare and the new one is rare. Which i disagreed with. And then he suggests my tastes are european. Lol. Very argumentative.  - the fries were inedible cardboard.  After the surprise steak attack I made him eat three fries. He admitted they were overcooked. He took them away - to never return or replace them.   - we were charged for everything.   - we will never be back.  This chef's head is too big and doesn't deserve glowing reviews.   - french soup was executed too quickly (onions not carmelized, still had bite to them) - caeser salad was bland and pedestrian - and chopped up into too small of pieces.  A spoon would be useful to eat the salad."}
{"text":"Another restaurant with great food, and fantastic service.  Went here while family was in town visiting. They're not on Open Table to make reservations, but we called and got reso's with like a 4 hour warning and we were fine.  We had a 6:30pm Saturday reso and the place was almost empty, so we got the place almost to ourselves (of note, is that we stayed well past 9pm, and the restaurant still never had more than 3-4 tables going other than ours). This could have played into the service, which was excellent. It is super rare to find a server who was that attentive and charming.  I opened with the French Onion Soup (a theme this weekend as I had it the night before at L'Avenue as well) and it was pretty good. But the main dishes.... now THAT'S where it was at. I had the Bison Rib Eye steak. Man, was this thing tasty. Another in our party ordered the venison chops, and I was told these were also excellent.  Of note is that one of our party had dietary restrictions on dairy, so she ordered the sorbet (sidenote: their ice cream and sorbet is supplied by Ed's Real Scoop from down the block, read my review on them... they have the best gelato ever!) as her desert. After the server left our table, we were just talking and my party member began talking about how she misses chocolate, and couldn't have any of the chocolate deserts on the menu because they all have cream or milk or whatever, so the server comes over says he heard her talking about the chocolate, and if she wanted to switch her desert, he would have the kitchen make her a dairy free chocolate mousse to hit that chocolate craving. Nicely done old chap... nicely done...  So we had a fantastic time at this place. You should go.  Final notes: They told us they're now open Sunday at 11am for brunch. They're also renovating their back patio (so now they'd have one on the front and a larger one on the back) which should be ready in a couple weeks in time for the warm season. I'd say hit this place up if you're in the area and have the cash to burn. You'll get what you pay for. In this case, it was excellence.  Win."}
{"text":"Dinner for four. Lamb shank with sweet potato gnocchi, steak frites, filet mignon and catch of the day spigola fish. Plus grilled calamari and beet salad for apetizer. Everything was well made. Frites were just so so. My son raved about his gnocchi. Bill came to about $250."}
{"text":"My wife and I have been looking for a really warm, honest to goodness french bistro experience for years, ever since our previous champion (Bistro 990) closed down for good. I am delighted to report that we found our successor, an inviting little gem just east of our neighbourhood.  On the first night I ate here I was fortunate that foix gras was on the menu, and they did it just right, seared to perfection. My wife's dish was some kind of tartare if I remember correctly. The novelty there was that it was served on a gigantic block of himalayan salt. That sounds a bit gimmicky, but actually the dish was splendid, although the bits at the bottom were a tad salty.  I ordered the flat iron steak for my main, and it was perfectly cooked (blue of course) with an interesting black salt on top. Did I mention I love salt? The sauce was also quite nice.  The end result is you get classic french bistro food served with just a bit of modern flair. The ingredients are top notch, the presentation exquisite, and the atmosphere warm and inviting.  As an aside, the dining room is quite limited in size, so if you plan to dine here, you may want to book in advance.   I also would note that there is no need to pay for parking - while the restaurant is on Queen Street, all of the nearby residential side streets have abundant free parking!"}
{"text":"I came here in late-June to enjoy the backyard patio (quite leafy, intimate and quiet), and came back for more to celebrate Canada Day on the front patio with some Canadianized French and Italian food. Those who worry that a French restaurant is stuffy can relax. The sommelier wanders around in jeans and a casual shirt to help people choose just the right beverage. The craft beers from Ontario (wish there were more variety) have cheeky names. Allow yourself a cone of onion rings (the only thing French is French-fied) to taste how a gifted chef can pump them way up. Same goes for the French Fries. I've never had steak tartare before, and if you're the same, this is the right place to try it; beautifully served and delicious. In my book, The No-Nonsense Guide to World Food, i discuss the trend known as fusion -- the mix and match of various traditions and cuisines that is happening around the world. At its worst, it is Americanization with junk food. At its best, it's something like this -- a fusion of French and Italian and pop North American. The Beach only has two gourmet quality restaurants in terms of food quality and  overall atmosphere, and this is one of them.  If you're worried about the final price tab, do as we did both times. Order three appetizers and a drink. The staff are fine with that. If you come late, the chef comes around to chat and enjoy some fresh air a a breeze after an exhausting shift in a hot kitchen. A very charming fellow, and I like the tradition of meeting the chef who made your dinner and the sommelier who chooses drinks, rather than treating a night out as an anonymous relationship.  My No-Nonsense Guide also emphasizes the way food has become personalized, rather than commodified, over the past 15 years, and this place exemplifies that shift."}
{"text":"Went during summerlicous. Great menu selection! Good vibe and great food! - I had salmon to start, beautiful presentation and texture. And the seafood linguine dish was full of flavour, thoroughly enjoyed!   I'm not much of a dessert person but the creme brûlée was seriously to die for!! The chef really knows his s***. Now the negatives: waiter was clearly having a rough night, he was nice and all but kinda soured the moment with his negativity. Also I'm obsessed with Ceasar's and their drink lacked presentation and flavour! Overall I was very impressed and will definitely be back, highly recommend."}
{"text":"So this review is a bit behind, but really wanted to like this restaurant more.  My mom and I happened to be here during the Jazz Festival (hence the late review post) and was deciding between Brussels for dinner, or this place. We decided on Veloute because of the cute patio in front of the house. We decided on a very early dinner (5-ish) and good thing too as the hostess mentioned there was only one table left on the front patio for two. FYI. There is another large patio in the back of the house.  My mom and I were a bit disappointed that we couldn't get the regular menu as the restaurant was showcasing a \"Jazz Festival\" set menu...riding off the Summerlicious idea. For $25, you get three courses. I opted for a pasta dish which were few pieces of tastiness (forgot which pasta I had *blush*). I remember it was good, but few. My mom had the fish which was all right, but again small. I do remember having a great and cold Chocolate mousse for dessert which was the best part of the meal.  Service was off in my mind. At the beginning, we had this great server who told us our main server was occupied. I was fine with this because the first waiter was all smiles. He brought the bread, but no butter or olive oil. My mom and I, at first, thought it was just for dipping in our soups but we noticed later that other tables had butter. Then, our main waiter arrived and he was, let's say, efficient. Nothing wow. Wine glasses went un-cleared and it was only after we finished our dessert did the man ask if I wanted another glass.   Glad I tried this place out and I am sure the regular menu is yummy. I would come back here for the patio(s) alone...great for sun and people watching."}
{"text":"My husband and I came here on our anniversary and were thoroughly impressed.  The decor was warm and inviting and the service was flawlessly timed and executed.  The food did not disappoint.  I had the duck confit and my husband had chicken chasseur.  We each had pumpkin soup for our appetizer.  The flavours were spot on and the portions were perfect.  We each had dessert and coffee (crème brûlée for me and sorbet for him) and again it was well done.  Velouté was more expensive than what we would normally be willing to pay, but it was well worth it as a treat.  All in all, it was excellent and we would definitely return."}
{"text":"Took friends to this place last week, Had a beet salad and steak. Both were terrific. Crème Brule for dessert....to die for. I brought a couple of nice bottles of good wine and used their corkage service at $25/bottle which made the cost of a great meal palatable!  The chef treated us to a plate of his apple crumble and ice cream for those who did not order dessert. A really nice gesture. Great service all around."}
{"text":"One of the best meals I have had in a long time. I had the rack of lamb and tried the steak and bolognese.  All of it was amazing! The chef kept coming out to check on how things were. Very nice touch as he would give further insight on what we were eating and how it was prepared. Good service too."}
{"text":"I've been here twice, the food was pretty good, service was prompt and friendly. I would go back. The menu however, is extremely long and the second time I went there was only pasta.. 4 pages of just pasta.  It's a nice spot in the beaches but not necessarily a place that would bring you TO the beaches."}
{"text":"4.5 stars   Came here yesterday for dinner, and boy did it NOT disappoint. We decided to come here for the Summerlicious menu (which I believe majority of the tables did as well). Walking into the restaurant felt like walking into someone's home. Everyone was just so friendly, and inviting. All the servers had a smile on their faces, which was great since no one likes to be served by a grumpy person :(  We decided to sit out on the patio in the back as the weather was nice.   The food ... extraordinary, delicious, mouthwatering, I wish I was able to afford to have Chef Fawzi as my personal chef.   For appetizers my boyfriend had the grilled calamari, which was delicious, and the sauce tasted amazing with the bread (mmmmm good), and I had the cured Atlantic salmon. I couldn't decide on either the soup of the day or the cured salmon, so I asked my server to surprise me as I was feeling adventurous.  This was my first time having cured salmon, so since it was my first time, I can't compare it to anything but it was good. For the main, we decided to get the filet mignon, and it was mouthwatering. My boyfriend loved how what he requested is what he got. He asked for medium rare, and apparently in other establishments it never seems to be medium rare, but yesterday there was no complaints from him lol   ... and then dessert we got the crème brulee and the warm apple crisp with a scoop of vanilla ice cream. You can never go wrong with desserts!  Overall a great experience.   We'll be back!"}
{"text":"We had a wonderful meal at here with a large group this weekend. I had the beef tartar to start with a braised lamb main. My wife had the calamari. Both appetizers were outstanding the tartar was super fresh and served on a platter made of salt. The lamb shank was good, but needs a little more of the braising sauce on the plate.  The only thing holding back a five star review was the group was large and the small kitchen staff was not really set up to do that many covers at once. It was a valiant effort though. We will certainly be back."}
{"text":"So, finally, another good quality restaurant in the beach....  If your tired of pub grub and looking for something more befitting of a Friday or Saturday evening out, Veloute is definitely worth a try....  For those from the 'hood, this is the new (and improved) game at the old Balsam Bistro location.  Very good quality, and some interesting pairings, for the summer they seem to have a focus on citrus enhanced sauces on most dishes, meat/seafood/pasta.  Hoping this indicates that they will have a very seasonally focused menu, more robust flavours in the winter perhaps ???  It also appears that they have slightly expanded the front patio, providing a couple more tables, well needed on the night we were there..."}
{"text":"Went here on a Friday night. There's total of 11 tables and 8 tables were occupied. There's only 2 servers and the service was a bit slow. After we looked at the menu and have decided what to order, we close the menu and waited at least 10mins for them to notice we are ready. Their service was excellent and they know their wine list and recommend excellent wine to pair with our maibs. We suggest to call to make reservations beforehand.  Appetizer  French onion soup: cover with puff pastry and cheese and it is one of the best French onion soup I've ever had in Toronto so far. $14  Oysters: 1/2 dozen New Brunswick oyster. Super fresh :$19  Escargot: is the real fresh escargot with herbs and garlic butter and was serve with the shell. Not the frozen ones  that you would had at another restaurant. $16  Main Filet Mignon 6oz: served with mashed potatoes and stired fried veges. We ordered medium rare and it was perfectly cooked .  Duck Confit: served with fresh pasta with black truffle sauce. The pasta was amazing! Pasta perfectly cooked but the duck was slightly overcooked.   In general I would recommend this place for special occasion ."}
{"text":"Came here for summerlicious, don't think this worth $45 at all. Huge portions but taste was either too blend (onion soup and smoked salmon) or salty (seafood papperdella - the seafood were wayyyyyyyyyy overcooked) I was very disappointed with their molten lava cake as well, there wasnt any chocolate poured out ..it was just like a dry heated brownie. Server was nice and attentive so I gave them an extra star for it."}
{"text":"First summerlicious of 2015 and it went off on a positive rapport! Veloute bistro is among one of the cute places I've been to in a while.  French inspired the layout of the place has a beautiful flow; with the small patio in front, leading into the open concept dining space, and down the stairs into the lovely backyard patio.  The ambiance is tres intimate, clean, classy and presentable. The staff are very sweet, funny, and willing to share recommendations with their clientele. They've got their regulars, one of which is a cute friendly neighborhood cat that comes every so often and takes his/her seating spot beside the cat dish out in the backyard patio. For Grub!  starters I had their French onion soup, presentable, but most of all, decadently cheesy, and perfect balance of the onions and melody of other infused flavors. 4.5/5 Entree: their Filet Mignon 5/5 cooked to perfection, Medium rare topped off with a nice au-jus and peppercorn served on the side with some local greens.  Dessert: Caramel flan, presentable, not overly sweet!   overall! awesome place, and I shall be coming back to Queen street EAST.......WAY EAST...aka beaches."}
{"text":"Came here the night before Christmas with the family and my girlfriend. The food was fantastic and the service was terrific. The balsamic vinegar is sweet and pairs really well with the olive oil and the bread that are served for you. The food itself is delicious. The sauces that the chef uses are out of this world. The chef used to work at La Vecchia before quitting and starting Veloute. If you go back to La Vecchia, you will notice that the quality of food there has declined dramatically. Most of the dishes at La Vecchia are now not as flavorful because they are missing the great sauces that this chef has taken to Veloute. The steaks are delicious and marinated to perfection.   Veloute also caters and will prepare turkeys for Thanksgiving and Christmas so if you don't feel like cooking a giant bird, they will do it for you as well as provide exceptional cranberry sauce and gravy."}
{"text":"I believe this restaurant is one of the best in the beach as far as fine dining establishments go.  They understand food, wine and service. I've been on 4 occasions and have never been even slightly disappointed. I am the chef of a restaurant nearby and I take my hat off to Chef Fawzi for his understanding of flavours, textures, and his execution. I will be back when my newborn is not so new!"}
{"text":"My boyfriend and I have dined here multiple times due to its excellent service and atmosphere, we always return every year. Our first encounter was for Summerlicious where the portions of food are definitely larger than any other restaurants I've been to for Summerlicious. We have tried the food on their regular menu and the portions are even greater and just as delicious!   We tried their Summerlicious menu again this year and it did not disappoint. The presentation, taste and service were all amazing. The Grilled Calamari is always cooked to perfection, not too tough. This year, I ordered the Grilled Sous-vide Veal Chop - a very generous portion and it was so tender and moist. For dessert, my boyfriend absolutely loves their Scandinavia Vanilla Bourbon Crème Bruleé which is super creamy with the harden sugary coat on top."}
{"text":"This review is from July. We went to celebrate a special occasion and it became a disaster and ruined our big day. Wrote to the restaurant and never got an apology back. Here's a summary:  We were seated indoors, and the number of mosquitoes inside the restaurant was ridiculous. We were very, very uncomfortable and itchy throughout, so much so that my husband kept saying we should get the food to go and it wasn't worth sitting there. This despite the food which was good (except the molten lava cake which was a fully solid cake with no molten lava in it). The whole meal was not only ruined by the atmosphere, but we were very, very uncomfortable. By the time we got home, we had terrible mosquito bites all over. This is really unacceptable for a good restaurant, and frankly it wouldn't even be acceptable for a cheaper food place. On top of that, we were seated next to the kitchen area, and could constantly hear staff yelling at each other. No apology, and half our food went uneaten due to the mosquito-related discomfort.   Very unfortunate since we were hoping this could be our go-to restaurant for dinner not far from our place."}
