{"text":"I gave this place 2 stars because the tacos, and we tried 3, were very, very good. But the place is really noisy so you're shouting through dinner, the wait staff just wants to order more, more, more, really pushy. We had the sweet potato fries, a very small portion and $7.00! A 4oz glass of meh wine was $15.00! Taco was $12.00! And finally there Americano coffee was so hot we couldn't drink and 20 Minutes later we had to go... in any case it was awful from the one sip. This place charges old Montreal high end prices, but it's far from a high end place."}
{"text":"Tuna poke bowl was excellent!  Good cocktail and wine list, awesome atmosphere.  Great local Montreal dinner spot."}
{"text":"Had lunch here. The prosciutto pizza and kale Caesar salad were fantastic.  Erica our server was great.  She was friendly, attentive and very pleasant.  Great place for lunch.  Also we liked the old sedan deVille out front."}
{"text":"Great little spot. As you would imagine...west coast surfer vibe. Good music. Awesome San Diego salad - huge bowl and delicious!"}
{"text":"Stopped in for the tacos with avocado!  Found great service and trendy atmosphere. Sat at the bar since it was very busy and we were well taken care of. Enjoyed the fish tacos and chicken tacos--loved the smokey flavor of the chicken, combination of ingredients, and liked that the tacos were moist. Had a fun key lime popsicle that was refreshing and light for dessert!  Perfect place to celebrate a birthday!"}
{"text":"Awful service. Food was meh. 
Also, shout-out to Whole Foods for pointing out these guys are scumming Instagram Photos."}
{"text":"Un décor californien, briques blanches, des photos de skater vintage des années 80 au mur sur des notespad analogues- à moins que cette nostalgie des\"millennial\" soit telle que c'est du 2016 pur sucre\"- et voilà, la magie opère! Il ne manquait que des palmiers sur Saint-François-Xavier et on se serait cru quelque part à L.A.!
Ma conjointe et moi avons mangé le même Poke. On se dit toujours les choses sur le même thon, que voulez-vous. Un vrai régal! En entrée une guacamole relevée à souhait sur la lime et le citron, un sunset Boulevard, un Eclectic, et le bonheur se matérialise.

Service de la jeune dame, full sleeve jusqu'au bout des doigts, impeccable et très sympathique! On reviendra!"}
{"text":"Loved the decor, the set up and the general feel of the place. However, I expected better from the Poke given the price. It was ok, not bad, definitely not great just ok. I just felt it wasn't an authentic Poke. My husband took the Tuna and I took the shrimp and we shared. Would I go back? Probably but not for their Poke."}
{"text":"Nice ambiance and beachy feel. The Mexican soup was delicious. The avocado toast was okay... a bit overloaded with coriander seeds."}
{"text":"+
-Food is great. It tastes fresh and most of the items are on the healthy side.
-The decor is amazing and has summer/beach vibe. 
-Prices are fair.

-
-Expect to wait for a table since the place is quite popular. Try to book in advance if possible. 

Suggestion:
Try the salmon poke. You won't regret it."}
{"text":"Quite disappointed with Venice.... location is lovely, the restaurant itself is beautifully designed, seriously has the Cali vibe down. I was so excited to try poke.... how could you make something so good, so.... not good? 

The main issue here is the price to quality ratio. I have no problem spending money on food. In fact I enjoy dishing out for a fantastic meal. That being said, I spent a lot of money for a tiny amount of food. Like really tiny and really standard. I could have made my shrimp poke bowl at home. It had 4 ingredients tops. Now, don't get me wrong, the food was tasty. It was well executed. But I don't see the need to return. Also, the service was very spotty. I know it's newly opened so perhaps they are working out some kinks, but I think for the prices that they are charging, they need to wow their customers a little bit more."}
{"text":"Really like the vibe of this place! I always tend to order the same thing which is the salmon poke bowl. I think it's the best thing on their menu. I've come to this place for lunch a couple of times with coworkers who have ordered their tacos, and those tend to be small in terms of portion size compared with the price you're paying, so I'd say stick to the poke bowls. The takeout counter is not connected directly to the restaurant area, so if you call for takeout, you'll need to go in through the takeout entrance which is another door to the left of the restaurant."}
{"text":"Really nice meal here- great, fresh ingredients with reasonable prices and portions. Smoothie was pre-made and not that great, but coffee and food was great. Recommend both tuna and tofu poke bowl!"}
{"text":"Our Airbnb host recommended Venice and I also recommend Venice to anyone who is close to Old Montreal and crave Poke bowls, taco, or a healthy salad. After a full day of eating meat we decided to order the Tofu Poke Bowl (sub. rice with Kale for extra $2) and the Camarrones Tacos. The tacos with battered shrimp was done perfectly, every bite had a bit of crispy shrimp, pickled onion, and sauce. Each order of taco comes with two tacos. and they are a decent size. The tofu poke bowl with kale was refreshing and light (in a good way). The tofu is deep fried (like agedashi tofu), complimented with green onion, edamame, green onion, bits of fried onion, and something similar to hot and sour sauce, lastly the pineapples made the dish top notch. These two dishes was enough to be shared between two people. 

The restaurant was decorated like a beach house in California, with photos of surfing, skateboarding, and the beach! Wish I could come here again to try the Tuna or Salmon Poke Bowls but leaving next day =( . I noticed next door to the restaurant is also Venice and I believe it is for take-out (i could be wrong). Sorry for the photos being so dark, the server made today extra romantic by dimming the lights ;)"}
{"text":"Déco cliché avec de la bouffe beaucoup trop chère pour ce que c'est. Salade inspiration asiatique qu'il appelle ça \"chinatown\" me fait rire. Tous qu'il est chinois dedans c'est des edamames et des instant noodles frits saupoudrés sur des laitues romaines et carottes, avec une petite vinaigrette au arachides. 

J'ai aussi pris un poke au thon à 18$. Il y avait que du riz et 6 morceaux de petits cubes de thon: Gros rip-off. 

Je ne comprends pas le hip de cette place... c'est tous des choses que tu peux faire chez toi et 10 fois meilleures aussi. C'est juste des ingrédients assemblés dans une bol. C'mon..."}
{"text":"Disappointed that we didn't find this place until our last night in Old Montreal. Food was fresh and fabulous. We had the poke bowls (tuna and salmon), fish taco and guacamole. The service was perfect. There when you wanted them but not hovering. The decor is beachy. It was so good we are thinking about going back for lunch before we head to the airport. A must in Old Montreal if you like tasty fresh  food!"}
{"text":"The 1st time that I visited this place was for lunch with a good friend. It was a mission to locate the front entrance due to the construction and road blocks. It was worth it since I really enjoyed my experience. The place is bright with fun décor. It was packed during lunch and we were seated at the bar. I prefer to sit at the bar since you see all the action that happens. Despite being busy, our server was quick and attentive. 

I ordered the tuna poke bowl and was extremely content as the portion was a good size and it satisfied my taste buds. I definitely want to try other items on the menu as it screams healthy and fresh ingredients. I was happy to see gluten free items on the menu."}
{"text":"Huge disappointment. We ordered the beef tacos, shrimp tacos, fish tacos, and salmon poke bowl, and the big theme of the night was WAY TOO SALTY. Inedible, over priced, and just plain disappointing. The worst one was the fish taco that tasted like a bowl of salt. Avoid."}
{"text":"Pour faire suite à mes avis précédents je suis retournée à 2 autres occasions. Lors d'une deuxième visite, j'ai pris les tacos aux crevettes. Ils manquaient de garniture et il y avait trop de sauce. Lors d'une autre visite, J'ai également essayé le gazpacho qui était bon et frais. Aussi une salade aux crevettes dont la qualité était assez moyenne. Salade plutôt simple au niveau du goût et des ingrédients. Selon moi elle ne vaut pas le prix."}
{"text":"En tant que fan en cavale des Poké (bols de poisson cru avec riz, salade, sauce) , je ne pouvais résister à l'appel du Venice. C'est en cherchant une idée pour une date de filles que je suis tombée sur eux. Leur site web est cool, très californien et le concept '' santé'' ne m'a pas laissé indifférente. Ça m'a rappelé mes doux voyages, alors pourquoi pas !

Ambiance décontractée, les gens vont là pour jaser, boire de bons cocktails et se délecter de plats so-cal. On a choisi le poké de saumon et de thon respectivement, celui de thon était plus goûteux à mon avis. Pas une fan de wakame, je fus un peu déçue de la quantité importante dans mon plat, mais ça c'est juste moi !

Le menu de drinks et de boissons est intéressants mais plutôt dispendieux pour ce que c'est (ex : verre de bourbon limonade a 11$, est-ce qu'ils font la limonade eux-mêmes?)

Finalement, le service était ok, même si ça nous a pris environ 40 minutes recevoir notre facture. Une chance, nous étions en grande discussion alors ''no harm done'' comme on dit. 

J'y retournerais mais je prendrais sûrement autre chose, sinon en plein mois de juillet ça promet d'être rafraîchissant !"}
{"text":"Amazing food and great ambiance. The decor in this place will make you think you're in California or some beach outside of Montreal. 

The food is really good and staff is young and super helpful. The service is quite fast and it is better if you don't go during peak hours to be seated right away. Their cocktails are great and with a nice kick! I definitely recommend this place. 


ps: their music playlist is so freaking good!!"}
{"text":"Had the tuna poke bowl, some of the tuna in the bowl had gone bad. I knew it wasn't edible to eat since the tuna was extremely dark but I gave the place the benefit of the doubt and tried it, I spat it back out immediately. When I'm paying over $15 for a bowl I expect it be edible."}
{"text":"When you walk into this place you really do feel like your walking into California and the staff are so polite and accommodating. My one complaint is that one of my tacos was really soggy while the other one was fine, so maybe a lack of consistency when making food. If you order something to share I would recommend the edamame it was delicious. And my friend enjoyed the tuna toast. Would eat here again :)"}
{"text":"So big disappointment! It was my several order with uber. Food came cold (uber fault I guess) but the real problem was size and quality of the soup! I got literally 100 ml of bouillon with 2 slices of lemon and spoon of orzo in it for 9$!!! So ridiculous!! I'm the soup lover, so I contacted uber, they couldn't do nothing, then I contacted restaurant directly and in the foggy discussion I had with someone of the stuff I was informed they are sorry but they can't do nothing about it! Really?! So professional..."}
{"text":"Great food that is fresh and flavorful. Nice atmosphere and pleasant staff.   The spicy tacos were excellent and just the right amount of spice. The kale and quinoa salad was also excellent."}
{"text":"Plastic plants on the tables, mediocre, over-priced food, average service and...a lineup out the door. 'Makes no sense, but I guess that it just opened and people are coming for the concept (which, I'll admit, excited me too). Who wouldn't love a little slice of California cool in Mtl, with all of the delicious grub that goes along with it? Unfortunately, Venice really doesn't deliver. The rice in the tuna poke bowl wasn't cooked properly. No one came after the food was brought to the table to ask how everything was. The bottled lemonade was good but somewhat overpriced (as was the food). All in all, an unsatisfying experience."}
{"text":"It's so nice to have a fresh new space where you can eat legitimately guilt-free food in style. No sugar-laden, juice-filler smoothies here! Just straight up clean and delicious food served in the most adorable dishes and an über chic atmosphere to boot!

The menu is concise but diverse enough to please every conceivable diet that is currently ~on trend~. I had the acai bowl (duh) and my date had the Venice salad. Both were delicious and left us very happy!

The space is bright white and looks like a Pinterest board come to life. The staff are quick and kind. The patrons diverse- from your expected basics to professionals out to lunch. 

This is a great place for an uplifting meal! I can definitely see myself coming back soon."}
{"text":"Personnes coeliaques, attention! Ce n'est pas tout à fait sécuritaire pour nous. J'ai malheureusement été \"contaminée\" à ma dernière visite, même après avoir mentionné au serveur que j'avais une allergie sévère au gluten. Je comprends les risques de contamination dans les établissements qui ne sont pas 100% sans gluten, mais c'est plutôt la réponse du serveur qui m'a un peu troublée : \"C'est sécuritaire, inquiète toi pas, sinon on ne dirait pas que c'est sans gluten!\".

Ok... :/"}
{"text":"Great ambiance, good healthy food! Portions could be a bit bigger!! But staff is great, and overall will be coming back!"}
{"text":"On se sent déjà en vacances en y mettant les pieds avec ce décor californien: Vélo accroché au mur, plantes vertes, planche de surf : c'est dans ce décor californien. Les plats vont de 6 à 18$

Ma soupe courge musquée et noix de coco était juste parfaite avec son soupçon de curcuma et cayenne. Mon taco aux crevettes panées, oignons marinés, chou et crème sûre était parfait, léger.

J'ai goûté au poke de thon dans l'assiette de la personne qui m'accompagnait. (Soyez sans crainte, il a pu goûter à ma soupe et à mon taco aussi...) Vraiment délicieux.

Excellent service. J'y retournerai"}
{"text":"Came for the guacamole and stayed for the tacos. 

I ordered a Montreal beer and it was delicious. 

We ordered guacamole to split, it was just enough for 2 adults and one kid. If we'd had any others with us we'd need 2 orders. 

The guacamole was so good we decided to stay and split the Korean BBQ taco. It was AMAZING. Full of flavor. One order came with 2  nice size tacos that we were able to split between our party of 3. 

The service was fast and everyone was welcoming. 

Will definitely return next time I'm in Montreal"}
{"text":"This place is amazing.. I was drawn in by the fun vibe. It's popular for a reason. ..great food, great atmosphere, great  service, reasonable prices, and an attractive setting.

The menu seems healthy... vegetarian & gluten free... so many choices. The poke bowl was \"out of the world\" delicious ...rice tofu crispy shallots pineapple edamame souring onion and a sweet chili sauce ... huge portions 3 of us ate it to finish it. We also had chicken tacos 2 in a plate... was also fantastic.. the filling was just too much so we asked for additional tortillas so literally it was more like 4 taco a plate.

The service was great... highly recommend!"}
{"text":"Randomly walk-in service was great and had an authentic all fresh caesar salad. The garlic was fresh, the parmesan was fresh grated and the 2 kinds of lettuce.

Ambience is cool with a Venice beach feel. Nice music without being disruptive to a great a conversation.

Recommended."}
{"text":"A real good place to go to in the Old Montreal area; affordable, cute place, prices are decent, and the food is nice and healthy too.  I liked that they have a legend to show what is gluten-free, vegetarian...etc.

Just coming here feels like you're on vacation (almost!) - really just like California.  The decor has real fresh colours and like how the tables and chairs are mix-matched.  Had sat at the bar before, and also had table service - both options are ok on service.

Have eaten the tofu bowl, the squash/coconut/turmeric hot soup, and the pork taco.  Have tasted here and there from my bf's salmon poke bowl and that was very good - plentiful and fresh.  The salmon did arrive cold, as it should, on a bed of rice, and eating it was like that of a salad.  I really enjoyed the tofu bowl, but, after a while, the sweet and spicy chilli that it was served in got real old fast - don't think that sauce was homemade so it was your typical corn syrupy concoction out of a jar.  I really enjoyed the squash soup - I made a mental bookmark to find this recipe online ;).  It arrived at the perfect temperature allowing me to enjoy the first sip when it arrived.  

We once sat at the table centered in the resto, facing the entrance, and the breeze was coming through the opened door and opened large windows, and it was refreshing.  When seated at the larger tables, you may find yourself sharing with other parties.  It is a small little place, so be prepared for your chair to be bumped multiple times by the clients and wait staff passing through the tight squeeze between tables.

The guys behind the bar counter are not too bad to look at either ;o."}
{"text":"Great spot for a quick lunch on a sunny day while walking through old port, good vibes, nice decor and very busy. 
The shrimp tacos I took were a little let down (not a good value and you basically only taste the coleslaw, shrimp fried in too much batter and lack crispiness), but I will be back to sample their poke bowls."}
{"text":"I had a great lunch here a few days ago - I ordered the Salmon Poke bowl and tried a bit of the Korean Beef Tacos. The Salmon Poke bowl included a number of ingredients: rice, seaweed, seaweed salad, cucumber, tobiko, pickled ginger, puffed rice, litchi, and salmon, with a miso yuzu dressing. I liked how all the components mixed in different proportions depending on the bite, except the litchi was occasionally a bit too sweet. The Korean beef from the tacos was tender, but they were really heavy on the mayo, which was a bit of a turn-off. Service was friendly and prompt, so I would return again when in the area - a welcome change to the Montreal food scene."}
{"text":"Pour mon anniversaire, repas du midi savoureux avec mes 2 grandes filles. Merci Venice! Merci B & J"}
{"text":"Meh the popsicle was more icy than creamy, so if you're into that this is the place for you! The flavor was kind of weak. Super friendly cashier and cute decor so that gives them an extra point."}
{"text":"Visiting Montreal didn't expect to find Poke and a Ca theme restaurant, great food, very friendly servers. The bowl had lots of interesting items, wish I would have kept them menu while eating it. A fun place to eat."}
{"text":"We ordered toast with avocado and poached egg! The egg was not cooked at all! So order this food if you like your egg Raw!! The waitress wasn't so welcoming either! I won't go back!"}
{"text":"One of the best kept secret in old Montreal. Shuuuu don't tell anyone ; )

The poke is just sublime."}
{"text":"A fun little gem! Hummus and poke were delicious.
Friendly staff, fun atmosphere... totally recommend it!"}
{"text":"Pretty good poké. I had the tuna poké bowl, which was beautifully presented and the garnishes looked wonderful. Could've done with a tad more dressing for my liking. But the venue has a cool casual vibe and the menu is diverse and interesting. If I was a local I'd definitely go back to try the flatbreads and tacos. They looked delicious."}
{"text":"Loved it! Very unique and trendy! Good and fresh food! The decor is very summery! I had a feeling that I was in vacation! Had a avocado toast and was really good!"}
{"text":"Fresh food and an even fresher vibe. Killer playlist and tunes and fun hipster waitstaff.  Put this place in NYC or Cali and it would also make a killing!"}
{"text":"This review is only for the popsicle shop next to the restaurant! The popsicles are all made with local fruits, and the labels are hand stamped onto the popsicle sticks. There were options with milk and without. We tried the blueberry lavender and it was delicious- fruity, creamy, and floral. Also, very cute shop with all the teal and pastel accents. The man behind the counter was also friendly and very helpful!"}
{"text":"We really enjoyed Venice for lunch and think it's better for lunch than dinner. The restaurant is small, and seating is tightly packed, for someone tall like me, I could have used more room. They have salads ( nice and large), rice bowls, flat breads and other items good for lunch. The food all very healthy, filling and tasty. 
The crowd was a mix of trendy musicians, yoga goers and convention center participants. The staff was nice and the decor a mix of Venice beach and French county chic. Go early, because once events and yoga lets out by noon, it can be packed by 12:15pm. Very cool vibe and I recommend."}
{"text":"Not worth it. You think you are getting a slice of Venice by coming here but it's so kitschy and overpriced in my opinion. Again, it's just my opinion!"}
{"text":"I absolutely loved the poke bowl at this place! If you can tolerate the wait, I would really recommend you try this spot! 

Located in Old Montreal, the venue, with its whitewashed brick walls, raffia light fixtures, and touches of beach themed decor, add to the great laid back feel. The place was packed when we arrived, and this was on a Sunday in the middle of winter at 1:30 pm; I can only imagine what happens here in summer! 

The menu is fresh and affordable, serving salads, tacos, and poke bowls. I had the tuna poke bowl which was just delicious; bright, fresh, flavourful and great portion size too! Grab a homemade cold pressed juice with your order too; I tried the Santa Monica, beet based juice which was actually super light and lemony! 

Go to Venice and grab yourself a really healthy meal that's actually so good, I'd have it daily!"}
{"text":"I was really excited to go here cause it's healthy and light and fresh and the decor is really nice.
I gotta say I was pretty disappointed...
The food doesn't taste great and it nothing special... 
I had the prosciutto on toast, it was ok. My friend had a salad that too was just okay .. After we left we went for a second dinner because we were still hungry. Also very overpriced for what it is.
The good thing about the place is the decor and atmosphere. 
Lastly they pretty much copied buck 15s Avocado on toast to a tee!!!!!"}
{"text":"After a rough night of trying to find a place to eat on a hot Saturday night, we dunked into this place. Great find for reasonably priced quality food! Appetizers were great (hummus and Edamame). Entrees were good as well. Flathead pizza was a good portion but the dinner salad could have been larger (but it tasted great). Not fine dining but good tasty food at a good price."}
{"text":"Great for a girls 5@7!! Great ambiance and location. Drinks were original and boozy. Food was ok but still worth trying. Service was excellent!"}
{"text":"I tried this for the 1st time recently. I's a nice place in Old Montreal, although in the middle of a construction zone for the time being...but that didn't stop the place from filling up. The food is very good. They specialize in Poke bowls which is basically a very large opened sushi roll.....rice at the bottom some veggies, sauce and then tuna/salmon/shrimp etc. It was very tasty, but I'm not sure why they feel the need to pack so much food into such small bowls. It makes it a bit difficult to eat and mix the ingredients and flavors. Poke bowls are apparently a Hawaiian specialty....and maybe there are no larger bowls in Hawaii and somehow this trend got exported to the rest of North America....I don't know I've unfortunately never been to Hawaii. I do know however that there are lots of larger bowl manufacturers and distributors and stores in Montreal. That being said, it's definitely worth trying this place and eating their delicious food out of their freakishly small bowls. Also, their butternut squash and coconut soup is AMAZING!! BTW, the amazing soup (which was just one liquid ingredient) was in a larger bowl then the Poke which had several ingredients.....makes no sense to me. OK, I'm now done with my bowl rant."}
{"text":"We did takeout the first time and it was good! I'd say a very satisfying 4 stars! 

The second time, I we went for a sit down lunch. Getting there early during the weekday lunch is essential if you don't want to wait outside--like before 12pm. There are number of tables and about a dozen seats at the bar but the place fills up pretty quick!  The decor is beachy fresh and hipstery. The place is lively so the noise level is a bit loud, but not too much. Service was really fast, we had our food in 5 or so minutes. 

We ordered the salmon, the tofu and the tuna poke bowels and were very very happy with the food. They were 5 star-delish!  And the presentation is simple but pops! 

The salmon bowl had rice krispies, seaweed salad, nori flakes, lettuce, pickled ginger, warm Japanese rice, chunks of salmon, cucumber slices, salmon roe and a sauce that tied everything together. What I loved about it is that the sauce wasn't too loud.  You know how some poke bowls have everything just tasting like the sauce?  Well this one wasn't! The sauce was just perfect!  

The only thing missing after my meal was a hammock on the beach so I could nap off my lunch :D"}
{"text":"Must get dishes/Drinks:

Salmon or Tuna Poke Bowls (main)
Edamame (side)
Cali Ice Tea (drink)

So I had been meaning to get to Venice ever since my girlfriend went without me while I was on exchange in Scotland. I really wasn't disappointed! Poke is getting more and more popular in MTL now and Venice is definitely one of the best options. 

We went on a Sunday afternoon and had to wait for like 15min because we were a group of 6. The restaurant is pretty small inside so I can see this being an issue on very busy days. But the wait past by quickly partially because the manager was super kind and friendly and partially because we ordered cocktails... 
out of the 4 cocktails we got, my favourite was, the Cali Ice Tea, which really refreshing and has a nice alcohol to ice tea balance. 

To eat I split the the salmon and tuna Poke Bowls with my girlfriend and stole a couple of Edamame beans from my sister. If you have never had edamame it is an experience in itself but these are perhaps the best ones I have ever had. They had a sweet and spicy sauce on then that really made then to die for. 

The Poke Bowls were both delicious, very decently portioned and a nice mix of different ingredients really made each one stand out from the other. Unlike other Poke restaurants you don't have many options at Venice, really only 3 but they two that we tried were both delicious and different which is a refreshing change from other poke restaurants where I feel like every dish is just a mix of the same ingredients and all end up tasting the same. 

All in all I loved the experience, it is busy and the restaurant is small so the food did take some time but bring along good company and you will be fine!"}
{"text":"Wouuuah! Ces temps-ci, je passe mes journées dans le Vieux-Port à découvrir les environs et ce diner était réservé au Venice Mtl dont j'avais tant entendu parler par ma meilleure amie ! Eh bien, le restaurant m'a tellement charmé que j'y passerais mes journées! 

Le restau est tout petit, à peine une trentaine de places, et ça en fait tout son charme! Tu as l'impression, dès l'entrée que tu es ailleurs, en fait, tu te sens en Californie, où il fait bon vivre et où tout le monde est heureux et zen (vraiment!) ! L'endroit est bondé de monde, arrives tôt parce qu'il y a souvent de l'attente (ce n'est jamais très long!) !

Le menu est génial et propose des choix santés qui ont l'air délicieux! Il y a les \"Poke\", un bol de riz avec accompagnement sur le dessus! Mon copain a pris lui au saumon et c'était très bon! Il y a aussi des tartines, des soupes (le gaspacho est débile), des salades à la tonne et des desserts fruités pas trop gras ni culpabilisants!! 

Ah j'ai tellement aimé mon expérience, j'y retournerais demain!"}
{"text":"Cold greeting at the door. After reading other reviews, I understand why they didn't want to seat us right away despite the restaurant being empty (our party hadn't fully arrived yet);  apparently, there can be a lineup at the door and we were just lucky enough often to show up at a relatively dead time. However, that does not make up for making us feel unwelcome as soon as we came through the door.  

The service was more friendly for the rest of our meal, though. Our waitress although very friendly, was not helpful as she was not very knowledgeable about the menu. We asked about the smoothies. They didn't have menus as they are normally only served during lunch time but were kind enough to make them for us anyway. However, the waitress knew only 1 ingredient per smoothie and was not even able to tell us which fruits are contained in the fruit smoothie. Even after trying to get more information she was just sticking to the one ingredient she knew and didn't offer to show us the menu. Even for the regular menu she couldn't answer any question. 

The food itself was quite good but mostly overpriced especially considering the small quantities. Most of us were surprisingly full at the end of the meal, but I have to say we had either ordered a smoothie (quite heavy, very filling) or extra sides. The tacos, particularly seemed very small. I personally had a spicy salmon poke (the special of the day) which was delicious. I was disappointed that the lettuce was in fact Iceberg lettuce, not very tasty, cheap and honestly just reinforced that I'm paying way too much for my little bowl.

Overall, I don't think I will be back. My main reason is that it's quite overpriced for the quantity/quality, but the so-so customer experience really didn't help."}
{"text":"Venice was extremely aesthetically pleasing. We went without reservations around 8pm and got a seat at the crowded bar. The drinks on special were really good and the bar tender was very friendly. We ordered two pizza's but definitely could have shared just one. The guacamole and chips were such a yummy app, although more chips would have been appreciated. The mushroom pizza was delicious and very savory. Would go back, be sure to make a reservation!"}
{"text":"This place is usually packed during peak hours, so I decided to try it for a late lunch around 2pm.   No problem getting a table...

Got the poke tuna dish.   It was large and colorful.  Tasty and fresh.  Very good Poke.

The service was a bit erratic, but not bad.

Nice great open windows make the space airy and light."}
{"text":"I fell in love with the atmosphere! I had the avocado and egg toast which was really good compared to other places I've tried it. My friend had the Margarita flat bread pizza which was pretty delicious. I would definitely go back all though i found the prices a bi"}
{"text":"Awesome atmosphere, great wine, delicious food, friendly staff. A bit crammed and a bit pricey, but a great place for casual or semi formal lunches especially for young people. Would definitely recommend for vegans and vegetarians."}
{"text":"Great place with a California theme. They always have good music playing. Try the tuna poke, it's really good here. Also love the Venice Breeze cocktail."}
{"text":"I came back here a couple more times and everything was always fine because i would always order the same bowls: salmon or tuna. 
Until the last time...
I took the shrimps.
Oof... they were so pasty, like teady-to-eat frozen cooked shrimps that have been sitting out for too long or something. I could only stomach about 2-3 and pushed all of them aside to eat only the veggies
The waitress was nice about it. 
Although, if I were them, I would have offered the customer a discount or something, lile a dessert, on the house, in that situation. 
So, I am taking away one star for this time."}
{"text":"Awful. Front desk guy at our hotel recommended. Maybe he knows the owner? Drinks were all water. Pizza was no better than something from a microwave. Avoid. So many better choices."}
{"text":"Remember 2016 when there wasn't a poke restaurant on every corner? Venice does. It was a simpler time, when life seemed normal and everything felt like it was going to be okay. 

THEN, poke restaurants started popping up all over the place. The trend washed over the city. Pushy poke and poke fusion and hokey poke... dark times. But Venice stood strong and waded the storm. Now, it shines in a sea of subpar poke. They don't try too hard, but they don't slack on life either. It's just a really chilled out spot, where you can grab a poke, catch up with a friend and digest at a leisurely pace. 

Ven/10. Would poke again."}
{"text":"The food was ok, but very salty, but it didn't made my experience bad. However, we had to wait for at least 20 minutes before paying, since the waitress seem to have forgotten about is. The table very next to us, arrived after us and got to pay before. They left and yet we were still waiting."}
{"text":"Really great food and great atmosphere! Very small and cozy but full of people. It's not too loud even with all the people there. Really recommend the chicken tacos. Great place!"}
{"text":"This place is unreal. In such a beautiful neighborhood in old Montreal. The food is incredible and well priced. The staff is very nice and welcoming. I had the tuna poke bowl which was great and I would highly recommend this place."}
{"text":"Très beau décor mais nous étions vraiment déçu de la nourriture. Nous avons trouvé cela plutôt cher pour les petites portions qu'ils servaient."}
{"text":"Excellent restaurant in Old Montreal. I recommend the shrimp tacos, edamame, sweet potato fries and any of the poke bowls (so basically anything on the menu). Everything is delicious and tastes fresh and the staff is very nice! Good place to go on a summer evening or for a yummy lunch!!!"}
{"text":"Ouvert en mars 2016. Comme plusieurs personnes, ma copine & moi, avons adorés la décoration à saveur Californienne (accessoires/couleurs) de Venice MTL (située dans l'ancienne Casa de Matéo). Maintenant, au niveau qualité/prix/portion sans plus, pour nous. Avions pris, un smoothie, un cocktail, 2 tacos al pastor et un poke au saumon et comme dessert, un chia parfait. Service ok du serveur. Sommes ressortis, non rassasiés et avions encore faim. Même chose pour le couple d'amis avec qui on été. Donc, pas concluant dans notre cas, l'idée est super mais faudrait revoir le prix versus les portions car pas certains. Ambiance bruyante & branché. Sans gluten/végétaliens friendly ! À vous de juger maintenant !

3/5 visité en avril 2016"}
{"text":"This cute restaurant is filled with Californian vibes, surf board, bike, palm tree, the interior decor is great! The menu is not very varied, mostly poke bowls (their home specialty!) and cocktails, with some side dishes and other wine or drinks. I think that their poke bowls are very savoury but with too much seasoning, which keep me from tasting the freshness of ingredients. The plating is marvellous and the colours are vivid, super tempting to eat more and more! One poke bowl is already very substantial, we took camarones (shrimp) tacos on top of it and it was a bit too much. Their lemon Bourbon cocktail is rather normal, and small quantity. I would recommend people to go try their poke bowls, but less for the rest."}
{"text":"Venice is solid food. You don't really hate anything you eat here. I love the tuna poke bowl here. Last time i had the pescado tacos which were also super solid. I do feel that for what you are eating the portions can be a tad bigger, since your not really having the gourmet experience here."}
{"text":"If you are in Montreal, make sure you at least go there and treat yourself to an amazing Tuna Poke Bowl! It's a cozy, friendly restaurant. Make sure you go there before 12pm (lunch rush) or after. If not, expect to wait a little before you can get a table. Regardless, it's worth the detour and wait time."}
{"text":"Pros, the restaurant design is cool

Cons
-slow service
-overpriced and small size
-salmon bowl tasted nothing special
-shrimp tacos were some of worst tacos i ever tasted.

cost me 50 bux for 1 pokebowl,1 beer, and 2 tacos

would not go back"}
{"text":"For my short weekend trip to Montreal, I came here alone while my boyfriend was in the city working. I wish I lived in Montreal so that I could eat here every day. It was nothing short of a wonderful experience where I could find some delicious healthy food and great kombucha. The service was great, the Poké bowl was the best I've ever had (I'll be returning tomorrow for the tacos), and the atmosphere was trendy and relaxing on this cold, wintery day. I am so glad I stumbled upon such a gem in this city."}
{"text":"Ça fait trois fois que j'y vais et j'adore! Un des rares endroit où on peut manger des vrais bons plats colorés! Les poke bowls sont succulents, les tartines aussi et les cocktails sont bien équilibrés. Un peu dispendieux somme toute, mais je suis ravie de mon expérience à chaque fois. Vivement un Venice 2 ou un Venice plus grand! (Il faut admettre que c'est un peu tassé!)"}
{"text":"Cool place in the old port. Hawaïenne decor. Poke bowl was pretty good. Watermelon juice was basic and pretty expensive for a simple juice. Overall cool experience! Enjoy!"}
{"text":"Is there a special achievement award we can handout to the takeout counter at Venice? Every lunchtime visit to grab lunch, from greetings to doggy-baged goodbyes, within 4:00 flat (unofficial time). If you ever thought to yourself \"I'm in a rush, Olive and Gourmando sounds like a great idea for lunch\", I'll pause here so you can climb back up onto your chair.

There is a special dedication to eradicating wait times at work here that'll have you rethinking that stereotypical laid-back approach to life we associate with the West Coast. Venice weekdays at 12:05pm is a traffic control nightmare of hungry young professional who've navigated the poorly organized labyrinth of walkways and rubble attractions that is Saint-François-Xavier (shoutout to the city workers posted at either ends of Notre-Dame and Saint-Paul cosplaying as ushers for the restaurant). There is no reasonable expectation of being given anything resembling priority attention,  and yet each time I feel what I imagine are the feelings of those people whom's magical \"member's status\" that lets them board airplanes before the rest of us. 

What a beautiful sensation. 

PS: San Diego Salad no add-ons. Skip the pokes. You're welcome."}
{"text":"They leave a jug of water on the table. 
The place is a bit small so make a reservation if you come for dinner. 
The place has a cool Hawaiian vibe.
For appetizers we got the marguerite pizza which had yummy goat cheese on it. Also got the guacamole and hummus. 
For the main, I got the shrimp poke. The rice is a little dry and there is too much of it. I think I saw the option on the menu that you can substitute the rice for kale. I might try that next time. But either way it was still a good meal!
The hubby got the salmon poke. He said it was good but next time he won't put so much hot sauce cuz there are already jalapeño peppers in there. Now his mouth is on fire. 
For dessert we got the lemon basil pie and the apple crumble. The lemon basil pie was better. 
They gave us shots on the house for my hubby's birthday! 
I'll come back here. And now I'm even more excited to go to Hawaii."}
