{"text":"THE BIG HURT  BURGER !!!
Four half pound burgers, four different  tastes,  all you need is four fingers to eat it cause of the stick,  in under fourteen minutes, I think they said ten minutes to get your picture with the Versus girls but it was way too good to scarf it down that quick. I went October 29 2010  I almost finished if it wasn't for the Awesome wings and Blue Moon um yes they do have tangy oranges for the Moon! I'm going back in a couple of weeks to put the smack down on that BIG HURT burger!!!

Thank you sexy Tabetha for the great service!"}
{"text":"I really like there cheeseburgers. When I tell them how I like it cooked it comes out perfect every time and I'm pretty picky about how I like it."}
{"text":"This location used to be Native New Yorker. After a several visits, below average food, and super poor service we did not return. What's this! New owners, new name? It's now Versus Sports Grill. So we decide to try again, what a mistake. After two visits there was no change. With no significant sporting events and a very small crowd, we waited 45 minutes for a bar burger. The Aegean pasta was overcooked to mushiness. (Side note: Funny, the prior owners served mushy pasta too.) The food was served out of order (e.g. soup/salad with entree comes before the entree unless specifically instructed otherwise). Fries and burgers were barely luke warm when they arrived. On a high note, we did have ice tea and soda refills, thank goodness for that! With Below Average Food and Poor Service , we will not be returning."}
{"text":"I decided to try to catch  the Celtics-Cavalier game last night, and drove by the Versus Sports Grill. I hadn't noticed it before, but it had a large banner saying it was open, so I thought I would give it a try.  Apparently it hadn't been open long, and obviously they were still working out some kinks.

I wasn't there to eat but to have a couple of beers.  During half time, I decided to get some chips.  They were described as tri-color with salsa and for $1.00 extra, a side of guacamole.  I hadn't had dinner yet, so I thought I would try some, and it would tide me over until the game was over.  Bad decision - the chips were not home-made but obviously came from a bag; the salsa was dry, and not very appetizing; and the guacamole was, I think, the worst I have ever had.  That was the downside.

They had a number of pluses.  The service people were great.  Although there was obviously some teaching going on,  the servers, bartenders and supervisors were obviously trying to do a good job.  A sports bar requires, first and foremost good TV's, and their's were great.  They had a large number of  good quality flat screen TV's that were well situated so that no matter where you sat, you had a screen you could easily see.  They also had an adjacent area with three or four pool tables and games, apart from the bar and eating area.  It is a nice division, and seems to work well.  And, of course, they had a wide variety of beers, and the standard bar drinks.

Although I did not have any  food other than the chips, I did notice food being delivered.  It looked appetizing, and well made.  And people seemed to enjoy it, but without trying it, I have no idea how it tasted.

I think it shows promise as a sports bar - but the appetizers- chips, salsa, guacamole, etc.  need to be freshly made.  Otherwise people will drift to where the food is better, or at least, eatable.

I will be back to see if there are improvements - because the employees seem to care, and are obviously giving it a real effort.
I hope they succeed!!"}
{"text":"Versus Sports Grill is what it is... a sports grill. It's a pretty busy poppin place. Atmosphere is a ton of fun, and a great place to come by to get away from it all and toss back a few. They have my all time favorite beer on tap, Pyramid Hefeweizen draft, which makes for a very happy me. The wings are pretty good as well, we had a mixture of the \"tap out\" and the \"sweet hot\"

Great place to hang out with friends for drinks."}
{"text":"My friend and i walked into the via linda 90st location..  We were hoping to catch the Mets Phils game.. The manager at this bar at one point made a comment that we were causing trouble for him by asking him to make adjustment to the game we were trying to watch..   Note the place was dead for the most part!   Tell me again why they would charge 5 bucks for chips and salsa?  C'mon chips and salsa on a plate with chips laid out in a color coordination? Please!  Isnt this a sports-bar!?.  My friend ordered half dozen wings. Presentation was real lame.  My friend and i left and went over to goldies. Much warmer spot to hang out..  So between the manager, food presentation and price.. For us its not worth the visit."}
{"text":"Wings are good but that's about it. We've been there 3 times and had the same server twice. The server was horrible both times. One of our visits there they were very slow so we thought we'd have her undivided attention but that wasn't the case. Some of her friends showed up and she actually SAT at their table with them and ignored us. We had to ask one of the manager/owners for our check. He was very nice and extremely helpful. If they got rid of this waitress the service could be good. The burger I ordered tasted like it had been frozen. Fresh ingredients and good service are the key to getting repeat business in my opinion."}
{"text":"This place sucks ASS!!! The food SUCKS and they only got me in the place through misleading advertising a happy hour that they lead you to believe is one thing, you order what you THINK is on HR and then...WAMOOOO!!! HUGE BILL the owner threatens to then call the police on you unless you pay up.......... PASS and save your money for Goldies or Zipps right up and down the street."}
{"text":"I didn't even know this place existed until I drove by it looking for a \"host\" bar for my volleyball league that plays at Scottsdale Ranch. Well, timing is everything because I got to meet Dimitri the owner who not only fielded a team for the league but agreed to be our host and he has lived up to the billing!

The bar itself is pretty cool too - lots of big screens and plenty of room to host large groups. Happy Hour deals are great and the appetizers rock! If you live in the area, you should check it out!!"}
{"text":"How ridiculous is it that my friends and I love Karaoke? It is so much fun! Versus is great because they are open late and they offer a great Karaoke service on Friday nights. My friends and I visit for Karaoke night pretty frequently. 

The food here could use some work, it really isn't my favorite. The atmosphere is fun and the waitresses are pretty nice. The first time we ever went we had this one waitress who was probably one of the coolest people on this planet, but I haven't seen her since. 

The drink specials are great and cheap. The location is pretty far for me, but I don't mind driving far for a good time."}
{"text":"Gross, sketchy, white trash, and filled with drug dealers.

Bartender can't make a margarita to save his life."}
{"text":"I love this place. Good food and super cool owners!!!"}
