{"text":"On our first night in Montreal, we stumbled onto Verses. The food is excellent, and the staff friendly. I would definitely go back. A step up from casual but no dinner jackets required."}
{"text":"My friend and I had an amazing dinner while visiting Montreal! 
Service, ambiance, food and wine were exquisite. We paid $230 for two of us (not including gratuities) but we'd never forget a wonderful time we had. 
I would definitely eat there again."}
{"text":"Service was poor and slow. When we arrived we had to wait 20mins for our reso and the hostess told us it was because the table hasn't left yet. Now I realize it probably wasn't the patrons' fault but the slow service they most likely received that caused them to leave so late. We waited over 2 hours for our main. Our reso was 8:15 and the main arrived at 11pm. We finished our drinks and we weren't asked if we wanted a second one. The table next to us spilled their glass of wine all over their plate and the waiter didn't offer to change it for them. One table was sleeping because they waited so long for their food. We complained to the manager and he said he would take care of us. When the bill arrived, nothing was \"taken care of\". It's not that I expect things to be taken off the bill but don't say it if you're not going to do it."}
{"text":"attended for the special nuit blanche 2012 menu. the food was good. nothing too memorable and no real stand outs. service was good enough.

you won't go wrong here. be prepared to pay a price though, the decor comes at a cost."}
{"text":"It was my first time at Verses Restaurant last Friday.   Me, my boss and 6 other colleagues went there to celebrate a good business deal.  

Location : This is really a nice spot.  It's big and spacious.

Meal : Very disappointing, nothing out of the ordinary.  A meal at La Belle Province would have been better and cheaper.  I ordered fish and giant shrimps.  It was really small portion !  I left the restaurant still hungry.

Service : Slow and unattentive.  I ordered coffee and pastries for desert and only got the coffee.  I don't know what happened to the pastries.  I hated the service so much that I just wanted to get the hell out of that place.  

Don't go there !"}
{"text":"One of the best restaurants in the Old Town of Montreal, we ate here primarily because we were staying at the attached hotel, the Nelligan.  

The atmosphere is very cool, especially since we sat by the window and could gawk at people as they walked by late on a busy Saturday night.

The wine list is extensive, but very expensive.  I had an excellent glass of barolo - the best glass of wine I would have in Montreal, but it cost me $21.  

The most memorable dish we had were the elk medallions, although it wouldn't be the best elk we tried in Quebec (that honor goes to the blue cheese/elk turnovers in Charlevoix).  The lobster was also very good, but not as fresh as I would have expected.  

The dessert was a delicious maple-syrup infused baba.  It was surprisingly light and subtle, although if I were ordering again, I would probably go with a different dessert option.

Definitely worth trying if you're looking for a special meal in the Old Port area.  There are a lot of touristy places a few blocks away that don't offer nearly the quality."}
{"text":"We went at Verses on a Sunday morning and tried the brunch menu. The atmosphere is good and the place is well located in the old port. Service was very good, and very friendly staff which I enjoyed. The wine list is great but can be expensive. However the food was just ok, even disappointing, it looked as it had been reheated. The food quality and presentation was just average, looked what you could expect in a snack-bar."}
{"text":"Creeps were good.  Coffee and Orange Juice excellent.  Service pretty poor, slow even when only two tables taken.  Also somewhat $$ considering."}
{"text":"Went to Montreal for a long weekend with my sister and were fortunate to stay at the Hotel Nelligan. We enjoyed an amazing dinner at Verses the second night we were in town. The service was amazing, couldn't have asked for anything better.  Our server Luc was very attentive and amidst courses gave us great recommendations for our next day of adventures. David, the sommelier had great wine recommendations and made us feel right at home. The food could also not be beat. We both loved the red tuna entree and the chocolate mousse is not to be missed. 

We enjoyed Verses so much that we went back on our third night in town to enjoy dessert, great wine and fabulous service. Don't miss this place on your trip to Montreal!"}
{"text":"Comme je vous en ai parlé précédemment, l'événement MTL à Table m'a permis d'essayer Verses, le restaurant du très chic Hôtel Nelligan, tous deux faisant partis du groupe Expérience Vieux-Montréal. Ayant conservé un bon souvenir de notre premier passage à ce resto, Mademoiselle et moi avons décidé de renouveler cette expérience, quelques mois plus tard, à l'occasion du Happening Gourmand. Résumé de deux visites mémorables.

BOUFFE (voir Photos pour une meilleur lecture)

Lors des deux événements, c'est une table d'hôte (formule que je déteste encore et toujours) à prix fixe qui était suggérée (39$ pour MàT et 37$ pour le HG), incluant entrée, plat principal et dessert.

Pour MTL à Table, on a commencé le bal avec deux délicieuses entrées, la salade de Foie Gras et le Tartare de bison fumé. Une petite préférence pour le tartare.
En effet, c'est définitivement le meilleur tartare que j'ai mangé à ce jour; bien assaisoné, avec un goût prononcé, mais pas aussi fort que celui du buf cru. Les oignons caramélisés et les chips de légumes se mariaient très bien avec le tartare.

En plat principal, j'ai choisi le Surf & turf de lotte (une des plus laides créatures sur terre) et canard effiloché, servis avec une purée de panais et légumes glacés au jus de viande. J'essayais la lotte pour la première fois et c'est vraiment gouteux et charnu pour un poisson blanc, j'en aurai repris encore et encore. Malgré la petite portion, j'ai bien été satisfait de mon plat.

Mademoiselle a également fait un bon choix avec le Filet de buf en croûte truffée à la sauce madère, accompagné de pommes Anna. La croûte truffée donne un certain kick à la viande qui était juste assez tendre.

On a terminé la soirée avec des beignets de pommes, bien croustillants, et leur sauce au chocolat. L'autre dessert fut une belle p'tite surprise...
Un magnifique plateau de mignardises, toutes de différentes sortes, venait conclure un souper réussi.

-------
Amateur de tout ce qui rapproche du chorizo et des calmars, l'entrée de Pieuvre grillée et chorizo m'a convaincu à elle seule, de retourner à Verses pour le Happening Gourmand. Servis avec une mousse de poivrons, la pieuvre était bien cuite et le chorizo savoureux. +1

De belles tranches de thon, parfaitement saisies, constituaient l'entrée de Tataki de Mademoiselle. 

Comme mets principal, j'ai opté pour le Carré d'agneau, assiette que j'évite d'habitude au resto, vu le peu de viande présente et le prix relativement élevé. Juste à repenser aux gnocchis, la réduction qui les couvrait et la croute du carré d'agneau, j'en salive encore. Une des meilleures assiettes que j'ai mangées à vie, un gros +1.

Plat de lotte enroulée de prosciutto avec des délicieuses frites de polenta pour Mlle. Plus de lotte que dans mon plat obtenu à ma première visite, et tout aussi bon.

En dessert, un Millefeuille à l'érable et whisky, pacanes caramélises et sorbet de framboises.
On reste dans le thème avec un très chic Gâteau tout chocolat et purée de kumquats.

SERVICE/AMBIANCE

Parlant de thème, Verses met l'accent sur l'élègance et la poésie. Étant annexé à l'Hôtel Nelligan, on retrouve évidemment un luxueux et somptueux décor.
 
En ce qui a trait au service, attendez-vous à un traitement \"à l'américaine\", où presque chaque membre du personel passera pour vous demander si tout va bien (il ne manquait plus que le plongeur). 
On comprend qu'ils cherchent à bien faire et impressioner en quelque sorte, mais je ne pense pas qu'il soit nécessaire de s'assurer à tout bout de bout de champ que chaque bouchée est toujours aussi bonne.
Bref, on peut apprécier ou être irrité par autant d'attention, tout dépend de vous.

COOL

- Jolis cadre, décor et mobilier
- Une vingtaine de bouteilles de vins sélectionnées offertes à 40$
- OpenTable

BOF

- Service un peu insistant
- Prix légèrement élevés sur le menu à la carte, je vous conseille toutefois de profiter des évènements gastronomiques pour aller y faire un tour, ça vaut la peine !"}
{"text":"I enjoyed my dinner immensely and think the chefs are talented.  They can do a lot more with the menu but play it safe, and I think that's a shame.  Our service was fine (especially since we were such a large group), our steaks were good and the space is comfortable.  I would recommend stopping in for dinner for a quiet evening, but I am confident they can do more with the potential there."}
{"text":"I tried it twice during Happening Gourmand event and it was awesome! The waitors are so polite and the presentation is fancy. The food was amazing! Perfect for sepcial occasions, great atomsphere. Would definitly go back."}
{"text":"Verses had always been part of my top favourites in Montreal and even though my choice of this year's main course was not their best, I would totally go back next year (and who knows, maybe even before that!). Read more on http://theforbiddenmeal.com/2015/03/17/verses-restaurant-refined-french-inspired-cuisine/"}
{"text":"It was the menu in the window that appealed to me when I walked by early in the day. It just seemed inventive. If you're a foodie, and you enjoy quality food with impeccable presentation, Verses is the place to have dinner. Specifically, I had the \"instant lobster soup\" -- don't worry, it didn't come in a can.  My entrée was seared ahi tuna with vegetables and, I think, a type of pea mayonnaise. Unfortunately, I can't remember what I had for dessert, but it too was good. This is an exceptional restaurant, easily a step above most other restaurants in Old Montreal."}
{"text":"I do not recommend Verses. 
We were disappointed by the ravioli.
Very disappointing-looking four little ravioli swimming with a couple pieces of green onion in a terrible-looking soup Looked like a plate that a five-year old put together. The menu said ravioli and lobster and lobster was only minuscule pieces inside four tiny ravioli, swimming in a very light soup, almost like salty water and pepper!
We paid a high price and left hungry.
The restaurant looked nice, but the lunch menu  choice was very limited and ravioli's presentation and quantity of food were terrible for the price we were paying.
Not what we were expecting at all.
Only one choice of dessert. 
We also asked for a type of tourtière with a croissant, not bad, but definitely not worth the money we paid.
Service was slow.
Disappointed with the Mimosa drink that they suggested, this was not worth our money.
Well located, nice decoration, but not worth the money we paid for."}
{"text":"An amazing burger.  This restaurant specializes in beef and it shows with the burger.  I think they must grind their own meat.  

The burger is juicy (but not greasy) and topped with three cheeses and perfectly cooked bacon.  The bun, which is an important part of the burger, was nicely toasted.  The fries were also good.

The atmosphere was club-like with lots of energy and color.  The service and friendliness could be a little better.  My waitress disappeared for a long period and then proceeded to tell me her troubles in the bathroom...  not appetizing when someone is serving food!  

Overall, the burger and energetic atmosphere made up for the lacking service and friendliness.  A good place in old Montreal for a nice meal."}
{"text":"Truly a memorable experience. 
The Foie Gras was among the best I've had - and I have a foie addiction. 
The truffle filet was superb and the raspberry/red pepper sorbet will be a lasting memory."}
{"text":"Not sure why there is a 3 star average. We ate here  on Jan 1 and our experience rivaled any Michelin starred experience. The bison tartare was fantastic. The blood sausage was balanced perfectly, not too much blood as to be metallic but a nice flavor and texture. The foie gras torchon was creamy and sweet. Our main course of suckling pig was well prepared with enough fat to melt  in your mouth but without being overwhelming. Our server was mindful but not overbearing and the executive chef spent 20 mins talking with us.  A great experience."}
{"text":"What a wonderful dining experience!  We dined over three hours and received small apertures like glasierre before the main course. Their menu offers all natural local vegetables, meT, and fish. I had their oysters on a half shell followed by salad and sea bass. Incredible!"}
{"text":"We enjoyed the excellent service but for the price of the food it was small servings and the food was very good not great. The wine pours are also very small. Food descriptions sound wonderful but actual courses were \"good\""}
{"text":"My friend and I went as part of the Happening Gourmand festival in Montreal. As avid foodies we had tried most of the other places on this year's list and, upon friends' enthusiastic reviews, decided to try Verses.

The restaurant is large and elegant. Standard hotel restaurant décor. Both our host and waiter were young, good-looking and gracious men (always a plus!) and our waiter kindly took our coats after showing us to our seats. 

Both my friend and I sampled from the  37$ Happening Gourmand menu. 

We both started with the Grilled octopus and chorizo with stewed potatoes and pepper sauce. The serving was tiny (1 tentacle and 1/2 chorizo with tiny cubed potatoes) but DELICIOUS. The octopus wasn't rubbery and the chorizo wasn't too smoky. The tiny potato cubes were a perfect little compliment. 

I had the Crusted rack of lamb, potato gnocchi and sautéed mushrooms as a main and was certainly not disappointed. The serving was a good size and the lamb was tender, juicy and not at all game-y. The gnocchi tasted more pre-packaged than home-made but were well-cooked and tasty nonetheless. 

Dessert was all chocolate cake with bergamote cream and candied kumquats - a tiny mousse-y confection that was rich and delicious and very well presented on the plate. 

The stand-out was their 40$ wine selection - a decent amount of varied choices listed at 40$. Our waiter listened to our preferences and recommended a great pinot noir. 

Our waiter was pleasant, attentive and knowledgeable of both the food and wine menus. 

Definitely a great pick for a Happening Gourmand menu!"}
{"text":"Highly recommended!  Great dining experience with its atmosphere, service, wine selection & food quality.  I will definitely visit again next time in town."}
{"text":"We booked our reservation at Verses because of the excellent reviews.  I can say without hesitation that the food, the ambiance and the wait staff all lived up to those appraisals.  The only reason I did not give Verses a 5th star is because we thought the portions were just too small.  If they were offering a \"tasting menu\", the portion size would have made more sense to us, especially considering the prices.  Still, let me make it eminently clear that everything we ate was delicious."}
{"text":"This restaurant, nestled in old Montreal, was in our hotel's lobby, so after a long drive from Massachusetts, we thought we'd give it a go.
The dinner menu offered about 6 appetizers and maybe 6 main course choices along with a huge wine list. 
Service was excellent, and polite, although maybe a little disorganized. 
We both had the soup, which was butternut. It was delicious. The Elk entree was quite good, and we compared it to the Filet Mignon entree which was also good but not remarkable. They were both in the same sweet barbecueish sauce.
For the price, I would have expected something maybe a little bit more involved but I still recommend this place."}
{"text":"Very nice and upscale restaurant in the old town in Montréal. 
We came here to celebrate our anniversary and had a great experience. 
Our server was Julien and he was impeccable. 
We started the evening toasting with a glass of Cannonau and Tautavel. 
The menu felt a bit limited as there were very few options to pick from, so we ordered for a burrata and a foie gras appetizer that tasted delicious. 
I had the deer as a main course while my hubby opted for the Caille soir. 
The dessert was spectacular and the presentation was very original."}
{"text":"We were very happy to find a place that served food at 11 p.m. after arriving in Montreal at 9:30 and realizing that most joints were closed. Even after knowing that Restaurant Verses would be pricey, I just said \"screw it\" and we ventured in for a late-night snack and some drinks.

Overall, the atmosphere is great and the staff is very friendly. Saturday night was pretty busy, so the slow service was expected. We had a few mojitos that were absolutely delicious and made me forget which country we were in.

And despite all the great stuff, there was only really ONE thing that scuttled this experience: when somebody asks for nachos without meat (because they're most likely, of course, a vegetarian) - you make damn sure there's no meat in that thing. And sadly, my nachos were smeared with meat. I was pretty tipsy and didn't even realize it until 3 bites in.

Sorry Restaurant Verses - a correct order would have gotten you at least a 4-star here."}
{"text":"Good service. Nice deco, comfy & cozy. Loved my entree. Main meal was duck & lentils - pretty plain & undercooked. Will not go back"}
{"text":"We made a reservation at 1215pm, made our drink and food orders right away since the place is not busy. First and only one drink came some 30 minutes later and the rest of our orders was totally forgotten. We finally got our coffee and beer after 45 minutes. Food took a long while to arrive as well, we got our food after over an hour wait and most food has gone cold. The lobster poutine is only luke warm and not hot enough to melt the big chunks of cheese curds. The egg Benedict fell off of the duck confit and over all we are not impressed with this restaurant and the service. It's a place with nice ambience but if you are hungry, try to avoid this place."}
{"text":"We stopped for dinner with two kids ages 9 and 11.  The front desk was a bit disappointing: we had to wait a really long time for the hostess to return.  Then she stopped to chat with someone ignoring us again. But once we had her attention, she was very friendly.  I ordered a red snapper (they had it with red quinoa this time, ask for red quinoa!) and it was absolutely delish.  10 out of 10.  See picture.  Chestnut soup was good (8/10), rabbit was actually some sort of pasta with rabbit mixed in and it was very yummy (10/10).  If you have kids, you have an option of three tiny burgers or pasta with butter or red sauce.  Burgers were 9/10 and fish soup (starts on b) was 7/10.  We didn't care for that broth flavor.  Atmosphere is a bit too dark.  Short work from Le Westin."}
{"text":"Out of town family members bought us a gift certificate to go to The Nelligans which is super sweet. Unfortunately we couldn't stay at hotel so opted to use the gift card for dinner here. Bad move. First the ambiance is awful. Felt like an old school cigar lounge or library. Which could be cool if done well. But it wasn't. The wait staff were kids who clearly had no clue on the food or menu. Eg we ordered the seafood platter and the server didn't know what oysters were called. When we asked for the region they were from: total blank stare. So we had that and a bottle of bubbles and cut our losses. The seafood platter was meh. Not worth the $95. But the bubbles were good!! My advice: just don't do it. Ok for a drink at the bar but otherwise save your money."}
{"text":"Came here for some drinks and dessert. The ambiance was super relaxing and cozy. We ordered drinks and 2 desserts to share between 5 people. The desserts were on the smaller side so if you have a sweet tooth, order yourself one and don't share ;). We got a Chocolat abricot and Pistache thé vert. Both were full of flavor and very delicious. Drinks were super good too. You can get dinner here as well but if you are looking for a relaxing place to have drinks and dessert, this is a great option."}
{"text":"Verses is absolutely brilliant. They are conveniently located in Old Montreal and serve an adjoining hotel. They sat my wife (and baby) and I at the perfect table (for us and other guests) on a very busy Thursday evening. The staff was very polite, accommodating, and eager to serve.
I don't know what to say about the dining experience other than it was exquisite. We had lamb tartare, scallops, veal, the fish special, and a smooth carmenere (red wine). I think this menu had been arranged for the igloo festival, and was great. My only regret is not getting the lamb chops I'd had my eye on. It's a rare occasion, but my wife out-ordered me this time.
The speed of service was very relaxed. If you're coming from the states, don't expect one course to follow immediately after another. They allow time for things to settle, and even for you to chat a bit over your wine. Don't be in a rush, and let things flow at their own pace.
Finally, the pricing. I don't think we overpaid in the least. Maybe a bit for the wine, but that is standard in the restaurant industry. The skill of preparation and presentation was certainly worth what we paid. Even with all the variety, we'd love to visit again next time we're in town."}
{"text":"If you're looking for a nice quiet place in Old Montréal with your wife or girlfriend this is the place.

You will have a nice table with lots of space, great decorations and a really nice meal make with fresh food. 

My girlfriend and I had fish (grouper) with
Quinoa, edamame red pepper and terrago oil, and my girlfriend had grouper but with butternut squash puree, kale and bacon.

The meal was  delicious and healthy, you won't have lots of food in your plate but with each bite a rainbow of flavors will touch your taste buds. 

This new kind of cuisine always fascinated me as it's really hard to enhance something like food, but with an open mind you can do marvels !

The service was also excellent. 

I recomment this excellent restaurant to anyone who wants to relax and enjoy life.




Si vous cherchez un resto pour un rendez-vous doux c'est la place dans le vieux-Montréal.

Vous obtiendrez un bonne table avec assez de place pour relaxer, un beau décor avec un excellent repas fair avec des aliments très frais.

Le repas était délicieux, bon pour la santé et imaginatif ! 

Ma blonde et moi avons commandés du poisson ( délicieux merou) moi avec du quinoa rouge, piment et huile à l' estragon. Ma copine pour sa part a eu du merou avec de la purée de courge butternut accompagné d'une poelee de choux frisée et lardon.


La nourriture était nutritive et exquise ! 
Votre assiette ne debordera pas, mais chaque bouchée apportera un arc en ciel de saveurs qui touchera vos papilles gustatives ; )

Cette nouvelle cuisine m'a toujours fascinée car rien de plus difficile que de faire du nouveau avec de la nourriture, mais avec l'esprit ouvert on peut faire des merveilles !

Le service est excellent.

Je recommande grandement ce restaurant."}
{"text":"Nous avons visité ce restaurant dans le cadre de l'évenement 'Happenings Gourmands' du vieux port et avons pu le tester en dégustant un menu 'table d'hôte' lors d'un brunch. Le staff était vraiment aux petits soins, le repas très beau sur l'assiette et délicieux, le restaurant se trouve en annexe d'un hotel et l'entrée est magnifique.
Nous y étions lors d'une tempète de neige et avons pu nous changer dans la grande salle de bain et nos manteaux et bottes stockés dans un endroit à l'entrée ce qui a été très apprécié.
Nous y retournerons pour tenter le menu du souper.
Très bel endroit pour un repas en famille ou en amoureux."}
{"text":"Every Sunday morning I crave a nice brunch & I have been very disappointed recently! Verses definitely did not disappoint me! The food was delicious especially the Eggs Benedict with foie gras! Very beautiful setting as well!"}
{"text":"So I am very on the fence about this restaurant but I wanted to be fair so I am really going to talk a lot about my family's opinions on their meals. I am a vegetarian and there just wasn't a lot for me here, which was pretty disappointing. I ordered the winter salad for an appetizer which was a plate of winter vegetables with a sweet potato mousse. This was very good but heavily salted. My husband ordered the ravioli and he liked it and my Dad ordered the fish soup and gave it mixed reviews. My mother also had the winter salad and agreed with me. I ordered what amounted to a plate of steamed vegetables with a goat cheese mousse as an entree. It was my only option and was very boring. My husband ordered filet mignon and was very pleased with his. It was cooked perfectly and was a very nice cut of meat. My mother ordered veal medallions and loved hers. My father ordered quail and enjoyed his throughly. So, I think if you were a meat eater, this would have been a great spot for you. The decor inside was very contemporary and elegant. There was a fire place located in the back of the restaurant. They have a nice wine list and the prices were pretty good for the types of food they served."}
{"text":"We chose these:
Salmon and aspic jelly amuse-bouche
Veal and whelk tartar
Octopus in duck fat confit
Tourtière with Rabbit and fillet minion
Duck
Brownie
Lemon chiffon cake

All of this was overwhelmingly delicious! Except for the duck, we felt it was a little bit over cooked, but excellently dressed.

We couldn't stop raving about the Veal and Whelk tartar. The choice of ingredients was delectable. This could have been a single meal on its own! The Tourtière was \"deconstructed\"... which was good except we were expecting the original dish.

Ambience and service was top notch!
Well, except the chairs. They seemed like discount furniture from a ski resort."}
{"text":"RE-FKN-DICULOUS!  So so good.  Get the steak, you won't regret it.  I must stop by this spot everytime.  Also, service is top tier and the most pleasant."}
{"text":"I had never dined like this before.

We had the Elk Medallian
Goat Cheese Salad
the Panacotta with Lemon and Bergamont

Everything we tried was divine. The wine was the most expensive thing and it was so so. Solid, and tasty, but I wish spending 250 on the wine would have made it taste better. 

The ambiance was exquisite. The service was great. Dessert was great. 

All in all a rock solid dining experience. I will remember that dinner for a very long time."}
{"text":"It took 2 hrs (11:30 am to 1:30 pm) to serve us brunch consisting of eggs and already prepared entrees like muffins and crotone. We have 4 children under the age of 8 so starters were ordered to satisfy them early. Oddly enough, the starters came after the kids meals were served 1 hr later. In the end the waiter paid for our coffee since the sitiation got out of hand. But even in his best efforts,m I will not be returning here for a while."}
{"text":"Great value. We'll priced decent food. Service is good. A nice place that I'm never going to get tired of."}
{"text":"We dined here with our kids. Service was great as well as the menu. The food did not disappoint. We had their full course election for two. The pea soup was excellent as was their quinoa salad. The lamb was cooked to perfection."}
{"text":"This place really knows all about service. The lady who took our reservation for my daughters engagement dinner could not have been more helpful. Unfortunately we had to cancel the original booking because of flight cancellations but when I called back on Monday to re-schedule she remembered everything about the original booking. On the night the food was excellent and the service for first class. I would recommend this restaurant to anyone. Now if only the airlines could take a leaf out of their book ............."}
{"text":"Walking by, the energy was good so we went in.  The food and service were top notch and we were pleasantly surprised to find good CA wine on the list. I was initially disappointed that the mushroom ravioli only had 3 in the serving, but I would have filled up on that because I could not have stopped myself.  While certainly not cheap, I certainly felt that this was money well spent.  A very nice evening..."}
{"text":"Awesome brunch menu with a twist! My friend and I both felt adventurous with our choice that day - I had salted pancake with poached egg, spinach and feta, the texture was very interesting and refreshing! The place is nicely decorated too!"}
{"text":"It is indeed a shame that such a nice boutique hotel like the Nelligan should have such a disappointing restaurant! We should have believed the YELP reviews.

While the restaurant was quite nice the food was poor to fair at best, the menu very limited and the prices sky high. It was twenty minutes waiting for the check before we left telling the hostess if she wanted to be paid to send the bill to our room.

The manager did call to apologize and offered to send up two glasses of Port with the bill.

We left Montreal with wonderful memories of great meals along Rue St.Paul. Unfortunately Verses was not one of them."}
{"text":"I give a 3 stars for food and 5 stars for service. The items we ordered were not memorable. The presentation was great but the the taste was bland."}
{"text":"Somewhere between a 3 and a 4 star.

Very torn on this review.  Some dishes were excellent, others just average.  

Service was excellent and ambience was sensational.  Beautiful setting, well situated in Old Montreal, and very quaint and cozy.

Very impressed with their \"20 wines under $40\" - had an outstanding Syrah from California that was sensational.  Also a great selection of scotches and they made an excellent Cosmopolitan.

As for the food, we rated as follows:
Scallops - sensational; worth trying
Octopus - very average - would avoid
Pasta - very good
Halibut - OUTSTANDING - great dish - try it!
Lobster - below average; not well prepared
Sorbet/Ice Cream - excellent

Overall great service, some great and some average food.  Worth a try, but dont set your expectations too high."}
{"text":"This is a great place.  What ambiance.  Terrific waiter who was most helpful.  Yes the portions could be larger but the quality is spot on."}
{"text":"We are picky NYers (pretty tough to impress) and we had a DELICIOUS meal here.

APPS: We had the Foie gras poutine, which we highly recommend. It had so much flavor and was the best Foie gras dish that we ever had.

ENTREE: My husband had the rabbit and was completely impressed.  He said it was perfectly braised and was by far the best rabbit he ever had. I had the Cornish game hen and it has so much flavor. The waiter actually brought out the hen and carved it in front of us, which I really liked. The sides were also delicious and completely fresh.

SERVICE: The waiter was excellent. He completely knew the ins and outs of the menu and was able to make great recommendations. He was also helpful regarding wine and dessert wine.

DESSERT: We had the Summer Camp and it was great - well executed and very tasty. Also got a dessert wine (because you have to in Montreal!)

OVERALL: I totally recommend this place for (1) romantic couples (2) business meal (3) family meal. It was one of the best places we ate in Montreal. It's kind of pricey, but not compared to NYC prices!"}
{"text":"Service was amazing. Drink meme extensive. Highly recommend the oysters. Ridiculously fresh. The vibe is super cool and the interior design is awesome."}
{"text":"Great supper!  We had the ravioli, salmon starter and beef tenderloin followed by the cheese plate and brownie with ginger ice cream!  Have nothing negative to say about our evening out. Wait staff was attentive, friendly without being overbearing."}
{"text":"Great spot to grab a glass of wine and sit by the fire. Perhaps read a little Nelligan poetry, since it is situated in the hotel that is his namesake., I really loved the wine cellar and it had a romantic vibe. I suggest the Tempranillo--smooth as can be!"}
{"text":"Eight of us came to Old Montreal for the weekend to celebrate  our special friend's birthday.  The dinner at Verses will certainly make it a time to remember forever! The décor was lovely and interesting. Starting with  our waiter, Martin, who made us feel so welcome, everything was beautifully explained in the language of your choice. You could tell Martin loved his job and tried his best to make it a wonderful experience for us.  the food was so delicious! Some of the exceptional foods we would recommend would include the Salmon  Carpaccio,,cold strawberry and melon soup, oysters, and salad Frechiers.  For main course, the tuna was incredible, cooked perfectly, bursting with flavour and presented so artistically! The Veal was melt in your mouth and so tasty. The Halibut with light Lemon sauce was also outstanding as was the Squab special of the evening. For desserts, you could not go wrong. The ones we sampled were the Puff with Hazelnut Mousse,   The Meringues with ...... Wait a minute!  you HAVE to come and try all of these for yourself!  words can not do proper justice to the delights your tast-buds will experience.  We will all be back to Verses and hope to be fortunate enough to have Martin with his ability to explain all of these culinary feasts!"}
{"text":"I initially sent this review to the restaurant only.  However, since they did not have the courtesy to even respond, I will now post it on Yelp.

We dined at Verses a Friday in November expecting excellent service and meal execution.  Neither occurred.  We were clearly an afterthought to our server, but that is the lesser of the issues.  It was the food that failed and was so extremely disappointing, especially for the price.  But, this review has nothing to do with price.  We dined at Au Pied de Cochon the previous evening and spent an equivalent amount, however the level of attentiveness and quality and execution of the dishes was so far above that of Verses.  

We had four dishes, and I would have been forgiving of one dish below expectation.  However, when 3 of the 4 are almost inedible, I feel the need to address the situation.

We started with the foie gras torchon (as expected) and the sweetbread.  The sweetbread was very minimal and completely overcooked, dry and falling apart as we attempted to eat it.  It lacked flavor and the richness typically associated with the dish.

From there we had the wild boar and the cod with poached egg.  The boar was overcooked - certainly not the medium rare we ordered - as well as tough, chewy and flavorless.  It reminded me of a cheap pork chop.  The cod was extremely overdone - dry and cold.  The 'poached' egg was hard-cooked. 

Had our server come to check on us, we would have mentioned these issues.  He did not.

Last, we ordered dessert and coffee for my husband.  Our dessert came.  The coffee arrived about 10 minutes later.  By then we had no dessert.  

There are many better options in Old Montreal than this pretentious, ill-performing restaurant."}
{"text":"I went here for a business dinner and couldn't have been more pleased. Fantastic service and a very attentive waiter who knew when to give us time to continue our meeting or check in with us. I can't say enough about the stellar French cuisine. Everything was in small portions and light, but rich and seductive favors. Verses was a wonderful treat in Montreal that I would visit again for a lovely French dinner. Merci Verses!"}
{"text":"The oysters, bloody Mary's, and crab cakes were very tasty, but our service was AWFUL and we had to ask more than once for our check. I would only suggest if you're just coming in to warm up and grab a drink at the bar."}
{"text":"D'abord, l'endroit est super beau ! Vraiment, digne de l'hôtel dans lequel il se trouve. Nous y sommes allés dans le cadre du Happening gourmand, donc le menu offert était à 30$ pour une entrée, un plat principal et un dessert, ce qui est vraiment acceptable ! Les repas étaient bons, les portions, bien que petites, sont satisfaisantes. Le seul hic est qu'en temps normal notre repas aurait coûté au moins 60$ (chaque) et ça ne vaut pas ça ! 

Je vous suggère donc d'y aller pendant le Happening gourmand!"}
{"text":"Best brunch in Montreal. Period.

My experience:
- I came here with a group of 8 ladies who'd never been to Montreal on a rainy Saturday. 
- We got a nice big table right by the window looking out onto St. Paul street. 
- Our waiter (who may or may not have been slightly intimidated by the 8 women), promptly came over and took coffee and drink orders (pushing the mimosas pretty heavily!) and explained the awesome brunch special - which is not to be missed: PAY $5 AND GET THE BRUNCH BUFFET ADDED TO YOUR MEAL (what this means: you can add coffee, a juice - orange/grapefruit, a fresh fruit selection and pastry selection - including chocolate croissants to your order). 

Food:
- I had the ham and cheese omelet which was great - and for some reason, also came with mushrooms which was nice for me because i like them but might not have been for someone else?
- The other women had combinations of omelets, eggs Benedict (the salmon option looked delicious), crepes and egg specials. Everything was apparently delicious and very well priced.

Atmosphere:
- It was quiet and the tables are well spaced. 
- The hotel lobby is really pretty and there are a few bars where you can sit if the place is busy (I'd imagine this place is fun at night).

I'll be back..."}
{"text":"Great experience, the appetizers were great especially the stuffed calamari and the foie grad poutine...on the mains, the Guinea fowl and the braised pork were the best, with the stuffed lamb taking third place...the lobster tortellini rocked as well!  Would definitely come again!"}
{"text":"Came to Verses during restaurant week (happening gourmand), was a little disappointed by the experience and truly expected better from a French restaurant at the Old Port.

We had a reservation for four people on a Saturday and basically got to try just about everything on the restaurant week menu. The atmosphere was nice, a lounge/bar area is at the entrance and over to the left side is the dining area. The maitre d and the wait staff wasn't all that warm and welcoming. There were only a few tables occupied so the slow service was dazzling, especially when we were finished and prepared to leave, we must have waited for someone to come and bring us the check for 20 minutes.

There are 2 sides of the restaurant menu, one is a 3 course for $27 menu and another is a 3 course for $37 menu. Some dishes requires an additional (+$) which is indicated next to the menu item.

For appetizer, we got the foie gras, tuna tataki, octopus with squid, and bison carpaccio. I had the tuna tataki and had a taste of all the other three, the tuna tataki sauce is slightly oily and blend for me, the cut is rather thick and the taste of tuna isn't so pronounced. I also had a strange white sauce on the plate, which tasted like paste. The octopus dish with potato is pretty savory and well made. Foie gras melts in your mouth but for some extra $$, although definitely not anywhere close to the best I've had. For the main dish, we got surf and turf (soft shell crab with short ribs), duck leg with couscous and lamb chops. I had the surf and turf, the dish wasn't so pretty on the plate but the soft shell crab tasted amazing, juicy tender and well seasoned, not over fried or oily. The short rib tasted okay, nothing extraordinary, tender but perhaps a little overdone on the sauce. The duck leg was quite a bit salty and the lamb chop, though prettily entertained on the plate, it was blend and the flavor did not match up to it. For the dessert portion, I had an AMAZING grapefruit sorbet. A swan was made out of sugar to sit on top of a triangular piece of sorbet (easily mistaken for a watermelon), some fresh grapefruit and a small piece of pastry on the side. The sorbet was refreshing, an intricate balance between the slight bitterness and sourness of the grapefruit along with its ultra smooth consistency. It was perfect for a fruit lover like me. The chocolate mousse with fancy gold flakes was pretty standard and the dessert sampler (also for extra $$) came with a variety of small size pastries. Also tasted quite standard.

All in all, it was an okay experience but definitely expected much more."}
{"text":"Great food and great service! As non Canadian and non french speaking tourists in Montreal, the servers were so accommodating, especially as my daughter attempted to order things in French. The filet mingnon and beers were great, and I would highly recommend any of the locales. We just wish someone had informed us that the sauces are quite a bit extra for what they are."}
{"text":"This was the second time we went to this restaurant.  The first time impressed us so much we figured we would go again.  The second time was even more impressive than the first time.  The service is top rate.  It perfectly balances friendly & professional.  Our waiter selected a  wine that went perfectly with our meal.  The meal we had blew us away.  Steak with a madeira sauce, probably one of the best steaks I've ever had.  Foie gras potine that was the perfect size for one person.  Though we split it and were still satisfied.  We will definitely be coming here again!"}
{"text":"we had excellent brunch.  my eggs with fresh maple ham were excellent with lovely potato and salad side.  Others had Poutine with lobster which was a hit and a great salad.  Service was really nice. Comfortable.  You could talk easily."}
{"text":"Whatever you do, don't order a dirty martini.

Definitely a Lost In Translation moment at this cute little cafe. When ordering a vodka martini with extra olives, I expect a cocktail served \"up\" with a toothpick of extra green garnishment. 

Not the case. This was quite possibly the most unique martini I've ever had. Read the menu more closely and it's really a vodka-laden white sangria. And they added a layer of chopped up olive bits at the bottom, per my request. No wonder our server gave me a strange look when ordering.

The first two gulps were tolerable, but as the salty met the sweet, it wasn't good. The house sangria in a pitcher is way better!"}
{"text":"Service 10 stars !!! Food very creative !!! We ordered about 10 things off the menu and everything was really delicious !!! Foie gras cold and hot was amazing , each good portion for one person ! But I cant get over the waiter how much passion he has for food and he took all the time in the world to explain everything !!! 
Thank you Martin !!! Best experience I've ever had in the restaurant !!!"}
{"text":"Verses is located in the Hotel Nelligan right in the heart of Old Montreal.  I have to admit that I'm always hesitant to eat at hotel restaurants especially in Montreal.  That being said when Happening Gourmand was on my friend and I decided to come here and give it a go.  It turned out to be a great experience finally.

I started with a bison tartare which was a tad too dry even after the egg yolk had been mixed in but it was still pretty decent.  That was followed up with an herb lasagna with lobster and saffron bisque.  They didn't skimp on the lobster which was very welcome and I enjoyed the bisque immensely.   Dessert was a dark chocolate banana dacquoise with hazelnuts which was pretty good.  The portion size was perfect.  At the end of the meal I felt full but not like I had overdone it.  

We also decided to finish dinner off with a cocktail.  They had a special one for Happening Gourmand which was cheaper than the usual ones on the menu.  The cocktails are pricey but they are quite strong.  I'm not sure though I would pay the non-discounted price for one though. 

Service was slow but our server did apologize for it and when he was with us he was very attentive.  It turned out that they were short-staffed that night so one waiter was responsible for more tables than usual.  He was incredibly welcoming and friendly and he did a good job despite the circumstances."}
{"text":"I went here with my partner on a Sunday night. We arrived around 8:45 and was greeted by a super friendly hostess. She had us wait at the bar for a few minutes while our table was being cleaned. This restaurant is in a boutique hotel and has a wonderful ambiance. Their staff are very well trained as all of them were extremely helpful and nice. Once we were seated, we were served an amuse-Bouche, which was small but good and a basket of bread. The bread wasn't the freshest but it was fine. For our meals, we ordered from the bar menu for appetizers. We got the spicy chips and the salad. We found the chips to be really bland so we told the waiter who quickly took them away and told us there would be no charge. The salad, however, was one of the best I've ever tasted. For our mains, we shared the filet mignon and the basil pasta dish. The pasta was good but the steak was absolutely delicious. The potatoes and vegetables that were served with it were so good, my partner did not want to share with me.
For dessert, we ordered the \"summer memories\" which was a banana milkshake, a homemade ice cream sandwich and a smore. It was a really sophisticated and pretty desert but wasn't amazing. If I were you, I would just order more food and skip dessert there.

The service was incredible from our waiter Maxime. He was so professional and kind. For example, when I accidentally spilled the milkshake, he got me a replacement so quickly I barely had time to blink. He was really a pleasure.

Overall, I would love to come here for a fancy (and slightly overpriced) meal. 

Food 4.5/5
Price 4/5
Service 5/5
Ambiance 5/5"}
{"text":"Mon copain et moi nous sommes rendus au Verses vendredi dernier, dans le cadre du Happening Gourmand. Nous nous sommes donc rendus au restaurant vers 19h alors que notre réservation était à 20h, mais la table était libre alors on a pu s'y asseoir en arrivant. Dès qu'on entre, on constate que l'endroit est assez chic. L'ambiance est tamisée et peu bruyante. C'est parfait pour une soirée d'amoureux  Même si ce n'était pas inclus dans le menu du Happening Gourmand, nous avons débuté le repas avec un cocktail. Les cocktails étaient tous à 14$, ce qui est relativement cher. Il faut toutefois s'en attendre : nous sommes dans un restaurant chic, un restaurant d'hôtel en plus! Niveau goût sur nos boissons, rien à redire!
Pour les plats, j'ai choisi le menu 3 services à 29$ et mon copain a choisi le menu 3 services à 39$. Tout avait l'air bon, difficile de choisir! Voici donc la description de nos plats et ce qu'on en a pensé!

Menu 29$
Entrée :
Carpaccio de thon avec guimauve au jalapeno et basilic : J'ai aimé mon entrée, toute en légèreté et en finesse. La guimauve au jalapeno est surprenant et déstabilisante, mais ajoute une touche intéressante.

Plat principal :
Gnocchis aux truffes et autres champignons : Parfait pour les VRAIS amateurs de champignons! Les gnocchis contiennent de la pâte de truffes et le plat déborde de champignons. Les saveurs sont très intenses, mais la amateurs seront comblés. 

Dessert :
Île flottante aux petits fruits : Le plat qui m'a le moins plu. J'ai bien aimé la petite salsa de fruits, mais la touche de poivre m'a déplu. La glace au fruit de la passion était réussie, mais les blancs d'ufs montés en neige qui contiennent une framboise à l'intérieur m'a laissé indifférente.

Menu 39$
Entrée :
Raviolis aux champignons et beurre à la sauge : À mon avis, le meilleur plat de la soirée! Rien à redire! 

Plat principal :
Mac&Cheese d'orzo aux crevettes nordiques et petits pois : Plat très intéressant! Le plat était crémeux, mais les petits pois qui explosent sous la dent apportent une texture très intéressante. Les saveurs étaient bien présentes. Ce n'est pas un plat qui sort de l'ordinaire par son originalité, mais c'est très réconfortant et goûteux! 

Dessert :
Mille-feuille aux marrons : La comparaison avec le Passion Flakie est incontournable et c'est ce qui a convaincu mon copain d'essayer ce dessert. D'emblée, je n'ai pas beaucoup les marrons, mais je reconnais que le dessert était bien exécuté. La pâte feuilletée était parfaite.
Tout au long de la soirée, nous avons eu un excellent service. Nous ne nous sommes pas sentis pressés même si nous avons passé plusieurs heures à table. Merci Martin!

Je recommande ce resto pour une soirée d'amoureux durant laquelle on veut goûter à des plats parfois simples, mais parfaitement exécutés, et parfois plus complexe et surprenant, mais qui vous raviront tout autant. L'ensemble des plats est constitué d'ingrédients de qualité et ça parait. EXIT la croyance selon laquelle les restos d'hôtels ne valent pas le déplacement!"}
{"text":"I came once a couple of years ago during happening gourmand but didn't remember what I had there. This time we missed happening gourmand by about a week but the portions are smaller and the waiter was telling us the desserts were not that good and the place was always packed with people. 

Everything looked good on the menu except for maybe the seal tataki which is very unusual to me .I'm on antibiotics and a lot of the mains had dairy so I was a bit limited on what I could order. I ate three rolls of olive bread before my main arrived  because it was warm and I was hungry.  I had the lamb and it was very good ! I asked for medium rare and it was perfectly cooked. It was breaded and stuffed with artichoke and piquillos pepper, there was some garlic cream,marinated turnip, roasted cippolini onions, and squid ink on the plate. The piquillos pepper is not spicy. The lamb was nicely presented. I think if I hadn't eaten all that bread I would have been hungry after because the portion was small.  So if you have an appetite get an entree and a main. My cousin had the tagliatelle carbonara. It was homemade fresh pasta with garlic, parmesan, anchovies, and braisedpork. I tried some and it was delicious and her plate was a good size. She definitely did not need an entree. The waiter, Chris, was very funny and friendly. I recommend this restaurant! I think it would be good for a fancy date or for a business meeting."}
{"text":"Worse restaurant I have ever eaten at!Minuscule portions, drinks not memorable at all, and very pricey for the quality of food. I would not recommend this place to an enemy."}
{"text":"Peu de surprises cette fois pour le lunch. On va pas se plaindre de la qualité de l'assiette, ça non mais je dois admettre que j'ai été un brin déçu du service. J'imagine qu'il y a deux types de lunchers, ceux qui sont là pour le plaisir et ceux qui sont là par affaires et pour le plaisir. C'était notre cas et franchement, c'était trop long, il a fallu insister pour accélérer la cadence. Tout ça pour une prime de la rue St-Paul assez significative. Je ne veux pas être négatif mais mettre en perspective."}
{"text":"Tres bon brunch, bcp bcp de places en arriere, tres belle decoration  , bon service , un peu froid à mon gout mais je peux y retourner sans probleme."}
