{"text":"Quaint little mom and pop diner offering traditional breakfast foods at an affordable price. Best corned beef hash in town! Service is always quick and friendly. My favorite part about Vicki's is the seasonal dishes. Their pumpkin pancakes in the fall are a must try!"}
{"text":"If you don't mind waiting 45 minutes in an empty diner for eggs.....wth..... I still haven't gotten my food!......beyond ridiculous.....

Ok finally got my meal.....dirty eggs.....they need to clean their flat....bacon soggy and cold......no butter....margarine every where...I asked for crispy potatoes..... Not even close.....aweful experience....."}
{"text":"best breakfast on the west side. family own. home cook hot off the grill friendly wait staff the owners daughter works on Sunday mornings

a must to try"}
{"text":"Nice people run this little diner.  It's very clean.  Service is very good.  Food is served piping hot.  Great place for a really good breakfast at a great price.  For $4.99 I get 2 slices of toast, 2 eggs prepped any way I like, 2 slices of bacon or 2 sausages and some darned good home fries.  Home fries taste like they are made from fresh boiled, chilled, then sliced & fried potatoes--not shredded hash browns and not a frozen food item.  Coffee is good, & at 1.99 a cup w/free refills, priced right.  Good omelets here, as well."}
{"text":"This place is a dive. Nice people, mediocre breakfast. Only patron at the time. That should of been a clue. I would not waste time there again. The place had boxes stored on tables was unkempt. I do not recommend!!!"}
{"text":"Where's the meat in that gravy?
Ordered their touted sausage gravy and for the life of me I couldn't find a piece of sausage in the bowl. ALL gravy, flour and milk. $5.39 for a bowl of flour and gravy! Never, never again."}
{"text":"Below average service & food, could have made these items at home just as easily & quickly. Ordered biscuits & gravy (doughy biscuits), corn beef hash (small portion) & no flavor in blueberry pancakes."}
{"text":"What is all the hype about - a total dive.  I should have known when there was 1 car in the parking lot, but we went in anyway.  I refused to even try the food it just didn't look clean, but drank coffee, again not that great.  Husband had eggs and sausage - mediocre at best.  Just totally baffled..."}
{"text":"It wasn't good but it wasn't bad. Little hole in the wall. Same quality of food I'd cook at home. Ordered corned beef hash with eggs, home fries and toast and an order of French toast for the table Served about 3 tablespoons of canned hash, 2 medium sized properly prepared over easy eggs, decent home fries. Great toast! Loved the toast! Thick rye bread! French toast was ok. Nothing great or bad. Overall it was good or bad but it's definitely over priced I could have cooked this for $10 at home and our bill was $40. Not a favorite, probably wouldn't be back."}
