{"text":"This is a cute little old style diner place. It gets pretty packed for lunch, and its no surprise with their fresh, good quality food. I've tried the fish and chips, the chicken salad sandwich( a little on the sweet side but still good), and the burger and they were all great for the price. The home fries are possibly the best I've had in Toronto, even though i'm not a big fan of homefries. 
When I feel like a good lunch, and dont care about being too concious of the calories, this is where i go. The breakfast looks great, and i plan on going here with a paper one day before work as soon as i can manage to get out of my apartment early."}
{"text":"I wish that I could give this place a 4/5 star, but I just can't. I have been coming here for probably my entire life (I'm around 30 years old) and I have seen a great diner turn to an average diner to a mediocre diner to now what I think is an abomonation.

25 years ago when you ordered a roast beef or corned beef sandwich, it was made with fresh bread and stuffed  with so much meat, you can barely hold onto it (think of Katz Deli). Then it happened, I don't know if it is greed or stupidity, but the portions got smaller and smaller while the price went higher and higher. About 10 years ago, the roast beef was average sized, but I had to pay for an above average price. I still came here for the nostalgia. Now, the sandwiches (if you can call it that) are so empty and barren that parts of the top and bottom bread touched each other without any meat in between. The portions is less than Drexy's at the Eaton Centre. On top of that, the bread was not even fresh.

Years ago when I came here for lunch here, I had to wait to get a seat if you even got one. Last week, at 12:15 noon, we got a seat without any waiting what-so-ever. I don't know if they changed ownership or the owners just got cheap.

This place is a letdown. I used to come here twice a week just to get my fix ,and now I come here never. Service is still great, but who cares when the food is no good."}
{"text":"Hmmm, maybe actually 3.5 stars.

Popped in here after a 15 hour fast for bloodwork, so I was hungry.  Hope that doesn't bias my review.

Ordered the usual, eggs over easy, homefries, toast and coffee.

It's hard to ruin fried eggs over easy, and they didn't.  They serve 2 large eggs here.  The home fries were pretty good...well cooked, but firm enough to distinguish them as potatoes...not a spiced and fried mash.  The whole wheat toast was a step above brown Wonder bread, the choice of many local diners, so a bonus .5 stars for that.

Coffee was typical diner coffee...not great.  My only service beef is that the (mediocre) coffee wasn't offered freely...I always had to request refills from the waitress.

Another tip...sitting at the counter is cool, but there is very little knee room (I'm 6'1\").  Luckily, I ran into an acquaintance, which gave me an excuse to turn sideways while enjoying the conversation."}
{"text":"Went for a weekday breakfast. The place looks like it has been there forever - actually 1973 which in terms of the restaurant business is forever so they must be doing something right not to have been converted to a Starbucks, Hortons or other faceless corporate entity. Not too busy around 9 am. Service was friendly and attentive. Scrambled eggs were a little overcooked but peameal bacon was excellent and I loved that they had rye toast as an option although at a ten cent upcharge. Bottomless coffee. Nothing exceptional but recommended for a reasonably priced and filling breakfast in the core. Not quite up to my old fave and now gone Shopsy's on Front where you could get a plate of corned beef hash that kept you going all day. My quest for a better breakfast downtown continues..."}
{"text":"Review below, first a short, semi-related diatribe:

If you're an Early Bird, be a hetrosexual.  That's what I've learned.  This morning, I found myself on the southwestern outskirts of the Gay Ghetto.  I decided that there must be somewhere nearby worth trying.  My first stop was Bulldog Cafe, which has some great reviews.  Unfortunately, at 7:28am, it's closed.  Hmmf, I think, expecting that coffee is a morning kinda thing, and therefore, odd time of day to be closed.  So, I check my Yelp iphone app for another neighbouring haunt.  Ah \"Daybreak Cafe\".  Now surely, you open early if your name is Daybreak.  Nope, closed at 7:35am.  Hmmf!

I saunter towards my tried and true favourite, Victoria Restaurant.  On the way, I pass the Senator, which is open for breakfast at 7:30.  But I tried that a few weeks ago, and found that while it's a great spot, it's not so great at that time of day, as all the plates, cups, counters, etc are near freezing at that time, and coffee and food both cool down too quickly.  

So, it's onward to Victoria Restaurant, where I've been a faithful customer for many years.  Peameal bacon, which is often overcooked or god forbid, steamed, is done perfectly every time at Victoria.  Eggs must be jumbo sized.  Home fried potatoes are always well browned and never meally.  The coffee is fresh, hot and plentiful.  Service is always fast and friendly.  The place is never too warm nor too cold, there's never a radio that's too loud, there's no shouting from the kitchen, the tables are never tippy or unclean.  Despite the dated decor and aged wall-mounted menu, this place is maintains high standards in every sense of the word.

At lunch, the place is hopping.  Grilled cheese and fries is a perfect winter comfort lunch.  Club sandwich has no surprises nor disappointments. 

In short, Victoria Restaurant is a superb little cafe."}
{"text":"Eating at Victoria restaurant gives me two shots of nostalgia. For starters, it's it casual city diner. There's ugly wallpaper and pink and blue vinyl swivel stools at the counter-nothing fancy but a definite old school vibe. And in another manner, the diner reminds me of the family restaurant I grew up with. There's the same triple slot blast from the past green milkshake machine we had in our joint and the line cooks in their simple whites and paper hats reminds me of my dad manning the grill. At any rate, when I walk into Victoria restaurant I get a feel for a different time and place.

The food is solid here as well for diner fare. A varied lots comes here for breakfast and lunch: blue collar workers, suits, health care workers from nearby St. Mikes. 

They pump out tasty and big BLT's, the club sandwich here has real roast chicken (a must for any true club) and the fish and chips though batter heavy features thick halibut. Not bad for a diner! Fries are frozen but I enjoy them all the same because they are thick cut and you get a good batch with most of the dishes here. There's also tangy coleslaw and a nice slab of pickle with most orders-something to cut down the grease. As if!"}
{"text":"I wouldn't call it a \"diner style\"
it IS a diner the old fashioned kind which are on the decline

it probably has lost its luster over the years but I just love it

just love sitting at a counter  and it is a place to go if you are prepared to eat a lot

Victoria Restaurant RIP"}
{"text":"What's the hoopla? I just don't get it. I waited 15 minutes to get my lunch today...a banquet burger (fake cheese and greasy bacon) and fries that were hard as rocks. The place is a dive...not in a kitchy way either...just looks dirty, dark and uncool. The waitress kept pacing back and forth, apologizing for the delay. I sat at the counter hoping for more of an experience...what I got was an earthquake (which this place robbed me of feeling...seriously, didn't feel a thing), ok food, apologetic service and grunge. OMG, the guy cleaning dishes looked like he needed to be put in the dishwasher...are you kidding me, this guy works in the kitchen. Yuch. His uniform and apron looked like he hasn't washed them since the late 1970s. So long Victoria Restaurant."}
