{"text":"Cute little place tucked away at the back of the parking lot. They have really made improvements to the interior so it looks a bit more updated. The food is always good. I happen to like the prices here a lot you get a good helping of food and you don't end up paying through the nose for it.

Over all a great place to sit and eat a meal. They are never super busy so food always comes out hot and fresh. Nice amount of space and booths that are closed in making it a more private dining experience. Staff can be a bit slow to fill water / refill a beverage. You have to catch them when they are bringing your food other wise you probably won't see them again till you leave."}
{"text":"I am so sad that they changed alot of their menu prices. They said it was because of the new highschool that opened next door, they had to raise prices.  I guess the 4 kids were sharing one dish and stayed for 2 hours.  Thanks future leaders of our world for ruining my good experience."}
{"text":"3.5 Stars. It ain't fancy digs but the food is tasty, generous and way more affordable than the short walk or drive to Chinook Mall. Helpful staff as well. Has the feel of a small town restaurant. This is my second visit and I'll likely return. This would not be my first choice for a special dinner and night out on the town. However, if driving, walking or cycling by, Viet Hai may satisfy you."}
{"text":"Work has been busy the past few days that I don't have time to cook. Luckily, Viet Hai delivers. They don't have the fanciest food but their items are priced just right and provide really good delivery service (they charge 4 dollars for delivery).

I always order no 79 - Grilled Porkchop, Egg Meat Pie over rice. The pork chop is really flavorful and but their serving of the pork is inconsistent, sometimes I get just 1 pork sometimes 2. The egg meat pie is also tasty (i think it's the same mixture they use in their fried rolls. 

Their Phos are quite good too but I think i've had better from other places. The best part of their pho is the broth but I guess it wouldn't hurt to improve the texture of the beef and noodles. 

For dessert they only have fried banana spring roll with ice cream. They should probably add more desserts to their menu cos the banana roll wasn't sweet enough to be a dessert."}
