{"text":"Visited twice and had the beef sate sub and lemongrass chicken vermicelli respectively, vermicelli was decent but the sub was lacking in flavour and the bread was soggy. Never seen the place overly busy either, the place works in a pinch but pales in comparison to Pho Huong Viet just a couple blocks away"}
{"text":"Tiny portions , try to ask if what I received was normal and the guy laughed at me .
Tiny amount of noodles , and tiny amount of veg for a vermicelli bowl.

It was funny how they were cheap with the filler foods but decent with the toppings .

Strangely all the food I saw delivered to other tables seemed reasonable amount of food , yet my vermicelli bowl was less that 1/2 full.

Pretty sad when after just eating a lol meal a person needs to go buy a burger."}
{"text":"We went to this place a few time in the past and I ordered the same menu, Vietsub Beef Sate Soup (no.1 on the menu), a few time as well. Of all those few occasions, the soup was not hot enough it was just warm, at least it was hot but not to the point where it should be really hot especially because they put raw beef meat into it. Ideally the soup has to be boiling in order to have the meat to be properly cooked. 

I spoke with one of the co-owner who told me that he will address the issue. The next time I went there, I order the same menu and still has to face with the same issue. I spoke with the other co-owner and his son (who is also working in the kitchen) about this issue and they seems welcome the issue that I brought to them. They invite me to come to the kitchen to show me where the soup is being kept in the big pot which according to them prevent them to put the fire at maximum level because it'll cause an overflow and told me that next time, instead of pouring the soup directly from the big pot onto a bowl, they will put a little soup onto small pot first to make it boiled.

Today, I ordered the same menu and I can see that the soup is now much hotter. The co-owner son (whom I spoke with) was there and I approach him to let him know that his soup hotness level is much better than the last time. However, as soon as I asked him if he remember our conversation with him and his father, this guy quickly said that he don't remember and that his father is not there at the time and he left to the kitchen right away.

I was surprised by his reaction. I was expecting that he would try to remember which event I was talking about (and asked me what was the conversation about) but instead, it seems like he was ready to say that he don't remember and quickly left me to end the conversation. My understanding of what really happened: he knew and remember about me but for fear of hearing/facing a complaint, he decided to avoiding me by quickly saying that he don't remember and left me right away.

The irony in this story is, I wasn't planning to complaint, I was planning to praise them for doing a good job!!"}
{"text":"What a huge disappointment compared to previous owners quality and taste. We ate here 1 - 2 times a week for years, but won't go back again. If you like the satay beef skewers they reduced the amount of meat on each to half the skewer. Went back to previous owners main restaurant and the quality again was top notch. Go to Pho Huong viet noodle house to get great authentic Vietnamese food. The amount of food you get per order is way more that Viet sub."}
{"text":"Straight to the point, no frills Vietnamese! The little spot has your typical Vietnamese selection from Pho to Banh Mi to Bun dishes. All are pretty consistent in quality and preparation time. Very reasonably priced as well.

HIghly recommended spot for a quick bite to eat!"}
{"text":"Definitely going back again!

Great portion size, really good authentic Vietnamese food. Super friendly owner. Good prices."}
{"text":"Um, yum for cheap! One of the best places in the city for a very reasonably priced bite. It's not your usual viet sub place, since the owners appear to be Korean and there is a large variety of Korean fare as well (no complaints here!). 

Clean booths, quite spacious, quick and upbeat service, great value ."}
{"text":"Take out review!
The Curry chicken with steamed rice and veg - A+++. Will come back for this often as long as I live. What a great find on such a huge menu. The curry was just perfect, the rice was tender and the chicken was shredded breast meat. Great value for under $10.
Vermicelli with BBQ pork, beef, chicken and prawns if you cannot make up your meaty-mind! It was recommended by staff. $12 or so.
Fusion food of Korean, Japanese, Vietnamese.
Friendly service, plenty of parking out front. (lot)
Food goes a long way, huge containers!"}
{"text":"We ordered a chicken and grilled pork sub, sans cilantro. The pork had a nice bbq taste to it. The chicken version was more of a substantial sub (i.e. more meat) than the pork. I could taste some peanuts in the mixture of a cubed cucumber, hot peppers and onions. Personally, I'd like more veggies but the flavour was there. The baguette was quite crusty on the outside. Best deal in town - $5.00 for a 10 inch plus a pop = $5.75. I am curious to try the vermicelli bowls. Friendly staff."}
{"text":"This is a great sandwich for $6! If I'm near the mall, this is my top choice for a quick lunch in the area.

The place looks pretty clean with table seating, cushion-less wood booths and a large menu board with an intimidatingly large amount of Vietnamese food for you ordering pleasure. Given the name of the place and my complete unwillingness to read when I'm hungry, I went with a chicken and beef sate Sub. See? I couldn't even decide between beef or chicken! Weighing in at $6.75, this is the most expensive sub on the board.

The baguettes are fresh tasting and delicious. The meat is a little oily for my preference but still dang tasty in kind of a guilty pleasure kind of way. They load them with fresh vegetables and I think this is the real standout for Viet Sub Express. Fresh cucumber, good quality cilantro, crispy carrots and fresh jalepenos.  Good ingredients is really the key with a quality vietnamese sub and for the price, they do a great job."}
{"text":"I give five stars because this good place don't have enough good review.

Ordered salad roll(shrimp roll), seafood noodle soup and their house special(sub + bubble tea)

Overall, its a good place to eat. Price is good and taste is good."}
{"text":"Apparently, new owner took a place and alot of korean food have been added to the menu besides existing viet food.

Fortunately, my favourite spicy pho as well as subs give me continuing satisfaction in terms of quality and price. 

Still probably the best pho in town! I can't tell you much about korean food yet."}
{"text":"First: the bad news, as Gracie C reported. As of sometime in late fall/early winter 2013, the business changed hands and is now being run by a new owner who has changed the menu. It features Korean food quite extensively. There is still some Vietnamese food featured, but many of the subs, which is the reason I visited, are now gone, including the cold cut sub. There is a new bulgogi sub, however. 

The meat was freshly grilled and everything was amazingly fresh, but they are using new non crusty rolls, which kind of detracts. Slightly higher pricing, but still a decent deal for a fairly large sandwich. Will probably still continue to visit, but it's not quite as good as it used to be. Will continue to report back on future visits. I'm hoping they don't axe the Vietnamese menu totally. I'm not sure where else to go in Calgary for good to outstanding banh mi! 

Also: their washrooms are \"closed\" so don't expect to get in them, unless you are an employee since we saw one of them use them. No idea what is going on there."}
{"text":"Great spot for a quick lunch that isn't greasy or heavy.

I've had everything on the menu and I've never been disappointed.

Take away or dine in, you're good to go.

Nice portion sizes, good taste. Their fresh juice bubble teas are quite awesome as well!
My favorite is the bulgogi beef noodle bowl set with spring rolls."}
{"text":"UPDATE as of November 2013:  
Unfortunately this location has changed management/ownership and the quality has gone down.  It's quite disappointing because it was go-to for pho and subs but we have had to switch to the PHO HUONG VIET just around the corner."}
