{"text":"In one word: disappointed. 

This place looks impressive from the outside but did not nearly meet my expectations. 

Case and point: an Italian place that overcooks their pasta. Also, the service was extremely slow and the food was expensive.

One side of the restaurant had live piano music. They did not seat us in that area last time, but I would consider a revisit for that one reason."}
{"text":"Although the outside of this restaurant looks a bit dated, the old-world service and authentic Italian cuisine found inside belies its exterior. The egg-drop soup, baked lasagna and veal Parmesan were all outstanding. On the weekends there is a piano player who really adds to the ambiance. Prices are quite reasonable with salads in the $5-6 range and entrees anywhere from $14-$24."}
{"text":"Don't let the dated décor fool you this place has authentic Italian charm flowing like a bottomless glass of your favourite wine.  

My date & I started our evening off by ordering the Antipasto Di Sorrento - I beautifully displayed selection of prosciutto, salami, pickled vegetables, cantaloupe, olives, and two types of cheese.

For my main I ordered the Vitello Alla Marsala (suggested by my date who's family has been coming to this restaurant for years) and I LOVED IT.  The wine and mushroom sauce was perfection and the serving size of the veal was fantastic.  I ordered the penne on the side with their in house made pasta sauce - just like eating at Nonna's it was great.

My date ordered the Veal chop with potatoes and vegetables.  The only thing left on his plate was the bone.

We were serenaded by a live piano performance, followed by accordion player, performing some popular Italian folk songs, as well as taking some requests.  A few groups celebrating birthdays were sung to while their cake was brought out, the lights were dimmed, it became a very intimate space with everyone in the restaurant joining in with the singing and clapping.  A few people even got up to start dancing with their loved ones beside their tables.

The owner greeted every customer as if they were family, often checking in on the tables even though his staff was always on the ball.  He also takes the time to thank everyone as they leave and make sure that they all enjoyed their evenings.  Such a classy man.  He is fluent in Italian and Spanish as I noticed he was chatting up a family a table over from us - all of which added to the authentic charm of the restaurant.

I already have plans to return again soon :)"}
{"text":"Villa Sorrento has been a staple in our family for several years now. It has great quality food, (my favourite by far is the Fettuccine sorrento which is seafood pasta - it has clams, mussels, crab, shrimp, calimari, in a tomato sauce -very delicious).
Live piano music (i believe it's weekends only) - and occasionally accordion"}
