{"text":"Dont judge this book by its cover.This was a great night out! Great atmosphere and great food! We started with the Calamari which was good. I had the penne arrabiata which was great and my boyfriend had the gnocchi bava which was Awesome! Great service and the first place we have been in Calgary where the check was not on the table bedsore we finished. We will definitely be back."}
{"text":"This family owned and operated Italian restaurant is an excellent destination for a couple or small group. 

They feature fresh food cooked in a traditional manner. 

Ask for the Sea Bass in lemon sauce!"}
{"text":"Rather average Italian fare, at a slightly higher price than justified, with little do differentiate it from other similar Italian venues. Roughly on par with Boccavino, but in a slightly more upscale venue, however Boccavino is better value for money and has more flavorful food. Tried the Calamari Napoletana for appetizer as it was listed as having a 'spicy tomato sauce' but found it surprisingly bland. My entree of veal with portabello mushrooms and vegetables in a white wine demi glace was fairly average. Would have preferred to sub pasta for the vegetables, but was put off by the additional $6 fee. My dining partner had Ravioli Al Tartufo and enjoyed the truffle sauce. Okay meal, great service, but ultimately more costly than justified."}
{"text":"It's easy to miss this gem on the east side of 17th, but you'd be missing something special. Villa Maria serves up some fine Italian cuisine in a classy and quiet atmosphere. The food is some of the best Italian I have had in the city. The service is stellar. However, what stands out the most is the beautiful acoustics. It has a quiet elegance that perfectly compliments the majestic decor making for a very pleasurable dinning experience. 

Appetizer: Cozze Alla Maria. Mussels baked to perfection, creamy sauce sweat and satisfying 

Entree: Agnelotti Alla Katia. Pasta had great texture.  Rose mushroom sauce very smooth."}
{"text":"Not much to look at from the outside, Villa Maria is a very nice, quiet dining room.  There's only one TV in the room, and it was off for the entire dinner service, which was nice.  Tonight was really quiet because it had been snowing heavily all day long, but the dining room has around 15-20 tables seating 5-6 guests each.

The service was just the way I like: prompt and courteous, and very friendly.  The menu is available online, which helps if you have particular dietary restrictions (eg. vegetarian, vegan, gluten-free, etc), and I had made my selection earlier in the day.  My Pollo Maria was very tasty, though the broccoli was perhaps a little overcooked.  I was full when finished, though not over-stuffed.  The portions could have been a touch smaller, but not too bad, really.  For dessert I had the chocolate gelato dish, called Tartufo.  It was fantastico!

Over all I would highly recommend Villa Maria for special occasions.  I personally would not take small children there, but it's up to you, really."}
{"text":"Went here before heading to YukYuks. Place was vacant at 530, and only one other group came in while we were there. Staff was pleasant, food was below average for the amount is costs. I had the penne which was little more than pasta with a bland sauce on it.

I wouldnt go back, much better places nearby"}
{"text":"Great food and really friendly staff

I enjoyed the food and wine. I enjoy going here with my parents since there is a open and warm environment. Lots and jokes and laughter"}
{"text":"After living in Calgary for almost 10 years, I had no idea this restaurant even existed!  I was pleasantly surprised after friends suggested dinner there last weekend.  

Villa Maria is a small hideaway on 17th Ave, just off Macleod Trail.  The food was authentic Italian - I had the lobster ravioli and it tasted as good as any pasta I had in Italy earlier this year!  The service wasn't over the top - the servers were all engaging and very funny.

I will definitely be back!"}
{"text":"IF you live in Calgary and haven't eaten here, YOU ARE MISSING OUT!!!
I have been coming to Calgary for visits fairly often over the last year and a half, and when I do, I try to visit the many wonderful and unique eateries around town- (not chains which is what makes this town so appealing).
Technically I would have enough options that I wouldn't have to repeat any one,  EXCEPT Villa Maria's has become a MUST!
Honestly it is the most delicious, and authentic Italian style food I have ever had.
The scampi (I have a photo posted) rocks my world!
Better tasting than lobster and the sauce is - well let's just say they could bottle it and become multi millionaires if they had someone do the marketing for them!
I am strongly suggesting you make this stop a Must on your dining tours!!!
5 golden stars!!!!"}
{"text":"For my first visit, I tried the lunch special, which began with minestrone and featured scampi in a paprika sauce. The minestrone was hearty, not overly salty, and a nice size. The main dish included 10 large, succulent shrimp cooked to perfection, with a side of pasta in meat sauce and steamed broccoli, again cooked just right. Service was friendly and attentive without being overbearing. I'll be back!"}
