{"text":"So great to see the occasional NY style pizzeria pop up amid all these chi-town \"pizza\" impersonators... Sorry, but if you think pizza is cut in squares, or it's crust should taste like a stale saltine cracker, perhaps this isn't for you.

A great street style joint with friendly staff and always a great selection ready to go, and conveniently located right next to AMC 24. Bring a messenger bag or purse and get some Vincents to go, and avoid the concession stand. Just sayin..."}
{"text":"I went here tonight since I was seeing a movie and thought it would be nice to grab something close to the theaters... I ordered a slice of pizza and my husband ordered a calzone - they brought my pizza out 15 minutes before my husbands food was done, so of course my pizza was cold by the time I started eating. The waitresses were nice enough but clearly need some training. On top of my pizza being cold, it kind of tasted like puke. We will not be coming back! I'm disappointed, I was so hoping to like this place since I come to the AMC by it so often! Do yourself a favor and skip this place, Pita Jungle is a few stores down and has much better food (I even like their pita pizzas better)!"}
{"text":"I have been back to Vincents a couple of times with no problems so I am updating my review, they also have good italian ice now."}
{"text":"The first time I went to this place, I was super hungover with a severe case of the munchies from my \"hangover cure\".  I went with 2 of my buddies, and we got a large pie with peperoni and italian sausage.  It was %*^$(%( fantastic!  But, that may have been skewed due to the copious amounts of Guinness I had the night before, and the complete lack of food for at least 18 hours.  

With that being said, I went back a couple weeks later...sober...and without the munchies, and it was absolutely amazing!  The pizza totally speaks for itself.  I love it so much, and I cannot wait to go back."}
{"text":"I ate here for the first....... And last time tonight. I ordered the lasagna and it came out barely warm. There was nothing too it at all. For twelve bucks I was expecting more. The sauce tasted like chef boyardee. It didn't even come with garlic bread. Maybe their pizza is better.  I would save your money if I were you!"}
{"text":"Best sliced cheese pizza in the Valley!! Service is amazing, and the pizza is wildly amazing! Honestly, I never thought I would like thin pizza, but this place is insanely awesome!!"}
{"text":"First time I had ever eaten here, and I can guarantee I will be back.  I was waiting for my girlfriend prior to going to a movie, and saw the blue moon (beer) sign on the window, so I decided my time would be best spent waiting in there.   I ordered a slice of a buffalo chicken (amazing), and a slice of a hawaiian style with bacon (more amazing).  Turns out they have lunch specials from 10:30 to 3:00 for a slice and a drink for $4 or $5..   or 2 slices and a drink for $6 or $7.  They do have sandwiches and pasta too.   They have beer and wine, and 7 flat screen tv's."}
{"text":"Vincent's was packed!  Everyone was craving pizza too!  The line moved so fast and with smiles. 

We really enjoyed the cheese pizza!  The crust was great and the cheese was stringyriffic!

They have \"barley pops\" on tap. They have Cannolis & Tiramisu for dessert! The menu looks awesome!  We will definitely be back to try the other great looking items!

Our only negative, which is totally personal preference,  they have Pepsi products. The kids didn't mind, but I'm particular about my soda."}
{"text":"BEST CANOLIS & PIZZA & everything else!!! I'm from New Jersey so I know good Italian and this place is sooo good. The owner is so nice and personable and gives this place the personality a real Italian place needs! When I first came I thought it would be just another \"Slices\" type pizza place and boy was I wrong, my boyfriend and I have ordered 30 canolis in the past 2days! So fresh and yummy! Don't let this places location and exterior fool you like it did me, Vincent's is authentic fresh and delicious Italian food! So happy I found it!"}
{"text":"Been here twice first time pizza was good but pricey two drinks 3 slices $16.00? Second time pizza was under cooked and fell apart when brought slice up to manager/server was hesitant to understand why I wanted a refund. Re cooked a different slice same result. 2 slices and a drink $11.00? Too pricey and not that good. The restaurant was not well kept empty dishes sat at tables for over 12 minutes. I highly recommend Barros a few blocks down really good slices. Family owned. Clean too."}
{"text":"My son and I have been here a few times after going to a movie at the AMC Theatre and we love their pizza -- reasonably prized, HUGE slices, variety of flavers.  The crust is perfect and as close to NY-style as you can get.  They have outdoor seating and they door serve beer and wine if you are so inclined.  I wish they would open a branch downtown -- seems like we are missing a good by-the-slice walk up pizza joint downtown."}
{"text":"These guys can make a great pie!

You know what I really love about them? You can walk in at any given time and they have a huge selection of slices. I am not talking about your boring pepperoni or cheese as your options, I am talking about chicken with roasted red peppers, buffalo chicken pizza, two kinds of Sicilian, white with tomato and many more.

Certainly the best pizza in Ahwatukee, though that is not saying much. They do make my top 10 in AZ.

They make a mean chicken parm slice. Grimaldi's needs to take a page out of their book to understand what chicken on a pizza is supposed to taste and look like."}
{"text":"I am a New Yorker and I approve this PIZZA.  Seriously legit - these guys know what they're doing - prob b/c they're also from NY.  

Plus they have veal parm heros - seriously like the only place in Phoenix that does that.  Good sauce, good crust, fresh cheese. (Did I mention fresh pasta?)  Seriously, this place is the ONLY thing I miss about living in Ahwatukee.

PLEASE PLEASE open a second location in Downtown Phoenix????  I'll even run it for you!"}
{"text":"The closest you'll get to NYC pizza in Phoenix. Avoid eating in the restaurant on busy Friday and Saturday nights -- they're super busy and service is incredibly slow because of it. We enjoy stopping in for a couple of slices after a matinee or ordering to go. The Sicilian is quite good, too."}
{"text":"The pizza was good but waaaayyy over priced....seriously? It costs like 6 bucks to make a whole pizza why does one slice cost that much?"}
{"text":"First off I love being able to get a slice and go. I have done that a few times. I have had 3 seperate slice times and I would say it was 2 for 3. 2 of the times I got their white pizza slice and I like that a lot but I hate the specialty slice price. It's like 4.50 or something. I know... kinda pricey. So as a result I grabbed a pepperoni slice and was not a fan at all. I grabbed the slice and was eating it while I drove. Had I been there I would have  them put it in the oven for another minute or two. Hot pizza = good; cold pizza = good. Cold and hot pizza = blech. I was waiting for a movie and decided to go back and I had the meatball sub and I was instantly back in love. I like this place and I love being able to just get a slice. It was something I got used to in Portland (you were expecting me to say New York).  The food is pretty good except for the one time. Not a fan of eating there though.... I like to grab and leave. The ambience makes me feel like leaving. Not sure if that is the intent."}
{"text":"Good pizza. The appetizer, the calamari, was probably the best thing. Out shined the pizza. We had a buffalo pizza which was good but it was definately one of those better cold kind of pizzas. Best day old pizza lol. The place was reallt busy when we got in around 630-7 ish hard to find seating. I wasn't sure what to make of the place it was like a sit down place but you had to place your order in line and there wasn't much of a wait staff. They bring u food then that it. First time in I was a bit confused but the food more than made me happy. Try the calamari."}
{"text":"$4.25 for a slice?  No lunch specials either.  Mediocre service.  Bland pizza.  Nothing to great here."}
{"text":"Great place to have pizza, watch the game, and sip on a glass of wine"}
{"text":"I had takeout from here before the owners changed and it was pretty decent.  Since the ownership changed I have been twice.  The first time it was pretty busy and the pizza was ok but nothing special. Most of it hangs out precooked Sabarro style waiting to be reheated. On the second visit the restaurant was pretty dead and the manager completely ignored me while sitting on a little chair behind the counter.  With 4 people back in the kitchen that is pretty weird.  When I got tired of being ignored. I just went next door to get some food. They don't even get points for quick pizza even though it is all precooked and hanging out in the window and they just reheat it."}
{"text":"In a pinch it worked. What can I say? Big slices, not much taste. I've had better. Was asked 3 different times if I was ready to order at front counter. Give me a chance to look over the menu first people. Ordered. Grabbed table. It was dirty. Waited for someone to clean it off. Salad was so so. Basically onion and lettuce. Not too fancy, not worth $6 for large salad. Pizza came promptly. Son's was piping hot cheese. My Margherita Pizza was just warm. Sauce was just OK. Not homemade. No real taste of garlic, basil,etc....

If you are not looking for anything special and just want a slice, this should do it."}
{"text":"This is the second time I ate at Vincent's and I'm... not sorry I ate here. The restaurant is pretty clean and the atmosphere is nice. Hailing from South Jersey, I'm obviously not a New Yorker, but I've had my share of authentic, New York-style pizza.

I ordered two slices of plain cheese, which they shuffled into the oven to reheat. The pizza crust is pretty thin, so it got pretty crispy in the oven. It wasn't bad at all, but it tasted like any Sbarro's you could find at a Mall food court. I happen to like Sbarro's, so as I said above, I wasn't sorry. The portion size was very generous, though; both slices were huge and very filling. It was just kind of hard to fold and pick up at first, due to how crispy the crust was. 

I think next time I will order a whole pie from Vincent's (especially after reading some of the other reviews on here) because I have a feeling I'm missing out by ordering premade, individual slices. This definitely isn't a bad place to stop at for lunch before a movie next door, or whenever."}
{"text":"Hands down, the best pizza in the East Valley!!!! Tastes like I'm back in New York City, that's how good the pizza is! They do all sorts of combinations and toppings. Mmmm mmmm good. The hero sandwiches and wings are good too. Located in a strip mall next to AMC movie theaters, it's a great place to go before or after the movies. And they deliver, too. Much better quality than chain pizzerias."}
{"text":"Horrible service I went in to pick up my pizza I ordered. The guy took it out of the oven and dropped it they did not offer to pay for it since it was there mistake. I had to sit for another 30 min on top of the 30 min I was waiting for the first one. They have a bunch of high school kids working here with no customer service I would not recommend this place. The owner should call me 307-256-6969"}
{"text":"Good Food, HORRIBLE SERVICE!!! 
My husband & I have been here a few times, it is right next to my work. Previous to today, we have only had pizza slices & of course Thrify's Ice Cream. EVERY TIME we go, no matter how busy(or mostly NOT busy) they are, our food takes FOREVER! Honestly, there have been times that we were the only customers in the restaurant, and everyone was standing around talking/texting and no one was working, ridiculous. Today, we had a dealchicken coupon, and when I presented it, the cashier had NO IDEA what I was talking about and did not know what to do with me. That started the frustration. The she stated that a calzone would take 30min..ok, I had an hour lunch today, so that didn't bother me too much. We also ordered stuffed shells and ice cream. WELL, as time went by, no food, no food. I even went up to the counter, told them that I was in a hurry, and asked for our stuffed shells when they were done, since I knew the calzone would take 30 min and did tell them that I was not told the same for the stuffed shells, and was confused, but stated as soon as the stuffed shells were ready, they would bring them out. Waiting, waiting, waiting...no food. I went back up again to check on food and our calzone was sitting there, I asked for it & she said she would bring it out to us. By the time we got the calzone, I had 10min to eat. 3 min before leaving, the stuffed shells came out, I told them to box it. I inhaled my food, sent the other half of food home with our 2nd meal, and told him to enjoy our ice cream. It really is too back that the staff can not get it together, because as I said, their food IS really great, but I wont go back to that lousy service."}
{"text":"I live right up the street from this place and love it. Some of the best pizza in Arizona for sure and I am a New Yorker. You can get really good deals doing a family pack, I think it was $30 for 2 large pies, garlic knots and choice of salad, sandwich, or pasta. I have ate in there too and felt the service was very good, also when waiting on a pick up order I was given a drink while I waited as it was a couple minutes for my order to be completed, a bonus is the cute waitresses too. Just writing this I am salivating and thinking about ordering some Vincents tonight.

Update - Well I like this place and get it once every week or two so I feel I am a good loyal customer but the past couple times I called at around 730pm to 8pm or so they tell me the kitchen is closed. If your hours say you close at 9 or 10pm then that is when you should shut it down, nothing like calling a place or going to a place knowing their hours and getting shot down, so disappointing. Luckily I did get my fix last night from them. Lowered 1 star because of the couple times getting shot down."}
{"text":"Great pizza. Reasonable prizes, especially for a slice. Fun location. You can even do quick curb pick-up. Only problem is sometimes you have to wait like 30minutes to get served. Once they forgot my order. Didn't even get comped or anything. Good customer service is trying to keep/get people to come back. Isn't it?"}
{"text":"Vincent's really does have New York style pizza. The closest I have had outside of my favorite Times Square slices. I have tried MANY of their pizzas but I must confess I am a sucker for anything deep dish they make. They use real cheese. There is a tidy wine selection and many beverage choices. The location next to the movie theater makes it perfect for a night out with the kids or with your honey. If you are a sports fan this may well become one favorite hot spot for you. Large wall mounted televisions will supply you if you sit inside and people watching on the patio is very amusing. You can watch everyone from Jr. High girls trying to act 17, Ahwatukee cougars over at RA, to boys smoking hookahs next door \"being cool\". 
Jerry has the personality of a talk show host ( I mean that in the best way he is so outgoing.) and the staff are very professional. There may be kids working there, but they are working. Quite impressive leadership from the employers. They want to get it right for you."}
{"text":"Mediocre pizza.

Ordered pizza for the Super Bowl and they only had half our order ready 40 minutes later. Pretty much ruined our party because there wasn't enough food. We'll get our pizza from some place more reliable next time. The pizza wasn't even that good.  I'm not sure if it's because they were busy,  or of that's how it is all the time.  But we'll stick with Venezia's or Spinato's for future pizza eating occasions."}
{"text":"Just wanted to say thanks for letting my friend and I grab a drink and enjoy the patio today! We didn't get pizza but certainly will, your service was fantastic!"}
{"text":"Actually came to the shopping complex to eat at Pita Jungle, but then we got hungry for pizza after seeing the sign. We should've went to Pita Jungle.

This place was pricey! $4.25 a specialty slice and $6 +.75 for sauce for mozzarella sticks! Seriously? We only got 6 sticks! For that price the sauce should've been included! As for taste is a \"meh.\" Not the worst I had, but far from the best. 

I'm not sure what is famous about this pizza, but I will not be back."}
{"text":"Seriously great pizza.  Friendly staff.  It's an added bonus that they usually have a Yankees game on & are very welcoming to those of us who support the Bronx Bombers.  That's not very common out here in the desert.  At the end of the day tho, the pizza is super tasty and the price is right.  Home run!!"}
{"text":"I am a pretty pleased pizza snob. The taste of the pizza is passable which is rare for AZ. The service is fast even when ordering a large pie, selection is wide and the prices are very reasonable. 

The location is a pro and a con. It is next to a movie theater. This means it makes a great meal before or snack after a evening flick. The downside is you are most likely going to walk a bit from your parking spot. 

The format is self serve. You order at the counter and they bring you your order, drinks spices etc the rest if up to you, so no need to worry about a big tip.

Is also is nice to see powdered garlic on the tables, this is a must that my NY pizza soul and it is great that I don't need to smuggle in my own garlic like I do at many other places. 

To date I have tried the plain cheese thin crust several times and I always enjoyed it. I also tried the Sicilian style (square) pizza. The Sicilian was good but not quite up to true NY standards. 

For a quick slice or cheap quality pie give it a try, why would I lie, will this rhyme ever die?"}
{"text":"Vincent's pizza is not bad, but it's certainly not tasty enough to endure the shady business practices and poor service that accompany your meal.  There are pizza joints all over town (many can be found in this area) that provide deliciously mouth-watering pizza served by courteous, professional, smiling faces.  In contrast, I would warn anyone who chooses Vincent's to expect mediocre, over-priced food served by rude, incompetent children and management that doesn't concern itself with service.  For example, during our second and last visit it appeared that staff is at liberty to overcharge customers on a whim. 

The first time we went to Vincent's we ordered two beers and a large pizza and proceeded to wait 45 minutes.  When we kindly inquired about our order one of the adolescent staff members informed us that they had accidentally served our pizza to someone else.  The pizza finally arrived fresh and rather tasty although simple and we made note of that.  Unfortunately, we also made note of the seemingly clueless staff and lack of professionalism.  

Despite our first experience with Vincent's we decided to give them one more chance this evening.  I ordered a large pepperoni pizza and two large drinks.  The girl acting as the cashier informed me of my total which was $23 and some change. I gave her $25 and then she said, \"Oh, it's actually $27\" (and some change).  I gave her the benefit of the doubt for the moment and figured I'd eventually check the receipt and correct her error.  I paid her the requested amount and she gave me my change, ripped the receipt from the register and practically sprinted off before I had a chance to ask for a copy of my receipt.  I took our drinks to the table and told my friend what had transpired.  When he inquired about the suspicious transaction, the girl he spoke with told him that \"stuff happens.\"  He noticed that management overheard the exchange but chose not to address it.  After obtaining my refund from the superfluous charge we were still not given a receipt or any form of apology.  As we quickly ate our pizza, I noticed a member of the management (or perhaps the owner) sitting at a nearby table with some apparently inebriated guests.    Lastly, as my friend approached the beverage station to refill his drink, the offending cashier cut him off and jumped ahead of him to refill her drink!  

There are so many other (service-oriented) dining options in the area including other pizza establishments so I wouldn't dare waste my time or money here again."}
{"text":"I went to Vincent's for the first time last week. I ordered the ricotta and spinach slice and a slice of Sicilian with some veggies. I can't understand how filling this pizza is- I didn't get to my Sicilian until the next day out of the fridge. While it was still tasty, I don't think it fair to review a place based on day-old cold pizza. Anyway, the ricotta and spinach slice was heaven. Then again, I like anything with ricotta. So I held off reviewing until tonight, when I went back for a cheese slice. 

Tonight... I thumbed the end of the slice and folded it in half, the same way I have been doing since I was a little girl sitting with my father at the grungy pizza shops dotting Long Island. I heard the familiar crunch of a satisfyingly crispy crust. I took a bite without any extra fixings, just because I wanted to taste the unadulterated product. I have to say that while the crust was crispy and the cheese-sauce ratio was perfect, I do think the slice was a little on the bland side. These cheese and sauce were great, so I think the issue lies with the crust. Nothing a little red pepper and garlic could not fix. 

Hubsky and I also split the eggplant rollotine. This reminded me of my mother's eggplant- the one she usually orders at Franco & Vinny's in Ft. Lauderdale (my mother in the kitchen? Ha!). Like I said before, anything with ricotta makes me happy. This was delicious. It came with a side of pasta- we got the penne at the cashier's suggestion. I'm pretty sure the pasta sauce and the pizza sauce are the same. Tasty. 

We'll be back, but I might stick to fancier slices."}
{"text":"LOVE this place. Great food, high quality ingredients (which is why i was told the prices are a bit more than your typical pizza hut), and fun service.

I love this place, and always leave happy and full. Authentic italian food is my weak spot! :)"}
{"text":"The stuffed bell pepper looked good, but I had to send it back twice to get it hot (which seems to be a theme for this restaurant) got it steamy and then had to use the seasonings at the table to make it tasty. 

This restaurant is busy due to default. It's convenient to the movie, reasonable priced and quick. 

Their lack of flavor and heat is standard. I wish they'd get a little heavier handed with the garlic & oregano. A garlic knot should clearly taste garlicky! 

Their house salad is a good deal and if you stick to a slice of pizza it's okay.

They have done some work on the interior that is an improvement and looks nice."}
{"text":"I was thirsty, and my fiance was getting her dress sized, so I dropped in to order a beer and Mozzarella Sticks. Although there weren't many sticks, they were pretty tasty.  The beer arrived at my table within a few minutes.  I'm not sure why but I wasn't really thrilled with this place.  Maybe it was the lighting, TVs, noise, or the roaming staff.  Just not my thing, I guess."}
{"text":"I could not be more dissappointed in this restaurant.  Service was horrible.  We ordered two slices of cheese pizza (that was already cooked) and a small ceasar salad.  We waited for 10 minutes, and finally 1 slice came to us and it cold.  After an additional 10 mintues I went to the counter to ask where the rest of the order was, there were no apologies I was just told that it would be right out.  Seriously, 10 minutes later I had to go to the counter again, and still it was another 5 before my salad and piece of cheese pizza were brought to the table.  I will definately not be back."}
{"text":"Pretty good pizza. Can't say its the best in az. And az is no ny. But the food is good. not great. Not sure why my waitress is sitting eatting talking with the manager while I'm sitting waiting. But I did enjoy my food."}
{"text":"Not very good.  Pizza was kind of dried out.  I can see this as a popular stop off before or after the movie theater, but there are way better options nearby."}
{"text":"Some of the best pizza around. They have local beer on tap and good wings as well. The best part is you can enjoy almost any pizza by the slice. Try the chicken Alfredo pizza or the shrimp scampi pizza!"}
{"text":"I live near Vincent's Pizza and it is also close to the AMC movie theater so a nice treat to have before or after a movie.  This is the only place in town where I can get a slice of speciality pizza  for under $5 (no red sauce/ricotta cheese/spinach) without having to order an entire large size speciality pizza (like the other pizza places in the area require).

I have ordered \"to go\" and have also ordered to eat inside and outside on the patio.  I have always had good service.  Yes, there are teenagers working there but they have always been very polite, tentative and I have never waited long to have someone take my order or serve my food.

They also have designated parking spaces in the shopping center for take out orders (nice/convenient since this shopping center is hard to find parking spaces due to the movie theater)."}
{"text":"Im was born and raised in sicily. i was aroung legit italian chefs back in my day. overall this pizza tasted just like my dads pizza in italy, pure italian pizza. the taste was awesome. TIP- order the pizza well done it tastes much better. overall A+"}
{"text":"Not too much going on here. It's not my style to compare a pizza place to Slices but that's kinda what it felt like here....only not as good. Feels weird saying that. I had a couple slices of pepperoni, which, here it comes, tasted like cardboard. and my girl had a slice of sausage and pepperoni and some kind of square margarita pizza without marinara, which was their only saving grace. It was actually pretty good.

There are too many other dining options in this area. But if I'm in the mood for sub par pizza by the slice, I might stop back in."}
{"text":"I ordered for delivery one night, a small pizza with a drink and a side. I was told it would be approximately 40-45 minutes. After waiting for an hour I get a phone call from them telling me my order wasn't put in correctly and that I'd have to start the process over. They said the pizza hadn't been made yet and that I would have to wait even longer because there were many more orders out for delivery. On top of that they said I couldn't order a small and could only order a large pizza(the menu had both listed), meaning I wouldn't just be spending more time waiting but also more money. I told the lady to forget it and hung up the phone."}
{"text":"This is some goooood pizza.... and the customer service is just as good :) 

i got there early waiting for my friend... so i sat down and right away the little blonde girl came over from behind the counter and asked me if i wanted anything ... (water with lemon lol) 

from what i saw you order from the counter.. pay.. sit down and they then bring you your food... i thought it to be a nice gesture :) especially since she didn't have to :) 

my friend finally showed up... it was grub time !! 

i had the Hawaiian and pepperoni and a side salad with ranch... 

first off the salad was amazing! red onions chopped up in it and carrots and other stuff too not like a normal side salad with iceberg lettuce and some croutons.... i was happy :) 

the pizza slices were huge.. and they were generous with the toppings :) 
the pineapples tasted awesome and my favorite part of the pizza was the crust.. :) (and that goes for any pizza.. i love bread! Italian for sure ) 

and their menu is huge... lots of choices and i like that... especially since i change my mind alot lol 

they had a bunch of flat screen TVs on the walls... with different channels on each one... i like that... who wants to watch the same game on every TV you see..!! 

i really liked the food and the atmosphere and especially the employees... they were friendly, helpful and very prompt with out food :) 

i will be back for lunch again in the future :)"}
{"text":"I've been here twice, first time was last week with a coworker. I was happy to see a well displayed $6 lunch for 2 slices and a drink...Pizza was OK, edible, not great but different, I like things mixed up a little, so different is good for me.
When my coworker sat down, she was surprised by the bill, (it was her turn to buy) because we had both bought the $6 lunch deal and we shared some zuccini sticks, but the bill was nearly $25. The zucchini was NOT $12, so what was the problem? The girl behind the counter said we had gotten a couple of premium slices, so OK.
Well today I was in the area and it sounded good, so I dropped in. I asked the girl behind the counter which slices of the several types of pizza displayed were included in the $6 lunch deal for 2 slices and a drink. She said just pick a couple and we discount it. So I picked a couple, jalapeño and pepperoni and the other was ham and pineapple..... Good to go right? Nope.... Nearly $9 at the register....
I asked what was up and she said they discounted the items I selected.... Bottom line, they could not show me any pizza that qualifies for the $6 lunch, so essentially THERE IS NO $6 LUNCH DEAL AT THIS PLACE!!!!!!!!!!!!!!!! I grabbed my credit card and left, ended up eating at the restaurant next door.
The employees are totally in the know on this scam, there was no question about it.
I DETEST DISHONESTY AND WILL NEVER RETURN TO THIS ESTABLISHMENT...
Now you know, they are dishonest and the pizza is nothing special.....
I don't like giving such a negative review, but dishonest bait and switch scams infuriate me, it's thievery.
According to my coworker, the place just changed ownership, and the owners and staff were much better before....... Shame, could have been my $6 \"go to\"lunch...."}
{"text":"the pizza's are great here.  They have nice flat panel tv's if you want to catch a game and an outdoor patio. the place is casual and friendly.

Here is the deal - grab a slice before you watch a movie in next door AMC.  thats what we always do!"}
{"text":"I love pizza.  I really don't have a better way to start a review other than me sharing my love for pizza.  Meat, cheese, and carbs all put together that also acts as its own servicing dish just seems genius to me.  I love Vincent's Pizza but their delivery service is awful.  I recommend either eating there or ordering pick up.

Meal:  I usually order the smallest of the sizes, with Italian sausage and fresh mozzarella and cannolis.   

Taste:  Vincent's has the best pizza and awesome cannolis.  Their pizza is New York style and has the right amount of \"floppiness\" to it.  Their ingredients seems to be top notch and fresh.  This is the real deal pizza.  10 out of 10.

Value:  This is expensive pizza, but I am probably the wrong the person to ask about this because once I find a pizza I love, I will pay almost anything for it.  I wish they did serve a smaller size pizza for individuals (the fiance doesn't care for New York style pizza), so that means you end up having a bunch of left over pizza. 2 out of 5.

Service/Cleanliness:  Here is why they got one star.  Their customer service is awful, awful, awful! If you ask for a pizza to be delivered, it takes well over two hours . . . even though they will wuote you that it will take a little over an hour.  One two separate occasions, the price given over the phone ends up being lower what you have to pay when it arrives to the door.  And finally, ever single time you call them asking 'where the heck is my pizza', the managers/owner always throw their own people under the bus instead of stepping up to the plate and being accountable.  Service at the physical restaurant isn't that much better either.  0 out of 10.

Atmosphere:  Very generic decorating.  Can't remember if there was music.  Could use a major overhaul.  1 out of 5.

Overall:  If the service wasn't so god awful, they would be my go to pizza place in the valley.  The taste is absolutely amazing . . . . it is in my top 3 pizza places.  But the service is so completely awful, the taste isn't work it.  13 points out of 30, 5 out of 5 stars."}
{"text":"My daughter and I visited Vincent's for lunch yesterday.  We were greeted right away. We placed our order; a slice of pizza and a chicken caesar salad. I thought the salad was overpriced. We proceeded to find a table.  My daughter received her slice of pizza pretty quickly. I had to wait a very long time for my salad. My daughter was almost done with her pizza before I my salad was brought out. I don't know if I'll give this place a second chance."}
{"text":"My first few visits here would've earned them 3 stars but this recent visit really prompted a review (and a 4-star one at that).

Just wanted a quick bite before my movie started and was SO glad to see that this place hasn't gone out of business yet. Being from NJ, my preference will always be \"mom & pop Italian\" over Mexican or burgers or Asian...

Anyway, I know their lunch specials are built around the drink (that being where you save money) so I shouldn't have been surprised about the $4.65 charge for just ONE \"Specialty Slice\" of pizza (I had a water in my purse and didn't want to fill up on soda, so I opted for no drink). Sitting there, waiting for my food, I had utterly convinced myself that this slice could NO WAY be worth the price I just paid and after it was placed in front of me, the size of it did nothing to sway that belief.
But OH, the taste!
Now, obviously taste is HIGHLY SUBJECTIVE but my oh MY! That ham & pineapple slice was so dang good that I may never order from NYPD again! It's the day after and I'm still drooling over it. Crispy crust (again, this is MY preference over soft, chewy crust) with just the right amount of \"crunch\" when I bit into it), sweet tomato sauce and lots of cheese that stretched out before me and literally pulled me back in! Just the right amount of toppings was the icing on the cake.

I have found My Perfect Slice in Arizona."}
{"text":"Awesome pizza...you can buy it by the slice or buy a whole pie.  The one complaint I'd have is there closing hours are not very consistent.  They seem to base it on how busy they are an hour before closing.  If you leave it up to the staff; I'm sure they are never busy an hour before closing.  Still brings you back to the best pizza around and I'm a regular customer from now on."}
{"text":"I'm from New York and love Italian food...wanted to try this place as my mom said it was good, we went there on Friday night about 6:30, they were busy but not slammed. We ordered a large pepperoni and mushroom pie, took about 15-20 minutes which was good, thought it was alright but not New York pizza. The wait staff was friendly, and place was clean. This place is for sure a 3 star! With that  being said, I have one complaint,I would was absolutely disgusted at how the female owner was belittling her staff, and in the seating area in front of guests.  This behavior is never acceptable and these kids were working for her business, from what I saw, she truly owes her staff an apology."}
{"text":"This is my fiances favorite pizza.  Consequently, I eat here a lot more than I would if I were on my own.  But to be sure the, pizza is pretty good.  It beats standard dominos, pizza hut, etc and I haven't been able to find pizza I like much better in town, but that bar is set pretty low in Phoenix.
The place is staffed with a bevy of young people that are relatively friendly, and the service could be worse, especially when you compare it with the kind of service you typically get from people in high school or slightly older.   I"}
{"text":"They call it \"white pizza\". Is a ricotta cheese pizza with spinach. I had a single slice about three weeks ago, and it was delicious! After searching for delivery for about an hour on Yelp, I decided to have the same kind of pizza delivered. I got an 18\" white pizza. It came out to be $24ish. Deliver fee is $2.50. I paid five dollars more than what Hungry Howies would have charged me for a large one topping pizza. 
Seriously. Yum."}
{"text":"I Love any place that I can get Lunch at 10:30am. 

Vincents has a ton of different pizza by the slice all day everyday, plus a full menu of appetizers, entrees, salads and dessert, not to mention some family meal deals and they even deliver!! 

I took advantage of their lunch menu several times already even though they just opened on August 19th. 

I've tried 4 different kinds of pizza, the garlic knots, which by the way I saw them making and actually hand knotting the dough right there, and one of their chicken Parmesan rolls which is the chicken, sauce and cheese with dough wrapped around it than baked, really really tasty! 

They have a lot to offer and I will probably gain 50 pounds if I keep going there but there is still so much more I want to try!

Check them out, they are right next to the AMC Theater on Ray Rd. and the I-10."}
{"text":"Went there again the other day as I was in the neighborhood.

SImple NY type pizza as if you would find it on the boardwalk on the jersey shore.

FANTASTIC.

I get the feeling this place will become a chain sooner than later. It is that good."}
{"text":"Well, the salad I ordered looked like it was pre made two days ago & the pizza was made a heated up ... Not good. Better out there!"}
{"text":"Well I'm sure their Pizza is good but I didn't try any of it and probably won't go back to try it. 

I got a meat ball sub and I dunno like many other people think that meatball subs come with marinara sauce. Well mine didn't, it was just meatballs and cheese. I had ordered the sub to be on garlic bread instead of the regular, there was some butter and a slight garlic smell but it lacked in taste compared to the smell and expectations of warm delicious garlic bread. I was disappointed since I have been craving a meat ball sub for days and this did nothing but just make me want another one even more. Oh and this is was a 7 dollar hero sub, It didn't quite live up to the Hero stat and price. 

We had also ordered some fried calamari and the garlic knots. The calamari was ok, nothing too crazy...  a bit bland as there was little or no seasoning on it and the marinara sauce they gave us was pretty weak in the bold flavors one would expect. The garlic knots were the same as my bread on the sub, a lot of promise but no follow through. The marinara sauce could have been a little acidic with some lemon or lime it would have helped the accompaniment with the calamari.  

All in all I give this place a 3 stars since I see there is promise in this place, a great local business run by the family that owns it. I always support local business and I have to say I hope they stick around and make some changes because I would like to see more mom and pop pizza joints in town."}
{"text":"Good pizza, nice place & the owner was very accommodating. I'm a fan."}
{"text":"I go here all the time. The girls in the front are always so nice. The pizza is terrific. Love this place!!!!!!"}
{"text":"When I'm in Ahwatukee and want to grab a quick bite before a movie next door at AMC, Vincent's is my go-to. 

This is a no frills pizza place, but damn do they deliver on taste! 

Love the huge White Slices (Spinach, healthy garnishment of Ricotta) with a pint of Blue Moon.  

You can't go wrong with the price, either, and you won't leave hungry!

The Garlic Knots were also great. 

Great customer service, too. Years ago, I met my friend here for Pizza and beers. 

When the server dropped our pizza on the floor, he comped it because of the wait time. 

Outstanding customer service! 

I heard a rumor that they closed recently. Sure hope this isn't true. Ahwatukee is the land of strip malls and  crappy chain eateries -Vincent's was a refreshing change."}
{"text":"This place has good greasy food. Service is fantastically fast."}
{"text":"This is the place for you if you want authentic NY/NJ style pizza.  The crust is the perfect thin but crispy/chewy combo that New Yorker pizza places have mastered.  We've only ever gotten a full pizza (no slices) from here, I'm guessing if you get the slices they might not be as great since they aren't right out of the oven, BUT...the full pizza is always fresh and fantastic. Their sauce is delicious with just the right amount of sweet and the toppings are fresh and tasty.   We usually get the Margherita pizza and have them add prosciutto...yum! I do notice that it's pretty cold by the time we get it home, but we usually just throw it in the oven on the pizza stone for a bit (while stuffing ourselves with the first slice or so) and warm it up.  Add a little crushed red pepper and perfecto!"}
{"text":"I have given this place 3 chances. First time I ordered Meatball Sub Platter to go. The salad was great, side pasta was good, main dish Meatball Sub was forgotten. Second chance ordered Stromboli Roll to go. Waited 30 mins roll came out and they burned it so I had to wait another 20 mins. got the food back to my work. It was complete dough they came back to replace the roll said it would be 15 mins turned out to be another 45 mins. Finally tried Meatball Sub again. Meatballs were not cooked and sub some cold. Gave up and left. I wish this place was up to par, maybe they can't handle the crowds. The flavor of the food is good but I gave them enough chances and not one good experience =("}
{"text":"I visited Vincent's the other day on a friends recommendation.  It was weird going to a restaurant where the old Underarmour store in Ahwatukee used to be.  Upon getting there I was disappointed to see that it was counter service, my friend had told me it was table service.  

There were so many pizza slice options to choose from.  If you are with a group and can agree with one flavor, it seemed like ordering a whole pizza was significantly better of a deal.  I went with a Scicilian slice and a Chicken Parm Hero.  My parents both had the meatball hero.  

I was disappointed that the beverages were Pepsi, really who is a Pepsi fan.  I know Pepsi is cheaper for the business to sell, but I truly have only ever met one or two Pepsi fans in my life.

The heroes took forever to get! The Scicilian came out after a few minutes (all they had to do was throw it in the pizza oven).  The Scicilllian crust was amazing.  Their slices are New York style, so expect the medium crust.  It took about 35 minutes to get the heroes.  Upon getting them, I was quick to notice how unimpressive the plate looked.  The sandwich looked kind of plain, there were a couple pepperchinis, & some plain potato chips they looked like they just tossed on some generic potato chips as an after thought.  After biting into the sandwich, the bread was outstanding!  The meat was decent, but the bread made the sandwich.  

I was swaying between 3 & 4, but the pizza slice and the hero bread pushed it up, although service was slow and the potato chips were not good."}
{"text":"Good choice of slices and good greek salad.  Kids can all get a slice they like."}
{"text":"Based on the reviews we wanted to check it out. Being from Brooklyn and knowing what great pizza really is,  I wanted to see for myself.
It's a counter order place which is fine for just a casual slice before a movie but not any ambience for dinner. Had couple of different slices, one Sicilian and one regular.  Nothing special on either front.  Not bad but not the texture and experience people were raving about.
Not going out of my way to go back unless maybe before a movie."}
{"text":"Wonderful dinner with family and friends.
 Excellent attentive service.
 Getting to watch Vincent toss pizza was like having dinner and a show. And our special dessert was too die for! Thank you Vincent and staff.  ~Terry-Jo"}
{"text":"I went back and it was much better this time around, although I was quite inebriated...  Two very big and good slices of pizza for a reasonalbe price.  I'll be back again.  

I still don't really care for that employee that responded to my first review..."}
{"text":"Vincent's Pizza is one of the best places that I have tried since I have lived in Arizona. 
Now this isn't one of those fancy Shmancy pizza places like Cibo or Grimaldi's. If you are looking for a good New York slice and a soda, this is the place to go in Tukee. 
They have a variety of slices waiting for you to come in and devour them. They also have entrée's which I haven't tried yet but what I have seen of them they look good also. Every time I have visited Vincent's service has always been quick and friendly.
I like the white pizza and the Neapolitan, but I particularly love the Sicilian with extra cheese. YES SIR it's Yummy, with Loads of cheese and loads of bread with a crunchy bottom. \"Forget about it\". I think I had a Mouthasim. :) 
Give this place a try and I am sure you won't be disappointed. Plus you can catch a movie before or after you eat"}
{"text":"The best eggplant ever.  Not too much Breading, delicious sauce. Try it in a sandwich or with pasta!  Manga Manga"}
{"text":"There pizza is average. The customer service us sub-par and if you enjoy ranch or any extras bring your piggy bank."}
{"text":"This is a mediocre pizza place.  Edible, but not great.  I won't throw a hissy-fit going here, but I wouldn't go out of my way to find this place."}
{"text":"Vincent's has great food, great selection, and great service and atmosphere. It reminds me of the type of quick pizza places you find back east. I tried the mushroom spinach and it was incredible- both in taste and in size. The slices are big and filling, and they are covered with a good amount of topping. The place had many different and unique pizzas which makes me want to go back and try it again. I may be more adventurous next time, and I'm sure I won't be disappointed."}
{"text":"My family LOVES this place!! The pizza's are huge and very tasty. Our favorites are the Margherita & BBQ chicken.

My husband joked about getting a job there so that he could get the recipe for their sauce... it's that good!"}
{"text":"We placed an order for delivery last weekend--large pepperoni pizza, baked ziti with eggplant, and calamari. Everything was great, especially for a delivery place. The pizza ranks up there among my favorites in Phoenix. The pasta was also very good--my wife especially loved it. The calamari was pretty darn good also (this comes from someone who dislikes seafood). Delivery only took about 40 minutes on a Saturday night. All in all I highly recommend this place. I'm giving it four stars, but if I compare it to other places offering delivery, that would move up to a five."}
{"text":"My wife and friends went for lunch the the other day and liked it so I thought I'd give it a try.  Nice place, nice menu - good selections. I had the meatball hero lunch special.  Good meatball hero (meatballs with marinara + extra for cheese to make it meatball parm) - it was good; too big for lunch - I would have been satisfied with half with a handful of chips and a deli pickle spear or peperocini on the side vs. just the hero sitting on the plate solo (hope the owner reads Yelp!).

I'll go back and try something else.  Good food, good location should do well.

Who mounted all those nice TV's in there?  Shaquille O'Neal?  You get a neck ache looking up that high!

PS - hey food runner, when you deliver a slice of pizza and it starts to slide off the plate don't use your bare hand to move the pizza - gross!  You know you saw me watch you do that too!"}
{"text":"The antipasta was good, the Buffalo chicken sandwhich was OK, the Pizza was OK,  Too bad those who had pizza were almost done by the time I got my sandwhich. Although I realize it is not a full service place, after you order they do not make you feel like you are important to them, just more of a distraction from other things they are doing....
Might stop before or after a movie, but would not go otherwise."}
{"text":"This is my go-to pizza place.  I'm from upstate NY (not NYC), but this is as close to home as I could find in AZ that delivers to my ahwatukee apartment.  There are other pizza places that I enjoy in the valley but the sauces really differentiate themselves.  I prefer this sauce since it's more like a tomato and minimal sweetness or spice.  The quality is always fantastic, friendly staff and nice variety. 

- The pizza sizes are actually very large.  The \"small\" is about the same size as a dominos large, and the \"x-large\" is just huge.
- Meatballs are large and filling as sides, you should get them.  2 comes with the order.
- The wings are my favorite of the valley and they actually come with carrots and celery.  Also, blue cheese isn't something odd for this NY place, because if you are from NY you DON'T use ranch on wings.  Also the blue cheese is great and chunky like it should be.  Also, the sauce isn't thick, maybe a little oily, but I enjoy it.  I ask for my wings to be cooked crispy and they come out perfectly.
- My family has also ordered the spaghetti dishes, and meatball subs.  Everyone was happy with the choices.
- Garlic knots are fantastic also, order plenty.  :)

If you go to the actual restaurant they sell slices, and serve beer and wine.  Great for a date night because it's next door to the AMC movie theater (Ahwatukee 24).  The service is quick, so you can get a quick bite before the movie.

Sure it's more pricey than some chain restaurant, but the quality is great, and it's a family owned restaurant.  Something we should support here in the valley."}
{"text":"I was so hopeful for a comeback....but it didn't happen

After terrible service and great pizza last time we went, my wife and mother in law returned for lunch and had a terribly overcooked, dry and tasteless chicken parmigiana sandwich. They brought some home assuming I would eat anything but could not eat this.

Off the radar for a while."}
{"text":"Very good NY style pizza, thin, chewy yet crisp crust and light sauce with lots of melty cheese."}
{"text":"My wife and I love this place. Best pizza in AZ! To start, the people here are amazing! The two owners Lee and Jerry are great! It's a family run place. All their kids and their friends work there and they ALL make you feel like family! Ive never had a bad meal, slice or experience. This has become one of weekend destinations for us and I'm sure to take all my friends here. Try the white pizza! Forget Venezia's, NYPD or any other place, YOU WON\"T GET A BETTER SLICE ANYWHERE!!!"}
{"text":"Ok..i shouldn't have but was hungry,in a hurry , and near Vincents at lunch.  I took a deep breath and hoped for satisfactory service and a great slice.  I got neither.  

There are enough staff but none to few know how to serve customers.  I ordered a slice and waited 10 minutes for it to be warmed.  Why 10 min?  They had to make sure it was burned, dried out and tasteless.  When calling my name and giving the slice, there wasn't a thanks, a hello, an enjoy...nothing. WTF?  How is that even possible?

Meanwhile, where is the manager/owner...sitting in a corner booth counting ceiling tiles.  For some reason he doesn't feel the need to EVER interact with customers or even staff.  Its the craziest thing I have seen.  

Without improvements, all of tukee will have tried this place and been disappointed.  I give them another year until someone steals the pizza guy and opens up a place with great pizza and service, consistently. 

I am going to go give my dried out pizza to the birds and get their review."}
{"text":"WAS awesome. Went tonight and it's closed. Ovens gone, packed boxes. So sad. Pizza was great but now they're closed. Staff was friendly but now they're closed. Yelp won't let me just say \"It's closed\" but it's closed. Now where can I get a good NY slice?"}
