{"text":"The Vine is one of my hangouts. May is special at the Vine because they have a special Mexican menu. Christine is a great server and is top notch.  A delicious all around  experience."}
{"text":"Ok, I am all about customer service.  And, this place does not have very good customer service.  It is sad that such an attractive, and spacious restaurant/bar with such great happy hour specials would not train their bartenders to acknowledge everyone that takes a seat at the bar.    I walked in, and was greeted by two young men, whom I noticed later were servers.  That was really nice, and I told them that I was heading to the bar.    When I arrived at the bar, it was not very packed, but not slow either.  I sat down, checked my phone, responded to two text messages, and was greeted by two gentlemen to my right before the female bartender even looked my way.  It is as if she had tunnel vision and was oblivious to the new customers who had sat down, including myself.    I finally received a napkin in front of me after almost 8 minutes, while she chatted on her cell phone.  OMG, disturbing!  Moving on, she finally asked what I wanted to drink, ok about 11 minutes into the visit (Unacceptable)!!!!!!!!!  The guys next to me also commented on how long it took for her to serve me and, from what I found out, them too.    On a positive note, their beer selection is very nice, with pints at $2.79 during happy hour 3-7 I believe.  I tried the Orange Blossom beer on tap, and fell in love.  I then enjoyed one of my new favorites, Four Peaks Amber Ale on tap.  I did not try the food, because I was heading out later in Scottsdale for some food and drinks with friends, but it did look good.  After she finished her shift, several attentive male bartenders then took care of my new guy friends and I, and thus, my night ended on a positive note."}
{"text":"This bar is straight up awesome. I've been coming here (exclusively nights) for the past two years, and it's always a good time. The drink specials are great almost any day of the week, bar food is good (best wings around, get them on Tuesdays for $2 off), and the service staff is full of funny and professional people. This location is also by far better than the one by campus; it's populated by tons of cool regulars rather than unruly college students. Come by tonight!"}
{"text":"Had to go here for a work-related event. I don't drink at work, but they only card the people who are drinking and leave the rest of us alone. I had a really good lemonade here and the spicy wings/nuggets were frickin' awesome. Nice environment and a great place to hang out with co-workers."}
{"text":"Dollar drink nights on Monday, no cover! What can I say, you can't beat it. I don't like fancy mixed drinks or club settings, so The Vine is a perfect place to knock back 'a few' shots and play some pool! A lot better during the summer when the ASU crowd thins out... (yes, I go to ASU, but that is a whole lotta bros)."}
{"text":"I went for the dollar drink night. That never ends badly, right?  Sure, the dollar drinks are in 12oz plastic cups. There's only two bartenders. One of the pool tables is missing a cue ball. Who cares? The place is a dive, and it's a great place to have some cheap drinks and hang out. They had live music, and the guy on the guitar was awesome. He even did an acoustic Lil Wayne cover for some bro.   Good for: Guys night out, college kids, a $10 evening.  Bad for: Anyone who expects amenities like waiters, straight pool cues, or a paved parking lot.  Tip: If you're partaking and need to leave your vehicle, just let the bartenders know so they can add you to the \"Do Not Tow\" list."}
{"text":"Great staff and food. The prices are reasonable. We recommend the wings, burgers and fries. They have great deals as well!"}
{"text":"The ultimate dive... I'm tempted to give The Vine four stars for the ridiculously low drink prices, but I just can't pull the trigger for a place this grimy.  The good: Drinks are dirt cheap, especially during HH. The wings are pretty good. It's an ideal location for ASU students, and most nights it feels like less of a meat market than your typical Mill Ave establishment. Pool tables & other bar games, juke box, outdoor eating & smoking area, enough TVs.   The bad: Everything about this place is filthy--bathroom, tables, and often the beer mugs (when you actually get glass ones), not to mention the broken pool cues, busted darts, and three-legged tables.  The verdict: If you want beautiful, skanked out ASU girls looking to party, you're much better off on Mill. If you want to hang out with your friends, get drunk on the cheap, and fill your system with grease, this is a good spot to be... as long as you don't mind the filth."}
{"text":"If you have a dog with you, as many people in Tempe do, don't go here. The employees and the manager here will turn you away on the basis that their drunk customers will mess with your dog. Do yourself a favor, take you and your dog to Handlebar, spend the same, or more(!), amount of money there because they will accommodate you and your pet with the amount of respect that you deserve."}
{"text":"This place has the best wings I've ever had. I am always happy when I come here. I order the wings crispy and they are never soggy like most places...I also like the buffalo chicken quesadillas."}
{"text":"At 6:41 on a Wednesday ...  this place pretty much sucks. Service is terrible. Bartender doesn't understand the term \"another round\". So we move to the tables..  the server would rather text and roll silverware than even acknowledge your existence. Party of 5...  we left."}
{"text":"Ok everyone...I'm on a yelp roll and I don't plan on stopping. So sit back, relax, and enjoy some good ol' fashion yelping.  This bar is not for the faint of heart. You have to be a pool shootin, beer drinking, sports lovin, good ol' boy (or girl). This bar comes complete with three pool tables, games, dart board, and tons of tv's. And I don't need to tell you the food and drinks are dirt cheap! Between the happy hour and $1-U-call it's, this is truly a college bar.  I have to tell you this place is the OG (or OB if you will) for \"I love this bar\" by Toby Keith. Every walk of life goes here from frat boys to construction workers. And the best part is they are all there shooting pool and hanging out together. The atmosphere of this bar is very much the same atmosphere if you walked into a house party. Very lively, fun, and you will sure leave with a few new friends.  But there is a catch. There had to be a catch to get 3 stars. The food is awful! I have received food poising more times then I can count from this place. When I worked there I made my own food to make sure it was made properly. I would come to this place full. Also nothing works. Chairs and tables are broken, the ceiling is falling apart and the bathroom is about to fall down.  Other then that, this place is amazing if you don't need tables, chairs or a ceiling to have fun!"}
{"text":"Came here for a quick burger and a beer. We were disappointed. We ordered queso thinking it would be a white dip and it was velveeta cheese. Very unlike a restaurant. Our burgers were decent but very obviously frozen pattys. Service was slow. We won't be back!"}
{"text":"Great place to start spinnin ~~~ Spending a good amount of time there with work friends and others, my Vine Veteran XP Lvl is 9000.  This place has:  Epic wings, a nice atmosphere, solid beer selection, great staff, karaoke, a slim but nice patio overlooking the great streets of Tempe!"}
{"text":"Premium food mixed with daily drink specials. Definitely a place to check out."}
{"text":"Best food ever mostly the workers there politely to customers. My dad works their he says it's the best restaurant. What the best thing from there is the workers there are amazing doing there job. Another thing is that it's the best clean restaurant I been to the restrooms are fabulous.    BEST RESTAURANT!!"}
{"text":"The vine has seriously legit wings, and on Tuesdays and during happy hour, they are only $4.99 for a dozen (woah, right?!). There are a lot of TVs, so it's also a place I'd recommend watching a sports game."}
{"text":"Its definitely seen better days, and its sort of an acquired taste, but as far as blue-collar watering holes go, this is is probably one of the best near ASU. Happy hour is when people start showing up (the smoking patio is in the shade) and it is easy to get stuck here way past sundown. Its also great for various sporting events and St Pattys. I probably wouldnt take a date here, but the drink prices are just ridiculous, and as long as you have a strategy to get out of there before eleven (or before it rains) I think you will do OK."}
{"text":"Wanted to post ago of review since a lot of people were hating on the service. Sat down around 6pm on a Friday and Margie did an excellent job meeting our every need. The orange blossom beer was delicious with a hint of vanilla and tangerine. Guys don't often like it! Portions are appropriate sizes."}
{"text":"LIke the other raters said: you gotta know what it is: what it is is a dive bar that caters to the college kids. Once you know this genre then it needs to be rated on par with other college dive bars.  The beer: cold and cheap. 5 stars. Lots of beer selections on tap. $1 PBR. I'm all over that! Food: 3 stars. I ate it, thats all I can say. Had a burger and it was very average. I'll save the details about the smelly lettuce and tomato. I could do fine without eating here again. As a matter of fact, there is a Wendy's that shares the parking lot with The Vine. Go there and eat and then get a beer at The Vine. My daughter had the wings (of course being dad, I had to try them). Being a wing expert I would say 4 stars on that: Better than average but not quite outstanding.  The service. 3 stars. It is what it is. Average and cheap.  The place could be so much better with a really good kitchen. The menu should be rethought a little. A better menu and food and you will have a standing room only business.  Think of a place like the chuckwagon except they serve alcohol."}
{"text":"Not a good place to go if they are busy.  Poor service and attitudes.  Don't know about the food as it never came.  We arrived there at about 6:30 pm on Thursday.  We were told 5 to 10 minute wait, no one ahead of us on the list.  After a 25 minute wait, I approached the host to tell him to take us off the list, we were going to leave.  He said a table just cleared, so we decided to take it.  Walking to the other side of the bar, we found 3 available tables and a booth (I don't understand this), so we took the booth.  It is now 7:00 pm.   The sever came over and within 5 minutes we had our drinks, and placed our orders (two of us).  My Guinness was empty in a couple of minutes and although the server walked by several time, I couldn't catch her attention for another, and she never checked in on us.  Finally, with no service at all, at 8:00 we left our table, I gave the host $5 for the soda and pint of Guinness, and told him we were leaving.  He said he would get our server, but after waiting a total of 90 minutes and only having a single Guinness, I wasn't interested in continuing with the same server.  The place is extremely loud, mostly small tables with lots of people crowding around them.  Parking was very limited and tight.  We live only a block away, but will probably never go back."}
{"text":"The vine on Elliot Road is my favorite place to go for Stein night every Thursday night.  Really good wings and burgers.  And ice cold beer"}
{"text":"Zero stars if possible. Didn't serve my friend who had a valid, vertical CA drivers license."}
{"text":"Go here for wings. One of the best wings places around. Tuesday you get them cheap. Spicy garlic, maple hot and traditional are all great flavors, but you got to get them Bryan style, which is sweet chilli with a side of Frank's sauce."}
{"text":"I can't say much for the service since I usually get food to go on the way to work, but the food is delicious. I recommend the mojo burger. Burger with mushrooms, bacon, and swiss cheese, comes with fries. The burgers are always cooked to perfection. I give it four stars because it is really greasy, some people like that, but I could do without."}
{"text":"Bomb.com foods almost amazing as the people, my server her name was Emily super friendly would recommend to anyone!!"}
{"text":"Recommended by a friend, I checked it out after a hike. Wings came out fast- their signature smokey bbq are the best. decent selection of on tap beers. but only one poor girl waiting on a week night. fortunately, they don't mind if you go up to the bar and order yourself. very laid back atmosphere, must have been something in its prime!"}
{"text":"The service and attitude at this place is so bad, I hate to waste my time on a review.  I am a biker, and visit quite a lot of places.  This place rates near the bottom.  I am use to pubs being homey and friendly.  Didn't find it here.    In the survey I stated no waiter service, they were there, but not attentive.    There are better taverns in town..."}
{"text":"This is a pretty cool spot to get extremely drunk very cheaply.  The drink specials can't be beat.  Monday, Wednesday, Friday $1 u-call-its.  Thursdays they have  32 oz domestics for $3.00; $5.00 for specialty and imported drafts.  I am a Blue Moon kind of guy!!  They have a ridiculous amount of beers on tap, over 20.  The $5.00 cover charge for guys after 9 PM is a stupid, but I can't complain that much I don't know how many times I have left with a $20 - $40 bill and extremely drunk.  The bartenders are really cool, but the waitresses can be a little slow(that is what small tips are for).  The food is pretty good and they have a wide range of burgers and wings with around 12 different sauces.  The food is a little pricey compared to the drinks but still a good deal.  I did have one incident where one of the bouncers tried to kick out my girlfriend.  He said my 4 friends and I could stay, but she had to go.  That wasn't happening!!  The bartenders took care of the situation and the bouncer left us alone for the rest of the night.  I haven't seen him in the place since!!"}
{"text":"First time visiting the other day.  Good service, awesome wings and rings, and lots of tv's.  I was on lunch break at work so I couldn't drink or let loose, but overall a good bang for your buck. Didn't receive any attitude when we used a coupon either."}
{"text":"Disclaimer: This bar is not for casual drinks or for having a nice dinner with your family. This place is for heaving college drinking, listening to some pretty spectacular karaoke, and stumbling into your Uber after you close the bar down. So if that's not the type of crowd you're looking for, then this isn't the place for you.  This place has some really cheap drink specials every single night. $1 you call it shots on Wednesdays and super cheap 24 oz beers on Thursdays (less than 3 bucks for 24 ounces!). I'm pretty sure they have a special for every night, so I'll come back and edit with the exact specials when I find them.  I usually go with a large group of friends on Thursday nights. Karaoke starts at 10pm, but we like to get there by 9 so we can get a table (it gets pretty packed with college students for karaoke). The bartenders are always efficient and friendly. Karaoke night gets pretty boisterous, but there are some pretty decent regulars that always give the crowd a good time.   Pro tip: the karaoke host (I think his name is Steve?) might bump you up on the list if you do a jager shot with him :P Also, they have security who ID everyone no matter what so no ID no entry. And they have a swipe so fake IDs usually can't make it in the door. They never have a cover and they're really close to the light rail. I really can't rave about this place enough. This is by far my favorite dive bar in the Phoenix/Tempe area."}
{"text":"Monday's and Wednesday's are the time to go here.  Dollar drinks all night! Right across from ASU campus so there are a lot of younger college kids, which normally is fine, just watch out the week school gets back in, because it can be a little nutty!  Axle, the bartender is an awesome dude who takes care of his customers.  Get the tall 32oz beers for 3 bucks! Good selection of pool tables and darts too."}
{"text":"My husband and I consider this our \"local neighborhood bar\". The staff is always polite and helpful. The food is always amazing and never disappoints. Whenever someone from out of town stops by we recommend this place! Or if friends want to get together for some wings or a drink, I always suggest this place. It's fantastic! You're treated like a friend and that's important to me!"}
{"text":"My family and I sat in a booth, at 4:30ish, for 10 minutes waiting to see a server.  Got up and left, went to CK's instead!"}
{"text":"always solid food great beer selection neighborhood feel"}
{"text":"When ever you mention \"the Vine\" people auto matically assume you are talking about \"the wings\".People have told me \"the best wings in arizona\"  I can tell you they also have a exceptional hamburger. The menu offers all kinds of cheeseburger choices, I would personally suggest the fries as the side dish, but the coleslaw is also good. The place is some what of a \"sports bar\" with tvs all over, I see a lot of small groups watching different games. What I really like is that the place is large enough that you can always get a booth \"away from the noise\", LOL.  I do notice that it is \"family friendly\" which I really like.  I notice that phoenix metro transport has stops on both the n/s and e/w routes running through the corner. Definitely  would recommend"}
{"text":"This review is in no way a reflection of the overall service at this place. Most of the employees are doing a great job. I under that on dollar wednesdays it can get kind of hectic thats fine. But the moby looking dude behind the bar was a completely disrespectful bartender. He told me I never tip last night and that he was going to help someone else. Then he walked away. First of all Moby, I tip every time I get a drink there and anywhere for that matter because I work in food service as well. So this review is for you, your service is horrible. Crack a smile sometime. I've never had any problems at this place, except for when I order from you."}
{"text":"This bar transport from Iowa City is all over the valley, but unlike the Iowa version I feel it has no redeeming qualities. Bad food and funny tasting tap brews. Girlfriend's fake ID got stolen there, man, having a girlfriend under the drinking age sucks, I'm glad that's over."}
{"text":"Great place to watch sports, and eat and drink with my friends.   One of the waitresses is very rude to me, and I don't even know why.  But it was enough to lose my business."}
{"text":"Best wings in the valley, period.  Don't agree with being charged for ranch or blue cheese but eh, not too big a deal.  Service is always solid.  Bartenders friendly.  Regulars although nice can be creepy at times.  They pretty much act as if they own the place.  Overall, I loved the Vine on Apache while attending ASU and I love the Vine in S. Tempe just as much.  The wings are absolutely incredible."}
{"text":"Transports me back to my college days in Iowa City on stein nights and wing nights-I think the were either 25 or 50 cents back then. Frequented the downtown Iowa City location on too many occasions to count! They have the best wings I have ever tasted-well at least the best flavor, I always get the maple honey hot. I was so excited to find out when I moved to Arizona there was not one, but 2 vines here. They would get 5 stars, but same goes at this location as in both Iowa City locations, the service can be at times horrendous. Ok, the Coralville one is the one that takes the cake on horrible service!  But, the still have great wings, great beer, and it's always a good time :)"}
{"text":"I only go on Wednesday nights for $1 You-Call-Its.  I've had some of the food and it's okay.  The bar itself isn't very appealing. In fact, the clientele that The Vine draws is rather questionable, except during the school year when it draws a lot of students."}
{"text":"All right...dragged the kids in.  The son thinks the wings are comparable to New Yorker...hubbie now thinks they are better than the New Yorker.  The hot wings have to be a big bonus for my guys since they like things HOT.  Medium does it for me.  Hubbie commented he doesn't feel as full after Vine wings, so maybe something they do w/ their prep causes less bloat????  Daughter liked her chicken salad.  It definitely beats any salad the New Yorker will serve you.  I think we have a new go-to place when the guys are hankering for wings.  So we made it 2 weeks in a row and I am wanting wings again tonight.  Maybe 3 weeks?????  So Woohoo for the wings!"}
{"text":"Eaten there several times - been sick feeling after 3 of them. Not a clean place, service is slow and with the exception of a few beer specials the menu is overpriced ($8 for a dozen overcooked wings?)   Had hope for them to get better after they remodeled about a year ago but I won't be giving them another chance."}
{"text":"Marginal even for bar food. The seating area is filthy with no real upgrades in the last 15 years, I'd hate to see the kitchen"}
{"text":"I usually love this place but coming here on on st patty's day was hell. Both of my friends got cussed out by one server and one bartender.They both had dark hair. It was ridiculous, this place is suppose to be a happy place were people come to drink and have fun but the fact that my friends got bullied by bartenders was ridiculous. Figure it out"}
{"text":"By far the best wings in AZ!  Try the Maple Hot wings they have such great flavor, I'm kinda a wimp when it comes to spicey but these aren't too hot for me. The seasoned french fries are great and if you like soda they have great tasting coke. Go on a tuesday to injoy the great wing special."}
{"text":"On a recent Sunday night I was kickin it at the Vine, sharing a well-priced pitcher of imported beer with a friend, and taking in the scene. The place looked as though it was in the midst of some sort of remodeling project, but now upon sober reflection, my guess is that it just always looks like that.   Night went like this: An order of spudskins from the bar-food menu? Sure! Hmmm- they're kinda dry and cardboardy, but looky there! They've smothered them in baco bits, so I'll bite...Hey- check it out! A guy's setting up karaoke! This might be fun. Oh oh- it's not karaoke, he's got a guitar. OK he's ready to sing. He looks like his name is \"Eric\". He's standing at the mic with his guitar waiting for the bartender to turn down the jukebox. People are pleading with the bartender to leave the jukebox on because \"I still haven't heard my Modest Mouse!\" and \"I still have 2 more songs coming!\" The bartender relents and leaves the jukebox on. Eric goes outside for a smoke. Maybe a drink at the bar. Modest Mouse plays. He gets back on stage and waits. And waits. Finally the jukebox is lowered and Eric starts to play and sing his original songs from the heart. I miss Modest Mouse. Eric sucks. Nowonder the bartender was so slow to turn off the jukebox. We're out of here! Bye!!"}
{"text":"This place screams college days. Cheap drinks, beer, old school video games & pool tables. Enjoy!"}
{"text":"Well, I used to work here in '01. I always like to come back every now and then. The menu has expanded, the food is still awesome, and its my fav go-to sports bar. Margie was my bartender today and she kicks ass. I love the wings, and the sourdough jo burger. Yummm!!!! This place will never fail you. Lol"}
{"text":"Kind of disappointed with the service. Went to watch playoff football, waitress (blonde, seemed friendly) was hard to find, food took a lot longer than expected (plus my wings were cold) Will try it again, but left a bad taste in my mouth"}
{"text":"Despite the far from stellar reviews on this place, I went here for dinner and a drink one evening. Not holding much of an expectation I had the wings and the rest of my party had all kinds of things from burgers to the Shepherd's Pie.  The service wasn't bad, wasn't stellar. For the venue it was what I expected and nothing less.   The food was good. I liked everything on the table. Yet again, it wasn't an adventurous culinary expedition - but it deserves the credit its due. For a Tavern & Eatery it was definitely up to par. It didn't let me down. I can even see myself going back for a shot of my own towards that Shepherd's Pie.   Pricewise, yet again it was what was expected.   If I have friends coming in from out of town, I probably will not take them here. But if I just want to get some grub and a beverage - yeah, why not."}
{"text":"Horrible.  Accused our friend of having a fake an held us up for an hour an a half until the cops could confirm it was real... And the managers refused to come out and appologize after demanding that a police ID expert come to check before we could leave.  Never will return."}
{"text":"We have the same wonderful waitress almost every time we go there. The wings are wonderful and the wine is good as well. I love any place that has staff this nice."}
{"text":"Terrible customer service. I definitely won't be back here. They were incredibly rude to me, and I was trying to be so nice. I wish I could give 0 stars. If I were you I would bother with my time here"}
{"text":"We found this place by happen-stance.  We were in desperate need of nourishment and everyplace we looked was over packed, we forgot it was Memorial weekend.  We went in and the first thing we noticed was that this place looks extremely small on the outside and HUGE on the inside, it was weird.  The service was good as was the food.  Nothing spectacular but it was good.  Typical Tavern/Bar food."}
{"text":"Went here with friends last night and the wings were among the best I have tried in Phoenix area. Burgers were excellent, MUCH better than any of the fast food places. Service was very good also. Hope to be back again soon!"}
{"text":"We always come here for lunch & absolutely love our waitress, christen. She is always friendly & has a smile on her face. So the reason for my 1* is this, we were sitting in the bar area & this gentleman was finishing up & said to the bartender that he has to finish up something at his church so he better get going, he then stood up & said \"thank you, see you next time\" the bartender never looked up at him & never responded. I felt so bad for the guy!!!! She completely ignored him, just thought management should now. Don't know her name but she has blonde hair & works primarily in the bar during the weekdays. Someone please talk with her about respectful!!!!!"}
{"text":"Service was very good, food was just ok. Typical bar food. Had chicken wings and they had to be some of the smallest I have ever seen and were a bit overcooked and dried out. The sauces for the wings were very flavorful tho. Good daily specials and happy hour deals,"}
{"text":"Really affordable pub-food, and amazing happy hour specials! The only place in Tempe you can get a tall-boy of just about any domestic draft for $3.00   If you like $1 you call it's, Monday offers $1 mostly any cock-tail after 9pm If you like $1 you call its' with a younger crowd give Wednesday nights a try after 9pm  Mark has been the bartender there for years, he's incredibly friendly, helpful, and creative with his craft. Look for him mostly any day besides Wednesday and Sunday...   Also, the Tuesday beer/wings deal is fantastic :D"}
{"text":"Classic Vine. I found great solace here at the Vine as an alumni from the University of Iowa who moved out to Phoenix shortly after graduation. There are only 4 Vines that I know of any where around the country. Two located in the Iowa City area and two in the Great Phoenix region. I lived on ASU's campus for training during the first two months when I moved here. I was so happy to find a great local Iowa City bar's sister to be located right across the street. It really took me back to my college days since the atmosphere, food and drinks are all so similar.  This Vine location even has the upper hand on the Iowa City location since it is such a bigger venue. The food here is all your typical bar food and everything taste good and is very affordable. I personally am a huge fan of the wings here. They have such a great variety of sauces for you to try from.   Pro-tip: Come Thursdays for Karaoke Night. The host has a huge selection, but he loves playing the classics more than anything."}
{"text":"Let me start off by saying the food here is great, I've never been unsatisfied with my meal! That being said the reason I give this 3  stars is because of the staff and overall atmosphere.  Every time I visit its a hit or miss with the kind of service I'm going to have. I either have a great server who's on top of their game or a terrible server who I see once every 30 minutes. I once waited 45 minutes AFTER I was done with my meal until I saw my waiter returning from out front and was able to flag him down to ask for my check, which I then waited another 15 minutes for. Before that my order had come out wrong and there were all sorts of problems with correcting it. You either get the 5 star treatment where the staff is friendly, in a great mood and does their job well or you walk in and it feels like you're an inconvenience and they're  \"too busy\" for you even though there's 6 people total in the place.  As I said before the food is great, and I will return to The Vine again, but it's not my favorite place to go."}
{"text":"Not clean. Poor service. Attitudes. Not helpful. Insensitive. Rude.   WACK"}
{"text":"We ordered 4 dozen wings this week and they were the worst we've ever had. They were TINY. Small wings and no meat. They should be embarrassed to serve such food."}
{"text":"I love this place. Good drinks, food, and service. The menu has something for everyone. Everything I've eaten here is good and the sour cream and chive fries are amazing!"}
{"text":"The Vine on Elliot has been a favorite for years. (First time in 2005) During that time I have been through three servers. The last was Ben. I met him when he was barely old enough to serve. He is by far one of the nicest. This place has always had a well priced happy hour with a fun staff. The food is good. I would recommend that the owners add to the selection of Irish whiskeys, (get Green Spot, it is awesome.) I recently stopped in on a Sunday night and was pleasantly surprised by a calm crowd quiet surroundings, and pleasant dialogue. This is a place similar to what Cheers was on TV."}
{"text":"I visited this place during the summer so it was pretty quiet and empty. I heard from the bartender that during school (it's right next to ASU) it gets pretty busy. I had their traditional wings with fries and it was delicious. Good food and good service. Pretty nifty place!"}
{"text":"Ok, I forgot to rate this place. GROSS.    Went with a couple of friends for a few drinks one night.  TO make the story short, after a few beers, one order came out, foaming over with piss.  The male server decided to piss in the beer bottle.  Maybe just mine, but I knew something was WRONG and poured some into the other's drinks. (I was tipsy). They didn't drink touch theirs either after that.  I've eaten there too and it's nothing to write home about."}
{"text":"Maple hot wings = best thing about this place!  Decent college bar, in a sea of douch-bag hang-outs."}
{"text":"I come here often and love this place! Great place to have a happy hour drink or hang out late on any night of the week. The drinks are reliable, food is good, and servers are nice. It's usually not very crowded on weekend nights so it's a great place to have a chill night, play some pool, and chat with friends."}
{"text":"A neighborhood fixture famous for their wings! Friendly staff, nice vibe & cool beers... what more could one want!"}
{"text":"I bartended at this place from 93ish to 95 (I am so aging myself) I love to see the longevity! The pics look the same! Bringing my husband and 12 & 13 year old to visit asu in April... We will be by for lunch! Can't wait! Looks like the \"vine stein\" is still around"}
{"text":"This place really isn't half bad.  I have heard a mixture of reviews about it from my friends, but they roped me in with the enticing $3 beer specials.   Though it appears small from the outside, the Vine is quite spacious and definitely capable of providing libations and entertainment to the masses in a quick and satisfactory way.   I decided to venture out here for a co-worker's birthday and was tickled pink that karaoke was about to go down. Cheap drinks, masses of people, and karaoke? What more  could you possibly want on a Thursday night?  The service and selection here is quite favorable. In fact, I'm pretty pumped that The Vine was clean and well lit.  Most bars i've been to have provided quite the opposite experience.   Overall, there is definitely room for improvement... but nothing that will seriously keep me from soaking up all that is has to offer in the next few days. Chug on my friends. Chug on."}
{"text":"First time here and ordered wings. I usually don't like mine hot (spicy) but when I got them they were cold. Warm in the middle and cold tips. The flavor was good and I could eat them fast but having parts of it half frozen was a big turn off. The waitress was pretty fast at taking our order and delivering our drinks."}
{"text":"I've been coming here a long time.  The food is fair and the drinks are cheap.  I gave this place three stars based on the cheap drinks and the two bartenders Mark and Trent that help keep this place the gem it's always been.  Recently a bartender Janey has been working who's bad attitude has ruined almost every experience my friends and I have had.  She's a rude piece of white trash who should probably eat a cracker once in a while. This place is fine just not when Janey's working, lol."}
{"text":"My co-workers and I go here for happy hour and my hubby and I go here to watch games. Went last Thursday and had a stein of Blue Moon as big as my head for under three bucks. Those who are not in love with the wings are clearly not choosing the right flavor...you can't eat their wings without trying the Maple Hot flavor. Great amount of drumsticks on the plate, with crispy skin and meaty goodness slathered in spicy, yet slightly sweet sauce. We always order a basket of their sour cream fries, which are hot, crispy and come with ranch dressing. A mid-westerner's dream! :) Slightly strange layout, but comfy, low-key, and super friendly service Highly recommend!"}
{"text":"Love this place! Been going here for two years now; staff is awesome, great place to hangout and meet new people. Go on Wednesday night if you're looking for a busy spot. Mark is the best bartender ever!"}
{"text":"Wings are great, have never had a bad meal here. However, service is beyond slow always!"}
{"text":"Don't get me wrong, this IS a college bar but the food is great and inexpensive. Excellent mozzarella sticks! Awesome sliders! Yummy wings! Bueno nachos! Tasty fries!"}
{"text":"Have been going here since i was a baby i love this place! The staff members are very nice and on top of everything! The wings are a little price, but i would recommend going on wing nights, they are a little cheaper. There dinner salads are great. I definitely recommend this place! p.s. the remodel looks great!"}
{"text":"Very crowded at happy Hour with regulars and old timers. They supposedly have great wings and my date ate them up like a champion from what I can recall. My turkey melt was very good as well with real turkey and great bread and the fries were in good form, crispy and hot. A good place, but maybe better at off hours if you hate crowds."}
{"text":"Quite crowded on a Friday during the tail end of the Happy Hour. Lots of big parties and some regular oldies crowding the bar. The happy Hour deals are Ok, but nothing crazy. Two bucks off about five appetizers including their popular wings that everybody swears are the best in the Valley. I did not try them, but my boring date scarfed down almost a dozen and liked them. My $8.99 turkey melt was a good sandwich that included fresh sliced turkey, bacon, cheese and lettuce and tomato with a good honey mustard on the side. The fries needed improvement as they were skinny and not cooked enough. About a buck off on domestic beers and a real friendly bartender made for a good experience at this bar. Prices very reasonable across the board."}
{"text":"as a breathing college student, i went to the Vine a few times. definitely a college bar! a cute little A-frame building, with standard bar decor, plastic beer flags, bar stools, pool tables, a small stage area for karaoke night. they also have the typical greasy bar food and their wings are just a smidge above average. there's often a cover (like $5) for their specialty nights i.e., $3 u-call-its (except for top shelf and red bull) night. last i was there they had a \"punching\" arcade game. seriously it was a hanging boxing punching bag and you could take a stab at punching it as hard as you could muster. it was entertaining watching the bros line up for that...then watching them put to shame by this tough rock-a-billy chick in a dress! anyway, usual college antics apply - puffing up around little blondes, karaoke of the ASU fight song, chanting before shots, etc. as not my style as that is, i really don't mind it here. probably cause i go knowing what i'm getting into."}
{"text":"Been coming here for awhile like the atmosphere and the people here. Know the bartenders very well here and got to know the servers as well all friendly"}
{"text":"Service, it has always been above average, sometimes if you sit on the patio it is a bit slow, but that is understandable. Food, I love the wings, I would venture to say these are my favorite in the valley, I like my wings grilled and they always let me do that. Drinks, the drinks are strong and they have a very good beer selection. Bathrooms, the bathrooms have always been stocked and clean. It's a bar, they get busy, they get a little behind, but the wings and beer selection makes up for that for me."}
{"text":"Damn it... I really wanted to give this place a great review! We were in town for a Cardinal game and wanted some good wings before heading home. Let's just say the food was great, with great prices. Everything was hot and tasty, but the service. The gal that helped us was ok, not too friendly but not rude. The service was terrible. They took forever to take our order, then to bring our food, and even longer to get our bill. If you are not in a rush you should give this place a try...just remember we warned you! If management cared to improve on staffing this place would be perfect."}
{"text":"I have three words for you -- pork... tenderloin... sandwich. That is why I'm giving the Vine four stars. You often can't find these delicious treats in Phoenix -- it's an Iowa thing -- which I find surprising, since so many people from Iowa live here. I'm a native of Arizona, but my roots are deeply entrenched in the corn fields of Iowa. My parents are from there, and they brought with them a love of the pork tenderloin. So, when they heard about The Vine, and their offering of a pork tenderloin sandwich, they woohoo'd their way to the nearest Vine (which at that time was on Indian School & 28th St -- now called McKenna's). And ever since, the whole family have been fans!    I have dared, on occasion, to forgo the p.t. sandwich and try something different, and I have never been disappointed. They have your typical sports bar/pub food, which is decent, but I must say their french fries are fantastic -- thin, shoestring fries, that are crispy with just the right amount of salt.  And, to go back to the p.t. sandwich, I'll say that it isn't totally a typical Iowa pork tenderloin. Its breading is a little spicy, and they include a side of chipotle mayonnaise, both of which adds a nice kick. I guess they decided to add a bit of Southwest flavor to a Midwestern standard. No complaints here!  So, if you're ever in the mood for a sandwich that reminds you of your Midwestern roots, or you're just in the mood for some great food, visit the Vine, and you'll wonder, \"Is this heaven? No, it's Iowa.\""}
{"text":"I've only been here a few times and my last time was very unpleasant. I was meeting a group of friends at this tavern to have a good time. Upon my entry I found out a friend of mine needed a ride. I left to go pick her up. When I went back to my car to go get more customers I ran into a snarky towing guy who made it clear that he wanted to tow my car. Bewildered I said, I'm meeting a group of friends here and I need to go pick one up. He replied that regardless, I parked walked inside and then walked out. In his eyes I should be towed. I informed him that if he wants to ensure business success and good customer reviews maybe he should be a little less eager to tow possible customers and ultimately profit. Needless to say my friends and I took our money elsewhere for the evening."}
{"text":"Every broke college kids needs to come here at least once. Great deals every night of the week. Monday's are $1 drinks! Other nights include karaoke night and more $1 specials! Their chicken wings are also really good with many flavors to choose from! If you go to ASU, then you know what the Vine is."}
{"text":"The Vine Tavern (i'll omit the word Eatery as i'm fairly certain this term can't be applied to the food they serve at this establishment) is a vortex sort of culmination hang-out for low-brow Fred Durst clones and future (day-shift) strippers. With that being said, this cesspool of a building hasn't burned to the ground yet so I feel compelled to warn others before they consider spending an evening there.  Being new to the Tempe area, myself and a small group of friends decided to drop in to check it out.  As we approached the-dimly lit building I began to have second thoughts: my bloomy sense was tingling (more on this later). As we entered we were greeted by a lovely bouncer type gentlemen who begged us to pay the 5$ cover.... seriously. We were seated towards the back near a group of teenage mothers and their burly counterparts. We ordered food...  The food arrived in a timely manner, it may have been poisoned but i was too hungry to care. I ordered the mushroom/swiss burger.... 9 dollars-ish. If Mcdonalds ever begins selling their products in the frozen food aisle of grocery stores it might taste something like what they serve at The Vine. I had immediate food regret, my only consolation was the 1$ you call its and the poor old man behind the mic with his acoustic guitar wrapping up his set. Surreal. .. . .We regrettably paid and escaped out the back.   Good: Cheap Drinks !!!!   Bad: You may be stabbed!!!"}
{"text":"Poor management. 1 server 1 cook on a saturday. Would hate to work here. Upset customers."}
{"text":"Good little bar. It's dark in there but food was great for bar food. Way better than zips. I will be back"}
{"text":"Well I grew up in Tempe and always went to the vine! For starters, they have horrible customer service. You will rarely leave there feeling like the servers, hostess, or bartender went out of their way to make your experience better. You'll notice that the employees are all very fairly young... maybe this has something to do with the poor customer service? They take short cuts all the time! Especially when they are busy. Be careful on your To-go orders! If you get wings they will most likely be dished out to you cold. This has happened to me a few times when I dined in as well.   The Vine just has a 'whatever' feel to me. Honestly It's like going to Applebees but with worst service and less selection.   Pros: Decent bar food, normal service times, lots of TV's for sports viewing  Cons: Bad service, Rude staff, the kitchen let's cold food go out, cutting corners, horrible salads"}
{"text":"Not a bad place to hang out. Wednesday night is the night to go for the dollar you call it and little draft beers. A cheap night out on the town to get wasted there with a bunch of college kids. Service is not all that good but the place gets packed."}
{"text":"Despite the fact that all the servers look like maybe they just got sexually assaulted, the wings are not bad.  They used to be better and then I imagine they got a new cook or fired one that realized they were too good to be working at The Vine.   I've heard a lot of people say they ordered the gyros or the fish tacos or some kind of french dip and were THOROUGHLY disappointed.  Of course you were disappointed, the place you're eating at has pictures of Smirnoff vodka on the tables and is serving two dollar Long Islands while some ASU  douche bag is doing Karaoke to a really dated Kid Rock song: YOU'RE AT A BAR, ORDER BAR FOOD.  Order a burger or fries or something fucking fried, don't order the sea bass entree at a place with a three dollar cover on weekends and drunk dudes playing pool in the corner, asshole.   That said, the wings are actually worth a trip to The Vine as are the dirt cheap drink specials.  I am a fan of three dollar Long Islands, and appreciate the fact that they're drinks are stuff.  I also notice that if you go here during off hours, like during a weekday, instead of putting on satellite radio they will play an album straight through.  One time I heard them play the entire Blue album.      The Vine is good for very specific things; happy hour drinks, wings, late night shot specials.  Don't come here and expect more than that.  Don't come here when they're not running specials because paying full price for The Vine is going to piss you off considering the quality.  Don't come here with your Mom on Karaoke night and don't bother if you're offended by servers that look like they auditioned for Rock of Love (but are notably friendly and not at all incompetent).  Also, don't come here and take 19 Jager shots then punch your boyfriend in the face in The Vine parking lot after he got your car towed for parking at the nearby Wendy's."}
{"text":"The wings here are atrocious. They are so small that eating my thumb would have more meat"}
{"text":"Mark and Shelby are the best. Mark has a sick pony tail and Shelby has sick tattoos.  They give awesome service. Best bar in Tempe hands down."}
{"text":"Average eats: wings, salads, burgers. Beer selection good and service quick.large tvs posted with several sports events happening."}
{"text":"Yes this is a local dive bar. However, it is quite good in the food dept.as well.    Came here last night for a quick dinner. Quite a lot to choose from on the menu.    My girlfriend was even able to get hot green Tea,and you would not expect that would you!    We both opted for sandwiches.  Very good, they subsitute without a problem. Our waiter was very good and our food was hot.                                                           They have a different menu speical every day of the week.    Lots of pluses here. They have 14 TV's all with differnet channels going.                        So you can't say you couldn't find anything to watch.    They have resone all the boots so they are nice and comfortable. Bathrooms are claen. Lots of  parking in the lot.....We like it!"}
{"text":"Love the wings here. When done right they are the best around. Even when done wrong they are pretty good. Good beer specials."}
{"text":"This place is okay. They have good happy hour prices but the food is regular old bar food, nothing special. Lots of people go here to watch football."}
{"text":"The service is always really slow- when you seat yourself don't expect to be greeted within the first 10 minutes. I'll give it 4 stars anyway because their wings are THAT good. I'm not typically a bone-in type of girl but their traditional wings are to die for."}
{"text":"I remember coming to this small chain back in the 80s. It was a favorite - best fried zucchini and mushrooms on the planet! It's pretty run down and grungy nowadays. Floors, walls, booths very beat up and dirty. Wait staff was friendly but not quick and food took a really really really long time to come out. Food was ok. The zucchini wasn't as good as it used to be but I'd still give it a 7/10. Everything else was just very greasy and meh. Wanted to give 3 stars but the grunginess was a huge turn off. If I hadn't wanted to see if the food was still as great as it used to be, I would have walked out before sitting down. Typical old neighborhood pub complete with regulars and the average bar food you would expect of an old neighborhood pub. Sad that it hasn't aged gracefully. I probably haven't either tho, so who am I to judge?"}
{"text":"The guy behind the bar needs to get off his high horse.   Totally disrespected my woman and I.  Been coming here 26 years and I will never step foot in any location. .. That is all.."}
{"text":"The Vine is the perfect bar for college students. Conveniently located on Apache next to the biggest apartment complexes on campus. They have daily deals that are different than the ones online so be aware of that before coming. I got the happy hour wings for $9 and a stein of PBR for $4. The wings are on the smaller side but you get a dozen so it makes up for the size. The service is great and the bathrooms are clean, I'll come here for happy hour any night."}
{"text":"Good atmosphere!! Great deep fried wings, with multiple sauce options (sweet chili mayo).  Awesome HH specials on beer. Our server Matt was very good!!!"}
{"text":"If you're from Iowa, especially a University of Iowa alum, or you are just married to one (this gal), you know that The Vine originated in the great state of corn. The Tempe location is your typical tavern, little gritty, stale beer smell stuck to the walls, faint smell of urine, don't have to dress up to drink cheap beer and gorge on wings type bar.  Every time I go it's never as crowded as I expect, maybe because all the kids go to Mill now and expect a dog and pony show with their drinks. Sad because these bars are typical, hometown drinking locales and not worth ditching over a $10 cover to listen to some horrid cover band play Nickleback. Wings: Maple Hot Wings - that is all."}
{"text":"to make a long story short --- we had a coupon for this place.  We know its an ASU hang out but the coupon was for spend 50.00 get 25.00 off.  Ok service was not good --- when we got the bill the pizza and wings were charged separate -- not right -- it was a together order per the menu.  We had a pitcher of beer and a single beer plus food -- bill was almost 70.00 -- we gave the waitress the coupon -- she had to change the bill for the pizza and wings --- then she came back and stated the coupon had a 18% gratuity and service charge of 13.59.  Based on what ???  that actually ate up the coupon and we ended up paying full price anyway.  Never again --- and the food was fair --- not a good place to return to -- ASU take it away -- its all yours -----"}
{"text":"This place is average.  On the plus side it's nice and cheep, but on the downside, it's a pretty gross physical establishment, and the food and drinks are mediocre.  The worst offense to me was one night when I ordered a Knob Creek on the rocks and caught the barkeep pouring me a drink from the well.  He poured it out and gave me what I actually ordered, but I wasn't pleased."}
{"text":"First time here and really enjoyed this place.  Very popular obviously from the number of patrons there on a weeknight, the service was great, the food very good, great prices too especially on happy hour drink specials!"}
{"text":"Great place to watch sports on the TV from.  The menu is substantial and they have great happy hour specials and food specials.  The service is a little slow but the staff is always busy and super friendly.  Really enjoyed the spicy fettuccine pasta special.  Also happy with the wings, fried mushrooms and burgers.  The well long island iced tea was tasty.  Large PBR beer mug for $4."}
{"text":"I really don't know why this place is only 3*. I guess people believe they expect 5 star cuisine and service from a sports bar in Tempe, AZ.   Well to start there are TV's everywhere and they will accommodate whatever you would like to watch including UofA games even though it's not on their preferred list of games.... ever.   Food is really good, like is it 5* cuisine?? No it's not, but it's real good bar food. The Reuben is better than most and I prefer the buffalo chicken wrap with spicy honey mustard sauce.   The deals... well one of the very very few bars that do weekEND deals. Drinking a stein glass of coors light for $4 right now. Can't argue with that. People will always find a reason to hate a place, but for a local sports bar you can't do much better than this place."}
{"text":"People are friendly. The wings are great! Service is fast. You can come in alone and sit at the bar the people are friendly and the bartender a great."}
{"text":"Well I gave the place 3 strikes and they are out.  Have read other spot on reviews like you will wait at least 10 minutes to be waited on after you get seated. All the regulars are talking with the barmaid so your drink order waits while she yaks it up with her buddies. Food is not good at all.  1st trip sat at bar for 10 minutes and never did get waited on. Went back to front desk and asked for a table.  Ordered the wings and requested a little extra crispy.  They were tiny, and now dried out beyond the consumption point. 2nd trip I took a friend. She ordered an app, 2 sliders with fries. Sliders come with cheese, she spoke with Ryan about NO CHEESE  at least 3 times. They come out covered in American cheese. He never returns and when we could track him down he says oh boy they forgot to hold the cheese. She didn't eat them and of course he never asked for a manager to come over to chat with us. We were still charged for them and he just took them away.  3rd trip was the last for me. We sat at a high top next to the bar. Of course after a 15 minute wait to be served we ordered drinks. After another 15 minutes waiting we snagged our server and said we were leaving. He said hang on a second and comes back with the check!  First thing I see is the prices are higher than advertised. He said you ordered them too late for the HH prices.  We missed it by 4 minutes after sitting there 30. Asked for a manager who never came. We did get dirty looks by the regulars at the bar where it must have been discussed with them first."}
{"text":"I've been coming here every so often for 6 years. This has always been and will always be my favorite bar in all of Tempe. Great prices, fantastic service (especially if you're lucky enough to be here when Mark is bartending). Karaoke nights, drink and food specials, billiards, darts and a great regular crowd that's always friendly and welcoming. You cannot find such an environment anywhere else in Tempe."}
{"text":"Walked in and noticed a sign with alcohol specials. Said bloody Marys were 3.50 but when I ordered one was told that was only for weekends. So ordered one anyway, tasted like it was straight tomato juice with lemon squeezed into it. Had the medium hot wings, good flavor but they made u pay an extra 50 cents for blue cheese. Whoever heard of hot wings with no blue cheese? So next time ill stick to the ice water and bring along my own blue cheese,"}
{"text":"The bar food is ok. What I really like is that it's a great place to meet with friends for happy hour. Your check never makes you cringe, the drinks are poured well, and the staff is friendly. It's perfect for my tastes."}
{"text":"After a long day of travel, just wanted a cold beer and snack.  This took care of our wants.  Tuesday special... $4.75 steins (had to be 24+ oz or more) and chicken wings $6 for 10 wings.   Small wings, but being from Buffalo, flavor was very good. Philly cheesesteak was flavorful.  Fries were outstanding.  Mark, the bartender, a delight to chat with.  When asking for suggestions, he gave honest opinions.  Would go back again."}
{"text":"Good place for wings burgers.  The last visit, I tried the hot and medium wings with a few other people and as always, everyone thought the wings were good.  The beer selection and the happy hour pricing is also reasonable.  The wings could be a little meatier, but they were crisp."}
{"text":"Well over due for the upcoming remodel.  We don't usually venture far from the wings and little Joe's bit we did this time and regret it. The open face roast beef sandwich was extremely salty. And the Mac and cheese was very bla. Lots of new places popping up in south Tempe and Chandler so the Vine needs to step it up a notch."}
{"text":"AHHH yes. The good ol' Vine. Home of the neighborhood alcoholics, regulars and chicken wing enthusiast. The bar is littered with regulars that have their permanent spots, the blonde floozy with her glass of wine loud enough for everyone to hear her and draw their attention, mingling from table to table talking to people that she knows. The old grey haired guy sitting all alone raises his empty bottle of Coors Light to the bar staff and is quickly replaced.   My girl wanted chicken wings and we happen to be driving by when a sudden right was taken into their parking lot.   Food was average, and service was average. Can't say anything bad or great. They just get a solid C on the grading curve. I think you know what you're getting when you walk in here. Anything below 3 stars is more of a \"shame on you\" you should know better."}
{"text":"Food was awesome, the boneless wings were a favorite! We were waited on by Craig who was super super helpful, super kind and fast when it came to service!  Place was clean, decently priced, service was excellent and  food was delicious!"}
{"text":"I would have to describe the vine as being, first and foremost, a filthy place.  Dirty tables... some of them are broken and will fall over if you rest a pitcher on it.  Some of the cushy seats inside have large gashes in them and their inside stuffing is bleeding out like entrails.    The crowd is such an odd mixture of lowlives, well-dressed college kids, complete douche bags, metal kids, crusty kids, bros, middle aged boozers, hipsters and that one lady sitting at the end of the bar wearing a cocktail dress with a martini in her hand, a gun in her purse and a dark secret.  That's what I really like about The Vine.  It's a strange place, for sure.    The bathroom has graffiti in such high-up places, someone either brought in a chair, stood on somebody's shoulders or had to balance one foot on the urinal and one on the sink in order to get into those awkward corners.  On a few days out of the week, they have $1 you call its.  The cover is $5 and you can go to town on cheap drinks.  Granted, you don't get a full-ass glass of beer, you get a little plastic cup, but still it's still only a dollar.  For dirt cheap, you can get wasted.    It's a cool place to come in and wet your whistle, but I could never see being a regular.  I like my dives dirty and I like my crowds strange, but The Vine just has something about it that strikes me as creepy.  It really wouldn't surprise me if I found out that The Vine had been build on a piece of land where a family had been slaughtered over a hundred years ago.  I don't think the place is haunted by ghosts, but it's definitely haunted by awkwardness.    Whereas most dive bars sort of revel in their own filth, this place is sort of like you went over to your friend's house and found out that they have filthy, alcoholic parents that they're ashamed of.  Check this place out.  Friday nights can get poppin' off and you can expect to have a hangover the next day because with $1 drinks... come on."}
{"text":"Wings are Damn fine.  Great specials.   $3.00 craft pints all day Friday & Saturday."}
{"text":"Still the best wings! + $4 steins. How can you beat it? This Santan beer is excellent."}
{"text":"FYI it's truly a dive bar but good service.bar tender has been here for 19 years. Not a place to take a new date to but fun for old friends cheap drinks."}
{"text":"Update:   They now have Coors and Miller Lite on draft.  Yay!  They're a real bar again.  I don't know the drama, but apparently the management has been \"let go\" and the owner is now managing the place."}
{"text":"I never really got caught up in the scene at the Vine...I don't know why...probably because I was always broke during my undergrad but maybe it was because this place was grimy.  Who knows?  Anyway, the Vine is an ASU classic...everyone goes here - and some people love it...others hate it.  I was one of the rare people who didn't really go either way.  It was just \"The Vine\" to me...  Anyway...the best part of this place was the specials - 32 ounce beers for $3 dollars (used to be $2.50)...you can't really beat that.  Another favorite of mine was punching that red, punching bag machine...it was only a quarter and we derived so much fun from seeing who could punch the hardest.  Yeah, it's dirty...yeah, it's loud...and yeah, I probably wouldn't like it at all now that I'm a few years older - but it was a decent experience at the time."}
{"text":"The host on the evening of 5-3 was a moody brat.  He should be in the unemployment line.  The manager came over to hear our complaint, then sent the moody brat to apologize...wasn't in the mood for him.  Food was so-so.  My 1st and last time there.  I was invited by a friend and would have walked out if I entered alone."}
{"text":"I have only ever been to this place on Mondays and Wednesdays..its Dollar you call its. And with its location you may think this kind of night is totally filled with Tempe and ASU d-bags, but its really not. Some nights arent even busy at all! There is one bartender there, who I wont name, but trust me you will know him if you see him, who seems to HATE his job. He never smiles, seems miserable and pours and AWFUL kamikaze shot.. pretty sure he just puts sweet and sour and lime juice in it. the music is usually at a good level however the other day they were playing reallllly loud Jazz music and when I asked abut it, the bartender responded with \"ya im trying to annoy people\",... well it worked! The only other thing, is this place is a vortex for cell phones..everytime I am here I cant get a signal to save my life"}
{"text":"Newly remodeled dive bar!  Same great food but a newer fresher look.  New TV's and brighter ambiance.  As always the best wings in Tempe as they will grill them! The happy hour prices are the best in town."}
{"text":"Crowded and lively; dark and dingy. Food adequate and beverage choices limited. Servers attentive and efficient. Coming back."}
{"text":"I ignored the Vine until I was a senior at ASU. I was always curious why this place is always packed.  You will get terrible service here. That should always be expected. I once left without leaving a tip because the bartender/server was very rude to my friend.  However, I realized what I did was wrong. This is the only bar that's by the dorms and college apartments. The Vine and its staff deserve some kind of respect for that. If you're a bartender and you have to work as a server and you have to deal with college students who suck at tipping every single day, wouldn't you get irritated easily? If you have to serve alcohol to underage students with fake IDs (from China) and tolerate their obnoxious behaviors and clean up after their messes, I'm sure that you will have a tendency to snap once in a while.   After this realization, I have become a better man. I brought a friend here for wings and chips once and she said: \"John, the service here is so slow. When will they take our order?\" I told her that the wait is a part of the college and dining experience. She laughed and we had good time at the Vine. (The service was still slow).  So I give this place 4 stars because I come here expecting poor and slow service; however, the food is always good and the beer is cheap here."}
{"text":"We've been a few times to the Vine since we live in the area. The service is slow, the food is somewhat overpriced and pretty hit or miss. As another reviewer said, the wings are so tiny and dry we couldn't tell that they came from a chicken. Potato salad is try and tasteless, but the sandwiches are pretty good, although a couple dollars more than they should be.  The Vine's biggest problem is it's servers. Calling them lackluster is being kind. They have ONE superstar bartender who's friendly, professional and fast, but the rest are pretty much duds.  The reason for my one star review was our visit today, our LAST to the Vine. We went in for a late lunch and a beer around 2:30pm. There were exactly 4 people in the place, 3 at the bar and one at a table, all men.  We sat at the bar and waited for the bartender, a thin bleached blonde in her 40s, to acknowledge us. She was busy chatting about some a business retreat one of the patrons is going on. Finally she took our drink order and brought back a Guinness full of froth. Apparently she doesn't know the proper way to pour a Guinness. That's fine, we didn't say anything but just asked for a menu.  She then turned her back on us entirely to chitchat with her friends.They were exchanging email addresses and showing each other pictures. We watched her pleasantly greet and serve two men who came in and looked at each other. Oh, so she can be friendly! Anyway, we decided what we wanted and waited for her to turn around. And waited. Remember, she knew we asked for menus. She finally turned and we had to call out to her, can we order please? She looked put out and just said, \"Yeah, what do you want.\" No smile, no apology. I almost left at that second, but my friend was already ordering. Bartender left to put the order in and went back to ignoring us. We noticed Judge Judy was on a TV facing us and were watching it and talking about it. At this point there were no other patrons in the restaurant and none in the bar besides us who could see this screen.  Bartender walks up with the channel changer and changes it to a sports station. Never mind that there were at least 6 or more TVs throughout the bar with sports on, or that we were clearly looking at it! We were juts like, right, that's it. We asked to cancel our order and we would pay for the drinks. She asked why and we said because you made it clear we aren't welcome. She claimed she \"couldn't cancel\" our order and we would have to \"pay for the food.\" My friend said she wouldn't pay for food she hadn't eaten. Then her bar patron buddy decided to speak up and say, \"That's stealing.\" My friend told him to mind his own business.  I went around to try to find a manager to explain why were were leaving and not coming back, when bartender comes over and says SHE IS the manager. \"Well, you're terrible at it, \" I said. She said she \"didn't know\" we were watching that TV, etc., and acted really clueless. Maybe she really is that clueless, who knows.  There's really no excuse for a server or bartender to ignore patrons, *especially* when there are so few there. I don't like to call women bimbos, but this one deserves it. Either she's too dumb to know how to serve customers or she deliberately fawns on males and ignores females. And to think,  someone decided to make her manager!! (Unless she was lying about that.)  So if you like really poor customer service, overpriced food that's hit or miss, and unprofessional bartenders who don't know how to pour a Guinness or serve women, this is your place. Like I said, we won't be back."}
{"text":"Average bar food, but a lot of drink options including full bar and a ton of beers on tap.  Good place to watch sports too."}
{"text":"Cheap.  College.  Bar.   Xtra pts for quality/friendly barkeeps."}
{"text":"Every time I been in here I felt like it's full of super fratty college kids who are all drunk beyond there means.   They do offer very very cheap drink specials if you are into that. So that being said it's definitely offering a product but I think a lot of the locals really enjoy however I would say it's not the ideal place to go for a casual drink."}
{"text":"Where do I start with this place.... I LOVE The Vine!!! It's my neighborhood bar where I can always come for a drink (who am I kidding more like several drinks) and some great wings.   The actual place itself is perfectly laid out with multiple flat screen TV's and I love how the bar is the focal point of the whole place. The staff are amazing, Amie and Ben are the best bartenders in Tempe. They make you feel at home and are very personable. The staff for me is what makes the restaurant experience and the folks at The Vine do not disappoint.   If you are in the neighborhood and you're looking for a chill and friendly place to have a drink, watch the game, or even kick it with friends The Vine is a prime spot to go to!!   Love you guys!!"}
{"text":"4 apple pie shots, 2 domestic steins, on a Wednesday is $13. They don't make em like this anymore. The only thing better than the food and drinks is the service. This place is for the best of the best times"}
{"text":"Fav dive bar in the East Valley. Plenty of tv, beer choices and good wings. Happy hour is the stuff at this local."}
{"text":"I've been to the Vine before, about a dozen times or so. Usually it's pretty busy, but you could still see the floor and choose where you wanted to sit and so forth.   Wednesday I got a call from a friend of mine, Rachael who lives on campus, to get a few drinks. We'd been trying to get together for a few weeks and kept missing each other. I had already had two beers and didn't feel like I should be driving if I had any more. I figured The Vine would be reasonable walking distance to her dorm and I would ride my bike back to my house (5 minutes).  Apparently on Wednesday nights, it's $1 you-call-it's. IT WAS COMPLETELY PACKED. We arrived around 11pm, so there was a $5 cover for guys and a $3 cover for girls. Hadn't seen that before.  At 11pm, the bar was about 3 deep so it was 10 minutes before we could order. Since it took that long, we both ordered 2 drinks. I got a Amber Bock after being reminded that my Stella Artois would have been $4.60. Rachael ordered a fancy drink with a fun name. It tasted like a Kool-Aid Burst from my childhood and was fairly strong. Kudos The Vine!  The only thing I'd criticize about the establishment here: The $1 you-call-its were served in these plastic cups, not the big red SOLO cups or the tiny ones that come with a water cooler, somewhere in the middle. It seemed two of them would have fit in a pint glass, so essentially $2 pints. Which is still a fine deal.  By 11:30 this place was packed. Every bro in town was here, and every girl with her chest hanging out and her best dumb face. I pointed to two guys in front of us at the bar sporting identical striped polos (with different colors) and wondered aloud to Rachael if they had a sale at the mall, and she replied that they looked like American Eagle, 2 for $25. Then I pointed to a girl with enough foundation that she could build a house, and asked Rachael if Sephora had a sale that day too. Oh mall jokes.  This really is the place to go if you want to get really drunk and have sex with another person who is also really drunk. The apex of my night came in the bathroom. I received what was the 6th or 7th mustache complement from a bro at The Vine. Another guy overheard it and took a look and was taken aback. \"Do girls go for that?\". Well, when they do, they really do, I replied. \"Yeah well, just send em on over to me. You just send those girls on over to me.\" I guess some guys can't handle it.  A night full of cheap beers, bros professing love for the 'stache, and rowdy college kids looking to get drunk and fornicate. Fortunately, Rachael and I found a booth in the very very back corner with some chairs and chatted while we people watched. All in all, good times."}
{"text":"Local dive bar which I will give 3 stars -- pretty chill and quiet for my taste.  Every now and then I'll take a stroll along the neighborhood and bump into a unicorn and ask for a wish.  She might grant me 1, the cost of a shot of stuff unknown.  Though I can't complain since it was a tad bit fruity and tasty -- yum skittles!  Our server was cheerful and fun recommendations many she had, more shots? please yes; it's my friends B-day I add.  Well drinks and beer, the more the merrier!  A picture? Sure so fuzzy it came out, but the same for my sight after the night and I was out - Enjoy!"}
{"text":"Chris H and I ended up at the Vine on Friday night after hitting a few bars on Mill since it's stumbling distance from where we live. He had been there once before for happy hour, but I had never been. I think we found our new neighborhood dive bar hang out spot!  The building itself on the outside is pretty non-descript, so you would probably drive by and not even notice it. The inside is large with a main bar area with tables and then a back room with pool tables. The back room also has a breathalyzer that you can use for $1...first time I ever saw that at a bar. There are also a ton of TVs scattered throughout the space. Oh, and did I mention there was a very large deer's head mounted on the wall?   Normally we hate bars, especially dive bars, that have a cover. I mean a $4 cover before 10 pm?? But, we quickly learned that the special that evening was $1 you call its, so that made up for the cover. We sat at the bar and the bartender, although kinda creepy looking, was super nice and informed us that there was only like 1 or 2 drinks that weren't $1. Sweet! Our draft beers came in plastic cups, which fit in with the dive bar atmosphere. We got to that intoxicated stage where fried food sounds really good although you know you will regret it the next day, so Chris ordered mozzarella sticks which were pretty good because the batter was light...they reminded me of the ones you can get at Casey Moores.   We'll definitely be going back to the Vine due to proximity and good drink specials."}
{"text":"This place is ok, but I'm giving it 5 stars for all the memories. Dolla dolla drinks yaaaall."}
{"text":"Good cheap lunch hour food.  Go for the wings!  The staff is nice, has a sports bar feel."}
{"text":"Aye fam, foreal. I ordered boneless wings and straight up got meatballs, it wasn't what I expected but it was hella dank. Beer flow was chillin and the service was outstanding. My server was bangin, on my mama I woulda wifed her up.  3 hunna Courtney baby girl if you readin this I still luh u"}
{"text":"Typical neighborhood bar with menu items thrown together or everything fried. Service was good our server was on top of everything and very pleasant. They do have decent prices for food and drinks which is good if your looking for value, however in this day and age the neighborhood/sports bar offering simple and fried foods is going the way of the dinosaur. Need to freshen up the menu and get some real cooks in."}
{"text":"I was going to vote 3 stars but as I was drinking my beer & the tab was closed out, the bartender had the nerve to grab my credit receipt. She already ran my card, so I don't understand the reason of grabbing the tip receipt before I leave my chair? It's about manners & she had nil. Plus I tip well for good service & she needs training on what it means to bartend well. For example, don't grab the tip receipt before your party leaves! And smile because you look miserable."}
{"text":"This is a college bar. With that being said, booze are cheap, place is broken down like a older Van Buren street walker but well, the booze are cheap.   Went in during one of their better drinking days with some buddies because of the $1 you-call-its...$5 dollar admission for guys...sucks but if you drink enough then the cover charge pays for it self. Has a patio for smoking, parking is pretty plentiful since everyone walks there since they're gonna be crawling out due to cheap booze. Haven't tried the food since I was on a alcohol diet so I can't comment on it.   Is this place kid friendly? No. Is this a place to get messed up on the cheap? Yes.   Bring your friends so they can help carry you out if you go on the days of the $1 you-call-its."}
{"text":"They're good. Nice local place that has a dive bar feel but actually isn't a dive bar. Their fettucini alfredo is great cajun-style!!"}
{"text":"I went there on Tuesday. I had a great vanilla porter for $4.25 -- and the best thing -- it was a giant mug with about 32 ounces. They have that special all day on T, Th. Service was prompt and friendly.   Their draft beer selection was OK and at that price that's all I need to get there.   Can't review there food or mixed drinks because I didn't have any."}
{"text":"Awesome wings!!  Hot wings at local sports bars are the best.. and these are some of the best in Phoenix....  good ol' medium or hot flavor is what I prefer and I order them extra crispy.  I have been a customer for the last 7 years and have gone to most of the locations.... always great!"}
{"text":"Now this is a dive! I remember when the Vine first came to town, they were really the first wing joint to come to the Valley. The wings are smaller here, a little more crisp than some, and I really enjoy them more than fat wings. Its a little more about the sauce here.  Located next to ASU, they still allowed an old man to join them and hoist a few. Friendly bartenders, friendly customers, its all a very enjoyable experience.  4 stars."}
{"text":"We've been going to the Vine for a couple years now. To be completely honest I've only ever had their chicken wings and salad, but that's all I need to know! When I have a wing craving... Vine is where I go!  I use to be a die-hard Native NY girl, but Vine always serves HOT, SAUCEY and CRISPY wings. They get small here and there, but they're always the same \"quality\". During busy nights the staff can lack....a lot... but it's nothing horrendous. Great place for cheap beer and big steins!"}
{"text":"The Vine is just an old bar that has cool old video games, cheap drink nights and good fries.  lol  I played their pinball and ate some decent-for-bar-food fare.  Not a bad night!  Might see ya there!"}
{"text":"TERRIBLE Experience! My group of three 24 year olds from out of state were denied service because our actual real IDs didn't look real to them. I offered him my 5 other forms (including insurance cards) and he wouldn't even take a look at the fact that I had a real ID and can legally drink responsibly. I am a graduate student and was looking forward to getting a beer and dinner just to find that my Friday night would end up being inconvenient and treated poorly. Not only were we denied but we were treated like children and talked down to. I will certainly tell people how terrible this place is. Don't waste your time on this kind of service or should I say lack of service."}
{"text":"Went here after a final to enjoy some lunch booze and food with some classmates.  Had a fine time with the beer selection. I drink import, but my friends that drink local beers had a field day with the prices.  Food was a little salty, so I won't give them 5 stars ( I tried a wrap). I did try some of my friends' food and was not disappointed, but can't say I was blown away."}
{"text":"Mark is hilarious one of the best bartender around. You get dollar you call it on Monday's. This review on that since I go often. Sometimes wish food was served later past midnight. Overall good place for drinks"}
{"text":"This was perhaps one of the worst eating experience I have ever been to. We came around 645 and we didn't get our food until eight. I thought that when they said they were going to give me 4 chicken tenders they were going to give me for but that was not the case. In fact not only did they give me three chicken tenders but they're also very skinny and the fries were tepid.  Furthermore my friend solids did not have a lot of meat and they were very salty because the dressing was super overpowering. There were also problems with the service itself for instance they forgot to give me water after 45 minutes into the service. In conclusion this tavern is definitely not one that I would recommend if there was a zero star or even a negative star I would put it."}
{"text":"I really liked this place a lot.    The service was great, Mark (our bartender) was awesome!  They had a great selection of beers & the food was really good.   I definitely look forward to going to this bar again."}
{"text":"Come on one of their dollar drink nights and get the long islands; great way to start off the night. They even have dollar shots."}
{"text":"We came to watch the NCAA championship and there was one waitress for the entire restaurant. I went to the bar to order my drinks because our waitress wasn't coming around. I also had to fill up sodas for two people in our party because the service was poor. The fries came out cold. The chicken wings were smaller than I remember.   We had to wait a long time just to get our tab. When we finally did, I told the lady she should tell her manager to schedule more than one waitress for a night that's going to be packed. She said yes I know, please tell them.   So I did...they were bartending. I told them their server isn't getting a tip because her service does not deserve one (for all the reasons explained above). He said they're doing the best they can and I hope we'll come back. I told him we won't be coming back. It's unacceptable to have one server scheduled for a big night.   The worst part of this is...we've been going there for 18 years. Maybe 20. We used to go there after softball games...then when I was a Sun Devil...and even after college to watch big games. Disappointing."}
{"text":"A revisit after 22 years.  Wednesday evening, I was out and about with friends from out of town and wanted to show them a favorite old haunt with good food and drink without spending a fortune.  The Vine is close to home, so we could take the Valley Metro City Limo and avoid any problem of driving after drinking.  With $1 you call it on Wednesday, I figured 3 of us for drinks and dinner could be inexpensive.  The staff in the old days had standards of service.  Those standards have apparently not been maintained by the current management.  In the previous days (1989-1991), I could swear the service folks had timers set...they were so consistent in their visits.  Now, unless you tip $5 on the initial visit, you are not going to see the staff at your table nearly as often.  The wings are still good...the drinks are decent...the service has gone from good to fair."}
{"text":"Best wings in town. Hot, extra crispy, hits the spot. Unassuming environment, great karaoke fun on Thursday night and steins are like 3 bucks most nights -- and that's HUGE."}
{"text":"Good place to come eat and chat or hangout with friends - since I am a local and come often with my room mates, we are always running into friends and making new ones. Great atmosphere. Upbeat and friendly!"}
{"text":"Place been around for a while, at least since I moved here in 2012. During Friday and Saturday night place is slammed at capacity, during the weekdays bar is pretty dead. Decent bar food, decent prices, you can get a real Black and Tan here they got Guinness and harp on tap"}
{"text":"We went here because the wait at four peaks was too long, and it was a pretty average place. The beer specials are fantastic, and the service was really good considering they were highly under staffed. I got the chicken sandwich and my fianc got a burger. We both thought the food was pretty mediocre. Probably wouldn't go out of our way to go there for dinner, but will for sure stop in for a beer if we are in the area."}
{"text":"I don't get. I entered the restaurant, complied with restaurant etiquette, waiting at the host station and no one came around. The 2 \"Blue Moon\" girls were doing their thing, looked at me and turned away, talking to the woman bartender, who also looked at me and turned away. Finally I go to the he bar table, waited a few minutes in hopes of getting the bartenders attention, still being ignored. Another woman customer approaches the bar and the bartender assists her, now I'm peeved. The bartender, still ignoring me, walks to the host station, does something, so I contacted her. Here's where it got interesting.   I asked her if I looked like a customer, \"Yes you do \" she replied. So I asked, \"why are you ignoring me then?\" She said that she hadn't ignored me and that the other woman needed help so she assisted her, with that little smug tone mean spirited people get who won't admit they're mean, but have to drive home that they're right and you're an ass, whole basically admitting she had ignored me by helping the other woman 1st.  I got a little peterved here and asked, \"little smart a**, call you're manager.\" \"I am the manager,\" with that little smile and a tone of satisfaction.  I mean, after all, she won. So I walked out and ate else where.  I'm a theoat cancer patient with a hole, or a \"stoma,\" allowing me to breathe and talk. It's something I had no choice on getting, something about living or dieing, and have been the brunt of jokes, or just meanness. But I wonder if this is what happened today. What else could it be? I mean, I'm no Brad Pitt, but I'm no Dennis either, (can't say the last name because he's a friend and don't want to upset him, but believe me, he's the ugliest man I've ever seen), and didn't deserve the meanness of this woman. Shame on you."}
{"text":"I have been coming here since I was little and I absolutely love this place. The beer is always cold, the chicken wings are huge with a ton of sauce, and the service is excellent. It is a locals kind of place, but my family and I have always loved it!!"}
{"text":"I have been visiting this place for 5 years or more!! And still love it!! Can't wait for Thursdays happy hrs!! 3 $ steins, and the basket of fries is always crispy...but my fave... Hot buffalo Chx wings, only flats w extra sauce...love the vine!! Plus they always have awesome service! Everytime we go its awesome!"}
{"text":"I ordered a burger at 4:30pm on a Wednesday. I was told it would take 10-15 min but I arrived at 5:00. Waited 10-15 min to receive any attention or service from employees and saw them serve several people who came in after me. Guy at the bar was pretty rude and I didn't receive my drink and waited to ask him to remove it from my bill. He agreed and then asked if that was it or if I would tip. Food was really disappointing and the burger was squished, fries tasted like they had been cooked a few days ago and reheated in the microwave. I've had great service there before both for takeout and sit down but it was just absurd today!"}
{"text":"Great service and great food. Prices are in line with similar places. I especially enjoy the atmosphere. I am making this my new hangout place."}
{"text":"Dive bar with good food and OK drink specials. It's not fine dinning but perfect bar food with a decent selection. Lots of TV's great for football"}
{"text":"This is the best bar food in the neighborhood and really priced right.  Love Wing Tuesdays!!!"}
{"text":"Beer is gooood! and comes in a goood size. The food? not that good, specially if you are used to the food of places like 4 peaks.  DEcoration inside looks like an old, and almost stinky place, so if you are looking something fancy...go northern. Guess by night and drunk, ppl just don't care where they are sitting!"}
{"text":"I went in there once for lunch and the food was not that great. Their caeser salad had too much dressing on it. The artichoke spinich dip was a bit too cheesy. Their burgers tasted alright though. They have good deals on drinks. 3 or 4 bucks for a huge almost pitcher sized glass of beer is great! I like going in here at night rather than the day. The digital jukebox and the small area for games like pinball is fun when you are tipsy ;) The service here has been good sometimes, other times it could have been better (we felt like we were being ignored). Overall, I give it an average grade."}
{"text":"By far the BEST WINGS I have ever had. They are perfectly crunchy, kinda sweet in the best way possible and they taste great in whatever flavor you get them in. I prefer hot/superhot and I have never been let down. The thing that makes em better than BWW and other wing places is because their wings are drenched in sauce! I def recommend this place!"}
{"text":"We frequent this bar every couple of months. Fairly clean place, friendly staff and decent bar food. We almost always come for the maple hot wings. One of the best flavored around!  However, they are usually  \"tiny\" pigeon or Cornish hen sized pieces....but delicious.     Great place to watch a game if you prefer a little quieter group of patrons. Its so nice not to have \"that guy\" screaming at the TV sitting next to you."}
{"text":"Went on a Thursday night to get some wings with some buddies. The wings were Okay, I liked them but nothing to write home about, but what happened next is what made this trip for me. We finished eating and we were singing along with the Jukebox while this guy set up audio equipment for what I thought was going to be a live band. Then this guy comes to our table and gives us a binder and pieces of paper for Karaoke. I had to attend to some classwork so we decided to go home and come back as soon as I was done. When we came back we enjoyed some very good beer specials, $4 for domestic \"Steins\" basically very large plastic cups and a Great, and I mean GREAT Karaoke atmosphere. My one gripe though is that we had submitted songs and the guy in charge limited my friend to how much he could sing and another buddy and I had our song totally ignored. What it seems to me was that there is a Good Ole Boy system in place where what are probably the regulars get preference. Other than that it was a great impromptu Karaoke night."}
{"text":"Parking: Nice lot, good amount of spaces and good lighting.   Curb Appeal: Strip mall Bar and Tavern; Clean entrance, no major issues. Big tinted windows on the side facing Elliot to keep the sun out; the front looks like strip club (not a bad thing, just sayin'); It has glass block windows and a solid oak door.   Layout: Cool layout; right side is a large dining room with good amount of tables and some booths. Off to the left of the entrance is a large \"U\" shaped bar with plenty of high top tables surrounding it. On the dining level there are numerous booths and table tops.   Ambiance: VERY clean, noticed that a table stayed unbussed for only a few seconds before it was taken care of. Good sound system, lots of TV's showing variety of sports. I can only vouch for the Mens room, but it was actually REALLY nice. Good clean area with lots of room, plenty of soap and towels.  Food: My group had a little bit of everything on the menu. Sliders were actually good, wings were good with healthy amount of sauce (Get the Maple Hot...different but good).   Drinks: Plenty of beer on tap and at a good price. Even PBR for your hipsters out there; good micro and import selection, but not great.   Staff: This is were they earn the 4th star. AWESOME. Everyone was friendly and seemed to actively look for ways to make the visit more special.    The Skinny: This place is good. I'd be comfortable bringing the guys here for some football or happy hour beers...and it's equally comfortable if you want to bring the wife/girlfriend/husband/whatever  for some drinks and some  fun. I suggest you give it a chance and don't let the \"dive bar\" reviews get you. I've been to a lot of dive bars, and this place is a few steps above that for sure."}
{"text":"Been a regular here for more than ten years now.   We come by a few times a month usually for lunch or dinner but I also come with friends about once a week for a beer. I don't think of this location as a \"dive bar\" but more of a neighborhood restaurant.  I frequently see families with young kids dining at this establishment.  I used to say the Vine has the BEST french fries.  Lately they haven't been up to par AND they've been holding out.  Portions have decreased.    Most of the items on the menu are pretty good and they have set special every day of the week.  What I don't like about the Vine: *They charge for a ramekin of anything extra.  Really?  You have to charge me for buffalo sauce?   I swear it takes longer for them to approach the table, then you got another wait for them to bring the drinks.   I realize part of the fault could be the kitchen but the other delays are exclusively the server. We don't come here to watch the game or just drink a few beers, we come to enjoy a meal and then we our out of there.  Wish they had a better selection of beers on tap. Also wish they would put the races (drags) on when they're playing instead of multiple tvs playing assorted ball games.  Really, a little improvement with the service would be a welcome upgrade."}
{"text":"Went here on Thursday with 9 friends to celebrate a birthday and watch football. Service was great.  Our server brought out a free shot for the birthday boy. The beers were huge and super cheap for happy hour.  The wings were delicious but small compared to other places.  There were lots of TVs so plenty of different sports games to watch."}
{"text":"Being a bit of a Karoake - addict, I had to ultimately find my way to The Vine.  And I have to say that I do not drink beer at all but could not ignore the friends with me who questioned the authenticity of their pulled pours.  And as for food, nothing vaguely looked like delicious... but if you combined it with the questionable brew, the smell of youth, and the sound of shreiking wanna-be-stars...it may actually be swallowed.  So how is this place 3 star eligible?  Well...its the dive vibe at the Vine.  Genuine true dive-a-liciouness with colorful followers, floozie femmes, and frowsy features on the walls.   Did I just glorify funkiness?  Uh. But I will be back somehow.  Go figure."}
{"text":"I love this place.  Can't beat $1 you-call-its on M, W, and F.  Or the $4 32oz Samuel Adams.  This was my favorite place for day drinking during the ASU years, and the food isn't too terrible either.  Don't expect fine french cuisine here, but they know how to make wings and that's all I ask for from the hole-in-the-wall bar."}
{"text":"This place has the kind of staff that really care about their customers, who always remember you and seem genuine in their friendliness. If they make a mistake they have no contempt at all and are more than happy to fix it. The well drinks are so cheap but never make you feel sick/taste terrible from being really low quality. The food is a little above average as far as bar food goes. It is the easy going atmosphere and friendly staff that has kept my group of friends going for years. Went last night and realized what a nice group of people run this place, the quality of what they sell and how much more comfortable I feel there than other similar places and wanted to leave a review. Great place and great prices."}
{"text":"The bartenders are some of the most bitchy girls there are. But go on Monday for two for one burgers if you can handle the rude people working."}
{"text":"Truly, you can't \"go wrong\" with The Vine.   Affordable wings and huge beers -  And a fabulous selection at that!   Dude and I used to hang here in college (he's an ASU Alum) - And we were both happy to say it retained that look and feel.    Well, the bathrooms were much cleaner + painted now. No more \"Call Brandon for a good time! (555) 555-5555\" and random penis drawings scrawled everywhere.  Plus, one of the bartenders from 7-10 years ago  is still here!  There was also a wide variety of ages, from college kids to the late 20s/30s/early 40s crowd, so didn't feel too creepy.   Most recent adventure was after meeting my BFF's guy at Culinary Dropout.  The food we shared there, umm ... Totally sucked and  overhyped. Needless to say we were still pretty hungry, so made our way to the Vine - Wings are safe!  Happy to say the Hot flavored wings were still on point, and the Sriacha wings didn't disappoint.   Plus $2 PBR. Don't judge me.  Got out for $14 because our server comped Dude's Coke (DD). Not too shabby for a dozen wings and some Freshman year, \"Slip your over 21 teammate a $20 for all the cheap beer you can find!\" beer.  Now go forth and get up to some shenanigans, my friends!"}
{"text":"Mmm, the Vine!   I'm a huge fan of the Rural and Apache location by ASU, but this one is closer to my neighborhood. Great place; chill ambiance, perfect for catching up with your friends over a beer, or even watching just about any game. Friendly service.    Speaking of which, funny that people are griping about ASU students frequenting this location and being out of control . . . Found it to be the complete opposite here. Sounds like y'all are describing the other location! Maybe this is just my experience.   Delicious wings, never slimey and always have come out crispy. Best flavors are the Superhot and Spicy Garlic.   Thirty two ounce beers for $5 and under and Happy Hour is seven days a week.   Thanks for having Leinenkugel Summer Shandy on tap, guys! :)"}
{"text":"Best way to desribe the Vine? a wanna-be dive.  Super cheap dollar drinks in their usual garb, a plastic cup. Mixed drinks seemed really watery, but what can you expect for a dollar...  Coeds everywhere. The night I went it was super crowded-- like, sale on double-wides at WalMart crowded (I know they don't sell double-wides, people.. it's a JOKE). It took about 10 minutes to manuever through the crowd. Once we got back to the pool hall area, it was much less suffocating.   Trashy white-girl music blasting from every corner of the building including but not limited to: Ke$ha, LMFAO, etc. Party Rockin' shouldn't be in the house tonight. How about a little variety....And with it comes a barrage of drunk sorority girls droppin' it like it's hot. And spilling drinks all over each other.   The pool hall area is chill, I'd go back to play pool again but perhaps on a less crowded night. Good luck finding a cue ball, chalk or a clean non-warped table. One group had spilled **a pitcher of beer**... a WHOLE pitcher onto the pool table felt. Uhh... somebody clean that up... and no one did.    I think this is one of those places that collegiates like to call a dive bar, because it sounds cool. If you actually like dive bars and what they have to offer: sleazy stories, jukebox, pool tables, cheap drinks and crazy patrons, skip the Vine and keep looking."}
{"text":"Had such a good time with my wife had taken here on a date and enjoyed a bottle of wine and great food I was impressed as soon as I walked in, high end dinning experience well priced."}
{"text":"Love this place for it's homey feel. Best weekday specials, best karaoke on Thursdays, best bartender on MTuFrSa. Mark is beyond amazing. He talks to you like a friend and treats you like a normal person, no corporate smiles bullshit. Mark is amazing.   Trent is grumpy but we don't hold that against the place."}
{"text":"I enjoy The Vine and stop by once in a while.  During our most recent visit a very large dust ball fell from the ceiling fan. About the size of a golf ball. Nothing was done about this except turning the fans on to get the rest of the dust off. Just don't eat/drink under the fans.  Great drink specials and food is pretty good. I recommend this place to everyone who loves dive bars."}
{"text":"I've only been here once, and it was a pretty cool place. It definitely has a \"college\" vibe, but the drinks were good and the food was better-than-expected. It's not a place you'd go to eat a nice dinner. Their happy hour menu is pretty solid and easy on the wallet. I also really liked that they have a big parking lot (there are few things worse than not being able to find a parking spot when you want to eat and/or drink). I'll definitely come back here for happy hours in the future."}
{"text":"Best wings in town! If you come into the Vine expecting world class service, impeccable decor, and expensive delectable dining, you're going to have a bad time.  If you plan on expecting a dive/sports bar with good prices, great beer, and amazing wings, you're going to have a great time.  That's all there is to it, I have been going to The Vine for probably 8 years and I have visited other establishments along the way here in arizona.  When I want the best wings you can buy, I still come here."}
{"text":"I love this place. Old time dive. This is a place where everyone will know your name! Food is great. Amy, Ben, and Matt are amazing so is the rest of the staff!!! Awesome happy hour deals that can't be beat!!!"}
{"text":"Great happy hours. Asian garlic wings are fantastic!  Great onion rings. I would rate higher but I've only been here for happy hour. They have a full menu but haven't tried it yet"}
{"text":"I like dive bars.  And the Vine is the perfect antidote to the Mill Ave scene.  No one cares who you are, what you're wearing, or who you're with.     This is a bar to shoot the breeze with friends, relax and binge drink.  Pretty much, if I want to get hammered in the middle of the day The vine is my first choice."}
{"text":"Even though I went to ASU, a few weeks ago was the second time I had been here in about 6 years. Went here on a Thursday night for a friend's birthday for karaoke and drinks. Unbeknownst to him, another group brought their people for karaoke, so it was a pretty packed house. We had a few tables in the back, and service was pretty good. We took advantage of the drink specials, $2 bacardi drinks. My main complaint is that karaoke was LOUD. If you were interested in having a conversation anywhere inside (even separated from karaoke as we were), you pretty much had to yell."}
{"text":"I only had one beer and a shot!  The beer was in a huge mug and for only 3.50 !  The bartender (i forgot his name) but he has been there for 16 years!! Awesome service he gave me and my friends. He deserves to be noticed by upper management and or the owner!!"}
{"text":"I am writing this review with the perspective of going to school in Iowa where the original Vine is.  Its similar to the one off Gilbert and Prentiss in Iowa City and the food is the same.  I went there last weekend with my brother who also went to Iowa and really we just rehashed old stories about $2/dozen wings and steins.  I miss my maple hot wings up here in Portland so I got my fix and should be good for a little while.  It was refreshing to get back in the 'college bar' atmosphere on a Saturday afternoon vs. the 'I demand to be seen' lifestyle that is Scottsdale.  Happy Hour and daily specials = cheap and decent bar food and drinks"}
{"text":"Best traditional hot wings in Phoenix.  Great ranch.  Ask them for crispy if you like them a bit dry."}
{"text":"Beware of the Bush Pusher. This place has hands down the best wings of all time. Trust me I have put a lot of meat in my mouth. I have been coming here for over 20 years and I can't find better wings anywhere. One night after copious amounts of fried bird I was heading on my merry way when it happened, the bush push. The culprit snuck up behind me right outside of the front door and tossed me like a discarded bone right into the bushes. I have vowed to catch the turd burglar that was responsible for this heinous act. Sadly the only evidence that I could compile was the fartknocker's voice screaming \"BUSH PUSH\" followed by what I can only explain as a Pterodactyl mating call. 10/10 would recommend the hot wings."}
{"text":"The Vine is a neighborhood staple and is a great place to grab a drink, hang out with friends and family, and grab a bite to eat. There are always friendly locals and the staff are like family. If you like a more laid back atmosphere, this is the place for you. They also have some nice TVs to catch a game. If you are an adult and can't have a good time here, you're probably the problem. Also to the U of A fan who posted earlier, this is in Tempe, the home of the Arizona State Sun Devils. Go find a U of A bar if you want to watch your U of A games. Sadly these U of A bars exist. :("}
{"text":"So I stopped by this location the other day because the NCAA women's volleyball semifinals were on and I was no where near a TV... after doing some research, I found that the Vine was the closest option to me... I was a little nervous going in and asking for a TV but the guy that helped me was soooo nice and accommodating. I told him about the game and I also said that I didn't care where he put me, I didn't even mind if it was on the small outside patio, because I noticed there were TV's out there too...He was like \"Oh no worries\" and he put me on the east side of the room at my own TV... I wasn't very hungry or thirsty, but I felt a little obligated to order something because he had gone out of his way. He got me water with lemon and he was very prompt in switching them out when I was done... I ordered the little JO Burger with fries, it was on the happy hour menu... After a while The Vine started to fill with people meeting for dinner, people coming to enjoy a game, and/or people having a drink. I was in my little corner trying not to scream and yell for the semifinal game... Oddly enough, the people around me knew about the game and knew about volleyball...   All in all, it was a great experience and I am very grateful for the young man that was extremely accommodating... Thank You!"}
{"text":"I used to really enjoy this place and have had tons of fun here. Cheap drinks, enjoy some of the staff, good specials, trashy and divey. I enjoy all those things. After the last couple visits, but especially tonight, I'm sure I won't be back.  Me and one of my girlfriends wanted to go get a beer and a bite to eat after work tonight. I suggested Dos Gringos. She got there first and said they didn't appear to be open. Hm, weird. So I said the Vine. We used to frequent this place often, but now its once in a blue moon.  It was pretty dead inside, which we were ok with. We sat at the bar. We ordered our beers and asked for menus. She ordered the special of chicken fingers and fries, I got a 1/2 order of nachos with chicken added. The food came out pretty fast, which was nice. We were hungry. My friend seemed to enjoy her food. Mine, oh man... These have got to be the worst nachos I've ever seen in my entire life. It was basically chips with big pieces of chewy, dry, bland chicken on top with salsa and sour cream on the side. Very  little chips and salsa on the side. To find a chip with cheese or refried beans on it was very rare. How can you fuck up nachos??? I'm not sure, but they did. Badly.  So yeah, food totally sucked. I ate it. What sucks worse then having terrible food when this hungry? Shit service. In a dead bar. Yes, that happened as well.  Absolutely awful service tonight. I didn't even want to tip the guy, but I did. Yes, I ate my food (or a quarter of it), but I did feel it necessary to mention how much I didn't enjoy it, he didn't give 2 shits. He said with a smartass voice that he was sorry with his back turned and walking away from me. Ugh. I'm so angry at The Vine for allowing such low standards when it used to be a great place to go. $13 with tip for 1 beer and the worst nachos I've ever put in my mouth is way too much money!!!! I've decided at the end, right now, me returning won't happen for sure. I don't deal well with bad service like that!"}
{"text":"I've been coming here with a group most Wednesday's for awhile now. Even If I don't go my group comes here every week regardless, so I'd say we're regulars here. Unfortunately I think this will be my last time here. I don't know if they raised their prices but $3.00 for a soda is BS. I used to get my sodas here for $1.00. I can buy a beer here for less than the price of a soda. It seems like they don't want repeat customers. Why else would they encourage people to drink and drive by charging more for soda than beer? However, seeing as how I'm the designated driver I'm not gonna drink. Every other bar in the world either gives free or discounted sodas to the DD. It would seem that the amount my group and I spend on food and drink here would be more than enough to cover  a complimentary soda. It's unfortunate they're losing a customer over a $3.00 soda."}
{"text":"Service was great, food was good, had a black and tan it was good, no one offended me, I'd go back. Thumbs up"}
{"text":"Food=2 Service=3  For a bar/grill this place is friggin spotless."}
{"text":"No cover to get in, and I get to shoot respectable liquors like Red Stag for $1 each?   Is this real life?  Vine is probably the most inexpensive, happening place you can spend a Monday night. And it's not just for college kids--I see a mix of people hanging out to sip on drinks and watching football in the evening. Later at night, there's live music and a patio with a passable social scene. There's a good bar menu, and while there are only two bartenders--they're rather efficient.   I understand not everything likes to get crazy so early in the week, but at this dive, the Tuesday morning after is worth it."}
{"text":"My bf and I love coming here! The wings are always fantasic! Especially grilled! I also really love the French fries! Mark is our favorite bartender"}
{"text":"Okay, Vine.   This is place is a pub and serves pub food--there's a problem here:  As I am a vegetarian and I ordered the Gardenburger, it's not really all that fair of me to review a place like this based on what I ate.  If the Gardenburger sucked, it really wouldn't be the fault of the restaurant.  To review a joint like this, you really have to try their meat dishes (most of the menu) and/or their beer.  Since I neither eat meat nor drink alcohol, I can't do that.  The Gardenburger turned out to be better than the one I've had at a lot of places, so at least there's that for what it's worth.  So what's left?  Well, the fried zucchini was quite good.  Service was excellent and friendly.  This has apparently been a favorite family restaurant for many years and still holds this distinction.  Minuses?  Well, it's noisy, but with all the kids and ASU students present on a Saturday night, that's no surprise.  The plates they give you to hold the food are surprisingly small, but that's about the worst thing I can say about this place.  Overall, I had a very enjoyable time here.  Next time, I'll have another veggie Jo burger with fries, a Diet Coke, maybe an appetizer, and just chill.  Fair review or not, I recommend Vine Tavern & Eatery.  I think you would too."}
{"text":"I was excited about trying food from this place...but it was a huge letdown for me.  I ordered some food to go and I did not care for it.  I ordered 6 bbq boneless wings and 6 traditional wings (medium sauce) with fries.  I also ordered a breaded tenderloin sandwich...which most restaurants don't have around here.  I am from the midwest so it is more popular there.  Anyway, the boneless wings were not good at all and they even gave me the wrong bbq sauce.  I have had better frozen wings from a grocery store.  The traditional wings were just average at best.  The fries here were below average.  The only highlight of this place was that the food was ready on time and they lady at the bar was nice."}
{"text":"Truthfully? Typical bar food and nothing memorable. I realize you don't go to a place like the Vine for outstanding cuisine but how hard is it to make flavorful food? The wings were chewy. The mushrooms were good though."}
{"text":"Been here a few times - my friend Mark comes so much he practically owns the place.  Staff does a good job,  nice sports atmosphere,  enjoyable hangout -excellent wings. Had a midori  sour, tasted either watered down or a little light on the alcohol."}
{"text":"The vine is my new favorite spot for football, beer, and wings.. in order! Great beer prices , good food for a reasonable price . I would recommend this place !!!"}
{"text":"This place is the place  to be during Teach for America induction/institute.  Does it deserve so much attention?  Probably not, but they step up to the waves of alcohol hungry corps members and keep us happily intoxicated.  Now, I have no idea what it's like during the rest of the year when ASU isn't over run by TFA, but during our summer training, it's often a mad house.  What's good: they have constant specials as well as a regular happy hour.  I managed to get several large beers (I believe it was one angry orchard and a blue moon), shots of tequila (x3) and their apple pie shooter, with tip, for under $45 -- oh! and an order of fried zucchini coins.  I was contentedly drunk and happy with the weight of my wallet (I aimed  to spend $40, so it wasn't bad at all).  I'm a beer novice, so I can't at all speak to the quality or selection - but, hey, it's pretty damn affordable (maybe that's just a beer thing...I used to drink a lot more \"queer beer\" than anything else :) ).  Now the zucchini coins were lovely.  Crisp on the outside, soft on the inside.  Sadly, the kitchen closes well before they do (it was closed by 11 pm on a Friday).  When it's crazy in here it seems that food orders may not find their way to your table, so you'll have to keep your eyes open.    Still, the bartender (don't know his name, but particularly the guy with the pony-tail) is on top of his game.  he does a pretty good job of keeping track of who's up to order and juggles cards/cash, cups and customers pretty well.  Space here is ample, with a misted patio and kind of a three tiered room setup, with pool tables in the third \"tier.\"  There are tables, booths and stools inside.  The decor is pretty blah and the music selection is definitely not a focal point (at least I hope not...that would be disappointing).  I've heard they mix it up some, but most of the time I haven't noticed.  It's also not too loud.  If you're looking for a hip notable ambiance, this isn't the spot for you.  If you just want to hang and not have to scream to talk, this is a decent spot.  I won't be driving across town to get here, but if I'm on campus or in the area, I'd meet friends here."}
{"text":"Woefully understaffed.  One bartender and one server for the whole restaurant.  Left hungry and thirsty."}
{"text":"Can you go to ASU without getting drunk at the Vine at least a few times? I don't think so.  It must be a prerequisite.  The great thing about the Vine is that it's just this dive bar that college students seem to love for some reason.  The beer is cheap, the food is good and it's probably within walking distances of many apartment complexes.  They have a mighty fine fish and chips if my memory has held up and their beer specials usually result in $2 pints for a whole night. No wonder I don't remember much about the food."}
{"text":"The best place in town. Affordable drinks, good food, great company. A place where they know your name. Never a dull moment at the vine, I come here from the west valley to party!"}
{"text":"Just like it was when I went to ASU years ago! Packed on a Friday Night! It has that Bar/Pub smell...the smell of Beer! There were plenty of Tools, Hotties, and Chicken Hawks present. I was there to meet a Buddy and head out for a Night Ride on Purple Rain (my motorcycle). It was too crowded to try some wings like fellow Yelper E W. suggested. I will have to return to see if she was not lying (I am sure she knows the deal as she likes them Extra Crispy). If you are one of the younger 21-25 year old ASU students...You should be able to get your sexy on here, that is if you have any game at all."}
{"text":"I used to love this place and sang its praises regularly. Unfortunately, the place is not what it once was. The happy  hour specials are nothing terribly special anymore. The staff is mostly disinterested in helping customers, except for Amy, who seems to genuinely care.  Going during lunch is a lost cause anymore. I'm not one of the blonde's \"regular\" customers, you know the ones, the Norm - like barflies that have the chance to sit there and flirt with the bartender all day 3-5 days a week. Since I am not one of her regulars, getting her attention is a total pain in the ass. On top of that, don't dare have any questions, the attitude you will get for inconveniencing her with them is almost insulting. She already has trouble setting down her phone to actually look at me while I am ordering.   Once my food comes out, I am on my own. No second beer for me apparently. No napkins either, despite the fact I am eating wings.  About those wings. The Vine has AWESOME flavored wings, but sometime recently, they have switched to a smaller wing size. What used to be a good value with great flavor varieties is now less so. The value just isn't there. I'm not looking for ultra cheap. But hey, a dozen wings should not leave me wondering where the meat was and still hungry only 10 minutes later.  The beer selection has taken a hit. The variety is now taken up by too many similar beers. The service staff, even outside of the afternoon bartender is disinterested in anything other than turning my table. Sadly, I may soon be looking for a new place to go hang out."}
{"text":"Woohoo! As good as it gets! For what it is.  Now I had fun here. Great staff, The food was good bar food. Its not a 5 star restaurant and the food doesn't require preparation and planning by some Le Cordon Bleu trained chef. But its bar food and its bar food done right! I had a great time with friends here last night. We split some wings, a pizza and appetizer sampler. Everything came rather quickly and was very good. And cheap! Our waiter was great. Very funny and friendly. I was also very appreciative to our waiter for brewing me a fresh pot of coffee. Now we picked this location over the other one because this one never has a cover charge and as it was further away from ASU, we figured (correctly) that it would be perfect for a laid back night out.  Apparently I am getting too old to stay out as late as we did..."}
{"text":"Been here for many years but have seen a recent decline in quality service. Felt scolded by the bartender today at lunch. Felt disrespected as a customer. Service sucks stay away. \"bad service = bad review\""}
{"text":"I have worked next door for 9 years, so I have spent a great deal of time at this spot. Staff could not be friendlier..Amy, Tedra, Caitlin, Deene, all of them are awesome!!  Drinks are always finely poured, and food has never been anything but perfect for 9 STRAIGHT YEARS!!!  Can not beat that!!  Nice outside patio for you smokers or to enjoy the beauty of Elliot road...haha  Stop by and try their wings and a beer...Tell them Monica (their hairstylist from Salon 7000) sent you."}
{"text":"I don't care if this place stinks, I don't care that it's probably filled with frat guys looking for a fight and 50c beers on certain nights of the week, and equally as much I don't care that they serve $2.83 (or whatever it is) well long islands/margaritas/etc. The only reason I come here is for wings and fries. Something about their wings puts them in a category above everywhere else in Phoenix for me (except other Vine T/E's). I know plenty of people that don't like them but to me they absolutely dominate Native/BWW/ whatever you want to throw out there. Nice and crispy, tangy sauce, and cheap during happy hour every night of the week. Throw in the fries which I think are the best I've had in Arizona (not saying much) and I'm a huge fan. Cheap, dirty, and delicious. If this place was nicer and had a better vibe to it (or maybe the rest of the food came close to matching the wings/fries) I could throw in the 5th star but as of now it gets a quality 4 star, just make sure you know what you're getting into."}
{"text":"We have come to this location several times, the wings and food are pretty good, nothing spectacular but still consistently decent. This location also is close to the house so we thought we'd pop in for some wings and a beer, to enjoy the U Of A game, at what we thought was a sports bar. Turns out, it's only a sports bar if there isn't an ASU game on. If there is an ASU game on, it is an ASU bar and that's that. So we spent plenty of money on our food and drinks, only to have the sound turned down on the game that we came here to watch, halfway through our food, when the ASU game started. When we asked them to turn the sound back on ( there was only one other table in this section and they weren't watching)we were told no. We were told that he would not be allowed to change the volume of one of the several tvs, in our section because \"They are an ASU bar\" That's it. No compromise, no contingencies, no consideration, and for us no sound. We would have stayed a lot longer and spent more money had they not taken away part of the reason that we were there.  Needless to say, we won't be back for our football games. There are plenty of other places that are happy to take our money and show all of the games."}
{"text":"This is your classic neighborhood bar. Love the hamburgers fries wings, and even the salads are really good. Every Thursday they have Stein night, which my family loves and we frequent probably once a month. The price is right the food is good the drinks are cold. They have plenty of TVs for sports so this is A big sports bar."}
{"text":"This is probably the trashiest bar I've EVER been to and I've been to some pretty bad places. A guy we were there with went outside and got punched square in the nose and then the puncher after landing said punch (pretty nice shot, had the punchee bleeding) ran away. Funny as anything, but a shitty move... The bathrooms are gross. The floor was sticky (not just a sticky spot but the WHOLE floor).  Oh Vine Tavern even though you made me laugh my ass off I'm not sure I'll be back..."}
{"text":"Been here many times and go for the wings. Best wings in the valley. Hot and Sweet Chili. Bomb"}
{"text":"The place has really delicious wings! They have a ton of sauce options and let me be the one that recommends the garlic chili....on point! They have a decent happy hour menu. It's your typical sports bar, a bunch of TV's and young folk/servers. Haven't had any issues thus far and will go back"}
{"text":"Place is ok. Mostly odies bar atmosphere but food and drinks are good. Prices are around 10 bucks for a burger."}
{"text":"Went there only because one of my friends loves this place. Seriously not a huge fan of bar food but the wings were super good. Also orders nachos minus the sour cream and beans and it actually was good. They put a ton of salsa on the side (real salsa too, not Pace) The hi-light.... happy hour drinks are REAL drinks! And it goes on until 7 so it's great after work. Only downside was the server pretty much ignored us the whole time"}
{"text":"Oh the Vine. My go-to spot after I play in my co-ed soccer games in Tempe during the week. Nothing like a cold beer after 90-minutes of hard play!  First of all, they have the best staff! I may be biased as I have a few friends that work there but nonetheless they treat all their customers with incredible service. If you're going to be sitting up at the bar, ask for Carter or Matt! If you're going to be sitting at a table, go to Margie, Marcus, Jordan, or Casey. They are all fabulous!  The Vine is known for their wings...really they were given a nod for best wings which I completely agree with and support. They have great sauce flavors and you can mix and match as you please. Boneless or bone-in, they're delish.  The have these tasty yet dangerous little things called the Apple Pie shot which is made at The Vine. I highly recommend trying on or ordering a round for the table because it's something everyone will enjoy. Just be careful not to have too many as they do pack a punch!  You can't really go wrong with anything you order on their menu. They have a wide selection of options but a few notables would be the cheese fries, tater tots, nachos, fish tacos...and the list continues.   A great spot to bring some friends to watch your favorite sports team play. Since they are in Tempe, they do support ASU, but even this Wildcat can overlook their poor taste in sports teams for their wonderful food and staff! :)"}
{"text":"We came here for dollar drinks on a wednesday and had a blast. They have darts and pool in the back, plenty of seating and great drinks. The people were friendly and if you get too drunk they will let you leave your car there overnight, you just have to let them know cause if you don't they will toe it."}
{"text":"It took me four years at ASU to finally step foot in the Vine. Now I've been there twice in two days. Both times the bartenders were very friendly and helpful. It was early in the evening both times I stopped in so it was laid back and not very busy.   Try the apple pie shots! I don't even know what's in them but they are cider-y and sweet and delicious and cost A BUCK. College kids, you can't beat that.   I didn't realize they have a full menu, and I'd love to go back and try their sandwiches or baskets because they actually looked pretty tasty."}
{"text":"Cool little spot to catch a game. They got a pretty big menu too. Their food is typical bar food but it's good! I had a buffalo chicken wrap and it was delicious!"}
{"text":"Dive sports bar....tons of tvs, wing night on Tuesday nights. Menu has a good selection of items I would try. I would order your wings extra crispy. Plenty of sauce flavors...favorites are the garlic, spicy honey mustard, teriyaki and hot. I would return to watch Football. Great beer selection."}
{"text":"just tried doc and eddys down the street for the 1st time in 25 year...big fat wings for less money ...."}
{"text":"The Vine is a good place for wings, beer and burgers.  The last visit, I tried the hot and medium wings with a few other people and as always, everyone thought the wings were good.  The beer selection and the happy hour pricing is also reasonable.  The wings could be a little meatier, but they were crisp, well seasoned and lean.  They stand out among for wings mainly because so many places have the lower quality fatty ones, which I just don't like at all.  The seasonal beer toped it off.  They had the local Four Peaks Pumpkin Porter, which was new to me, but actually really good.  Highly recommended if you like smooth, rich Porters."}
{"text":"I must confess...I was incredibly impressed with their fish n' chips here!  I'm not a fan of their staff...I get it, you're busy, but at least acknowledge someone like me who is going to make an easier drink order than someone who doesn't know where they heck he or she is in some drunken stupor."}
{"text":"The Vine is maybe a 2 minute car ride from our home! My boyfriend and I enjoy drinking a Stein & sharing some wings. The chive fries are great. However, recently the quality of the traditional bone-in wings have been awful!!! They are so tiny, & barely any meat on them. So, we decided to try the boneless. Not that great. I rather drive to Buffalo Wild Wings & enjoy some REAL wings!!! But the service is always good!"}
{"text":"Love this place and the service! There's not a high turnover for employees so I feel like the staff is well knowledged. Good prices and great daily specials!"}
{"text":"I can't get enough of one my favorite college stomping grounds from about 15 years ago! Whether it was during my four hour long film class where I would listen to lecture for a few eat wings and beer then come back to sign in or on Wednesday nights for you call its this one of my og drinking spots back in the day. The countertops have changed from the old wood ones to granite and there is now a patio that I don't remember but the inside still looks pretty much the same. Lot more tv's all flat screens now. Pool tables towards the very back and two dining areas. I still come for the wings and cheese fries. More flavor choices than I remember but maple hot is still my go to. Its become a Saturday afternoon habit but I'm kinda surprised at how dead it is then. I don't if its because we have a lot fairweather Sun Devil fans or if this just isnt saturday afternoon football bar. Either way nothin but love for the joint!"}
{"text":"This is the first time I've posted a photo to Yelp and I am because I feel I must as a community service. The Vine is a perfectly legit place to go when you just want to kick back, get a standard beer for cheap (except for the Guinness--it tastes like they don't clean the lines) in a place that is not disgusting, and sit outside on a nice day on their patio and admire the parking lot. This photo, however, is of the fish 'n' chips I was served on the evening of Friday, January 15, 2016. On Fridays the fish 'n' chips, normally $10.59, are $8.59 (each day of the week The Vine has a different all-day food special and drink special separate from their happy hour discounts). I decided to revisit my Catholic days and do the \"fish on Fridays\" thing. Having previously visited this dive, I already knew that I was going to get some Van de Kamp's frozen something-or-other thrown on the frypan, not an entree made in-house. Still, this is paltry to the point of scandalous. I originally thought that the kitchen had made a mistake and prepared some kind of appetizer. I asked a server about it, and she explained that the portions on Fridays are smaller because the price is cheaper. In my world, a \"special\" means that a few dollars comes off of the same item you would get every other day of the week, not that you get less because you pay less. Even so, if $8.59 gets you three fishsticks, I shudder to think about what $10.59 gets you--four fishsticks? All I could do was enjoy (\"enjoy\") my fishsticks 'n' chips with Heinz malt vinegar, a beer I can't remember, and laugh at The Vine for being typical and at myself for being foolish. Order the appetizers instead and for happy hour prices get exactly what you'd expect. P.S. If it's true that Jesus called a bunch of fishermen to be his disciples by telling them that he would make them fishers of men, couldn't he at least hook a pious sister up and tell them to get me some decent fish 'n' chips on a Friday?"}
{"text":"After driving around trying to choose a place to eat and have some drinks i made a immediate u-turn when i passed the vine. Its been a long time but i love their wings and burgers! This place looks the same every time I come here, which i love. It is clean and well maintained. This is a total college bar but its open and friendly to everyone! I ordered 6 traditional wings and the pepper burger. The bartender was totally cool and joking around. He took my order and got me a beer very quickly. After a hour or so karaoke got going and it got slammed in there. They had beer specials and everyone that came in was so friendly. If your looking for a fun chill place with great food and awesome beer specials look no further."}
{"text":"When you walk into Vine Tavern & Eatery, you know you are in a neighborhood hotspot. It is a typical tavern environment with both bar and dining room seating, and TVs covering the walls.   The waitstaff is really nice and attentive. If you choose to seat yourself in the bar, you will want to make sure the servers have noticed that you sat down or you may have to wait a few minutes for service. Personally, I go to Vine almost every other week for HH, and have never had an issue with a lack of service.   There HH is amazing and they have daily specials that are always on the menu. There HH runs from 3pm-7pm, which is much longer than most restaurants. Just make sure to get your food in before the time runs out!   The menu is HUGE and the food is standard bar fare. The medium wings are really tasty and a great HH deal.   Happy Eating!!"}
{"text":"Settled in with our small group for Sunday football. There is no breakfast menu here at The Vine, only the regular menu. The wings here are always good. I did ask for them to be crispy fried and they were not, but hey... it's the Vine. Plenty of beer choices, and TV's aplenty for viewing all the games. Service was good enough - but the water. Jeez - worst tasting water I have ever had. There has to be some way to filter that stuff - pure yuk."}
{"text":"The Vine continues to be a local hang-out for a few choice beers, some wings, and a burger. The food is good enough, but the service is incredibly better. I do appreciate that you're listening to your customers. We'll continue to visit here and hope for improvement in all areas - maybe a few more beer choices???"}
{"text":"We came to get some noon day sun on the patio. Service was quick and friendly.   I had a smoked turkey wrap and fries. It was really good.  Fries are just so-so. Hubs started with a bloody Mary.  I didn't try it, but it looked good. He had a Monte Carlo Club, it came with corn chips. He enjoyed that. The inside of the joint is dark and kind of dingy.  Man heavy population.  I think I was the only girl in there.  It is a sporty go-to place.   The bathrooms were clean. Big parking lot."}
{"text":"What happened to the burger baskets?  Have to say I was slightly disappointed when we made our way to the Vine.  It has been quite a few years since my last visit, but we were regulars so when we drove past I was excited to make that U-Turn and head on in.  We ordered our old favorites which included burgers, wings and beer.  How can you go wrong right?!  Well sad to say that the quality of the food seemed to have gone down quite a bit from the juicy fat burgers of yesteryear.  Maybe it was an off day, but none the less, sad news.  I typically like to give the benefit of the doubt before hurling less than 5 stars in an establishments direction.  The straw that pushed me to 3 was the service.  It was late afternoon and the place was not busy at all- I don't understand why service is bad when the place is not busy.  Oh well- I will definitely try the Vine again soon because I am so hoping it was a fluke..."}
