{"text":"Great food, great service!
It is really Gourmet Pizza!!
We love the Thai Poulet and Petit Jerk. 
You must have the Brownie for desert... Decadent!"}
{"text":"Stopped here for a quick lunch with a customer.   Excellent half pizza with Cesar salad.   Great location.  Great service.  Food exceeded expectations."}
{"text":"Violet Angel used to be one of my two favorite places to go over lunch in Ste Anne, the reason being their delicious thin crust pizza. The service is not always very fast but always friendly but then I have only been there for lunch, so maybe they time the food better at dinner time.
For the sake of this review I am trying hard to remember which pizza was my pizza of choice but it's not coming back to me. Sorry, you will just have to trust your own instinct on this! ;-)"}
{"text":"Fresh ingredients. Good service. Trendy industrial themed interior. And most importantly, delicious pizza! Grab a glass of wine and enjoy the atmosphere with close friends. Everything looks awesome!! Bon appetite!!"}
{"text":"This place is great and right on the canal! We got the tomato bruschetta and two pizzas to split! The crust on the pizza was my favourite part, thin crust and super crispy! Also a lot of unique topping options!"}
{"text":"Really great restaurant with great service and fantastic food.
We went as a large group and was able to sample quite a few items on the menu. I honestly can't say that I disliked anything. The food is fresh and made to perfection.

My only \"negative\" feedback would be about the vines over the tables. We had to cover our drinks and food as bugs were falling in them, but the view of the water and the terrace itself were beautiful."}
{"text":"I really like this place. Probably best pizza in the city. I love how everything is made onsite. The extra work and care they put in the details, that's what makes the difference. The dough is incredible, the sauce is tasty and many different toppings to choose from. More of a gourmet style pizza. Beautiful little patio on the water. Truly enjoyable. I respect artisans and the passion they put into their work, it really makes a difference when people care. Keep up the good work!"}
{"text":"Absolutely THE best place to eat in the West Island.  Mouthwatering salads, fabulous pizza, amazing grilled chicken & pasta dishes... all made with the freshest local ingredients and served to you by friendly & courteous staff. 

In the summer, the terrace is an oasis nestled beneath a vine-covered pergola where you can enjoy the waterfront ambiance while sipping Sangria and enjoying a leisurely meal.  

If you have not tried this place yet, you're really missing out!!"}
{"text":"This is a great place for thin crust pizza. Lots of delicious and creative topping combinations. The terasse in the summer is really beautiful, it's full of greenery and right by the water."}
{"text":"PROS:
-Clean, warm, cozy interior. 
-Friendly, fast service.
-Great place for a dinner party or casual lunch.
-Great food. The lunch menu is great, you can get a couple slices of pizza and a massive salad together. 

CONS:
-Salad is a tad too oily for my taste."}
{"text":"Cute little restaurant in Ste-anne-de-bellevue. I like to go in the summer and sit on the terasse with some sangria. The pizza is amazing!!"}
{"text":"What a great restaurant in quaint Ste Anne de Bellvue. Wonderfult food at reasonable prices. Nice wine list too. Check out the Mac & Cheese & the homemade desserts !"}
{"text":"Selon les critiques précédentes, ce resto devrait être le meilleur du West Islande. Intrigué, je me suis donc rendu sur place avec ma bien-aimée afin de constater par moi-même. Dès mon entré ici, j'ai été séduit par le décor et l'ambiance branché. 

Ce resto se spécialise dans les pizzas gastronomiques, les assiettes de poitrines de poulet et les pâtes italiennes. Des bières de micro-brasseries sont offertes. Cependant, la sélection de vin est réduite et se limite à quelques choix de rouge ou blanc. 

Suite à la lecture du menu, j'hésitais entre deux choix d'assiettes de poitrine de poulet. Lorsque j'ai demandé conseil à notre serveuse, celle-ci n'a pas été en mesure de m'expliquer la différence entre les deux assiettes. Elle s'est contenté de relire ce qui était écrit au menu pour tenter de m'apporter des précisions. De toute évidence, elle ne connaissait pas le menu et n'avait jamais goûté la cuisine de son patron. Lors qu'ensuite, j'ai fait mon choix, elle n'a pas été capable de me suggérer le bon type de vin pour accompagner mon repas. Elle a cafouillé en parcourant nerveusement le menu des vins avant de pointer un Massi au hasard et de me lancer : \" ben celui-là, c'est toujours bien... \". Donc un vin rouge avec du poulet ? De toute évidence, la pauvre fille n'y connaissait pas grand-chose dans les concepts de base en gastronomie.  

Lorsque nos assiettes sont arrivées, j'ai constaté que mon poulet était trop grillé donc très sec. La marinade, qui semblait très invitante à la lecture du menu, n'était pas assez relevée pour vraiment faire sortir le goût. Ma copine n'était pas non plus enchantée par son choix de pennes sésames avec sauce aux arachides qui étaient pâteuses. De plus, le service peinait à servir les table avec rapidité. 

Bref, suite à une première visite, je ne suis pas très impressionné, ni par le service, ni par la qualité des assiettes. Le Viloet Angel est certes un très beau restaurant situé dans un endroit charmant du West Islande, mais qui n'a rien pour s'imposer comme une table gastronomique. Désolé, l'endroit ne mérite pas les 5 étoiles offertes par les critiques précédentes. 

Je le dis et le redis, une expérience dans un resto ne se limite pas à un décor \" trendy \", à un menu nouveau genre et à la beauté des serveuses. Il m'en faut bien plus pour donner la note ultime."}
{"text":"One of the cutest restaurants I've been to in the west part of town. The food, atmosphere and service is all A1. The drinks and desert make the cut as well. Would recommend this place to everyone. My favourite is the Hellas plié, peanut pasta with chicken and for desert the volcano chocolate cake is delicious served with ice cream on the side, the have a good selection of wines and a good alcohol menu as well"}
