{"text":"If you are looking to impress your date...this would be the place to be. Driving to the place you are definitely scared but once you notice you can have dimmed lit dinner and after a stroll out to the tunnel onto the beach...well let's just say...you are not going home alone!

P.s. 
Leave a blanket in the trunk;)"}
{"text":"This place is amazing! Great Blood Mary's! We wanted brunch and the owner/chef was nice enough to make us corned beef hash- not even on the menu. Must try this place!"}
{"text":"Love Vita Urbana everything from the atmosphere and employees to the food. Living in battery i am grateful to have this little gem as part of our neighborhood. The sliders and warm chocolate chip cookie dessert are a couple of my favorites. 
The little store in the back is great for when you need a great bottle of wine or a six pack."}
{"text":"Area is definitely cool.  That said-  service needs to improve. Seriously, quit trying to be a French bistro be a neighborhood hot spot. Comfort food that changes and remains the same. Soup. Get a refrigerated case with Mac & Chz. Maybe a salad. Turkey Sammie, salad, soup."}
{"text":"Mac and cheese is really Mac and vinegar with with rubber chicken in water. Absolutely disgusting. Inedible."}
{"text":"Great patio dining.  Denver steak and short ribs were perfectly prepared.  Save room for dessert!  And start off with drinks and yummy popcorn!  
Don't forget to pick up a bottle of wine for later."}
{"text":"This is an awesome little gem in an up and coming area. The market has some great local selections and a great beer and wine selection. The food is perfect for lunch or dinner because it's small plates. One is the perfect portion for lunch and two would be great for dinner. If you come with multiple people it's a great place to order a little bit of everything and share. The Mac and Cheese is fantastic and the Frites are an amazing side to any dish. They are served in the cutest containers, which really adds to the whole experience. The staff is very friendly and they all seem happy to be there. 

They have a little something for everyone, smoothies, desserts, coffee, cheese plates, and the market has everything from fresh cheese to house hold and pet care items. The decor is lovely, it has an industrial feel but looks so classy and well done. 

This place is such a great addition to the area and I will be a frequent visitor for sure!"}
{"text":"Got a mocha, but it was lukewarm, mostly tasted like sour milk, and was very over-priced. Restaurant itself was nice and clean."}
{"text":"What a great addition to the neighborhood! Great coffee and pastries for breakfast (I often pick up boxes for client meetings). I am in love with the breakfast empanadas and cinnamon muffins. Have only had dinner food once and tried the croquettes which were pretty good. Love the atmosphere, very modern but cozy too. 

The market in the back has been a god send. Unexpected Company coming in 20 minutes? They have fancy cheese, crostini and beer and wine. In the middle of making dinner and realize you're out of noodles, no problem. I think the real 5 star touch is the people. Everyone there is so friendly and will go above and beyond to make sure you leave happy and with what you need. 

They recently added a little patio in the front also! Great addition to Battery Park!"}
{"text":"I was super excited to hear about this new restaurant? Brunch spot? Upscale general store? Visited on a Saturday morning, at around 11am. Maybe I got the wrong info about brunch, because their menu was small plates and some breakfast-y items (oatmeal, croissant, Danish, breakfast empanadas...) but no real substantive brunch foods. So ended up ordering lunch-type items instead.

First, we ordered smoothies - the mango and the strawberry banana. I was expecting real fruit, but alas, both were definitely some sort of sickly sweet mix. Not impressed.

Next, I got the polenta (deep fried croquette type presentation with sautéed mushrooms on top) and the tuna tartare. Portion size was tiny, but delicately plated. Looked nice. But the tuna was definitely not high quality, and brought the dish down. Although it did come with a little dab of seaweed salad, and a citrus gelee, which was nice.

My friend got the \"breakfast\" empanadas (which tasted like a small, uncheesy hot pocket) and the beef sliders (which weirdly came with a large piece of spam? in addition to the mini patty. Not entirely sure what it was doing there).

Overall, the vibe is very up-to-the-moment - lots of dark wood, marble countertops, etc. could be a nice place to grab a drink if I lived in the building. The little general store in the back could also be convenient if I lived in the building and needed a small bottle of shampoo or a block of high-end cheese or frozen bone broth. I really want to like this place, but this visit didn't do it for me."}
{"text":"Gorgeous restaurant with exquisite food. Really friendly with affordable prices. Will repeat and will recommend. Thanks for the good time and food!! :)"}
{"text":"The area is really cool, when you walk in it's a really nice restaurant up front with a nice gem of a market in the back. The food was fantastic and dessert was great. Love the concept of this place."}
{"text":"In town for a conference this week. My husband and I were staying nearby so decided to check out this spot. Service was excellent from the beginning! We had the short rib, Mac and cheese and pasta! The Mac and cheese and pasta were both excellent. The rib was a little chewy and I wasn't fond of the sauce it came with.....So you may wonder why I'm giving 5 stars here.... well I asked our server if we could walk to the edgewater pier from the restaurant, she not only showed us but walked with us almost the entire way to make sure we didn't get lost! How sweet! Places like this with staff that only wants to keep striving for excellence will only just get better and better... I shall recommend vita Urbana to everyone ! Great job! Will come again when I'm back in town ."}
{"text":"This place is new apparently. They totally rock too. We were at this terrible dark dreary over priced pizza joint just around the corner. Cha as if your place was any good. We walked over here and everything changed. These guys know what they are doing. We got drunk and bought groceries to boot. Great little spot."}
{"text":"I was really excited to try this place. The food was good-ish. Service was slow (despite there being very few people in establishment), but friendly once you could get them to talk to you. 

WARNING: If you're under 40, your money is no good here. Extreme age-ism. Chef came around the bar twice asking after the food and never even made eye contact with my girlfriend and I (in our mid twenties). We were waited on well after everyone else and it took 10 minutes at an empty bar to even get a menu.

But holy cow! I'd deal with it and come again and again just for that mousse."}
{"text":"I recommend this place to everyone. I ran by Vita Urbana (literally) while I jogging to down to Edgewater Beach. Coffee shop/bar place attached to an apartment building? Was this exclusively for those apartment dwellers? I was so enticed, I biked over first thing the very next day. It's got a urban-modern chic feel. I felt little underdressed in sweaty bike cloths, but the woman who was chatting with us and the other staff made me feel at ease with their down to earth vibes. Not only do they serve breakfast, lunch, and dinner (along with a full bar), they have a little convenient shop in the back with all the necessities you might need. 

I ordered a latte and baked blueberry oatmeal, and my boyfriend got a black coffee and breakfast empanadas... and a Bloody Mary for a mid-day pick me up.  They serve local coffee & brew it with care. The food was obviously made from scratch, which equals made with love- Everything was delicious. It was very reasonable lay priced too! During a weekday morning, there were a few other tables, a family headed to the beach, business people working on laptops... it is a place welcome to all.  I'll for sure be back there for dinner soon."}
{"text":"I've tried this place a couple times- once for dinner and once for breakfast.  Each experience left me impressed with the quality of the food and the service.  They went above and beyond to meet our needs (i.e. made fresh croissants when they had already sold out and we wanted some late morning).  

Clearly they're still getting their feet off the ground, but this place has ton of potential.  Great bites, well-decorated with a cool vibe, and unique concept.   The complaints I read on the service can be dismissed based my my recent experiences.  Certainly could use a facelift on the product offerings in the convenience store, do some marketing in the area, and provide more information the website/Facebook page.  Overall, however, I hope they keep moving in a positive direction!"}
{"text":"Be careful! You might walk past this interesting addition to Battery Park. An interesting mix of a apartment building cafe, intimate restaurant and neighborhood artisan market, Vita Urbana might be a jack-of-all trades type of thing. While the pork confit mac and cheese looked appetizing on paper, it really didn't come through. The cheese was flavorless and the pork was just there. The cookies and hot chocolate dessert certainly was presented well, but it wasn't enough to make up for the mac and cheese. The truffle frites were good! They are a nice shareable portion size too."}
{"text":"This place was delicious! The service was prompt and friendly. Our meals were hot and perfectly prepared. The inside of the restaurant was beautiful! Seriously stunning. I highly recommend checking this neighborhood restaurant out!!"}
{"text":"This is a great add to the neighborhood. The service was great. We went for happy hour for a drink and ordered the bar nuts which had the perfect kick. Looking forward to going back for dinner and looking around at the market!"}
{"text":"So sorry to hear the news that Vita Urbana has CLOSED:

https://www.clevescene.com/scene-and-heard/archives/2017/12/19/vita-urbana-in-battery-park-has-closed

Looking forward to more great eats from this location, as well as from the chefs and staff."}
