{"text":"I went here for brunch. The food was decent but the service was the worst I've ever had.   They forgot half the things we ordered.   The server never showed up again after taking our order so we had to flag down the food runner to let him know what was missing and he came back with our bill 20 minutes later."}
{"text":"I visited Vita Sociale last Saturday night and was really impressed with the food. I had the gnocchi and they were excellent and homemade. The service, however, was awful. Our water was snobby and acted like he was doing us a favor the entire time we were there. I probably won't be back, despite how good the food was. There are other restaurants where I can get tasty Italian food in Toronto without feeling unwelcome."}
{"text":"$15 for a beet salad with goat cheese? I peered into the oversized white bowl and saw way down at the bottom: four thin slices of red beets, four mini yellow beets and two baby red beets.  Two dollops of goat cheese.  I think not.  The mains tasted like standard, somewhat bland Italian pasta/pizza and the portions looked especially small because everything comes in giant bowls.  Throughout the meal we had to wait 5-10 minutes each time we tried and grab our server and had to ask for items like pepper and parmesan more than once.  At least three different servers came to our table throughout the meal, none of whom communicated with one another.  When it finally came to pay, a fourth person brought the pay terminal and walked away, leaving us to figure out payment by ourselves.  One lovely server came to us when we called her over from a different part of the restaurant because we were having trouble with the pay terminal, and when we told her about our experience, she apologized.  She was so embarrassed.  They were understaffed that night, which she admitted is no excuse.  The manager was nowhere to be found.  There are half a dozen Italian restaurants in the immediate area and I have had much better food and service at all of them.  A $90 bill for one salad, two mains, two glasses of wine and horrible service is completely unacceptable.  (I will add right here that the support staff were very on the ball, but all they can do is clear plates and bring pepper.)  It is no wonder that this place was half empty on a Thursday night, while all the others were packed with customers.  Eek!  Me thinks I will not be returning!"}
{"text":"Apparently my 2 star review was too generous because this place didn't last a year! Bye bye"}
{"text":"Love the space and the large open doors on to the street.  Restaurant wants to be a busy hip place but they need to improve the food and service if they want repeat customers.  Service was friendly when we could find the waiter.  Very slow!  I ordered the Toscana pasta and it was 'meh'.  My friend had the pizza and it was about as good as my teenagers make.   I was looking forward to my coffee but it was lukewarm and I had to ask for cream.  Not a great experience."}
{"text":"Pretty disappointing. Been to Centro a few times, liked it. Was pretty excited to try the new venture, knowing it was a departure from the previous place. I'll not comment on the service - it's new and they're working out kinks. No problem. It was friendly but not great.  The food, simply put, was a let down. Maybe our expectations were too high. My guest and I had a salad and the prosciutto with compressed melon to start. Both were reasonable. The prosciutto came with two over-sized croutons that just didn't belong on the plate. The just had no business being there.  For mains we had the Toscana (pasta with sausage and rapini and chilies) and whatever the one with speck and peas is called. Again, both were reasonable but really unremarkable. I was also bummed that the menu on their Facebook page claims they offer Carbonara but it wasn't on the menu. I'm a big Carbonara aficionado.   We'd hoped to be impressed - possibly wowed, but it was really pretty \"meh\". To be honest, given the price point, I'll go somewhere like Grazie for 2/3 the cost.  I'll likely try it again for dinner in a few months but, I don't know, just underwhelmed. My guest was more disappointed than I was, but isn't the reviewing type."}
{"text":"I went here recently alongside a good friend of mine; their setting an dine aroma look was well presented although service an food quality was bland an overrated due to what the place looked like. staff needs to be more orianted with diners an communicate more; this places location is fairly decent pricing is not worth what they are; more like little appitizeres then mains in my personal opinion. Although my friend said shes not a heavy eatter an would take so little to fill her up, their food quantity wasnt even enough! We decided to head over to another restuarant afterwards for a quick to go!   Until they fix their service which brought down everything; I wouldnt reccomend coming here."}
{"text":"I was in the upstairs dining room for a birthday on July 26. Our server was Kosta (his name was on our bill). What an @SSHOLE. He asked my bf what HE wanted to which he replied a steak. Kosta rudely interrupted and said, \"so 2 steaks? \" no. We said A STEAK. When we tried to correct him f*cker wouldn't let us talk!  He kept interrupting us! We were relieved when another gentleman said he'd be taking over.  To that I added that the server before was rude and impatient.  Unfortunately the time came to ask Kosta for our bill to which we waited 25 minutes for.  We decided to head downstairs. He seemed so overwhelmed with our party.  FINALLY gave us our bills which were ALL WRONG.  We had to tell him no we didn't eat this or drink that. I gave him 0 tip as he's too st*pid to even serve food!  The food was better then the one time I had been there on my own free will."}
{"text":"I hate to do this to a restaurant with delicious food, but... We had reservations for 815, didn't sit down until 9. Our table was given away twice to two other parties. It took then 1 hour to bring us our appetizers and after 3 hours, I'm still sitting here waiting for my entree. This is absolutely ridiculous. I will never come back here!"}
{"text":"Actually we are amazed this place was still open. It's a good looking place from the outside and in...But poor quality food , clueless staff who couldn't care less , were a table of 6 , probably only one of 4 occupied tables in the whole room (for good reason we now understand). None of us finished our food (sorry we do not advocate leaving or wasting food but this was an exception) , 3 of out orders were delivered incorrectly ,  we were all shocked the place is still in business .  Sorry for the bad review but wowwww"}
{"text":"This place is not bad.  We were surprised to see Centro gone and replaced by Vita Sociale.  I think that it's still trying to figure out its identity.  It looks fancy from the outside with a red carpet to the side but when we peaked in at around 4pm on a saturday it was full of young families so we went in for a quick meal with our one year old.  The staff were friendly, they seemed to need a bit more training.  The waiter and waitress would make small mistakes that we wouldn't even notice but keep apologizing for making them (I guess after they realized on their own that they had made them).  The food was good.  Not fantastic but decent."}
{"text":"Vita Sociale was a major disappointment, food wise. I didn't get to try this place when it was Centro, but having heard whispers of why the restaurant had to change, I don't think it was for the better.  The menu is surprisingly simple. Our waiter had to ask us several times whether we decided on what we wanted, and my mom and I had trouble picking. The thing is, the menu here is very boring. Appetizers range from fried calamari (yawn) to beet salad (another yawn) and I ended up ordering the Buffalo Mozzarella. Now, I like this dish plain and simple; featuring fresh, large, slices of tomatoes and likewise, creamy, thick, slabs of cheese. What I ended up getting was a very messy dish of grape tomatoes with bread crumbs and sprinkles of cheese. The only thing interesting about this plate were the Vinaigrette Pearls which looked like caviar...but not.  I decided to order the Ragu which again was not what I was expecting. Boring meat sauce with a heap of Parpadelle pasta. I didn't finish it. My mom decided to order one of the meat specials: beef medallion with truffles! I had high hopes for this, but again, it was just a big hunk of meat (no sauce, no nothing) with sparse shavings of truffles. For $45, it was good, but again nothing amazing.  And last, for dessert, my mom ordered some frozen chocolate bombe which we left half unfinished.  Again, nothing wrong with the food, but it is rather uninspiring. Perhaps I thought I was going to Centro, and instead, went to somewhere mediocre.  On the positive, they have Chianti Peppoli by the glass and I had many of those. Our waiter was very gracious and accommodating as well.  Overall, will not be coming here for dinner. In my opinion, La Vecchia (really close by) is the better Italian cook."}
{"text":"A - The food is delicious B - The host is a B, itch. had 8pm reservation on Friday evening. We all arrived little before 8pm and was advised by the host table is not ready. Ok, we'll wait, still waiting after 20 minutes....asked the host when we can be seated. She replied \"there is nothing I can do about it\". with ATTITUDE. Seriously, b, itch! Finally, we sat down around 8:30.  C- Our server was nice and polite, but in need of a crash course waiter 101. We ordered mussels for the table, there was no extra bowl to put the empty shells, they were all piled up out plates. Our plates were not taken away. We each ordered an appetizers, they didn't come out at the same time and one had to wait....I finished my glass of wine and no offer of another glass by the server.  D - Over all, $$$$ restaurant with top notch food. The owner needs to train the servers and replace the host."}
{"text":"Toronto's demand for the old white linens type of upscale dining has been met with a huge R.I.P.  These days, mannerisms are less important and being able to snap photos at the newest and hottest joints on Instagram of pop-ups turned bricks and mortar have led to a revolution of new blood on the restaurant scene.  The closing of Centro, which has been an icon of fine dining (at least in the Yonge/Eglinton area) only echoed the shift in diners' attitude.  Cue Centro 2.0 (otherwise known as Vita Sociale) which still serves upscale food but the decor makes it much less intimidating and more accessible to the average Joe.  Exposed brick, tall ceilings, shelves of canned tomatoes and large open windows make this reminiscent of a family-style pizzeria where you have Sunday supper with the kids.  As the demographic of the Yonge/Eglinton area changes (used to be the place for young, thriving professionals to live, but sidewalks are now lined with strollers as young families move in), I imagine more and more restaurants will be making the switch to accommodate their younger patrons. The menu offers up a list of Italian classics such as spaghetti + meatballs and pepperoni pizza which make for a tantrum-free family dinner.  I feast on a more adult, Pizza Centro, a Roman-style pizza with a thin curst topped with burrata, chantarelles, vin cotto, basil + black truffles.  The pizza tastes as amazing as it smells and would make any mushroom-lover happy.  I also try the Linguini alla Bottarga, with chillies, roasted garlic, lemon zest + cherry tomatoes.  This pasta packs in a lot of heat (those who can't tolerate their spice are warned to stay away) - however is too oily for my liking.  The second main we try is Porchetta, with roasted potatoes, fennel, broccoli rabe pesto, and grainy mustard.  While the skin is perfectly crispy the pork itself lacks any real flavour until you marry it with the grainy mustard.  We end up opting for an Italian classic, tiramisu for dessert and it is an extremely dense dessert served in an ever-so-trendy mason jar that lacks any coffee flavour or resemblance to the Italian dessert.  But dinner ends on a high note as I delight in a Mascarpone Cheesecake that is conversely much lighter and fluffier than the tiramisu; topped with a kumquat and drizzled in caramel sauce.  Service is regrettably slow though there are no shortage of bodies working the floor.  While I enjoy the new space, I have to say that I enjoyed the food better when it was Centro.  However, it is still relatively new and I only hope that with time, the restaurant will have a firmer grip on its newfound identity and shift in clientele.  *This meal was complimentary.  Opinons as always, are my own*"}
{"text":"Service was very good, but service was slow and food was average. We sat down just before 8pm and were served bread and appetizers within a reasonable time, but our min courses did not drive until close to 9pm. The restaurant was not overly busy, but was serving a private party upstairs, likely why our food was slow?   We ordered Cesar salad (so-so), calamari (deep fried but good!), steak and risotto (over priced, risotto was watery, steak was average), pasta with Italian sausage (decent). Spicy Cesars to drink - average."}
{"text":"I hate writing negative reviews, so I hope someone reads this and takes it as a gesture of good will and a chance for improvement, since I know how awful it can be to have your business fail: 1. The wait staff needs to be more aware of how their attitude affects customers and the experience people have. A friendly smile can go miles, even if you are stressed and understaffed and are working on a long weekend. Being attentive to the needs of the customer and anticipating future needs also goes a long way. 2. When paying prices like 27$ for an entree, the customer should at the very least get something that they feel is at par with other restaurants in the area of a similar cuisine. The chicken was dry, the veal was bland.,. Very average.. Not worth the money. The grilled veggies were quote good though. The pasta was very average but overpriced. The fried calamari was lovely, crispy, and the dipping sauce a nice herby change from the average. 3. Wine selection was excellent. A definite strength and something to build upon.. Perhaps pairing? 4. Reservation was very specific for sitting by the window, and this was not respected. Although, the addition of the big windows is a big improvement from centro. In the end were were moved to the window but only after asking, and I couldn't help but feel I was being treated as an annoyance.. 5. Decor was fine (I am the wrong person to ask, personally I never really care about decor)... All about the food, baby! 6. The dessert was very good (lava cake), moist and tasted home made. Yum.  Overall, I gave 2 stars for the one star service, the 2 star food, and the 3.5 star decor. The location is excellent, but the the menu a bit drab... Which can be a really bad thing in an area with so much competition."}
{"text":"The food was acceptable but not special. The service was terribly lacking. I asked for ice. 5 minutes later the waiter apologized and stated that he was sorry, he forgot. Five minutes later he still had not brought the ice. A runner brought ice immediately after he received the request. I asked for chilies to put on my pizza. Five minutes later the waiter was taking an order from an adjacent table. I was still waiting for the chilies. A runner brought me chilies immediately after he received the request. The waiter took our order and wrote it down on a form with table locations on it. i.e. positions 1, 2, 3 and 4. He still put plates down in front of the wrong persons. I ordered the House-made salumi board with Parmigiano Reggiano and marinated, roasted olives. It would have been nice if someone had informed me what the various salumi on the plate was. I was not impressed by the definite lack of any service. There were duty managers (owners?) on the floor but they seemed more interested speaking to patrons they knew rather than watching the tables and servers to ensure that customers were being taken care of properly. As we were with friends it was not an appropriate occasion to make a fuss or complain about the lack of service. The tip was reduced from our usual 18%. The waiter probably never noticed."}
{"text":"After a long day of boozy brunch and walking, we stopped here with a group of 4 for an early Sunday dinner. Inside, the decor is lovely and trendy with massive corner/circle leather couches. The service was really good I thought. The food was pricey was what it was but very good. We shared the calamari as a starter and it was light fried, served with a delicious tartare/cocktail sauce. I rarely eat fried food so if I tell you it was good it means something lol. Then we ordered 4 different main courses. I was recommended the scallops. The scallops were good but the overall dish wasn't. The peas underneath was undercooked and the sauce/broth didn't go well with it. One friend ordered the sausage platter which was the highlight of the dinner. The succulent sausages, homemade, and it was HUGE. I think it would entertain a group if you are going for a bachelorette party, if you know what I mean lol The sea bass wasn't a hit neither. Overall, I think this place was a lot of potential, they just need to clean their menu with some missed dishes or at least refine them."}
{"text":"Maybe I gave Vita Sociale a 5 star review last time because it was still within their soft reopening so they went above and beyond with food?? I have no idea because I was there this past weekend and the food was absolutely horrid. I swear on everything; I ordered the same thing like last time- friggin arugula salad and branzino... (I mean when people like something the first time and they come back they want the same experience- or maybe even better)   Not only was my arugula salad lacking the main components of fig and caramelized onion they had an unscrupulous amount of tomatoes and black olive- wait did I mention my detest for black salty disgusting olive?! OMG. Branzino was dry and over cooked and quite a few more bones than the last time I was there. The waitress was quite frankly not old school centro style- more like coyote ugly like spilling water on people as she refills their glass or knocking forks and knives on the ground, wait let me do you one better---- forgetting to take a persons order.     Ha! So not going back."}
{"text":"The swaggy $$$$ Centro is now the rustic Italian $$ eatery Vita Sociale, and I think they've done a really nice job with the re-design....but the food needs some work. The pizza, for one thing, looked amazing but tasted disappointing. (We ordered three kinds...I'd recommend the truffle pizza as being the best of the three.) The spaghetti with meatballs was massive and unappetizing; the agnolotti was better. Fried calamari was tasty; beef carpaccio was delicious.  Having just enjoyed some great thin-crust pizza recently at Lil Baci on Yonge south of Eglinton, the Vita pizza fell short. But they're still new so perhaps we should give them a chance to fine-tune."}
{"text":"Beautiful decor and stylish restaurant with hot servers how ever food is really disappointing. The Pizzas are like tortilla chips, the dough is the strangest thing I have seen. Me and a friend were very disappointed. We got the pizza cold, you will not be able to cut the dough, we had to literal rip with our hands and teeth. It is like plastic. If they are trying to innovate this was a complete miss and they should tell u before you order. The very first time I was there I had the gnocchi and they weren't that tasty either. Unless you are going to just get drinks or coffee with your girlfriends I wouldn't recommend this restaurant."}
{"text":"Came across Vita Social on a Saturday night to a surprisingly empty dining room. Service was slow, couldn't get TVs to play two different games. Manager seemed to be enjoying the leafs game more than being a manager. I really loved this place a year ago, I know it can be a hot spot, but menu was boring and place was lacking excitement. My braised short ribs were heavy, filling and absolutely fantastic. We also tried the gluten free option of their pomodoro which we weren't as pleased (presentation lacking.) I want this place to be successful, I think it could be a great hangout for locals, but strikeouts on a few aspects."}
{"text":"The decor of Vita Sociale is nice. This used to be Centro. The food is pretty average though. I had a Rigatoni with Chicken & Mushroom. It was mostly pasta & not much else. The chicken was pretty dry as well. Not sure if I would come here again. The day I came for lunch was quite cold & it's more than a 5 minute walk from the subway despite what they said."}
{"text":"I have only tried their Margherita pizza, but it alone says a lot about the restaurant. The crust was so thin and crisp that it seemed to me like it was baked a month ago. The promise of buffalo mozzarella and basil was a joke. They took one basil leaf and cut it into 8 little slices, while buffalo mozzarella was the size of bird poo.  I can't comment on the quality of other food, but if they think they can treat their customers this way, I want everyone to know about my experience. Grazie, which is a little bit south across the street is way better. Save yourself some time and go there."}
{"text":"Went there on a date. Great service. Ordered the short ribs. To die for. Melt in your mouth served with a creamy polenta. Last time I got the porchetta which was real yummy as well.  Definitely would go again."}
