{"text":"Nice spot for healthy food. Hot buffet options are quite large. You can eat there or grab some food to go. There are meat and vegan options."}
{"text":"I had the opportunity to get a personal tour of the kitchen by the owner and chef of Vivalia Bistro Express, and I must say I'm impressed. The ingredients are all organic and of the highest quality. The menu includes something for all tastes. Unsurprisingly, the food tastes incredible. I was even convinced to try a vegan, soya wrap (I'm not a big fan of meat substitutes)... it was delicious."}
{"text":"C'est bio, c'est bon, c'est beau et c'est très raisonnable, côté prix. Il y a des options avec et sans gluten, produits laitiers, viande, etc. Et des options véganes. Il y en a vraiment pour tous les goûts. Et ils compostent, en plus. Bravo! :D"}
{"text":"Hand prepared food is always best. You pick what you want and they make it. Free lemonade water, and great fruit drink selection"}
{"text":"Vegan? YES! 

Vegetarian? YES!! 

Organic? OH YES!, OH YES!! 

(food for carnivores too)

This place had such great recipes and delicious food. Real food, not \"food-like\" food. One of us got a vegan plate and one of us got a veggie sandwich. Both were delicious. We were allowed to sample a couple of flavors before deciding on which plate, which we appreciated very much. Best coffee on our three week trip was right here. I got a sip and it reminded me of Italy.

Super friendly and helpful service. This is a place where you go to the counter and choose what you want then you either get it to go or sit at one of their tables. The owner is awaiting his organic certification. He is passionate about the organic movement. 

I was really surprised to find out they had BEER as an option for something to drink! YEA!! They had two kinds, I had a local beer, and the beers are organic too. Really cold and delicious. Then, I am a sucker for cookies, so I had three out of the five they offered. Three organic cookies. I was so happy! I took two back to the hotel and hid them so that I could enjoy them over the next couple of days. haha!

I predict this place will take off. We only made it here once, but if our hotel were nearby, there is no question we would have come everyday. Loved it, highly recommended!"}
