{"text":"Very good West Indian food in Port Credit. Try the oxtail. It's the best I've ever had."}
{"text":"We have eaten here before and loved it.  Due to the extreme heat outside and lack of air conditioning, we decided on take out.  Carl had the Calypso Fettuccine and I had the jerk chicken dinner.  They were both wonderful!  The fettuccini was spicy and filling.  The jerk chicken was as good as it gets-moist and flavourful . Our new number one restaurant!"}
{"text":"Port 229 had taken over this location when the fantastic Il Pescatore closed down at 231 Lakeshore. Now 229 is back exclusively at its namesake 229 Lakeshore and we've got some Caribbean flavor in Port Credit. I believe this place has been open for a couple of weeks, we spotted them a little over a week ago and have been planning to drop in to check it out.  Atmosphere:  Not much has changed here in the last couple generations of restaurants at this locale. The only new additions are some minor art pieces that give a bit more of an island feel. We were treated to some timeless Bob Marley while we were there. The restaurant itself has around 8 or so tables, seating two to four each as well as a good sized bar.  Drinks:  At the time there was no drinks menu but they appear to have a fully stocked bar. Neither of us ordered any drinks but water.  Foods:  We started with the nachos, which at $8 were well priced - especially compared to other local places which can reach double that price. They were generously heaped with mixed cheese, jalapenos, a sort of bolognese-type meat sauce, peppers, onions, tomatoes - and had multiple layers of toppings so we never had a single naked chip the entire plate.   For mains, I ordered the Skinny Chef Jerk - about a half chicken jerk style with a side of rice/veg, plantains and a delicious rich sauce for dipping. She had the oxtail with identical sides. Both plates were wonderful. The chicken was spiced perfectly, plenty of heat and incredible flavor. Some of the best jerk chicken I've ever had. The oxtail was rich and sublime. We were both very impressed with the quality of the food.  For information purposes, they do offer other crossover 'fusion' type dishes for broader appeal but I dare say that I will never stray from the Caribbean options at this place.  Desserts:  We shared a piece of cheesecake - strawberry with a bit of cheesecake frosting and some chocolate and caramel plate drizzle. The cheesecake was good but nothing outstanding, would probably pass next time we go. There is apple crumble on the menu as an option so maybe we'll try that out next time.   Very happy to have some more flavor in the area and we'll definitely be bringing our business back again and again."}
{"text":"Great new West Indian place in Port Credit! Stopped in for take out oxtail & jerk chicken - food was great and portions were huge (we didn't finish but will be eating the left overs). Owners are very friendly - will be going back for sure!"}
{"text":"I ordered the Oxtail Dinner this was by far the best Jamaican/Caribbean food I have has in a long time. The oxtail you could tell was cooked with love it was fall off the bone tender & very flavorful. The veggies were fresh an crisp not soggy like in other places. The coleslaw was fresh an not drowning in mayo. I ordered sorrel an WOW let me tell you it was made freshly by them not store baught. It reminded me of the sorrel made at Christmas. Even down to their pepper sauce made from scatch. Soooooo worth the $$$$ you won't be disappointed. So if you are ever in the area an want fantastic quality food (even if u are not in the area) sooo worth the trip. They deliver an can be found on skip a dish. com"}
{"text":"Best stewed chicken, rice and peas around. I stop by after work a few times each month and grab a takeout order for dinner."}
{"text":"So happy to find this Jamaican restaurant in Port Credit.  Very homey casual atmosphere, great music, great patio too.  Ideal for casual date night! Amazing Jerk Chicken, Crispy and moist! It comes with sauce...I am not sure what it was but it was probably gravy? That was also delicious. My husband had beef patty and it was good amount of spices. He loves it so much.  Can't wait to go back to try other dishes!"}
{"text":"Amazing patio a great place to enjoy the weather! The food was equally great. The oxtail was delicious, not spicy but they do have delicious hot sauce! Service was awesome.  A great spot for a bit more refined Jamaican food. Will be going back soon!"}
{"text":"Amazing food! Great atmosphere. We got jerk chicken dish omg the best loved it so much. Cant wait to go back:)."}
{"text":"My food was prepared quick.. The woman working at the time was really nice. The downstairs washroom is very tiny and dark but other than that overall 4 Stars. The jerk chicken and beef patties were good! I had a delicious blueberry cheesecake. I would recommend trying it out if you're in the PC area :) $$ Oh yes and it gave my sister nasty farts so watch out hahaha"}
{"text":"The food is fantastic! But jeez the service on every level is just painfully slow and frustrating to deal with. Even just calling to place an order can be a task when they barely ever answer the phone. I've even had times where they have said they're no longer taking orders for a couple of hours because they're too busy. I'm glad you're busy and wish you the best but that's no excuse. I'll continue to be a customer but I'm really hoping they can work on their service level."}
{"text":"I enjoyed their oxtail, it was great for the masses and it melts off of the bone. Near perfection my friends. You can go alone but its better to go with someone. Nice calm spot. The Sorrell is also thirst quenching, mmmmm."}
{"text":"I went with my friend who just got back from her vacation to Jamaica, and she can vouch for its authenticity. Food is delicious and served in great portions. Staff is also very nice.  A hidden gem in the Lakeshore area for sure."}
{"text":"Great food, presented very well. I recommend for people who like nice portioned styled Jamaican food. They also have a beffuet on Sundays,  so don't miss out"}
{"text":"DEFINITELY THE FRESHEST AND MOST AUTHENTIC JAMAICAN FOOD Ive found in the city so far...Ive eaten at alot of decent Caribbean restaurants in the east, west and downtown, but If your a foodie or just looking for a nice place to dine in and eat Jamaican inspired dishes THIS IS THE PREFECT SPOT. Was so impressed with the quality, flavors, service and Menu I felt had to leave a review. There dishes are unlike any other places ive found . Real authentic Jamaican inspired food , relaxing vibe, clean restaurant, friendly staff. GREAT JOB FOLKS !"}
{"text":"I was craving West Indian food on a Sunday evening & called 4 spots close to my home only to find they were all closed or near closing so not taking orders. I found Voy online & although it was a little further than I wanted to drive, I decided to try it. The woman who answered (I think the owner) was extremely polite (anyone who frequents Jamaican restaurants knows that's rare so before I even set foot in the restaurant to pick up my order, they had earned a star!). Upon pickup, I was immediately acknowledged (hello, 2nd star!). Costs a little more than your average West Indian/Jamaican spot but you see how that is justified, immediately....#1-No Styrofoam take out containers! #2- Huge portions! And not the usual 80% rice, 15% chicken, 5% coleslaw- I'm talking each meal had extremely generous meat portions, I would say enough for 2-3 people! We ordered the jerk chicken, oxtail, fried chicken & festivals. Everything was delicious & we had leftovers to take to work for lunch the next day! So worth the drive!"}
{"text":"Sunny Patio + Jamaican Food = Delicious end to our weekend!   Voy has an excellent sized patio out front that we took advantage of for an early Sunday Dinner. We ordered the Oxtail, Curry Goat, a Red Stripe and tried their home-made Ginger Beer. While not to our taste, I'm glad we tried the Ginger Beer, I like seeing restaurants creating their own drinks.  The oxtail was perfectly cooked and seasoned, the accompanying coleslaw had mango for a unique spin. The Curry Goat was very tasty. I like it spicy, and a side dish of hot sauce brought it up to my taste buds level. The rice and peas were excellent, the side vegetables were serviceable. There are other food options available, but when in a Jamaican restaurant - eat Jamaican!  Service was friendly - she checked on our meal once, but didn't return to see if we'd like more water, or another Red Stripe. If we're in the neighbourhood we would drop in again!"}
{"text":"Ordered take out twice and really liked it, jerk chicken is outstanding. Chicken Roti is tasty but a little dry, never had Roti before so no idea if this is normal.   Being australian I have no idea if the food is better or worse than your average jamaican joint but other being a touch too spicy for my taste buds I could eat it all day."}
{"text":"Food is amazing, it's a small and intimate restaurant, spacing between chairs and tables could be better. The jerk chicken and oxtail were the highlights of my visit. The beef patties was the low point ( overpriced, dry, and really dry), I could complain about the price, but would also admit that it's worth it. Only thing I would recommend the restaurant to do would be have a combination plate where you could try multiple meat dishes without ordering a whole side."}
{"text":"Hanging around Port Credit again for the day and the gang I was with wanted to try out Voy - I actually tried a bit of their food before at a Yelp event so I had some idea that it would be good!   We checked out the menu, decided to grab a table and were served quickly. Of course most of us wanted to try the jerk chicken, and my fiance opted for the curry chicken (just to be different!) The food took a bit of time, but honestly was worth every minute of waiting.   The portions here are huge! The jerk chicken came with at least 3-4 big pieces of chicken with some delicious sauce, a huge portion of rice and some vegetables (cabbage and carrots). Even the vegetables were tasty, I wanted more! All of the food was cooked perfectly and spiced just right. We also ordered the nachos - which were so much different than your typical \"nachos\". The sauce tasted a little like marinara and the chips were spicy and crunchy - it was different but actually quite good!  The couple I was with liked the chips from the nachos so much that they asked to order a bunch to bring home! Voy's was happy to do this and got them ready quickly. They brought them home and they stayed crunchy for days afterwards. Great customer service!  I will definitely return to Voy's - they have a buffet on the weekends also. I'll give that a try next time so I can try a few different food options."}
{"text":"I'm so excited to go I'm starting my review early.. it's 12:30 and I've been trolling around on their website looking at all the exciting things I'm going to eat! Problem is, there are no  photos of the Sunday Brunch anywhere! So I'll add some when I get there.. ok, so off to get ready... == Hmm. ok so now I'm home and want to write what happened. So, I thought the $25 price was high for what it was.. Also because I didn't think I could eat $25 worth of what was displayed. We arrived close to 2pm and everything was out but we were the first ones there. The woman is very nice but she got overwhelmed with all the people arriving at once. She kept calling into the back with what she needed out front. There were just enough plates for the people who were there and there were side plates on the tables but since there were so few plates at the buffet we were unsure as to grab a new plate or just make a garbage plate on the table? We opted with the latter and it worked out ok.  The food is outstanding though. Bean soup with dumplings and some meat - ham? perhaps. Darn! As I'm writing this I meant to try the saltfish and the cloudy liquid she mentioned was good..  plantain was dry-ish (the first ones that were out) but they replenished with some nice ones.. festivals were soft and chewy as they should be. Jerk chicken - spicy, really very good actually. Hot sauce - homemade (ask for some) 2 types of rice - white or con beans oxtail was good and the gravy was nice on the rice after a bit, some red snapper came out. I didn't try it but it looked ok - I'm just not really into a lot of fish (except I do try to eat more fish while on vaca so theoretically I should've tried it on my tour of island tastes...) I would probably order a bunch of jerk chicken and festivals for takeout but might not eat in again.. The woman seemed run off her feet and she clearly wanted to provide good service but I kind of felt bad when she got busy and couldn't even get waters out to tables fast enough before people were asking for them.. == oh, and no photos were taken I thought it would be rude considering the environment.. it's a nice place and I didn't want to come off like a tourist... although I did have a Dragon Stout.. you know.. when in the islands... ;)"}
{"text":"Loved it! Every dish we had (4 of us) was awesome. Tastefully presented, each mouthful bursting with flavour and ample portions at very reasonable prices. Intimate yet casual dining area with friendly, attentive service. What a great find in Port Credit."}
{"text":"Main Points: -With only one table (just us), the waiter forgot our entrees -Janet, owner, seemed unhappy/annoyed with our presence -Coconut shrimp was basic; very bad value.  $13 for five shrimp.  Accompanying sauce imparted little value to the dish -Rum punch was very good!  Context: -This is my second 1-star review in 8 years -My girlfriend and I are respectful diners who look waitstaff in the eyes and thank them for nearly every action they perform in their duties.  -We are self-critical in misunderstandings and own up to our mistakes.  Girlfriend and I come to the restaurant and there is only one party of 4 having their meal.  There is one waiter and one woman, Janet (who was sitting on her laptop and spoke as if she was a manager/owner).  The weather has been decent so we wanted to sit on their patio.  Gf and I come inside and stand by the front door and wait.  Janet ignored us and kept to her laptop. The waiter finally seats us.  He asks us if we want anything other than water to drink and I asked if there was a drink menu.  He says something about going inside to the bar (he doesn't have a drink menu).  My gf and I approach the bar and grabbed some folded menus to find the drinks to which Janet stands up and, seemingly annoyed, asks us if she can help us.  I said I was looking for a drink menu and she says there isn't one.   I communicated to Janet that I wanted a drink quite possibly a cocktail and she says there is really isn't anything other than a rum punch which she could make right now.  I replied \"yes, please,\" thanked her, and we returned to our table outside.  The other table closed out and left.  If you've been keeping count, now there is only ONE table which is us.    We return to our table on the patio.  My girlfriend and I both made mention about how that was a weird interaction and how it felt like she was annoyed with us.  Our waiter asked us if we had any questions about the menu.  We had never dined there before so we asked him his favorites.  We had spent maybe 1-2 minutes having a spirited discussion (don't ask him what Escovitch style is for the red snapper, he won't know).  We had decided on the Skinny Chef jerk and the goat roti.  As we were handing back the menus we ordered coconut shrimp as an appetizer.  Two parties have arrived after us (both are 2-tops) and they join us on the patio at other tables.  As we were on our third (of five) shrimp our waiter asks us if it's good.  We reply cheerfully yes as the rum punch was refreshing and the coconut shrimp helped our hunger :)  The second party received their salad.  We waited. The third party received their drinks.  We waited. The second party received their mains.  We reasoned that because we ordered an appetizer and that they didn't, their food was all coming in a set.  We were patient and we waited. The third party received their mains.  We were now annoyed.  Janet finally came outside and asked if we were good.  I told her not really and that we were still waiting on our main dishes.  She goes to talk to the waiter.  The waiter returns to our table and told us all we ordered was the appetizer.  With exasperation in my voice I uttered a hungry no.  Quite amazingly, our waiter completely forgot the entire conversation where we intently listened to his recommendations, discussed his favorite mains, and that he took our order.  He made a mistake and forgot our mains.  He apologized.  I am okay with him making a mistake and apologizing for it.  \"The order will be out very soon.\" He scurries away back inside.  Our patience had worn thin.  My girlfriend and I had been sitting and nursing 5 shrimp and one cocktail for a little over an hour.  We wanted to leave.  No longer intent on being forgotten, I went inside.   Me: \"I'd like to cancel my order.\" Waiter: \"Are you sure?\" Me: \"Yes..\" Waiter, turns to Janet: \"They want to cancel the order.\" Janet, seemingly annoyed, then turned to me and barked: \"you don't want it anymore??\" as if I had just made the order and then wasted her time in deciding to cancel it.   I had realized something.  The waiter was trying to hide from his boss that he had forgotten my order.   Me: \"Well I did want it when I ordered it earlier but it never came out.\"   The waiter has his back to the Janet but is facing me.  He holds a pained look on his face as the truth comes out.    Now I'm not trying to throw him under the bus but I was hoping that Janet cared about how this service reflected her business and would take an active interest in improving the situation.  She did not offer any semblance of trying to make things right; no offer to discount/comp the appetizer and/or drink.  I do concede that I should have asked but it was clear that she doesn't care about you. Be wary of businesses like this as they don't value you; to them you're no more than a walking dollar sign. What I lacked in food, I grew in smarts: I decided to cut my losses, pay in full, and get out ASAP.   Final Pro Tip: Don't come here."}
{"text":"I've tried many Jamaican style restaurants yet few infuse this kind of quality into their dishes. The cuts of meat here are what set this place apart from the others. The huge portions of deliciously spiced Jerk Chicken and Fried Chicken are must tries here. The fried dumplings are also on another level of flavour.  The little things they do like buttering the broccoli and cauliflower side is the kind of attention to detail most Jamaican restaurants lack. The Calypso Fettuccine is also delicious, but I find it can lack consistency. Only ever had delivery from Skip the Dishes, so can't comment on atmosphere or service. Delivery is always made fresh to order and arrives hot."}
{"text":"The price isn't cheap like other delicious carribean or jamaican foods...but that's because this one is more of a restaurant and not fast food. I was worried...but damn was it ever delicious and worth it!! Amazing place! Best Jerk Chicken I have ever had! Strongly recommend."}
{"text":"I'd describe this place as a \"healthier\" Jamaican fusion place.  What you won't get is sodium overload here, so if you're used to a lot of salt, you may potentially find Voy on the blander side.  Flavours are there, but again, you won't get hit with a salt bomb!  Service was friendly, food came out relatively quickly.  Although I thought that my friend's Skinny Jerk dish w/ rice and peas was better than my Chicken Roti ($12).  The texture of the roti was a bit on the rubbery side, as opposed to flaky.  Again, maybe this is because there isn't as much grease as usual roti places.  Chicken curry had the flavours, but not super salty as I usually expect it to be.  The chicken in my friend's Skinny Jerk dish was well cooked, tender.  They definitely know how to cook chicken, without drying it out, that's for sure.  Unless you're a big eater, portions were good, you'll have leftovers for sure.  If I come again, I'd probably forgo the roti and stick to something with rice.  P.S.  A more permanent solution needs to be found for the table out on the patio closest to the BBQ.  I wanted to sit outside and that was the smallest table available, but table was extremely wobbly to the point that we were scared that any movement would topple the table over.  There were pieces of cardboard wedged under the legs of the table, but they weren't secured."}
{"text":"Finally, real soul food in Port Credit. A very clean and comfortable dining area. Great staff. Port Credit is full of over priced pub fare. I've lived here for 3 years and never dine in the area. I will definitely be back at Voy. I had the chef's special and I could have ate 2 more plates..just spicy enough.... I can't emphasize enough how lovely the waitress was to us."}
{"text":"First time here, discovered it through yelp. We came here quite late looking for a late night eat. We decided to each go with the poutine. One jerk chicken poutine and one oxtail poutine and a side of chicken wings mild. The chicken wings were full of flavour the sauce was great. Both poutines had a great serving of meat and the poutine portion size was huge. Cost about 12$ each which was great plus the wings our bill was just under 30$. The service was great, there was about 5 other people dining plus pick ups. We waited a bit longer than expected for our food but it was well worth it. The only negative here was the amount of gravy on the poutines were way too generous. The fries were soggy by the time we got it. We will definitely be returning its a great late hang out spot for drinks and any kind of meal. Would love to try the buffet it looked great w a great range of selections ; curry goat, jerk chicken, plantain, rice/peas and white rice, and more."}
{"text":"Stopped in on my way from Toronto to Niagara. The jerk chicken was phenomenal. Just the right amount of sweet and spicy. I highly recommend trying this place."}
{"text":"A void has been filled in the Port Credit area. Deliciously flavourful and spicy Jerk chicken that hit the spot! Had a great conversation with Garfield as well. Definitely will be back for more"}
