{"text":"The hardest decision you have when you're standing in front of this place is whether to go sweet or savoury. I honestly stood there for a good 5 mins going back and forth. 

Have you seen the humongous size of their fried chicken poutine? Or been lured by the aroma of their parm & herb cheese? 

I went with my gut (which already had 1st lunch lol) and decided 2nd lunch would be dessert, and ordered the strawberries & whip cream waffle.

Chatting away with the cashier (and slightly eavesdropping on a couple also at the counter), did you know that their food truck can be hired for weddings?! How amazing would it be to treat your guests to a midnight snack of chicken and waffles? 

For my patience (guys, it's finally paid off) they threw on some fresh raspberries in addition to the strawberries yesssssssssssss

$8 will get you berries & cream, drizzled in chocolate sauce and dusted with icing sugar on a crispy, heavenly cloud. Not too sweet, and perfect for sharing (if you really have to)"}
{"text":"So last weekend I had a mad craving for some sweet, sweet grease and once again found myself wondering around the Flea Market. What a great spot for good eats. I picked up a few fried chicken poutines from Waffles&Chix. Believe me the craving was conquered. Delicious and filling. The chicken was tender and the fries were crisp. Bacon was great and the white gravy was amazing. I could've drank it in a pint glass.  Price was high $31.50 for 2 poutine and a bottle of water but who cares, it was worth it. If you like tasty food that's probably got a weeks worth of calories then put this place on your list."}
{"text":"I took enough of a sampling from my 7 yr old's meal to develop an opinion- fried chicken and waffle poutine.  The chicken was really tasty- the coating was tasty, didn't seem overly greasy, and the meat was juicy.  The waffles were as expected, as well as the cheese and white gravy.  I did enjoy what I ate, but my issue is a personal taste - I do not enjoy my food drenched in sauce.  Yeah, yeah, I know I was eating poutine.  Regardless of my dislike of this sort of gravied texture- I would still eat this again as I did enjoy the chicken and waffles alone.  I would get the gravy on the side to control the sauciness of it all."}
{"text":"Waffles & Chix is not only a street vendor but they just recently opened up a location in the Crossroads Farmers Market!! I remember walking around the market and seeing a \"coming soon\" sign, I was pretty excited to try this place out.

I'm a frequent Crossroads market visitor so on my next visit, I noticed Waffles & Chix was finally opened!  A friend of mine raved about their Cheezy waffle sandwich so at lunch time, we decided to hit up Waffles & Chix.  Their menu is pretty small but that's not a bad thing, they obviously specialize in waffles and fried chicken but they also offer parmesan and chive fries and dessert waffles! So it's the best of both savory and sweet worlds.

Ryan and I both went with a Cheezy waffle sandwich each but he had asked if he could have additional pieces of chicken, which was $2 for each add on.  We sat in the cafeteria style table in front of the vendor to wait and it was ready in a few minutes.  We went up to grab our plates and the guy highly suggested the sriracha mayo.  The cheezy waffle sandwich is a cheese brussels waffle with 3 pieces of small southern fried boneless chicken with creamy coleslaw and a little drizzle of maple syrup, lightly dusted with powdered sugar (MMMM just typing that out makes me drool a little)  A fork and knife is recommended for this sandwich, but I first picked at the waffle on top.  The waffle is fluffy and crispy and the fried chicken is crispy and juicy.  The sriracha mayo is amazing so I suggest dipping the chicken/waffle in the mayo because it really gives it a little kick and its sooo delicious.  The coleslaw is nothing out of ordinary but all went well together. I was a little mislead only because when I think cheezy waffle sandwich, I imagine melted cheese stringing within the sandwich but when you take another look at the description, is it a cheese waffle. I didn't taste much cheese but overall, I thought the sandwich was really good.

I will definitely stop by again if I'm craving some soul food the next time I visit the market."}
