{"text":"Great food and friendly staff every time we go. Which is every weekend. The pumpkin waffles are awesome! They are seasonal so get them if they are available!"}
{"text":"Were told the waiting time would be 20 minutes. Ended up seated next to the trash disposal cart after waiting for 50 minutes."}
{"text":"Usually a good stop for waffles and chicken,  though today left me feeling sick.  I ordered an omlette with broccoli,  and the eggs were cold and wet and some odd cheese slathered on top.  ( what could that have been?) Maybe an inexperienced cook??  Atmosphere  remains pleasant.  Wally fries greasy--has not been an issue before.  Bad experience today.  Maybe next time better."}
{"text":"My favorite part about eating here is the splendid service I receive.  The servers genuinely enjoy their job and are great for conversation.  Even when there is a packed house, the servers and hostesses are doing their job with a smile.  The food comes out fast and drinks are always full.  As far as the food it is all delicious.  My personal favorite is the southern sprawl with Wally fries.  Wally fries are the best!  I sure do love me some Wally fries.  Wally fries."}
{"text":"Warning re: Club Breakfast.  When they say HUGE pancakes, they're not kidding!  And the best pancakes i've had in a l-o-o-o-n-g time.    This place is definitely habit-forming."}
{"text":"Coco-nut waffle is my absolute favorite!! They were busy so four starts because my side of eggs/sausage/hash browns were drowning in butter. Overall great bang for my buck!

My dad had French toast,eggs and sausage! He loved his :)"}
{"text":"Love this place!  Great waffles and very friendly staff! We love to stop in on the weekends."}
{"text":"Even when packed, and they usually are, the food comes out hot and perfect.  The servers are pleasant and the portions are large and prices reasonable."}
{"text":"We stopped here after an event at the fairgrounds and let me say after 2 hrs of walking this place really hit the spot. I had the pecan waffle and it was light and fluffy with pecans both cooked in and on top. I am absolutely going to add this place to my list of places to come back to next time I am down in Akron."}
{"text":"Even when super busy you get seated quickly. The staff is always super friendly and does a good job. The food is always cooked exactly how we ask and so delicious. Favorite breakfast spot in the area!"}
{"text":"We were passing through on our way to visit relatives in Michigan. These are the best waffles I've ever had. They were light, not heavy as waffles can sometimes be, but generously portioned. They were slightly crispy on the outside, chewy on the inside and perfectly flavored. And very reasonably priced even though the Yelp info lists them as expensive. We will definitely stop here next time we pass through town."}
{"text":"The new walley waffle restaurant location in  tallmadge is quite different than the last.  Quite a bit more room, but much louder and industrial in appearance.  Food the same, but our waitress was quite inattentive.  No coffee refills offered,  just plopped down the food and in a short time followed up with the check.  Not much else to say.  The experience was novel, but not one we want to repeat.  Better training would help."}
{"text":"(This is a review of their new location north of Tallmadge Circle.)
I ordered the Chicken and Waffles with a glass of orange juice.  Price seems a little high but the food was ok.  My second visit, I ordered the same and got fried chicken wings.  You have the option to get either chicken tenders or chicken wings. (The waitress on my second visit didn't tell me about my options and just assumed I wanted wings.)  The wings were actually pretty good.  Food was served in a timely manner.  I suggest eating the waffle quickly as it cools fast.
I also would suggest coming in early on the weekends as we waiting about 20 minutes Saturday morning but there was no wait during the weekday.  

Watch where you are are seated.  On the side nearest to SR91 (Darrow Rd.) The condensation drips from the ventilation tubes overhead and the water lands in the isle next to the booths.  (This would be a slip hazard but I was more concerned about high chairs placed at the end of the booths.  I have kids and would worry about water dripping on them.)  The waitress told me that management was aware of the problem and are trying to fix this."}
{"text":"You know a place is going to be good when it has 5 stars on yelp and is packed at 10:45 am on a Thursday. The waffles are outstanding. I can't believe my stomach could fit the whole thing but I couldn't stop eating it. I got the Elvis - peanut butter waffle topped with bacon, banana, honey and whip cream. My dad devoured the what in the waffle? - bacon waffle topped with sausage gravy and fried eggs. Great stuff."}
{"text":"This is my favorite waffle house yet. I used to be down because there old building was small and cramped but there new location made it very comfortable and less bunched up. There food is still amazing and I will be going back soon."}
{"text":"I love this place!!! Not only is the food priced right, but it is always cooked perfect and deliciously. I've had many different things on the menu, and you can never go wrong with a side of Wally fries. Perfect breakfast place. It can get busy and it's a little small in side, but worth the wait!"}
{"text":"Got here for breakfast and they were open at 8. Quickly seated and they got my coffee to me within a minute of walking in the door. Food arrived so quickly, I had brought my iPad with me and my food came to my table before I could even start browsing on it."}
{"text":"Today was my second visit to the new location, and it was a really great experience. Our server Jenn was exceptional and took time to explain the menu to us. The food was excellent, don't get me started on the loaded Wally Fries!"}
{"text":"Our family went yesterday and was surprised how big it was. The waitress was very pleasant at first. She took our order and the food came out quickly. However, the food was extremely disappointing. My eggs were barely cooked ( ordered over medium) so I sent them back and got the same results. The waffles were good but not great. We spent $45.00 for a family of 4. That is over a bit pricey, it was outrageous. Nobody ordered any drinks and we didn't order any fancy waffles."}
{"text":"Great food.  My favorite omelets anywhere.  Everything I've had here is good.  I know they're known for their waffles, but seriously, do not pass up the omelets if you like them.  Yum - E."}
{"text":"I love this place! Just check out the other reviews and you'll see its a fan favorite. I was introduced to this place by my fiance who grew up in Akron, otherwise I would have never had the opportunity to try this gem of a breakfast spot! It's in a strip mall type plaza, and unless you know its there or walk by it you wouldn't think to stop. The inside is clean, the waitresses are very nice and service is fast. The portions are huge, and everything is (from what i can tell) made from scratch, no microwave waffles here! You will not be dissapointed, go give this place a try!"}
{"text":"Delicious!  And not too expensive.  I had the Better Day waffle.  Not only was it healthy, but it tasted great!  I so wish I had one of these in my area.  

I had no complaints about the service nor cleanliness of the restaurant.

And please don't bring outside drinks into the establishment.  They have an agreement with Coke and are not allowed to let anyone bring outside drinks in."}
{"text":"Came here for my boyfriend birthday breakfast, has a bit of a wait but good things take time right? Needless to say he said it was the best waffle he's ever had (The Patriot). The staff was friendly and food came quickly."}
{"text":"Why I've ignored this place for so long is beyond me. I shop at ACME in the same plaza every week. My husband and I were both starving and wanted to find a place that served waffles at lunch time. We decided to try Wally Waffle and it was definitely the perfect choice!

We had a 15 minute wait which is no big deal and expected due to the small size of the restaurant. They sure do fit a lot of tables in there though. Once we were seated, the hostess took our drink orders right away. We both ordered coffee but wished we hadn't because it was not good coffee and was almost $5 for our two crummy cups. 

The waitress took our orders. I ordered the Patriot waffle and he ordered the Buckeye waffle with bacon. I tried a piece of his bacon and it was awesome! I am avoiding foods like bacon at the moment due to some cholesterol issues. Anyway, my waffle was huge and was piled with strawberries, blueberries, and bananas and topped with whipped cream. I only ate a little of the cream but I wanted to eat all of it. Very yummy. The fruit was fresh and the waffle has wonderful flavor. 

The staff were extremely friendly. I even overheard one of the waitresses helping an older man order and he was having a hard time telling her what he wanted. She was very friendly and sweet to him.

Overall, excellent place for breakfast. I'd like to go back and try the savory breakfast options. But next time, I'll stick with water."}
{"text":"I went to the new location off of Tallmadge Circle (North Avenue) this morning. This place has a lot more room, and is in a new building. The service, as always was great, and the food/value are very good. Thanks for the good job- great start to the day."}
{"text":"Little pricey for quantity but overall very good breakfast. Coffee could be stronger. The waffllet is a good bet. Grits are instant"}
{"text":"This place was super busy for sunday brunch. Our wait was only like 20 min so it wasn't too awful. There weren't many other dining locations nearby so we did not have much of a choice. The food itself wasn't bad... wasn't great either but it does beat out waffle house.  I know they have to turn over tables but they seemed to want to rush you out the door. Our food arrived and not 5 min later, the check arrived. I don't know if its just my pet peeve but i feel they shouldn't bring the check until the main course is complete and the server asks if you want dessert. We were just passing through so i can't say i would ever eat there again."}
{"text":"Reliable food and service in this small strip mall place that has been here 20+ years. Fairly creative menu with nice selection. Relatively few tables, very friendly, well trained staff. Nice healthier choices including fruit and multigrain waffle- excellent."}
{"text":"I chose this the other day as my Birthday Breakfast after dropping my son off at preschool. Split a waffle with my wife plus added eggs, grits and sausage to share! I don't know why but I was kind of expecting Waffle House type food, nope it was much better! I will definitely be back, this has got to be the best option for a good breakfast in Tallmadge. Great new atmosphere, good service, quick food and great prices. In fact I think this needs to be a weekly stop for us! See you soon!"}
{"text":"Came here for breakfast.  Put our name down as call ahead.  Still had to wait 15 minutes once we got there.  The service was horrible.  We sat down and waited for 10 minutes before the server came to take our order.  I saw her take other people's orders who got there after us.  The food was good but service is poor."}
{"text":"food and service were very good.  Definetly recommend this place.  the waffles were good and the atmosphere snd service is good."}
{"text":"Always fast, friendly service. Food is always great and cooked to order. Never been disappointed. Large selection of breakfast and lunch items or dessert if you get the Apple pie waffle! Love to bring family and friends here."}
{"text":"I love breakfast, but many times you go to a place that specializes in it and you are disappointed. This place surprised me. The place was tiny, and this chain has been in the area since the 70s. I had alway assumed it was like the other Waffle place with the black and yellow sign, boy was I wrong. The boys, wife, and myself all got different things and everyone left satisfied. 
I got a large breakfast....sorry I forgot the name. 2 eggs, 2 different meats, toast, home fries, and small pancakes. Won't go into detail, but all was better than many other breakfast chains.
Wife got an Elvis waffle....comes with bananas, bacon, peanut butter and honey.
The boys got Buckeye waffle. Chocolate chips, peanut butter chips, and whipped cream.
BTW it will be a long time before I go somewhere else for breakfast. This place moved right to the top of our list"}
{"text":"as usual great food & service!  first strawberry banana fruit cup---tastes great & i love the  beautiful plate presentation!!!!!  nice to see decorated food plates!"}
{"text":"One of my favorite breakfast spots!! Always quick great food and lots of options! The staff is always friendly and efficient."}
{"text":"More than just your ordinary breakfast place.  There were lots of creative options that you won't find anywhere else.  There are also burgers and other non-breakfast items on the menu.  Tons of food for the price.  The hashbrowns (Wally Fries) are excellent.  Most of the food was really good.  The pancakes were a bit lackluster, but not bad.  Service was good.  I'll definitely go back."}
{"text":"WOW! OMG! However you want to put it for Wally Waffle, this is one of the BEST spots for cheap (cheap in price, NOT quality) breakfast food if you're in the Tallmadge/Akron area.  

My roommate and I found this place just by accident.  We were shopping at Hallmark, which is in the same shopping center a few doors down, for unique ornaments and started to feel hungry.  That's when we saw this \"unique\" place and giggled a bit at the name.  I admit that there was nothing flashy about this place that made it stand out except for the name.  We ventured over and decided to be open to something new and different because when we were finished with our food Wally Waffle ended up being a special treat for us that we will gladly return to.  

As we walked in around noon, it was fairly busy.  About 8 tables/booths combined were being used.  The seating/dining area is not that large but don't let that dissuade you in any way.  There are about 8 booths along one side of the restaurant with a double booth at the front of the store in this row and about 4 booths along the other wall with about 6 tables and chairs in the middle.  Not very big when you hear this and see it but this ended up being a perfect, cozy little breakfast spot.  

We ended up sitting at the end booth closest to the bathrooms.  I have to note the mirrored wall is trippy somewhat and makes the place look twice as big until you realize what you're looking at!  Right away we were greeted at our table and handed menus.  Not knowing anything about Wally Waffle and their menu made us both look thoroughly over and through the menu because it was hard to decide.  My roommate was stuck between the Apple Pie waffle and the Elvis.  She made the right choice and went with the Elvis.  I'm ashamed to admit to this at first but I have to, I was looking at the salads.  Don't worry, that is NOT what I ordered but since it was close to lunch time I really wanted one of their burger/sandwiches even though the waffle choices are SO hard to pass by.  I ended up getting the Big Bull burger minus the mushroom (I do apologize to ALL mushroom lovers but the texture of mushrooms has never appealed to me and the taste is just off putting to me; sorry).  Anyways, I also made the right choice!  This burger was one the BEST burgers I've had in a long time!  a half-pound of Angus beef with American cheese and bacon!!  What more could a girl want/need! J/k.  I didn't need any condiments on it, I ate it as is.  I was so impressed with the meat I had to let my roommate try it.  Even though she had been sick for a few days and her taste buds were slightly diminished from the flu, she thought it was really good. My fries weren't too bad either.  They were not salty and my roommate was more than happy to \"help\" me finish them!  

My roommate then had me try her Elvis.  I can honestly and truly say that I have never tasted anything like this it was that good.  First off, you have to like these three things: Peanut Butter, Bananas and Bacon.  If you do, listen to this.  The waffle was stuffed or cooked rather with bacon bits and peanut butter INSIDE the waffle then the waffle itself was topped with round banana chunks and a small mound of whipped cream!  To describe the taste of the Elvis, AMAZING!  I took a bite that had a bit of everything with it, all three parts with the waffle and here it goes:  First, I tasted the banana, then peanut butter with the waffle.  As I kept chewing that's when I tasted the bacon.  WOW! So much flavor with different tastes in such a perfect blend I didn't even think about! The Elvis was not even on my radar when looking at the menu but next time I come here it will definitely be an option!  This just makes their menu even more difficult when deciding especially since 95% of their menu choices are under $10!  A real bargain and I feel you will not be let down by the prices or the food.  

The only issue I could see is that since the dining area is so modest in size, it can fill up quickly.  When it does, I see it becoming loud/noisy and that may diminish from your breakfast/lunch.  We were lucky. With the restaurant filled about 25-30%, it was more than pleasant as the waitress returned several times to ask us what we needed and check on us.  I was absolutely impressed by the simple fact that when my water with lemon was empty, she did not come out with a water pitcher. No, she did the best thing possible.  She came out with a NEW glass with a FRESH lemon and water in it!  Amazing.  I don't know how many other \"chain\" or even upscale restaurants just walk around with a pitcher and fill the glasses that may come into contact with other glasses, but not here!  It was the perfect time to go on a Thursday afternoon and we look forward to the next time.

I am glad to have tried Wally Waffle and will definitely be back when I'm in the area.  Wally Waffle ended up being a tiny little gem of a breakfast spot at the end of a shopping plaza. Try it for yourself!"}
{"text":"Great location and a nice cozy environment. The desert waffles were delicious. We tried the cocoa nut - it was great. Below is the what in the waffle - it was horrible. The consistency was off, the sausage gravy which was barely on there had no flavor, and you couldn't really taste the bacon. The Wally fries were extra crispy and were delicious with some hot sauce thrown on top. I don't think this spot is worth trying a second time, but it was what it was."}
{"text":"My family and I have been going to Wally's for years. It's in a much smaller building now and they are always busy but you never have to wait too long for a table. The waitresses are always so kind and the food is always fantastic."}
{"text":"We love Wally's! The waffles are amazing :) the other breakfast foods are also great.   It gets busy on Sunday mornings, so we try to go early (8:00) to beat the crowd! Great local place!"}
{"text":"I think the spouse and I will make Wally Waffle a breakfast staple when we're in Akron. We happily discovered that they have a restaurant right on the way from Kent to Akron. Of course, we had to stop by.

Our server was surprisingly chipper for seven-something on a Sunday morning, and we got our coffee and food quickly. Huge waffles with whatever you'd like in or on it - I had a savory breakfast of eggs and sausage loaded between a split waffle. MMMMM. AND hash browns, oh my. The spouse had chicken wings and waffles - not bad, the waffles here stand up to about anything you can put on them. Definitely give Wally Waffle a try if you're in the Akron/Kent area."}
{"text":"We tried to go a few weekends ago but they were so busy we left and went to Bob Evans. Today there wasn't a wait. I had the Coco-Nut Waffle and it was just average at best. It was pricey too, one waffle for $7.69. I doubt I would return, I'll stick with Bob Evans"}
{"text":"Upon entering Wally Waffle, my date and I were shocked at the sheer amount of humans who were packed inside (perhaps the wall mirrors exaggerated this observation). We were pleasantly surprised that the wait time was still relatively short. I ordered The Elvis Waffle with a side of two scrambled eggs, and she chose the Better Day Waffle. The food was great, and I can't complain about the service either. This is certainly the spot to try if you have a craving for waffles. I'm genuinely looking forward to my next visit!"}
