{"text":"A casual go-to favorite. Wonderful baked Brie, fresh salads, and tasty soups. Friendly service and delightful patio. Upstairs dining room can get a bit loud is cozy and fun for a casual bite."}
{"text":"On a weather predicted gorgeous October Saturday afternoon the bf and I decided to check out West End Bistro due to yelper reviews. We were promptly led upstairs where the decor was very cute.  I ended up admiring the decor for a very long time.  Two sandwiches finally showed up (40+ minutes).  Hunger pangs gnawed at me while I ate my chicken salad croissant sandwich, which with being sooo hungry should have been amazing, but was only ok.  Wouldn't go back...not even to admire the decor.  Solid but noting memorable or worth a return trip."}
{"text":"Update 11/15/12  Finding ourselves in Chagrin Falls again, we opted to go back to West End Bistro.  This time we were there for dinner, and while a tad pricey, the food was wonderful.  The butternut squash soup was very tasty, as was the strawberry bistro salad I ordered.  We tried the parmesan bread appetizer which comes with dipping oil, and it was mouth wateringly good!  My fiance ordered the grouper, which he graciously allowed me to try, and it made me wish I could prepare fish so well at home!  (Working on that!)  We split the creme brulee for dessert which was a good idea because though it was a small portion, it is very rich.  It came cold, and while I was expecting it to be warm, it was amazingly good!  The upstairs candlelit room was very relaxing and we had a great experience.  We were given some cards good for buy one entree and get the second half off at the end of the meal for a return visit, and I feel we may just take them up on it!  Still no coat or purse hook in the bathroom, but this time it was at least warm!  :)   We went here based on the reviews and researching the menu.  I really was intrigued by the brie appetizer and the creme brulee dessert, but just ended up getting a lunch combo plate.  The prices were a bit too high to convince me to try them.  Everything was tasty, and I enjoyed it, although the portions were a tad bit small.  The service was good and the atmosphere was interesting.  I must say I hope the restaurant monitors this, because what could use improvement was the ladies bathroom.  It needs more attention after messy patrons, a space heater, a coat hook, a purse hook or table and some lotion!  I do want to try it again though!  I was interested to try the potato leek soup after the rave reviews but they were out.  The French Dip Sandwich, Salad and Butternut Squash Soup all were very good."}
{"text":"Excellent. Nice, quaint atmosphere on back porch. Reasonably priced and food was excellent."}
{"text":"Great little spot in Chagrin. Love their cozy patio next to Gamekeepers. The Tuscan Flatbread and Bologna sandwich are my goto's here. Cute interior and all around good service. Great hidden gem in Chagrin Falls"}
{"text":"Innovative menu led us to order several small plates, all of which satisfied us.  The French Onion soup was a definite \"A\", and I've had plenty of it to compare to.  Another at our table had a salad, and he raved about it - a salad!  Surprising!  The pizzas were excellent; the drink menu, great; and the desserts, mighty fine.  The patio is cozy and inviting; we ate inside near the bar and liked the atmosphere.  We shall return!"}
{"text":"Food was pretty good - service was lousy.    My daughter and I ate lunch here about 2:00 in the afternoon.  We were the only customers in the place.  We were seated upstairs and the server apparently forgot about us.   The girl took our order and then forgot to bring our drinks until the food arrived.  The employees were having a good ole' time, however, downstairs with each other.   I had the ahi tuna w. avocado and a bowl of french onion.  Both were delicious.  My daughter had the pizza which was pretty good.   After our lunch was delivered, we didn't see our server again until it was time for the check."}
{"text":"We've been to West End about four times now.  I think that they have the technical skill to be a great restaurant, but are lacking in creativity and have a hard time with consistency.  The first time we went to West End was in the dead of winter, at 7PM.  We were the only people there on a Thursday night.  Interesting by itself.  We ordered the hanky panky's and a pizza to split as an appetizer between four people.  I liked the updated take on the hanky panky, but didn't think that it was worth eight bucks.  The mushroom pizza was good, but had like two inches of crust all the way around an already small pizza.  Give me the goods people!  The little plates were ok but nothing to write home about.  Only two people of the four liked their meals.   Since then we have been back for apps and wine a couple times.  Each time the appetizers come out a little different than they did the last time.  Some for the better, some for the worse.  It's like they forgot the recipe sometimes on an already small menu.  What this place does have going for it is the outdoor patio.  It's situated right next to Gamekeepers so I think that the West End gets the overflow.   Overall, it's a pleasant place to eat with some unique items on the menu.  The menu could use a change- not much is updated since the dead of winter with two or three exceptions."}
{"text":"This is a nice place!  Very limited lunch menu, however, everything was delicious!  I had gotten the Trio.  Bistro Turkey, French Onion Soup and the bistro salad.  The portion was perfect.    The service was fine.  I would definitely come back for lunch or happy hour, I would give it a try for dinner."}
{"text":"I was surprised this is the same owners as Gamekeepers according to the point of sale computer.. The attention to detail and cleanliness is far from what's experienced there. The waitress was green but efficient, the food was ok but I wouldn't rush back with the other choices in town."}
{"text":"The food and patio are awesome!!!!  Great place in the middle of town, fantastic lunches!  The staff is amazing!  I left my wallet on the table and the staff returned it with every dollar!  The owner is a great guy and made sure everything was OK.  Now - the food!  If you are walking around chagrin falls, you need to go here for lunch or dinner preferably outside.  Something for everyone!  I had the triplate for lunch, it was filling and yummy!  soup, salad and sandwich. Nice work guys!"}
{"text":"West End Bistro impressed me with its lovely atmosphere and food offerings.  They have a great menu with salads, soups, appetizers, and \"small plates\" that are actually just the right amount of food for someone who's fed up with Cheesecake Factory-sized portions designed to make people overeat.    I had a side salad and a delicious mushroom ragout served with creamy polenta.  The ragout was big on flavor and was the perfect amount of food for me.  The pizzas looked great too.  The patio is a relaxed peaceful setting - perfect on a nice night.    I noticed that everyone working there seemed very young but they were pleasant enough.  Inside, there's a downstairs with a tiny bar, a few tables, and a partially open kitchen.  More seating is available upstairs."}
{"text":"I think West End is wonderful. Took 6 pp for dinner. Everyone loved what they ordered, portions were perfect. I much prefer it over it's neighbor (owned by same people) Gamekeeper's. Sat on back terrace. It was perfect. If it remains Chagrin's best kept secret I'm fine with that!"}
{"text":"Love this cute Chargin Falls spot. It's perfectly located and great for lunch. There is outdoor seating in the back of front, yet I am not sure what they do in the Winter because the inside is tiny and I didn't see much seating.   I had  the french onion soup and french dip which were both phenomenal and just what I was expecting. They have a \"trio\" option where you can get a soup, salad and half a sandwhich. The only reason I didn't choose  that was because the french dip was not part of the choices. I don't think I would choose  this place as a dinner option, but it's ideal for lunch. Service was nice & prices were reasonable!"}
{"text":"Brunch here is a wide assortment of flavors from sweet to savory. The house pizza is a mixture of both with sweet fig jam and salty prosciutto. The space is warm and inviting with friendly service. Would have like the option of the lunch menu, but the dishes we had from the brunch menu were delicious.  Note to staff, the view from the second floor loft includes the dusty ledge of the first floor ceiling."}
{"text":"We stumbled upon this restaurant on a beautiful day and were thrilled to see there were seats available on the patio. It was Sunday and they were serving a brunch menu.  I ordered the romaine salad and a side of fruit.  I asked the waiter what the fruit consisted of and he told me grapes, strawberries, and oranges. I ordered a large salad. When the waiter delivered my salad it was clearly the small. My salad was very sad looking, the lettuce had seen better days.  The lettuce had a half of an avocado and canned oranges on it, yes, I repeat, canned oranges!  I was even more disappointed in my fruit bowl. There were no grapes as that waiter had told me there would be just canned oranges and strawberries. For five dollars I felt like this was extremely overpriced and expected a lot more quality for a restaurant in Chagrin Falls.  This restaurant is overpriced for dismal food.  Too bad"}
{"text":"Oy! I hate writing less than stellar reviews, but I'm hoping this was just a one-off lunch experience, since I've heard the dinner here is great.   My friend and I stopped here for lunch since Gamekeepers was renovating their patio and we wanted to sit outside (same ownership.) The patio was large, nice, no complaints there.   The lunch menu was quite limited, honestly, which was quite strange. The items and flavor combinations seemed to be a bit outdated, in my opinion. Think, candied walnuts, strawberry vinaigrette, chicken salad (with lots of mayo) and French onion soup. This surprises me since the culinary scene in CLE is exploding with much more impressive options.   Anyways, the food itself wasn't bad at all. The waitress was nice enough to split a salad and a turkey sandwich up for us. The salad was OK--with mandarin oranges, blue cheese, red onion and creamy onion dressing. The sammie was on toasted sourdough, spread with avocado, more onion, thick cut turkey and a mayo-y mustard I wasn't expecting. I ended up removing the bread since it was murdering my mouth and I would have appreciated just straight up mustard, like the menu called it, rather than a mayo-mustard mix. Especially with the avocado already adding richness to the sandwich. The turkey wasn't house-roasted, but more so thick cut deli turkey--but it didn't taste bad. Overall, I wasn't blown away by the food, but it wasn't bad.   The service is where this really went downhill. The girls were nice and it looked like they were training someone. I expected some hiccups from the beginning, but what I wasn't expecting was a two hour lunch. Luckily I was with my friend and we love to chat, but even this was too long for us. We ended up having to walk up to the waitress stand to give her our payment. She was super apologetic, but at that point we just wanted to get out of there.   I have to agree with other reviews that at least the lunch menu is seriously lacking creativity and the service is inconsistent. I understand if you're training people, but I still don't see how a lunch can take 2hrs, even with training people. I don't know what someone would do if they had to get back to work in any decent amount of time.   Maybe I'll come back another time to try the brunch or dinner menu? Although I doubt I'll be in a hurry to..."}
{"text":"Great small plate menu with limited selection but excellent quality. I have been there many times, the staff is always friendly and willing to accommodate special requests. Seating in the bar area is more comfortable and cozy. The upstairs dining area is a little stark and noisy."}
{"text":"Very good place to grab a bite. We love it. Never had a bad meal and the ambiance is very cool. Especially in the spring and summer when the patio is utilized."}
{"text":"Excellent food.  Never had a bad meal. Modern but comfy decor. Great eggs benedict for brunch"}
{"text":"One sunny, Sunday afternoon I happened to end up in Chagrin Falls.  There seems to be few places open in Chagrin Falls on a Sunday, so after a little bit of wandering, I ended up on the beautiful patio at West End Bistro.  To be honest, I'd never heard of the place before.  But the host was welcoming and the patio looked so nice, I figured that I was in for a good time.  I was seated in the back patio.  I'll at least call it the back patio.  I had a great street view.  And boy, was there some excellent people watching.  I sipped on my glass of Riesling and enjoyed the show.  I started out with a strawberry salad.  It was good.  Not earth shattering.  For my main meal, I got a mushroom pizza.  Again, it was solid but nothing to gush over.  My boyfriend got the eggs Benedict and was in love, though.  He doesn't ever eat avocado but gobbled it all up because his meal was so good.  Overall, the ambiance was probably the best part of the meal.  I would have gotten another drink or two if my waitress had asked me if I wanted to order one. (or had showed up at all to check on us)  I'd definitely go back to this restaurant during non-brunch hours to check out more of their menu."}
{"text":"With only a few hours to visit, we chose West End based on prior reviews and were not disappointed. My trio of choice was the Bistro BLT, bacon and leek soup and Bistro salad.  All three were delicious with just the right amount of eccentricity so that you feel as if you haven't seen this dish before. And kudos for barely dressing the salad when the other parts of the dish are so rich.  Too many restaurants slather on the sauces. The Brie-en-boule appetizer, with candied nuts, crisp granny apples and roasted cherries, is wonderful as well.  Another of us had the house pizza with caramelized onions and arugula.  W had too much food to et everything but we tried. And I have to ,mention the young men working the tables and seating. It's unusual to see such efficiency in two waiters working both floors during a busy lunch who also are full of personality. It enhances the entire experience.  They are good finds and I'm certain they are tipped very well. (or hope so)"}
{"text":"This is a really great addition to the Chagrin food scene. My family and I went last night - the food was perfectly prepared, salads were delicious, service was amazingly astute and the chef was there to see us off. Can't wait to go back when we can sit outside!"}
{"text":"My husband and I went to the West End Bistro on a Saturday night at 8:30 - they graciously squeezed us in - it is a cozy place and I liked the atmosphere of the bar and upstairs seating. Would like to try the patio in the summer.   Food was good -  I had a hard time making a selection between seafood and a pasta dish. Everything that we saw from the kitchen looked appealing and I could have tried at least one item from each course but went with a nontraditional caprese salad and sausage pasta. Both were good, but not outstanding. I like to go places to eat things I don't make at home...I felt I could easily make these dishes at home.   I do like the idea of small plates and sharing - even though we eat had a starter and one main dish, I was full.   I will go again to try a few different menu items and if their food is consistent in quality, it could be a crowd pleaser. Service was also friendly and efficient. No complaints there."}
{"text":"Went here for lunch and food was excellent! All food was blatantly fresh even down to the homemade pickles that were served with the sandwiches. I had the bistro salad with the French dip sandwich and not only did the produce taste like it was picked for our order but the bread was extremely fresh and the meat on the sandwich was extremely tender. My friend that I was with has probably the pickiest of pallets and she didn't even have to special order anything and was equally pleased with the place. Needless to say I will definitely be a returning customer!   P.s. The bloody marys are also fabulous!"}
{"text":"SIX BUCKS PER SHRIMP ??? Really !   We made reservations here and the 4 of us showed up for what we hoped was a nice dinner. We were escorted upstairs and shown to our table. I can respect \"minimalist\" decor..... But metal garden chairs ? Not particularly comfortable.....but we soldiered on, because we did make reservations.   Our waiter was attentive, until we ordered than he kind of disappeared and we couldn't order additional beverages or get a water glass filled until the $6 shrimp arrived.  So........ About the food. Our friends ordered the Burger Special and a Pizza and based on their comments both were tastey. I ordered the Shrimp and Grits and my wife ordered the Scallops and Squash Hash. Each of our meals cost $24 and We were both amazed at how small the portions were. Even our friends commented on the appetizer sized portion, mine came with 4 shrimp.... Not scampi sized shrimp..... A rather small sized specimen. The scallops were the Mini Scallops, not even a medium size Digby Bay type.  Full Disclosure time......both the scallops and the shrimp dish were flavorful and good..... Just too small of a portion for what we paid.   Now as you read this, you may be inclined to think.... \"Wow this guy doesn't get out much\" or \"Dude it's Chagrin Falls, you can afford it\", The truth is I travel extensively for business and eat out typically 5 nights a week in all types of establishments, I know what portion size should be. I also know what VALUE is and $6.00 per shrimpy shrimp is NOT a good value.  My advise get the burger"}
{"text":"This place is best in the summer when the back patio is open. My mom and I went to lunch a few times over the summer. They have a great combo offering with a few sandwich/salads. The French Dip is probably my favorite, and I don't really care for their version of the caprese salad.  I did come for brunch once and my boyfriend got the Eggs Benedict and loved it - said it was probably the best he'd ever had. Which seems to go with Roxanne's review as well. I have to agree with her on the service too. We sat upstairs (little to no atmosphere up there) and our server was around to take our order, drop off the food, and drop off the check."}
{"text":"Just had sunday brunch with the family and it was really awesome.  Very impressive.  We had a Groupon and it expired today, actually at 3pm when they closed.  We made our way over there at 2:30 and we are glad we did.  The food was amazing and the service was top notch.  Our server Chelsea was very professional and helpful.  One of my kids had the french toast which was huge and very good.  The other had a BLT on a croissant and I don't think he even stopped to breathe.  He kept saying \" this is awesome\".  I had the French Dip which was perhaps the best I have ever had.  Seems like they actually use brisket and the bread was perfect.  A really good roll which lots of au jus.  Sometimes places use chewy roast beef and you wind up spitting half of it out because you can't chew it.  My wife had the soup and salad and loved it too.  Big portions, charming little place and great service.  I'm a fan and we'll be going back for sure.  Highly recommended for a casual meal and relaxing atmosphere."}
{"text":"We stopped in for lunch today on the patio - what a perfect day for it! The food was delicious! We both had soup, salad and sandwich trios and they were light, refreshing and the perfect size for a summer afternoon!    The potato leek soup was divine and I would have licked my bowl if that would have been at all appropriate - definitely my favorite part of the meal!  I bet the patio is super cute in the evening all lit up and cozy - I would love to go back!"}
{"text":"Frankly, if I had known before I sat down that this was managed by the same people who run Gamekeeper's Tavern I would have left. I have had no good experiences at GT over the years I've been in the area and frankly, it's the same show here at West End Bistro. Which is so sad because it's an adorable building, the outside seating looks so nice, and the indoor area is comfy and lovely to be in. Which is frankly the same as GT! The issue isn't the building--it's the food. So let's talk about that shall we?  We came during the Saturday brunch hours and ordered a variety of things. Warning--the menu is extremely limited. If you don't want some kind of Eggs Benedict or pizza then I seriously caution you about attending here. I did not know that the menu was so small when I made the reservation and was very surprised. But the lack of knowing is on me, not them.  At the table we ordered: one of the pizzas (can't remember which), the french onion soup, a salad (also can't remember) and a modified Eggs Benedict that had spinach on it. The only thing that was truly very good was the french onion soup--so kudos for that. The pizza and salad were so unremarkable that even I--as a foodie, can't remember what they were.   Now to the Eggs Benedict. Firstly, I did modify it--so there is that. But it doesn't make up for the outcome. I ordered it without hollandaise sauce and I asked for the eggs to be fried over medium because I don't like poached. Thankfully they left off the sauce but I did get almost hard poached eggs. We were running out of time due to needing to catch a flight so I did not send it back. The dish was not good. The eggs still tasted heavily of the vinegar used in the pot to poach them, the whole thing was dry (I know, I know, the hollandaise would have fixed that--but so would have the raw yolks that I ordered) and extremely salty. I ate perhaps 40% of it out of sheer desperation.   This experience is exactly in line with what I've experienced at GT. To me this means that the mismanagement of the kitchens at both establishments are not a fluke or a one-off thing. This is consistent. And might explain why in the peak hour of lunch on Saturday there were only five customers in the entirety of the restaurant.  Get it together you guys!"}
{"text":"For an update, I have to go with 3 stars. West End Bistro could be so much more than it is. I wish the owners would take a look at all the great little places popping up around Cleveland (Tremont, Ohio City, etc.) and be inspired to bring the West End to a new level. Chef Craig is awesome, but the menu and overall vibe need an update. Still worth going here, but this place needs to start shining like the gem it is."}
