{"text":"Great pub food with excellent service. Specials like Italian night are great! I have been going here for years and the service is consistently good and the food gets better and better."}
{"text":"I've never had the food there, but I've been there on plenty of weekend evenings. WPS tends to draw a slightly younger crowd than the also popular P.J. McIntyre's a few doors down, for better and for worse. I sympathize with one of the other reviewers who mentioned \"frat boys,\" because even if the typical WPS weekend patron never pledged a fraternity or sorority (if they even had the privilege of attending college), many give off a vibe stereotypically associated with the only most glowing images of Greek life. I've encountered several pushy, rude drunk people there who also happen to wear things like cargo pants with flip flops and sequined tops from Charlotte Russe.  Although you probably won't find anyone to join you in an enlightening conversation about politics or art, you might still find a few good people there--or at least fun people. If anything, the patio in the back is a nice offering on a summer night, especially when it's impossibly loud inside (live bands are a frequent occurrence).  The bartenders do a pretty good job of maintaining the weekend chaos without getting frazzled, which is a feat. The tap selection is pretty mediocre, and for whatever reason, the last time I was there, they were serving cocktails in flimsy disposable cups that were smaller than standard cocktail size (but for the same price). All in all, it's not the worst place to go to, and you might get some entertaining people watching out of it. If you're stopping by for a drink at an off-peak time, it's actually pretty pleasant."}
{"text":"I haven't been here for the food but their night life is nice. Ladies night every thursday and the music continues friday &saturday.  Good crowd!"}
{"text":"First off the food isn't great it's just normal pub fare. Secondly the service is terrible it wasn't busy yet I couldn't get a glass of water after I got my food. I won't be going here again ."}
{"text":"They introduced a new food menu and I can't get enough.  People watching and great food. My wife and I are hooked!"}
{"text":"Service continues to get worse at the west side favorite. Even with no games on , they still can't pay attention to just a few people in the restaurant? Why?"}
{"text":"I don't even want to give this place a star. It's an okay place to hang out and drink during the summer, when you can be outside. Their food is well...pretty shitty. If you are hungry don't go here. We ordered corned beef sandwiches (on St. Patrick's Day no less) and it was cold, the bread was stale, and the fries were undercooked! How hard is this dish to make on the holy of holiest days? This establishment is also frequented by young ladies of ill repute (hoes) and the men that love them. It is fun to perch on the patio and people watch here. However even with the prime location, this place really sucks. The servers and bartenders seem to hate their job and pretty much ignore you. Go to PJs instead."}
{"text":"Service?  What service?  We walked out.  The banging gangsta music was a nice touch though.  Went down to PJ's.  Now this place understands service at the bar.  And  a helluva nice pour of wine for $5.  Yeah, it's my new place."}
{"text":"I am a fan of this bar/restaurant. I have been coming here for over 3 years and I find the food to be delicious. I have had everything from lunch items to appetizers  to pizza and the amazing brunch.  Whether you come for a sports game, to dance on a Friday or Saturday night or just to enjoy a drink with friends this is a perfect place to accommodate everyone including families."}
{"text":"Probably the best spot in Kamm's Corners.  Great outside seating with the bar and fireplace.  Solid menu offerings.  They seem to do everything good but nothing great (after trying almost everything on the menu).  Some menu portions are huge while some are very small (example the salmon).  Service is average.  Sometimes it takes an extremely long time for a waitress to come around.  I would recommend not going after about 8pm because it gets very crowded and noisey.. unless that's what you're going for."}
{"text":"By some deeply regrettable interdimensional paradox, I end up at this hellhole every time I come to Cleveland to visit my parents. I don't mean to, but someone's someone's BFF/hairdresser/unabashed Limp Bizkit fan recommends it and organizes a party, and there I am, again.   To be clear, WPS is not a hellhole in the cool sense of old West Side Cleveland working class neighborhood dives--oh no, I like those and feel that they have much to recommend them, and will listen to shitty Irish bands in them all the livelong day. It is a hellhole in an abysmal, rap-rock, late-1990's/early 2000's kind of way that was laughably stupid then and is now comically dated as a bonus.  Here is what you may expect: a shitty beer selection in a town that has many credible craft breweries; un-effing-believably bad bar service, where a friend was once so stunned that the bartenders stopped chatting with/serving their friends long enough to notice him that he froze up until said barkeeps walked away again; militant, tattooed frat boys watching UFC on the TV's and listening to Fred Durst wannabe dudes up on the stage.  To be fair, I have never tried the food. But I don't generally reward people who would steal my car by asking them to paint my house, so the fact that they are terrible at everything that I might have wanted them to do so far does not incentivize giving them the opportunity to suck other ways, as well.   You might think that this review is merely superior Austinite hipster snark, but I grew up in this part of Cleveland, and like many places in it plenty well. This isn't one of them. It's instead an amalgamation of everything douchey in the West Park/nearby suburbs culture, and although I am glad to see successful businesses in the area, I really wish this one would go away."}
{"text":"I really enjoy this bar and I wish I could give it a better review. The wait staff is great and the bar itself is great but the food is just ok and the kitchen staff tends to be really slow no matter how many people are in there."}
{"text":"This place is pretty generic besides having Irish, Italian, and American options on the menu. We went on a Friday night and it was pretty packed. We had to wait for a table because we didn't want to sit and eat dinner in front of the stage. The side opposite of the stage was still extremely LOUD, but it was tolerable for a Friday night.   Most of the patrons we crossed paths with were rude, which also makes for a 'good time'.   The food was bland and uninspired. Now, I know it IS bar food, but come on!! My boyfriend ordered some baked pasta and I got a cobb salad. Both dishes were 'fine'. We split an order of fries too and sad to say, the fries were the best part of the food order - they were a B- at best. I will give WPS some props though because they have Strongbow on tap. Our waitress was nice enough to mention but I couldnt even describe her a week later to a sketch artist.   All in all - my experience here was pretty bland - like the food."}
{"text":"This a fave spot of my husband and mine. Great bar food and good beer selection.  Very relaxed and casual atmosphere.  It is kind of the loud side so not a good idea if conversation is planned.  Oh, and we love the front patio (on Lorain).  It is smoke-free and fun to watch folks stroll Kamm's Corners (and the bikers rolling into Smedley's).  The back patio allows smoking which is a bummer - it is larger with a full bar."}
{"text":"$1.75 Happy Hour EVERYDAY 11:00-7:00!  Monday's=$5 Burgers Tuesday=40Cent Wings Wednesday=Tacos & Quesadillas  Thursday=35Cent Mussels Friday=BuyOneGetOne Appetizers"}
{"text":"If you are looking for a new summer hot spot with a patio, this is definitely worth a stop.  They have a great outside back patio with a bar and tables and also have a front patio with the garage door doors in the front to allow a breeze throughout the whole place.   I have been a frequent here for quite a while but am never disappointed, they have good food, good service, great atmosphere and their prices are better than most bars in the area.   The food is not just your average 'bar food'.  You are not going to get something out of a freezer on your plate, everything I have had has tasted fresh and always has flavor.  Their spinach and artichoke dip is really good with hot soft pita chips! Their pizza is really good, and I personally love their kids meals.  Especially on Sundays when they are only $2.50! You must get them with their potato chips, chip dip and ranch!   The bar staff is really friendly and will remember you if you join me in becoming a slight groupie.  I would say if you are in the West Park area definitely stop in - it stands out compared to the close competitors."}
{"text":"Had a Reuben here last night and it was the most disgusting Reuben I've ever had. Their corned beef is so unbelievably processed it was like cold rubber Bologna. Their quesadillas are on point though."}
{"text":"Great time. Hot spot in town. Great Local Atmosphere. Next time I am in Cleveland I will def make it by again."}
{"text":"Great happy hour, food is basic bar fare trending toward over cooked . Pizza and calzones are exceptional if they are not over cooked or burned. Service is lacking at times."}
{"text":"I live very close to this place, and I have to say that it has grown on me in the most wonderful way.  Their menu always has something from the \"what you might be craving\" section, and the service is great.  Last time I went, I ordered a burger medium, which to me means a warm pink center.  When my burger arrived, it was exactly that.  I was so happy that after my meal I went over to the expo window and thanked the cooks for taking the time to do my burger right.  Seriously, I think my original review for this place was too harsh.  It's a real gem."}
{"text":"This bar should consider changing its name to White Power Station. Seriously, if you're not a confrontational caucasian douche, this may not be the place for you. I've gone there for years and have regularly had run-ins with asshole patrons, ESPECIALLY on St. Patrick's Day. I continued to go because I never realized the bar itself is the root of the problem until recently. Staff members openly sneer as they take your order (given they've taken the time to stop ignoring you) and I was told there were no specials on a day that I happen to know is ladies' night. We went last night for a friend's birthday and their server came over to tell them they needed to close out so she could go home. When I went to the bar to close my own tab, the bartender ignored me to take a drink order from a man who was literally standing behind me and then pretended not to understand my two-syllable last name and asked me to spell it when she finally acknowledged me. The barkeeps really go the extra mile to let you know this isn't your place. This is one of two times in my history of going out when I refused to tip. If I wanted to pay someone to crap all over me, I'd find a highly rated dominatrix. This place is trash, but there's plenty of white trash clientele to keep it and its hateful atmosphere alive for years."}
{"text":"I had a horrible horrible dining experience at this place.   Service was okay.    I ordered:  Broccoli Cheese Fried things: not very hot.  Decent.   Guinness Soup: cold.  Lumpy.  Very very thick for a soup.  A member of our party of 5 (ha) flagged down the server and we informed her it was cold.  They warmed it up In a microwave, but it was still disgustingly thick and lumpy. I did not eat this.    Burger: ordered rare, I didn't even take a bite out of the burger. The bun was absolutely rock hard.  We once again flagged down our server and had her remove the burger from the bill.    It's sad when the only thing that was edible was the frozen and fried appetizer (and even that wasn't very good) You should skip this place."}
{"text":"We have been coming to West Park Station for sometime now, my wife is a dental assistant at the medical office here in Kamms Korner. The regular food menu is pretty darn good and well priced for the portions. Came here today for a fumdraiser for my daughters vet tech program at Tri-C. For buffet like pizza, wings and pasta they did well. The staff here is always quite friendly and helpful."}
{"text":"I have to be honest I was a bit thrown off by the price of a house glass of wine on a Thursday. I asked for a glass of house red wine and got a small-medium poor (2 glasses). I get the bill and it looks like it's $7+tax and then plus tip.   I would think on a weekday a glass of house wine in a place like Kamms should run you about $5. I can understand if you're downtown or in a higher price area where the building space is expensive. Not gonna beat this issue to death but based on this experience seems like there's better value places to go. a 4-6 ounce glass of house wine in Kamm's Corners shouldn't be $7."}
{"text":"Our experience today was great! Really have to give it up to our server Maggie who was so helpful, polite, and friendly! She gave great recommendations and when our group comes back, we'll be sure to ask for Maggie!!"}
{"text":"Yum!!!!!  Loaded waffle fries with spinach artichoke dip was SUMPTUOUS!!!!! I had a Dortmunder, oh fine...I had 2 Dortmunders, the date opted for a miller lite of which I shamed her in to having 2 as well.... Well? Beer is the reason we have our civilization in the first place so I celebrate it whenever possible! CHEERS!!!!!!!  (Waitress fogot about us after entrees tho, we got just a trifle salty but no worries...It was footballl draft night and she was working up a sweat!)"}
{"text":"Came here with a group of ten for business. Awesome waiter took care of us with anything we requested. Food was exquisite but service was a bit delayed from time to time. Luckily we had great company so the wait wasn't too bad."}
{"text":"I met some friends who had a table. I noticed when I arrived that they were walking up to the bar to get drinks & they mentioned they were wanting to order food. They were there for over an hour with no server. I politely asked if we could have a server instead of having to walk to the bar for everything to 1 of the bartenders. He said definitely, no problem. My issue was with another bartender who jumped in saying \"they don't need a server as they've been walking to the bar for drinks\". There was a bad attitude with her tone as my friends stated that they'd much prefer a server. So that is the reason for the rating. Food was good. I just hope that bartender was just having a bad day"}
{"text":"Pretty good bar food, love the fries.  Decent mid range bar prices.  Beautiful patio that is dog friendly, they even gave my dog a water dish."}
{"text":"Busy on the weekends but what's not to love about this place. Staff is always friendly and they are pretty much open ALL the time if someone is willing to work."}
{"text":"Went to celebrate my daughters birthday last night. We've stopped up before just for drinks  but last night we went early to order food. We found the perfect table by the front patio. Our server was Kayla. She was friendly and very attentive. Food was soo good! We had buffalo wings, artichoke spinach dip, portobello mushroom sandwich, chicken mozzarella sandwich, pretzel with cheese and chicken tenders. We'll definitely be back more often!"}
{"text":"I have only been to West Park Station a couple of times but each time has been great. I've sat both at a table and at the bar and had great service both times. All of the employees seem to have great communication and are all very friendly. They also had a band on a Saturday night which was a nice surprise. They're drinks are good and the food is delicious...the prices are definitely fair."}
{"text":"1. It's a bar. 2. The food is good some Italian, Irish and American foods. I had corned beef and cabbage, it was pretty good. It could have used a bit more salt/pepper. Over all great food for a bar. You could probably bring a kid if you come at lunch or early dinner but after 7, I wouldn't recommend it."}
{"text":"Phenomenal place!! The food while pricey is wonderful. The choices and flavors are on point. The portabella sandwich is my favorite. Only negative is that of you go at lunch you will probably be late getting  back."}
{"text":"Just had the worst boneless (aka burnt to a crisp wings here).   I'm also reasonably convinced the liquor is watered down.  Eat and drink at your own peril."}
{"text":"This was my first time here and I'll for sure be going back. The service was amazing and the food was very good. It has a great patio in the back to hang out on and grab a bite and a drink. Our service was amazing as our waitress was very attentive and checked on us a lot throughout the night. The music was a bunch of classics and set a good vibe for outside, overall good atmosphere."}
{"text":"When this place popped up in cleveland I was ecstatic to try it. The menu options are good and the selection is too. Whenever I fly in from Salt Lake I come in for the chips. I come in for fresh chips. They are soooo amazing."}
{"text":"Two stars because they do have a really nice patio. Stopped up a couple of weeks ago for a Cavs play off game and decided to sit on the patio since it was actually one of the first really warm days in Cleveland. As soon as we walked in we saw a sign that said something like \"let us know if your here\" (if you sat outside) We went up to the bar let them know and they said a server would be out right away. I think we waited about 15 minutes for someone to come by (totally understand it was a busy night with the Cavs and the nice weather). Once the server came by and greeted us we probably didn't see her for another ten minutes..... We knew to order everything at once drinks, appetizers, dinner. Our appetizer came out and our food came out 4 minutes later. I ordered a buffalo chicken wrap and realized that there was no buffalo sauce added to the wrap...This could of been an easy fix but our server didn't come back for another 20 minutes to check on us for the first time. I let her know about the missing sauce and I understand its not her fault she didn't make the food but she didn't offer to fix it for me or apologize for the mistake so I just asked for a box and a side of sauce.We also asked for separate checks which didn't happen. I did e-mail the restaurant the next day about our experience and never got a response back......"}
{"text":"This place is like two places in one.  Inside, an inexpensive restaurant with Irish and Italian food that you can bring the kids.  The food is good and the long islands were 4 bucks the last time I was here.  Hell yeah.  Now, the outside is a TOTALLY different story.  If ya like tanned bros and haggard bar chicks pounding Fireball and Mic Ultra than this is your heaven.  Its like a creepy, tan, high-school reunion where everyone's great-grandmother came from Achill Island.  Creepy, but if ya come in the front door and don't even look out back the only sign of the tan turds will the blaring pop music and the early 40-somethings singing along.  They don't even find it creepy that they wear the same Northface and Uggs as their 11yr old daughters, let alone, know all the words to a Bieber song.  Creepy as hell but welcome to Kamms corner..."}
{"text":"WP Station features good food, of both the bar and the comfort kind. Wait staff are outstanding and funny. Portions are fair size and the menu has a wide variety of Italian, American and Irish specialties. Family recipe for lasagna and for Irish soda bread are both favorites AND they have Smithwicks on tap! Decor shows the deep involvement of owner Jason Salupo with police and fire, which run throughout his family, and the commitment to the neighborhood, with local artist's work featured on the walls.  Live bands indoor and on the back patio (they have a front patio too, to watch the now thriving neighborhood), plus extensive happy hour and theme nights drive the mainly 23-35 year old audience, but leave the conversation for non-music times - for the bands are very LOUD.  Good value."}
{"text":"I went with 5 people at lunch time on a Friday. The food was very good. I had a Reuben and a cup of wedding soup and I enjoyed both very much. Others in my party had sandwiches, salads and chili and everyone was very happy with their food. Their main salads are HUGE so beware.  The only issues was that it took a while to get our food and sadly, we were almost the only people in the restaurant.  I will definitely go back when I am sure I have some time to spare.  Very good food!"}
{"text":"The backyard patio is very nice, but the inside needs some help.  Would love to check out the fireplace when cooler.  They had a few craft beer taps (Great Lakes, Fat Head's), but the pours were small, over priced, and worst of all, they were served in plastic cups."}
{"text":"Bar food. Well executed. Not gourmet, but good bar food. The taps were only OK. But they have cheap happy hour beer. I see some other reviewers talk about frat boys. I didn't see any. I saw a lot of dudes who looked like they might have been frat boys ten or fifteen years ago, though. Also, I was there to watch a game, and it would have been perfect if they didn't have satellite TV, which went out in the 3rd quarter. Anyway, I wouldn't say the place is bad, but it also seemed like it might get lamer and a little douchy as the night goes on and the later crowd fills in."}
{"text":"West Park Station hit the two requirements that I had for night: 1. It was showing the final World Series Game...Thank you Boston 2. It had liquor...Even more points for caring a truly gluten free vodka. Yeah Tito's. It's made from corn in case anyone cares what their vodka is made from.  One good or bad thing about Wednesday nights depending on how you look at it, they had karaoke starting at 10 pm.  The singers were pretty good. One of the biggest down sides thought was the seats at the bar. They were ass numbing.   All and all, West Park was a nice and clean bar to get a drink at. Plus it was a few doors down to Chipotle so you can get a cheap gluten free meal prior to drinking."}
{"text":"This place had great food, good service, and a nice environment. My only complaint was the music they had indoors, a live band/artist up front, who was SO INCREDIBLY LOUD that we were screaming at each other across the table."}
{"text":"Good service, very reasonable prices and killer dishes. The Greek salad is one of the best I've had and the wings are done perfectly. A good hidden gem."}
{"text":"Came here after one of my friends told me really good things about the food here....too bad I didn't have the same experience. My chicken sandwich was unbelievably dry, and could have been really good with the BBQ sauce if they would have cooked it right. My manfriend got a burger, medium, that came out well done. The service was HORRIBLE. Not only did it take forever to get a drink (keep in mind we were here at 5:30 on a Saturday, and they were NOT busy), but I was disgusted with how they treated this old man that was sitting at the bar, who seemed to be a regular. He ordered a pabst, still didn't have it after twenty minutes, and only got it when the guys standing next to him was asked for a second time what he wanted and he bought one for him (yes, this act of kindness almost made me cry). The guy ordered the pabst twice and both times the answer was \"yeah, hold on.\" One of the bartenders was walking circles around the bar talking on her cell phone. Not impressed with this place at all."}
{"text":"Not a bad place at all. Definitely a good spot to grab a drink. They have a nice big bar and I do love all the police and firemen things on the walls. Another thing I really liked was outside they have a fireplace and a big tent for the smokers hehe Yes a dirty nasty habit- but I give them extra points for accommodating us disgusting smokers when we gotta freeze our butts off outside! LoL   The drinks were pretty good and priced decently. The bartender was a bit inattentive though. She kept disappearing and it wasn't like it was crowded. That got on my nerves.  They also had a live band and they weren't that good. The music was low but the Mics were too loud and all you heard was his shouting rather than the music. Glad we got there when they were almost done for the night.   The overall atmosphere was nice- I'm sure on a Saturday night that place gets pretty busy. Check it out if you're in the area."}
{"text":"Great local bar! Indoor and outdoor seating area. Great music, and tv screens all over. So you can enjoy music and watch the cavs or Indians play. Reasonable prices on food and drinks!"}
{"text":"West Park Station might as well be called West Park Staple! This has been a West Park hot spot for a while now. Standard Americana bar food - I recently had a delicious pepperoni pizza. At a place like this, often the simple answer is the best answer! Good prices and relaxed atmosphere is the draw. When bands are here the place gets real rowdy - great place to people watch. Has a good sized patio, with a nice view of the crazy parking lot in the back."}
{"text":"This is my kind of casual dining, Cleveland style.  I love the location. An entertaining Korner for sure. The restaurant/bar has a great energy and friendly staff. They were attentive, timely and best yet wore a smile.   The food was d'lish as well. The wings are fried, not baked, and truly on fire in flavor. It's been a while since I've had wings this fantastic. My burger was cooked perfectly medium rare as requested and the mushroom and swiss toppings were equally fresh, making it a really great sandwich, bite after bite.   I am sure I'll be returning to this \"Station\" many more times to come. The staff, the guests and the overall fun and casual atmosphere are too good to miss!"}
{"text":"Such a fun place for a game night. Visited this place to watch the Cavs game last night and it was such a riot! We had such a great time and the service was great. We were able to get a big table by one of the projected TVs. However, the food was pretty bad. I had the veggie stirfry and it was so bland and just yuck. I would definitely return for drinks but not the food."}
{"text":"My fiancé and his daughter have been coming here for yrs.  Today was my first trip.  The shepherd's pie was about the best I've had.  Even the coffee tasted great on a chilly day.  I'll definitely be back."}
{"text":"The food is alwaysssss so good but the servers are unpleasant. They are super slow and always give dirty looks."}
{"text":"Nice place to grab a simple meal and a beer.  Menu is typical bar food menu but decent assortment.  Clean and nice place for family as well."}
{"text":"Do you feel like going to a bar packed with off duty cops, weird chicks, terrible cover bands and garbage beer? Go here. It is like being in the movie Cop Land without Sly Stallone around."}
{"text":"I've been going West Park Station for more than five years to hang out or when the band is playing. The staff is amazing and we always have a great time. If you're in the area on a Friday or Saturday night stop in and check it out."}
{"text":"Crowded on the weekends and okay during the week. The food is fair at best. Not a great bar to watch football. Seems like the place to go if you are a washed up drunk frat guy."}
{"text":"On way to Hustler club, so I give this  place 5 stars!!!"}
{"text":"Awesome food. Irish and Italian and, oh, ya , American.  I had the Calzone and my wife had the Shepherds Pie. Both were great."}
{"text":"I've been to West Park Station a few times over the past two years, and most recently was there to watch a Cavs playoff game and support a local charity.   WPS has a great menu and the patio area outside is spacious. The only knock on the patio is that there were quite a few TV's that either weren't on or not operational so it was hard to watch the game.   The food is superb!! I had the Lobster Mac and paired it with hot wings. This was my second time ordering Lobster Mac here and I'm glad that I gave it an encore. It really is FAR better than you would expect from a bar. The wings were also on point.   The staff was courteous and also did a great job assisting each other's tables. Very fluid. As someone who worked in restaurants from the age of 14 well into adulthood I always notice the staff and how they function. This group seems to enjoy working at WPS and also have embraced the teamwork approach to keeping things moving. Well done!!"}
{"text":"You know what goes really great with the NFL playoffs and arguably the biggest UFC fight card of 2015? Miley Cyrus at 100 decibels.       I would review the service but we've been here for  30 minutes and haven't received any.        You can be a sports bar or a dance club, not both simultaneously.        ONE STAR!"}
