{"text":"Sorry.

We really wanted junky \"Chinese\" food and Westown looked like would fit the bill. I placed a takeout order on my way home.

Got home. Shanghai noodles were soggy. Fried Shanghai noodles should never be soggy. Like a slightly warmer than room temperature milkshake. You can understand how it could technically happen but there's no reason why it would. Beef with vegetables were soggy too. And quite unappetizing. I kept wondering what they're doing to the beef to make it so unnaturally tender. Sweet and sour chicken balls were fine but the batter was a little doughy. See? We wanted junky.

I have to give a failing grade. If I didn't feel so bad about lowering the rating of a local independent business, I'd rate it lower.

Maybe it was an off night? I'll never know."}
{"text":"I walked by one day really hungry (April 2012). Did a take out order.

New Chinese restaurant I've never ate at before and has a bit of \"character\"? I only order (beef) fried rice to test them out... and never again here. They got it all wrong. Bland overall (adding more soy sauce couldn't even save it). Stale ass ingredients. Peas rock hard and dry for example. 

The menu is really cheap I'll give them that. But you get what you pay for. 
Personally I'd walk a few more minutes west on Dundas past Keele to a plethora of nicer Asian joints.

But hey. If you like Westown, by all means. Keep eating there. This is just my opinion. Eat wherever the f**k you wanna eat."}
{"text":"WARNING: DO NOT ORDER FROM HERE!! WORST Chinese food i have ever consumed!!

I ordered Spicy Wings & Combo #2 through Just-Eats.

- The wings were so thickly battered and the meat tasted old & looked grey. So much so that i was worried about getting sick. Took a couple bites and threw the rest away. (Which is unfortunate as i hate wasting food)

- The combo was also terrible. \"Chicken with Mixed Vegetables\" was more like \"mystery meat with rotting celery in brown sauce\" and the \"Sweet & Sour Ribs\" were all batter and essentially inedible. The \"best\" part of the meal was the \"Pork Fried Rice\" minus the pork cubes. I was so hungry that i shovelled a few spoonfuls of rice - which also happened to be the worst fried rice i've ever had, but seemed the least likely to get sick from. The pork cubes looked freezer burned and tasted rubbery.

PLEASE AVOID THIS PLACE AT ALL COST! DON'T WASTE YOUR HARD EARNED MONEY!!!"}
{"text":"Discovered this place randomly.  It's located in a fairly empty section of Dundas Street/Annette St. 

It was seriously the best chicken fried rice and noodles I've ever had. My mouth is watering just thinking about it! I think I will have to make my way out there tomorrow :)

Best for take-out only. I wouldn't go here for a special occasion - the decor is very outdated and plain."}
{"text":"Saw all of the positive reviews on JustEat so I figured this place must be great! The food is super bland and spicy without an attempt for real flavour"}
{"text":"Would give this 0 if I could. We ordered 2 dishes, approximately $40. The \"chicken and onion with ginger\" was an entire takeout container filled to the brim with yellow onion and literally about 6  bic lighter sized pieces of chicken in a sauce that could only be described as \"grease and nothing\". The \"beef and vegetables\", you guessed it! A few sad pieces of beef and a mountain of yellow onion with 2 pieces of baby corn and 2 (TWO) pieces of broccoli being the vegetables. Bit livid, I ordered Chinese food not 2 entire containers full of onions."}
{"text":"We got takeout from here. The order Took just over an hour to get to us. Once we got our order, the dishes given to us wasn't what we ordered. To top it off, the noodles were half cooked and half undercooked and still hard. I will never order from this place again."}
{"text":"Best chicken balls in the city! Good fried rice too.

My only notes are that crispy ginger beef could use some more crisp and the wontons aren't filled (just wrappers that have been fried). Making this clear on the menu would've cleared up the confusion though.  

Fair prices and portions. Their delivery radius is great."}
{"text":"I ordered mushroom egg foo young through delivery. Absolutely disgusting. If I could give them a 0 I would."}
{"text":"I ordered delivery from this place the other day, it arrived really fast.. like within 15 mins. I was a little concerned, wondering if it will be freshly cooked or if it was just sitting in the restaurant then scooped into containers. But the food did arrive piping hot so maybe it was freshly cooked? :S

General Tso's chicken - sauce was average, chicken was okay.

Black pepper beef tenderloin - I'm pretty sure it was not beef tenderloin pieces, which sucks because I specifically paid extra for this item. There was a lot of broccoli and not a lot of beef either, and the beef was chewy, not tender.

Steamed rice - meh. it was ok. Just a little too soft and almost mushy in texture though.

Overall, average Chinese food. There's not many other options in the neighborhood unfortunately, but I wouldn't go out of the way to eat here."}
{"text":"The worst Chinese takeout I've ever had in Toronto. I ordered Cantonese chow mien and tofu with mixed veggies. The noodle looks like instant noodle and I doubt it's not even fried. The sauce was way too salty. The same went for the tofu. Won't order from this place again."}
{"text":"Looking for a Chinese delivery and found this one on the web. Have to say it was very disappointing. Took 1/2 hour longer than they said (for a total of 110 minutes) and it was cold when it arrived. Kung Pao chicken was flavourless as was cashew chicken. Fried rice was meh and dumplings were uninteresting. Would never go back. I'm sure you can find better."}
{"text":"I used to really love this place. The food used to be delivered hot and correctly (through Just eat). In the last few months, they have started messing up orders. They sent vegetables and rice dishes instead of meat ones (also cold) First time, they refunded me (only the incorrect dishes). The SECOND time (yes I ordered again) they again sent two rice dishes and no meat because \"they read the label wrong\". They also tried to offer me store credit, and I said no, if you won't bring me the correct food I want a refund. I'm really on the fence about ordering from here ever again which is very disappointing"}
{"text":"Ordered from Westown from JustEat so I didn't know it had a two-star Yelp review.  I'm just so tired of this sea of terrible chinese food restaurants in Toronto.  In the suburbs people don't support BAD chinese  food places therefore there are none.   In Toronto, basically restaurants like Westown cook up some bottom-of-the-freezer meats with flaccid, decomposing vegetables topped with a controversial black bean sauce. If you go into the restaurant you will see that the furniture is provided by value village because it's just random discolored chairs and tables from some 80s households. I've seen a co-worker toss half his meal in the trash. He said, \"I just can't continue to let that stuff inside me.\" Another co-worker said, \"ew\" and pointed to the trash can upon learning where the food came from.  Westown, you're clearly not taking the Chinese food game seriously so I can't take you seriously. 2 stars."}
{"text":"This was the worst Chinese food I have ever had, the pork fried rice was dry and the pork pieces hard an tasteless, beef and broccoli was drowning in a salty sauce and the noodles were greasy. Tried to eat the egg roll but gave up, all of us just pushed our plates away. We  hate giving a local place a bad review but this was to bad not to."}
{"text":"Toronto has a serious Chinese food shortage, I found this place on just eat and decided to try it out. I ordered lo mein with vegetables and general tao chicken. It took them about 90 minutes to deliver, which was disappointing. The food was okay. The noodles tasted kind of weird, the veggies were good but then noodles did not taste like lo mein, they tasted cinnamon-y, that's the only thing I can compare it to. The chicken wasn't breaded, which was weird, it was just chunks of chicken covered in sauce. Sauce was flavourful but the chicken felt slimy. Now this may be because I'm pregnant but the texture ultimately made me throw it back up. For 30$, I certainly won't go out of my way again."}
{"text":"This is the worst Chinese food I've ever had. It tastes like someone dumped a bottle of hp sauce into every single dish. This app won't let me give it zero stars. We threw the entire order in the garbage and ordered a pizza instead. I love Chinese food. But this is not food."}
{"text":"Pretty good Chinese delivery.  Very inexpensive and large portions.  Food was not spectacular but was reasonably tasty."}
{"text":"I've ordered from here for a few years now and today that will for sure be the end of that! 
Paid the extra 2$ to upgrade from shrimp to seafood ... it came with just shrimp. The lobster sauce was like salty msg water and there was frozen peas and carrots in it. Oh did I mention it was cold? The egg roll was cold and dry. No fortune cookie, hot sauce, plum sauce etc either. I should have just ate the kraft dinner I originally planned to eat."}
{"text":"Please DO NOT LISTEN to any good reviews from here or anywhere. Please save your time, money, and yourself from this. I wouldn't five this any stars either way. Food came 1 hour LATE. COLD ofcourse. Expired fortune cookies. Orange chicken looks GREY inside! All the 5 star reviews on Just Eat are all lies and fake."}
{"text":"I rarely get take out, so rare that I'm at a panic and loss for take out menus whenever we do consider it.   In times of absolute desperation, we turn to Westown.  

We ordered 2 combos (yes, combos because I didn't have their menu anymore and the online menu shows only combos) and an order of deep fried wontons which came out to $25 with tax and delivery.  Our order arrived 45 min. later as promised on the phone.

Food was alright, a tad on the salty side but that's to be expected from junky Chinese food take out.  Portions were good, plenty of leftovers for lunch the next day.

Not bad in a pinch but again, I don't get take out, especially Chinese food take out that often, only because I know where chicken balls come from and the secret ingredients in the red sauce."}
{"text":"So greasy. Got the wrong spring roll. General Tao's chix was swimming in sauce and soggy. Never order from here. Pretty sure i will get ill from the grease."}
{"text":"This used to be my favourite place to order from as I live just down the street! I haven't ordered it in a while due to health reasons! I decided to have a cheat day today and order and was very disappointed! The food was hot but I asked for noodles with my meal instead of rice and they have always accommodated before for an extra charge. The charge hasn't changed but the quality of the food did. They literally sent me boiled noodles with no flavour or sauce. They put the sauce on my chicken balls not on the side and didn't sent any cutlery! 
I gave one star for the food being hot and one for the nice delivery guy... I'll never order from here again--- I'd rather spend an extra few dollars and go anywhere else!"}
{"text":"We've never gone in to eat but their delivery is great. We love to get the vegetable fried noodles, lemon chicken, and General Tao's chicken. Westown is our go to for Chinese food delivery."}
{"text":"I ordered for delivery and it arrived 50 minutes later. The general tso chicken was very good, along with the broccoli and mushrooms. I wasn't too impressed with the cantonese chow mein, but it was okay. The food was definitely worth the price, I also received 2 complimentary spring rolls which was a nice touch."}
{"text":"This is the worst Chinese food I've ever had in the city.  The impeccable reviews on JustEat (all 2959 reviews) must be bots.  The shanghai noodles were mushy and flavourless.  It was like eating paste.  The chicken balls were very dry and the general Tao chicken was really mushy.  Nothing was crisp, everything tasted like it was sitting in its sauce until it absorbed into the batter and became mush.  Mush is the word of this review.  Just garbage food.  
As a note to myself in the future: Avoid this restaurant."}
