{"text":"Wexford Ale House used to be a favorite of mine. My friends and I would go during happy hour and for dinner 4-5 times a month during the summer. Recently we went back and the past two times our server pretty much pushed us out the door. Never asked once if we wanted our checks or if we needed anything else, but insisted on dropping off our checks. All of the other servers and bartenders have been fantastic except for this particular one. Foods pretty good, beers good, but the recent service I've received is lacking."}
{"text":"Great beer list. Menu is on spot, food is good. The mild wing sauce is actually hot. Good but hot."}
{"text":"Very disappointing.  Had Veggie Burger which was so hard I could eat barely half. Realizing that a Veggie Burger is not a great! seller it should be edible and fresh not with freezer burn. The fries were somewhat better. The poor waiter was harried. She did as good a job as she could under the circumstances.  Never again"}
{"text":"Very nice! A small place; cozy,  not crowded. Service was quick and friendly. I had the Guinness Fish Platter which was very good. The fish was moist and tender, the batter was tasty. I will be back."}
{"text":"This is a hip little spot with an incredible beer selection that is always changing. Great atmosphere with lots of TVs, always crowded (just the way I like it)!  For those of us who have business in the North Hills or live outside of the city, I thank my lucky stars for bars like this one. See you there!"}
{"text":"Went for a Sunday afternoon lunch and it took 10 minutes to get someone to come over to the table...then another 15 to even order.  We wanted a quick lunch and figured we would try the place based on good reviews.  Maybe if we sat inside the service would have been better, but you would think with so many tables outside that they would be use to serving guests out there.  When the order finally came out it was wrong.  We ordered onion rings as a side, which they upcharge for...but got french fries instead.  By the time the onion rings came out we were done with the sandwich. They were sure to keep the upcharge on the bill.   Very disappointing..."}
{"text":"Good food and good specials and great beer selection!!  We enjoy craft beer and found the Wexford Ale House though an online search.  Very friendly and knowledgeable staff.  Parking is a little difficult to find the first time there, but once found, easy.  We are repeat customers and will definitely be back again.  Have recommended it to friends!"}
{"text":"Best. Bar. Ever.... In the North Hills! Majority of this review is due to the awesome bartender Lauren. Well, that and the amazing beer selection. I highly recommend coming in when Lauren is working... Best service at a bar I have ever seen. It's Friday night, the place is packed, and I have yet to see someone with an empty beer. Hidden gem!"}
{"text":"Sadly, they have rather noticeable raised their drink prices, still a good deal during happy hour."}
{"text":"Total bro bar. The food is average. Beer selection and prices are awesome. Lots of seating, lots of TVs. Come here with your buddies to watch the game and eat typical bar food that's nothing exceptional. As long as that's all you're looking for, this is the place to go."}
{"text":"The beer specials are great. Food, not so much. Moving to the North Hills from downtown has proved to be a not so great move in the culinary department but it's nice to find a place with a good beer selection. Food is typical bar food that you would find just about anywhere. A little pricey for what you get as well. My suggestion, hit up the happy hour and grab food elsewhere."}
{"text":"This is one of my favorite places.  The beer selections is fantastic and always changing.  The food is pretty good, but not great.  The prices are not bad for what you get.  Overall, a great place to sit down and have a beer and some grub."}
{"text":"I have been here multiple times with my husband because their craft beer selection is great.  They get an A+ for that.    However, they get a big fat F for service if you aren't sitting at the bar.    We had about 12 people meet there for a happy hour.  We all sat at seperate tables but pulled them near each other so we could talk.  After being there for a couple of hours, I asked for my check.  The waitress had already brought a seperate check out for one person in group and he had left.   Instead of saying anything or explaining the situation, she got her manager and her manager brought the check over for our entire group combined.  First of all, no one ever asked if the rest of group was finished and ready to leave.  I had asked for my check only, and reminded the waitress exactly what I had had to drink.    The manager told us their computer system won't let them split checks for parties over 5 at one table.  I told her, \"but, we have three separate tables.  The waitress could have kept track of them separately.\"  She said it didn't matter.  I said, \"another member of our party already got a seperate check and paid and left.\"  She replied with, \"well, the waitress must have just guessed.\"    Um, what?  So basically telling me that your computer system will not let you split checks is not actually the case.  I'm fairly certain that the check for our full table that she brought out to the rest of us included the stuff that the member of our party already paid for - effectively charging us twice for that portion.   So we all gave her 12 debit cards and asked her to just split it evenly.  Apparently the computer system is capable of this.  I think the problem is that the staff isn't capable of any actual thinking.    I will never, ever come back here for a work happy hour.  I also might not even come back any other time.  There are plenty of other places with a good beer selection with much better food."}
{"text":"This place is fantastic.   Great food and beer selection, TV's to watch sporting events, as well as an area outside in case you just want to enjoy some good beer and or food away from the tv area. As a prior poster said, this really is a hidden gem.  The service is also great."}
{"text":"Bring back the fried pickle SPEARS!!  As noted in several previous reviews, the fried pickle spears WERE great!  Unfortunately, they have replaced them with fried pickle CHIPS.......which are very blah!"}
{"text":"The beer selection is the ONLY thing that makes this place worth a stop.  Food is average at best, service is slow, and I'd rather not speak about the rudeness of the woman who I believe is a manager of some sort there.  She openly berated a server about a spill at the bar that was, from my view, not even her fault.  I was later told that the server left in tears and quit.  The last time I saw such unprofessional behavior at a bar was at a college frat party years ago in my youth.  I can only hope ownership makes a change, (well, more than one.  Their exterior advertising is non-existent, and if you're going at night, use your GPS, or you'll pass it.        I might try the place again after the holidays, but I wouldn't be surprised if the experience is the same.  Based on the non-existent exterior lighting, and the management I observed, this place may not be on my agenda again."}
{"text":"Service has been very good lately and the food is well prepared.  Great menu and beer selection."}
{"text":"What a quaint pub!!   From the pictures on the website.. I expected it to be small but it wasnt. Its a nice size pub!    From Perry Highway the view of the Wexford Ale House - red umbrellas and outside seating.. its inviting on any summer day.   We only stopped in for a drink but it was a nice visit. There was outside seating available as well at seats at the bar.   The thing that may throw some off is the parking.. it appears you are parking in a dealership lot - but its not since its in the rear of the building.     I look forward to my next visit ... thanks Wexford Ale House."}
{"text":"The food was very good and so were the drinks. I think that it was a bit overpriced but not too terrible. We went when it was nice outside so we sat outdoors, it was nice minus the fact we were facing Rt. 19 which is so busy. The waitress was ok, but could have been more attentive. But overall, I would go back."}
{"text":"The Wexford Ale House is a worthwhile stop no matter what, but really takes the drudgery out of having your car serviced across the street.  Great draft beer selection, tasty menu, and a real neighborhood vibe (especially for the suburbs!).  Don't mistake the 4 stars for a criticism - I save 5's for true destination places.  If I lived within a 5-mile radius, I'd be here weekly!"}
{"text":"One of our favorite places for happy hour! Wexford Alehouse provides a nice evening out as you can simply go for drinks, apps, dinner, or to watch the game. It offers outdoor seating, bar seating, high tops, and low tops and often fills up quickly as it is a small restaurant. Parking can be tough at times, but we have never not found a spot.   We rarely order food here, as the drink specials are the most enticing - however I have had the ham and turkey club with fries and it was delicious. My favorite item on the menu had been an appetizer, Italian Roll-Ups - Italian meats and cheeses wrapped in a tortilla served hot with a side of marinara sauce. THEY TOOK THEM OFF OF THEIR MENU!!! It makes me so sad. My husband had the buffalo mac and cheese and wasn't overly impressed. Overall, their food and drink menus are a bit pricey for a sports bar, but the specials make it worth coming to.   We will be back this fall. I fell head over heels in love with the Whole Hog Pumpkin Ale last year and they have it again this year. We love the atmosphere and service, and will continue to come here and maybe become \"regular\" status."}
{"text":"I went here for lunch with coworkers one day to celebrate someone's birthday. This is pretty much a regular bar with comparatively nice bar food. It features a long list of beers that are available (which we did not sample due to it being the middle of a work day) and a two-sided single page menu with appetizers, sandwiches and burgers.   While the menu is certainly a bit narrow in options, whatever you order, you will get a massive meal that even a long trip to the gym won't work off. I can safely say the cheesesteak hoagies are delicious (three of us ordered it) and the burgers are enormous (one person ordered one of those). The fries are also wonderful!  The place was fairly empty when we went (since it was the middle of a work day), so we had our own choice of seating. Only real complaint there is that only one side of the bar features any real lighting; the other was extremely dim and unwelcoming. I didn't watch what was on TV since I was with others, but as others have said, there are plenty of them around the bar.  Can't say I would go out of my way to go back - especially because a few older men in particular acted as if they had the run of the place and no one on the staff bothered telling them they were interfering with others' abilities to enjoy their lunch - but it's an ok place if you're in the area."}
{"text":"Very good beef on weck. Cole saw too dry, not enough mayo. The burger was great, cooked perfectly and the fries were very good. Cold beer and great service round out the stop. Will return again"}
{"text":"Great draft selection, beer specials, and bar food. Ideal place to watch football on sunday"}
{"text":"I see many prior Yelper reviews use the term \"quaint\". Not me. My word is \"ain't\". Like...ain't got enough room to sit, stand or breath. Ain't got enough domestic beers to match the overrated microbrews. Ain't got anywhere to park. Ain't got a bartender to acknowledge that a person needs a beer as I stare at my empty class. Wow, I ain't ever coming back"}
{"text":"I've been here a few times, most recently 7/9 (last night). Usually I just have beers and play golden tee, but we ordered appetizers this time. The loaded fries were good sized and covered with that yellow cheese sauce that goes on everything. The fries were kind of warm, but the inside was still a little crunchy. I'm not sure if they were completely cooked, but the consensus from the 3 of us is they weren't. The cheese sauce made them pretty slimy towards the end.   Onto the beers! I'm pretty particular when it comes to cleanliness at the bar and this is the real reason my rating is low. They stack their glasses after they come out of the sanitize station and don't let them dry first, they have the black mats right in front of the draft system to stack them on. The bartender was pouring drafts and dripping all sorts of different beer on the black mats and glasses. Not cool or sanitary. My one friend ordered the same beer 3 times, so he had the same glass all night, not too big of a deal but again they grabbed his glass from the top where he drinks from and gave it back that way as well. It's just not the right way to do things. I uploaded a picture of the Bell's Oberon draft I received, I have never been served a beer with that much head on it. Nobody wants to go through 2\" of foam to get to their beer.   Will I go back? Probably, but I think I will start ordering bottles rather than drafts."}
{"text":"The wings were fantastic, fried pickels were yummy as well.  Good craft beer selection.  I'd definitely go back."}
{"text":"After passing by this place several times, finally stopped in with a few friends.  A very nice and quaint beer pub. There is ample seating inside as well as outside seating. There are flat screen TV's around the bar area and in the seating area. It is a great place to watch a football or hockey game.  The service was exceptional. There is an ample amount of bar staff ready to serve you. The owner Dave is hanging around and very willing to chat you up about beer or the Ale House. The bartenders are very knowledgable about the beers on tap.  The selection is quite good. There are at least 30 beers on tap, including many new releases and seasonal beers. They do have some botles available as well.  Many types of beer styles on tap, many rotating.  There is a more than ample menu with a lot of interesting food selections. I have only eaten there once, and the burger I had was alright, but there are a lot more items to choose from.  Overall, this place is a really nice place if you are in the Wexford/Cranberry Area. The bar is crowded, but not overly crowded, seats are available with little to no wait. The service is exceptional. The prices are MORE than reasonable including happy hour prices of 1/2 off drafts. When Happy Hour is not in session, most draft beers are $5.00 with some higher priced beers which is usually based on ABV.   If you are in the North Hills and looking for a place with a really nice selection of craft beers, this is a great place to stop."}
{"text":"I was pretty happy with this place! Total dive bar environment, homey bartenders and happy bargoers. The beer is sweet and chilled, but the parking lot is a tad difficult to find.  I was totally at home here, which is hard for me to say in suburbia. I wouldn't mind coming back here for an actual happy hour that isn't at 2 am in the morning"}
{"text":"Fried pickles and french onion soup are really great. I orderd the stucffed chedder burger with onion rings. The burger was just okay  very small the rings were good. My husband got the ale house chicken salad. Very big and filling very good. Homemade bleu cheese dressing was good. Southern tier warlock pumpkin ale my husband really enjoyed."}
{"text":"This was the second time I had been at the Wexford Ale House and it was just OK. The first time I had been there was in the summer time - we sat outside and had some specialty beer and appetizers. Tonight I met a friend for dinner. I ordered the Mediterranean Vegetable Wrap. I only ate half of it - wasn't anything great. Half of the menu was blacked out with a lot of unavailable items so that definitely limited what you could order. I'm not in the Wexford area very often, and I probably look for another place to go before I thought of this place again."}
{"text":"I ordered a beer and got a beer with a piece of someone's steak in it.  I told the waitress about it and she said it probably fell in there when they were washing the glass.  They didn't make me pay for that beer.  The food is just bar food.  Nothing special.  They also didn't have soap in the women's bathroom or paper towels in the mens.  I was really disappointed."}
{"text":"food was average and atmosphere was good, but it all comes down to service. we seated ourselves per the sign and waited. it took awhile before anyone came over and she looked less than thrilled to see us sitting there. can you tell us about this beer?  nope.  have a question on this menu item. sorry. all i can tell you is what color it is. very helpful. she brought our check without asking and when we asked did she mind if we stayed for a few beers she looked annoyed. came back 5 mins later to ask us to cash out so she could leave. we stayed & talked awhile but nobody ever even looked our way again. i'm sorry but service this bad will mean no second chance for this place even if the food & atmoshphere are decent. there are other choices in this neighborhood."}
{"text":"First Impression:  This is my local bar. I do not know how many times I have been here but I keep coming back. I must preface by saying that the only food I consume from here are the fries, I normally come strictly for the drinks. The location is weird, as many people have mentioned, and the parking is odd as it is around back, I could not find this place the first time I was invited to come here. A lot of wood in there, woodgrain everywhere. So many taps! There is almost always something different for me to try which I really enjoy.   Service: Good, normally... most of the time when I go in it is Lauren behind the bar, who is awesome. She is always cheerful, says hello and has a little chat when time permits. Other days that Lauren is not working are hit and miss. There was one time I came in here with a couple of cousins who are from the UK, there was an older gentleman behind the bar who I had never seen before. I stood for at least 5 minutes as he struggled to keep up with drink orders, I really felt bad for the guy. Another time my girlfriend and myself were not treated very well 10 minutes before close, told to \"drink up\" and it made us feel very uncomfortable, I believe this is the woman that is the manager, she might have been having a bad day and she apologized to us the next time we came in.   Atmosphere:  Depending on the day, obviously, this place can be dead or bumping. Any game night this place is typically packed, they have plenty of screens so you cannot look away from the game, it's impossible. Other nights, like Sunday they are normally very quiet. Regardless of what it is like in here, typically you feel comfortable and it has a homely kind of vibe about it. Also, they have a patio which is really nice in the Summer months.  Food: As I stated before, I only eat the fries here which are perfectly fine. Nothing special, not the best fries, but they do the job to go with my drink. They are typically made quite quickly.   Drinks: Where do I begin? So many choices. I'm a beer guy, so that is normally what I stick to at this ALE HOUSE. There is such a large selection of beers on tap I just can't stay away. I like to try new things, and this place is the place to go for that. They have different deals for every day of the week, most of the time beer deals (which are listed on their website as well as the chalkboard inside). I normally look at the aforementioned deals or their \"Draft of the Day\", which is an ever changing craft beer, and at $3 it's normally my go to drink. They also have a \"Mystery Beer\" for $3, I really just don't even bother with that as I normally like to know what I am drinking beforehand.   Price: I normally hardly ever buy a full priced beer unless it is something special I have never had before. As I state previously, the happy hour/daily beer deals are the way to go. Craft beers are mostly over the $6 pricepoint. I'd say it's a little on the expensive side although you get a great selection to choose from. Still, those beers add up, so watch yourself!   Restrooms:  They do the job. Sometimes the paper towels are out or they are just sitting on the sink rather than in the dispenser. Whatever. Not the best restrooms but I can't really complain considering there are drunk people more than likely peeing everywhere in there all the time.   Overall:  If you're in the area, or you like your craft beers, it's worth a gander. They update their website quite regularly so it's nice to be able to see their selection or what deals they have for each day of the week. The bartenders here are cool, especially Lauren. This is the closest thing I think I will get to as to having a \"local pub\" in Wexford.   Tip: Check out the \"Draft of the Day\", \"Mystery Beer\", and different daily Happy Hour specials."}
{"text":"Pittsburgh Bound!  Part XIV  (For Part XIII, go to http://www.yelp.com/review_share/19XaxYSjNnI4DUdy8QshbQ/review/JAA6rarcLLWRZdI0qNgchg?fsid=AWdQiVvWP2nN-7yEGMulRQ )  I've driven past this place a billion times visiting my friend and never went in.  Today was the day.  With it being Labor Day Sunday, the place was empty which was good, because I could imagine if it was busy, parking would be at a serious premium.  It looked like there were only about 30 spaces shared with a used car lot.  I don't drink beer, so my review is solely on the food, however their beer selection was very impressive and I could see how this could be a popular place especially during happy hours.    The menu is fairly diverse which is as to be expected from your normal beer bar, and typically these kind of places pride themselves on burgers so I opted in.  I ordered a black and blue burger with a side of fries.  There was nothing about it that was all that great.  I'm a blue cheese fanatic, and theirs is really good, but the burger itself wasn't anything special and the fries were a little too greasy for my tastes.  I'm sure if I was lit up like a candle on booze, and ordered this around midnight, it would be the greatest thing I've ever eaten, but it wasn't the case.  Again, I could see this being a pretty cool place to hang out at, especially on their outdoor patio during the summer/fall, but otherwise, it just felt like another bar.   (For Part XV, go to http://www.yelp.com/review_share/GuWbgXDIi5lmHttow9pWhA/review/QQDBXqJ4PNSyH48DBedqhg?fsid=qGcsH56SzZAN2LuCQyTPTQ)"}
{"text":"We finally stopped here, it was pouring rain and we couldn't see the highway. Place was packed, lots of beers on tap, full stocked bar as well. It's pub food, don't expect anything fancy. I had a Greek chicken wrap, it was pretty tasty. Their salads are basic with packaged greens, croutons and bottled dressing. He should offer a really nice fresh salad with house made dressing and he might get a little different clientele in there. I'm a salad junkie, but I want fresh ingredients and house made dressing.....that's just the food snob in me. My husband had buffalo chicken salad. He liked it, said it was pretty damn tasty. I was on crutches the evening we were there, so I was waiting outside for my husband to get the car. The owner was standing out there as well. We had a brief conversation and he seems like a very nice man. I'm glad his place was packed, it's always nice to have a full house when you are a restaurant owner."}
{"text":"Every place has an off night and it seems we experienced one (I previously left a bad review. See below). The owners contacted us and truly wanted to understand what happened and invited us back with a gift certificate. We went back and it was a completely different place. The food was great, beer, was great, and service was great. I'd still like to see a more creative menu, but what they do offer is really good. I had a buffalo chicken wrap and I could actually taste the wing sauce and blue cheese (a rarity). My wife had a burger that was cooked perfectly.   Special credit should be given to the bar tender. I didn't catch her name, but she is awesome.     ---------- An ale house in a more upscale neighborhood... one would expect good service, good beer selection, and an interesting menu. Well, one out of three ain't bad. Wait. Yes it is.   All this place has going for it is the beer selection and you can get that just about anywhere these days. The menu is bland, the sandwhiches are dry, the wings are under cooked, and the salad is frozen.   My wife even found a piece of steak in here beer and they acted like it was a common thing. That is disgusting. They acted like they did us a big favor by not making us pay for it."}
{"text":"This is one of our favorite local joints.   Don't make the mistake that my\"better half\" made - they won't tell you the mystery beer...even if you ask nicely. They MAY confirm or deny your suspicion after you order and taste it. But please don't ask \"what's the mystery beer?\"  Food is solid. Have never had a bad meal here. Even when we've gone with others who have ordered the boring spinach/artichoke dip, it's been tasty.   I guess if pressed, the bathroom in the winter is chilly. If you've had enough good food and beer, it's not an issue!"}
{"text":"This is a good spot for the beer lover.  The selection of tap and bottled beer is exceptional as usual.  I enjoy meeting up a buddy for a late night beer there after the kids are in bed.  Not a very large place by any means but there is outdoor seating when the weather is nice.  The do fill up growlers so if you have one, bring it in case you have something you like.    It is a little more laid back but sometimes a few people don't know how to drink the beers (slow down with higher percentages) and they can get a little loud or out of control.  We had a couple last night bumping into my buddy (while we sat at the bar) several times throughout the night and were very loud and obnoxious.  Obviously, this isn't the bars fault, but it can happen for those who just toss them back and don't think about how much alcohol is in the beer.  I will absolutely be back there again as I really enjoy this place."}
{"text":"We love this place. We've only had a bad experience one time and I think it was because the waitress was brand new. Great beer selection and the food is great. Their buffalo sauce is HOT, that's the only thing I don't recommend unless you like hot sauce that makes you sweat."}
{"text":"This...was not good.  It was...bad.  BUT, there's a bright side!  Tons of good beer selections.  So while you're sitting at the wobbly table, muscling through the gristle in your steak salad (as my wife did), you can slowly kill the pain of the experience by drinking your weight in some really good beer.  Parking is...confusing.  The parking lot next to the place isn't theirs.  Theirs is practically inaccessible in the back.  We parked across the street at a medical center that was closed.  It was the best parking spot around.  Possibly my review is biased low because we sat next to a group of people who were loudly and drunkenly extolling the virtues of running from the police when you drunk-crash your car into a tree, because by the time the police find you, you're no longer drunk.  Toss in a few eff bombs per second about police...and how many police you've ever beaten up at once...and you have delightful background banter to frame a bad visit to a crappy 'restaurant'.    If this was a pub review, I'd toss another star or maybe even two on it. It's a fine pub.  Just don't eat there."}
{"text":"Their happy hour is awesome! $3 drafts for beers normally priced at $6 and they have a decent selection!   I don't typically order a meal when I stop here. I've had some of the appetizers. They are good. Typical bar food."}
{"text":"I enjoy occasionally stopping in here. The service is average, the beer selection is enormous and the food is tasty with large portions. They run specials that help keep me coming back. I do not go out of my way to stop here but I enjoy my experience when I stop.  Recommended."}
{"text":"Bit of a pain getting into the parking lot but once you arrive all is good. Big selection of beers.  Plenty of TV's to watch Sports on and had a really good chipotle cheesesteak on Mancini's roll with homemade French fries. Definitely worth a visit."}
{"text":"Decent beer and prices.  Food is half decent too.   My only complaint is the parking situation.   You have to drive past it and around the car lot then back in back.  The main entrance is on the back of the building."}
{"text":"This place was kind of a disappointment. The atmosphere was so great. But then the food was kind of burnt and greasy. Our nachos were probably the best part of our meal and the ground beef on top was hard and over cooked. Our entrees were ok, but the bacon on my burger was so undercooked and greasy that I had to pick it off. We really wanted to like this place. The service was good and like I said before, the atmosphere was nice. Even the outside had a welcoming aesthetic. But the food was just not up to par."}
{"text":"Update 1/6/2016: We dined here again recently and the comments from the members of our group was that the environment is warm and engaging - it is a great ambiance. Further if one is an aficionado of beers, than this should be on one's favorite list, as the variety is large and the staff is quite knowledgeable and helpful.  Everyone's soup and sandwiches were good.    Update 9/21/2016: I received a very gracious call today from the owners wife regarding my recent disappointing visit. She seemed very concerned and requested further details about my dining experience. She assured me that they would be talking to the staff to ensure that problems were handled more professionally. She seemed very sincere and convinced me to dine there again. I appreciate her efforts and will be visiting their establishment again."}
{"text":"Visit on an almost weekly basis and am usually very pleased with food and service, Brittany is a great bartender. This review however is entirely in response to the recent decision to implement a late night menu.  Based on the menu and how the food on it looks they are not trying to attract anyone to eat here after 9 pm. Poor selections and high price to portion ratios are the biggest culprits. Throw in a lack of notice, no signs touting the new menu, and I am certainly disappointed.  What is usually a go to spot in the North Hills at night may quickly fall off as an option. There is certainly the  ability to improve and make this menu a good idea but for now a better idea would be to just close the kitchen."}
{"text":"I have been here on several occasions with various groups of people.  The majority of times have been for some really great drink specials for happy hour.  They definitely have the beer/cider drinks down and often have a pretty great variety.  With fall approaching, I'm excited to come here to sample some great pumpkin and autumn selections!    The food here is average at best.  I try to avoid eating a full meal here because it has never been anything to write home about.  However, they do a pretty decent job with some of their bar food.  The BEST appetizer by far is the ale house roll ups which is pretty much an Italian meat ho-ho with some marinara dipping sauce.  It's actually really great and easy to make at home!    Their happy hour is actually probably my favorite in the Wexford area for both selection and price!  And if you're looking for some place to drink, the Wexford Ale House lives up to it's name.  Even though this is only 3 stars for me, I'll be back here frequently to enjoy some great drinks with friends.  They have a great location right off of 19 by Whole Foods Market and have a decently sized bar to hang out at."}
{"text":"great food great beer (and lots of it) great atmosphere great service 'nuf said!"}
{"text":"When we where asked to meet a friend here I was not sure what to expect. Parking was a little tricky but we made it after realizing it was in back. This place is  really nice! The menu is full and interesting, offering many house originals. They even have a late night menu. The drink selction was also as impressive. I can not wait to try this place again!"}
{"text":"Came on a Sunday for lunch and left very happy. Wide selection of beer and good food well prepared.  Portobello mushroom melt  sandwich was good,as was the beef on weck with quasi keemelweck bun and cole slaw.  Kudos to the chef and our server was really on top of things.  Only downside is limited parking  lot in back."}
{"text":"Love this place.   Great beer selection, awesome food, and friendly service.  Great crowd of regulars and no crazy drunk customers to deal with. Always feels a little bit like cheers when you walk in"}
{"text":"Go for the beer but don't order the food. When you see the outside it looks like it's a very nice establishment. On the inside it's a basic bar. I ordered a chicken salad and my hubby ordered wings.  The wings came out hot with a dry Cajun rub. They were middle of the road taste wise. Not bad but nothing that would stand out. They had a small kick o them at the end.  I had ordered grilled chicken for my salad but they brought me crispy, breaded chicken. There wasn't much chicken, just large pieces of iceberg lettuce. I definitely wouldn't order it again.  I ordered the Turtle Cheesecake for dessert. It was the best part of the meal. How can you go wrong with chocolate and caramel??? What I would like to suggest is that they come up with a dress code for the waitresses. Ours looked 12 but I know she had to be at least be 18 to serve beer. She was wearing a shirt that only covered a third of her bra. Not. Even. Kidding. The other waitress had pants on so tight that you could tell she wasn't wearing underwear. I really don't want to see or think about my waitresses' underwear. If I did I would go to Hooter's."}
{"text":"This was my second time visiting this restaurant. The first time I went there with my wife on a Saturday afternoon to watch the Penguins game. This is a great place to watch any kind of sports, there are TVs everywhere. My wife and I both loved the food and the service was great. They have a huge selection of draft beers. We decided to try this place after hear Mark Madden talking about it on the radio. The second time we brought friends, and I have to say I was kind of disappointed. We even ordered two of the same items. The buffalo Mac and cheese and wings. It just didn't seem as fresh and didn't seem like much care was taken by the cook. It was almost like the wings were reheated from the day before. When we first got there there was only one female barmaid so we had to go to the bar to get drinks and take them back to our table. The barmaid looked like she just rolled out of bed, threw a sweatshirt on, and came to work. A short time after that, a cute little waitress showed up and gave us great service the rest of the time. We really appreciated her after having to deal with the rude barmaid. I saw this barmaid do one of the most inappropriate things I have ever seen at a bar/restaurant. I'm not sure if she had a bloody nose or what, but she had like a napkin sticking out of her nose for at least 20 minutes. I mean like a whole napkin. Unbelievable huh? She was even tending bar the whole time while this napkin was dangling out of her nose. With all of that being said I will probably give them another chance because the first visit was so good."}
{"text":"Great beer selection good pub food but we seem to get the same waitress every time. We never get her name because she doesn't give it to us. A greeting would be nice instead of \"Do you know what you wanna drink\" 3 seconds after we sit down."}
{"text":"First tip parking is around the BACK of the building. So you have to drive past it (going south), or turn in the road prior to the Ale house.  Our server was very nice and knowledgeable about the food and beer selection. Felt very comfortable here. Nice beer selection, but I ended up going with a Yuengling on draft (prefer more wheat options, but maybe it's a seasonal thing.)  I had the Buffalo Chicken Wrap (fried chicken option) which was really good. The chicken was hot, spicy, and crunchy in the wrap. A good buffalo chicken wrap is hard to find, but they got it right here! The fries were really good, I opted for the loaded fries option.  Finally for dessert I had a chocolate brownie. It's really hard to find a good chocolate brownie when out, but again this was really good. Tasted like something we would make at home! Served warm with some chocolate drizzle and whipped cream.  I really look forward to going back here, and wish I had been sooner!"}
{"text":"Last Sunday's Steeler's game -- sat at the bar and had great conversation with the bartendress about the different beers they have.  Over 40 on tap and many more in bottles.  Hamburger was fine as pub good goes.  My experience is that the bar has better, more friendly service than out at the tables.  But as local pubs go, the Ale House ranks quite well.  Parking is funky as it is behind a car lot, but one visit and you know how to navigate it well.  f8 and be there."}
{"text":"Great bar food. Staff is very friendly. If you like beer this is the place for you. The selection changes frequently but they always keep the favorites."}
{"text":"BJ's nose can sniff about great beer in any conditions.  That is how he found Wexford Ale.  They have a ton of beer choices, which is great for BJ.  On a late Saturday afternoon, the place was about half full.  Good for us, we got a high top table with excellent view of the big screen TV's.  Service here was very prompt and friendly.  I got a Black and Bleu burger with bacon.  It was perfectly cooked and so delicious.  BJ got a Turkey Bacon Swiss on sour dough.  Both sandwiches were very good and the fries here are awesome.  This could easily become our new favorite hang out."}
{"text":"Stopped for lunch , had a nice draft list to pick from. Place was kinda dinghy and dirty. 2 tables felt sticky , thought it was a fluke after changing table for the first time. Buffalo chicken wrap was ok, nothing to  jump up and down over, it was really wet and runny. Bathroom was a nightmare because it was really dirty . I think there are much better places to go to."}
{"text":"Very pleasant service on a quiet weekday afternoon.   They have a decent draft selection for 2015, but the printed menu wasn't updated, and we missed some great choices that were only on the chalkboard.   I ordered a glass of the Specialty Pinot Noir (I know, don't judge me for going to an ale house and ordering wine, just keep reading), and it tasted like vinegar. I politely told the bartender this, and she did not think twice before asking me what I would like instead. No hassle. So, I went with the Sierra Nevada Summerfest. All good there. She was super nice.   We ordered the nachos with chicken, and I thought they were good for bar nachos. Don't expect gourmet cheese and free range chicken at a normal bar. Standard chicken, onions, olives, jalapeños, and a nostalgic throwback to good old-fashioned nacho cheese. We destroyed that plate after an afternoon of kayaking.   I'd like to give this place another try to get a handle on some of their main dishes, and the service will definitely get me to come back."}
