{"text":"OMG, loved this place before the fire, but now the service is haphazard, the food is for lack of words, interesting. Good news , it's clean....will try again but if worse, will tell you all why... I hope I am having very bad dream!!! Please, only 2stars!!!!"}
{"text":"Fantastic service, greeted immediately. Food was delicious. Pictures to follow. P.S. Order brown gravy with the french fries, you will love it!"}
{"text":"The service is horrible. Seems like the workers are there just to hang out with friends. We couldn't even enjoy the food due to those issues. Employees shouldn't be smoking instead of working ... That could help the poor service issues. Hopefully the owner will make some changes in employee standards."}
{"text":"This place is always an interesting time.  Always a good mix of people,  young and old. Bartenders are pretty friendly.  Karaoke every Wednesday night, and free live rock bands Friday and Saturday nights.  They also have pool tables, a dart board,  and a very nice outdoor seating and smoking area.

The food is not bad for a biker bar,  kitchen is open late, with very fair prices. Really cheap,  good breakfast 7 days a week.  Bloody Mary bar on Saturday and Sunday mornings. 

Don't be deterred by the fact this is known as a biker bar.  There's always a good time here,  especially on weekends,  whether you ride a Harley or not!"}
{"text":"Horrible food! Don't order a salad. Nothing fresh in it. Tasted like an old refrigerator. Terrible service. Save your money don't go here."}
{"text":"Best biker bar in the east valley! I love this place. Always something going on. Poker tournaments, live music, bike events. Come on out and check this place out. Staff is friendly, beer is cold, food is good."}
{"text":"Place is a scam. Service was horrible. Was there two hours and only got two drinks. Then my $25 bill came out and they bring me a ran receipt for $34. They didn't want to make it right so I will now just have my bank fight it instead I guess."}
{"text":"The food was very good but the service was very very bad. We waited over one hour for our breakfast, a party of 8. None of us will go back again, too bad but he needs to hire better professional wait staff.  The waitress spent too much time visiting and not enough time serving."}
{"text":"I love the place even though the service sucks. Great bands and great food especially the breakfast. The all you can eat breakfast with two alcohol drinks is the best buy for about ten bucks, but like I said the service sucks big time. Once the waitress goes into the kitchen you might not see her again for ten minutes I call the door to the kitchen the black hole. I go there about three or four times a week as I live very near. When I go there I just go with the mind set that I will have the shittiest service in the valley. On the Brightside the food is good, the place has plenty of room and it is very clean and the owner is friendly. Everyone gets along there fine the bikers, the rednecks, the wall streeters and the senior citizens of which I am a member of. Everyone is always great. I would have given it five stars but the service is so bad I took two stars away."}
{"text":"Gross and our waitress was not very good. Kind of a bad attitude. We actually got sick from the food. Music was the only good thing about this place. We won't be back."}
{"text":"The young lady seemed over whelmed, I found the service to be poor but my Ruben was dang tastie."}
{"text":"Jasmine was so sweet and funny and made my day. I will definitely come back to see her also the food and drinks were very good too."}
{"text":"It's not Handle Bars!! This place is more like a greasy spoon. I like the cider on tap. The waitstaff is great, often understaffed cause the snowbirds love this place even with the bikers. Give it a try if you like classic bar food."}
{"text":"Clean, but they need more waitstaff as the service was slow.  We stopped in for breakfast, and found the best deal ever.  They have an all-you-can-eat egg, meat, hash browns, and toast with 2 drinks included for $9.99.  It sounds high until you realize that drinks also include beer, mimosas, and bloody marys.  My husband and I both had a bloody mary and a cup of coffee.  They serve Coffeemate creamer - I wish they'd serve real cream or milk.  The breakfast food was perfectly prepared.  Will definitely stop by again."}
{"text":"The waitresses...very nice.  One in particulare is a little scattered though.  Asked for a drink three times and three times she came up and asked if I was doing okay.  Uh, yeah, but would love my drink???  Then she kept calling me sweetie, honey, etc.  I'm old enough to be your grandmother and you're speaking to me like I'm a 2 year old. Sweetest thing, but not professional and not appreciated!!!  

I've seen a couple of the bands and had a great time.  The place is clean and the food is okay for bar grub.  Nothing to get excited over.  Very busy on Fridays for all you can eat fish.  Honestly, order the fish basket.  It's cheaper and you may get your food sooner.  Like this place much better than the old place.  The bathrooms are clean and the atmosphere is nice.  Loved the reopening gig a couple of weeks ago.  Had a really good time."}
{"text":"Just had Sunday breakfast with my Dad there. Yummy food, very prompt service and great atmosphere! We'll be back for sure! Bloody Mary bar was AWESOME!"}
{"text":"Decent restaurant with decent food.  Today is Valentines Day so it was super busy and it took time.  But a busy restaurant generally means a good restaurant."}
{"text":"Live entertainment - sometimes it's pretty loud!  The food is ok  - not the worst - not the best!  The atmosphere is very nice - I do like the outside patio including the outside bar!  Smoking on the patio!"}
{"text":"First timer for breakfast.   Food was good, never got our toast after asking for it.  Was very uncomfortable as there were several drunks at 9:30 am and they were continued to be served.  Will not be returning."}
{"text":"This place is fine but... the owner doesn't seem to want to invest in a music system other than the jukebox. 
Look jukeboxes are awesome...but when there isn't a song requested for $1/song maybe you could play something else. 

Its offputting hearing a single song.........silence for 12-20 minutes................then another song. 

We are paying for food and drinks, can you please provide the atmosphere? I'm not uppity, I love dive bars, and I love the whole log cabin vibe wth has. 

I'm assuming The owner makes money from the jukebox, so reinvest it in a music system to pick up the slack. 

Food is ok, and there's nothing wrong with the service. Again..  decent place, just needs some atmosphere."}
{"text":"Visited here for Paint Nite and tried the Mac and Cheese with pulled pork.  The serving size was big enough for two people or one very hungry person.  Good flavor and a nice portion of pulled pork.  All in all a great comfort food dish.  

Pool tables, darts, card tables, bar and outdoor seating."}
{"text":"We tried the what the hell bar last night for dinner and loved it! The food, drinks and service were awesome. It was getting busy but our server, \"Julia\" took time to make us feel very welcome and in return we will be long time loyal customers! Can't wait to try the breakfast soon."}
{"text":"Staff is always friendly, drinks are good, and the food is normal bar food.  I don't know why other people go to bars, but I go to enjoy myself and the company of the people I'm with.  Some thing that's easy to do here :)"}
{"text":"Ok breakfast not so much my toast must have been toasted and then sat for twenty minutes while they made my breakfast the home fries are cut up French fries I ordered the skillet with peppers onions and sausage when it came out 20 plus minutes later not overly hot  no eggs I guess it doesn't come with eggs. My wife had the egg sandwich which she said was ok when it was time to pay I gave the server 20 dollar bill on a 16 dollar tab she said thank you and never came back with my change so I could decide on the tip it would have probley been 2 dollars not 4$ ....... Consistency people like I said in my last review good wings beer and salad, breakfast  jury's still out"}
{"text":"This is more a bar than a grill. Came on a week day and all the crazies came out aka overly drunks that almost fought and started to drunkenly mosh? This was a weekday at 9pm. Ordered the brisket nachos and I'm really not picky...but wow...the worst nachos I have ever seen/tasted. They threw on that plastic looking yellow sandwich cheese over a bunch of stale tortilla chips and topped it with old not-spicy-at-all jalapenos and mushy tomatoes. Yes, they used that square sandwich cheese for my $8 nachos and it wasn't even melted...And the meat and toppings were cold. For once, I couldn't finish it. Like I got so disgusted, I couldn't eat it anymore. I could have gone to Food City and made nachos way better for cheaper. In fact, I probably could have found better nachos in a garbage can after a D-backs game. It's good as a bar-and for that two stars (and the unexpected dinner show)-but there are strange, shady characters here. You might have to take some sanitizer with you."}
{"text":"What the Hell bar is my favorite place to go for bands and dancing. The wait staff is awesome. We celebrated my best friends bachelorette party there last night and it was off the hook fun! The owner came over and thanked us for choosing his bar for the party and bought us a round of shots. All of the bands I've seen here so far are absolutely awesome and the dancing is so much fun."}
{"text":"I have been going there for a couple of years now it has always been a good place to go food is ok service can be really good however it seems like they are getting more trouble makers than ever before if you go be on guard"}
{"text":"I have been here a few different times. Very cool place. Very low key. Food was decent and the service was good. I got the wings and my friend got the beef sliders. Atmosphere was the best part. If your stressed out this is the place to go. Very relaxing."}
{"text":"Feeling bored and hungry so tackled this bad boy... Beware of the hot hot hot pepper on the end!!! Have the chef pop that skewer on the grill for extra delishishness!!! Always fun at WTH!!"}
{"text":"This is one of the worst experiences for a restaurant! Our server brought us our drinks, coffee for the wife and coke for me. After only a sip of the coke, it tasted like it didn't have enough syrup and was way over carbonated. Our server then made four rounds refilling coffee and not taking our food order. A group of six who came in five or six minutes after us were in the middle of placing their order with a server when we proceeded to leave and drive down the road to Burger King! Thank you, What the Hell bar and grill! I now know where not to go for breakfast or any other time of the day or night!"}
{"text":"Awesome breakfast, love the drinks and great price!! Friendly staff, good service and location. They always have events going on, loved the car show!"}
{"text":"This is only based on the food and drink service:

Attended the customer appreciation day yesterday. There were 5 servers on the floor. My party of 4 sat inside and to make a long story short, we had 3 different servers only due to the fact we had to flag people down each time. The medium hamburger was cooked medium well and the Reuben was bland. I will continue to patronize WTH due to the atmosphere. The food and wait staff both need help."}
{"text":"My first time visit was last weekend where we met a group of friends.   I found the atmosphere to be very accommodating and friendly.  I didn't order food, but the people at my table seemed to enjoy their meals.  Our server was calm and sweet even as the night grew busier.   He was prompt and displayed a great attitude when dealing with the varying personalities of the customers.  The band was rockin and the crowd was having a blast!! I'll be back again for more fun at this cool neighborhood bar!"}
{"text":"Breakfast - 
*Get the Country Fried Steak & Eggs with a choice of two sides.  That fried steak is on point!  I've been craving it regularly since it first crossed my lips, with a side of sausage.  I'll choose something other than the plain Home Fries next time though.  

Side Notes - 
*I didn't expect the AYCE breakfast option, with two beverages.  Such a great deal for the price, I'll have to prepare myself for it next time.  There will be a next time. 
*I also missed out on the super Bloody Mary!  The one I had was perfectly fine but I hear on Saturday and Sundays they have a salad garnish (bacon, celery, green onion, beef stick, green olives, lime, lemon, chicken wing, bell pepper, mushroom, tomato, jalapeno, black olive, sausage, peppercini, meatball, pepperoni...did I miss anything?)
* They have live music in the evenings!!!"}
{"text":"Been there 2 times and the new location is very nice. They have bands on the weekends with no cover which is cool.

You have to inquire about what specials or happy hour deals are in play in order not to overpay.
I paid 3.75 for a coors 12 oz bottle and 4.25 for fries on sunday when i could have 
Had the special 6 wings and a draft for 5.95
3.75 for a beer???? Really??

But you can buy five 7oz mini bottles for 5 bucks????
12 oz beer  = 3.75
35 oz of beer = 5.00
See what i mean......know your prices and specials or you'll be paying large !
Nice place, 6- 8 tvs for Sunday football, biker and motorcycle friendly, spacious."}
{"text":"The meetup group I go to meets here every week. The service and attitudes by the women here are so bad, I've decided to stop coming here completely."}
{"text":"The food is great and the whole place is so clean! This is the second time I've been to What the Hell & I intend to go back.  I've had the Portobello mushrooms & the steak quesadilla & was amazed by the chef's expertise not expected in a Bar and Grill. But a word of warning - the pudding shots will knock you for a loop."}
{"text":"Your average neighborhood bar. Food and service r ok
Lot of old guys sitting outside smoking and forcing the weight staff to look at pictures and make small talk."}
{"text":"We love this place for the music, food, and events....not to mention the football Sundays. Wear your colors."}
{"text":"Mediocre food. I had the buffalo chicken salad, which the menu said was served with grilled chicken but it came out with breaded, which I wasn't too happy about. Another member of our party ordered his son a grilled cheese sandwich which the cook burned. The kitchen messed up another of our orders by bringing out fries instead of coleslaw as ordered. The service wasn't that great either. Drinks went unrefilled for way too long. Waitress took forever bringing out a box as well. I've been to bar & grill restaurants with much better food and service."}
{"text":"With a \"make your own\" Bloody Mary bar how can this go wrong? They have a ton of different specials. We happened to be here on Mother's Day and there was a breakfast buffet. Great food and great service. Wish this was closer to home we would visit frequently"}
{"text":"The bloody mary was delicious, the eggs benedict was cooked perfect and the bartender was great.  Will definitely be back"}
{"text":"Below average food even for bar food. Staff looks and acts like this is the last place they want to be. Not bad to take a bike ride to and have a beer but otherwise I'd avoid this place."}
{"text":"TVs are NOT HD?? They don't get a high definition feed?!? CRAZY. 

21 beers on tap including some good ones.

Big menu but pricier than expected.

Big outdoor patio and bar. But no TVs, misters and just partly shaded.

Friendly service."}
{"text":"Not so much on the menu, more of a biker bar & grill.  The most plain quesadilla I have ever had. The waitress hides alot hard to locate.  No avocados? WTH??? No salsa? WTH"}
{"text":"This is a no joke biker bar, Bubba is in the back cooking, not Bobby Flay. With that said Stick with all you can eat breakfast, tacos, or the Burgers and you'll be fine.
  This is my default watering hole since it's stumbling distance from home and it's perfect. They seem to get great live bands, waitstaff is cool, and it's a 2% biker bar so they keep it drama free. Overall it's a great place to get fucked up."}
{"text":"We always have a great time here! There's something fun happening almost every night and we love enjoying their breakfast specials and Bloody Mary bar in the A.M.!"}
{"text":"This week, on the 18th to be exact, a friend of mine with Parkinson disease took his car to Pep Boys for repair, Since there was going to be a long wait, he walked maybe a half mile to this establishment for some lunch and a drink. Mind you, he walks with a cane, and yes, has alot of movement that may be uncomfortable to some. He was asked to leave and was told to take his funny moves out of the bar. I cannot believe this. This is discrimination. If I came in there in a wheelchair, would you turn me away? Have some class and respect with people who have disabilities. Shame on you all."}
{"text":"Updated 12/15/17-great food but Jasmine is the WORST waitress we've ever had. For the first time in my life I did not leave a tip. I don't even have high expectations of a dive bar.

Great breakfast and good atmosphere but the people who work there are less than stellar. The bartender, Julie, yesterday was just flat out rude. She acted like anyone placing an order was really putting her out. Isn't that her job? Take orders and make drinks. I'm not even asking you to act overjoyed about it but being somewhat pleasant isn't too much to ask. We will go back because options are limited out here and the breakfast tacos are delicious but it would be nice if the customer service improved enough to make us want to return for more than just breakfast."}
{"text":"Love this place, even though its like 46+ miles from my house. Henry runs a great place., great food and a real live full sized craps table which see some action at least once week for tournament play."}
{"text":"Great food, very friendly staff. They have music and breakfast which my husband loves."}
{"text":"Tried breakfast again, once again disappointed! Frozen no flavor cubed potatoes. Order bloody Mary as part of special... Terrible didn't drink but a forth of it. Tomato juice and vodka... Yuk. No spice no pepper absolutely nothing. Waiting for drink .. Came just before breakfast. I would say 10 minutes to get it...you would think bar tender would help. But turned out fine. Not going back!  nothing worth going back for at all"}
{"text":"My husband took me here for lunch on my birthday because we had heard they had a really great breakfast deal. I was impressed with their extensive menu and we both got hamburgers that where so big I didn't think I was going to be able to fit it in my mouth! Want to go back and try the breakfast!"}
{"text":"I usually give bars a standard of 3 stars just for having beer but this place only gets 2...My life is probably at stake over this review because rumor is Hells Angels own this Cantina!!! So I went here to hang with a couple buddies, 1 was playing poker, the other was drinking and as I walked it a smell overcame me.. It was kinda like Ball Sweat and tarter sauce. I went to the bar and watched the bartender who was acting like she was hopped up on something chit chat it up with a few guys at the bar without even noticing I was standing there. Keep in mind there was only like 15 people in the whole bar and 3 of them were sitting at the bar, on top of it I look like donkey kong so im pretty hard to miss. After about 5 minutes I started saying loudly \"excuse me\" and finally got her attention. I ordered a beer and a couple shots my buddy. I told him I wanted to go to a different bar but our other stubborn friend was winning money at the poker tournament and he didn't want to leave. So we stuck it out... We drank beer and hung outside in their patio. The bar itself is really nice aside from the smell, the crowd is more rough bikers, and again they already have the reputation to be a Hells Angels bar... We hung out and almost closed down the bar and most of the night I was on guard even watching my back in the bathroom so I don't get shanked by a sharpened toothbrush. HAHA! All this place is missing is a creepy guy in the corner table using a pen ink and paperclip trading his tattoos for top ramen and cigarettes. Id go elsewhere."}
