{"text":"I really like this place. Great food and coffee. Cute location. $$$ pricey tho . I would like to go more often but to much for my budget."}
{"text":"Seems weird to me that Yelp doesn't make this place more visible in searches! In any case, just went here for the first time today and it was very tasty. I didn't try the coffee but the wrap I had was delicious. Will definitely be back to try other wraps and soups! I was hoping for a little more food for the price, but overall reasonable and would recommend trying."}
{"text":"Food was delicious. I had the BBQ club. It had flavor and was presented nicely on the plate. I also had a hazelnut latte. Yum! The espresso was poured well. This is probably my favorite place to get coffee in the area!"}
{"text":"Breakfast pizza, turkey club and espresso drinks at the right temperature."}
{"text":"I stopped by one day for a warm beverage (this has been the weirdest summer), not realizing that they close at 3pm during the week. I had half an hour so I knew I'd be fine, but you know how sometimes the staff is obviously peeved when people come in close to closing time? **  Well, that did not happen. The lady at the counter was very cheerful and welcoming, and while I was ordering (they are three or four menu boards on the wall, I wanted to take a second and get the right thing) she was completely patient with me.   I got a caramel steamer with soy and it was tasty as anything. I got a nice big mug that I drank fast. The two women working there were cleaning up, and one ran the vacuum briefly, but they didn't do any of it near me (and I wouldn't have minded if they had, since I'm sure they were almost done for the day).   There are lots of little tchotchkes for sale; it's all very comfy. There are lots of tables inside and a couple of small tables outside for catching some rays while enjoying your java. Oh, there's a drive-through, too! Nice touch, I love having the option some days.     ** I worked at a Pizza Hut in my youth and sent many an evil eye at people walking in five minutes before close, wanting to order food and eat it there."}
{"text":"I loved this place and highly recommend it to everyone. I had a chicken wrap with wanuts roasted red peppers and feta cheese. Mmmm good.  Husband had southwest chicken wrap he was pleased as well.  I also had a side of  sliced apples with carmel dipping sauce and he had chips and salsa"}
{"text":"Sometimes I am forced to grab breakfast quickly in the morning, but feel really yucky going to fast food chains with their processed, bulk ordered muffins and processed cheeses. I've even witnessed the preparation of a Starbucks sandwich, merely involving unwrapping a premade sandwich from corporate headquarters and plopping it into the microwave. Yuck. What's Brewin' changes all of that. They take your custom order at the window and fry you up your sandwich to order. Yes, they do use premade egg patties for their breakfast sandwich, but the freshness and quality of the other ingredients is apparent from the first bite. They even offer a veggie sausage option, which I gladly added to my order. Yes, it took a moment or so for my sandwich to be made, but it was worth it. It gave my dogs a chance to nosh on their complimentary dog treats in the back seat.  Overall, I will keep supporting this local non-chain breakfast place because of the convenience of their drive through and superiority in freshness and flavor compared to any of the other Mc-food places available in Sun Prairie. I also failed to mention the friendly service I got throughout. To me, that is Mc-priceless."}
{"text":"A little off the beaten path What's Brew'n was a fun find for me and my husband the other day in our new neighborhood. We ordered our signature try-a-new-coffee-shop drinks...me a carmel vanilla latte and Chad a black and white. Both were good. I am always looking for a latte that is smooth and not too sweet. Chad is looking to taste the roast through the additions. We were both pleased. We also split a blueberry scone, it was muffin-y in texture.   Although...on a return visit Chad was not as happy with his latte. Too sweet.   The decor is comfortable. Plenty of seating. There is a cozy nook with a child's area inside as well. There are a few outdoor seating options as well. I would feel comfortable meeting a friend here for lunch with the kids. By the way, there are plenty of food options, I have not tried any yet, but my daughter can vouch for the ice cream.   There are a lot of items for sale as well - jewelry, decor, etc... A tad over priced..."}
{"text":"I can't seem to figure this place out.  It just seems out of sorts for me.  Too much going on.  Both times I was there, it felt like my drinks took longer than expected.  Also, they don't take American Express."}
{"text":"Located in a little business strip behind Gus's Diner just off of Hwy 19, these folks rock!  Lots of options, lots of specials including kids eat free on certain days etc.  Definitely kid friendly, but not crazed like say Chuck E. Cheese.  The inside is comfortable, and I don't get that uppity \"I'm trying wayyyy too hard to be cool,\" vibe from the clientele.  They also have a drive thru if you are feeling super lazy.  If you like coffee, teas, and other coffee shop type stuff without being pretentious, don't miss this place!"}
{"text":"Super yummy coffee and non-coffee drinks and pastries!!! Stopped in for some road snacks on our way home to Chicago. Cute little gifts and pictures sold inside too for last minute unique gifts."}
{"text":"Comfortable, warm, cozy. I have been there two times, as it is close to work for me.  The cordon bleu panini was good, but drippy sauce -- not necessarily a bad thing but watch your clothes.  Last time I had a sesame ginger chicken wrap -- very crunchy with veggies and tasty.   I do really like the water setup -- you get your own from a large carafe.  Very eco-conscious. Both times I've been there, though, I had to weigh carefully to eat in or go -- because of the running around, screeching KIDS!!   Just be forewarned."}
{"text":"Always very friendly and one of my go to drive thru coffee stops on the way to sun prairie. Good Latte's."}
{"text":"Love this place! Their monthly drink specials are awesome and the staff is super friendly! The drive thru is convenient and the store environment is cozy. The menu for food is really delish too!  One of my fav coffee shops!"}
{"text":"Very nice coffee place where you can actually drink the coffee and enjoy the taste. No watered down coffee here. Scones are fresh and tasty and don't double as doorstops. Cozy atmosphere, kid friendly (but kids can be tucked in the back, ba ha ha!). Nice job overall.   http://www.whatisbrewing.com/"}
{"text":"THANK GOODNESS I FOUND WHAT'S BREW'N!  i have always loved spending time in locally owned coffee shops and always prefer giving them my business over other larger chains (although I enjoy them from time to time as wall). I've only ordered food there once, a HUGE, fresh salad that completely exceeded my expectations. The coffee drinks are always good and they have free wi-fi!  My only complaint is their hours - they're only open until the early afternoon. If they were open later, I could see spending lovely evenings enjoying their atmosphere with a coffee!"}
