{"text":"Finally got a chance to stop by the newest pizza place in the neighborhood. Top notch pizza, toppings were delicious and the crust is divine.  Owners are great. Definitely recommend!!"}
{"text":"Love the pizza, so nice to have a place we can walk to and eat some of the best pizza I've had. Wheat will be the only place I order pizza from in Calgary. Keep it local and support this family run business, they do great work!"}
{"text":"My new favorite pizza place in Calgary! Just tucked away in a strip mall off of 20th Avenue NW. I love their traditional pies. Awesome crust!"}
{"text":"Fantastic pizza shop. Both crusts are delicious, perfectly cooked and the correct ratio of crispy to soft. The crust is flavourful, and the toppings are fresh. Definitely recommend, especially since their Thursday pizza deal is ridiculous. The owners are friendly and always offering tasty samples. Best pizza option in the Banff trail neighbourhood by far. I even prefer their pizza to Una or Double Zero!"}
{"text":"This is amazing pizza. Just moved to the neighbourhood and needed some 'za. This is some of the best pizza I've ever had. Great thin crust. Thank you Jay!"}
{"text":"Love this pizza. Support local and support jay. Traditional delicious pizza made just the way you like. Nice crispy crust, delicious pizza sauce and perfectly melted cheese.  Jay puts love into these pizzas and it shows."}
{"text":"I've had 5 different pies from here and they were all fantastic!! They're not cheap but definitely worth the money. Highly recommend!"}
{"text":"This place is so awesome! Unique pizzas and great service. The Truffle is a good thin crust pizza and the Pork N Slaw is to die for :)"}
{"text":"Horrible customer service! Called for delivery to crescent heights...  it clearly states on their menu they deliver to this area. Was told my address was pushing the limits and not even given an option to pay more for a delivery fee (which I happily would've done if I had been treated nicer !).
I Google mapped it after the phone call and it was 3.1 km and a 7 min drive! Guess the 0.1 over their limit is too much for them  !! 
 Obviously this place does not care to bring more revenue to their business. Doesnt matter how good your pizza is supposed to be If u continue to treat customers like this !"}
{"text":"We tried both the thin crust (the Fun Guy) and the regular crust (sausage and pepperoni) and both were delicious, but the thin crust was really special. Never quite had a crust like that before. Also had a really fresh and generously sized salad. We went not realizing they don't have seating but fortunately it was a beautiful day and there was a picnic table in the park across the street. Carol at the register was so helpful. Highly recommended!"}
{"text":"Family owned, prompt service and oh so good! 

The crust is crispy wheat, and carries more flavor than the regular enriched white crust.  I'd like to think it carries more nutrition too.  Fresh ingredients , sweet/tangy sauce and served piping hot--the way pizza should be.

I opted for pizza delivery instead of room service whilst on my work trip. Best decision I've made all week. :)"}
