{"text":"A small romantic pub. Those are the words I'd use to describe Whelan's Gate. Conveniently located a short walk from Keele subway Whelan's is a great first date option.  Its two floors but there are only a few choice spots downstairs. I prefer to go upstairs where there is more seating. The whole pub has low, soft lighting and low indie music in the background. Its a great place for intimate conversation.  The food is stellar. I highly recommend the Hunter's Whole Wings which come smothered in a delectable sauce of Herbed Barbecue Sauce / Spicy Ranch / Parmesan. I also recommend the Nacho Fries smothered in Tomatoes / Pickled Jalapeños / Cumin Beans / Cilantro / Guacamole / White Cheddar Sauce. They also have daily specials. $1 Oysters on Wednesdays. YUM!  Also a great place if you are just sitting down for drinks.   The staff has also always been stellar.   Haven't been yet for brunch but that is next on my To-Do List!  Overall a great first date place or great chill/romantic/inexpensive date place!"}
{"text":"Awesome experience!!! Best tasting and most creative pub food I've ever had. Ambiance was very cozy and the staff very friendly. Not pretentious at all, they make you feel right at home. Definitely one of my fav spots."}
{"text":"Delicious beers on tap, delicious food (with their own take on classic pub food along with some really unique lovely dishes), killer patio, great staff, cozy upstairs space with a foosball table - I'm a big fan. My choice location to unwind."}
{"text":"This was much better prior to the take-over in January. We can here pretty regularly and were served by great wait and kitchen.  Now, I have to say (I'm vegetarian) I will not return. The new menu snubs the veggie burger (which they say was frozen anyway, but previously garnished and sided  so well I didn't notice) and offers 1/4 cup hummus and a highly acidic Greek salad for $10 (no side pita) Failing that,  you can have a chili with a poached egg (which I don't eat). Come out with a veg burger : homemade :sure, great! Right now you're a gastro-snub which is hopefully reliant on clientele loyal to all the past staff who are no longer here. Should have kept some hard workers. Guess I'll eat at mugshot instead or make at home . Feel free to comment whelan's! I am not happy with your product . Also I mentioned this to (owner?) he decided the veg hummus was designed as an app and he had no intention if changing not bringing a side pita nor veg burger to the mix. Ok, I guess I'm not your target. Veggies head somewhere else !!!!"}
{"text":"Great selection of beers and very high quality \"pub\" food ... had the sausage plate and it was something to write home about, if you are inclined to write home about sausages and such .. the decor is in need of some sprucing up but, really, it's the beer and food that draws you in."}
{"text":"Fried chicken with mac n'cheese was delicious. Waiter/bar tender was very friendly and quick.  First floor of pub is small and intimate, great for a date."}
{"text":"We serendipitously found this gem on a very cold night this past weekend and loved it! The upstairs was closed for a party and the downstairs had no tables for our group but the lovely people sitting at the bar moved over to one side so we could all sit there together. The owner and waitress were very welcoming and hilarious. They let us try the beers before ordering a full pint. The wings were half off because the leafs were playing and we all ordered about 2 pounds each. They were delicious!!! Between us we tried almost all the flavours. We especially loved the Cajun and the Maple flavoured ones. On top of the wings we ordered the loaded fries that had a ton of meat and toppings but couldn't finish them after the wings. We'll definitely be back :)"}
{"text":"We decided to check out our local pubs and we stumbled across this one. What a gem! It is cozy, great service, good beer selection and small but well rounded menu. The buffalo wings with home made potato chips had a nice kick and the herb mayo was delicious. The nacho fries... ohhhh.. so good."}
{"text":"The steak frites were prepared just as I requested, and the fries were nicely seasoned. Decent selection of beers on tap. Only complaint is the music was too loud to comfortably talk."}
{"text":"I had no idea how good this place was. Lived by it for years without going in. The menu is solid but the drink options seem pretty narrow.   The staff are fantastic, and more importantly, Wheelan's has maybe the best patio available between Keele and Dundas West stations."}
{"text":"What a difference new management and a new chef makes. Awesome food, great staff, relaxed cozy atmosphere."}
{"text":"Came here to grab a quick bite a little later and it was super chill (and at the same incredibly warm because of lack of AC).   The bartender/server was very friendly (even though he was very rushed and incredibly run off his feet). When we got there, he told us that the kitchen was closing, but he'd let them know that there was one more order coming through so we could eat. He recommended the house cheesecurger, which was pretty good as it taste like real meat! the fries with it were also hot and delicious!   The bartender also took the time to let me sample a couple beers (because I am a novice beer drinker), which helped me find one I liked!   The coolest part was that there was a live jam session with several older folks on instruments (guitars mostly) jamming out for everyone to enjoy.  Tuesdays are definitely the day to come!!!"}
{"text":"The atmosphere here is great, especially for couples. Very romantic. Had the hunters whole wings and it was ok. Nothing special or outstanding and the sauce was like marinara sauce. The server did offer a green looking sauce that have it an extra kick. Was a lot better. Service excellent and location. Def be back."}
{"text":"This was a very small pub on Bloor Street West. The place was virtually empty when we were there. The service was good but despite the fact they were open the kitchen wasn't ready for customers.   The food was solid however. The fried chicken sandwich was delicious. Small serving but good. House made fries were good but not done to my taste. My dinner mate had the steak & he said it  as really good. Decent supply of draft beer as well. I won't go again but if your in the area & want a fried chicken sammy...this was very good."}
{"text":"Went there for a casual dinner with out of town family visitors. It's in a location (High Park) without alot of other choices which is why we went there.  Our group had a variety of tastes (two growing boys, ladies with light appetites and others with designs on big meaty dinners). Reviews were mixed -- kids were just OK (but they probably wouldn't appreciate the diff between fresh and frozen), other dishes were hit and miss. Steak/frites looked pretty good, burger was excellent (definitely NOT a frozen patty), ribs looked good, but nacho fries seemed small and all plates came with just a small side of shoestring fries (looked like they were pre-cut/frozen to me) and nothing else. Ketchup was not Heinz which bugs me more than it should but it does since all other ketchups taste weird to me.   The menu was OK, but not extensive. Not impressed with the veggie/salad selections -- come on, would it kill you to just throw a Caesar or a garden salad on there? It was Wed night, and they had a \"buck-a-shuck\" special on oysters but nobody in our group were big oyster eaters, so no one tried. Seemed like a decent selections of beers but I only tried one.  The food was probably a bit pricey for a pub, but not out of line for a \"gastro-pub\" if indeed all ingredients were freshly made on the premises (meat for burgers apparently ground in-house for example).  Service was good. We were upstairs and only one other table was eating so it would have been hard to NOT provide good service. Still the waitress went out of her way, including trying to split the bill into three groups even though we didn't ask (and she almost got it right, so she gets an A just for the effort).  Ambience was OK -- dimly lit (I had to literally walk over to the window with my menu to read it), background music, wooden chairs and tables, typical of your neighbourhood pub. But it felt like the chef was aspiring to be so much more, yet the surroundings were holding him/her back? It was a strange mix of a menu trying too hard, paired with a pub that wasn't trying at all. They're probably having a hard time pleasing anyone with that combo.  Music was on upstairs, loud enough to enjoy (if you're into 90s retro new wave) but they only have about 40 to 50 minutes of music (10 songs?) on a repeating loop! When \"Rio\" comes on for the second time in the evening, it's your choice -- either time to get up and dance or time to pay the bill and head out...\"just like that river running through a dusty land\"..."}
{"text":"I've recently decided that this is my favourite pub in Toronto. It's super cozy - especially upstairs - and the staff are all super friendly. Most importantly, the food is fantastic. Small-ish portions (for a pub) but everything is delicious and reasonably priced. They also have a great upstairs back patio where the trees are growing through the deck. Couldn't recommend it more."}
{"text":"Great wee food, cold wee drinks and nice wee staff lol This place provides a very cozy atmosphere and respectable dining environment. Had some pints of the black stuff (Guinness) followed up by some burgers and fries, got to meet the chef here to and he was nice.   Notes: -Great place to drink and have a few laughs with some friends -A little noisy but makes for good times if your up for it, just get ready to yell every conversation.  -I went on a busy night and it was packed, make sure you go a little early for good seats -Bathroom was dirty but like I said it was busy and I'm sure it's not always like that -Food was good, Burger tasted like a burger with the works on top and fries were cook to perfection.  -My glass was never empty and my nor was my fun meter. -Very close to the Keel subway station  Cheers Whelans gate!"}
{"text":"I once ordered take-out here, and decided to try the cheeseburger. I have to say it was the most mouthwatering heavenly burger I've ever tasted. I didn't get two blocks from the entrance and I finished the whole thing. I may have felt a little unwell afterwards but that is most definitely due to the fact that I inhaled an entire burger in 4 or 5 bites. I would give this 5 stars but it hasn't been consistently as mind blowing, but it's still hands down my favourite burger in the city. Nothing fancy, just absolutely tastey  UPDATE I'm currently eating this burger and I cannot NOT give you 5 stars. Best burger in the city hands down, priest, chuck, Harry's, and rudys take notes"}
{"text":"Whelan's Gate has reopened under new ownership...and those owners are friendly, welcoming and seem really driven to try and breathe new life into this local pub.  For folks in the area, this is a good place to stop in and unwind after a long day.  I've stopped in 3 times since they reopened and each time I have tried a different dish. So far each dish I've tried has been very good, prepared well and with good flavours.They do a very good burger (one of the tastiest I've had in recent memory), have a nice chicken pie, and a \"bangers  and colcannon\" that was excellent.  They only reopened a little while ago (I believe early Janurary) and are still finding their legs a bit with regards to potential entertainment options. Currently they offer a nice flow of music...loud enough to be enjoyed but quiet enough that you can carry on a conversation without straining to hear the other person.  They have mentioned that they are looking at doing one or two things on the entertainment front in the very near future that seem really promising. Keep your eyes open for something coming up on a trial basis on Tuesday Feb. 3rd...if it comes together as I have heard it might, it could be a fun way to spend your Tuesday evenings.  I never had the chance to visit this place under its old management but the new folks seem like they will breathe new life into it.  Best wishes to them for a bright future may it be a long one."}
