{"text":"Beautiful, quiet and fun. Love being able to check out movies for free, good selection. Just needs more books to fill the shelves and more  popular books available to check out instead of having to go on a wait list. Other than that is is wonderful. I love going there to study, read, and relax. Beautiful area."}
{"text":"My kids and I love it here! The architecture of the library is very modern and still fits in well or compliments the desert landscape surrounding it. When you step into the library there are artistic elements throughout either on the floors or the walls and the lighting on your way to the restroom is very cool. Very clean library and very relaxing to study in. On the weekend sometimes, artists showcase their beautiful work (paintings, sculptures, photography, jewelry, etc) and anyone can purchase the artwork. There is a small nature center inside as well where you can see things like live desert snakes and Gila monsters. There is story time for toddlers so if you have kids this is great. Vending machines are available if you want to have a snack or a drink. A nice seating area with chairs and tables both indoors and outdoors if you want to eat your snack or lunch. Very relaxing beautiful setting. By far the best library I have visited.  The staff there is also very helpful and knowledgeable."}
{"text":"Awesome library...what a gorgeous view! Totally worth the drive."}
{"text":"This is my library of choice in the Maricopa County system! It's beautiful and quiet and I always find the staff helpful. If I need a book at another library I go online and request it to be sent to the White Tanks location and they send me an email letting me know when it arrives. I am sorry for the reviewer that found the male librarian rude to parents of \"loud children/babies\"; however, I am grateful that he does this because my number #1 requirement for any library is peace and quiet."}
{"text":"We come here mainly to take my daughter to the weekly playgroup that Phoenix Children's Hospital (I believe) sponsors.  She loves it!!  There's a really good selection of kids books.  I'm not much of a reader (gasp!) so I can't say much about the adult selection but hubby (who is a reader) seems to like it.  I think they have a thing online where you can request a book to be available at a specific library so you can always go that route.  The best thing about this library is its location.  Granted, out of the way and nothing near by but homes and a BEAUTIFUL view of the White Tanks.  If I didn't have a kid, I would just sit in there all afternoon with a book or magazine and check out the gorgeous landscape.  The architecture is also very nice.  Simple, crisp and blends well with the landscape.  The library is connected to the park so before or after your time at the library, you can always do a hike!  If  you are in the area, definitely check it out!"}
{"text":"This Library is better than the one I have in Orange County California by far. It is bigger and has a nature center with reptiles and a gift shop. It is also at the entrance of White Tank Mountain Regional Park. One of my favorite spots to hike, see critters and mountain bike. This Library has more classes for a wide range of people of various ages. Tuesday and Fridays has a Tai Chi class and after the Friday class many folks stayed for Yoga class. Today there was a henna workshop, snake feeding and a critter show later that afternoon. The Libraryhas magnificent architecture and views of the local mountains. Best Library I have ever visited PERIOD!"}
{"text":"Great library for adults and kids. You can rent movies, books, and audio here."}
{"text":"Even though the library is relatively small it's an amazing library! Great selections & very friendly staff! The views were also spectacular!"}
{"text":"Well, It was fathers day weekend, mother decided to visit from Cali. It was about 110 degrees outside, and most likely getting out of town would have been a hassle. So we took the kids to the library at White Tanks. I have always wanted to stop by to check this place out. This is definitely a hidden gem. Kids had a ball, there was plenty of things there to keep them busy. Games, coloring, reading, watching movies, and all kinds of activities. They also have about six different kinds of rattlesnakes, three king snakes, and a gila monster on display. There was an actual feeding at 1:00 that day. There is also coffee and snacks for the adults. You can enjoy the view and drink your cup of joe. It's a must see place, especially if you want to get out of the heat. Kids and adults will love this place."}
{"text":"Not much to do when you get into the Mountains other than hike some trails.  The Library was beautiful and they fed the snakes on the Friday that we were there and out 5 kids loved it.  This was FREE, so you can't beat that."}
{"text":"Amazing library with killer views. If you have kids and a couple of hours, you need to stop by this place. They offer books (yep, shocking), tons of movies, lots of computers, a bookstore, snake exhibit, and hiking trails galore located right outside the doors. My family absolutely loves this place and every time we go we always question why we do not go more often. A must visit."}
{"text":"What a beautiful place. There is a ton to offer at this library. Today they had booths on conservation, a dog adoption mobile and some awesome information booths and speeches about our beautiful Arizona desert."}
{"text":"This library is unlike any other.  It is seated up against white tanks mountain and they have brought the wildlife feel into the library. There are a few live snakes you can view in the wildlife room.  This is a very large and spacious place. There is an extremely large amount of computers to use, huge selection of dvds you can rent as well as of course...books!   I noticed a few private rooms with doors and glass windows that can be used for studying privacy.  I found this to be a neat idea and some people were using them.  I was happy to find my favorite book here, Pride and Prejudice. I was also able to find the classic Little Women for my daughter. The book selection here is great! Classics as well as new releases.   They have a large section for kids to stay busy. This library also holds some fun events such as late night star gazing with telescopes, kids activities, yoga, Pinterest art and wine night, etc.  I did also see a sign for horse back riding!   We like to hike white tanks mountain and stop into this library. I suggest giving it a try for a fun Saturday morning! If you like nature and books.. you will be in love."}
{"text":"Its a fantastic library. the views are beautiful and the library is clean. The only issue is the male librarian. I have seen him on more than one occasion tell a family they had to leave because the children in the children's area where too loud. He told a woman with her baby to settle down or leave after one of the infant classes. Usually not a big deal but he is rude and stands there very confrontational when addressing a parent. He often speaks disrespectfully to the children. If it wasn't for him i would have given 5 stars."}
{"text":"Amazing library! Beautiful views! Great classes ad outstanding children's area. Great place to purchase or check out books. I work with families and always encourage a visit to this library."}
{"text":"Gorgeous!!!  Maricopa County has opened up a new library branch in the west valley and it really puts the other branches to shame. Literally right outside of the park gates for the White Tanks Mountain Preserve this modern building stands out and fits right into the desert surroundings. When you enter the actual library your eyes are immediately drawn to the floor to ceiling windows that line the west wall. you feel like you are in the middle of the desert surrounded by wildflowers and cacti. The facility itself is well laid out with plenty of computers, seating, and study rooms. The major bonus is that since it is a new branch- all the books are new! You still get to hear the binding crack open for the first time and the whole place has a new book smell about it. Special care has been taken to compliment the natural beauty surrounding it and is partially powered by solar panels. It may be a further drive for us (I could walk to the Northwest Branch) but honestly it is worth it."}
{"text":"We love this library! My girls love coming here. It's always clean and so far everyone we've encountered has been nothing but nice."}
{"text":"This is great library to come to if you crave some peace and quiet.  It's located in Waddell and nestled at the base of the White Tank Mountain.  It's a bit of a drive from Surpise (about 28 minutes) but in my opinion, it's worth it.  It's peaceful and serene here.  Sometimes I don't even feel like going into the library.  When I exit my car, I just want to drink in the panoramic view of the West Valley and as I said, it's so quiet...there's no traffic, no cars...just quiet! The library itself is spacious and well lit.  If you want a more spectacular view while you're studying or reading, as you enter head to the back of the library where the large windows are and there you can see more of the White Tank Mountains. The library staff are friendly and helpful when needed.  I find the selections small or limited. I don't use the computer and I'm not sure if they offer free internet for patrons but the library does have free wifi so that's helpful if you bring your tablet or laptop. The library is usually quiet except for the occasional noisy kid."}
{"text":"My family always enjoys visiting this library. It is such a wonderful place and is located perfectly with panoramic views of the White Tank Mountains. They have a gift shop, reptile exhibit and cafe sitting area with vending machines. There are comfy chairs that allow you to sit, read and enjoy the breathtaking views. Volunteers run a resale bookshop with great prices:) also a easy accessible outing if you have friends and family from out of town that want to experience the beautiful saguaros and desert scenery. Great place to take pictures ."}
{"text":"The White Tank Library has a view unlike any other, and exceptional AC during a hot summers day. It's a spectacular view, really, very wonderful. When I go there it is to take a break from my very stressful job. I don't know, its something about this place that really brings out the creativity in me, it is quite comfortable, and it is as like in awesomeness, the great libraries of my school years. My latest visit, started normal, but as for my experience I will be glad to write.   Just like any other day I stopped briefly in the museum (its at the base of a regional park) and get some water, before using my laptop to do some computer work. To my \"surprise\" it was VERY quiet as no children making noise, no people were having conversations, and all were being respectful library patrons. That was, until I noticed that the employee chatter didn't stop when a library patrons question was answered. I mean, it went on and on!   Here I saw the nice hard working librarians putting books away.  I'm sure they didn't want to be there as much as these two librarians who seem not too troubled by their duties that need carried out. The lady on the left talked loudly for ever, and at one point even got the security guard up her conversation. Let me rehash: CONVERSATION in the LIBRARY, and they WORK there.   Where I'm from we don't talk in the library because it breaks other people's concentration. Usually this place is peaceful and quiet. Usually no one is talking. Shoot, even in my middle school, if a fart would make everyone laugh, still NO ONE talked. It's called RESPECT. I uploaded a picture. They talked for the whole 30+ minutes that I was present. I could say more but I won't.  Yeah. Don't. Okay. Aff. These are PAID employees TALKING in a LIBRARY.   I won't go back for awhile. It's not a happy place anymore to me."}
{"text":"Best library!  Kid area is great with toys and great book selection. View of the white tank mountains is unreal such a beautiful place. Nature center is also really cool. Always have some kind of activity going on. Best library I've ever been to for kids"}
