{"text":"Oh my goodness. Why are there so few reviews for this place? Why isn't this place known more? (I'm not going to do a name drop pun, Don't look at me like that!)  I freely admit in my recent travels I've been craving Italian food and had been struggling to find one in Calgary. Good thing I tried this place.  Came in on an evening. Now. Normally I wouldn't associate fish dishes with Italian. But this place just blows it out of the water (Again with the puns!). The Shrimp and Alfredo Pasta was.. lovely, it's been such a long time since I've tasted proper alfredo! Garlicky and a lil greasy but in a good way! It actually hit the spot nicely.   For the main course I had the Parmesan Chicken. It was very well prepared I must admit, it was very succulent and tender, It did not last long on the plate.   Actually, nothing lasted long on the plate, I guess I was very hungry that night!   Overall, Fantastic place, very good ambiance and quiet. Brilliant Service as well. And no. Not going to end on a name drop pun either. I think I've fulfilled my pun quota on this review (As well as the reviews for the rest of the year!)"}
{"text":"Great place, cozy and romantic, and the food is delicious.  Had an a great night.  The service was lovely.  Very happy"}
{"text":"Reading all these bad reviews,I don't know HOW. I have gone multiple times never once have I had bad food & the service is always amazing. I've had better food here than some of the best restaurants in Calgary."}
{"text":"The food is nice home cooking Italian.  I would say it is above average but I would probably not drive a long distance to come here but I have been here several times b/c I live close by.  We had bruschetta and cesear salad to start, and chicken and shrimp pasta.  The appetizers were average.  The pasta above average.  However the service was slow.  It took about 1 hr for our main dish to come out and we weren't the only ones noticing this.  Hopefully this was just an off day."}
{"text":"Dining room is dirty, glassware and utensils,dirty spotted unpolished, lipstick still on glasses, food is overpriced. Very small selection of bar often out of items."}
{"text":"Absolutely the serenity needed, true Italian style. Missed this fantastic spot, forgotten gem and I'm happy to be back. Thank you"}
{"text":"We moved to the neighbourhood and tried Why Not Italian for the first time. This is a family ran business but needs work on there professionalism. When they waitress (I think the daughter) ask me how my food was. Now in all fairness I am Italian so I did point out what I was disappointed in. For example the carbonara being cooked in a Alfredo cream-based. She became extremely defensive and then went to talk to the chef (I think her father) and from the dinning room to the kitchens started arguing about my order. Honestly I was so uncomfortable I just was to leave. But my family was still eating there meal.  If it was just the food I may have gone back. But the arguing in front of my family, makes me never want to try this place again"}
{"text":"Happy to see a few others had a positive time here from seeing the reviews - we did not and I could never recommend this spot to anyone. Ever. I was going to give it a 2 star - until my husband and I got very ill on our way home after eating here. We had made it a point to try to eat somewhere other than downtown or in the NW for dinner tonight. Through Yelp, we came up with this spot in Strathcona.  We went in - waited and waited at the front in an awkward little spot - in the way as there was no other place to stand. Finally, we were seated on the lower level when everyone else in the restaurant was seated high up at the windows. It was like being a little kid again, banished to the card table with your distant cousins at X-mas, not good enough to sit near the adults. Service was horrible in this lower area as you could hear the 2 wait staff that were on bickering at each other, ordering each other around and everything going on in the kitchen. Service, almost deplorable. Abrupt, no menu knowledge, slow. The buns were good, fresh. The Veggie Minestrone soup was OK, Hearts of Palm salad so-so... and then the food slid downhill. We each got a different dish but got the same pasta sauce, a rose sauce where it should not have been in either dish. I guess the kitchen had had enough for one day and served everyone the same. It sure was hot in the restaurant so not sure I can blame them. I hardly got any sauce on my plate, hubby got it all, so no balancing on plates from obviously cooking it all in one pan. The biggest offense though apart from the spongy mushrooms was the chicken. It was BAD! At first I thought it was just dry, hacked up with absolutely no seasoning on it and then we realized that it made both of us sick. It was so bad that I told the waitress how lacking it was to which she asked, \"Do you have a complaint?\" Uh, no, guess not. At this point I just wanted out. Waste of money triple fold. I paid, cringed to tip, finally hit some fresh air and... you can guess the rest.  Side note - The washroom was filthy - they need to throw out all those fake flowers with the 1/2 inch layer of dust on them, wipe everything down in there and get some soap for the dispensers. The place has potential but is lacking in good food, service, cleanliness (table cloth included) and structure."}
{"text":"Previous experience here has been 4/5 stars, but not tonight. Tonight was so bad that we aren't going to come back.   First of all, the table wasn't clean. There was sauce on edge from whoever had been there before. My wife ordered the same thing as she usually did, which is a modification of something on the menu. I also ordered my usual, the gnocchi primavera.   Right after we ordered we heard the cook loudly complaining about the modification. It took about 30 minutes for the food to get to us, even though the restaurant was literally empty other than us.   My wife's meal was good, but the normally clear sauce was mixed with tomato (didn't affect the flavour but wasn't as visually appealing as normal). My gnocchi on the other hand was overcooked and the sauce tasted burnt. I ended up eating a third and just leaving the rest. It was edible, but not enjoyable and definitely not worth the price.   I've been very happy with the food and service before, but tonight was enough to turn me off this place for good."}
{"text":"Waffled on a 3 or 4, had lunch with a limited menu, reviewed the dinner menu and it looked impressive  I had a garlic shrimp appy and fettuccini with sausage and mushrooms in  rose sauce  Very solid 3 out of 5 a little too traditional and limited choices on the lunch menu,   I would go back to see and taste the dinner dishes ie lamb shank, veal, seafood dishes etc.   Service was great"}
{"text":"Rude obnoxious people. We had guests from out of town and we wanted to take them out for Tiramisu at this restaurant. The restaurant owner asked us to go to a cafe for dessert lol. We used to go to this place for dinner regularly but after that we never went back."}
{"text":"Steady, good Italian restaurant.  Not as good as Buon Giorno but for those in the far west of the city it's a great choice close by.  My favorite dish here is the piccata al limone with the pasta side.  Wine list is decent and service is always good."}
{"text":"We were looking for somewhere to eat that was new and not too far, Matt was craving Italian, and this restaurant came up high in the Yelp search. After arriving, I realized I'd already eaten here, years ago! Funny how you forget. It hasn't changed, which isn't a bad thing. The front entrance is a bit narrow, so beware anyone with mobility issues. In fact, I bet larger wheelchairs would have a heck of a time, if they're able to make it through at all.  It's not a large restaurant, although perhaps a little bigger than one would think looking in from outside. They manage to get a lot of seating in, anyhow. When we arrived on this visit, there was a family of four with two small children eating, so it's obviously a good joint for adults and kids alike, although we were pretty early so I imagine the age of diners would go up the later the evening wanes.  The service is great - the food awesome. We liked the little bun with a \"bottom\" the bruschetta comes on because it means that the middle doesn't get soggy and the tomatoes fall through. The pasta dishes were awesome. I broke my no dairy rule to have the gnocchi gargonzola. It could have used a touch more \"blue cheese\" taste, but otherwise amazing and creamy. Worth the pain later :P   And the price is right. Definitely affordable. Parking is ample, especially in the evening when most of the other stores are closed. A gem in an unexpected strip mall."}
