{"text":"I frequent this place several times a month and never have had any problems.  Tonight I ordered the Caesar salad which usually comes with the delicious mushrooms.  When I ordered they asked if the mushrooms were ok, which of I course I said yes.  When I got home my salad was just lettuce, croutons and bread.  I called to inquire and was told they ran out of mushrooms to which I replied that I wish someone would've told me, I received an apology.  I wish they would have told me over the phone that they were out of mushrooms, rather than asking me if mushrooms were ok on my salad.  I would have appreciated the honesty rather than this disappointing experience."}
{"text":"I LOVE this place , best place in the universe.  They have amazing service,  are fast polite , quick . I strongly recommend them. I would die for this place . When I was 11 me and my brother used to go her every day after school by my self. I would always get a bowl of patato cream cheese soup.  And a chocolate brownie.now my brother owns a franchise in Missoula!"}
{"text":"My daughters and I just moved from California and we checked out this little spot. The food was great and they have kids meals as well. We also loved the bookstore that was connected to it (Changing Hands Bookstore). A lot of nice things in there and a nice way to spend the afternoon. I would recommend this location for anyone looking for a quick bite and good food. : )"}
{"text":"I ordered mac n cheese. It was riddled with peppers. It said a hint and this was red peppers with a hint of mac n cheese...look at the photo...it looks nothing like item. I have had it at another location and it was fine...What a waste.  If u want mac n cheese go to the Panera across the street. My stomach still hurts..they should warn you."}
{"text":"I like the food. But I will not becoming back to this location. We waited at the register to order while employees walked passed us 6 times without saying a word. Finally when I waved someone came up and was completely rude. When we asked for bread on the side she was snarky and said \"uh it comes with bread\" with such an attitude. Rude and not great service."}
{"text":"Food was good, but they kept wheeling trash out through the dining room right past our table. Why is there no dumpster out back?"}
{"text":"Great salads. Nice vibe. Staff was slow today, like I nearly left bc they took so long with 1 customer. Just one register open, and staff milling about. Very perplexing. But I prevailed  waited and had my salad."}
{"text":"I often eat at this or other Wildflower locations twice a week and have for years. The spinach strawberry salad is my favorite but there is a nice variety of salads and all are great. Sandwiches, combos and breakfasts are great too. 

The only recommendation at this location would be to expand its size to better accommodate all there customers."}
