{"text":"We've been coming to this place for 3 years - each year we hold our breath that it will be as good as last year.  So far, so good.   Nothing elaborate, just good basic comfort food with a friendly staff and"}
{"text":"If you've lived in LA within the last five to six years, you're familiar with the whole Pinkberry craze and all the knock-offs that have followed suit. Generally, these places are more hype than flavor but they're fun places to stop by with friends.

Well, I know of Pinkberry, Yogurtland, Red Mango, and alot of the other \"berry\" fro-yo places, but I've never heard of this one. It's pretty run of the mill as far as these spots go: topping selection, et al.. It's nothing to break an arm over but it's defintely not as bad as most of these reviews have made it out to be. It's worth a shot and you should really swing by to try it for yourself. I hope more fro-yo places open up in the Valley, because God knows we need them during the summer.

Phoenix has a reputation for being a little LA without most of the bad things that label the City of Angels. Phoenix tends to borrow LA fads or staples (for better or worse) such as: In-N-Out, Krispy Kreme, Sprinkles, and now this. I can only hope that one day Phoenix will open up a Roscoe's Chicken and Waffles somewhere in the 602 area."}
{"text":"Frozen yogurt has finally hit Phoenix! Ok, so I've heard of maybe 1 or 2 other fro-yo shops like this in the Phoenix area, but I've never been.
Thankfully, Wildberri (part of a CA franchise) just opened up right by my house! 

This is how it works - you pick a size, and then pick whatever flavor of yogurt you want (they have plain/tart, mango, green tea, and passionfruit- i think you can get a sample of the flavors before you order). Next, you pick from an assortment of toppings ranging from fresh cut fruit to candies/nuts, etc to add. The price ranges from $2.99 for a small yogurt with no toppings, to $7.49 for the 3-topping large - you can add additional toppings for a small fee per item. (While this is pricey for Yogurtland/world fans, it is pretty similar to Pinkberry prices, and the portions are quite generous). They also offer fruit smoothies in the $3-5 range.

If you are a fan of pinkberry/tart yogurt or just looking for a healthy alternative to ice cream on a hot Phoenix summer day, I recommend stopping by and giving Wildberri a shot. My personal favorite is the plain yogurt with strawberries, mango, and either kiwi or raspberries! MMMMMMMM, cold, creamy, tart goodness! 

While the decor is most definitely sparse, the yogurt is pretty good, the fruit is always fresh and sweet, and the owner is really nice and friendly. My only complaint? They never have mochi toppings!"}
{"text":"This place wasn't bad--I definitely prefer Pinkberry any day but until one opens up in Phoenix I suppose this will do.

I ordered a small plain with mango, and I thought they were pretty generous with the yogurt. However, they charged me the same price as a small+3 toppings, which kinda sucked. I mean, I wouldn't mind paying 4 bucks for a small if they had given me lots of mango to go with it, but they didn't...oh well, I guess next time I'll get some more toppings to get my money's worth."}
{"text":"I'll start off with the old saying \"You Never Get A Second Chance To Make A First Impression\" Please read on.

I dove and hour to get here! I was so excited to find another tart yogurt shop!
Decor is minimal but tends to follow the same theme as far as these types of places go.

I order a small tart with strawberry and kiwi (see pics)
 It had a nice creamy texture but not quite tart enough , I though the first couple of bites were tarty but then it just died off. 

Low and behold tell tale sign of cheapskateyness and robbing the customer was the hollow center of my yogurt (see pics) I really hate that and this is the biggest hole so far.

My daughter got a small tart no toppings or so she thought, mid way through eating she uncovered ..............a pickle hair, pube, short and curly, whatever you want to call it. What a monumental Vomit Factor came into play here, did this have anything to do with the creaminess? 

UGH! 
He apologized and refunded our money and assured us it was too short to be his hair. 
But when you think about How does a pube accidentally make it way into a frozen yogurt batch? A bug maybe , but a Pube No Way!!

I don't think I'll be driving outta my way to go here again."}
{"text":"Sooo.... this whole yoghurt \"craze\" thing? How is it different from any other yoghurt craze?   I thought the whole yoghurt thing started with the Dannon Frozen Yoghurt shops in the early 80s, and was made more commercial by TCBY.  You remember them... TCBY= The country's best yoghurt?  I was expectiing more from Wildberri... I hoped for decent yoghurt, and fresh toppings. The toppings weren't that great and there weren't that many options... and the yoghurt was too sweet.

I'm kinda sick of the feeble attempts at a better yoghurt."}
