{"text":"I live close by and was excited to welcome some good Asian to the Hood.  TERRIBLE SERVICE.  We took four friends in for a leisurely weekend lunch...so leisurely, that after waiting for over an hour for several cooked dishes...we left.  After our coats arrived, the pad Thai and the salads arrived, but they were adamant that we couldn't take it with us.  The water never arrived.  The food came very sporadically, so often 6 people shared one roll or 4sashimi pieces.  Our waiter couldn't speak English, gave us big smiles and ran away when we asked for anything.  AllYouCanEat  was really PLease...JustSomethingTpEat!  Buyer Beware."}
{"text":"Some food was ok, some was not.... the desserts were weird - there was both yogurt and mousse of different flavours - however both were the SAME THING and neither were anything close to yogurt or mousse. they were all different flavours of some kind of gelatinous blob in a cup.... I'll never know what I ate. Or tried to eat.. Anyway the sushi and other dishes were ok. Service only ok."}
{"text":"Not sure what others saw in this place, or maybe I just went on a bad day, but my wife and I agree that over-salting is a major issue here, seaweed in sushi and rolls is impenetrable and fish is not at all fresh, much better sushi a stone's throw away in any direction"}
{"text":"This little place opened up recently and I was a bit apprehensive about trying it. There are a few good Asian Restaurants in the area such as Guu and Kokoni.  However, I was pleasantly surprised when my girlfriend and I tried it. We went on a weekday night and thought we would just try the All-you-can-eat option. There were good choices on A-la-carte and decently priced but we were hungry.  The dishes were all very well presented and tasty too. I definitely managed to satisfy many cravings. From sushi to curry it was really surprisingly good. The Mango salad is a must.  It isn't as good as a Guu but it is definitely worth trying as an \"All you can eat\" and I think the lunch option is definitely great value. Unlike Guu I never bled through my wallet but still left well satisfied."}
{"text":"A lot of interesting things on their lunch menu. Normally I would say don't get Chinese at a sushi place but it was packed in there so we gave it a shot.  The Hot and Sour soup was surprisingly good. I would get that again if anything else! All other stuff was... just meh. Got a green dragon roll and a philly roll. The green dragon roll was a little bland and felt like it was missing a crunch and an extra flavour. The philly roll was better but not super.  I was looking forward to their General Tao but it didn't look or taste like General Tao and we actually thought it was the sweet and sour (the waiters don't identify anything for you)... eventually we figured out it was the Tao because the sweet and sour was just cherry sauce stuff. The popcorn chicken was really greasy but better than these two dishes. That said, the fried stuff was just  thrown on the plate and there was grease everywhere. So basically, 3 stars for the soup and $10 AYCE and MAYBE I'll be back, but next time I'd like to try Guu which is close by, my friend recommended it to me after that lunch."}
{"text":"Talk about a hit and miss restaurant. First and foremost, Wild Ginger is located in a what I would call an ennui inspired building. Just drab, where even the external bricks are shaded in the colour of depression and despair. No surprise not a lot of people know about the existence of this place.   Having said that, the interior is completely different, with a tad of a modern decour enhance by decent sized windows which allow healthy amounts of light during the afternoon hours. If fact, you could easily see people coming here to eat... but the question is: \"Do they?\"  See, Wild Ginger's main attraction is a fairly large menu at an unusually low AYCE price. Their lunch menu is a steal at $10.99 while the dinner is a fair $18.99.  However and quite unfortunately, a lot of those menu items can range from \"WTF?! to passable.\"    Their sushi and maki are items best avoided. They are small, some of them will self-destruct when in contact with chopsticks are they are not well rolled --so half expect them to come apart when in soy; and their sashimi? Yes, they are actually by far the best of the three if only because they are made of a solid piece of fish. Mind you, I do not recall them being included in the AYCE deal.   For best results go for the dragon rolls. Since the very nature of the dish requires a bit more care when being made thus they are marginally better prepared.  Some of the meat dishes fare a bit better. Salmon belly was alright and so where some of the appetizer items and the salads we had where okay. But then again, how can anyone mess up edamame? Curry pork was okay, stay away from chicken dishes. I think they use cheap ends which are quite fatty.   Oh, and their chocolate mousse? Well, according to my companion the thing was akin to Jell-O quality.   The truth is this, this place is a deal if you only eat the things they can make alright or if you go with people who don't know much about Japanese cuisine -- aside perhaps that sushi contains you know, some sort of seaweed... you know, that sort of crowd.  If you are a foodie who expects even a remotely uniform menu in terms of quality... you will have to look elsewhere.   In conclusion, I can guarantee you nothing you taste here will be the best you will ever have of ANYTHING; and hopefully by the time this is posted the restaurant will have enough common sense to remove the dead plants from the entrance -- seriously, horrible first impression guys."}
{"text":"My original review was giving them 5 stars, but MY they went downhill quick. The sushi tastes terrible now, the service, though sometimes is nice, it's not consistent. Just bad, waited forever, got food slowly, in weird order and to top it off, nothing tastes good."}
{"text":"Lots of mediocre options to unacceptable.  Service is below average, you will probably get most of what you ordered most of the time, but don't expect it every time. Server was also unknowledgeable about the food, when I asked about how it was prepared, but I got the impression she had no idea whether the food was fried, or raw,  nothing was particularly good or impressive, so I'm not surprised most people think that its not great either  I believe this restaurant is now closed (2014)"}
{"text":"Gross! Gross! Gross! I wish I could give less than 1 star. I cannot believe the other reviews listed here. We had a group of four and had the all-you-can-eat menu. The sushi was horrible--it didn't taste fresh and seemed hastily prepared! The service was horrible--our waiter couldn't identify what was on the plates he brought, nor could the bar make the drinks we asked for! The atmosphere was horrible! Avoid this place like the plague! :-("}
{"text":"Great all you can eat buffet.  You can definitely get your fill at a great price here.  Dishes are tapas size so you can try a bit of everything and have more of what you like.  Definitely likes the fried rice and gyoza.  Sushi was also good.  Loved that they had a \"clean plate\" policy to avoid over ordering."}
{"text":"Looking for some sushi on College was a bit of an adventure. Our palette's were all set for some good Japanese food at Izakaya Sushi House (near Kensington) but weirdly, it was closed at 2:00pm on a Sunday despite their sign's business hours...  Anyways we drove East and happened to see the Flashy sign outside of Wild Ginger, a Japanese & Thai Fusion resto. I must say that we were very impressed at the modern and classy decor of this (new?) restaurant. It had great Feng Shui with spacious booths, large windows, and a sushi bar. A classy crystal chandelier and nice bathrooms topped off the ambiance inspection. 5 stars there!  Now onto the food:  It was about 2:30pm now and I assume we had missed the $7.95 lunch specials...unfortunate, as I enjoy nothing more than cheap food in an upscale venue. Anyways, after looking through the dinner menu we decided that it would be best to go for the AYCE lunch. $12.99 + ($2.00 Fri-Sun). We were given the typical Japanese AYCE checkoff menu, but here there were a few THAI options to choose from as well!  The House salad was tasty and not viegary/too gingery, the mango salad was equally delicious with fresh ripe mango+onions+bell peppers. The miso was watery and the hot+sour soup was ok but I'd pass on these next time. Agedashi tofu was good but unremarkable.  The teriyaki chicken was quite tasty, the coconut curry chicken was a nice change in the flavor mix. They also had pad thai and udon/fried udon, but we didn't order these. We did however order sushi! Unfortunately there were only 2 special rolls, both of which we ticked off, as well as a Mango/avocado hand roll, Spicy salmon hand roll, salmon roll, dynamite maki, salmon + white tuna sushi.  The presentation of the rolls were excellent with a great ratio of filling/topping to rice (always key). The fish wasn't exactly melt in your mouth, but adequately fresh.  Service was fast and attentive making sure to fill up water/green tea and offering dessert after the meal. Dessert options were more than just the usual ice cream if I can remember correctly it had some other goodies...but simply we were all too full for that.  So overall it was a really nice surprise to find this reasonably priced fusion restaurant with good ambiance. It was great to have the dishes prepped in an A-La-Carte fashion and presented nicely despite it being AYCE. I'll be back for lunch specials and weekday AYCE lunches!  **Oh Note Bene! ~ there is a 10% discount if you pay by cash, so hit up the CIBC across the street! :P"}
{"text":"This place is such a hit or miss for me...  My last experience was horrible... We went with a large group... I food kept getting mixed up.. Never got some of the items we ordered and food took too long to get to us.  The service was slow and we had to keep repeating what we were ordering and follow up on when we would get it...  The table wasn't served at the same time either so one side was eating while the other was still waiting... We had to move food between the table to keep everyone engaged...  Needs better management... The food was ok... I've had better..."}
{"text":"Very good AYCE sushi place with a nice variety of non-sushi food as well. Good sushi pizza as well as various chicken items"}
