{"text":"Tout nouveau, tout beau et... tout bon! J'ai hâte d'y retourner car la carte promet d'être saisonnière. Pour l'instant l'automne, et donc un bon équilibre dans la carte entre poissons et viandes et bien sûr les légumes de saison. Un choix facile sur une carte ramassée qui permet d'éviter de se perdre dans un dédale de choix comme c'est trop souvent le cas dans pas mal de restaurants. Les assiettes sont bien équilibrées, dressées avec soin et beaucoup de style et les saveurs sont détectables à chaque bouchée. J'aime bien le mélange des styles bistrot et restaurant. Si vous préférez une table plus haute ou le bar pour un repas sans façon, ou alors une table classique à deux ou plus, le choix s'offre à vous. Le service est attentionné, sympathique sans être obséquieux. Et en plus le niveau sonore est tout à fait raisonnable et donc appréciable de manger en pouvant discuter sans élever la voix comme c'est trop souvent le cas à Montréal! Une belle révélation."}
{"text":"Solid food- what you would expect from any other new american type of restaurant in NYC.  Solid bass with great flavor and solid steak with fries.   Oysters were fine and the salad was well dressed.  The staples were there and well executed against a trendy, airy back drop.  Overall, decent and reasonable fare in a low-key restaurant."}
{"text":"I was there for sunday brunch. The place was not full and the only 2 servers were overwhelmed!! They should have at least one busboy and one hostess for these few hours. Service was very cordial but you can tell that they could not manage the flow.. the food was ok, but nothing to brag about. Deco is awesome! I will return for the evening menu, hopefully they will have more staff, or not, but the pace is usually slower than brunch!"}
{"text":"Incredible and exquisite food for the price. One of the best brunches in the city for about 20 bucks. It's a sophisticated atmosphere, but the service was awful.   TLDR: incredible food, surprisingly low prices, so-so service."}
{"text":"Went there for lunch. The place look great, I love details like the ''W'' on their glasses, it looks very design trendy. The place was not packed at all and we've (group of 4) experienced the slowest service ever. I must say the waitress seemed to be alone there so maybe it was too much. .. So I have picked a plate of pork which was tiny bit like a ''cotelette de porc'' without the bone, it was like a thin steak of pork and I really wanted to love it but myyyy it was fat, it looked like it was all fat no meat. Did not like it at all but the rest of our table ordered the fish and apparently it was exquisite. The dessert save the day it was so good, different and flavors were so intrestingly mixed. I enjoyed it. The waitress was really nice, overall a good service, I think I would go back and try something different and re-review this place.  They make a great Gaspacho if you like that (im not a fan of cold soup but you know, if you are: it's great). A little pricey but it's similar to the other restaurants .around"}
{"text":"Came for brunch on a weekend trip to Montreal. The French toast was amazing!!! Some of the best I've ever had"}
{"text":"Outstanding, truly. The summary: Ambiance was relaxed (we ate out back on the patio); waiter was excellent; food was incredible. Eat here!  The details: There is a price fixe menu that is REALLY reasonable--three courses for under $40. We weren't hungry enough to each have the full menu, but our waiter quite rightly suggested that one of us get the full menu and the other one just order a main course. No sneaky effort to rope us into a whole bunch of food that we wouldn't have finished. Everything we ate was phenomenal, from the dishes (marinated salmon appetizer, hanger steak, Arctic char (fish)) to the bread. We finished with the chocolate torte--so, so delicious. Wine was reasonable and paired well with meal. Major bonus for any fan of sparkling water: They make their own, and it's FREE!"}
{"text":"Delicious restaurant, modern trendy decor, friendly service and a lovely back terrace. We started our dinner with the avocado shrimp on pancakes, and noodles with sour cream - both surprisingly decent portion size and delicious. The scallops with miso was a light dish - mushroom purée complimented the seafood perfectly. My dining partner had the octopus with white bean, a very busy dish with flavours which compliment one another nicely. We will be back!"}
{"text":"Came here for brunch on a Saturday. The menu is small but extremely well executed. I had the croque monsieur and my friend had the steak & eggs. Both were traditional and simple but very well executed.   They also offered affordable brunch drinks. We had a couple grey hounds w fresh squeezed grapefruit"}
{"text":"Exceptional value for reasonably-priced, elegant dining. The menu is concise and well-curated; the food rewards your imagination and appetite. I found the service attentive and the space itself ideal for a small to medium sized party."}
{"text":"Came for brunch and really enjoyed it. I had the Croque Monsieur, which was great. Others had three other dishes, which they also really liked. Everything was really fresh."}
{"text":"Nous avons essayé le resto en amoureux, mais aussi convenable entre amis ou famille. La carte est divisée en petits plats et plats principaux mais ne l'indique pas clairement. Vous comprendrez par le prix ce qui est une entrée ou petite portion versus un plat. Nous avons opté pour un gros repas, soit 2 entrées et 2 plats, mais plusieurs autour de nous choisissaient 2 petits plats par personne. Notre coup de cur est certainement l'entrée de saumon gravlax et sa purée de topinambours, wow! Le ris de veau était bien, pour ceux qui l'aime s'arrête en gros morceau frit, mais j'ai préféré l'onglet. Le menu est saisonnier, nous étions à la fin du menu d'hiver. La carte des vins propose des options a tous les prix, ce qui est fort apprécié! Bon service aussi. La facture s'est élevée à 150$ pour 2 incluant une bouteille a 35$. Une bonne place à essayer sur Laurier."}
{"text":"Great service, good location, decent ambiance & very average food.  Dinner for 2: $175 with appetizer, meal, aperitif, dessert  & bottle if wine."}
{"text":"Had supper here last night during MTL à Table and our expectations were definitely met.   For anyone not from Montreal, Montreal's restaurant week comes around once a year and participating restaurants offer a 3 service \"table d'hôte\" menu at reduced prices. Everything on the menu looked delicious and everything we ate was indeed awesome!  To start off, the waitress brought us delicious home made foccacia with aioli butter. The party seated next to us kept asking for more - that's how good it was.   For entrées, we had potato and caramelized onions croquettes (served with beet salad and aged cheddar), & corn pancakes topped with nordic shrimps, avocado and chilis - both delicious. As the main course, we had the pan seared Arctic Char which was served on a \"crispy\" polenta cake, mushrooms, butternut squash and red wine sauce. The char was cooked to perfection with crispy skin and all. The polenta cake wasn't cripsy as advertised and needed seasoning, but overall a tasty dish. We also had the hanger steak \"à la plancha\", served with root vegetables & hand cut fries. Meat was cooked to perfection but some kind of sauce to bring the plate together would have been even better. Finally, the deserts were simple but very good, although we were stuffed by that point!  The overall experience made me curious to go back and try the regular menu (and brunch)!"}
{"text":"Cuisine agréable dans ce bistro réorganisé qui ne date pas d'hier.  Service efficace et attentif.  C'était glacial à l'extérieur ce soir-là. Il manquait quelques BTU à l'intérieur.  J'y retournerai...l'été!."}
{"text":"Food was good.   Service was awful. We waited over an hour for our main course and the place was about 60% full. I had finished my wine well before main course arrived, nobody ever asked if I wanted more. Indeed our waitress eventually just took the glass away, having never asked if I wanted more. The high point may have been when I asked for the bill, waitress disappeared for 15 minutes or so, and then when she finally returned joked \"oops, I forgot.\" Yes, so funny after all the waiting, thanks! Avoid avoid avoid."}
{"text":"I went here with a large group on Friday night and we absolutely loved it! Our waitress was so patient and accommodating and the food was outstanding. I'd highly recommend it if you're in the area."}
{"text":"Great dessert selection; the olive oil cake was really good. The menu requires ordering 3 or 4 dishes per person for a full meal portion. The lamb confit and duck confit were really good. The quail wasn't available but it looked very interesting. Very neat decor and soothing ambiance."}
{"text":"My friend and I decided to visit Wilfrid sur Laurier because it was on our to-go-list for a little while. We went at around 11 am on a Saturday and surprisingly, we were the third customers there. I thought there would be a line-up just like other brunch places but there wasn't!   When I looked at their brunch menu, I seriously didn't know what to order. There wasn't anything in particular that interested me to be honest. However, their lunch and dinner menus seem to be more interesting for me!   At first, I wanted to order their \"Salmon gravlax, buckwheat pancakes, scrambled eggs & fennel salad\" but one of my friends said she didn't find it that good. She said only the pancake was good in this dish, so I was reluctant to order this. This same friend also tried their \"Breakfast salad: poached egg, pork belly, small lettuces & parmesan\" and she said the pork belly was really \"soggy and greasy\", so I wasn't sure if I should get it...  I finally settled down for their \"2 eggs, chipolata sausage, crispy polenta, romesco sauce\". The dish was beautifully plated but it was overall pretty dry. The sausage was plain and dry (it is not comparable to Taiwanese sausage, which is seriously one of the best sausages in this world! I would definitely recommend anyone who hasn't tried it to try one some day!) There wasn't anything that wow-ed me about this dish.... I've had better dish elsewhere.  However, my friend's \"Challal French Toast, caramelized apples, caramel sauce\" was AMAZING! It was so fluffy (that I'm gonna die)! I really liked how the outside was a little bit crispy while the inside was so soft! I thought this dish was going to be really sweet but it wasn't! The amount of sweetness was right and the French Toast was just perfect. This dish is a must at Wilfrid sur Laurier! I highly recommend it!  Overall, I would give them a 3.5/5 because the service was great, plats were Instagram worthy and their French Toast is to die for! I would definitely go back for their French Toast!"}
{"text":"I was very impressed last night. I had read solid reviews on this place and was provided strong verbatim from a reputable source. We were received with excellent service and all our questions attended to with careful detail. Now let's discuss the food. The only complaint I may have, if you can call it a complaint, is in regards to the oysters. I pick and choose my oysters with great care and I found the ones I had a little bland. Terrine of duck and foie gras was spot on. Now the mains ! I had the best veal sweetbreads ever !!! My fiancé had the hangar steak and it was equally divine ! Getting back to my Veal sweetbreads - a real orgasm ! I highly recommend this place to all and wish the staff at Wilfred much success."}
{"text":"Great place, quiet peaceful ambiance, reasonably priced compared to other similar restaurants and most importantly the food was great.   The menu is divided into three sections: W, WW and WWW. Our waitress explained that the number of Ws meant described the size of the plates and that usually people go for 3-4 Ws each. We were 2 and couldn't decide what to get because everything sounded good so we decided to share four plates. We started with the corn flower pancakes as well as the potato and caramelized onion croquettes. Both were delicious and decent sizes for their \"W\" part of the menu. We then split two \"WW\" plates, the tuna and the lamb shoulder. Both were cooked perfectly.  We were quite full by this point and decided to finish the night with a light refreshing panna cotta.   All in all, we had a great time and will definitely return."}
{"text":"Our first time in Montreal - we found this place on a \"Best of Montreal\" site and decided it was our kind of dinner.  Casual ambiance with high-end food - reminded us of a few places we love in Boston's south end.  For an app we got the pork belly, poached egg and kimchi.  It was a good size for 2 to share for an app and we each took away different favorite elements.  The pork was crispy and fatty - really delicious.  For entree's my boyfriend had the seabream, wild mushrooms, polenta and red wine.  There was a lot of fish on the plate and the skin was crispy with the fish flaky/tender as described.  The polenta and wild mushrooms were also delicious, definitely a good choice!   I had the highly reviewed veal sweetbreads and I was not disappointed.  Deep fried and soft inside, the sweetbreads (my first time ever trying it) was fantastic.  This dish also had a fairly large amount of food on the plate and I was surprised how well the yellow beats complimented the parsnips.  I never would have thought to pair those two but it really worked.  Highly recommended!!  For dessert we got the whiskey-soaked cake.  While this was not our favorite part of the meal, it did have a good flavor and plenty of textures.  The second best part of the meal (after the sweetbreads) was the beer.  My boyfriend had the oatmeal stout and seriously loved it - all of the taps were local which gave us the opportunity to try something new!  Overall, the meal was reasonably-priced for the high quality food and we had a great time chatting with our host, a secret life-long Bruins fan :)  We would definitely come back to Wilfrid next time we're in town!"}
{"text":"Now that I've tried their brunch, I definitely want to come back for their dinner. First of all the place is gorgeous (always helps), and if the weather permits, you can sit out on the terrace, which I did. And what a lovely terrace it was. Comfortable seats and parasols to provide some shade if needed.   The brunch menu was interesting, and I had trouble picking what I wanted before settling on the platter of chipolata sausage, crispy polenta, 2 eggs and rosti (an additional option since I thought there was no toast included). Turned out a slice of toast was included, plus half a bagel! I really enjoyed my food and was glad to have asked for scrambled eggs because otherwise the plate would've been a little dry.   What surprised me was that the place wasn't packed. The terrace was full by the time I left but there were plenty of free tables inside the restaurant. With that kind of quality food, great service and reasonable prices for the area, I think it's a hidden gem in the Plateau. Truly recommended!"}
{"text":"Very good restaurant, they have a fixed price menu with 3 courses for only $38 canadians. The food is fresh, service is great. They have a terrace at the back. Awesome experience!"}
{"text":"Un brunch un dimanche matin. Des cafés préparés avec savoir faire à l'omelette au romarin parsemée de champignons. Simple et succulent. Pas besoin de chichis, le goût d'abord. Un avantage certain également: la réservation en ligne !! Quel bonheur de ne pas faire la line up pour bruncher un dimanche matin quand il fait -20C dehors."}
{"text":"Extremely high quality brunch with a very healthy and reasonable portion for people who don't expect an american pub size meal. Besides, it's really not expensive for its quality and I think it's emerging to be my favorite brunch place after all the places I liked got packed and the quality went down in the same neighborhood.  PS:  Why lineup on a Saturday morning?! They take reservations!"}
