{"text":"I freakin love this place. I go there for Trivia on Wednesday nights when I'm not working, and recently I started getting their food.  Every single thing I've had has been better than I expected.   The Quesadilla, the wings, the crab cakes, and even the fries.   I went with a friend who asked for a \"real margarita\" and the guy made an awesome margarita from scratch.  This friend happens to be particularly picky about margaritas (and it wasn't EXACTLY what she wanted, but she still admitted it was one of the best margaritas she's ordered at a bar)  As soon as the guy found out it wasn't perfect, he comped it, even though we would have NEVER asked him to.  (Like I said, still a great margarita!)  Awesome place."}
{"text":"Had dinner with my gf here a couple weeks ago because some friends were performing a cabaret.  Love this place!  The food was pretty great, the atmosphere is similarly great and the owner is awesome.  My gf found a little sand in her mussels so she only ate about half of them.   After our plates had be taken away, he came over, totally unprompted by us, to let us know that we wouldn't be charged for the mussels as she obviously hadn't liked them - what!?  That's awesome. Furthermore, he offered us a shot of spiced whisky.  The only negative for me was that they were out of the dessert I wanted... Oh well, we'll be back again I'm sure :)"}
{"text":"Great place! Great drinks and of the best quesadillas I've ever had! The magic show was nice as well."}
{"text":"Went here as part of Cabbagetown festival. Is was our first stop at 7pm. Got some beer and waited more than one hour for sampling their food. Didn't they expect customers? Finally when the food arrived, is was unseasoned, not even a bit of salt, plus the bite size chicken snitzel seemed fried in old oil. They said it will take more time to bring the chicken wings....we left! And we weren't alone! Lot of unhappy customers around us!"}
{"text":"Went there on a Tuesday night for a date; we has the place to ourselves! Will be back on a busier night for sure : food was great ( we tried the sliders, quesadilla and the antipasto plate), service was very attentive and the place is artfully decorated."}
{"text":"The Winchester holds unique events and activities on different nights and my review is for the Monday improv event and for a nerd games night that I attended. The Winchester is a nice venue for small events and they have a small stage upfront. On these event nights the Winchester offers free food! The free food is usually pasta, stir-fry, some other carbs, salad and a sweet dessert.  Free food is always good, but I'd recommend filling up elsewhere.   The bar is standard and the venue is quite dark and dingy. When I first went up the stairs the first time, I admit that I was scared. However, it is the people that make this a nice bar. The staff have been very tolerant, regardless of the event being held. I would definitely go back for more improv! The Monday night amateur shows are actually quite amusing to say the least."}
{"text":"A great new spot in Cabbagetown.  I'm a big fan on the building (Winchester Hotel) and really wanted to see a great business blossom here.  Winchester Kitchen is definitely serving up to it's name.  Great food and amazing hosts.  I had the chicken trio which I can say is the best I've ever had.  The chicken was moist and full of flavor and well worth the money spent.    I would highly recommend anyone in the area to check out this gem of a building and it's new occupants.    Will definitely be going back there again!"}
{"text":"quite a unique experience here... did not know what to expect.   food was meh... okay not bad.. nothing uniquely special that stood out there... might feel pretty heavy after eating here. from what i remember.. nothign is exactly \"light\" in their menu."}
{"text":"\"When a door closes, a window opens.\"  I was quite blue when my neighbourhood haunt \"The Underdown Pub\" closed recently. Then I discovered some of the awesome staff had moved to this place, which I actually prefer.   They have a wonderful little menu (cobb salad was excellent, bacon poutine taunted me from across the table) and I've heard great things about their live music and various theme nights.  I will definitely be back, and back again."}
