{"text":"I've been twice here! Food are okay! Great staff!! Great pub to hang out! I'll come back again for sure!"}
{"text":"I have been coming here for a couple of years and this place only gets worse. We used to love coming here because the service was the greatest part. Funny bartenders and great waitresses. Now you get grumpy staff and the food tastes like it's from the superstore frozen section. It's a shame because it's so convenient to walk to from my house but I'd rather not drink and drive somewhere else that has good food and better service. 

I hope they switch ownership again. 3rd times the charm."}
{"text":"I really wanted to like this pub because it is in my local but each time I go there I am consistenly disappointed.  This week a new menu sign was posted so I thought I would try again, big mistake.  I also wanted to be optimisitc and think I could just stop for a drink and chat with my pals because it is a beautiful place but the price of a glass of cheap wine can't even be justified, sorry."}
{"text":"I've popped in a few times since the change in owners and Managment.  What a complete 180.  You can tell it is Restaurateurs that took over who actually care about great service, real  quality food and customer focused experience. The change in the menu is the biggest change.  It's pub grub but nothing is frozen or out of a bag anymore.  Fresh and delicious.  The revamped pizza recipe is awesome, the calamari was probably the most tender squid I've ever had.  You can even tell with the staff they are actually enjoying work! A couple girls mentioned how much busier it is lately. I've had great service everytime.  The girls are prompt, friendly and genuine.  The general manager was cruising around making sure everyone was happy.  Seemed like a number of patrons knew him by name.  I think good things are ahead with this change.  Can't wait to check out the rooftop patio this summer."}
{"text":"Super yummy food and great service. Love it and that's why it has been given five stars. Great pub for a night out with family and friends. We will be back and recommend you give it a try mate."}
{"text":"I've been here a few times and the service has always been really good. On one occasion we arrived after the kitchen was closed and were offered their house made chips and salsa which were so good. On another occasion I had the smokehouse sandwich which was really good and quite filling! Would be a five star review if a limited menu (more than just chips/salsa) was available late at night."}
{"text":"I like this pub because it is pretty close to our place and it has a great beer selection. I haven't had a problem with the food and I've been for brunch on Sunday and had appys. They weren't anything special but passable as pub food goes.
They have a couple of nice patios in the summer."}
{"text":"What can you say about the Windsor Rose? Pretty typical pub fare, I've never sent anything back to the kitchen. Would like to see more bread free (not just salads... Salads are for wussies) options on the menu. 

The service staff are 'extremely' friendly... or at least the hands of the female servers don't rest that high on my thigh at other pubs. Even the male bartenders will flirt with the girls (and guys depending on their mood), once in a while. 

The little higher than average drink prices help keep the D-Bags (you know... the flat-brimmed hat worn sideways types) away. The regular barfly riff-raff are a classy bunch with perpetual grins, deep bellied chuckles, with a witty sense of humour. Great place for happy hour!"}
{"text":"Very nice looking pub but meal was a disappointment .. 2 of us had the Thursday special of \"all you can eat\" pork ribs ... Not very tender and taste not the best i've had. Others in party had the ceasar salad (stale) and scallop app  ( worst scallops ever), the other in group had the pork sammy which she enjoyed. Beer and drinks were good a server was good.
Will stick to beer and maybe the steak sandwich next time."}
{"text":"This place has never been that great.. But it has gotten significantly worse since 'new ownership'. Poor service, gross food, over priced drinks. Such a waste of a place that has so much potential."}
{"text":"Wing night at the Windsor Rose! 
35 cent wings (with the purchase of a beverage).
My family and I decide to order (for ourselves) 20 wings, Bruschetta bread, Pickle spears and 2 beers. For our son, he settled on a Calzone and ice tea.
When the meal arrived my wife and I ordered an additional beer each. 
Nearing the end of the meal we ask the server for a take out container so we can take the remaining few wings with us. 
It's at this time that the server disclosed to us that we can't take the wings with us. 
Upon our request the server brings the manager to us so we may voice our concerns to her. 
The unprofessionalism that we were met with was unbelievable. 
It's clear that at no point in time has this individual ever been tutored in customer relations. 
Not only did she completely ignore our points, she did so by continuously attempting to talk over us. 
This manager would definitely benefit by attending a customer service course and in turn the restaurant will also benefit by her participation.
Not our first visit, but because of this one incident my family and I will never step foot in this restaurant again. 
Those of you who entertain the idea of visiting this establishment...do yourselves a favour and \"read the fine print\"."}
{"text":"Wonderful pub. The decor is wonderful, and the room is broken up into smaller sections for a more intimate feel. 

The menu is small, but has quite a lot of interesting choices. I'm looking forward to going back and trying a few more. I had the steak sandwich, which was a bit overdone, but still tasty. I didn't have to pay extra to substitute my fries for a salad.

FYI: They take credit, but not debit."}
{"text":"Went for lunch after the lunch hour rush. Very few tables were occupied however the service could not have been slower. It was awful the wait to get menus then again the wait for drinks and so on and so forth. Very disappointing."}
{"text":"When it first opened, I was not taken with the Windsor Rose. There were a lot of kinks in the menu, and there were a lot of areas for improvement, particularly for someone who didn't eat a lick of meat. Back then there was literally nothing vegetarian on the menu. 

The menu itself has undergone some really positive changes. For one, the breakfast/brunch menu for Saturday/Sunday is actually quite good. Their version of eggs benedict is awesome, and I really really love the vanilla french toast. As a bonus they bring the syrup out in little jam jars which always elicits an \"aww\" from me. They really are cute.

The dinner menu, in my opinion, could still use a little work, but it's come a long way since the Windsor Rose opened. Again, I can't speak to their wings or their ribs as I don't eat either, but they've expanded the menu again and the Mediterranean Salad is actually quite good--it contains roasted vegetables and goat cheese (which really, makes anything more delicious).

Overall, I think it's a place that will get better with time and will continue to improve."}
{"text":"Best staff Christmas party.

The room and table looked great.  The ladies looking after us were always there when we needed them.  The food was outstanding, delivered timely, hot and perfectly cooked.  Everyone one on our staff had nothing but good things to say about the food and service.

Windsor Rose, keep up the great work, we will be back!"}
{"text":"New management has really improved this place. Love that they allow kids now, we go for wings most Mondays, and the pizza special on Wednesdays is great too."}
{"text":"My friends planned a birthday party for me this past Saturday. They had reserved for a table inside but the staff was awesome in saying that we could easily move to the patio upstairs. It is clean and comfy up there and very suitable for intimate groups. 
The food is delicious!! We all enjoyed our meals. The staff was nice - especially the bartender, who was especially attentive. Our server was nice too, but not quite as personable as the rest of the staff.
Quite impressed overall :)"}
{"text":"This place was awesome! I was there a couple times in the last week and in the afternoon on Sunday I was there to watch some sports and let me tell you, it has everything. The jugs of beer were ice cold and flowing and they had Creed blasting from the speakers. I would recommend going here if you love Creed and or jugs of beer!!!!!

Pros: Creed blasting out the speakers, close to my house, the server second from the left on their Octoberfest Instagram post, still serve jugs of beer, the bartender that reminds me of Russell Peters. Golden Tee. 

Cons: Your staff enjoy wings with customer at the table while serving and walk away still eating the wings. The bartender that reminds me of Russell Peters.

They are next door to a liquor store if you wanna grab a Scarborough suitcase to take home. A+"}
{"text":"A website recommended this place to my friends and I so we decided to give it a try. We got awful service from our waitress. 

First thing we ordered our drinks. Just to watch the bartender put whip cream on my friends drink and then shoot whip cream into his mouth and put the spout in his mouth. He then proceeded to put whip cream from the can he had in his mouth, on another's customers drink. Absolutely disgusted. 

My friends ordered wings as a starter and buffalo chicken wraps for their meal. They did not receive their wings until 30 minutes after ordering. Just to receive their meal not even 2 minutes later. When my friend asked for ranch for her wings. It took our server 10 minutes to get it to us, and by then her wings had gone cold. 

I ordered the 7oz steak sandwich *rare* and received two very thin slices of meat cooked medium. So I sent it back and was told it would be a 3 minute wait, I ended up waiting 10-15 minutes for a new steak.

This restaurant is unsanitary and very poorly run. DEFINITELY will not be returning."}
{"text":"What a great place.  The server on the roof top kim i think her name was, is super great. She came just the right amount of time.  The drinks where cold, and the rooftop patio is super fun and inviting.  The food was also great I had pizza and it was delightful. 
Will be back often."}
