{"text":"Just not good. Since it is downtown Tempe, we had to pay for parking to go here and it ended up being a total letdown. They took forever to make the pies and then when we got them, the cheese wasn't all the way cooked and the seasoning reminded me of the stuff on those lunchable pizzas I had as a kid. I'm still giving it 3, though because they were super nice and they have free refills and the place was clean :)"}
{"text":"Love this place!! Came here for the first time this week with a friend and I got say it was amazing!! We stumbled upon this place while trying to find a place to eat before class. Glad we made the decision to come here! Walked in and were greeted by a very friendly worker, he asked us if it was our first time her and we told him yes. He helped us with our order. I ordered the Colombo Pizza. Before he started making it he told me if I wanted to try the sauce because some customers have mixed feelings about it. I said sure! He gave me a sample of the Roasted Garlic Béchamel Sauce and it was soo good! Not all places ask you if you want to sample the ingredients. That was a first! Overall delicious pizza! Friendly staff and great vibes :). We are Definitely coming back!"}
{"text":"I came in not knowing anything about WisePies and was very happy with my experience. The staff was incredibly friendly and guided me through the menu options as a first time customer. I tried the Luciano pizza and it was delicious. My only suggestion would be to add more pizza options to choose from. On the other hand, I think WisePies markets themselves being the place to go for choose-your-own pizza, but I like having a variety of pre-made choices. Overall good food!"}
{"text":"All I can say is WOW! The pizzas here are amazing, delicious, flavorful, etc. They're pizzas are just personal sized pizzas, but honestly, why would you wanna share your pizza?! Lol. Overall, really great food, great atmosphere, and the employees are kickass!"}
{"text":"This place is one of the best kept secrets near campus. Just ate here for the first time today and was very impressed.  First, no crowds. I guess the word hasn't gotten around about how good this place is. The BBQ pizza was great.  They have both regular and wheat crust.  Very thin, so no carb coma after lunch.  Their side Greek salad was big and the ingredients fresh. Great customer service as well.  I will definitely return."}
{"text":"Not bad pizza, ordered the Gambino. It was pretty tasty. The side salad with the 10.00 combo was really fresh. You could tell it wasn't sitting all day in a cooler. All and all not a bad experience. Side note, don't split the 10.00 combo with two people not enough food. Not a complaint just an suggestion."}
{"text":"A friend recommended Wise Pies and I was very happy I tried it. 

Wise Pies makes personal sized, thin crust pizzas that are simple, but extremely delicious. They make the pizza right in front of you with your custom order and in less than 5 minutes, you are filling your belly. 

Salads are good too! 

I'll be back."}
{"text":"Ordered pizza and a side salad from WisePies through PostMates and unfortunately, wasn't impressed. The salad was basic and nothing to complain about but the pizza was just not my cup of tea.

I wanted to give WisePies the benefit of the doubt because I ordered it to-go and blame the soggy pizza on the fact it was delivered but it was pretty apparent that the pizza was just straight undercooked. There was no crisp to it and the cheese tasted like it was barely melted. The toppings on it were looking great but I felt like they didn't even get to bake at all in the oven. 

Sorry that I couldn't rate better! I'd give it a two but I felt like the effort was there. Just missing a few pieces."}
{"text":"I loved it!! :)

Basically, you can make your own pizza from scratch - which is fun but not a new concept. However, what makes this place stand out is the fresh ingredients. The pizza I made was delicious.

The staff was also very friendly, prompt and helpful. 

The only negative I found was that the place is very plain, no artsy stuff or beautification of any kind to create a nice ambience.

But surely that can't beat the taste!! I'd definately go again."}
{"text":"Messed up my order. Tried to fix it but didn't make the pizza properly. Waited forever for my nurse pie. Not prepared for large lunch crowds."}
{"text":"Really enjoyed the pizza here. They had their specialty pizzas as well as pizza you could make to your liking. Everything one price."}
{"text":"I see much room for improvement for this pizza joint. I ordered a 6\" personal pizza with truffle oil, fresh mozzarella, roasted chicken, and banana peppers through Postmates. I received the wrong order, which could have been caught by the employees working today. My Postmates driver went back to retrieve the correct order, and brought back a pizza with only banana peppers. I had paid extra for the other toppings and instead I had to wait double the amount of time I should have and still didn't have the correct order. I understand that after an order is made from postmates the first time, it disappears and they cannot bring it back up. They could have contacted me through my postmates driver to verify my order, or reflected on what they made before and maybe try to remember it. Honestly, I would be surprised if the receipt didn't show that I ordered those extra toppings for an extra price, which the employees could have looked back at in order to assure I had a correct order. I was pretty disappointed that my order was messed up so many times. That's not to knock the experience when you go in the store though, because I had ordered delivery through an app, which easily makes room for mistakes. The pizza itself was mediocre, and not at all what I ordered. Maybe Wisepies can use my comments to assure better order accuracy in the future."}
{"text":"So far so good! Really good gluten free crust (and that is saying something for sure). Good toppings. Salad doesn't taste like it came from a bag (even if it does it doesn't taste like it.) Great if you are a picky eater! Also, staff has been super nice and super helpful."}
{"text":"Just stopped in here for the first time to pick up a pizza for my girlfriend and myself. The staff was super helpful and friendly and the pizza was amazing. Super clean store with lots of options. Also I really like that it's one price for a create your own pizza. I have been to other stores with similar concepts and end up paying a lot for a small pizza because I get a lot of different toppings. All in all, I will definitely be a repeat customer"}
