{"text":"The service at this Cantonese restaurant was TERRIBLE. If I could give 0 or negative stars I would. Two couples and a group of three was served to and FINISHED eating before my mother and I even received our food! AND WE ARRIVED BEFORE ANY OF THOSE PEOPLE! We had to wait over an hour for our food! After my mother and I paid (without tip of course!) the cook told us \"If you don't have money don't eat here\". EXCUSE ME!? What kind of god forsaken place tells their customers that after being ignored by the waitress and serving our food late? Unless you speak Cantonese prepare to wait forever for your food and watch others get served before you. I would rather eat dog food than come back here."}
{"text":"Summary: Wok Wok is a local favourite. It has great value and good food. However, it cuts corners on everything else. 

Rating System: 
Value: 5/5
Cleanliness/atmosphere: 3/5
Service: 3/5
Quality of Food: 4/5
Innovation: 1/5

Value: Barely anything on the menu crosses the $10 mark. Each dish comes in huge servings. They also have a line up of dishes available for their lunch special. For around $5.25, you get a drink plus a main entree dish. Wok Wok offers great value, there's no denying it. 

Cleanliness/Atmosphere: the tables are always clean. The grounds aren't sticky. But you'll be hard pressed to say the place looks good. That's because it looks like a run down Chinese diner. The seats are cushion seats with some wear and tear. The walls are yellow with menu items in colourful slips plastered all over the walls. The decorations are non existent and in the centre of the restaurant, they keep all their plates and bowls on a dining table. All in all, this isn't a place you'd feel comfortable hosting any sort of occasion. 

Service: over the years of coming here, I've hard quick service and I've had slow service. I've had good services and I've had terrible service. It's very inconsistent. Which is very odd considering it's the same person every time. Sometimes she smiles, sometimes she scowl. It's pretty hit or miss. 

Quality of Food: as far as traditional southern dishes go, I would say the quality and authenticity of the food served here are very good. The quality is also very consistent. It certainly holds a candle to restaurants with a much higher price point. 

Innovation: items served here are standard. The ingredients they use for dishes are standard. The menu never changes. Nothing new is ever offered. There's nothing special about anything. There are no house special items. 

Conclusion: I like Wok Wok a lot. It's one of those places that will always have me as a customer. However, I would never drive out to eat there. I would celebrate anything there. Much like their entire value proposition, I eat there when I'm in the area, and when I want to do nothing else but eat."}
{"text":"The service was okay, could be a bit faster but the owner (I believe) was very nice and friendly, I liked her. 
The lunch special was $6.30 total with a choice of either soy milk or soup for free, or an additional $0.50 for cold soy milk or soda.  
Food could've been better though, my friend found his curry chicken rice okay while I found my shanghai fried noodles lacking, unfortunately.  

A major downfall to me was that they only accepted cash, which I don't carry all the time."}
{"text":"You will like Wok Wok Restaurant if you are looking for some cheap and comforting Chinese food..

You know that kind that are sinfully oily, fattening and high in cholesterol!

$5.50 all day specials with choice of drink (milk tea/coffee/soy bean drink/soup of the day)

Wok Wok is definitely a hole in the wall, in need of renovation. 

Beef with Rice Noodle ($5.50) with Milk Tea was A-OK at least it was made to order not like the one that were sitting under the heat lamp at hot food table in various supermarkets!

Parking is a nightmare though.. I just hate that parking lot! I ended up parked at level 5, but I guess was good to walk off the calories from my lunch!"}
{"text":"Massive portions for the price. Quality of the lunch specials are really good. Service is average, but is on par with most chinese restaurants."}
