{"text":"It's a typical Chinese eatery that serves solely noodles along with a variety of toppings such as wonton, shrimp wonton, sliced beef, cuttle fish etc. Definitely one of the best shrimp wontons I've tried. You can combine it with yellow noodle, vermicelli or rice noodle. Its cheap, yummy and great if you're planning for a quick bite. If you're a fast eater like me, guaranteed you'll be served once you sit down and finish your bowl of noodles within 10minutes max! It gets quite crowded during lunchtime so be warned."}
{"text":"I LOVE THIS PLACE. I have been going to this place for wonton noodle since mid 2000s. And I got to say, they offer the BEST wonton noodles ever. If you were to offer me free ramen from some high end ramen place or this - I will pick this place over anywhere in a heartbeat.  The wonton/dumplings are hand made in front of you, their kitchen is open concept so you can see what the chef is doing. Their wonton./dumplings are huge and their rice noodles/egg noodles are chewy and tasty. The soup base/broth is light and not greasy at all with great flavors. Their style is the traditional HK style and I have to say , it is extremely close to the ones I have in HK. Don't expect high end service here because the follow the traditions from HK..for example, you have to walk up to the counter and pay for yourselves. Otherwise, i always have noodles here:)"}
{"text":"Disclaimer: I am an American girl from New York Queens area and this is my first time to Toronto.  My Canadian Chinese boyfriend is introducing me to his family and all the wonderful authentic Hong Hong Chinese cuisines.   I've had my introductory lectures from my boyfriend about the difference between \"Chinatown kitchen\" wonton and the real deal.  The real wonton soup is supposed to be brewed from shrimps shells and free of MSGs.  From the wonton skin and shrimp, pork, and everything...etc.  I did my best impression of a open minded cultural girl friend but deep down I though yeah right...   Well, he was right!  My god, I've never ever tasted any Wontons and Dumplings soup noodles like this.  The thin but slightly chewy skins and the rediculously bouncy shrimps.  Holy!  I have to respectfully disagree with the couple reviewers here.  I think the noodles were wonderful.  Maybe they are so used to such high quality food therefore the expectation is much higher.  However, for a peasant American white girl such as myself, this is amazing!   I've never liked the NY wonton noodles because of the sogginess, the slight hint of alkaline...etc. I swear the noodles here has none of the above mentioned issue but with the right amount of chewiness amazingly.    It was too bad I was not impressed with the boiled veggies dish and the fact they don't serve ice water didn not help.  I hate Nestle bottle water because it is nasty and ruins the food taste. Of course I did not tell my boyfriend haha.   I am a fan now!   P.S.  the bathroom was clean and the serving lady was very pleasant and kind."}
{"text":"Growing up, whenever my grandparents or parents took me out to dim sun or lunch they knew that the best way to keep me happy was to order a big tureen of wonton noodle soup (to be shared with everyone, but inevitably I would eat about half of it!). In my life I've had a lot of bad wonton noodle soup, and a precious handful of excellent bowls.   I can always expect a great bowl of wonton noodle soup at Wonton Time. It's a bit out of the way for me to go up to Market Village, but once every few months when I get a craving I'll either come up here myself or ask someone to grab some take-out for me.  Their portions are generous - 4 golf-ball sized shrimp wontons (no pork, green onions or other fillers here - it's pure shrimp!)  in a bowl of noodles for $4. If you want an extra potion of noodles it's $1 extra. The broth is delicious - and not too heavy with the MSG (i.e your throat is not parched dry 20 mins after you've left the restaurant). You can order a plate of Chinese Broccoli (Gai Lan) for $1.50.   They also have other dumplngs (sui gau), beef tendons, beef balls and whatnot - but as their name states, their wonton are their best menu item. They are made fresh in-house - in fact sometimes you'll see the staff wrapping them if you come on a quiet afternoon on a weekday. Their wrapping speed and technique is quite mesmerizing!  The service is speedy and to the point: they direct you to any free table, bring you tea, take your order and when you want to leave you just bring your bill to the cashier and someone will cash you out. The seating and tables are not the cleanest, but at least there's a washroom for customers (that's decently clean by Chinese restaurant standards) and I'm never here for longer than 30 minutes anyhow so I can turn a blind eye.  Over the past few years, relatives convince me to go out and try wonton noodle soup at this or that restaurant... and inevitably I come back here because I know that I will not be disappointed and always leave satisfied."}
{"text":"This place is a hole in a hole in the wall. Market village is not a popular place and wonton time looks deceivingly average from the outside.  What is amazing about this place is that it only specializes in noodles with soup or Lo mien. Each bowl of noodle soup is $5 and the portion, while not big, is decent. Flavour is ok and there are better noodle shops out there compared to this place. But where wonton time excels is awesome value for money!"}
{"text":"Since I live in Orange County (California), I've been pretty deprived of good Cantonese food in general, and in particular, good Cantonese noodle soup (or to be exact, noodle in soup).  This place is a no frills, sort-of-hole-in-the-wall place inside a busy Chinese mall (Market Village) that serves nothing but Cantonese noodle (in soup, or soup on side) with various topping choices (wonton, shrimp dumplings, HK-style fish balls, etc.).  The noodles are as authentic as they come - chewy in texture, and the prices are reasonable (basic noodle in soup with one kind of topping costs about $5.50 per bowl).  I ordered the HK-style fish balls lo-mein (the kind that's served with soup on the side, rather than in soup) and it is the best of its kind that I can remember in a long while.  I liked this place so much that I was here twice during my 15-day trip to Toronto."}
{"text":"Delicious shrimp wontons! Each bite is full of shrimp that is perfectly cooked. For the price of these, you definitely can't go wrong. Ps. Love the chilli oil too"}
{"text":"Located in the Market Village mall, this sparsely decorated noodle house with service to match, is one of Scarborough's hidden gems.  I have had  their signature dish, the wonton noodle soup, multiple times and I can say without a doubt, this is the best tasting wonton noodle soup I have ever had.  Ever.  Period.  If you are looking for \"authentic\" shrimp/pork wontons, this isn't it.  Instead you get four large shrimp filled wontons in a soup that is unmatched.  They know their soup is so good, it's even offered as a menu item.  Combined with fresh noodles and you definitely have a winner here.  A word of advice.  Those with low-sodium diets need not apply.  And bring tissues if your nose tends to run while you're slurping a hot delicious soup.  An unfilled-to-the-top  plastic cup of Chinese tea is standard with each meal.  This tasty $5 meal/treat will indeed have me returning again and again and again.  Occupying the #1 spot on my Wonton Noodle Soup list, their offering is simply as good as it gets and so this restaurant manages to snag  my first Yelp 5-star review."}
{"text":"I've been around the Market Village/Pmall area for food many times, but never actually came here because there are so many options nearby. Decided to visit since my first few choices were not open.     Ordered the lo mein with beef brisket and wontons while mom ordered cuttlefish ball & beef brisket noodle, and brother ordered wonton noodle. Other than the food arriving relatively fast, it was disappointing. The beef brisket was too tough and chewy, while the wonton was quite salty. Similar story with the broth, which had quite a bit of MSG (i'm sensitive to it so I know when I taste the broth).      Pay at the front after you're done with your meal. Seating is decent with many tables, and prices are relatively reasonable with most at ~$6-$8. However its hard to pick this place with so many alternatives available."}
{"text":"It's a mystery to me for why I've never eaten here in all my years in Scarborough. However, with Market Village being replaced by Remington Mall, my friends and I decided to give it a go this weekend.   We ordered a lo mein with beef brisket and wontons, a noodle soup with dumplings, a noodle soup with beef brisket and wontons, and a plain ol' wonton soup.  All the items have a similar composition; you get the same broth, you choose your toppings, and you choose your noodles (skip this if you're just getting soup). Therefore, I suspect that if you don't like the soup, you may not want to bother trying another dish because it will taste more or less the same. There is a small chance of this happening, however, because the broth is so light yet flavourful that it's hard to imagine anyone being intolerant to it.   When ordering, you will also get to choose your choice of noodles (egg/rice noodles).  I highly recommend getting the rice noodles as they soak in the flavour of the broth very well and enhance the dish with their soft, slippery texture.    Furthermore, everything is priced between 5-8 dollars, so with their medium-sized portions, you will get a fair price to portion ratio here.  You won't break the bank, even if you decide to order two dishes for yourself.  Just keep in mind that you will get 3-4 wontons/dumplings in the noodle soups and lo mein, and you will get 5-6 wontons/dumplings in the soups.  Their wontons and dumplings are decently sized, but I believe that the cooks are a little stingy with the low number of pieces that they put into your dish.  I mean, it's always a little disheartening to eat a dish that is 90 percent carbs with little of everything else.  The dumplings and wontons are definitely show-stoppers here. There is nothing disagreeable with the wontons and the dumplings have so much mushroom and skin that they have an adoringly juicy and slippery texture.  Just note that some people may not like the dumplings because, like my bf, they may not be mushroom lovers.   I really wanted to love this place, but there are a few red flags that I just can't ignore. Firstly, I found plastic in my noodle soup last weekend. I assume that it came off of the package for the noodles. Combined with the dirty washrooms and the unkept furniture, I honesty don't think you should expect much from their food handling standards.  Secondly, unlike the dumplings and wontons, the noodles taste and feel cheap, making it very likely that all the noodles are packaged and ordered cheaply in bulk.  I'll give them a thumbs up for their light, heart-warming broth and another for their dumplings that appeal to mushroom lovers like me. However, I will probably not return; my stomach churns at the memory of scooping up the plastic from my soup..."}
{"text":"Located within market village beside the pharmacy and grocery store, this dinky but long lived restaurant serves as a great place to enjoy some yummy, comfort food.   Their menu is small but straightforward. You can get noodles in soup with different toppings such as beef brisket, shrimp wontons, dumplings, fish cakes, etc. You choose your own type of noodles, they have rice noodles, egg noodles and vermicelli. A bowl of noodles will set you back about 6-7.50 dollars depending on what you get.   The food came relatively quickly and it was just a great dish that warms you up on a cold, rainy day. The beef brisket was tender, and the wontons were packed with shrimp. The broth was also delicious and not too oily.   Check this place out if youre looking for a quick bite to eat and got a few bucks to spare."}
{"text":"Both Pacific Mall and Market Village are very Asian, but Market Village is entirely Asian. From the time I went in to Wonton Time until I left, I only heard and spoke Cantonese, which is tough because my Cantonese is really bad.   Since we came in for a 2pm snack, we wanted to split 1 order of shrimp wonton. However, I'm was able to point to the menu and say \"1 bowl\" with enough conviction that our server let it happen, and we got what we ordered. Service was quick, and we got large wontons filled with shrimp in broth. It wasn't anything special, but no complaints."}
{"text":"I have eaten at this place a number of times (delicious, large wontons in great broth) and always enjoyed it.  They sell them uncooked as well, so I bought a dozen large wontons today, and 2 egg noddles ($9 plus $2 - very reasonable.  Went home, waited for water in pot to come to high boil, put them in.  I thought I overcooked the wontons (when they floated, i turned heat down and let them cook a few more minutes) but they were delicious, with \"bouncy texture\".  The egg noodles, cooked for a few minutes in same boiling water, were good as well.  I live downtown but worth the drive to Markham, for great authentic Chinese wontons,"}
{"text":"I order a fish ball noodle. Fish ball is too small. I added extra noodles and it didn't look like it. Overall don't like it."}
{"text":"Being from Flushing, NY, I love how this is a place with good quality food and it's cheap.  I got the 3 combo meat -- beef, shrimp wontons and fish balls with my egg noodle soup and I love how the broth wasn't salty, it was a plain soup with noodles and toppings.  Today, on this Christmas jolly cold day, my fiancé and I walked to the restaurant and ordered one portion of that to share and it decongested our nose and warmed our feet up.  $7.25 for the combo, with tax was $8.16 and after tip, it's $10.00 which isn't bad.  I'd recommend this place to family and friends!  Though, the decor of the place isn't modern, it's okay."}
{"text":"By far my favourite place to have Wonton Noodles! I've tried them all in Markham, and some are really good, but here, they got it all together. It's literally just a tiny place inside the Market Village. Might not even notice it walking by since it's so beaten down looking, but it's actually very spacious inside! You can easily park in the back alley of the plaza since there's an exit right next to the restaurant.  The wontons are packed full of shrimp and still has that \"Bouncy\" texture that chinese people really love in their wontons/ shrimp balls. The noodles are a great chewy texture too and not all stuck together from being pre-cooked or anything. Honestly, most of us had to get a second bowl. I love that they let you choose 3 toppings in a bowl so you can try a bit of everything with your noodles.   This is the place to go everytime you got a craving for wonton noodles! Great price, great food!! be sure you try the chilli oil and the red vinegar with the wontons. It really makes the dish taste all the better!  Arh!! Now I want wonton noodles. Really shouldn't Yelp if you're hungry. haha!"}
{"text":"Cheap eats that are hidden away in Market Village!! They messed up my order (switched the wontons around for each bowl) but the server noticed and took it back into the kitchen immediately. Overall, decent price and food's ok. Not amazing but it'll do."}
{"text":"I agree with the sentiments of the reviewer that said there is lousey service.  We had to come here at one point because our fav dim sum place closed down and didn't offer dim sum.  Left to our own devices we came here for a period of time.  The owner (guy with longish hair and glasses) never smiles and is indifferent to customers.  His wife is really no different though Ive never been there when she has been present but my family has.  We were regulars but you'd think the owner would acknowledge us somewhat but never.  We were just talking about it today, the servers at this place were more friendly than the owners.  We stopped coming here after our fav dim sum opened again and we're glad we did.  One of the servers there was really nice to us and one time she saw us somewhere else, she told us basically after working there for years she was just 'laid off' without so much as a thank you.  They cut her hours to a point that it was pointless staying there.  I think all the regular servers are gone and now all that's left are cranky indifferent staff at a typical chinese restaurant.  Take your money else where, it's not like the portions are great for what you pay."}
{"text":"I think Wonton Time has changed management, because the menu is bigger, and there is wait staff services.  A waitress brought me hot tea!    I ordered a wonton soup noodle ($5).  It was good.  The broth was so tasty that I almost wanted to drink it all.  There were 4 wontons.  They were big, tasted fresh and had quite a few pieces of shrimps.    Of course, with wait staff services, I tipped.  This is a good place for a simple lunch."}
{"text":"Does anyone know where this place has moved to?  They had the best hot oil.  Appreciate it!"}
{"text":"I'm so glad there's no review here about how horrible it is that you have to share table with strangers. That's how good the place is. Don't expect the western high class restaurant service here, because that's just not how they roll here. Think American Diners. 99.9% of the time I would not touch the soup when I eat out, but these guys do their soup base right. How do I know? I was drinking it. Their food has a good balanced taste, and generous in size, that's just old school Toronto. My wife likes the other famous wonton place in the GTA, but I just don't like the fact that I almost always ended up with one that had shells in it. Not this place."}
{"text":"The best wonton noodle soup in town! Hands down! $5 for a bowl of egg noodles with some wontons and broth, what a bargain! They don't skimp on the wonton fillings either. You can see the pieces of lump shrimp in them. Also because it's so cheap, I'd opt for extra wontons or get another bowl such as their beef brisket. They also make it fast. Simple menu, but with a name like Wonton Time, what more can you expect? They do wonton right!"}
{"text":"WONTONS that are the size of your fist?! YES PLEASE! After my GPS sent me on a wild duck duck goose chase i finally found it! it is sort of in the middle of nowhere considering I am not from the area...or anywhere close at all..  This magnificent ball of glory is like the king of all wontons. Inside of each bite, there are whole bunches of fresh shrimp pieces. The wontons I had in NY are all just meat based with bits of shrimp that are frozen. Ever since i got here, i been having this almost every day! Their special wonton dish is made daily so they will ensure you that it is fresh. you can also buy their wontons frozen too to cook at home but unfortunately it is prohibited to bring these back to NY to share with others. The sauce though you can bring home! I really dont think the sauce is necessary becasue i enjoy the natural sweetness of the dish. It may compliment it but i prefer the sweet taste on its own. For its price i would not cry about ordering 2 bowls in one sitting. plus its so delciious that you wont regret it. Staff is extremely interactive with customers which is a bonus! Would highly recommend to eat at this place."}
{"text":"Best wontons in the area, hands down! Plump juicy shrimp with a choice of noodles. Other toppings too but I always go for the wonton. Pretty cheap, cash only ,of course. Add a side of veggies for a decent meal under $10."}
{"text":"Actually not bad.  Prices are fair for the portions you get but then I don't eat a lot soooooo.. If you get full if you eat [an equivalent of] 3 burgers then this is the place for you. The flavours aren't bad either [they trump a lot of pho place in the vicinity for taste]   This place honestly has an approximately 10 options - it's a simple & quick lunch.   Bee brisket, wonton noodles, & the vegetable dish = $14."}
{"text":"This place back in the early 2000 was much better tasting according to my memory.  The squid and fish balls were larger and better tasting.  Same owner, but the place looks \"tired\" if you know what I mean.  Such a shame, I really enjoyed their noodle back then."}
{"text":"Just want to update on Patty L review on Wonton Time.. the veggie with oyster sauce is no long at $1.50, made that $3. I would have give Wonton Time at least 4 stars if not for the veggie I ordered.  The wonton and fish ball rice noodle I ordered tasted pretty good. 3.5 stars... The shrimp in the wonton is freah and have a great bite too it.   However the veggie I ordered it was full of sand!! crunch crunch crunch! I just could not make myself to eat that and that little plate for $3 and has sand all over it? BTW, if you want to have veggie go for lettuce since at least there won't be sand in between the stems.  They were really nice when I told them about what's wrong with my veggie.. and they apologized and took that off my bill.  ** My boyfriend after hearing my story went there and order the same veggie again and have the same problem the next day!! (gee now I know he never listens when I am talking!!)  So please stay away from that and it will make it an excellent wonton noodle experience!  They accepts Cash only!"}
{"text":"A quick cheap bite in market village.  Noodles are really like hong kong style el denteThe wontons are descent size and full of shrimps. Also tried their real fish balls,which u can really taste the fish. There was a little bit too much msg in The soup base.  I would recommend it if you want something cheap and super fast."}
{"text":"This is my favorite spot in town for a bowl of authentic Hong Kong style wonton soup. Big size wonton and all natural ingredients. The best is their cuttlefish ball. Very tasty."}
{"text":"Love the wonton at this place. They're massive and they don't leave any shrimp unpeeled either. The portions are decent too for the price. the vegetable lomein was delicious too. This place doesn't have much variety or atmosphere but that's okay for the price."}
{"text":"If there is any place if not traditional or closest to it for wonton noodles, this would be the place. I had the Shrimp Wonton Noodle and the wontons (four in each bowl) were packed with shrimp and the noodles were freshly made. Adding a bit soy chilli to it was a good mixture for a hint of spice because it can get really spicy and sweaty but can always request for more tissue as they are friendly servers.   Served in fairly medium sized bowls and is comfortable spot to eat and kill time or as a fast meal. The menu is pretty straight forward can choose from Lo Mein to Noodles in soup with choice of noodles such as egg noodle, rice noodle, or vermicelli with either sliced beef or beef balls, cuttle/dace fish balls, or shrimp wonton/dumpling etc. Price range (~$5.75-$6.50) is a little pricy for serving size but can definitely make up for quality. The shrimp wonton noodles hasn't let me down!"}
{"text":"Located inside Market Village near the grocery store at the back of the mall  My family and I were craving for some wontons after coming back from HK. After seeing decent reviews about this place, we decided to try it out. We ordered the veggies, wonton noodles and sui gao noodles. Veggies with oyster sauce was decent, typical veggies. Maybe I was lucky but I didn't get any sand like what Jennifer was mentioning. The wontons were okay but not spectacular. The big disappointment was the sui gao. They were larger than expected but once you take a bite, it falls apart. I've never had that happen before.   Overall, whenever we do have a craving for wontons, we'll be sticking to Wonton Hut."}
{"text":"This is one of my favourite places to get wonton soup. Their broth is very hearty and is great for a coldawinter day. Also, the waiters are quite attentive and the food is quite inexpensive. I recommend getting the wonton soup because the dumplings are bouncy and delicious. The noodles are great too. If you are stopping by this area and want a cheap but warm meal, stop here and give it a try!"}
