{"text":"The peeps at the famous Woody's burgers decided to give the burgers a rest for a minute and opened up a brand new sandwich shop right next door to where they live.   Woodfire Sandwich Co, is a small takeaway joint with a chalkboard wall as a menu (and what a menu!) consisting of a delectable assortment of Sandwiches, salads, sides, and BREAKFAST options. The breakfast is only available on the weekends, but the rest is all day erry'day!  I asked about the top recommended sandwiches and was told that the top three would be: Cuban, Brisket and Date Night. I opted for the cuban with a black cherry Boylan soda!  The Cuban was a hefty size and before I opened the wrapping paper it was already dripping. This was a bit different as in my experience any sort of Cuban sandwich has a signature crispy toasted outer layer. Now the flavours were incredible, a great sauce, tons of pulled pork BUT if I'm being honest, aside from the pickle slices and pork and I think bacon, this was more of a pulled pork sandwich than a cuban. I was really missing the mustard and the crisp of a panini pressed crusted sandwich with a signature crunch. This was super sloppy, delicious but sloppy.  I'm interested to come back and try a couple others, they all sound great but I think I'd wait before having the cuban  Eatcrest Out"}
{"text":"I finally got around to trying this place. I believe it's the sister restaurant to the burger place next door.  Our two sandwiches were the Cuban (which has pulled pork) and the Hero (which has a variety of spicy meat meat). We also got a side of fries & a pop to share and this came to $27.  My Cuban was pretty good, although it was slathered in so much sauce that the bunch was disintegrating as I finished it. The Hero was better in how it kept together, but I think we both expected more as it really was akin to a fancy sub.  For the price, you really can't complain - it's comparable to any walk in sub place. The fries were heavily seasoned, fresh and crispy.   It's a small place with only three stools, so it's safe to say that it's meant to be a take out place.  I'd certainly go back, but I don't think I'd go out of my way to do so."}
{"text":"Nice addition to area. Buttermilk chicken excellent, way too much sauce (only negative). Meatball also very good. 21 bucks for both. The request for tip annoying. Expensive enough to eat out."}
{"text":"With this, my 400th review, I was hoping for something a little more special than a sandwich joint, but when the opportunity arose to finally check this place out, I couldn't say no.  We decided to share a couple of sandwiches:  First Date (\"slow cooked roast beef, fried onions, creamy gorgonzola, sauteed mushrooms & arugula\"): When we first got this thing, it looked almost intimidating in terms of the amount of meat contained within. I was worried that the plentiful roast beef would be the predominant or, even worse, sole flavor in the 'wich, but that turned out to be a needless concern.  This is a really, really good sandwich. All the components work really well together, and each bite brings a new, delicious surprise. As for the meat itself, it's super tender and flavorful. All in all, I'd say this was one of the best sandwiches I've eaten in quite some time.  We also ordered the Southern Fried Chicken (\"buttermilk brined chicken breast, romaine lettuce, tomato, dill pickle, sriracha mayo on a brioche bun\") but this turned out to be a bit of a problem. We didn't receive the sandwich until more than a half hour after we'd ordered it had passed. At least, though, when it was brought out, the cook apologized profusely and even gave us a free order of House Made Chips (which were quite tasty).  It's a decent yet somewhat disappointing sandwich. The fried chicken became a little soggy when faced with all those accompaniments, while none of said accompaniments stood out in any impressive or real way. It's all just so bland. I didn't mind eating this, but I can't say I enjoyed it on any real level.  But that roast beef concoction... Ohh, that made it all worthwhile."}
{"text":"Good stuff for sure. Went here with two other folks and got The Cuban, Fried Chicken Sandwich, and the Yam and Beet Sandwich. All were solid. The Fried Chicken Sandwich was smaller than the other two but the flavour was on point. The Cuban was a bit messy but it's a sloppy delight. The bread is what truly takes the sandwich to the next level. I believe they source it from SanRemo which is one of Toronto's best bakeries.   It's a small place with like three stools so don't go there for a sit down experience. Good for takeout. Overall, I definitely recommend it to switch it up when it comes to lunch and I'll definitely be back to try some more items."}
{"text":"I was waiting for this place to open... and it finally is. I just grabbed the Cuban from there, and it tastes great! The sandwich bread is a little soggy, but the crust of the bun kept its integrity and is delicious. The portion blew my mind... if it's like this all the time with this and other sandwiches, I'll definitely be bringing some people there with me. Good job guys!"}
{"text":"not a fan, and this has been along time of issues.  was very happy to see this establishment take this vacant space in this plaza. with an opening date of new years day(2018) I was very excited to try this place out for dinner that evening. we arrived at 7pm to the shop being closed, what was even worse was they were only open from 9am-5pm as a trial run and not open under full operation until January 5th 2018...forgot about this place for a couple months and then on Thursday we decided to try it out.  not much to see on the inside, just a counter, a milk serving area, two stools and a bench that is not level or secure. the lady at the counter was pretty nice and patient, not only with us, but also other customers that were in line and waiting. we placed out order for five sandwiches, which covered pretty much all aspects of the menu.  we were told the wait would be about 15 minutes wait for the order, which was totally cool. as we were waiting I couldn't help but notice the front door makes a terrible banging noise when it closes, its honestly so loud that I jumped every time someone walked in or walked out, also couldn't notice the cooks in the back not wearing any hairnets, gloves, and one cook was even wearing a set of DJ headphones. the music was really good while we waited for the sandwiches to be made. after sometime and dealing with another customer complain about their kid being a brat. we had our food and checked out the bag and order to find that a sandwich was missing. this got corrected right away. and we went home to eat our food. when we got home we distributed the sandwiches and one of the sandwiches I pulled out was not wrapped properly which resulted in us almost losing a sandwich completely.  as per the food, the veggies on the sandwiches were very fresh, the sauce was not house made, the meat was bland, and the worst part of all was the bread. the bread was so stale that it actually cut my lip when I went to bite into the sandwich and caused me to bleed from the roughness. to say that I am less then impressed about this establishment would be an understatement. based on all of the factors into one, I will not be coming back ever again.  ***checked out the website and it says they have been making sandwiches since 2016...but have been open since January 2018...? not sure where the discrepancy is, since this is the only sandwich shop under this name...*   if I could vote zero stars I would, at least the lady at cash was nice."}
