{"text":"The food was absolutely horrendous. Ribs were mushy, the dry rub was gritty, coleslaw tasted off. Will not return."}
{"text":"Very simple equation. Good meat + mac & cheese + cornbread + bbq sauce options, hard to go wrong.

Hip barn style finishes, pleasant service and a packed house on a Friday night, will definitely return.

Similar offerings to Proper Pig with the plus of a more full service bar/restaurant."}
{"text":"Amazing food and excellent service! There are 20 beers on tap that rotate frequently so there is always an awesome beer selection and the Oh Honey cocktail is to die for. Their bourbon selection is extensive and reasonably priced. The brisket is by far my favorite meat but nothing on their menu will disappoint. I recommend this restaurant 100%!"}
{"text":"Woodstock is way better than Proper Pig. 

The brisket was cooked just right, and the hot BBQ sauce is quite good. 

As someone that lived in North Carolina, this is the closest BBQ I have found in quality since living down south. 

I will certainly be back."}
{"text":"I wouldn't call myself a BBQ snob, but I also wouldn't be offended if someone did. Approaching the front door the smell of BBQ floats through the air! The inside is rustic, retro and comfortable. I've been some of  to the best places Austin, Nashville, and North Carolina have to offer and this is worthy of a comparison. The brisket is the best I've had in the city that has recent experienced a BBQ boom! Tender, juicy, great all-wood smoked hickory and oak flavor. The peppercorn dry rubs adds a great flavor on the crust and the lean fat melts in your mouth. The platter comes with amazing horse radish pickles, pickled onions, and homemade cornbread. Service is polite and quick, being as it just opened today I hope that remains the same. Plenty of great beers and ciders on tap from local and regional brands. Come alone, come with friends, get carry out. It's legit."}
{"text":"The only reason I'm giving this place a two star is because the lady serving us was pleasant.
Other than that, everything was very bland, and it felt like everything has been pre-made and sitting under a warmer (except for the corn bread, that was cold when it came out, not to mention flavorless!)
I wouldn't recommend this place to anyone, which is disappointing considering we live close by and would have loved to find a BBQ place near us!"}
{"text":"Friends and I came from Catawba Island Port Clinton Area to visit a friend and go to a near by pub to see a band. We shared the tacos. We had one chicken, one pork and one brisket. They were delicious. We also order three of the four meat platers. I'm a vegetable kind of guy and enjoyed the sides. I tried them all... collared greens were surprisingly awesome! I also enjoyed the meats! The brisket was melt in your mouth. We met the owner after dinner. We had a nice chat about the Lake Erie Islands which he is very familiar with. He told us about how they smoke their meats. Very cool guy!"}
{"text":"Best place in Lakewood to go on your first Bumble date. 

Great BBQ, atmosphere and prices. You'll want to get the mac and cheese if you appreciate the finer things in life. 

If the date goes well, you can head next door to Bottlehouse for a drink or two to keep the conversation going. 

If the date goes terribly, definitely still go to Bottlehouse to try to forget it ever happened."}
{"text":"I wanted to love it or even like it but none of those happened.  We ordered 5 meats and 4 sides so that we could have many choices to decide upon our favorites.  First off, the turkey was almost inedible.  The odd seasoning didn't allow me to even finish one slice.  The brisket had almost no flavor and was full of fat and the same goes for rib tips.  The larger ribs lacked flavor. The pork had the most flavor of all the meat we tried but, again, it was fatty.  I don't know what their cooking methods are but I would guess that they boil the meat before smoking it.  When meat is smoked for a long time, flavor develops and the fat melts away during the slow cooking process.  There was way too much fat in the meat and the lack of flavor makes me believe that they are boiling it.  Good barbecue is flavorful and delicious. This was not.  Our sides were collard greens which were okay, mac and cheese, again, just okay, house slaw, okay, and corn bread which was delicious.  Yes, delicious!. 

The decor is really appealing and creatively done.  

We didn't complain about the food because we realize that they obviously think it's great or they wouldn't have the restaurant.   

The bathroom floor was clean but not the toilet or dirty, slow draining sink.  There was dirt around the faucet and around the sink that obviously had been there a while. The dirt around the faucet would need weeks to get that bad, so I cleaned it, and the garbage can lid was filled with dust and dirt--gross, I wasn't touching that.  

What does the kitchen look like?

We all agreed that this would not be a place to frequent again.  And sadly, I cannot recommend it."}
{"text":"After a friend and I began a trek toward Lakewood, we both had a taste for BBQ. Yelp gave us the closest places to where we were and Woodstock had good reviews, so we decided to give it a shot. After incredibly fast service, I tried their 2 meat combo with Mac and cheese. Easily one of the best macaroni and cheeses I've ever had. Then, in addition, the ribs and brisket was incredible. Came super fast and tasted wonderful. I'm not a avid yelp reviewer, but this place deserved my time to recommend. Give it a shot! You will NOT be disappointed. It's amazing!"}
{"text":"The dry rub chicken wings were the best I've ever had. Prices were very reasonable and the staff was friendly and prompt. Overall a great BBQ joint."}
{"text":"Brunswick stew and chocolate cake are superb. Nothing on the menu is less than very good. The owner (Bobby) very personable. Prices $ are BETTER than reasonable! Winning atmosphere too! Wish he would open up another restaurant near my home!"}
{"text":"Drink menu is solid & prices are reasonable. The carnivore-side of the menu is really well-done. As they get the menu worked out, I hope they fix the side dishes. Mac-Cheese and cornbread specifically need tweaking."}
{"text":"Overall, the atmosphere in Woodstock is very conducive to a beer and done BBQ for those who are eating in. 

I ended up ordering some takeout this past Saturday and while the food was good, it wasn't GREAT in my opinion.   We ordered a brisket plate with cornbread and BBQ spaghetti.   I caused a momentary sense of confusion with the counter staff when I asked to order an extra half pound of brisket.   The staff member scrunched up her face and started to say \" We don't ...\".  

I'm sure my jaw dropping open must've alerted her that this was not a good tactic to try and she ended up selling me an extra half pound for $6 because they'll sell you a quarter pound for three bucks in some menu configuration.  

The spaghetti was cooked to a good al dente texture and wasn't mushy at all; however, the taste was a bit flat.  I fixed that by adding in a healthy dollop of spicy BBQ with a dash of the Jerk BBQ.  Perked it right up.  

The brisket was fine, not amazing.  

Overall I'd probably not return any time soon, but not because the experience was awful.   Moreso that there are other places in town that do it better at the same price point."}
{"text":"Love, love, loved Woodstock! My fiancé and I had an excellent experience here on Saturday. The service was prompt and friendly, the drink selection was great, the food was delicious, AND it was reasonably priced! The space is really cool, and I loved that they're able to open up the big door/windows so you get the lovely breeze from outside. I got a cider and my fiancé got a beer, he got the brisket sandwich and I the two meat platter, with brisket, ribs, and coleslaw. I highly recommend it all and I'm sure we will be back soon. 

One star off for a couple reasons: 
1. While the sauces were great, I wish there were more options. A mustard based one would be great, or maybe even a spicier one!
2. Both the ribs and the brisket were crusted with a peppercorn, maybe? There was waaaayyy too much pepper. It was too overpowering. I could basically only use the sweet sauce to cut how peppery it was. 
3. Coleslaw was a little bland. Could use more mayo, or (funnily enough) pepper."}
{"text":"Best BBQ I've had in NE Ohio.. and it won't cost you an arm and a leg. I'll take friends and family there over Mabel's or Proper Pig any day. Try their ribs you won't be disappointed."}
{"text":"Service was very good. I had woodstock tea veryngood. My partner has Mojito he said was very good not as sweet as others hes had.
Stiffed jalapenos topped with bacon. Flavor good, filling good kinda cream cheese with herbs. Nice smoky flavor. Thin bqcon on top like pre cooked bacon slices...
Ribs with slaw and baked beans, partner got smoked wings mac n cheese and collards.
Ribs: rub was bitter...too much chili powder. Needed little brown sugar to finish them over cooked. Slaw was refreshing vinegar slaw not heavy mayo. Beans were very good as well. Housemade pickles.and pickled onions. Delicious. Spicy sauce and sweet sauce were both very good. 
wings were terrible....they were smoked then fried....rub on tbem was BURNT and.bitter aweful flavor. collards were bitter and mac and.cheese dry and bland."}
{"text":"Really great place. Food is very good, service (younger girl with nose ring) was awesome. They have seasonal mixed drinks and great beer choices. MadTree Brewery was set up the Friday I was there. Good atmosphere. They were playing ska/pop-ska music when I was there."}
{"text":"LOVE. Got the dry-rub rib tips, cornbread and coleslaw. Ribs didnt even need sauce they were so good! Service was fantastic, drinks were amazing (had an old fashioned, it was made really well! )  wouldn't have known they just opened Monday if I didn't ask.  Exceeded my expectations for sure, will definitely go back!!"}
{"text":"Excellent beer selection, attentive and friendly staff, wicked fast service, good food, reasonable prices."}
{"text":"Delicious! This new BBQ in Lakewood rivals some of the best we have ever tried. In fact it might be the top 1 or 2 slot.  We tried the brisket plate and loaded BBQ pork fries. Pulled pork was great! Brisket was great! Beer is cold! You need to be here. Stop what you are doing and get to Woodstock!  Let there be meat!"}
{"text":"I really enjoyed my experience here. I went here with my boyfriend last night - mostly because it was the only place on the block with electricity. Everyone else had that idea too because the place was packed! I felt bad for our server because she was the only one working, and she was getting slammed. She did a great job of juggling everyone though, and eventually another server came in to help relieve her of some of the tables. 

The menu was limited because there was not much power, so my boyfriend got the pulled pork with a side of mac & cheese and I got the 1/2 slab of ribs. Both were soooooo good. The mac & cheese was to die for. The pulled pork was super tender, and my ribs were falling off of the bone. There was a distinct, smokey flavor to the meats that added so much punch to the flavor. I will say, though, that the sides were kinda small for the price. Other than that, it was amazing, and I really want to go back when there is a full menu available. Sidenote: I really wanted to try the cornbread but it was not available due to the limited menu :-( 

For a drink, I got the Fireball Sangria, and I will preface that with saying that I am not a Fireball person at all. BUT, this sangria was delicious. It tasted like a cider drink you would get in the fall - and it even had little bits of apples in it. A very nice touch. My boyfriend got their house beer, which he said had a smokey flavor to it and was also great. 

I can't wait to go back to experience the full menu."}
{"text":"The bad reviews here are either petty or so pretentious it seems like someone took a break from writing paranormal romance novels to trash a great bbq spot. Just moved back to Lakewood with my fiancé and our 2 year old. Not counting the great parks my son and I play in, Woodstock BBQ is the best part of my experience moving back to the wood. I don't care if my server doesn't smile or is vegetarian, if you put great food in front of me I am as happy as a clam."}
{"text":"I have been to this place twice and enjoyed my time there.  I know they try hard with their meats... But as hard as I try... It just isn't favorite BBQ.  Try it.  You may like it better than i did.  I found the dry rub ribs to be just too \"peppery\" for my taste"}
{"text":"We made this our choice for an unconventional Valentine's Day. I really wanted to fall in love with this place but alas did not. Walking in it has a warm yet eclectic vibe as we chose our seat. There were a few other table and a handful of people at the bar but I would not say it was overly busy.

Our waitress was prompt, almost a little too much making us feel rushed throughout our entire experience. She checked back with us several times as we were contemplating our drink and menu choices. We placed an appetizer order for the stuffed jalapenos which were pretty tasty. With the waitress lurking we finished them quickly and she swiftly took our empty plate. 

For dinner we opted to split a sampler of 5 meats and 3 sides . As she brought out our entree she also brought our check making us feel as if we should not order any additional drinks. As we divided up our plates she swiftly whisked away any spare in sight, meaning we did not get to try the pickles residing on one of the plates. While the food was decent the sides were not warm upon arrival. My favorites were the brisket and potatoes. Thinking BBQ I was hoping for a few more sauce options than the 2 offered. 

I hope this place does well but I think they still have a few points of improvement before I will consider going back."}
{"text":"Meat was cooked well, but served lukewarm.
Plus, when its listed as a \"plate,\" throw a side on there! Cornbread was kinda stale, but the $3 extra for a small cup of cold mac and cheese that should just come with the $11 plate was a real let down. 

Give some kind of deal! Even like \"add a side for $1 more.\"
If you're going to serve it on a giant platter, put some more stuff on there.
I make it a point to go to barbecue places in every city I travel to, and I can't think of any worthwhile ones where they didn't at least offer beans as an included side.
Make people feel like they're really getting a good deal and they'll come back. 

Soda wasn't great either. Lotta syrup, not a lot of fizz.

Hope they get things together, but I probably won't be back for a while."}
{"text":"Subpar. Thier drink menu I didn't find to be particularly appealing. I had the tacos and really thought they were oily and lacked seasoning. I didn't like the layout of this place. The patio is very nice though."}
{"text":"Great food and great atmosphere. Went here on a Friday night and had to wait for roughly 1.5 hours. Luckily they use the no wait app and bottlehouse is right next door. So we gave them our number and went and grabbed a few brews at bottlehouse which made the wait hobby that much quicker. Food is great. They offer meat sampler plates which are the way to go! Mac and cheese was awesome as well! Parking as far as I could tell was limited to street parking. Definitely will be back again."}
{"text":"The food is very tasty!! The service however needs some work. I understand it's a new restaurant but that's when you should be on your A-game! I would come here again but I hope that they clean up their act. They need to form a solid menu instead of having a different one everyday. Also I don't think they have air conditioning"}
{"text":"I came here on a windy Friday afternoon as their first customer and I was greeted by their bartender Christina. After I expressed it was my first time here, Christina assisted me with the menu which led to my choice of their three meat and 2 side plate with cornbread. As soon as I got my plate, I was presented with cornbread, fries, Jamaican steamed cabbage, smoked turkey, brisket, and 3 dry rubbed wings I bit into the cornbread and it tasted very good! I liked the fact that they put actual kernels of corn in their mix. After biting the cornbread, I decided to tackle the wings and I was also presented with three different sauces, jerk, spicy, and sweet. The wings were seasoned to perfection and had a nice crisp to them with each bite and I used each sauce for each wing and the sweet bbq was my favorite. After trying the wings, I moved onto the turkey and the turkey was pretty juicy and succulent and lastly, I tried the brisket which I thought tasted pretty good as well but out of all 3 meats the wings had to have been my favorite. As for my sides, the fries were good it's pretty tough to mess up fries in my opinion but the cabbage was delicious! I believe they seasoned them with curry and other spices but I really liked it. In conclusion I'm gonna give this place 5 stars because the food was great and nicely portioned for what you pay and the service was great, I will most definitely come back for a visit seeing that they're right up the street from where I live!"}
{"text":"Decent food, service is terrible. They're always understaffed and the setup for seating is completely unorganized. You might be walking around aimlessly for 10 minutes looking for a table before one of the servers seat you."}
{"text":"Came here last night for Valentine's Day. The space is casual which I liked. You walk in and see the bar and tables are in the back, you seat yourself. Their drink list is very good, the drinks are tasty and not overpriced. I got the pulled pork plate and bf got the burrito. Both were very good. The service was great. The food actually was very quick considering it was a holiday. I will definitely return."}
{"text":"Food and service is always on point here. The meats are smoked around the clock and taste incredible. Prices are totally reasonable too which is nice! Two people
Comfortably eat for under $25."}
{"text":"Stopped in for lunch today.  We were greeted and seated promptly by friendly staff members.  This is a beautiful restaurant cleverly decked out with original lighting fixtures, rustic wood tables and industrial themed chairs and stools.  Ordered the beef brisket sandwich, served promptly along with pickled onion slices and pickles.  The brisket was moist and delicious.  Add  your own sauce options include,  sweet or spicy.  My husband had the dry rubbed ribs and a side of cole slaw.   The ribs were moist and also delicious.  The cole slaw was crisp and flavorful.  
Overall, the perfect barbecue joint!  We will be back for sure!!!"}
{"text":"Flash back a few years ago and finding good barbicue on the west side was practically impossible. It's now 2018 and between here and Proper Pig you've got some pretty good BBQ spots in Lakewood. Woodstock did a lot to renovate this spot and it really shows. they have a nice patio and your typical BBQ restaurant decor inside. Good prices for the amount of food you get. I've been 3 times so far and I've never had a bad meal. The sides especially are fantastic and hearty. Pretty good beer/drink selection and large TV's for any game on TV. Do yourself a favor and check it out if you haven't already."}
{"text":"This was my second time going to Woodstock, the first time was after they first opened. Talk about night and day! Well the day is now! Fantastic food plus an excellent beer and whisky selection make Woodstock a must barbecue stop here in Lakewood. I won't get into the decor and service just suffice to say that both are welcoming and unique. Try them, you will not be disappointed."}
{"text":"I love this place--I'd highly recommend their brisket or ribs. This was my second time there and they've made some improvements to their sides (at least the cornbread and mac and cheese) since I was last there a couple of months ago. And the service has been excellent both times."}
{"text":"This place is awesome! I have only ever come on a Friday after work before 6pm, and the crowd files in right after me. They are doing barbecue right at this  rustic, modern rehab styled spot. They serve the meats on the metal tray, and their two sauces are really great too. They have a decent beer selection as well. You can get two or three meats with two or three sides which is plenty, and the prices are totally reasonable for barbecue!!! Great flavors, great sides, great beer, perfect pricing. Excellent job Woodstock, I'll be back again and again, why wouldn't I? Oh, and side note: the brisket melts in your mouth. Now that the praises have been sung from the highest peaks, I must deduct a star due to service. Long order waits, long check waits, these issues could easily be remedied by adding another body to the dining room and making smaller areas for each of the wait staff. The food is great but the service is beginning to gain momentum and take on a reputation of its own. You can do it Woodstock, I'm pullin for ya!"}
{"text":"Pretty good food. Stopped in for lunch one day to try it out. Was not a fan of their BBQ sauce at all (and I could LIVE on BBQ sauce). I would stop in again though. Their dry rub wings"}
{"text":"I liked the ambiance a lot. The cool Edison bulb lighting, the giant wooden Indian, plenty of space.

The menu is simple. The waitress was very nice and helpful.

I had brisket and pork. Both were flavorful. I felt the brisket could have been more tender, but it was tasty. The cornbread was yummy as well."}
{"text":"This place has some growing pains. They probably need to have a hostess since we sat ourselves at a small table in the corner and the 2 waitresses never saw us until I said something. The atmosphere is loud and hard to hear so consequently the waitress got my order wrong. Food was good, but Proper Pig gets the edge from me for service. Give it a few months and this place will be much better."}
{"text":"This restaurant blew my mind. Everything was perfection. The wings were life altering. Saying the brisket melts in your mouth is an understatement. It dissolves. Rib tips were phenomenal. The amount of smoke on the rib tips was mind boggling. The first time I tried Woodstock my chef (I own a restaurant) brought the whole staff brisket to try THE NEXT DAY and it was STILL MOIST!! We were all losing our shit. Hot out of the kitchen though? It's a religious experience. Seriously this place is a game changer. Stayed there extra long because we were watching Thursday night football and they were still super courteous. I will shout it from the rooftops to anyone who will listen GO TO WOODSTOCK. Oh and did I mention we ordered just about everything on the entire menu because it's cheap as hell? Oh yeah. Bout to get a Woodstock tat. Can't wait to go back."}
{"text":"Best food ever! I love the nachos, loaded fries, and the pulled pork sandwich! I'm from the south so I was interested to see what it was all about but it definitely lived up to the expectations of real BBQ!"}
{"text":"I veered off course from what I usually order which is the BBQ spaghetti. Last night I ordered the 2 plate meat; brisket and wings.  The brisket was pretty good (still not as good as the pulled pork or BBQ spaghetti) but after eating the 1st wing, I noticed the other one still had hairs on it. Then upon closer inspection another wing had a solid feather on it that had been cooked with the seasonings on it. Immediately lost my appetite. I told the waitress and at first she seemed like it was no big deal then came back with an extra side of brisket for me.  SO I'm guessing by her lack of shock or disgust that the this might be the norm with their wings. That being said, I'm still enjoying their other food but BEWARE of the wings."}
{"text":"Very good wings, nice smoke flavor. Also had the roasted jalapeno poppers w bacon strips on top, a creative twist. The turkey and brisket sampler was tasty, along with the cornbread. Also, I know fries are fries, but I love fries and these are excellent. They were delivered hot and crisp outside and fluffy inside, and somehow they remained hot through out the meal. The draft beer was nice and cold and our waitress was pleasent.
We will be back soon!"}
{"text":"I have to admit, having been a Trios regular, the business that resided in this building before it was Woodstock, that I was sad to see my \"Cheers\" go. But the new owner has really done a great job of turning this place into something that was much needed in the neighborhood, now that Madison is the new up and coming spot for restaurants and bars in Lakewood. The decor is absolutely fantastic, the beer selection is on point, especially for all of us craft beer snobs out there, and the wings and brisket are honestly some of the best I have ever had. The brisket is the most tender, melt in your mouth, smoked to perfection meat, and the wings are honestly the meatiest, most flavorful, smoked to perfection yummies to ever gone down the hatch! Everyone I know who has tried the wings agrees whole-heartedly with me on this too. And the Brunswick stew is spot on: if you're not super hungry, but need something to fill you up before you down a few, this is what you should have. If you haven't tried this place yet, get there pronto, you won't be disappointed."}
{"text":"After a couple subsequent visits, I am happy to report Woodstock does a great job. The place is still set up weird but that is minor. The food is great."}
{"text":"My favorite summer lunch spot in Lakewood!!

I found this gem last summer after coming back from Nashville and craving BBQ! It did not let me down. One of the best parts about it is the open air atmosphere and patio that is set up in the summer. Great vibes all around! I felt like I never left Nashville!

They have many platter options to share with a group or a friend so that you can try multiple types of meats and sides in one meal. The menu is also very short and straight forward, which is something I love because I think it allows a restaurant to specialize and really perfect their trade! I would say the pricing is mid range. You will usually spend around $9 on a meal and about $5 or $6 on a craft beer.

The last time I visited my beer fell off the table (you know that magical situation where a glazed table gets wet and your glass decides to have a mind of its own and slide all around without anyone touching it, yeah that happened) but the waitress remained calm and even replaced my beer. She also gave us samples of beers that we wanted to try before making a choice. A+ for her and A+ for Woodstock!!!!"}
{"text":"I REALLY wanted to give this place five stars cause the food was PHENOMENAL!! However that's not all that the restaurant experience is about. I'll get the negative over with....the entrance is tight and on a cold day many wouldn't wait to be seated. They don't have they part figured out quite well. Everyone just crowds into the door and looks around until someone comes up to you, almost felt like seat yourself-which a couple people tried to do. We were lucky enough to get a bar seat-however it took us around 15 minutes for anyone to even approach us (and boy were we thirsty!). The man who was seating people came over to us about 6 times in the over 35 minute wait and always had our party number wrong. 

NOW THE GOOD: once we were seated, heaven. our waitress was great with suggestions and service. The food was unbelievable. People got ribs, tacos, pulled pork, brisket, and many different sides. NOBODY was disappointed. I got the pulled pork and cornbread and added mac and cheese and slaw. perfect meal. I'd go back and get the same thing again. Dry rubbed ribs people were pretty obsessed with too. Cant wait to go back here. Try to keep your party smaller than 6 if you can, not a ton of seating! 

The decor was adorable - perfect theme to the BBQ restaurant and felt warm. They also had all the doors open which was super nice, really made the place feel bigger than it is."}
{"text":"In one word AWSOME
Four of us went for a late lunch on a Saturday. There were a few tables to choose from. For an appetizer we had the Stuffed Smoked Jalapeños. They were really good. We tried the pulled pork, smoked brisket and ribs. All of the meat choices were fantastic. We also had cole slaw, greens, Mac& cheese and cornbread. The cornbread was a little sweet for my liking. The greens were great. 
Highly recommend!!!"}
{"text":"The service needs to step up their game

Above average BBQ

Good beer selection

Seating could be much improved

Service needs to step up their game

No rush to get back"}
{"text":"We stopped at Woodstock BBQ last minute late on a Sunday night when other places were closed.  It was fairly busy with last minute stragglers from the Browns game.  Got a table for 2 right away.  Restaurant was clean and quiet.  A little smokey when we walked in due to the people smoking on the patio right outside the patio door where we sat.  Server was Excellent!  Pleasant helpful and attentive.  Never waited for drink refills or our food.  Apps came out first then main course.  Brisket was tender & moist, pork too, rib tips were meaty & tender.  Collard greens were made fresh & great flavor.  Corn bread was full of corn kernels, sweet & very heavy.  Great BBQ place!"}
{"text":"I understand this is considered a \"bar\" but when we went at 5:00pm to grab dinner with our 9 month old we immediately left after the rude hostess explained to us they don't really \"do kids.\"  There were no high chairs. I understand not every place is kid friendly, but in Lakewood, there are TONS of families with kids of all ages. We all love the options we have in Lakewood and every place I've been is more than welcoming to kids. Not Woodstock. Everyone gave us a dirty look, the hostess was rude, and unfortunately, we never got a chance to try the food."}
{"text":"First time visiting today. Decided to try it as I got one of their  $5 off coupon mailers and was in the mood for something new.  Loved the location and building. Great atmosphere.  We both got the pick 3 sampler.  Food was flavorful though some of the items had very bold flavors that I'm not accustomed to so will take a bit to get used to if I come back.  Waitress Danielle was awesome and helped out us first timers with suggestions."}
{"text":"This is now my favorite bbq joint. I like everything about the place. I shared a 4 meat - 3 sides dish with a friend. We got the ribs, wings, brisket & bbq pork. The sides were fried okra, mac n chz & coleslaw. ALL were fantastic. I ended up going back a day later because I couldn't stop thinking about how delish it was. They also have great happy hour specials. Monday Moscow Mules for $5. Yum! The atmosphere & decor are great, too. Very down to earth. A wiggly metal pig marks the table number. Great customer service whether you get a table or sit at the bar! I will be back."}
{"text":"Fantastic. I haven't had barbecue this good in Cleveland since probably some rib cook-off 15 years ago. 

The brisket sandwich was phenomenal. Incredibly tender. 

My wife had the pulled pork, which was also excellent. 

Lastly, having a bar is a nice plus!"}
{"text":"My husband had given up hope that we would ever make it to Woodstock, because I don't eat most meat...and this place has a florescent sign in the window that says, \"LET THERE BE MEAT.\" I saw on their Facebook page that they had a perch special for lent, so we ventured there last Friday. I had the perch, and my husband had the pulled pork. The fish was breaded perfectly. Cole slaw was great, and the cornbread was probably the best I've ever had. Their BBQ sauce (I think there was a sweet and spicy BBQ sauce on the table) had me thinking we were somewhere down south..only for thing missing was the sweet tea and warmer weather! I'm hoping they keep some kind of seafood option on the menu, or we won't really be able to go back...I really hope they do, because I would love to go back for more! Service was great, and not a bad wait for a Friday.

Had to lower to 4 stars..not happy about it, but recently went back a second time. Food was great, but waited 45 minutes to an hour for a table, and another hour to get our food."}
{"text":"On a beautiful late June night the wife and I  decided to try Woodstocks for a little smoke flavored bbq. We shared a four meat platter of brisket, pulled pork, ribs and wings. Some of the best smoke flavored meats I have had in Ohio. The sauces one sweet and one spicy paired well with the tasty smoked meats. The sides were a mouth watering mac and cheese, baked beans western style and french fries. Abundant deliciousness. The corn bread was awesome as well. Served with a side of pickles and pickled pnion this platter was well priced and plentiful enough for us to share. Can hardly wait for a return trip."}
{"text":"Food was amazing! I had the two meat (brisket and ribs) and side (mac 'n cheese) plate and it was a good deal for $12. Portion was large and I enjoyed everything on the plate. Meats were tender and hot and not over-spiced. Loved their spicy sauce. Mac 'n cheese was solid but nothing amazing. Cornbread was moist and slightly sweet. Tap list is very impressive and the interior renovation is great! Very clean and nice bathrooms. Overall an easy 5 stars."}
{"text":"I wish I could give this place a better review, since I was really excited about trying it, but it was a very disappointing experience.  We went in the afternoon, and while there was only one other table, our server seemed miffed that we were distracting her from talking with the barkeeps.  When our drinks arrived, she disappeared for 15 minutes before taking our order.  The bbq was only acceptable...woefully under seasoned, and the brisket was too fatty.  Decent sides and sauces.  Nice atmosphere."}
{"text":"Fantastic food, really great atmosphere with both of fashioned and modern decor. Went with my family of four and split two of the 3 meat samplers. Ribs, pulled pork and brisket were absolutely to die for. The sides were the least impressive part which was a bummer, I love a good coleslaw and cornbread with barbecue. Fries were average and baked beans were very good. Our server Katie was great, perfectly timed table stops and quick drink service. Overall would absolutely eat here again, but wish the sides were kicked up a notch!"}
{"text":"So focusing on the positive, the food was good. The sauces are sweet, spicy, and hot and have great flavor. The meat was cooked tender the way a brisket should be. It's hard to find good BBQ in Cleveland.

Now unfortunately on the negative, I have to say this was in the top 5 worst service experiences I've had and I'm pretty easy to please. Our orders and dining experience was messed up in every way it could have been. Short of being rude, I'm just not sure where our server's head was at.

My Dad and I both ordered the brisket platter. Plates come out they're both sandwiches, not a whole lot of meat. The sides are a probably 3 times the size of a grocery store sample you may get from the deli, so not very plentiful. 

Our waitress didn't notice we had the wrong thing until we asked and instead of getting us our actual dishes we'd ordered she just came back out with a few more slabs of brisket. My dads slabs were miniscule, so I offered half of my slabs to him which were just a normal amount of food, the whole scene was just very odd. It was like they couldn't care less to make it right and it showed on the plates.

The plates didn't come out with cornbread as advertised, we had to ask. We went to dig into our food, realized we don't have silverwear. Ask for silverwear finally get it. Finally the check comes, waitress had added an extra meal onto the bill. Get the meal taken off, pay and leave. She didn't really pay all that much attention to our table from the get go until she'd realized everything was getting messed up.

It was like a non-stop series of unfortunate events from a service standpoint and I've never seen anything like that before. I guess I'll just chuck it up to the restaurant being new and maybe the staff inexperienced but that part was not pleasant. It was stressful as a customer when everything is coming out wrong and it's like they can care less about it."}
{"text":"Yay! This place has definitely improved since they first opened! Very glad I stopped in recently to give them another try. 

This time I tried the pick four sampler. I was told that normally they don't let you double up on the meats, but my server was kind enough to appease me and let me order ribs, ribs, pulled pork and brisket. The pulled pork and brisket looked to be about a quarter of a pound each and my double order of ribs came out to 4 bones. The meal also included 3 sides of which I chose the baked beans, coleslaw, and mac & cheese. A little loaf of cornbread along with some pickles and onions topped off the sampler platter for $22. I also got the smoked jalapenos at $5. 

Now for the details. I thought the texture of all of the meats was great! The pulled pork and brisket were definitely moist and tender, the rib meat pulled off the bone nicely, and you could see that slight pink smoke ring on all of the meats. Also, nothing was overloaded with fat this time and nothing was dried out either. My only small complaint would be that they are heavy handed with the black pepper. The ribs and brisket had a mushy black pepper crust on them that I actually started to wipe off towards the end. I love black pepper, but I found the amount of this spice to be overwhelming here. The quality of the meat is so good though that I would gladly eat it again, I would just scrape off the crust at the beginning. 

For the sides they come in about 4oz? containers. I could be wrong on the size, but basically they are decent portions, nothing skimpy here. I thought the mac & cheese was cooked perfectly! The right amount of noodle to cheese sauce ratio. The baked beans come with peppers, pineapple, and meat (bits of fat). Kind of a smokey, spicy, sweet flavor, but good. The coleslaw is still not the best, seemed like a mixture between a cream and vinegar sauce with a lot of black pepper. Edible, but I have had better. The loaf of cornbread has improved a million times compared to that dried out little muffin they first served. Not sweet or gritty, but still pretty good. The texture was dense and moist. 

The smoked jalapenos were good, nothing outstanding, but good. They are peppers stuffed with a creamy cheese mixture then topped with smoked bacon. A nice accompaniment to your meal. 

Overall I think Woodstock does pretty well with the things that matter most to me in regards to BBQ (quality of meat, mac & cheese, and cornbread). I also think that the price is affordable and I got two hearty meals out of my sampler platter. They now rank towards the top of my BBQ list and I would gladly try them out again."}
{"text":"Great food with great service! only reason for 4 stars is cause of the size of the place but that's not a big deal when your drinking a 40oz and eating some dank bbq"}
{"text":"I had high hopes for this place, but it underperformed at every level. The brisket plate was small and the brisket was over cooked. There was no elasticity to the meat it just fell apart.  The flavor was not unappealing but the sauces were underwhelming. You can do better out of a bottle at the grocery store. I paid for a side of Mac n cheese. It was watery and the size of a Dickie cup. 

My wife's meal was a joke the BBQ nachos were bland and her cocktail was not drinkable. She also got a Dixie cup of watery beans that were forgettable.

Hopefully they can improve or they won't last long in Lakewood."}
{"text":"I can only sum up this place with a moderate \"meh\".  Any potential to wow me with the food almost vanished as I walked in the door and spotted the staff filling up the sauce containers with GFS brand BBQ sauce. 

If an industrialized food conglomerate makes your sauce - it makes you wonder what else might be shipped in frozen for this place. I might be back for beer at some point, but for good BBQ in Lakewood it's back to Proper Pig for me."}
{"text":"The best barbecue my boyfriend and I have ever eaten! I don't even think we spoke during our meal, we just kept \"mmmmmm\"-ing. Go try it! Highly recommended!"}
{"text":"Loved this place. Super casual bar and BBQ joint.  We sat at the bar, there was quite the wait on a Saturday night.  I ordered a half slab of the ribs and a pulled pork sandwhich was ordered. The ribs were quite meaty, they had a nice bark and smoke ring. They did not need sauce but the jerk bbq sauce was pretty amazing. The sides were Jamaican cabbage and porky greens. They were both good very tasty. I have to give the edge to the greens. The pulled pork was quite tasty as well. Woodstock is another  great addition to the Cleveland BBQ scene."}
{"text":"Friendly, fast service. Food was tasty considering how inexpensive our night was. Will definitely go back."}
{"text":"My boyfriend had heard this was a new place, and we stopped for dinner. The barbecue is outstanding. I had rib tips, which I loved because I didn't have to bother with the bone. Dave had pulled pork, which was also excellent. The sauces are really well done, and the side dishes were also very good. Tip-The menu is a la carte-something to keep in mind when ordering."}
{"text":"Well, hello there new CLE favorite bbq place! I'm such a huge fan of Woodstock. The brisket is savory and the side pairings like the must-try mac and cheese and corn bread are my faves. Atmosphere has a rustic vibe and the service has been pretty top-notch on all my visits."}
{"text":"The positive is that my dad liked his plate of ribs and brisket. I think the service was slow and it didn't seem like our server wanted to be there. I also wonder why they can't have one vegetarian dish on the menu. It's 2017 and it's Lakewood and they can't even accommodate with ONE option? I ordered a few sides, and I agree with a prior review- the sides were two steps up from a grocery store sample."}
{"text":"In fairness, the BBQ was decent.  I tried a variety of their core items. My wife's order was contaminated with gluten and she suffered a painful reaction despite our server promising the food's safety. We didn't finish our meals because we had to leave abruptly to deal with the gluten issue. Initially, the restaurant charged us full price and a casual apology.  Ultimately (after jumping through some hoops) the restaurant openly admitted their mistake and offered us a gift card for remedy.  When I suggested a refund seemed more appropriate, they provided a $7 credit to our check.  Please be careful when eating at this restaurant.  Also, keep in mind that if they screw something up, you aren't likely to be adequately compensated.  There is another place very nearby called Proper Pig that offers higher quality BBQ in my opinion.  Other (safe) Lakewood favorites include: Forage, Rush Inn, Buckeye Beer Engine, El Carnicero, Jammy Buggars, Pier W."}
{"text":"Had the four meat platter. The brisket was the best I have ever had. The pulled pork and turkey were ok but a little dry. The ribs were terrible with a strange taste and dried out. There was no BBQ sauce on the table and I wasn't offered any. Our group sat outside which was nice because it was mostly high tops inside. Geared towards the younger crowd."}
{"text":"I liked it. My bf did not. They had one sweet local cider on draft and a more tart one which is what I needed that day. I got the smoked wings. Amazing. My bf got the pulled pork sandwich and there was much left to be desired for him. We started with the stuffed jalapeños. They were good but were done in one minute so we're they sitting under a heat lamp? Not cheap, and a new bar should have specials... I liked the decor though."}
{"text":"Barbecue for Binge Drinkers!
The food is fine: tasty pulled pork, but the brisket needs the sauce and the smoked wings were a bit undercooked. The highlights are the attractive space with a great beer selection for a barbecue restaurant. The problem is the crowd. They held over one or more bartenders from when this location was Trio's- a worn-down cheap bar for neighborhood winos. Because a bartender or two stuck around, so did the clientele. If you sit at the bar you will spend your time trying to ignore the obnoxious and unstable drunks that still call this place home. It's probably much better at their outdoor seating though, so it might be worth a try when the weather is nice."}
{"text":"I went to Woodstock yesterday and really liked the food. I shared a plate of brisket, pork, wings, ribs, slaw, and mac and cheese. I really loved everything. I had sangria to drink and was happy with that too. It's pretty casual, inexpensive, and delicious! I will definitely go back."}
{"text":"OMG! Tried this place today for the first time!! Out of this world!!! Fantastic food and excellent service!! I will be back for sure!!'"}
{"text":"A bunch of us stopped in to Woodstock this past Saturday as first timers...the signature cocktails were stellar, had wings as an appetizer and they were beyond delicious, we each tried the sampler which allowed us to try the different meats, each was tender and very good. I had the bbq spaghetti, it was phenomenal! All in all it was a wonderful experience and our waitress Meagan gave us prompt and courteous service! We will be back soon!"}
{"text":"Cant remember how many check-ins I have here maybe 4 or 5.  I really like the place.  Servers are all really fun and nice.  The fact that some are vegans is hilarious.  Way to stand by your convictions.  The food is good and solid.  Sundays are relaxing unless some douche comes in and overrides the Browns game with the juke box so he can play his Indie buttrock from his phone.  Twice this has happened here.  So random.  Must be a Lakewood thing.  Keep your fast strumming, pimply-faced whiney music to yourself, Thad.  Great beer selections and priced well but the housemade drinks are tasty yet overpriced.  7.00 for a small rocks glass of something I literally take 3 sips out of and its gone.  And lastly, the happy hour is (again) only at the bar.  Some people like to come and have a wee one in tow.  We cannot sit at the bar, obviously.  So, Indie buttrocker dude gets the good deals but myself (sitting 4 feet away) can't.  That bullshit.  Ill come back for sure but I guess I wont get any savings passed on to me..."}
{"text":"Happy to find another quality dining option within walking distance of home. Generous portions, reasonable prices, prompt and friendly service. We shared the Jumbo Dry Rub Wings ($9) and they were indeed Jumbo! Delicious!! I had two meat plus one side and chose pork and brisket and beans. My husband had three meats/two sides with brisket, ribs, turkey, beans and collard greens. Comes with cornbread -- it was moist but I'm not a big cornbread person so probably not the best judge. Noticed the couple at the next table got four meats/three sides to split. Well played.  That, plus wings, will be our voice on our next visit."}
{"text":"I absolutely loved Woodstock. The staff was incredibly friendly and the food was fast and delicious. I stopped in on a Friday night. The restaurant was packed but it was only about 15-20 minutes for 2 people. The place isn't too large so you might struggle getting a large group in there. We hung around at the bar while we waited and there was a pretty extensive drink list. It seemed almost profane to even consider ordering anything besides a beer to drink at a BBQ place. 

For my meal I had their brisket sandwich with a side of mac and cheese.  The meal came out so quickly that it felt like they had the plate waiting for me before I even knew what I was ordering. The food was all delicious. The brisket was flavorful and tender. There are a bottle of spicy and a bottle of sweet BBQ sauces on each of the tables. I'm more of a sweet guy and I smothered that on my sandwich. Everything ended up being super messy so prep yourself by requesting extra napkins and making sure you're not worried about embarrassing yourself in front of your company!"}
{"text":"Food was ok, but the service was pretty bad.  We almost felt like we were doing our server a disservice by eating there.  

Nothing special about this place.  Most likely won't go back.  Honestly, we would have rather gone to Dickey's BBQ than this place.  There are way better places to get BBQ in Cleveland...."}
{"text":"The brisket plate ($11) was delicious.  Tender and cooked to perfection.  I used the sweet BBQ sauce, which complemented it well.  I also ordered a side of mac & cheese ($3), which was very creamy.  The price of my entree seemed a little high because no sides were included (only cornbread).  However my meal was great so I felt like it was $14 well spent.

The atmosphere in here is on point.  Casual, comfortable, and inviting.  It's also spotlessly clean, and service was very friendly.  Plus, our food came out quickly!

The owner of the bar welcomed us as soon as we walked in.  He made sure to welcome many guests as they arrived.

I will definitely recommend and return again soon!"}
{"text":"I've been all over the south and have experienced real BBQ in many forms and styles. Ohio has few places that can match the quality of places like Central BBQ in Memphis or Scott's in South Carolina, but this place is the real deal. In a word: OUTSTANDING. I've already been here twice and have had the ribs, brisket, wings, beans, slaw and cornbread. All were excellent. My wife has tried the pulled pork, stew, collard greens and mac and cheese and she says they are all very good. Its basicly dry rub wth sauce on the side. I appreciate eating it with just the rub. They serve until the run out, so get there early. The portions aren't huge, but they don't have to be when the quality is this good."}
{"text":"Service is slow, especially when it's busy, but we didn't mind hanging out the couple times we have been there so far. I'm not really a pork fan, but theirs is extremely good. Of course it's not my dads brisket, but still an awesome place if you want some good BBQ. They do a really great job and with all the taco places in the area, this is exactly what Lakewood needed. Their beans have a good ole flavor to them, and the 2 meats plate is plenty for me. My husband likes to get the 3 meats to try them all every time. And the nachos--they are a meal on their own!!! So good!!"}
{"text":"I am a huge BBQ fan, and I love that Cleveland has so many options to try! When I visited Woodstock, I was pleased with the atmosphere. It has a really comfortable feel and I loved that they had handwritten menus and served your food on silver trays. I ordered the brisket sandwich with mac and cheese on the side. The meat was mouthwateringly delicious. They give you two sauces, one sweet and one spicy. I was a huge fan of the spicy over the sweet, but both are very good. The mac and cheese was of course delicious because how can you go wrong? I also tried my boyfriends baked beans, and they were also very good. Overall, this place has such an authentic feel. I won't compare it to other BBQ places in the area because I think that they all have their own personality and can't really be compared. However, if you're in Cleveland and craving some good BBQ, this place is a must try!"}
{"text":"Had no idea this existed in Lakewood and I'm more than happy I found it!  Me and my girlfriend split the 4 meat and the only gripe I have is you can't double up the meat but whatever it's all delicious.  We did pork, wings, ribs and brisket.  Brisket was a little fattier than I like it but the rub was on point and the wings had a crunchy bite.  I believe they use the same rub for each meat but it's still very good.  Macaroni and cheese is a must and so are the baked beans.  I'd like to see more selection sauce but I mixed the hot with the sweet and got a very nice sauce for the brisket.  Oh and the 40 ounce miller high life is just the icing on the cake"}
{"text":"This is by far my favorite spot in Lakewood. The Mac & cheese with rib jam is my favorite, I am not even positive what rib jam is but it tastes amazing. Their dry rub wings are always flavorful and cooked to perfection. Another cool thing is you can basically mix and match everything for cheap. Great price for the amount and quality. As a resident of Lakewood this place really stands out in a good way."}
{"text":"I love this place! The food is amazing, the service is excellent and the ambiance is truly wonderful.
I had the dry rub wings, the pork and cornbread and greens. The wings were the best I ever had, delicious! The pork was so tender and the flavor was exceptional.
This is my new favorite for BBQ!"}
{"text":"YUUUUUMMMMM! Food was delicious! We sat at the bar and were greeted right away with beer and food menus. The beer selection was nice and the prices were good (4$-6$ for craft). I'm very indecisive about pretty much everything in my life so the bartender was more than happy to aid me in deciding my meal. She led me in the direction of the brisket sandwich. It was so good I almost marinated the meat with my happy tears rather than their BBQ sauces (which by the way were also great)."}
{"text":"Unfortunately I was very unimpressed. The ribs were mostly fat and the cornbread was bland, crumbly and too corny. I love barbecue, just not when it tastes like it came from a middle school cafeteria."}
{"text":"Delicious meat, bbq sauces, mac n cheese, corn bread and baked beans!  The only thing that could have been better was the coleslaw.  I LOVE coleslaw, but I did not like this coleslaw at all.  It was very peppery, and not creamy at all.  I switched it out for the baked beans which were delicious, but I missed my slaw.  The pulled pork and brisket were my favorite. Oh yeah, I probably would get ribs next time instead of the rib tips; they were too difficult to eat, and I didn't finish them and did not take them home.  Will still come back again, though, definitely!"}
{"text":"I love this place! Incredible brisket and the best smoked wings I've ever had. Also, the Mac and cheese is the BEST side. I like it better than any other Cleveland barbecue place."}
{"text":"It makes me sad to post this update. We walked out without eating our meals. This was one of my favorite BBQ places, but no more. We came in and were told to seat ourselves. The server brought water and asked if we wanted to order drinks, she was clearly not happy and stressed. She took my sons drink order, then walked away within it getting mine. She brought our drinks after I managed to flag her down. We ordered our food: rib tips and salad for me, whole rack of ribs for my son. 10 minutes later the food showed up and basically the server slid three platters on the table, two of them hanging precariously off the edge of the table. It looked great, but after one bite, I announced to my son: \"my food is cold, not even warm, cold!\" He responded \"OK, I'm glad you said something, mine is too!\" 

I flagged the server down and asked for the manager and she replied, \"I don't have a manager.\" I said, \"Oh, wow. Well our food is cold.\" She replied with, \"Well, you know it's just me tonight...\" waving her hand towards the rest of the seating area. I felt for her, she clearly had been left in a tough situation, but that response was all we needed to get up and leave. A restaurant without a manager, and a bar staff unwilling to help (2 bartenders from what I saw) the wait staff is a slowly sinking ship, which is a real shame, because it's hard to top Woodstock when the food is prepared correctly. 

I changed this review back to a rightful 4 stars based on my most recent visit. It says a lot that management has taken steps to correct the issues and personally invited me back. Thanks Woodstock!"}
{"text":"Convenient and quick! Love their loaded fries, and they have a great smokey flavor to their beans and pork!"}
{"text":"The smoked food is awesome!  We had just about everything between all of us at our table. The brisket was the best I've ever had, followed closely by the smoked chicken wings. The meat with the dry rubs shine, and no BBQ sauce is needed, and I usually like to add the BBQ sauce to the meats."}
{"text":"Decided to come here for the Indian's home opener. I came to the bar back when it was a shitty hole in wall bar called Trios. Let me say that it has been transformed into a very nice bar/ restaurant.  Nice selection of craft beers with a few popular domestics on draft. Plus a wide selection of bottles beer( even serve a 40oz Miller High Life).  The food is great and the price point won't break the bank. The staff was very attentive to my drinking and dining needs (glass didn't stay empty very long). They keep the menu simple, and easy to navigate, and their spins on cocktails is also refreshing change of pace. I definetly would come back again."}
{"text":"If you're looking for a restaurant experience this isn't the place for you. If you're looking for a laid back bar with some pretty good soul food then this is the place for you. The cornbread isn't as good as mine but it's still quite moist and yummy. The brisket slider with slaw was delicious and the cobbler was good too. I will definitely come back."}
{"text":"I happened up this place as a lark. Wow, i was very pleasantly surprised. The smoked jalapeño peppers with bacon are down right criminal. My biggest regret was that I ate somewhere else earlier. See pics."}
{"text":"We stopped in here on a Friday during CLE beer week to take advantage of their dinner specials.  It was a busy time, but we managed to get a table right away.

There was a special deal going on, so we decided to get the four meat platter. We got:
- Turkey: it was moist and pretty good. I'm not a huge turkey fan, so I can't say much about it
- Brisket: Was cooked well, however, I do like Michael Symon's version of brisket much better
- Ribs: Typical- more dry rub like and wasn't as meaty as I would have preferred, but it was good
- Chicken Wings: These seem to be more charred, but he really liked them. I thought it was just okay.

We also got the collard greens (which was ok), and the mac n cheese (that was actually pretty good). The platter didn't have that much meat, so it's a little small to split between the two of us (and I was pregnant at the time), however, it was still nice to have the option to try so many meats on their menu.

Overall, I would come back here again as the food was good, I just feel that there's better places for BBQ in CLE...."}
{"text":"This place was great. We went last Thursday and I was very impressed. The inside will fool you as it looks small when you come in but there are quite a few tables in the back. I ordered an old fashioned and the smoked half chicken and my husband ordered a beer and the brisket. The chicken had a fantastic flavor and was cooked perfect. My husband's brisket was delicious as well. The BBQ sauce is a vinegary style which I love. You also can't go wrong with their prices. I plan on coming again and trying their wings as I have heard great things!"}
{"text":"It's too bad that people in Lakewood do not know what good barbecue taste like. Go to Proper Pig much better place for ribs."}
{"text":"I was there last week with my SO. We ordered wings to start, which were fantastic--we dove right in. I also ordered rib tips with slaw and was in pork heaven. My SO ordered ribs and he said they were delish. We will definitely return!"}
{"text":"Came in Monday, promptly seated at bar. Great draft list, a couple good breweries on their menu. Got a Portside Brewery Vanilla Porter-good for BBQ! 

I'm very critical on BBQ from my time in Ft Worth (and this special spot in LA), and this place rocks it. Unlimited spicy and sweet sauces, ribs had a great char but not too much, very moist. Brisket was right blend of savory and still a little lean. 

Collards with bacon were great. Cornbread was a little sweet with whom kernels. Great spot!"}
{"text":"The smoked meats in this place are the real dinner. We loved the food in this place so much we ordered dinner twice! First we started with the 4 meat sampler that included turkey, ribs, brisket, and pulled pork. For our sides we got cornbread, collard greens, jamaican cabbage, and mac and cheese. As far as the meats go my favorite was the brisket. It wasn't too fatty and was very tender. The turkey had great flavor but was a little on the dry side. The ribs were not bad but a little too fatty for my taste. The pulled pork was great especially with one of their house made sauces on top. The collard greens were better than expected with a nice heat to them and the ham hocks they probably cooked them with really came through nicely. The mac and cheese was pretty basic but was good. The cabbage wasn't my favorite but my boyfriend really enjoyed it. It had a curry like flavor to me with some other seasonings coming through. After we tried all of that we still wanted more so we tried the Jamaican smoked chicken. This by far was my favorite of everything we had. The smoke flavor really came through with this and be forewarned it has some spice to it. Let me warn you about the cornbread though. It is highly addicting! It has a nice sweetness to it and is super moist which is hard to find in some bbq places. We definitely will be coming back here in the future and next time will try the smoked wings!"}
{"text":"I'll admit I was hesitant to check out Woodstock BBQ after reading a lot of mixed reviews on Yelp. I try to limit how much I eat out and I get really disappointed if I have a poor dining experience.

With that said, I was really impressed and completely satisfied with our meal and service at this place. The atmosphere was cool, the service was great, and the food was outstanding. We sat at the bar and a bartender came over right away and politely explained the drink choices and menu. She regularly checked on us to make sure we were good. My girlfriend and I each tried different meat sampler platters and everything was delicious. My favorite were the smoked dry rub wings. I'm not even a big fan of dry rub but when I added some of the in house BBQ sauces (spicy and sweet) they turned into some of the best wings I've had in a long time. The sides we got were bigger than some of the other pictures I've seen on Yelp so I'm not sure if they changed the portions or what but they were a good size and very tasty. The beer list was solid and they have a lot of different choices to help wash down the delicious grub.

I'm really glad we checked Woodstock BBQ out and we will definitely be back soon. The only reason I give it 4 stars is because a couple of the items we got seemed like they may had been sitting out for a little bit but they still tasted great. I'd recommend checking it out and judging for yourself."}
{"text":"Freaking awesome service, awesome BBQ, and awesome atmosphere! The owner was super sweet and our waitress was very attentive and nice. GET THE PULLED PORK ITS FREAKING AWESOME! Also, the jerk and sweet BBQ sauce mixed together is an \"awesome-sauce\". Definitely coming back!"}
{"text":"Quality 3.5/5
Service 3/5
Value 3.5/5

I love BBQ and have slightly higher standards. 
The quality of the meat isn't anything to write home about, but it's not to say it's awful. 
They have smoked brisket which was on the dryer side. It fell apart easily but the smoky flavour didn't quite penetrate and it just tastes like brisket. The seasoning wasn't quite there. 
The tri tip ends had a decent amount of flavoring to it but it almost tasted like it was broiled. It was a bit more rough than I'd like but all in all good. Again I wouldn't call it extraordinary but I wouldn't call it bad either. 
The ribs were the best of the three. The seasoning on it was pretty good and the meat was tender and fell off the bone. Exactly what you'd expect for quality ribs. 
Cornbread. It's got the crispy outer shell, extra crispy edges, and scotch brite sponge interior texture. These I could probably eat daily. 
They have a sweet or spicy sauce to go with the meats if you like, though I think they detract from the food here honestly. 

Food came out fast and great if you're hungry.

Prices were affordable ($30 ish for two meat sampler, half # tritip ends, and Christmas ale) considering how much food you get with the order. I'm a fatass and eat a lot so it obviously costs me more. For reference, this meal was prob as filling as 40 McNuggets."}
{"text":"We started off with a few cocktails..a Mojito is $10..nothing's fancy just not worth $10. The food was pretty good. We ordered the loaded fries, pulled pork, brisket, Mac n cheese, beans, and corn bread. It was all very good but the meat was a tad dry. They have two BBQ sauces, Spicy and sweet. Excellent when mixed. The portions are a great size and the food prices are really good. We have enough left overs for dinner, which is always a plus! We sat on the patio, which was perfect for a beautiful day. We will definitely be back."}
{"text":"The food is great. Service was wonderful. I want to go right now! I live nearby, and it's nice to have a new place to go. Also I love what they have done with the building it is much more appealing."}
{"text":"A friend and I decided to meet here on Monday night to check it out.  We both had the \"Oh Honey\" cocktail which was only $7 and came in a pint glass.  That's awesome.  I had two and was feeling pretty good.

I had the ribs and mac & cheese for my dinner.  Both were tasty and cheap!  $11 for the ribs which came with cornbread and $3 for a side of mac.  The mac lacked some salt but otherwise was really tasty.  All in all I will definitely be going back.  

Oh and our server Laura was super cool too!"}
