{"text":"We had a family birthday dinner last night at woodys.. The food was homemade, delicous and reasonably price. The  food was great but the service was amazing.  The staff was attentive responsive authentic and friendly. Our server Chris was awesome and helped make a special get together even nicer. We will have more events and dinners at woodys."}
{"text":"Went to Woody's for dinner Wednesday evening for our girls night out. It was fantastic. I ordered the portobello stack. It had some pretty interested flavors and was very good. Everyone loved their food. My portion size was normal in that i was able to eat it all there.The other 6 people at our table had huge portions. They only ate half and took the other half home. The bread is very unique as is the sun dried tomato butter. Very tasty! The atmosphere is nice. The event center area looks beautiful. Our waitress was very attentive. I recommend this place."}
{"text":"Wow! Great EVERYTHING! I was worried I might be underdressed based on photos I saw online, and based on the atmosphere. No need to worry. The dress was very casual \"come as you are.\"  The staff was AMAZING (and friendly and fun), and the food was perfect. Until I find another, this is my new \"go to\" for casual fine dining."}
{"text":"My new favorite in this area: outstanding menu, service atmosphere and pricing.

Would HIGHLY recommend dining here, truly a hidden gem off the beaten path.  You won't be disappointed!!"}
{"text":"Was disappointed when I had dinner here. Looks like a big warehouse with no windows so it's hard to talk because of the size. Live music sounded nice but was too loud. Service was not that great and neither was the food. Really no reason to recommend this place."}
{"text":"We started going here a,few months ago and felt like we had fined a real gem. Excellent food, large portions  (always took home leftovers), good service, nice atmosphere.  We were totally disappointed with our dinner experience there last evening. My boyfriend ordered lasagna, half the portion we were use to, the edge was so dry and burnt he could not even cut it with a knife! My dinner came with a ceaser salad with no croutons (?) And my chicken breast dinner that was suppose to have 2 chicken breasts came with 2 pounded thin 2x2 inch pieces of chicken!  We were shocked to say the least. Would have liked to mention this to our bartender who was busy and never stopped to check on us but walked  past us a few time saying \" everything ok?# She never noticed, she never gave us silverware, or the salad came without croutons, or she forgot forgot to offer us bread. Doubt we will go back, they just  changed their menu and now are closed Mon/Tues.  Such a shame because the food and service was excellent."}
{"text":"I had recently ordered fried fish to go. The breading was soggy and falling off of the fish.They put the french fries under the fish in the to go container and they were soggy. And last but not least they forgot the cole slaw. What a disappointment."}
{"text":"The food was very good but took way too long to receive it. We had the provolone wheel and fried zucchini as appetizers both were very good and then had two pizzas along with chicken fingers and fries - all of which very good but on a night that it wasn't crowded the entire meal too over 90 minutes.  Atmosphere was nice and we will eat there again."}
{"text":"Another mediocre to OK restaurant in the burbs. Cold soup, not fresh bread, and an underwhelming portion size of raviolis, though they were good. Nice bar set up, but that's about the only reason I would come back. Stick with drinks only here."}
{"text":"I've been a frequent patron of the cozy original Woody's restaurant in McKeesport since I moved to the area. When the Woody's Piazza Ristorante at the Antonelli Event Center opened, I was excited to try it out. I've had the pleasure of attending some gorgeously planned weddings as a guest, but the restaurant and bar offers a more elevated menu than the original. There are some hints of the familiar menu, but with posh changes that distinctly provides the two restaurants with separate identities. Woody's Piazza brought in Executive Chef Kirk Kolish who brings with him bold flavors and experience. The bar offers live entertainment with a DJ and Karaoke. It's starting to offer more drink and appetizer specials as well as some very fun game nights. With the addition of the new and innovative Beverage and Entertainment Director, Joe Prizner, there's a real personal touch. His passion for his job certainly shines through. 

I recommend the Entree Salad with Honey Balsalmic dressing, Sauteed Sea Scallops, and Horseradish Crusted Beef Short Rib appetizers. For vegetarians, the dinner menu has an amazing Roasted Portabella Stack. You can't go wrong with their pizza and add your own toppings. Any of their fish dinners are delicious and cooked perfectly. Woody's signature stuffed banana peppers are just as yummy here. By the time you get to dessert, you'll be full but ready to order the Chocolate Truffle Cake or Bananas Foster Bread Pudding.

The staff is friendly, servers and bartenders are attentive, and the overall dining experience has a laid back feel without the stuffiness of the high end restaurants. I'll definitely return often to see what new events are available!"}
{"text":"The place was packed, only two seats at the bar, we grabbed them and ordered drinks. Buddy of mine had his usual Rum & Cola, I got Jim Bean honey, lemon twist, double shot for 8 bucks, not bad for a double shot! Eclectic crowd, date night twenty somethings, older couples dressed to the nines, sipping martinis, sharing an appetizer, middle aged married couple, she on her phone, he was enthralled in the Penguin's game on one of six TVs at the bar. Church groups, 3 guys wearing camo, beards and all, and a gay couple rounded out the crowd. 

Nice Italian menu, pastas, steak, burgers, lasagna, wraps, sandwiches & Pizza. We decided to split a 12 inch white pizza. As I said the place was packed so we waited a good half hour for dinner to come out. 

Pizza arrived looking like it was a store bought pizza shell, it wasn't, it just looked like it was. A touch too greasy for my tastes. Heavy with butter and olive oil, lots of cheese and chopped tomatoes, didn't taste much garlic as promised by the menu description. Needed lots of parm cheese and red pepper to help soak up the grease. 

The place got loud once the DJ started playing around 9. We stayed until the end of the Pens game. Entertaining night of people watching out in Irwin. Lots of free parking. I'll come back and try one of the pasta dishes, and to try the artichoke appetizer. The classic Pittsburgh app of fried zucchini is front and center on the menu, done differently here, served with creamy horseradish dip. Not a bad restaurant, about 40 mins from downtown Pittsburgh out RT 30."}
