{"text":"I'd read much about Woodlot in the last few months: about the fantastic bakery, the locally-sourced ingredients, the simplicity of the food and decor. Between the personal recommendations and the fawning of the print and online food community, the decision wasn't too hard to make to try it out. (The fact that it was voted one of the best new restaurants of 2011 by Toronto Life definitely didn't hurt.)  We popped into Kalendar for a drink beforehand (check out the rojo martini if you go. Most excellent.) and watched the world go by, including the chef of Grace, Top Chef Canada contestant Dustin Gallagher. Mental note: must get to Grace! We wandered over to Woodlot and as soon as we opened the door, the aroma from that spectacular wood-burning oven wafted over us. Figuring that was a good sign, we inhaled deeply and sat down at our cozy table. The restaurant looks like it seats about 50 on the upper floor with room for another 10 or so downstairs at the chef's table. The exposed brick walls are adorned with native Canadian art as well as knickknacks that lend a cottage-like vibe to the place. The waiters are dressed casually and it is explained to us that there is a standard menu, plus a separate vegetarian menu. I perused it quickly and was impressed to find a nice selection that didn't fit into the standard roast-veg-or-pasta options.  We ordered a bottle of cabernet franc and eventually settled on three courses: the scallop ceviche with black quinoa, whipped avocado and julienned red cabbage; Red Fife whole wheat papardelle with wood mushrooms and hazeluts; whey-fed pork chop with grilled treviso, tri-tip steak with caramelized onions and side of Jerusalem artichokes.  When the bread basket arrived at the table after placing our order, we jumped right in. My dining companion loves bread and watching his face light up after taking that first bite of the gorgeous Red Fife bread was wonderful! I'd read about this particular grain in Sara Elton's book, Locavore, and was excited to check it out. It kind of makes regular bread taste entirely pathetic. We'd both had a couple of pieces of the various kinds when the appetizer arrived. The scallops were soft, the avocado was whipped into a lovely, airy bubble and these textures were complimented well with the crunchy quinoa and cabbage. I wish there'd been more of it, but we weren't exactly going to starve.  Next up was the papardelle which was out of this world. Again, the Red Fife made a huge difference in terms of flavour. The wide, handmade noodles were cooked perfectly and provided much more dimension to the dish than you'd have otherwise. It was a very earthy plate, one that you wanted to hunker down with in front of a fire and never stop eating. I hope that's on the menu year 'round, because I would have it again and again.  The service at Woodlot is quite good, if not entirely exceptional. Importantly, however, they let you enjoy your meal in peace and the timing in between courses is well paced. We needed a little time between the hearty pasta and giant slabs of meat that would imminently arrive at our table. And giant slabs of meat they were: delicious, juicy, perfectly-cooked pieces of meat. My pork chops had that little layer of fat around the outside that you know you probably shouldn't eat, but can't help yourself because you know how good it is. The grilled treviso was a perfect compliment, too. The steak was exactly medium-rare as  ordered and was incredibly tender. The caramelized onions were an excellent accompaniment - in fact, I'd eat a whole bowl of those if they sold them. Even the Jerusalem artichokes were great - caramelized and not overcooked.  To say that we savoured every bite is not an understatement. Nothing was complicated (though I have a spot in my heart for complex food) or overwrought: in fact, we saw several dishes come out on wooden cutting boards. Dessert was very tempting, but we passed this time. I'd like to go back in the cooler months as I'm dying to try the marrow-infused whipped potatoes.  Of course, I also want to go back so I can eat ALL the bread that's there.  So there you have it. Great food, cozy and welcoming atmosphere. It's tough to get reservations on a weekend, but the hostess with whom I spoke to make our reservations was gracious and as accommodating as could be. I will definitely be making return trips here!"}
{"text":"Everything from start to finish was perfect.  I went for my anniversary last night and it hit the spot.  The host was lovely and seated us right away.  We were twenty minutes late and he wasn't bothered in the least.  Told us we did him a favor since the reservation before us lingered.    We eat meat occasionally but ended up ordering entirely from the vegetarian menu.  I had the mushroom salad which was wonderful.  My husband had the gnocchi, which I was jealous of and if I had a longer arm I would have eaten half of.  My main was the tortelloni and my husband's the tortiere.  Both were delicious.  I wouldn't change a thing.    The Bellwoods Brewery beer from just down the road was nice and the wines by the glass were interesting.  4 oz pours may not seem like a bargain at $9 - $15 or more, but I guess the alternative is to make it 5oz pours and jack up the price by 25%.    We got the dessert board for two, which I feared might just be a bunch of fancy sweets prepped earlier in the day by a pastry chef who was long gone by evening.  Turns out it was, but that was ok.  The madeleines were lemony with a little crispness around the edges.  A square of nougat was chewy and nutty.    The vibe was lively though not too loud.  As luck would have it they played one of my favorite albums of all time during the second half of our dinner.    I read a lot of other reviews and my assessment is that Woodlot is a victim of its own success.  People love to find a reason to take down really popular and trendy places so they can feel good about their superior discernment.  Don't be fooled.  This is one of the best casual restaurants in Toronto and it deserves five stars on Yelp."}
{"text":"Love the food at Woodlot! The combinations of ingredients are amazing. There is something about a wood fire that adds so much flavour. Last time I was there I had the roasted wild red shrimp and crispy sunchoke and grilled hen-o'-the-woods mushrooms - yummm!"}
{"text":"Finally got to come here, my husband took me for my birthday.    Simply, one of the best meals I've had in the city, or period, really.   Tons of options for omnivores and vegetarians.  Even some vegan options.  Staff are super friendly and attentive.  Atmosphere is cozy, casual, and intimate without being stuffy.  The chef even came out after and asked us how we liked the meal - my husband is vegan and they had accomodated him on several items.  Wow."}
{"text":"Finally got to Woodlot. Fantastic! Had a great experience as far as food and ambiance. We went with two friends who didn't love the food as much awe did, but I respectfully disagree.  Check this place out!"}
{"text":"LOVE. WOODLOT. I met some lady friends here on a windy Sunday night. All being vegetarians, it's rare in Toronto to find a large assortment of surprising and delicious foods on one menu. At Woodlot, we definitely had the opposite problem. There were so many wonderful things, that we wished we could order the entire veg. menu family style, but settled for ordering a few dishes to share.   FOODS!  The Ember Grilled Halloumi Crostini was magical. Each bite was a little piece of heaven. Yes, it works out to 4 dollars a crostini, but it was also so good that I died.   We also shared the Hokkaido Squash and Ameretti stuffed Red Fife Ravioli, which they actually split up for us, which was super nice of them. While I'm not sure that I would want to eat an entire plate of this (it's pretty rich!), each morsel melted in your mouth, and the textures/flavours played off each other nicely. I'm also a sucker for fried sage leaves, so that was a nice touch.   Finally, we also had the Crispy Cauliflower Risotto Galette, which was hearty, and earthy, and perfect fancy comfort food for a cold fall evening.   DRINKS!   I had a drink made with bourbon, black pepper, cherries, clove bitters and honey, and it was wonderful. It's a little on the sweet side, which I am not usually a fan of, but it worked for this cocktail.   I also tried the four roses bourbon drink with birch syrup, which I was less of a fan of... presentation was cute, but it was missing something. It had that herbal medicinal taste, which can be good, but it lacked kick. Could be good with a touch of something like cayenne or lavender simple syrup to add more depth?  ANYWAYS.   I should also mention that the service was just the best. Our server was attentive, but not too attentive, and helpful, and just great.   The room is beautiful. Their bread is amazing. I will definitely be back.   FIVE STARS."}
{"text":"What a pretentious, hipster hellhole.   I was out for dinner with two friends last night, looking to try a few different places we'd heard about along College. We didn't have a reservation at Woodlot, but dropped by and saw there was no one waiting in the lineup, so asked to put our names on the list. The hostess told us it would be approximately 45 minutes for a table to come free, but that it might be available earlier and we could leave our phone number and she'd call us when they had a spot. It was early (7:45) so we went for it, left our number and headed around the corner for a drink.  An hour later, we still hadn't heard from them, so I called to ask what was happening with the table. The hostess told me the people at our table were still waiting for their desserts and that it would be another 20 minutes. I started to get frustrated as, to me, there is a big difference in being asked to wait 45 minutes for a table and being told it would be 1 hour 30 min. She told me the 45 minute wait time was \"just a quote\" and that she couldn't know when the table would be free. I could be wrong, but isn't it the hostess' job to accurately predict when tables will turn over and to manage customers accordingly?   We paid the bill for our cocktails and walked back to Woodlot and just as we arrived, our table (which was in fact the communal, baker's table, which we were never told about) became free.  We were seated at the communal table and promptly given menus and then a server frantically pushed our plates and cutlery into place. She even slid our water glasses across the table to each of us, like she was on the Olympic curling team.  We did not see our server or ask to have our drink orders taken for the first 10 minutes we were seated. I looked at my dinner companions and we decided that, even if it was a spectacular meal, we would probably not be able to judge it fairly after the super rocky start we'd had to our dinner. So, before we placed any orders, we decided to leave and head to the Pomegranate Restaurant down the street, which is a new favourite for me.  I'm sure the Woodlot's food is worth a wait, or a reservation made well in advance, but the impression they left on me with the poor customer service means I won't go back to try it."}
{"text":"I just want to start by saying that I had the gnocchi with sunchoke and hazelnut veloute, bacon, pumpkin seeds and brussels sprouts and it was OUTSTANDING. Amazing texture,smokiness from the sunchoke, and incredibly unctuous chunks of perfectly crispy-yet fatty bacon. I just wish everything else would have been like this.  My boyfriend and I went last weekend, and it would have been a waste had it not been for the gnocchi. The breads were delish nibbles, and we both had starter sizes of pasta. I had the aforementioned gnocchi ($17) and he had the sourdough squid ink tagliatelle with crab ($18), which he could barely finish and I didn't like it either. It was hard to eat and the crab was overpoweringly fishy tasting and the flavours just didn't marry well.   For mains, he had the flatiron steak with avjar and corn nuts ($29). It wasn't particularly tender, and crunching on the corn nuts while chewing on the steak was off-putting and distracted from the nice flavour of the accompanying sauce. My venison, beef, and pork tourtiere ($28) had a golden, light crust, but the filling was bland, and I had to clean out my little cup of  deliciously tangy homemade ketchup to give it any flavour.   Overall, the food was completely forgettable outside those crazy good gnocchi, the service was fine, but I won't go back for anything but plates and plates of the gnocchi. For over $120, I expected much more."}
{"text":"For the price, I've experienced MUCH better in Toronto.   Why is the menu virtually the same as it was two years ago?!  That's a bad sign.   My wife had the pork and it was over cooked, plus we all reeked of camp fire when we returned home. The bread was tasty though."}
{"text":"My girlfriend picked this spot for my birthday, I was very happy with the choice! Very cozy atmosphere, great service. I thoroughly enjoyed the Wood Fired Creamy Chicken and Ham Hock Pie, she got the large size Toasted Rye Cavatelli, it was great, but she wouldn't have wanted any smaller for dinner. It was neat being able to see our food being made from our table, and the wood fire smell only added to it!"}
{"text":"We had an all around great experience at Woodlot: Got a call the day before to confirm the reservation, when we arrived our table was ready, service was incredibly friendly and prompt, and everything from the bread to the main courses was delicious.  I can only chime in to what others say: The gnocchi are out of this world, and all the other dishes don't have to hide either. And a thumbs up for the vegetarian menu.  I loved the vibe, it is a beautiful space where great food is served, without being stuffy. Definitely a great place to seek refuge in when it's dark and cold outside."}
{"text":"I went here last night.  I liked it, but not quite as much as I thought I would when reading some of the reviews.   I started with the rum and dark pop - meh, no big deal for me and I found the glasses ridiculously small.  I switched to wine after and I found the server's advice was really good on that.  I had the pork chop with roasted radishes as my side.  The radishes were really good as it was something I wouldn't normally have ordered / eaten - was a good surprise.  The pork chop was good but when I was eating it I thought perhpas I would have enjoyed it more in the fall / winter - not really a summer dish (but that was my fault for ordering it)  I had the lemon marshmallow tart based soley on the picture posted previously on this site.  I liked it, but again, not as much as I thought I would.  All in all, it was a positive experience - I found the service to be really good, I liked the relaxed vibe and the wood burning oven was cool."}
{"text":"I went here for dinner last night with my partner and two good friends.   The decor was very rustic and warm. Our server was great, he was attentive and very knowledgeable.   We jumped right into the main entree as we couldn't move past the flat iron steak on the menu so we all had that and shared two sides of the potato salad and green beans.  The waiter brought out the infamous sourdough bread with butter and now I know what all buzz is about. I could have just eaten bread all night.  Our steak was heavenly considering it's flat iron which is typically a tougher meat- this was the opposite, tender and moist and the mushrooms over it were delicious little morsels of flavour in your mouth. Now, the potato salad was AMAZING- it was fresh and the dressing over the potatoes was a perfect balance between creaminess and acidity. As I write this my mouth is salivating just thinking about those fingerling potatoes.  The green beans were just as amazing as the potato salad- I would never think to have almonds and green beans mixed together but man, this worked! They were crunchy and just super yummy.   We were way too full for dessert however the options looked yummy. I can't wait to go back. This is a perfect place to have dinner with friends or even for a romantic night out. We did bring home a loaf of the red fife sourdough and i just had it for breakfast and man, it's awesome!"}
{"text":"The place was very Cozy but very loud, I couldn't communicate with the my potential significant other. Place decor is beautiful and is always full, so it's good to make reservations. Food is OK. I had the onion soup n I expected more cheese n more hot! Seabass is over cooked but the duck is amazing well cooked- soft , perfect temperature not too hot or warm and it doesn't have a strong smell.  I hate warm food . Server is polite n professional - she re arrange my settings before placing the food down . Overall the place is great however I will not recommended it and will not be going back. I was recommended the onion by my sister who claimed the soup to be \"one of the best\", I gonna go head and say that, this statement is false."}
{"text":"Came here for the TELUS Taste of Tuesday deal in a group of six (this was the max amount of people they could accommodate).   While we made reservations for 7:30pm we had to wait about 30 minutes for our table so a couple of tables to settle their bills. While waiting Nancy Wilson from CBC News Now left from having her dinner. Guess she planning to watch the debates online afterwards?  Most of the seating is upstairs which overlooks the floor below where the bar, kitchen and what looked like a large communal table. Pretty neat layout.   Coming with a big group of friends has its advantages since we were able to sample each other's dishes.  Apps: Grilled scallops came with proscuitto on lentils with picked cabbage. Loved it. The scallops were lightly grilled and everything just worked.   Ember grilled hen of wood mushrooms were fantastic. I would get this the next time. It had a great smokey flavour and I love mushrooms.   Baked onion soup was served piping hot with gruyere cheese on top. I thought this was a bit too sweet for my liking.  My friend loved it though.  Mains: Ragu of Snail & Bacon - I got this one since you don't see snails on a menu often. It was a hearty dish with roasted polenta. I thought the snails were well cooked (weren't chewy) but taste wise, it doesn't seem to have a distinct flavour. The bacon came in large chunks so no complaints there. Can't go wrong with bacon. I enjoyed the polenta because it wasn't just mushy - roasting gave it a good crispy texture on the outside.   Duck Confit with Pork Belly on white beans - I would have ordered this hands down if the snails weren't on the menu. The pork belly was delicious - juicy, melt in your mouth delicious. Wish there was more. Duck was good though just a tad dry on certain parts.   Pork Chop - was fantastic. Had a light crispiness around the edges and topped with caramelized apples. While I'm usually not a big fan of mixing fruit with meat, the apples weren't overly sweet so it worked. I was surprised at how good it was.   Desserts: Lemon Tart - I wished I got this. This was a fairly large tart with a lemon filling with berries. It's topped with a homemade marshmallow that covered the entire tart top. Best dessert on the menu.   Soma Chocolate & Hazelnut Pot de Creme - This was really good. It was like Ferrero Rocher in a cup. Topped with crushed hazelnut and had a slight saltiness to it.   Apple Tatin - didn't like it and my friend left more than half on her plate. It was tart, apples were mushy and just overall wasn't appetizing. It came with burnt honey gelato that none of us really appreciated.   They have a vegetarian menu so vegetarians aren't limited just one or two things on the menu.   Food was great, service was good, free street parking, triple win. Yeah, yeah!"}
{"text":"Amazing.....the smell was such an inviting opening to a great meal. Had 4 friends in from NYC that wanted to go.....awesome....awesome....awesome.... Other than waiting for the table for an hour.....was just great"}
{"text":"There are good restaurants and great ones and this one is great.  Other reviews are 4-stars because of small portions and high prices, but we spent twice as much at Ruth's Chris the following night. We are from Houston, TX and will recommend this restaurant to anyone we know travelling to Toronto.  It has a rustic open kitchen with a hearth oven and many wonderful vegetarian options.  We got the mushrooms for the appetizer (you must do).  They are cooked in the hearth oven with crunchy black walnuts and wild rice - I can't quite do it justice in writing, just taste it.  Then ricotta and white beet stuffed pasta and short rib for the the boyfriend.   Everything was just so top notch - it's refreshing to have not only real food but real food that tastes so good!  Execution was perfect, they bake their own bread, what more could you ask for?"}
{"text":"It keep it short, one of the best meals I've had in last two years. If I lived in Toronto I would go here weekly."}
{"text":"First, we were at the communal table. I don't know if this enhances your dining experience, but it didn't do it for us.  The food was overpriced and more often than not bland or dominated by one flavour. The only \"hit\" of the night was a side -- Brussels sprouts with fatty slab bacon and juniper, which is pretty much impossible to screw up. Their play on French onion soup was a fine performance, but right down-the-middle -- no inspiration required, and it worked. They should keep their supplier of gruyere. No complaints there.  And that's all there is to report on the positives. It wasn't just the lack of taste complexity; improper technique abounded. The gnocchi were done under, so far under, in fact, that the dough in the centre was raw. Uncooked gnocchi dough is a bit like unfried timbits -- maybe it's a play on Canadiana? Ha.  The king crab salad was heavy on the mayo. The things that made it sound delicious on the menu -- like crab, for one, but also the crispy bits of parsnip, were conspicuously lacking.  The wine offerings by the glass were limited and the pours were considerably less generous than the price might require. At least they advertised the sort of graft in which they engage; the menu said four ounces and meant it.  If you want trendy, go. If you seek value or taste, avoid."}
{"text":"Great disappointment! Sadly. The appetizer (beef crudo) was overpowered by pine flavour and simply not satisfying. My main (ox tongue) burned black and inedible (sent it back after a first bite and decided not to take a chance on another dish). My GF's main (pasta with rabbit ragu) was relatively good. The (small portion) of side brussels sprouts was ok but not worth the price. The one thing that was outstanding was bread. Perhaps this is the business they should stick to - bakery. Will not go back."}
{"text":"Sorry, this place doesn't live up to the hype. Yes, the rustic, unpretentious ambiance is very inviting, everything from the split-level configuration to the ever-lingering scent of wood burning, to the cosy and warm lighting, and  the bustling energy -- all of which i really appreciate. but the food? hit and miss. same with the service.  I ate there for the second time a few weeks ago and found the quality had gone down and prices had gone up, since my initial visit end of January.   The original claims of incredible value heralded by foodists when it first opened (i.e. great dishes, and with all entrees under $20, and huge portions, etc) is no longer the case (although huge portions i can always do without).  And while the server I had on my first visit was friendly, attentive and extra-accomodating (pre-splitting the various sides and two entrees my DC and I'd ordered), the server on the second visit, not so much. She disappeared frequently and, due to poor listening skills, brought a wrong entree, but didn't feel the need to apologize (she seemed generally distracted - to put it politely - despite the section being half-empty for the first while). Whatever, everyone has a bad night, but her attitude (bordering on eye-rolling) was not endearing, especially when none of us expressed impatience or were demanding in any way.   I'm a salt fiend, but generally-speaking, even I found the salt quantity over the top in pretty much every item ordered. And i wasn't the only one with this opnion: thanks to the ridiculously-close-placed tables (ya, i know...profit margin...gotta ram'em in....blah blah blah, but 6\" between tables?!), i couldn't help hearing the neighbouring couple's detailed estimation re: sodium counts for each of their items.   THE GOOD: - bread basket: one of the best in the city, perfect texture and very flavourful - whole wheat pappardelle pasta w/ lamb ($19? $20?): exceptional - whole wheat pappardelle pasta w/ mushrooms (veggie version): also very good - grilled haddock w/ a white sauce served over couscous ($24) - cooked perfectly and was tasty, but not special  - lemon-blueberry tart topped w/ roasted marshmallow meringue  ($8 or $9 - the only dessert i've tried there): i'm a lemon tart connoisseur, and am always surprised how few restaurants (even the best ones, and bakeries, for that matter) get it right. the lemon filling is either too tart, too sweet and/or the crust is disproportionately thick and/or bland and/or cardboard-like in texture. woodlot's, however, is supreme in all aspects. the crust's thickness (flavourful in its chewy-yet-almost-cookie-like texture) was relative to the layers of lemon and wild blueberry, with the lemon filling possessing a perfect sweet-to-tart flavour ratio. the thoughtful top layer of roasted marshmallow meringue perfectly complimented the lemon and blueberry beneath -- incredible!  THE MEDIOCRE: - baked buffalo mozzarella ziti: pasta. cheese. fresh-tasting red sauce. the end. - roasted pork on the bone w/ stewed apples: a tad dry, with the classic (read: boring) apple accompaniment - side of bone marrow mashed potatoes: sure it was tasty - when you add gobs of butter, cream and salt, tasty is what you get. i detected no hint of any bone marrow flavour, so...nothing novel or special about it.  THE BAD: - side of gnocchi in brown butter and sage: about 8 tiny...kibbles appeared on the plate, dried out (under the heat lamp too long?) and bland, w/ nary a hint of sage anywhere - french onion soup: on my first visit i found their version to be among the best i'd ever had, but this time it was almost inedible. the broth was so strongly acidic, as if they'd over free-poured the red wine, without the necessary reduction. not sure how they could've let this batch out of the kitchen.  - side of baked radish w/ ? (sorry, can't remember other main ingredient, maybe... apple?): this was an epic fail, mushy texture and no discernible flavour - again, not sure how this made it out of the kitchen.  Were I rating it based only on the food, it'd give it 2 - maybe 2.5 stars. but the atmosphere (and my companions!) compel me to give it a 3."}
{"text":"Now a days most pouplar restaurants seem to look always the same.classic wood and old Edison light bulbs . An example of this........ Woodlot  I have to admit they Had a Good ambience it is a typical rustic Canadian style no different from any others very ordinary.  However,everybody said \"u must try these sodas\"but it was Ok!!!! Pork could have been more tender  soo chewy and onion soup was over powered by these aged STINKY cheeses."}
{"text":"As many of the previous reviewers have mentioned, the space itself is pretty cool, with the majority of the seating on the second floor overlooking the first.  The kitchen and huge woodburning oven are also completely exposed and when you're sitting on the top floor you can see everything that's going on.  This is a pretty cool vantage point because the chefs/cooks are really moving fast and in a pretty tight space.  Makes you respect what they do (for peanuts I'm told) even more.  They also play really good music (it's not too loud, but a lot of good tracks).  I tried the french onion soup (they call it something else, but it's obvious what you are going to get), the potato and whitefish salad, the pork and the duck filled cabbage rolls and the winter greens and potatoes gratin.  Everything was good, but in particular the soup, cabbage rolls and potatoes gratin.  The soup was like a normal french onion, but the broth was not as overpowering and the cheese actually broke up nicely on your spoon rather than clumping into one huge cheese mound.  The cabbage rolls were incredible.  They don't look like Polish cabbage rolls, but almost like large brussel sports filled with rice and duck.  The potatoes gratin are kind of like scalloped potatoes on steroids and taste amazing.  The portions are big, so I would avoid the temptation of going for three courses.  Finally, as Kent P. mentioned, the space used to be Octopus Lounge a few years back.  If you ever went to Octopus Lounge (which I unfortunately did) it's worth a visit just to see what they have done with the place."}
{"text":"I came here a few weeks ago with four of my colleagues.  We ordered two bottles of wine, a variety of appies, and mains.  The mushroom salad was probably a bit on the saltier side, and nothing too unique.  However, the foie gras creme brulee with ginger bread was quite yummy.  The flavour of foie was not too overpoweringly heavy, and I was definitely addicted to the ginger bread.  For mains, three of us ordered steak, one risotto, and I ordered the catch of the day in a bacon cream sauce.  I also tried the steak.  The fish was probably a bit too creamy for me, and the sauce seemed a little bit too watery to be paired with the fish, though full of flavour.  The steak, however, was phenomenal.  If anything, come here for the steak because it was a good flavour, texture, and very simply prepared, though the dill was a nice touch.  The service here was excellent.  We arrived a few minutes late for our reservation to no mean stares or icy treatment, and the servers were attentive and good about refilling water and wine.  I also like the kind of rustic ambiance they had going on with the coal oven on the first floor and a cozy second floor, though seating is quite limited."}
{"text":"Amazing Grilled Ox Tongue! I couldn't believe this dish and had to write about it. It is cured somehow and is as tender as a marshmallow. I want that recipe. It's incredible. Also, try the spruce cured salmon. Overall the best meal I've had in Toronto."}
{"text":"This is the worst dining experience I have had in Toronto, perhaps in my life. Seriously, save your money because the food is overpriced and the portions are tiny.   The food took ages to arrive, and was bland, cold and small. We had a reservation, however were disappointed to be squeezed into a small table on the top floor, tightly surrounded by many other people.   The worst part of the experience was the extremely rude and unhelpful service. We first complained because the wine was corked (obviously not their fault), they replaced it of course, however this took an extra 10 minutes. The butter we were given with our bread was off, it had a cheesy taste to it. My father has worked in the food industry for 30 years and was confident it was off, they of course denied it. The server then dropped food and cutlery on my father, did not apologize until he asked for a wet napkin. We would have to call out to a server if we needed more drinks, napkins... and they would be extremely rude as they were clearly not serving that table. Finally, the bill arrived and we were over charged for the wine. When mentioning this to the server, he mentioned that WE were mistaken about this, however after getting out the menu and showing him, he finally reduced the price.   I have worked in the food industry for 9 years and have never experienced service this poor in my life. It was such a waste of a special night, expensive and frustrating. 2 other tables around us also commented on how awful and rude the servers were, and judging by the other reviews, it seems this is consistent.   I cannot say it enough, AVOID THIS RESTAURANT!!!!"}
{"text":"I went here last night, mostly because La Carnita had an hour and a half wait and because I've bought bread here a few times and have wanted to try the food.   Reading through the reviews here it seems as though there is a consensus: Food is good but overpriced. I ordered the Polenta Fries as a starter for $7. Yummy but the portion is worth more like $4. Ordered the Flat Grilled Steak $29 and the Potato Salad $7. I find it really annoying when restaurants charge in the upper $20s without sides included. Both were delicious but I think $22 for the steak and $5 for the salad would have made more sense.   What the problem is at this place is the service! The waitstaff are morons! They have no ability to guess accurate timeframes. They do not understand that the client is paying a lot of money here and should be treated respectfully. The staff was rude on many occasions. All of them! Someone else mentioned that here as well. It's possible they are underpaid in which case I feel the prices at this restaurant are a real sham. If you are going to charge $40 for a main with a side you need to be paying and training your waitstaff to treat the clients like gods. Period!   Sooooo, I would not return here because as much as the food is good it takes forever, the service sucks, and once it arrives the taste does not rationalize the price. I can get the same quality of food at Buca where they will kiss my ass and I won't wait forever or be spoken to with attitude and it will probably cost less."}
{"text":"Did I expect too much?  I was my first time at Woodlot.  I phoned on a Sunday and got the answering machine.  I hate that.  I hung up and phoned again ten minutes later.  Left a message this time; I didn't think I'd hear anything back.  No more than two minutes later, I was called back, and presented with a 9:45 seating.  Nice and professional.  Sure, sounds good.  Arrived to a full house, on a Sunday no less.  The hostess was very nice and showed us our seats.  They were in the very (see: very) sardine-like 'upstairs'.  You're literally sitting elbow-to-elbow with your neighbours.  The decor, however, isn't.  The bathroom reminded of something in a student's house.  In the basement.  Having said this, it had a great vibe; warm, busy, and lively.    Our hostess presented me with our vegan options, which was nice.  Our vegan options were limited, but at least we we given some choice, with at least one option per category.  This compares to the 'stare-of-death' I usually get when I go to a non-vegan restaurant.  Thumbs up.  The food was very good.  Nice and simple, fresh with great flavors.   Everything was almost perfectly seasoned.  Nothing spectacular, but really nice and comforting.  Our food-runner was suffering from first-day jitters?  Our server was really nice, until she disappeared during our mains, which was a shame, since I really needed another beer.  The bread was really tasty, and we were given a loaf to take home, which was very nice and appreciated.  I'll be back for another go, perhaps try to get a downstairs seat next time.  3.5 stars"}
{"text":"Cute and cozy little restaurant just off College Street on Palmerston. I went with a girlfriend for a night out and we made reservations. She had made reservations earlier that week, but we were only able to get a 5:30pm reservation, which is pretty early for dinner. We both found it really charming. The restaurant seating is up a set of stairs and overlooks the open kitchen downstairs. Since we went to Italy the year before, the oven that we got a full view of was definitely a nice touch and made us reminisce. Loved that they have a separate menu for vegetarians.   We ordered the Yukon Gold and Scamorza Cheese Croquettes for a starter and loved that. Perfectly crispy on the outside and warm and soft on the inside. For mains, I got the gnocchi, which was a small portion, but delicious nonetheless. It reminded me of the homemade pasta I had in Italy. My friend went adventurous and ordered the whey fed pork chop with the chocolate chilli sauce. She said the pork chop was moist and tender, but the sauce wasn't quite her thing. There wasn't too much of a chocolate spice flavour to it.  All in all, ambiance was great. We went when it was still cold out, but it did seem like there is a patio area outside, which could accommodate a few tables. There aren't very many tables upstairs, so the restaurant probably can't accommodate too many groups. There was one group sized table (probably fits about 10 people) downstairs right by the kitchen (and front door). There are also a few bar seats downstairs, but not too many of those either. It's a great place for a romantic night out or a catch up session with close friends."}
{"text":"OMG - 2nd time at woodlot (last time in May 2013) and it was as amazingly delicious as before. Usually disappointed when going back somewhere that I loved, but it is such a comfortable spot to eat and the food was delicious yet again. Love all their items that have mushrooms in it including small veggie plates and meat dishes. Wait staff always helpful and lovely as well."}
{"text":"There's some really innovative stuff on the menu--we had a fois gras creme brulee to start, for example.  It was interesting, but the sweetness of the brulee overpowered any other flavours in the dish--when I eat fois gras, I want to be able to taste it.  For the main, I had a steak, which was well executed but which wasn't particularly exciting (I found myself raiding my friend's gnocchi because I was craving something a bit richer).   Service was okay once we got to the table, but the host who met me at the door didn't say a word to greet me, just stared at me wordlessly until I gave the reservation name.  An unsettling start to the meal, and one which set the tone for the rest of the evening, unfortunately."}
{"text":"The vegetarian menu at Woodlot is amazing - it's a completely separate menu witha few pastas, like red fife papardelle pasta, a chantrelle mushroom lasagna with ricotta, gnocchi; and then a few different vegetarian dishes like  roasted tofu  with baked beans; tempeh pot pie with root vegetables; chestnut cabbage rolls, and more! I got the cabbage rolls, and they were very flavourful and delicious. All of their ingredients are organic and locally-sourced, and everything is cooked in a wood-burning oven. The portions are huge; so I recommmend going easy on the homemade bread and butter (yes they make their own butter).   Despite being a chocolate fan, I'd suggest skipping the chocolate cake - it's pretty basic, with nuts and cream sauce. However, the lemon tart with roasted marshmallow topping and blueberrry/custard is incredible - save room.   Great/friendly service. Lovely, casual ambience.  Mains are around $18."}
{"text":"Woodlot has been on my list or restaurants to try since they opened last fall. it all started with a massive twitter buzz then bled to the blogs. the toronto dailies followed, mostly with great reviews. toronto life named it one of toronto's best new restaurants of 2011. a lot to live up to.  decided to try it out on last night for telus tuesdays, an month-long event that comps diners an appetizer & dessert if you order an entree. i'm not a fan of these types of deals only because it brings out cheap diners, who tip poorly and have terrible dining etiquette. but we did it anyways (and i feel that we were kind of punished for it, our service wasn't bad, it just wasn't super friendly. i blame telus tuesdays).   Started off my meal with an appetizer of seared scallops on black lentils, prosciutto,  sauerkraut, dill & dressed with a light balsamic and great olive oil ($14). scallops were perfectly seared although a tad cold, lentils were perfectly executed, still held their shape but soft & tender on the inside. a great start to the meal.   For my entree i chose the duck confit with pork belly ($27). the duck & pork belly sat on  a stew of white beans, cheese (sorry, I can't remember what type it was), and breadcrumbs. the duck was fall-off-the-bone succulent. it was literally the best duck confit i have ever had. pork belly was super porky, fatty (in a good way) and delicious. as was the white bean stew, the breadcrumbs were the perfect compliment, added a great crunch and texture.  I loved my main. ed also loved his main, he had a ragu of snails on baked polenta ($26). the other two in our party weren't so lucky. they both ordered the strip steak ($29), the most expensive item on the menu, which comes with nothing on the side. both ordered a side, gnocchi ($8) for one, turnips ($6) for the other. the steak was....not good. i don't know if it was the cut or if it wasn't rested properly (or brought to room temperature prior to cooking) but it was chewy & not appetizing. gnocchi were good, but as with my scallops, there weren't hot enough and were a bit dense. turnips were tasty (because everything tastes good sauteed in butter). our waiter clearly noticed that the steak wasn't received well, both that ordered it left about a third on their plate. when asked how it was, both parties expressed that they weren't happy with it. waiter did nothing to try to rectify the situation, he didn't offer any sort of apology and kind of ignored their comments. it was strange.   Dessert ended on a high note. i had the lemon tart with homemade roasted marshmallow & blueberry ($8), pictured above. it was delicious, the lemon curd was tart & the sweetness of marshmallow complimented it perfectly. an apple gratin ($8) was also very good as well as the soma chocolate & camrel pot du creme ($8).  Overall, a good meal. i really enjoyed everything i had. i wish it was the same for the rest of my party. service was okay. i felt an underlying thread of pretension which i haven't  seen in a long time, and was surprised especially for a restaurant that is as low-key & casual as woodlot. i also found it a little over-priced. maybe our server was having an off-night. maybe he was annoyed that it was telus tuesdays. let's hope that was the case."}
{"text":"We booked our reservation weeks in advance for my husbands bday.  The decor of this place is nothing to be desired. As my husband put it, it looks like someone converted their garage into a restaurant. If it werent for the exposed brick and the candle light it would be awful. The atmosphere is good because its really small so it always  packed because it cant accommodate a lot a ppl. The background music is good too.  We both ordered the caramelized onion soup and the flank steak with a side of sweet potato. Why did we order the exact same meal. Well because there is no selection. I'm not feeling eating raw beef, with raw egg as an appetizer - catch my drift? The soup was good, $12 for small cup of soup better be. The steak was very ordinary. Nothing to be desired or savored. When we ordered the sweet potato we were expecting sweet potato fries. What we got for $7 was small potato sliced in up, and size wise it was the size of the palm of childs hand.   They have an extensive yet overpriced wine menu.  Its weird that a restaurant with a wood burning oven doesnt make beautiful pizzas - seems kind of obvious.  So $160 later for two people I definitely walked out disappointed."}
{"text":"This is my favourite restaurant in Toronto. I've been in twice, both times without a reservation but the staff have always been incredibly friendly, and done their best to get us seated as quickly as possible. I've always had mixed drinks, always delicious. I don't eat meat so I love that they have a separate vegetarian menu - though on my second visit my meat-eating friends said that their dishes were divine as well.   I've had the crostini to start both times, they change their menu a lot so these were different each visit, but they were amazing both times. First  visit I had maple glazed tempeh and it was off the charts. Second visit I was modest with my main and had their vegetarian french onion soup. This was also awesome, but slightly salty for my taste (though I'll admit I'm extremely sensitive to it).   I'd recommend this place to anyone looking for a really special experience, and I'll be going back soon (though this time I'll strive to make a reservation).  A+"}
{"text":"They have a veg menu. And they do gluten-free pasta. What more can I ask for?! Always try a pasta dish, they're all good. The mushroom salad is also a must order, and the amount of biodynamic wine options keeps me coming back. Get a cocktail at Bar Raval after... The perfect night."}
{"text":"Fantastic spot tucked away off College Street's little Italy neighbourhood.  Go for the Foie Gras + Creme Brulee with fresh spiced black bread alone. It's phenomenal. One of the best appetizers I've ever had.  Tried the roasted Haddock as a main -- Delicious. Perfectly cooked. Succulent, juicy, well presented and the right temperature.  If the food alone doesn't convince you then the atmosphere surely will. The room is filled with the smell of fresh bread as they bake everything in house in a wood burning oven. You can actually watch the kitchen from the upper balcony. Exposed brick and wood decor look nice under the low, ambient light. And the restaurant doesn't feel busy or noisy even at max capacity.  Great spot for a date. Highly recommend."}
{"text":"I have heard the hype surrounding Woodlot and decided to check it out since it was in my neighbourhood and I was famished.  The server came instantly after we were seated with menus and took our drink order. The patio was packed but the server was still able to come back with our drinks so quickly that we still needed time to decide what to order. He brought the homemade bread that was so good that it made me only want to eat that but we ordered appetizers, entrées and dessert. Everything was perfect! The food was perfect, the drinks were perfect, the service was perfect. I highly recommend this restaurant, it was a perfect evening."}
{"text":"Attracted by the great reviews, my friend and I were looking forward to our dinner at Woodlot and the nice wood smoke smell when we walled in was very inviting. Our bread was delivered with a flourish and the server said it was fresh-baked.. The bread was cold- really cold as if it had been in the fridge. We called the server and he said, Well, fresh-baked meant it was baked that day. He offered to warm up the bread. It was downhill all the way from there. My friend ordered the onion soup. It was just OK. There was cod on the menu, but they said they had pickerel instead which sounded like a nice choice. The menu said it came with Brussels sprouts and charred leek in a veloute.. What arrived was a bowl with two small pieces of white fish swimming in a white sauce with no vegetables in sight. Again, I called the server. He pointed out two finger-nail sized pieces of sprout and a few shreds of leek. And this cost $28! My friend ordered the pasta which as just OK. They offered us a dessert and we ordered the parfait which came in a huge glass sundae dish but which was really just a chocolate pudding with a sort of granola. Never again."}
{"text":"Tasticle!  Need I say more? After seeing the reviews I made my reso almost two months in advance. After reading all of the hype and waiting so very very long I was a bit worried that I was setting the Lot up to fail.  Fail they did not.   The decor is funky and homey. It's always nice to have great quality food in a laid back atmosphere. Right out of the gate I was impressed by the double menu. It is extremely liberating to be able to attend a restaurant as a vegetarian and not feel like a burden to the rest of the group. The carnivores salivated over the bone marrow delicacies while the four vegetarian eyes danced across our very own menu with delight.   Service was attentive and friendly which is to be expected at this price point but isn't always guaranteed. My significant other has an insatiable appetite for water so the ability to keep that glass full is always noted!   Everyone was pleased with their meals. My gnocchi was a tiny pillow of tasty goodness. I followed it up with the apple pie which was good but was quickly traded with my beau for his chocolate/hazelnut mousse. Sweet jebus it was tasty...and he is a good man for givin' it up!   All round a good time and I will absolutely be back - hopefully soon!"}
{"text":"4.5/5! Absolutely amazing. We had a hard time getting reservations but it was worth the wait. I highly recommend the wood-fire mushrooms, squash ravioli and iron steak! The service is top-notch. Cute place - great option for date night!"}
{"text":"Very cozy restaurant.  The food was amazing including dessert! Great service too!"}
{"text":"Woodlot is always in my top 3 in Toronto. I would recommend it to my friends, parents, colleagues, and a perfect stranger. I love everything about it. Being seated in either the chefs table, which is literally in kitchen surrounded by pots pans and baking trays, or upstairs in the intimate and cozy dining room, you feel at home. The food is always a 10 out of 10. My go to is the flat iron steak and the pork chop but I like to dabble in the separate vegetarian menu and pretend I'm Italian by ordering a second course of mouth watering pasta. Their wine list is often an interest read, I like the tenacity of the sommelier to pick wines that are out there, interesting and from regions you didn't even knew had great wine. Service again is always fantastic, consistent.  If you haven't been, you must, you won't be disappointed! Thanks for some of the best meals of my life Woodlot :)"}
{"text":"Outstanding food and service. Right from the beginning when the reservation was made, the customer service was superb.   Both the mushroom salad (one of their staple menu items) and kale salad were great. Found the kale salad even more impressive than the mushroom one.  The pickerel fish was a small portion size but it was really good. Luckily the flat iron steak portion was a hefty portion size which made up for it so that we were able to leave satisfied by sharing the two entrees. Steak was delicious!  They change their menu quite often. i would definitely go back and be excited to try other dishes they bring to the menu."}
{"text":"We loved dinner at Woodlot. We'd been meaning to get to this place for a while so we walked in without a reservation and told there'd be a 45 minute wait (the space is small so play it safe and make a reservation). We walked around a bit and came back and were seated right away. Some amazing bread arrived first then we had the gnocchi and sea bass with warm kale salad and rapini. All excellent. Washed it down with an Ontario wine and a local beer. Followed it up with desert (delicious -no idea what it was) and a nice espresso. The space is very cozy and smelled nicely of wood smoke from their oven on the first floor. Service was good but not excellent. A bit on the pricy side but well worth it. Will recommend and will be back."}
{"text":"Had a great experience at Woodlot last night. Two things that stood out were (1) the tourtiere - I'm from a french Canadian background and it was amazing - and (2) the service. They actually waited for everyone to be finished before clearing the plates, which meant that no one felt rushed to finish.  Thanks so much Woodlot for a great evening-we'll be back!"}
{"text":"Me and my girlfriend went there on a Sunday night. We didn't have reservation but were able to find a spot on the patio !   Menu's selection was very limited but we each ordered 1 appetizer and 1 entree !  After a few long minute we get our entrees : crab salad and Yukon gold cheese stick, not bad but nothing Waouw ! Specially after tasting that delicious bread and butter !  Then goes an hour and it gets really chilly outside so we decide to sit at the bar! And there goes another 20min to finally get our entrees. And big disappointment ... Small portion, cold, Too salty,... Appetite was gone, and we couldn't finish !  The place was not busy, I wish we had a better service. At least a warning about the slowness of the kitchen!"}
{"text":"It was cold and wintery night outside but arriving at Woodlot with the enormous stone oven all fired up made it perfectly cozy, and worth the snowy trek. And the additional bonus of hot cocktail (hot apple cider with Wyborovka vodka) in hand waiting for our table made it even better.  As a note - I made reservations 2 weeks ago to ensure we had an ideal time of 8pm for dinner and that said, we waited for another half an hour but over cocktails, catch up and people watching, it was fine.  The bread and the dessert were the most memorable things about dinner.  Dessert b/c of their house made marshmallow topped on a lemon curd .. mmm.   Bread b/c some other restaurants in Toronto swear by it.  It's crusty and home made!"}
{"text":"Great atmosphere, very mediocre food. Not much taste or flavours.  Would only go back for drinks to take in the scene.  Food was way too hyped up."}
{"text":"Had the rainbow trout and it was fantastic!!! I could skip the potatoes gratin (The tuna is enough without a side), but the Jon Snow cocktail was very good."}
{"text":"We recently dined at Woodlot and although this restaurant was recommended to us, we had a very unpleasant experience. It was very loud and noisy, the food was just mediocre ( at best) and the service was terrible.  We waited 1.5 hours for our meal.  In fact people who came after us were served and finished eating BEFORE we got our meal ( we were only a party of 4)."}
{"text":"Great new spot on Palmerston.  Came during their soft opening and loved life.  I can tell this is going to be a favorite during the cold winter months ahead.  Extremely warm interior, good service, and the food is fantastic.  Started with the grass fed beef tartar, seasoned only with salt, pepper and olive oil.  Very flavorful.  Had the Rabbit agnolotti for my main, which i completely finished.    My gf had the venison pie and we all agreed it was a winner.  My only issue, if you could even call it that, was that the pie would have been good for 2-3 people to share, but they don't have it noted on the menu.  You won't be disappointed."}
{"text":"Visited the Woodlot based on the recommendations at Yelp as we were seeking a restaurant that would cater to both vegetarian and non vegetarian parties. Loved the mushroom apps, halibut and the pork chop. I hear they have onion soup only in the winter time so that is my motivation to come back. Would strongly recommend making reservations as it was packed even on a mid week. Also suggest to read the reviews and preview their menu before hand as this will make your selections easier. Enjoy!"}
{"text":"Tomato Watermelon Gazpacho - 9 To get us warmed up, we began the cool night with an equally chilled soup. It really isn't meant for a four way split, but we managed. Watermelon and rich tomato reduce to make a soup only a bit thicker than broth, oddly hearty. It had such an interesting play between tangy and sweet. The bites of salty feta and black olive nibbles brought the sweetness back into focus after each bite.  Hokkaido Scallop Ceviche -14 Visually more related to sushi than I would have anticipated, the ceviche arrived in elegance. The scallop was tender, and unlike other ceviche that I've had, you hardly noticed the lime, which was cleaned away before serving. Instead there was a side of fat black quinoa grains, and a whipped avocado sour cream. I found that too overpowering with the delicate, darling scallops. The quinoa was wonderful by itself, hearty with crunchy kernel hearts. Sea asparagus spears and grapefruit sections added bursts of difference. There were flakes of sea salt that kept us coming back for more.  Roast Naturally Raised Flatiron Steak - 27 We were all so blown away! Mary had this great steak, which is funny for a couple reasons. Mary isn't a big beef fan, and she also (I'm sorry Mary!) has never known how to appreciate the meat. She gets steaks well done. In a very bold move she ordered this medium well done, and I was impressed. The poor chefs, having to do that to beautiful meat. It may have come out straight medium, it was still very red in the middle- Mary has always hated the red. She loved this. I love this. My mom and Elena loved this. With hints of miso and soy, there was a seriously interesting and rustic undertone to the meat, but it never overpowered a genuine flavour. The scallions piled over the slices of tender meat were pearly and translucent, garlicky as well as oniony, adding a gentleness.  Chop of Whey-fed Pork - 26 A whole half belgian endive (witlof, my mother calls it by its Dutch name) was grilled and laid atop a sliced brick of pork, it's fatty rind thick and seeping flavor into the meat. The vegetable was very bitter, as you would expect, but with sprinkles of salt over buttery olive oil which when eaten with the pork, made a balance. I thought I tasted a tease of balsamic. I found the meat hearty for pork, actually quite sustaining. The drippings tasted of smoke and cracklins, but mostly the meat was natural and that was all it needed.   Roast Pacific Pickerel & Porcini - 23 Simplicity is the best route to take when handling fish. Anything heavy handed, and you lose the delicacy, especially with a white fish. Here the pickerel flaked off the fork, little drops of natural oil peeking from the crisp (not crackled) skin. It was a light cilantro drizzle than punctuated a fresh flavour. The fish had a good natural fat, while still solid and just cooked enough to be hot without even coming close to dryness. I would compare it to satin. The wedge of fish was beautifully accented with shaved fennel, peas and beans.  Red Fife Whole Wheat Papardelle - 15/21 These noodles were wide and flat, ambitiously encroaching on lasagna in breadth. The red fife grain doesn't change much of the flavour or texture compared to regular semolina pasta, but I felt very full for the amount in my small order. That could be because the pasta was so wonderfully cheesy! The sauce was spiked with a vinegary taste of mustard, but mostly tasted of butter, cream and romano. It was very rich! What really amazed me was the whole filberts studding the whorls of noodle, adding crunch and a lusty sweetness. There was also a sprinkling of tangy baby chanterelles on top, making the dish wind up hearty and earthy.  Caramelized Jerusalem Artichokes - 6 Not realizing how filling even a small order of the papardelle would be, I had ordered these Jerusalem artichokes. This is another first in my slowly growing knowledge of good food, and less common ingredients. I really has expected, well, artichokes. These little fellows look like beets. While there's a hint of the succulent bitterness of a globe artichoke, it's very hard to compare them. Apples and oranges. These were bittersweet, the sweetness coming from a heavy caramelizing. They were firm and crunchy like radish, but hot as hell! I thought I could taste hints of parsley and leek, and like many things from our dinner at Woodlot, a twist of citrus. They were a hint too heady sweet for my taste in the end.  Japanese Cheesecake - 9 Occasionally I find cheesecake so painfully overwhelming and heavy handed- but this is Woodlot. The cheesecake was light with a texture more like spongecake, the cheese milder than one would find elsewhere, cut with a citrus hint of orange zest. Even the amaretti graham crust it sat on had a lightness to it. The pistachio ice cream began to melt quickly as a flurry of spoons hurried to try everything by itself, scooping up gobs of ripe peach as well, and then together for the meld of flavour. Together it's very sweet."}
{"text":"Food was good but not amazing. Chef relies heavily on salt to elevate straightforward dishes. The service was efficient but somewhere between cold and indifferent. Portion sizes were absurdly small both for the price and notwithstanding that it's supposed to be fine dining. Basically good across the board but still not a pleasant experience. Excellent bread."}
{"text":"For a restaurant that has a loft-like appeal to it, it actually feels cozy inside. If you are on the top floor, you will find a nice view of the kitchen from above. The dark wood colours and blazing oven create the warm charm of this place. The sourdough bread was a nice way to start. The apps and mains were delicious. And the star of the night, surprisingly, was the gnocchi.    The only negative was that they ran out of wild boar, which was the dish I was eager to try. At the same time, it is expected in a restaurant that has quality ingredients. I had the pork chop instead, which was juicy and well seasoned. The sweet and tart flavours of the side and garnish paired well too. I like small menus, but I think they could do with maybe 3-4 more dishes.   I will come back here. *thumbs up*"}
{"text":"This food is so well-balanced and smart. The Hen O'The Woods Mushrooms were amazing as was the sour-dough Agnolotti and the ricotta-stuffed roasted pablano pepper. I think the Agnolotti was the best pasta I've ever had - it was perfectly al dente (unlike most Italian restaurants which still overcook their pasta). The server was very pleasant and just attentive enough without being overbearing.   The only thing I would change would be avoiding the Duggans #5 beer, but that's a personal preference.  All in all, the best eating experience of the past 5 years, I think. Can't wait to go back."}
{"text":"Superb meal. We shared a cold smoked mushroom appetizer with wild rice and beets and each had a fresh vegetarian pasta for our mains. Everything was wonderful. I was particularly excited to see orange wine in the menu as I had been wanting to try it. I was not disappointed. The service was lovely. The one tiny issue was that my friend got the \"market price\" beer and the server didn't tell her how much it cost and when the bill arrived we were put off by $24 for 500ml of beer.  I really liked that they have the wood oven but are doing inventive food with it instead of serving pizza."}
{"text":"The ambiance was the most attractive part of Woodlot. Beautiful candlelight shining on wood gives it a quaint feel and warms you up. Some of the pastas were delicious, but the meat mains could use more flavor. They do have spectacular vegetarian options as well. I loved the innovative cocktail menu with the Game of Thrones theme. This is a splendid, cozy and romantic spot for date night."}
{"text":"My rating for Woodlot is 3.5/5. It had been on the top of my list of restaurants to try for a really long time, and I inevitably had high expectations for the food.  We started with their infamous Caramelized Onion Soup. It's flavour profile was incredibly acidic. There was a noticeable addition of some sort of vinegar to the soup, and it totally killed the mellow richness of the sweet onions. Disappointing.  The Ember Grilled Hen-o'-the-Wood Mushroom appetizer faired better. It had a lovely variety of textures, and was seasoned to let each component shine. It has been a staple on the menu for sometime now, and I can understand why.  The Hokkaido Squash and Amaretti stuffed Red Fife Ravioli was my main. Holy this dish was sweet (not in a good way). It read more like dessert than an entree. The Amaretti was the predominant flavour of the entire dish and completely masked the squash. Not my favourite.  My friend had the Egg Pappardelle with Braised Duck and Porcini and it was DELICIOUS! I wish I had ordered the same. The pasta was perfectly al dente, and the Duck Ragu was homey and comforting. Loved it.  Overall, the dishes were a bit hit and miss for us. I would definitely give it another shot to explore other dishes, or come back when their menu has rotated."}
{"text":"Went to Woodlot for a belated Valentine's day excursion.  Thought it was a wonderful place.  Extremely unique layout with an upper level that overlooks a small but interesting and very busy kitchen.  Started with French onion soup and the pasta with wild boar ragu.  The French Onion soup ranked up there with other \"A level\" FO soups available elseware.  The pasta with wild boar was wonderful and is truly a house specialty as suggested in other reviews - I'd say it was the tastiest dish of the night.  Enjoyed duck cabbage rolls and chicken and smoked ham hock pie as mains.  Duck cabbage rolls were unique and cool - plenty of duck in there which was good to see.  Taste is light, not overly spiced, no sauce, but flavourful nontheless.  The pie was very nice as well.  Big but not outrageously huge.  Had a very homeade taste to it ie-natural flavours, again not too powerfully spiced.  Service was superb - there were multiple servers that made sure all customers were tended to extremely well.    Dessert was an apple tartin with honey gelato - this was awesome! Apples were tender with honey almost \"baked in\" through their pizza oven.  Expresso was also superior to most restaurants.  To be extremely particular, Wife and I both felt food at a recent visit to Brockton General was a slight shade tastier than here, but that the atmosphere was a comparibleslight  shade better at Woodlot.  Looking forward to a return visit!"}
{"text":"Warm and cozy ambiance. Great, high-quality food and great drink selection. As other Yelpers have stated, they have two versions of their menu: one for vegetarians and one for meat-eaters. We were a large party and the super friendly staff even threw in larger portions just so we could all try a bit of everything. They also gave us phenomenal mini-macarons in lieu of candies when we got our bills!"}
{"text":"Loved this little restaurant.  Beautiful ambiance -- warm, woody, friendly.  They had a separate menu for vegetarians (not vegan) which is nice, allowed me to peruse the menu without having to parse out the meat. The food was all excellent, tasty, tastefully put together, unusual but not forced. Good gin (not a big selection but some good ones).  The desserts were too sweet but very very tasty anyway."}
{"text":"We checked this place out not long after they opened and were surprised to get a seat after all the rave reviews they were getting. It was cold and snowing outside but the massive oven was fired up and pumping out heat. It was so cozy, we didn't want to leave. As sad as I was to see the Octopus Lounge go, these guys have a good thing going. I wonder, though, what happened to the curvy wooded wall that used to be in Octopus?  We were seated at the bar counter next to the front door. It's a weird spot but we could check out what was happening in the kitchen - which was plenty. The back corner of the kitchen is filled with a mammoth wood fired oven that's in constant use, though apparently never for pizza.   The menus and the wine list are very well written. Our server indicated that their bread guy was the author. After tasting his amazing bread, now I want to meet him. I've got some questions about my own sourdough experiments. There are actually two menus: one for vegetarians and one for the normal folks. I discarded the vegetarian one and homed in on the goods: venison pie! Our server tried to warn me that it would be too much, especially after having bread, starters and sides. Undaunted, I ordered it anyway. It was huge! There was an enormous bone sticking out of it! The couple next to us were starting to look scared. Needless to say, I killed it and it was absolutely delicious! The Lady liked her stuff, too, though I can't tell you what she had.  Woodlot is a really great place. It's inviting, has nice decor and great service. The food is tremendously comforting and a phenomenal value. They should start selling their bread on the side, too.  If they weren't so busy, I'd be going back very soon. Unfortunately, every time I call for a reservation, they are now fully booked up."}
{"text":"It had been awhile since I had been to Woodlot, or heard much about it, but I'm happy to report it was still incredibly tasty food and a great experience/ top notch service. Most affordable dining option? No, but great food and a lovely special night out.   This review is slightly delayed, so they were still on the tail end of their winter menu.   My advice at Woodlot is try to order a few smaller plates so you can try a few different things. They also have a full veggie menu and a full meat menu, so regardless who you are dining with, they'll have some choice.   My dinner companion and I started with grilled hen-o-the-woods mushrooms and roasted winter squash dish which had pomegranate seeds, cheese and who knows what else deliciousness. Both dishes were flavourful and rich. My companion doesn't actually like squash or mushrooms that much, but enjoyed both.   For my main I had a half order of smoked crab agnolotti. Good to note - you can do half orders of any pastas. The smoked crab made it kind of light and delicate, and it was really good. My dining companion had pork chops, which also got top marks.   Weirdly the only food item that fell a little short was the bread. While their wood oven cooked sourdough is still good, it was a bit of a let down to have it cold. But, that was an extra, and just bread, so still a 5 star meal.   Good wine selection, with some reasonably priced glasses. Decent beer selection, but not on tap.   Service was attentive and knowledgeable without being annoying. We made a reservation and we're in the upstairs area - it was cozy.   Will go back and have some French onion soup - I've had it on a previous trip to Woodlot and it's delish."}
{"text":"The food is terrific. And the atmosphere is great too. The only complaint is that even though I made a reservation, my table wasn't ready until 30-40 min after the reservation time. An outstanding meal, though."}
{"text":"Perfect location (though it has been described as being a little too off the beaten path, but I think it's juuuuust right).   Perfect atmosphere (San Fran farmhouse meets Tuscan bakery meets NYC buzz).   And almost perfect food (cause I think I've had perfect-er).  I called in on a Monday to make reservations for Thursday, and thank goodness I did because everytime I called after that leading up to our dinner (wanted to change our meal time), it went straight to the machine. When I arrived, I suggested to the hostess, \"um, I wonder if one of your phones is off the hook?\".   \"Nope!\", she replied. \"I've just been on the phone all day it's been so busy!\".  Yeesh, when a restaurant in Toronto is \"hot\", man, is it ever hot.  Woodlot is definitely hot. Like... Stephen Dorff hot. Nay, like Ted Williams hot.   We were seated upstairs at the edge with a great view of the open kitchen below, and kickstarted with a half litre of our server's recommended white.   Food was slow to come out, but the energy in the 2-storey loft space fuelled conversation that helped the time pass, not to mention the neverending bread basket of their stone-oven baked speciality breads. Mmmmmm......  We started with the Atlantic crab and white bean salad, topped with a swirl of prosciutto. I thought it was tasty, but nothing to be thrilled about. My dining partner, however, enjoyed it much more than I did. Perhaps it was a little too light for my liking - I was waiting for the hearty good stuff!  Mains appeared - I with the smoked chicken and hock ham pie (huge, super deep dish, creamy and packed with root veggies), and my companion enjoyed the whey-fed pork chop. Both dishes were pretty hefty servings, and the flavours were just right. We also ordered a side of bone marrow potato mash. The bone marrow made the mash extremely creamy and light, and was just what we needed to balance out our mains.   Dessert sightings looked delicious, but we were both far too stuffed to go there... ah well! By the time we finished it was 10pm. The place was still packed, not an empty table in the house. No wonder they can afford to be open till midnight for dinner.  Oh, Woodlot, 2011 is going to be a good year for you."}
{"text":"My husband and I just moved into the neighbourhood, and were excited about having Woodlot close by.  We went on a Tuesday night at around 8PM with no reservation. It was busy but they were able to seat us. They warned us they were a bit short-staffed in the kitchen, so the wait would be a bit longer.  We ordered some wine and beer - both delicious, though the wine seemed like 3oz tops.   We ordered an appetizer - the polenta fries. It took about an hour to bring it out (by which point I had finished my wine). They were very delicious, though seemed like a long wait for such a small bowl.  About 45+ minutes later, our entrees came out. I had ordered the carrot and ginger agnolotti and instead received the gnocci poutine, however we were so hungry at this point I didn't send it back. It was ok; the gnocci itself was a bit bland and gluey, though the porchini gravy was nice. My husband ordered the trout and loved it.  We loved how we could see into the open kitchen, and had a lot of fun watching the staff work. It seemed very organized and calculated - we were impressed.The staff were very nice. They were certainly apologetic about the wait time, though didn't offer much compensation - we weren't in a rush, but a complementary refill on a drink or a small dessert would have gone a long way.   For 1 appetizer and two entrees (one of them being a 'small' portion order), we were there for over 2 hours and paid ~&80 (we each had only one alcoholic beverage).  Overall, we felt the wait time was too long and the price too high for the amount of dishes ordered and portion sizes.  We are definitely going to give it another try - we really loved the vibe and ambiance, and hope that our next experience is a bit better."}
{"text":"I would have to agree that woodlots is one of toronto's finest. Having only been open for a couple months they have it down to an art.  Plus with a veggie and meat filled menu....everyone can find something they like.  My personal recommendation the smoked fish and potato app. MMM!!!"}
{"text":"My girlfriend and I went here for our anniversary some time ago and absolutely loved it. I don't remember what I got but I remember she got butternut squash ravioli and it was amazing. Really cool space, great atmosphere and the staff was knowledgeable and friendly. On our way out I guess they had baked too much bread during the day and gave us two loaves of freshly baked bread. Definitely got to go back soon"}
{"text":"Woodlot is an incredible local gem that gives vegetarians interesting and delicious options beyond tofu and veggie burgers. After making a reservation a few weeks in advance, we were seated at a table in the loft section. We were cozy and warm without being shoulder-to-shoulder with other guests. The atmosphere was lovely and the wood burning oven and candle lit ambiance created a pleasant vibe. Our server was extremely knowledgeable and offered up suggestions and great descriptions of all the menu items. We were especially happy with the apricot and buffalo mozzarella crostini and moroccan-spiced root vegetable pot pie. All-in-all, a delicious meal to satisfy the tastebuds of vegetarians and discerning restaurant go-ers alike."}
{"text":"Terrible reservation system, you call the place but don't get to speak to someone, asked to leave a voicemail with the requested reservation.  Left two voicemails but 24 hours later no call back.  Sent an email and was told hostess would be making calls that afternoon.  Showed up and rude hostess said she did make a call (a mystery call we never did receive), and that we didn't have a reservation.  When asked why she didn't leave a voicemail, hostess said she doesn't leave voicemails (which makes no sense, would have saved us a lot of trouble to let us know they were full).  Food smelled good, but that's as far as we got, had to head back out into the rain in search for an alternative."}
{"text":"Upstairs, right on the left of the staircase there is a Pieter Bruegel painting (well, not the original) titled \"Hunters in the snow.\" It's a depiction of an ideal quotidian country life: hunters returning from expedition, people in the distance enjoying their lives, wood burning at a corner; and somewhere some people are cooking. Yet all is slow, calm, familiar, and tasty.  Woodlot is a lot like this masterpiece. It is calmingly humble in service, warm in atmosphere, friendly with furniture, slow--as it should be--in preparation, and rich in flavours.  Let me simplify: you do not want to rush enjoying your meal. Not that I am suggesting you shouldn't. But after the first bite you realize yourself that... you ... are... there ... to... enjoy ... every... bite... every ...smell...every ...glance... every ....sip.  I am not going to write about which meal I had, or how much it was, or who my favorite server was.  Instead I say this: order whatever you wish; I cannot imagine these people getting it wrong. But do order yourself, and your party, to slow down and to enjoy everything this place has to offer."}
{"text":"When i first heard about Woodlot it intrigued me because of their menus. Local, comfort and a carnivore and vegetarian version of the menu. This was perfect as my wife is a vegetarian, and I am the furthest thing from. Perfect for both of us.  Getting reservations is a tad difficult as the place is small and it seems everyone wants to get in. When we finally did get in we were far from disappointed!. I have been twice and the menu has changed between the first and second visit. However on each visit the food was incredible. The first time I had the chicken & ham pot pie. (To be honest i wanted the duck confit cabbage rolls, but my wife go the vegetarian ones, so the server suggested this instead) and i am glad i tried!. It was incredible. Warm, hearty, creamy, full of flavour. The cabbage rolls were incredible also (and that's even with the lack of duck!)  The second time, I finally got to try their duck confit, but it was not in cabbage roll form. It was made to perfection. the skin was crispy and flavourful.   While the menu changes, there are 2 things that are constantly AMAZING - the Onion Soup and the soma chocolate dessert. Make sure you make room for both.   I will go back every time they change their menu, (and maybe more than that) its become my fave restaurant in TO!"}
{"text":"Went to Woodlot a couple of weeks ago to celebrate a friend's much-needed and long-awaited breakup with some kickass food and was a little disappointed, although as Renay R. points out, it helps if one does go in with lowered expecations which is not to say it was bad, I just don't think it's AMAZING.  Woodlot's been getting a lot of press and there no shortage of hullabaloo about it which I'm not knocking as I think all new places deserve a big kickup and whether the place survives is totally up to them. So far they're doing great and I plan to go back again eventually; when I do, I'm certain they'll still be there.  The decor is very welcoming and cosy, it provokes a casual and homey feeling, which is nice. The service was very friendly, attentive, and not at all dismissive or rude as with some new (some not) restaurants that have quickly made a name for themselves.   With the renos (slated for August when they'll close for a week) there should be more seating which is a plus as the night we went, we were not able to secure a reservation (called that morning) and simply walked in hoping 6:30pm was early enough to beat the crowds. Not so. We ended up sitting on the stools which were a split-level below the entrance, near the bar. It wasn't so bad at first but then another party of two showed up which halved our already cramped quarters and made for an uncomfortable arrangement as my head was lost somewhere in the jackets that hung up on the wall next to me and our stuff had to be rammed into the little window area. It's great that Woodlot wants to allow as many people to come and enjoy their food but that space should not be made to accommodate more than 3 MAX. But hey, I guess that's a risk you take when you have no reservations.  On to the food: I started off with the onion soup which was fine, nothing crazy. For mains, we had the tagliatelle (full size $19? they also offer a half portion) and the duck. At first I was irked by how small the pasta was, I couldn't imagine what a half order would amount to! It had a few peas nestled in and was quite salty. The noodles were way overcooked such that one could not separate them; instead you got one big clump on your fork when trying to lift any part of it. The duck was great (but small), cooked and seasoned just right. Surprisingly, we were quite full given how small the portions were; maybe it was all that salt.  For dessert, we had the lemon tart which was tasty. I've never been a huge lemon dessert fan but wanted to see what all the fuss was about. For me, it was just OK but got to be a bit much after a while with all the tangy lemony-ness though the marshmallow helped to tone it down a bit. If you're a fan of lemon sweets, I am sure you'll like it a lot.  My friend had already snacked before we got there as she was anticipating a long wait (good call) so we didn't order much more than that, though we are usually really big eaters! I meant to give this place 2.5* but can't seem to figure out how to halve the stars...I would definitely give the place another chance as they have promise and I think we were just unlucky that night, though it wasn't horrible. It wasn't long after opening (for the day, but also in general) and was already packed so one can imagine the hairied pace of things from their end. I am not usually as big of a softie and even though I don't go to restaurants solely for their service, theirs was good and the place seems sincere in their efforts so they surely deserve another go. Next time I'll be sure to make reservations!"}
{"text":"I love Woodlot. I've been here twice now and it's amazing. I'm a vegetarian and my boyfriend is a meat eater so it works out perfectly. Food is delicious, great service and nice variety of wines. The French onion soup is my favourite but its not on the menu anymore. Just go."}
{"text":"Well, this has to be a somewhat long review.  The Woodlot is out of this world in many ways.  Vegetarians, such as I am, are in the City of Toronto very very often relegated to second-class status, in restaurants run either by people who watch The Food Network too much or who think anything with chick peas is nifty or by people who couldn't care less about anyone who won't confess to being devoted to boar, venison, bacon, pulled pork, bacon, ham, bacon, or bacon.  The Woodlot thinks vegetarian dining should be beautiful, elegant, full of excitement, and utterly competent without being either prissy or ridiculous.  The mushroom fricasée, the agnolotti, for two examples, are splendid ++.  Very good wines.  Friendly service.  And full complement menus for vegetarians and non-vegetarians alike.  A major plus was the absence of a soundtrack.    In a separate note, the multigrain bread baked in the brick oven here is so good one cannot stop.  I repeat:  so good one cannot stop."}
{"text":"I've been hearing about this place for a while, and when you hear such good things you expectations rise. Well Woodlot didn't disappoint; not one bit.  Everything from the bread, which we had actually tried before at Brockton General, to the dessert, a salty/sweet chocolate mousse was excellent. The portion sizes were generous, and the flavour and freshness of everything was far better than I even thought, even though the expectations were high.  All the food was very winter oriented, and given that it's winter, it fit very well. In the summer, we'll assume (and hope) that the meals become a little lighter and we'll get to enjoy the food in those months too.  Defintely go check this place out!"}
{"text":"Really enjoyed my experience at woodlot.  Interesting food,excellent wines and  over all cool atmosphere!  The day after eating my dinner there I went back for some fresh baking and a coffee. Liked it in the daylight as well!"}
{"text":"We went to Woodlot this Friday to find a full restaurant. Thankfully, we had reservations for two and they gave us the best seats in the house, in my opinion.  We had the kale salad, ravioli, and cavatelli. All were tasty and inventive... and I could taste the quality of ingredients.  Our server was lovely as was the ambiance.  Although I'm not hung up on any of the dishes and need to have them again... I would come back every once in a while as it was a pleasant dining experience."}
{"text":"To be honest, I was disappointed.   Having heard many great things about this place, and knowing how difficult it is to get a reservation, I had high hopes walking in.  We walked in randomly on a Sat night around 9pm. The place was buzzing. Without any reservation we grabbed a seat at the bar and waited for a table. The servers were very nice and attentive, saying they will clear up something upstairs very soon. Off to a good start, I thought to myself.  I ordered a cocktail at the bar. I asked the bartender for something vodka based and on the sweet side. He gave me a bitter red-ish drink. Maybe I wasn't clear enough. My friend ordered a white wine, it tasted like they watered it down. Ew.   Soon our table increased from 2 to 3 people. Not a problem, we still got a decent seat upstairs in about 20 mins.   The bread came, (I was looking forward to it), it was cold, hard, gross. Blah.  We got a bunch of apps to share. Since the oven is the main attraction, we thought it'll be nice to try something from it.   Charred Haloumi Crostini and Ember Grilled Hen-o'-the-Woods Mushrooms to start and a half dozen oysters to follow. Crostini was not warm. I expected it to be. And it was difficult to bite but too big to fit into one bite, all the stuffings leaked everywhere. Taste wise not bad, but not amazing. Mushroom tasted very earthy, prob one of the best dishes of the night. I can really taste the wood oven from the dish. Oyster, fresh. Loved the sauce. But hey, I didnt come here for oysters, I can go to Rodney's for that.  Mains, We decided to get a bunch to share again. We got the large rabbit pasta, pork chop and oven baked sweet potatoes. The pasta was oily but the flavour wasnt there. I've always had good experiences with rabbit, but this wasn't on par. The pork chop... Some pieces were alright, most of it was really dry. and the portion was ridiculously small. Baked sweet potatoes tasted good. Just like sweet potatoes. Yum, I can make that at home.   For a meal coming up to $160 for 3 was not that satisfying. I thought my friends had better judgement in restaurants. Or they just slipped a lot in quality since then.  If you are in the mood for some actually good fine dinning, may I suggest Frank's kitchen down the street?"}
{"text":"Woodlot opened this weekend, and I had heard good things.  Most restaurants aren't ready / up to snuff in the first few weeks, let alone the first few days. Three of my most finely refined food lovers and I all left overly stuffed and totally satisfied.  Space: From the outside, looks like it used to be a shitty old garage (was the Octopus lounge or something). Inside, it's two floors, an open concept kitchen and bar (hint: go upstairs for a the best view of the oven), with a lot of wood (which makes sense).  Menu: There are two. One for the meat loving crowd, one for the vegetable loving crowd. Important to note: Most veg options at restaurants are like...a shitty mushroom risotto. Not here. There was housemade pastas, roasted chestnut stuffed cabbage rolls, french onion soup with caramelized onions, brussel sprouts doused in butter- it was an entire menu of local/organic produce.   The meat menu: So hard to pick something. The portions were huge...so don't feel necessarily cheap for not ordering a starting/middle plate. Maybe get a few to share for the table....but if you can get through all three courses....you're a champ.  There's a bunch of pictures we took so you can see what's what- but I had the venison pie (filled with gravy and root veg). The pastry on top of it was...wicked (FROM OMG NO LESS http://www.yelp.ca/biz/omg-baked-goodness-ltd-toronto). The giant bone in the middle was very esthetically pleasing/sort of sexual. To accompany I had an order of bone marrow/potato puree which was basically a really creamy mashed potato. Nothing too wild there.  The cabbage rolls stuffed with roasted chestnuts and barley were incredibly flavorful- ordering veg is not a step down here.  For dessert we tried the chocolaty cake and cream (which left something to be desired...whether that be making the cream hot, or making the cake a little less dense) and maybe one of the best deserts I've ever had... a lemon tart with wild blueberries and a house-made marshmallow on top. It was like heaven in a tart.   As soon as the meal started, I vowed to go back tomorrow... but after such a giant meal- I'm going to have to recover / work off about 800 calories.   Staff / Chef were all very attentive, giving advice on pairing, suggesting their favorites, and advising on wait times (the pastry on the venison takes an extra 20 min). They were all very attractive also, which always boosts up the experience."}
{"text":"i like Woodlot very much! they consistently deliver very tasty food. my partner who is vegan was also very happy with the food. that is an achievement! i also like the ambiance and the decor which are warm and unassuming. same goes for the service.  Woodlot is one of my favorite Toronto restaurants!"}
{"text":"We visited Woodlot on July 24, 2011.  Even though food was quite memorable, it didn't make up for the slow and unwelcoming service.  We got to the restaurant at 8:30pm, everything was running smoothly until we got our appetizers.  It was about 9:45pm and we were still waiting for our entrees.  Our waitress seemed undisturbed by us waiting over 40 min for our mains, until I requested to speak to the manager.  It was then, when they offered a free dessert, (which we didn't have time to eat).  I don't recommend going to this place, there are plenty of good places in the city with efficient and welcoming service.  The good food doesn't make up for the lousy service.  I guess Toronto Life had it wrong this time."}
{"text":"Pretty good but small and large pasta portions are basically the same size with a significant difference in price. Chocolate banana mousse dessert was pretty mediocre."}
{"text":"http://bit.ly/de8U5C  Woodlot, Woodlot, Woodlot.  All the foodies are talking about Woodlot. We went last night to this wonderful little restaurant/bakery with very great food and very un-great internet presence.  They have a vegetarian menu and a meat menu, which I think is a fantastic idea.  My friend Adam is the barista during the day there, so go check out his fantastic face while you buy a coffee and pastry. The wine list is affordable.  They also offer two beers at the $5 price point. What did I eat?  Some tasty, tasty plates.  Click the link above for photos and descriptions of what I ate."}
{"text":"I'm in from NYC and heard great things about this place from Toronto Yelpers.  Meh, I was unimpressed.  I don't like negative reviews that go through every dish they had and what was wrong with it, so I'm not going to do that, even though I could.  First off, the wait staff (5 stars) was great and the wine list (4 stars) was very good but that's not why we go to restaurants.  We go to restaurants for food and that's why I give this place 3 stars.  All I want to say is that a restaurant of this pomp and circumstance (and price) should know how to cook gnocchi.  They don't.  Overdone.  The food has a lot of potential but the execution is just not there.  Hopefully the kitchen just had an off night (Thursday) but it seemed to be more of a systemic problem than that.  The flavors didn't compliment each other, just the opposite, they insulted each other with one usually overpowering the others.  Oh well, at least the wine was good..."}
{"text":"It's seems every new restaurant is pushing some version of locavore/farm-to-table dining, sometimes sacrificing taste in the process. Woodlot follows a similar ethos but equally emphasizes flavour and the familiar. The duck cabbage rolls (also stuffed with wild rice, chestnut and prune) or the chicken and ham-hock pot pie are great examples of the kind of honestly sourced and honestly prepared food you'll find on both menus (they offer a full vegetarian carte in addition to the standard). Well deserving of the praise and the hype, Woodlot is the best new restaurant to hit Toronto in a while."}
{"text":"Hands down my all time favourite restaurant and there are many great ones in our city.  Cannot wait to return as soon as possible!  A++"}
{"text":"The restaurant itself is gorgeous, very warm and inviting setting. Servers were excellent, didn't rush us at all, very doting and attentive. Overall the food was delicious and flavourful. French onion soup was excellent, mains were pretty good. Desserts weren't that appealing, so instead chose to do gelato nearby after. Would recommend this place."}
{"text":"If someone can give me the recipe for Woodlot's rib rub, I would be eternally grateful! Damn is all I can say. Damn! ::fist up::"}
{"text":"Great experience at Woodlot. The restaurant is so cozy inside, and watching the chefs make the meals from the floating dining room above is fun. All the dishes we tried were delicious. We started with the mushroom salad and the butternut/apple salad. The mushroom in particular was very delicious. Both of us had the duck confit based on the recommendation of some yelpers and it did not disappoint; nice crispy skin on the outside and super tender meat on the inside. The bed of wild rice and brussel sprouts complimented the duck well. Overall, very pleased and will definitely be back!"}
{"text":"Ladies and gentleman, the rumours are true: Woodlot will rock you.   From the moment you enter the gorgeous and unique space to the moment you leave, you will be having a great time. Homeruns on the venue, the food, the service and my awesome company! :)  Started with a bottle of red wine (something French) and the famous bread basket. While I'm no pro-wine-master, it was delicious. The bread was wonderful too! Chewy, fresh and perfect with little jar of butter. Ah, what a way to begin.   Afterwards, came some apps of the French onion soup and pappardelle with boar ragout. The soup came piping hot with a hearty broth, ample onions below the bubbling cheese all over the top. Not to be forgotten are the surprises of rye bread! The pasta? Also perfect. Who knew that after just one dish, boar would be my new favourite meat? It was a great sauce for some seriously well-cooked pasta.   The show stopper to me was: dinner. My dinner. A few tastes of the chicken pot pie were excellent, don't get me wrong, but my steak was the bomb. Standing tall at 12 oz. this big boy, medium rare, was juicy, sliced and fanned to please both my mouth AND my eyes.  If you haven't guessed, the food style at this place is something like: old classics- done fancy. So naturally there were some scalloped potatoes alongside- but not just any scalloped potatoes! These were shaped into an artful, rectangular brick. No surprise, they were crispy where they needed to be and soft where the needed to be.   As if this dinner was not success enough, next came dessert. Lemon tart with blueberries and a homemade marshmallow top. To attack this delight, I suggest you spear your spoon from the top and swing it down in one smooth motion. This way you get the crust, the blueberries and the marshmallow all in one bite. This dessert doesn't need any other little garnishes or squirts of syrups all over the plate. It stands alone because it can!  What else to say? Our server was a Blake Lively look-a-like who was ever-attentive and great. She got mildly flustered towards the end of the night but who wouldn't with such a packed house? Props. I can see why people are flocking to Woodlot. I'll suggest it to people, even bring my half meat eating, half vegetarian family!"}
{"text":"Food: 6.5/10 Atmosphere: 8/10  Service: 7/10 Overall experience: 7/10  Why I pretend my star rating relates to my food/atmosphere/service/overall breakdown I don't know...since the math clearly doesn't add up let me explain myself:   The food here is fine. Some items are really good - I particularly enjoyed the potato gratin and the harvest salad. Others are forgettable.  The service is fine as well - our waiter, an older gentleman, seemed a bit off in a way (quiet, and almost uninterested) but they did do little things like bring some items on two dishes because they knew we were sharing.  The interior is very autumn - cozy and with the smell of the fireplace, it's definitely a spot for September - November.   The reason it gets 2 stars is really because what you get is not worth what you pay. There are so many choices in Toronto that offer this intimate, \"whole food\" experience, and in all honesty, the bar has been raised. Woodlot falls a bit short.   THE BOTTOM LINE: everything is fine, but it's not worth your time to go out of your way."}
{"text":"As vegetarians, we were delighted by the veggie menu. Where most restaurants offer one or two of the more usual meatless dishes, Woodlot offers a lot of unusual ones. It came as a shock, then to see on the carnivore menu, a foie gras appetizer.  As most people know, foie gras is produced under inhumane conditions. For the last ten days of their lives, ducks are force fed three times a day. This procedure requires a metal feeding tube to be inserted into the throat.   Surprising that a chef specializing in Cumbrae free range meat, also would support such an industry. More surprising to me, that none of the happy vegetarians writing rave revues had noticed this.  We enjoyed our dinner, but won't return."}
{"text":"The ambience is unmatched in Toronto. The two floor set up makes the restaurant feel big, but the lighting and exposed brick allow it to maintain a very intimate atmosphere. Yelp should add a lighting criteria to its rating system -- it's important and Woodlot definitely nails it.  We arrived for an 8pm birthday reservation. We had to wait for about 25 minutes for our table, but we are able to sit on their patio and enjoy a glass of wine. Obviously not everyone wants to wait when they have a reseration, but we'd prefer that the restaurant wasn't rushing anyone out rather than seating everyone immediately.  The freshly baked on-site bread was every bit as legendary as we'd expected. The service was not exactly superb, but when serving food that's this good, it doesn't need to be stellar.  The ambiance was perfect, the food was great and the rest was good. Amongst the best places in Toronto."}
{"text":"Oh Woolot what happened?  I was here last year and it was a memorable meal.  Unfortunately, it was not the same experience when I returned last night for dinner.  The food was over salted, bland and lack-lustre.  The highlight of our meal was the bread that they brought out with our meal.  When we had dessert, there was a bit more redemption in the Vanilla Polova which my friend and I gladly gobbled up.  Despite the mediocre food, the service was fabulous.  Our server was super attentive, she even got the kitchen to split one of mains as my friend and I were sharing.  Our glasses were never empty of water.  I still do love the vibe and atmosphere at Woodlot.  It has a warm comforting feeling when you enter; it is as if you are dining in someone's home.  If you are curious about the Woodlot experience, I would say go ahead and try it; but I am not sure I will return."}
{"text":"Would strongly recommend NOT coming here.   Value: High price, low value. Came with a large party and was pretty much told that we were expected to get the five course set dinner. It was $55 per person + tax + 18% tip. I was thinking WOW five courses?! Big mistake! Several of the courses had to be shared - 3 plates for 10 people, I had no idea how to split it. This was also the first time I ever had to share a plate of papardelle with four people.   Food: I'm not a food critic or picky eater, I'd say the food was average. Nothing special, definitely not worth the $$$$ I paid.   Atmosphere: It looked like a shack on the outside and not much better inside. The music in the background wasn't bad, but it was so loud that I had to shout talking to the person sitting across from me. Bonus: There were FLIES everywhere. My friends and I caught about FIVE that night - one got stuck in the butter and two flew into our drinks.   Service: A bit arrogant - kept telling us how lucky we were able to get our table and how we got a great deal with the five course meal. Kept asking us if we wanted to order more, which was okay for the first two hour before I started wondering where the food in the kitchen was going.  Last, but not least, it took almost four hours for all the food to come (we didn't eat slow, since each course was so small). Definitely not a good place for a date or chilling with someone that you have less than 10+ years of history with.   Couldn't pay me to come here again. Life is short, I don't have another four hours to waste."}
{"text":"splurged on a four course meal here a while ago and was worth every penny. i honestly don't even remember what i got because it was so long ago, but it doesn't even matter because it's so good. their cocktails are amazing too. i had something topped with an amaretto cherry, and i had to beg the bartender for more."}
{"text":"The Good: great JellyKing beer from Bellwoods; the steak was cooked perfectly, really delicious and presented beautifully; the service was great.; 'my sun and stars' bourbon based cocktail was delicious; and the sourdough bread is amazing.   The Bad: really drafty and cold on the second floor near the brick wall - uncomfortably so; the dark chocolate and banana parfait was brutal - overpriced and unrefined; the 'cocktail with no name' was also overpriced and scant - served in a glass overflowing with ice, there may be have been 2oz of liquid."}
{"text":"Amazing! We took a 5:30 reservation a week in advance because that's all they had left, but we were determined to eat here and glad we took the time to plan in advance!   Upon first entering we were impressed by the warmth and the spaciousness... oh and, the super high ceilings and enormous wood oven. The kitchen is open, the bar is tucked away and the dining room is perched up top a loft looking over a cabin-meets-industrial-workshop-type space.   My party of five sampled the French onion soup, a crab salad served with deliciously salty prosciutto and smoked whitefish for our apps.  I was the rebel amongst a table that was all seduced by the chicken potpie -- instead I ordered the haddock served on top a pile of israeli couscous. My only complaint is the dining room was so dark I will maybe never know what made that couscous so yummy... it was something crunchy... maybe?  We sampled all the desserts (this is of course the best reason of all to invite lots of friends) and I'm hard pressed to pick a favourite.  It was perfectly winterlicious! The warm environment and hearty home-cooked food made for a far more special evening than expected. I'm looking forward to stopping in during the day and sampling their baked goods!"}
{"text":"Very nice place, great service, nice menu. I had two appetizers: halloumi and hen of the woods, and rapini. The rapini were really really bitter, well over the usual bitterness of rapini. I suggest the staff to quickly blanch them before cooking. The hen of the woods appetizer was absolutely delicious. The halloumi appetizer was ok. I have found it a little pretentious and way too expensive, but it's a nice place"}
{"text":"After all the good reviews, we decided to check it out.  For an afternoon coffee it was great - decent brew, and pasteries were fine, atmosphere was nice; kind of cool to watch them at work.  However, when we returned for dinner we were sorely disappointed.  The food was pretty good (well, the pasta was very good, but the duck dish was unsubtil, tasteless, and overly sweet), though it was priced high enough to make it just okay, and it accompanied with an excess of unwelcoming attitude (especially the blonde waitress who was basically prodding us to just finish our meal and leave).  I wouldn't mind this type of service if the meal were $10, like at a Vietnamese restaurant (where people are simply being fed), but at a place like this, people are coming to enjoy an evening out, not to grab a meal and go.  I would say, yes, go for coffee in the afternoon, but don't bother with the dinner - there are a lot better meals in this general price range available, that will give you a better overall experience - such as Frank's Kitchen, Local Kitchen, and Pizzeria Libretto."}
{"text":"I've been meaning to check this place out for a while now.  I finally scored a dinner reservation for Saturday night and overall, I had a good time.  I tried the carmelized onion soup, tourtiere, steak main, brussel sprouts, and something for dessert that I can't remember.  The setting was nice, as we had seating upstairs overlooking the floor below.  It was dark, a bit rustic, and minimalist.  I like ambience because they don't try too hard.  The service was great and I enjoyed the carefully selected beer selection that had some excellent European and Quebec options.    The food was well prepared and presented nicely.  They don't over season their mains and have a very eclectic menu that should have something for everyone, including vegetarian options.  My only complaint was the cut of steak I had.  It was the shoulder or something and it was a little bit overdone and tougher than I would prefer, but the béarnaise sauce and mushrooms were nice.  The tourtiere was great and the soup reminded me of a classic French onion, and also tasty.  They apparently bake all their bread fresh in house as well, but I found the bread the same as anywhere else.   Like others, I did find the menu a bit pricey so I can't really say I was blown away for the price.  This is common problem I have with many places as I like to account for value-to-price in my rating.  But it was still a solid dining experience.  Quality food with good portion sizes in a nice setting. I could go back one day, especially to try that gnocci."}
{"text":"This was a great meal!  The menu was short and well planned.  They offered a seperate vegetarian menu, which worked well for a co worker.  The staff was great.  The atmosphere was chill.  The kitchen looked like a fun place to be.  The bar was cozy and inviting.  All around great place to dine."}
{"text":"I would like to give this location three and a half stars if I could. Right off the bat, everything I ate was tasty. Each dish stayed true to the theme of simple, homemade, and handmade food. It started with the bread and butter. The bread had a nice chew and the butter was flavourful but also very light. My friend and I continued by splitting the crab brioche appetizer (with quail egg, greens, and bacon bits). The crab and brioche didn't do much for me, but the surrounding toppings saved the dish in my opinion. The citrus sauce was well balanced with the savoury bacon. I ordered a vegetarian pasta dish for my entrée - the cauliflower stuffed agnolotti with butter and carrot jus. Each agnolotti burst open as I bit into it, exploding with cauliflower purée. The carrot flavour complemented the cauliflower nicely. The tastes were a bit subtle, but they really worked for me. I was definitely disappointed in the size of the portion considering I ordered the larger of the two menu options.  We finished with dessert. Nothing to write home about. We split two desserts to have some variety. Each one was small but tasty. I really enjoyed the filling of the pumpkin profiterole and the Chantilly cream on the plum tart. Both of those components packed flavour into a very delicate medium. The food was good, the service was good, the atmosphere was nice. Everything was solid. Maybe it's just because I don't eat at many upper class restaurants, but as good as it was it just didn't seem worth the price to me. Definitely check it out if you're willing to spend some cash!"}
{"text":"HIGHLY RECOMMENDED. As a regular Toronto visitor, I've been on the hunt for a good restaurant in terms of both quality and value. While Toronto has many OK places, few have truly been amazing. Woodlot is one of them. You're gonna need a reservation and plan on waiting. They do have a communal table that is available on a first come, first served basis.  Located on a side street in Little Italy, the menu is short and inventive. Two menu's in fact, meat and vegetarian. Prices are quite reasonable and use caution as the quantities are often enough for 2. Wine prices are somewhat reasonable, we got out for $100 for 2 and ordered too much food, so figure at least $40 a person.  Our party sampled the various plates and each was truly amazing. Not a bad dish in the process. The menu reflects seasonal products, which is good and gives you reason to return, let's hope the chef can continue to maintain their inspiration.  If I have any negative, and this is very minor, the bread served was awesome, but it would have been truly great were it warm!  Order away and enjoy!"}
{"text":"I visited Woodlot on a Saturday evening as a group of 11 for a cozy dinner to celebrate a lovely bride-to-be. We were forewarned when booking the rezzo's that dinner with such a large group would have to be prix-fixe ($55, not including tax/tip). We were seated at the only large table in the restaurant, right beside the open kitchen. The table was actually shockingly near the entrance, but turned out to be nice with natural light trickling in well into the evening and a nice summer breeze with the doors open. The wood burning oven made everything smell super fantastic (even led us to the restaurant as we headed over!) but wasn't overwhelming in smokiness. Our server was very patient throughout our indecisiveness and offered clear explanations of items on the menu. Vegetarian options were aplenty, if not the majority.  Of the appetizer, I had the EMBER GRILLED HALOUMI CROSTINI, which was delicious! The smoky grilled haloumi sat on top of a pea puree and was garnished with pickled black carrots. Wonderful balance of flavours and textures (crunchy bread/chewy cheese/creamy peas). The OYSTERS came with a pickled pepper relish that was also fantastic. SEA SCALLOPS were very fresh but having tried all the other dishes, the accompanying radishes were seasoned too lightly to shine at all. GNOCHHI was also available as a starter and was very decently sized. And so pillowy! perhaps my sampling of the EMBER GRILLED HEN-OF-THE-WOODS MUSHROOMS was too tiny, but it was forgettable to me.  I didn't want to spoil my appetite with the bread, but I couldn't help myself - the daily, in-house made SOURDOUGH was so. fresh.  Instead of having us continue our indecisiveness, Woodlot provided us with sides to share:  - KALE SALAD: fantastic with a vinaigrette. - FRIED SHISITO PEPPERS: not bad, with lightly charred skin, toasted sesame seeds, and sea salt. Wish it were spicier, but that's no fault of Woodlot's. - FINGERLING POTATOES: soft & seasoned well. so satisfying that I was disappointed there were leftovers that I couldn't finish. very very tasty.   Onto the mains: I forewent my usual pick of meat and chose the ROASTED PICKEREL WITH WILD SHRIMP. the fish was cooked well, with enough moisture retained and a light crisp to the outside, but the flavor was lacking in my opinion and that of another who ordered the same as well. The pickerel sat atop a bed of barley and corn, which was seasoned pretty interestingly though, almost a curried flavor. The menu descriptor indicated jalapeno but I didn't notice any heat at all. While the flavour of the pickled iceberg lettuce garnish was nice, I think iceberg might be too limp of a green to be pickling. Sampling the PORK CHOP was nice, though with the hints of sweetness in the glaze/sauce and my aversion to savory/sweet combos, I'm glad I didn't order it. The LAMB SHANK was incredibly fall-off-the-bone tender that using a knife barely necessary, and the FLAT IRON STEAK was cooked perfectly medium-rare -- very tasty. (I'm running out of adjectives but it really was good!)  Time for dessert. Do note that the dessert portion of the prix fixe menu printed & online are no longer in use, and they just go by the a la carte dessert menu. the GOATS MILK PANNA COTTA was deliciously creamy and the came topped with shredded pistachios, and a rhubarb sauce that balanced things nicely. there were also 'wild rice crispies' that I thought was excessive. not crisp enough, and in clumps of what seemed like soft meringue or marshmallow. perhaps a craft version of rice crispy squares, but one I could do without.  And one final note -- Chef/Owner David Haman is the sweetest guy! Frequent shout outs to our party from the kitchen, came out a few times to make sure everything was good, and bid us a warm adieu when we headed out. With our table total coming out to the amount that it did, this was a very nice gesture."}
{"text":"Mmm, yes, indeed, quite.  It's a lovely interior with a nice earthy but classy feel. Unfortunately, the apps we had (the croquettes and crostini) weren't the most inspiring, the croquettes being essentially fancy cheese sticks with an admittedly nice mustard, and the crostini being quite good but prettier and more interesting than it was necessarily delicious. Similarly, the dessert platter was also decent, but not especially memorable.   The pastas, however. My dining companion and I had the gnocchi and the agnolotti, and both of us were blown away. Both were absolutely delicious, and definitely make the list for best pastas I've had in Toronto. Purely for the pastas, I would give this place 4 stars (if everything else was better I would have given 5). Moreover, I have to appreciate how vegetarian-friendly they are (they have a separate but almost identical vegetarian menu that still sounds fully palatable!).  Overall, I would come back, with a yearning for their delicious pastas."}
{"text":"EAT HERE AND GET YOUR PERSONAL BELONGINGS STOLEN! If you eat at Woodlot be sure to hold your personal belongings jacket or purse in your hands. I ate there with friends a few months ago and someone STOLE my jacket from the rack directly behind our table. It was  winter, a national holiday the next day which meant  stores were closed. I was visiting from out of town. The restaurant manager Kevin made sure that I would be reimbursed for the stolen jacket and Woodlot would send me a check. After months of correspondence , there is still no sign of the money. I even had a kind friend from Toronto go in and speak to Kevin with a copy of the catalog with the jacket in it , the liner of the jacket and a note from the store manager where it was purchased. The fact that your personal property can be stolen right before your eyes is shocking. The way this was handled was completely unprofessional and a waste of my time. I would like to make all customers are warned of Woodlots negligence and careless attitude towards valued customers."}
{"text":"Maybe my expectations were too high with the hoopla. Given many resto options and pricing, I wouldn't return. Key attraction was the veg options available to our guests.  Venue: Small, very very dark, loud. I'm not enjoying this new trend of having very dark lighting in places. The noise: well, that's just people (not bad music).  Food: The Hen of the Woods mushroom had some of the best mushrooms I've ever had. The barnajuans were good, we shared those.  With 6 or 7 as a starter, that was a great idea. Mains were ok, nothing spectacular. Dessert: chocolate mousse was very good, with fresh made gelatin free burnt marshmallow. Good beer menu!  Service: The wait between courses was long. Could have communicated better with more follow ups."}
{"text":"They really kept the menu simple here. One for meat eaters and another for vegetarians. Urban rustic ambiance. I ordered the trout and thoroughly enjoyed it. Judging from photos from others of the trout, this dish may not always be dressed the same but the taste stays unequivocally good. Homemade sodas also found here. Had the white pulp based ginger-ale soda. Not bad. On the way out, each guest is encouraged to take home a loaf of their homemade bread...almost makes you feel like you just had dinner at a friend's place."}
{"text":"Despite the stories I've heard about how difficult it can be getting a table and/or reservation, it was a shot in the dark when I walked in to Woodlot this past week (@6:15pm). Success! My lovely dinner date and I were seated immediately. Because we were sans reservation, we opted to sit at the communal table beside the kitchen putting us right in the heart of all that action.  The dinner service was seamless from start to finish. Our server was friendly, knowledgeable, and courteous, never hesitating to answer any of the monotonous questions we had (FunFact: The starter for the sourdough bread is only 6 months!).  The menu selection from appetizers to dessert is well-rounded; catering to both omnivores and herbivores alike.  The lentil salad with seared Hokkaido scallops, prosciutto and pickled cabbage was a great combination of flavour and texture. Equally delicious was the pappardelle pasta with spring lamb and kale lightly coated in a creamy pecorino sauce.   The single hiccup: The strip loin I ordered for my main was served medium to medium-well with an unexpected 'Chicago' style crispness, in spite of my request for an on-the-more-rare-side of medium-rare doneness. Although the server offered to replace it, the steak was still decent and I didn't want to create a fuss. The real surprise came with the bill when I realized our server comped the entire steak! Completely unnecessary as I had eaten most of it!   Honourable Mentions:  - Large communal table to seat drop-in guests = make new friends/network! - Cherry cola - Sweet patio area (Approval pending)"}
{"text":"Woodlot was good, but to be honest, it wasn't great.  Reservations were made two weeks in advance. The only times that were available for a Friday night were 5pm or 9:15pm. Just a note in case you're thinking about making reservations for this weekend. Good luck!  Here is the thing. The food was ok. But most dishes didn't blow me away. The bread to start, very nice. My french onion soup... fantastic. My dining partner's salad? Lacklustre. My porkchops? Very juicy. Salty, but juicy. My partner's duck cabbage balls. Sorta not that good. Which is disappointing. We had heard a lot about them, but some bites were overpoweringly orange flavoured, while others bites didn't have much flavour at all. We didn't finish them.  So half of the meal was pretty good. Half wasn't so good. The service I should mention, was fantastic.   Really, I'd give this 3.5 stars if possible. I just can't bring myself to give it four stars, although I would go back and give it another chance."}
{"text":"My boyfriend and I went to Woodlot last night for our anniversary based on a recommendation and it did not disappoint! Between the amazing meal and wonderful service the experience was great! There was something for everyone on the menu(two menus, one for vegetarians and one for meat eaters) We will definitely be coming back and recommending this restaurant to our friends!"}
{"text":"Delicious food and beautiful ambience, Woodlot never fails to impress. We were recently back with friends and everyone had an excellent time.  Meals start with fresh sourdough bread and butter. Right after, we had delicious oysters with slices of lime instead of lemon - a first for me that worked very well.  I had the special, a very tender 40-day aged steak that was simply outstanding. My fiancé went with the vegetarian menu and the equally great halloumi, lentils and sunchokes. All the dishes were beautifully plated, and the drink list was refreshingly different. There's a careful but \"unfussy\" quality to the menu and plating.   Our server was excellent and always answered questions with detailed descriptions of the food and drink. I especially appreciated his handling of my allergies: he explained to me what the kitchen had used to replace ingredients I couldn't have."}
{"text":"The long list of rave reviews for this spot escape me as I don't understand what the fuss is about. Reservations at a decent time were impossible to get even mid week on past attempts. So on a whim when we were in the area we decided to check it out and much to our surprise found a spot at the communal table in the common area by the entrance.  Sure the ambiance is inviting initially as one can see a person working a real oven (something magical about fresh baked/roasted items coming out of an oven) but I would advise against sitting in the communal table as one is surrounded by items that shouldn't be in the dinning area. We are talking about trays full of roasted chicken bones (bread is OK in my book) etc here. The menu is very sparse even though they have two, one is vegetarian and one is main stream.  We decided to stick to apps wisely (more on that later) and ordered a crostini with halloumi, gnoochi and foie gras creme brulee.  The crostini though good is minuscule. Gnoochi was OK though a bit too creamy. The biggest disappointed was foie gras creme brulee.  I have had a similar iteration of this dish and enjoyed it thoroughly in the past. This one wasn't even a passing resemblance to the luxurious feel one craves for this delicacy. The brulee was devoid of the foie taste as the heavy cream and bruleed sugar overwhelmed it. The fig preserve decent on its own was not needed IMO as the brulee sugar already more than provided the sweet to balance out the luxury of foie which was missing in the first place. Maldon sea salt is supposed to elevate your taste buds but for all intent and purpose this was regular dessert. The wine list is decent and will appeal if you are an oenophile. The prices just don't justify the food that is served here.  2 stars."}
{"text":"We decided to check out the Woodlot after meeting the guy who built their wood fired oven. The ambiance is very rustic and laid back and they have a seasonal menu with organic ingredients. I have heard it is challenging to get a reservation but we got lucky. The service was really great. The food takes a while to get to you as mentioned on the menu. Ours took longer for some reason so appetizers and dessert was on the house. We ordered the pea empanadas which came with a side of pickled carrots and hot sauce. I wouldn't say it blew my mind. My friends ordered the cavatelli and cocoa crusted pickerel. Both were delicious. The cocoa crust wasn't too over powering. My husband got the pork and I got the potato latkes off the vegetarian menu. Both were great although the latkes were a tad too salty. Since dessert was on the house we tried everything on the menu between the 4 of us. The cheese plate came with ruhubarb pickle, an assortment of cheeses and fruit. The orange olive cake with rhubarb was yummy so was the vegan chocolate mousse. The only reason I wouldnt give it 4 stars is because I think it is a tad too expensive."}
{"text":"The food at Woodlot is healthy and delicious but the atmosphere is so unpleasant I can't give it more than 3 stars.  The tables are slightly too long causing everybody in the restaurant to raise their voices to be heard, which makes the entire second level very loud. The chairs are hard wood, the lights are on the verge of being too dim. Based on the overall discomfort of the room I don't think I would return to Woodlot.   As I said, the food is quite good.   We had:  Sourdough bread -3/5 this was very good sour dough but I was  disappointed it wasn't warm. I mean they bake it in house...  Pappardelle - 5/5 we split the smaller portion as our appetizer and OMG it was heavenly. Perfectly el dente with a right amount of cheese and morel mushrooms.  Lamb - 5/5 this was braised, served with a delicious side of whole oats and apricot.   Steak - 5/5 my husband loved this. The charred leek took this to another level.   Sides: Potato gratin -2/5 the smoked cheese in it was nice but I found this hard to cut and bland.   Roasted carrots -5/5 these were phenomenal!   We didn't have desert."}
{"text":"It's nice to go to a restaurant and be handed the vegetarian menu right along with the regular. I don't know why it's not incorporated into the same menu, but it's nice that it's not an afterthought.   The restaurant is cute and casual, with the wonderful benefit of a parking lot beside it. I wish it were comfortable, though. I ate at the bar and that was a mistake, because the seats are small, hard, and backless. If it's a strategy by management to prevent people from lingering after they've eaten (the \"campers\" every server hates), then bravo! Mission accomplished.  The Aperol cocktail I started with was okay. Not exactly my thing. However, my dinner was tremendous. I had the small portion of stuffed agnolotti, which really was lovely. I'd surely have eaten the full order had I gotten it, even though I was full. I also had the side of rapini. I love rapini, and this was no exception. In fact, it was among the best I've had thanks to the addition of a bit of chili. Perfection! For dessert I ordered the chocolate cheesecake, and that missed the mark. It tasted okay but was so incredibly dense--far too heavy.  All told, I'm glad my experience veered towards the more positive. Some of the negative reviews had me worried! It is rather expensive for what it is, but I'd still be back--just skip dessert."}
{"text":"You know you're having a terrific meal when most of the conversation at dinner is about the food. I can't say enough about Woodlot. Except that it may be my new favourite restaurant in Toronto (sorry, Tabule, I still love you!).  Every aspect of our experience tonight was terrific. The host was warm and friendly and she seated us even though we showed up early to our reservation. Our server was super knowledgeable and steered us onto some wickedly good drink choices, including a red belgian sour beer that was super tasty.  And the food...SO. GOOD.  Homemade sourdough that was melty and chewy at the same time.  Starters:  A light asparagus hazelnut tart that had a subtle punch of mustard and marscapone cheese. Incredible mushrooms smokey from a brick oven with pickled beets and wild rice. Both light, beautifully balanced and shareable.  Mains: A lightly curried (?) tofu pie was so much more refined than I can describe. Light filo and sweet/savoury filling that was layered and warming. I was sad when it was done. The stuffed celery root was interesting and thoughtful, although didn't have quite the depth of the pie. We also had a warm kale side salad that had a hearty acidity from what tasted like a high-quality apple cider vinegar, soaked raisins and toasted almond slivers with pickled shallots. Crazy good.  Dessert: smoked chocolate cheesecake with toasted marshmallow and cherries. Um...really what is there to say? It was f-ing delicious. And kudos to the chef for making homemade marshmallow without gelatin so vegetarians can partake.   Woodlot is thoughtful unpretentious food that is worth every penny they charge. I can't wait to go back  Vegetarian score: 10/10!!! They have a freakin' vegetarian menu that is every bit as good as the meat one. I love this chef. Truly."}
{"text":"Very exotic and tasty dishes. If you are an adventorous eater, this is the place for you. The menu changes seasonally, so i will be certainly going back to try the new stuff. Great service and good wine selection."}
{"text":"Everything on the menu looked so decisions that my friend and I agreed to share the whole meal so we could get a taste of more. The gnocchi was superb. True Italian style: light and delicious. The steak was amazing too. Every bite of everything tasted excellent.   The wine can be a bit non-traditional. It's organic or home made or something, so it was very light in colour and body, but still interesting to try."}
{"text":"Amazing. Very fresh, very tasty, the chef clearly use locally farmed ingredients and its worth every penny."}
{"text":"Food: 7/10 ---- Value: 4/10 ---- Service: 7/10 ---- Ambiance/Décor: 9/10  I have no problem paying for great food, but I didn't leave Woodlot thinking I'd eaten great food. It was good food, but I don't know what exactly the wood-fired oven or \"handmade\" aspects of their food added to the taste.   Our waiter, an older gentleman, was really quiet and almost too unexcited. A lot of the time, we couldn't hear him and just guessed what he was saying and I felt like my soul quieted a little every he spoke. Service was economical, but our glasses of water were always full. The person at the door was much friendlier.  The restaurant is dimly lit and most of the seating is upstairs. It was a pretty cool space.   APPETIZER: Fall Harvest Salad ($15) --------------------------------------------------- This was literally like a few thin slices of carrots, few thin slices of turnip/cabbage, some \"crisp bread\" (aka sesame covered crackers), chickpeas, cauliflower, and some yogurt sauce. It was modern pretty, I'll give it that. But when you start moving the food around, it was just so bare, I was like...where is the rest of the salad? Admittedly, the yogurt sauce was quite good, but I feel like the value of the dish was maybe $3.   PASTA: Russet Potato Gnocchi ($17) --------------------------------------------------- We got the small appetizer size of the gnocchi and they were kind enough to bring it to us on two plates because we were going to share anyway. It was maybe less than a shallow handful on each plate and definitely overcooked. It was mushy baby food and I can't say the taste made up for anything.  MAIN: Roast Chop of Whey Fed Pork ($29) --------------------------------------------------- The portion is small. There were five slices, one of them bone-in. Each piece had one edge of fat, which made it taste quite good, but the pork in general was on the drier side. For me, this was the standout dish of the night; quite yummy.  SIDE: Smoked Scamorza and Potato Gratin ($7) --------------------------------------------------- As a side, the portion size was understandable. The price point was not. It was a small rectangle of potatoes. Not a very memorable flavour.  SIDE: Seared Rapini ($7) --------------------------------------------------- For the same price, you could get a full-sized dish elsewhere. But this was a more reasonable portion for a western restaurant. Taste was average in that it tasted as it should have. The details of this dish - garlic, aleppo chili, lemon, and parmesan - don't really come through. The cheese is on the top, so that's hard to miss, but it's only on the top and added sparingly, so it doesn't transform the entire side.   I left the restaurant thinking that everything just should've been better. I don't feel like there's much use touting a wood-fueled oven or \"the finest raw, local ingredients\" when you don't make use of these things to make outstanding dishes. I wouldn't come back. It's just not worth it."}
{"text":"I don't usually give negative reviews, but here it is...  I had high expectations of this place, which was perhaps dangerous. It was rated as a top vegetarian restaurant on BlogTO, and also highly rated here. Yelp has never let me down before, until now.  First the positive: Ambience is nice, rustic, and cozy, and the food was decent.   Now the venting begins:  I took my vegetarian mom here for her birthday. The restaurant was a little too dark for my taste. The server was very cold and unfriendly, made no eye contact, and essentially seemed like he didn't want to be there. She ordered the French onion soup, and the Roast Glazed King Oyster Mushrooms. I had the Mozzarella Empanadas  and duck confit. Like I said, the food was decent. However, the prices of this place are on the high side, and the portion sizes are on the small size. For a French onion soup to cost $9, I expected it to be AMAZING. It was not. (I tasted it).  As for empanadas ($15), there were essentially 2 of them, at $7.5 a bite essentially. If my eyes rolled back as if I were eating oysters or sea urchins, I wouldn't complain. However, they were nothing spectacular.  The duck confit was so-so. As for the Roast King Oyster Mushrooms for $27, it was also so-so (I also had a taste). I'm sorry, but no mushrooms should cost $27, unless I'm eating truffles.  I should also mention I ordered a beer, and it was $14.  With the high prices, mediocre food, and the cold and grumpy server, I'd warn everyone to stay away, and want to complain to BlogTO."}
{"text":"After a few failed attempts at getting a reservation at Woodlot, we were finally successful and our curiosity was still burning as bright as that woodburning oven.    Being that it was a hot summer day, we decided to sit inside. The wood oven definitely gives off heat, and I would suggest sitting upstairs.  This way, you also get a nice view of the communal table and the kitchen.  At some points during the meal, I felt slightly uncomfortable because of the heat, but it was still manageable. I would love to come back in the winter, as it definitely would be a cozy atmosphere.    *Be warned though, that you WILL smell like a wood burning oven after your meal here, so have that bottle of perfume/cologne ready for a re-spritz.*    Highlights: ----Drinks: I was happy to see they had rose by the glass.  Perfect for a mid-week summertime meal.  -----Bread: I'm not surprised that people line up to buy their bread.  It is simply delicious and fresh.  I consumed probably two baskets, which may have not been the brightest idea.  The butter was the right temperature as well--making it simply irressistible.  ------Mains: Good portions of meat, served on a beautiful wood board. There is not much selection, but I do recommend the steak and/or the pork.  The steak was seasoned really well, with crunchy sea salt at the top. At times, I did find that there was too much oil on the actual steak and left over on the board, so some points deducted there.  ------Sides: The potato salad with hazelnuts is outstanding. You simply HAVE to get it with your meal. ------Dessert: We shared the vanilla pavlova, and it desserves nothing less than an A+   Areas of Improvement:  Appetizer---The salmon infused in Yuzu, paired with the radishes and served on a bed of ice was quite good, but for $16, the portion was tiny and not worth it. I would certainly not have this again.  Next time, I will try the haloumi crostini."}
{"text":"I guess I should count myself lucky that I didn't have problems making reservations here. I left them a VM and they called me right back...professionally and politely.   The outside of the restaurant looks like a warehouse...but once you step into the restaurant, it's like a contemporary rustic loft. Oxymoron? Perhaps. But i'm not sure how else to describe it...  We started out with the Onion Soup; it was a little sweet and fortunately not too salty. More often than not, I've had way too salty French onion soup from other restaurants. *bah*  I had the Buckwheat Pasta with Duck Confit: delish. It was sprinkled with walnuts...and had savoy napa cabbage and the whole dish was perfectly done.  My friend had the steak and wow...one of the best steaks i've had in TO.  Tender, juicy and melt-in-your-mouth yummy  We had 2 sides: The hen of the woods mushroom was AMAZING. i'm not sure what the chef did with it but i honestly wanted about 2 more servings of it.   The Jeruselum Artichokes were a little odd...they were too gingery and tasted like chinese stir fry to us. I wish they had prepped it another way  The Spiced Pumpkin pie with caramel and sprinkled with pistachios was good; i'm not a pumpkin fan, so i didn't love it as much as other desserts...but i guess it was tasty enough   Our server was friendly and very accommodating; good food, great ambience...no complaints!"}
{"text":"We had hoped for better. We had heard so many good things about Woodlot. The friends who were with us said they had changed up the menu. Our friends are vegetarian and they both rated their main courses at 5 out of 10 at best. My wife and I also had different main dishes and they were a 6 out of 10 at best. Disappointing overall. For what they charge I expected more, I would try it again if they change the chef or the menu...something."}
{"text":"I have been back in Toronto for about 3 months now and Woodlot is the best restaurant I have eaten at so far.  Their focus is on simple, handmade, and mostly local foods (they also have an ample vegetarian menu).  Obviously this claim grabs my attention already because I instantly assume it will be like the neo bistros I loveee in Paris.  FRESH. I just want that fresh restaurant flare and YES I did get that at Woodlot. The restaurant is super cute and when you walk in you instantly get a cozy feel surrounded by the wood decor and the fire going in the oven.  Really setting the stage for some interesting comfort food.    Now let's start with the bread.  I am a bread connoisseur.  I LOVE bread and being able to explore an insane amount of bakeries in my time while in Paris, trust me when I tell you that I know GOOD bread.  The bread at Woodlot is \"100 % Sourdough, organic, handmade and wood oven fired.\" Obviously I was beyond excited to try it but also extremely skeptical if it would be good.  The verdict? I was quite impressed and have to say it's comparable to some of the better breads I have had in Paris.  Sourdough is extremely uncommon in Paris so it was great to have it fresh.  If I am being picky-  I thought that the sour undertone could've have been a bit stronger and the flesh of the bread could've been slightly more moist and soft.  But the crust texture was fantastic.  Not too hard while maintaining that crunch.  Very impressed with this \"canadian\" bread haha.  Ok enough about the bread! For a starter I had the fire roasted winter squash (with curried kefir, savoury granola, black kale and pomegranate).  Sounds interesting right? Well it certainly was.  The kale and the granola (which had curry accents in it) were fantastic.  I would buy sheets of that granola if they sold it.  There was an actual slice of squash at the bottom and I felt that it could've been cooked a bit longer, but that's just me being extremely picky.  The dish went together well minus the kefir which I thought tasted like ranch flavour.    For the main I tried the russet potato gnocchi (with wild boar & chestnut ragu, fennel, sage and parmesan).  PILLOWS. Pillows in my mouth.  Quite possibly the best gnocchi I've ever had!  I had gnocchi twice in Italy and neither time was as delicious.  The boar was tender, the CHESTNUT ragu was divine, and everything complimented each other so well.  Really just perfection! My mouth is watering a little bit just thinking about it.    Also tired the VG farms bavette steak (with shitake bordelaise, ember grilled scallions and sesame).  Good quality bavette, interesting asian fusion, but nothing mind blowing.  Everything tasted fresh and homemade (that gnocchi!) and I highly recommend this restaurant to everyone. I will definitely be back to try all the other pastas and appetizers on the menu.   Please do yourself a favour and come.  I would compare Woodlot to some of my favourite neo bistros in Paris. New favourite restaurant in Toronto!"}
{"text":"I don't want to write this review.  I went on a Friday with no reservation.  It was busy but they said they'd take our number and call us when our table was ready.  All the staff were super nice and friendly!  The restaurant is really cozy and cool inside.  You can see everything being cooked and we had a wicked view of the entire restaurant from our seat above.   It was a really lack luster dining experience.  The drinks were not that great, very strong.  The french onion soup is amazing, one of the best I've had.  But the cheese croquettes were just okay.  I was more inspired by the birch mustard they came with.  We chose two pastas to split for our mains and they brought the wrong one (but I didn't say anything because it was my boyfriend who confused them).  Basically, I felt it was super overpriced for what we had and I didn't really like anything."}
{"text":"Been here twice. Cozy spot with good quality food! Appetizers were slightly on the salty side however still delicious! Would recommend the house-made pastas"}
{"text":"After hearing about raves among other foodies, I decided to come here on Valentine's Day. I was ecstatic about its ambiance for this special occasion. Mind you, I booked about 3 months ahead. Where did we end up getting seated? In the middle of the upper floor, squeezed in between other couples, barely having any space to sit down without worrying that our arms and legs would take a swing at other couples trying to have a nice dinner. We are fairly small in terms of size, and I cannot imagine how another person with much taller and/or bigger figure would feel.  Ambiance was the only thing that was worth raving about. First of all, the service was incredibly slow. it took an hour, YES ONE HOUR, for our food to arrive. We were not  given an explanation as to why that is. You guessed right, our server NEVER checked up on us. He never bothered to ask if we needed to get some more bread because food hasn't arrived yet. When the food finally came, we were not given utensils. What did we have to do? Flag our waiter in his corner to give us utensils. He didn't apologize, and just went to retrieve us some. Sigh.  We ordered two entrees. The flat iron steak was good, but definitely not the butter squash ravioli. It tasted undercooked and it was way to sweet to be considered an entree. I think they should made it an dessert? I have had butter squash ravioli before and it should not taste like that. I was not about to make a scene on Valentine's Day, and I decided to let it go. We didn't finish the dish, and decided that we will never return to this place again. We also make sure if any of our friends asked, I will just show them this review on Yelp."}
{"text":"I love the feel of this place!  It's a beautiful restaurant with a bustling casual atmosphere.  Open kitchen with a gorgeous wood stove, upstairs seating. sunken bar area seating, this place just feels lively.  The staff so pleasant and friendly you'd think they were part of a cult.  I could never maintain a smile like that without stapling my cheeks to my eyes.  Reading the menu I was super excited to try everything.  On a cold, wet and grey Toronto night the thought of ordering comfort food had me eager and excited.  For starters we split the French onion soup which was a disappointingly bland and watered down.  No real onion flavor, not enough cheese and felt like hospital soup in a cup.  My date got the duck, but it tasted like marmalade.  I couldn't get past the syrupy sweetness that enveloped my mouth.  It was difficult to eat to say the least.  My venison pie on the other hand was pretty hearty and satisfying.  A huge portion for $11? I don't remember exactly how much, but it was pretty great value.  Needless to say I was disappointed by my meal at Woodlot.  However when I went it had only been open for 4 weeks so it would be unfair and premature to write it off as mediocre.  I would return to give it another shot, the place is gorgeous and everyone is super friendly so it's a nice place to be."}
{"text":"So far so good...Not as good as I heard. Maybe it is because I had the fish and that is not their thing. The service was super slow on the tonight I was there as well but I was solo and burning through some time anyways. Other folks were getting kind of pissed off however. The calamari appy was excellent - just the main course let me down. I would recommend it but I would not go out of my way for Woodlot."}
{"text":"If I could hack into Yelp's HTML coding and invent another star, I would definitely give Woodlot 6/5!  Nestled in the neighbourhood of Little Italy - the Woodlot Bakery & Restaurant  is truly a Toronto gem.  Newly opened since November 2010, Woodlot prepares classic dishes with a lot of love, and a whole lot of flavour!  The restaurant itself is reminiscent of a loft, with an open concept kitchen, communal table and bar on the ground floor, and a more proper sit-down dining area on the second floor above.  After thoughtful consideration, debate, and input from the bartender as to what we should choose as our main \"the pork chops vs. the pot pie\" - and then having the couple next to us chime in unison the pot pie! - we placed our order.   We were served a sour dough and fife bread with a pot of butter.  I must say, being quite a bread nazi (i.e. always wanting it served warm), that I preferred the bread at Woodlot unheated.  The first reason, is that I find that the sourness is really pronounced in sour dough bread when it is heated.  The sour dough bread was crusty on the outside, and soft on the inside.  The fife bread was a denser bread, but it was yummy!  We started with the Winter Arugula Salad. The mandolin-thin vegetables absorbed all the flavours of the vinaigrette.  There was a speck of anise flavouring which I suspect came from the fennel.  This dish brought together a mélange of  different flavours and textures.  You got the crunchiness from the carrots, fennel, and red cabbage, coupled with the crispness of the pear, the creaminess of the blue cheese, and the extra nuttiness from the walnuts.   The Smoked Ham Hock & Chicken Pot Pie was to die for.  I will never eat a frozen, store-bought pot pie again!  The chicken and pork just melt in your mouth with slow-cooker goodness.  The outside crust was very buttery, and the centre was very creamy.  The smoked ham hock added substance and flavourful saltiness to the dish and enhanced an otherwise plain chicken pot pie.  The vegetables used in this pie are anything short of ordinary.  Rutabaga, Jerusalem artichoke, celery root, and turnip - who wants boring potatoes?  It was also seasoned with thyme, rosemary, parsley and chives.    We had also opted for a side of Gnocchi with Sage Brown Butter.  Definitely no regrets.  Gnocchi is usually served in a cream sauce and is very soft, but the Woodlot added a twist by lightly searing it on the outside for an added dimension of texture.  It was also dusted lightly with a very mild cheese.  The kale chips that accented the dish were nicely salted.  Usually at this point in the evening, if the food has been disappointing, I ask for the bill.  Not so fast partner!  Because I love a good cappuccino, we ordered the Soma Chocolate Pot de Crème with Hazelnut Praline to polish go with.  And boy am I glad we did!  The hazelnut praline topping added a nice crunch to complement the underlying smooth crème, and had a hint of citrus flavour. The bit of salt in the praline also did a great job of highlighting the sweetness of the dish.  The cappuccino was nice and frothy, and although I usually don't add sugar, it was a little too bitter and sharp for my tastebuds.  Once I added a tad bit of sugar, my cappuccino became heaven in a cup!  The Woodlot definitely gets 5 stars in my books.  I am starting to think that the conspiracy theory of great dining revolves around the Trinity Bellwoods and Palmerston Village area in Toronto, away from all the overly-hyped, grandiose restaurants in the downtown core."}
{"text":"I wanted to go to Woodlot when it first opened, but at the time there was a 2 week reservation waitlist with the recommendation of not walking-in. I left my name and number on their voicemail, and never heard back from them. I took a chance walking in last year on St. Patties day and there was a 40 minute wait for two at the communal table. Much better than 2 weeks. The hostess was nice enough to take my cell number and would call me when a spot came up so that we could get a drink at a nearby bar, as their bar was full. Most restaurants have policies strictly against calling waitlisted customers, so points for that. The communal table wasn't disgustingly crowded or impeding on personal space. Its located right near the wood stove, which made the communal seating more appealing, even though the cooks yell \"HANDS!!!!\" every time a dish is completed. Everyone was taking pictures of their food, as their presentation is really great.  I ordered the french onion soup and the rabbit gnocchi. Soup was ok, the rabbit was perfectly tender and juicy, and the gnocchi was big and plump - they assured me the appetizer size would be enough, probably because I look like I weigh 90 pounds, but I could have gone for the larger portion as the app sizes are not that generous.  Our order was forgotten about and took over an hour to come, we told the server, whom was very apologetic and brought us a dessert platter on the house, of which everything was, again very pretty, and enjoyable."}
{"text":"Woodlot is a small rustic restaurant that serves Canadian-inspired food. The restaurant is small and intimate - great place for a date. The service is attentive and friendly.  The price is a little high for what you get.   We tried the Roasted New Beet Salad, Tagliatelle and Bavette Steak. We thought the food was good, but nothing to write home about. It lacked the \"je ne sais quoi\". I heard rave reviews about Woodlot and I felt slightly underwhelmed. This is not to say that Woodlot was a bad restaurant. It definitely was not a bad restaurant. I was just not \"wowed\" as I was expecting from the rave reviews.   Would I recommend Woodlot? Maybe. There are many other restaurants that I would recommend before Woodlot. I would recommend it if you are looking for Canadian-inspired food and you are near Little Italy."}
{"text":"There's nothing I love more in this world than home made artisan bread. The crumbly golden crust, the uneven crumb, the chewy moist texture and the aged flavor from a starter cared for week after week.  I must give Woodlot a standing ovation for the crafting of their own bread - Coming straight from the chefs hands and hearts and steaming hot out of the stone oven, which stands proud in their restaurant. I am a food snob especially a bread snob, but Woodlot has impressed my palette and stimulated a curiosity for more.  Oh, but Woodlot boast a lot more than a stone oven and hearty loaves - They've got a few more tricks up their sleeves. From the design, ambiance, staff and food, Woodlot is really giving other Toronto restaurants a reason to 'shake in their boots'.   The restaurant is located off of College on Palmerstone in an old car repair shop. Two big garage doors radiate a red glow from their windows and allows you to peak into a busting kitchen and dining room. So many restaurants try to create an ambience but fail in trying to make it something that it's not. Woodlot just...is. It's warm, full of wood and a bustle which creates an inticing, romantic and electric vibe. There's two floors of seating but everything feels like one. A seamless connection of wood and warmth.  Enough about the ambience I know and more about the food. The food, oh so good. Remember I was telling you about the homemade bread, well Woodlot doesn't stop there - everything is made there. All pastas are homemade and they make their own deserts! I'll talk about a few of the dishes, but you need to get in there yourself to try it all.  NOTE: The popularity is really picking up so make sure to make a reservation a week in advance.  As other reviewers have told you, there are two menus: vegetarian and meat. Perfect for me. Dozens of times I've gone to a restaurant and wanted to try a dish but couldn't because there was meat in it. Woodlot will have the same pasta on both menus meat or sans meat.  I ordered: -  the French Onion Soup: Yes, finally a place that makes it without the beef broth. I've tried to master it on my own but failed. Woodlot's version had a fine balance between liquid, cheese and bread but I found it a bit too salty for my likings and would of enjoyed a little more melting off the sides. - Homemade Parapadelle Pasta with Chantarelle Mushrooms and Caramelized Onions: O NELLY! This was the favourite on the table. The pasta was cooked perfectly and the chantarelles were centre stage with the olive oil playing a beautiful accompaniment. Let's just say the bowl was left empty. I ordered the half portion and it was plenty.  THE DESERT: Yes I'm using capitals because its waranted. 1. They made it in house 2. I've never, ever, ever had anything quite like it in my days of being a sweetaholic.  3. There's marshmallow. Are you ready for it..........ready.....here it comes....  Lemon custard tart, filled with a mix of berries and topped with a homemade marshmallow, lightly toasted on the top to a caramel glow. OY!  To save you some time I'm going to stop here. Pick up your phone and make a reservation, for the next available time they have. I know I'll be making my next reservation really soon. So happy to see a new restaurant of it's caliber on the college strip. Hopefully it will revitalize the rest of them!  Oh and don't be afraid to ask for another basket of bread! The butter, top shelf!"}
{"text":"I am always impressed to see a restaurant with a Yelp review over 4 stars.  After dining at Woodlot for my third time (after not having dined there in over a year), I am giving it a full 5.  We went with three other couples and were seated on the chef's table right by the famous oven that is the key element in many of their delicious dishes.  I was also distracted by the chefs' so diligently making each dish, which definitely influenced our table's menu choices.  We all started with the mushroom salad.  Not only was it delicious, but it looked like art (sadly I ate it too fast to take a picture).  My partner and I shared with tofu dish and the vegetarian pasta.  Both dishes were interesting, and of course, beautifully plated.  The pasta was the winner of the two with little pieces of popcorn combined into the dish.  They featured the pasta on the carnivore menu too.  I love that they have a vegetarian menu.  I almost forgot to mention the bread ... the sourdough bread melts in your mouth.  I had to exercise serious self-restraint not to overdo the bread.  After this most recent experience, I will definitely not go another full year without enjoying a meal at Woodlot."}
{"text":"We went to The Woodlot on a Tuesday and had no reservations. We had to wait for a seat at the bar but it was worth the wait! The bartender and host were very friendly and sitting at the bar turned out to be better than a table because we were not distracted by the crowd in the dinning area. We shared a red fife pasta dish w/ a wild boar sauce, duck cabbage rolls, and a white fish potato salad. This was enough food for three hungry people. Excellent mixed drinks. Loving, homey presentation and the entire bill was $99! We will return, but with reservations next time."}
{"text":"I really think the place is over rated a little. You can only go by the reviews here. It's good at picture of what to eat as they do not show their menu online, but since they change their menu all the time, the Venison Bone Marrow pie I was looking forward too wasn't available.  The price ranges from $20-25 an entree    I'm actually really tempted to only give a 2 star review for what happened and but the food gets a 3.5   food was okay but not amazing. By the end of this I might have changed it.   It's definitely not a 4 because although I would recommend the place for people to go, I would not come here again.   The restaurant is tucked away in little Italy. Yay for free parking on Palmerston on weekends and after 6pm. It's got a lot of character in terms of decor: a small kitchen with a wood burning stove at the back, common eating table an a small bar area tucked underneath the second level staircase. The balcony on the 2nd level overlooks the whole restaurant. You feel like you stepped into a rustic otherworld. I noticed quite a bit because we had to wait.  It started offs okay as making a reservation the hostess was very friendly and prompt to call me back. However, we arrive at 6:59 for our 7:00pm reservation and we were told that our table has not left yet and we had to wait.  So we stood there. Awkwardly in our huge winter coats. They had small benches and some chairs to sit , but our party of 5 seemed to not fit.  Why had they booked us back to back with someone else? How do other restaurants manage this? I have NEVER experienced this before in my whole lifetime of eating out.   We did not get seated until 730.   During this wait time, we mulled over their meat and vegetarian menu. We ended up getting -  the Boar Ragu Parpadelle (very flavourful and tender meat) *** $20 - the duck cabbage rolls (despite everyones raves about this, we all agreed it tasted a bit bland) ** - the ham hock pie (a pot pie creamy with a flaky top)***1/2 - bone marrow mashed potatoe side dish (creamy with a kick) **** $5 - butter and sage gnocchi (pan fried with brown butter, crunchy and chewy in the right spots) ***** $5 - winter greens with cheese (nothing special, a bit too cheese and artificial tasting even though it probably was all natural)*** $5 We shared all these Chinese style. It was a great way to try everything but one enough to try once. I would have probably would have liked a repeat of the pasta.   For DESSERT you must get the Lemon Tart with blueberry and marshmallow. It was decadent and the highlight of the meal ($8)   We also got the Apple Tartine with honey gelato (it was good but not after the former.   In the end it was $22 per person including taxes and tip. Quite reasonable and I expected to spend more. Our waitress was more than happy and friendly and brought up the card machine to take our individual payments.   Actually all the staff are super friendly.It was really a bad experience and annoying that the reservation was not accurate and poorly booked. I really hoped they learnt their lesson and do not continue doing this.    Again, come here if you're looking for a restaurant with character and you want to try something a little different.  I just won't be coming back for a long time, or I see their menu online.   I can't decide on the star rating. Terrible beginning deserves -1star , however only some of the food had it's moments buy not all. I guess it will be a 2 afterall and a 3 if the incident didn't happen."}
{"text":"I really enjoyed their food, the ingredients were fresh and local. Atmosphere is cozy and very friendly, and the prices are reasonable I would definitely go back"}
{"text":"The food here is delicious, fresh, and creative. I loved my stuffed Poblano pepper, tomato salad, and the cavatelli we had was outstanding. However, I am rating this four stars only due to Woodlot's lack of ambiance.  We were seated on the second floor, which was extremely crowded, noisy, and hot. For the first hour (we came at 9:15 on a Friday) my boyfriend and I just shouted at each other to be heard above the dim, and we couldn't hear a thing the waiter said. Everyone else also appeared to be shouting to each other to be heard. This caused great confusion in getting answers about various dishes or even discussing with each other what we wanted to order. To the owner's of Woodlot: There are these amazing things called sound-proofing tiles that you can put in your ceiling--they are not expensive, and you NEED them. I won't say the noise ruins the delicious food, but it certainly means I would not rate this as a \"top\" restaurant in Toronto."}
{"text":"Had a really fantastic meal here for my first night in Toronto and on a friend's birthday.  Everything we had was good to great.  We loved the baked cheese appetizers and loved the dessert.  Our entrees were pretty good (which included the sweat breads and homemade gnocchi), but overall very very rich.   The side \"salads\" were probably both our favorite and least favorite dishes which sounds nuts, but believe me.  You can only take two bites before you've had enough they are that heavy. The drinks were also pretty enjoyable.  Quiet and elegant environment with a cool mix of hip and trendy food vibes gives this place a solid A.  Slightly expensive, a bit small and exclusive, but sometimes that's just what you're looking for in a special meal."}
{"text":"great job woodlot. amazing atmosphere. the food was excellent. im so close to 5 stars but i just cant do it. the chefs show alot of restraint which is awesome in my opinion. They really let the ingredients shine, my char was just a bit too dry and SLIGHTLY over. everything else was spot on. amazing sunchokes with a ginger carrot glaze and a fantastic haloumi and peach crostini. wine list was decent. overall a great space and really reminded me of camino back home. id like to apologize too to the server my guest was kinda rude about food taking long even though it was my fault for not finishing my first course.   great staff! great vibe! great food. ill be back fooooo shoooooo"}
{"text":"I wanted to try Woodlot for a while and I finally made it with a friend about three weeks ago.  The staff was friendly, attentive and knowledgeable. The food was SO good! We had a salad, pasta, dessert, coffee and a bottle of wine. The bill came to $70 each with tax and tip. Totally reasonable.  Yummy. Can't wait to go back."}
{"text":"We've ALL had Comfort Food before.  Doing Comfort Food in Toronto is highly challenging simply because of the diverse backgrounds of the demographics and what's nostalgic to one is not for the other.  Simply ask where/what all those Taxi Drivers go out to eat.  That said, Woodlot accomplishes it's task for the \"majority\" of Fine-Diners that they accomodate.  Service service service.  I was actually sad to leave the Table for once.  It's not the fine-dining madam/monsieur type of service, it was simply a young lady caring for her customer type.  She sure has her ESPN on, knowing everything we would need before we even thought we would or should.  Technically, execution of the dishes was near flawless.  No Piggy was harmed during the making of this dish.  Taking full care to spare the Pork Chop from overdone sawdust pukeness and the same methodology was used on the Steak.  Plating presentation shows refinement on the Apps while the Mains brings you back to rustic Comfort(food).  I just wish it didn't take so long to cook SIMPLE food, I'm starved.  Tomato and Watermelon Gazpacho($9.00)  - This new take on Gazpacho made me wish it was more traditional based.  Oily over-salty Fried Bread(Crouton) and Olive overwhelms the delicacy of the Watermelon/Tomato liquid.  Ember Grilled Hen o the Woods Mushrooms($13.00)  -Speaks of Comfort Food all the way, simply done, beautiful earthy ingredient accompanied by Wild Rice, Walnut, and Mache with Balsamic.  Hokkaido Scallop Ceviche($14.00)  -Isn't Hokkaido on the other side of the Globe?  Smoothness of the Avocado dollop, acidity of Grapefruit are quite enhancing.  Quinoa made me feel I stepped into a health-store.  If I didn't know better, I would have thought I ate a deconstructed nori-less Makisushi.  Mains:  Roast Pacific Halibut and Porcini($23.00)  -  **** Chop of Whey-Fed Pork($26.00)  -  *** Roast Naturally Raised Flat-Iron Steak  -  *** Grilled Maple Glazed Sweetbreads and Bacon  -  ****.5  Under the low hue of the lamplights, it makes my other non-optic sense heighten which is the opposite of tasting meh Food on planes at high altitude.  Relying on taste, the Pork Chop taste like Chinese BBQ Pork while the Steak was BBQ Charsiu.  Nostalgically, that wasn't too satisfying to know but that's simply just my Chinese background.    What's your FAV Comfort Food?"}
{"text":"this place is a diamond in the ruff. save room for dessert."}
{"text":"My GF and I came here for our one year anniversary last week - it's her favourite restaurant, but it was my first time.   We started with a cider and a Cuba Libre, to drink - the Libre was mixed wonderfully, and both were fantastic complements to the woodsy appetizers that were about to grace our table:   We then appetized ourselves with a litte Haloumi Crostini, which was fantastic...the highlight being the pea puree sandwiched between the Crostini and the cheese. Wonderful!  We followed that up with an order of Squid Ink Chitarini (incredible) and Roasted Cod with Wild Shrimp, which I felt was incredible, but also greatly enhanced by the single best corn/jalapeno accompaniment I've ever eaten. It seems like such a little thing to get excited about, but nearing the end of the dish I was eating it one single niblet at a time just to extend the experience? Have you ever sat at a table with someone eating their meal a niblet at a time? Well now my girlfriend has.   Perfect meal to accompany the most perfect year of my life."}
{"text":"If there's anything that gets my salivary juices flowing, it is dining at (or even the thought of dining at) Woodlot. This relatively small restaurant has a wood-fired oven where they bake delicious bread but also prepare wonderfully satisfying meals. They also feature local ingredients and meats from choice purveyors, so you know the quality is there. They also have a decent selection of wines, as well as a great vegetarian menu. I've dined here several times with my in laws as well as taken friends here for dinner, and have never been disappointed in the quality of their food.   The dining room is situated on the second level with the bar present in the lower level. The ambiance is dimly lit but cozy. They provide complementary fresh baked bread in a few varieties, including red fife and sourdough.  I quite enjoy the ember grilled hen of the woods mushrooms, which are served with will rice, small pieces of beetroot, and black walnut. The wood over brings out a satisfying texture to the mushrooms as well as a delicious smokiness.  My never fail entree is the roast chop of whey fed pork. This is a staple on the menu and I hope it remains forever on the menu because the meat is consistently tender, cooked twice to achieve a beautiful crispy exterior while somehow preserving a juicy flavourful interior. It seems they change the accompaniments to the pork chop seasonally but both my mother in law and I could polish off the whey fed chop enthusiastically. Occasionally I have been known to discreetly gnaw at the chop bone to get every last delicious morsel. We both loved the pork chop so much that my brother in law called them to try to source out their supplier so we could attempt to replicate  the pork chop at home.   This is one of my favourite restaurants in the city, and will continue to be a go-to place for celebrations with my family. If you enjoy food made well and evidently with love, you have to eat here.  (54/100)"}
{"text":"Happy to report a lovely experience at this Little Italy restaurant. Whether it's the rustic interior, the attentive but not overbearing service, the well prepared food, all are worth it's proper acclaim.   On the drink menu, there were some reasonably priced wine by the glass, and while there was no beer selections on draught, they did have some nice bottle and can selections from various Ontario craft brewers including seasonal selections from both Toronto's Bellwoods and Burdock. Being able to wash my meal down with a bottle of Bellwood's Jelly King made me quite pleased.  On to our actual meal, I'll say that I'm not even a huge fan of mushrooms or squash, but both of our starters including the Ember Grilled Hen-o'-the-Woods Mushrooms and the Fire Roasted Winter Squash were top notch.  I had the Roast Chop of Whey Fed Pork for a main. I will say at $32 for the porkchop, it's hard to argue for any \"value\" in the meal, but it was well prepared and paired nicely with the Woodfired Potato & Rutabaga Gratin which I ordered as well.   Complimentary sourdough bread was provided at the start of the meal. I'd heard about their bread but it didn't really live up to the hype. Perhaps if served warm I'd give bonus points for that, but its just bread either way so it's not taking much of a weighting on this review.  All in all, I'm glad we came. I can see why this place has had long standing success."}
{"text":"Great casual environment. Tasty food -- nice wine list with some reasonably priced house wines ( had the Pinot blanc and it was a perfect match for our vegetarian feast ).  Excellent, knowledgeable (and friendly) server with a feather tattoo.  We sat upstairs on a Wed night.  Reserved a week in advance.  Don't try to go without a reservation, especially not on a weekend. Not as expensive as I thought it would be.  Overall, fantastic dining experience. Go for the early (or late) dinners when it is not as busy."}
{"text":"Went here for dinner on a Sunday night.  Sat in the upstairs part of the restaurant.  Tables were packed in pretty tight so definitely felt cozy with our neighbors.  Waitress was not the friendliest and did not seem very enthusiastic/helpful.  Tried a couple of dishes (tagliatelle pasta and steak).  Portions were on the average side for me.  Food was good but probably not worth the price.  Overall, ambiance was average, food was probably better than average, and value was below average."}
{"text":"Decor & ambience: Industrial Chic, cozy, buzzing. Service: Friendly staff, very enthusiastic water-girl. Food & beverage: They have interesting \"Game of Throne\" cocktails. I had 'You know nothing Jon Snow' with gin as the main ingredient & loved it. The vegetarian French onion soup was very good. It is rare to find vegetarian French onion soup. The russet potato gnocchi & celery agnolotti were superb! They also had poached duck eggs as part of the vegetarian menu? Strange. Though it comes up in search for vegetarian restaurants, they are not. They only have a few vegetarian items on their menu. The portion sizes are very small. The soup was $9 dollars for an inch below the rim & $15 filled to the brim! Same with entrees - very small portion sizes for $17, a few spoonfuls more for $26. Good food though we are fighting the urge to stop at a Taco Bell for a fill up!"}
{"text":"Ok so, A LOT of people love woodlot. I think it is OK. Their bread is amazing so that's a plus, and Halumi crostini A++++!!! Definitely get that. I got their \"spring salad\" but it was just dollops of goats cheese rolled in ash.. I don't know I guess they are trying to be really fancy but I would have preferred something with more veggies. I really liked the gnocchi poutine but the person I was with hated it. Did not love the peanut butter chocolate dessert. And then our server recommended the mead and it was disgusting.   I appreciate that they make an effort with the vegetarian items, and I love their bread but otherwise I am just so-so with woodlot. ¯\_(?)_/¯"}
{"text":"I went again, because I'm open minded, and it was a friend's birthday.  Service was very slow, it took us over 45 minutes to get our appetizers: Hen-o'-the-woods mushrooms were over-salted, the accompanying wild rice was under-cooked. Raw Alaskan sea scallops came with soggy, excessively vinegared vegetables; trace amounts of micro-basil were nice--could have used more!  It took another 45 minutes to get our mains (i.e. over an hour and a half from when we ordered): Roast Lake Erie pickeral [sic] was astonishingly bland. Warm kale salad was the only part of the meal that approached satisfactory: chewy and sour, but not displeasing.  I am never going back under any circumstances!"}
{"text":"Overall, Woodlot serves... good food but I left feeling that the damage on my wallet was unworthy. Prolly would defer to any of the tapas places nearby than go back to Woodlot.  AMBIANCE/SERVICE Too dimly lit but decent level of ambient buzz Amazing service, not pushy, very knowledgeable  FOOD ($68 incl tax and tip pp) For reference, here is what we ordered. Nothing was really outstanding.   Ember Grilled Hen-o'-the-Woods Mushrooms w/ wild rice, black walnut, beet root and dill ($15) Russet Potato Gnocchi w/ porcini  mushroom ragu, smoked onion, balsam fir and parmesan ($17) Roast Chop of Whey Fed Pork w/ charred pineapple,  jerk sauce, lime and mint ($29) 1lb of Wood Fired Ribs w/ memphis dry rub, fermented buttermilk dressed celery root and apple slaw ($27)"}
{"text":"We went on Friday night and everything was perfection. Granted, we were fortunate to be seated at the best table in the house, up on the balcony, with a view of the open kitchen and very cool wood-burning oven.  The service was great. Never needed a refill, everyone was very attentive.   Do not be intimidated by the hipness of the staff! Yes, they are ridiculously hip and pretty young too. The bartender, who came upstairs to talk to us about the after-dinner drink options, looked like a member of Broken Social Scene, but he knew his way around a cocktail list too.   The food was amazing. Very hearty, country food, and large portions too. We shared everything, and there were 4 of us and we ordered a lot. I recommend the homemade pasta, the venison pie, lamb tart, and the bread is amazing. They bake it there.  This place is already super popular, and deservedly so. Recommend."}
{"text":"While visiting Toronto from the US, I wanted to explore what I read to be one of the best vegetarian restaurants in Toronto.  I have not been to any other vegetarian restaurant in Toronto but as a 25+ year vegetarian I have sampled many and this was one, if not the best, I have encountered. The ambiance is casual and has a farmhouse type interior with a kitchen and wood burning oven open to the public (a huge plus to witness the making of your meal).  We ordered well made cocktails as we were in no rush, and never felt rushed either. I had the pappardelle pasta with wild mushrooms for an appetizer and a stuffed turnip with a wild oats warm salad entree.  My description does nothing of the high quality blend of flavors that the kitchen staff was able to put together.  My wife, the non-vegetarian, had smoke trout as an appetizer and pork chop entree, which she stated was delicious.  With a large selection of wines and extremely attentive service, the meal could not have been better. It is a great feat to be able to equally accommodate a vegetarian and meat eater, with separate menus, at such a high professional level and producing a wonderful, tasty meal.   I can't wait to go back."}
{"text":"Delicious. Intimate. Trendy. Woodlot doesn't disappoint no matter whether you're coming for their freshly-baked bread or their upscale dinner.  Awesome Fact #1) The upstairs loft is cozy and atmospheric with dark lighting and an exposed brick wall.  Awesome Fact #2) The baking supplies lining the wall is SO COOL for baking nerds like me.  Awesome Fact #3) They offer half bottles of wine in carafes for when you want a little more than a glass (if you're splitting between two people).  Awesome Fact #4) They serve a complementary basket of three types of house-baked bread. They're all amazing, of course.  Awesome Fact #4b) No seriously, their bread is SO good. The sourdough has an insane depth of flavor that I can't stop thinking about. Don't miss out on the bakery, but beware it doesn't open until noon.  Awesome Fact #5) They provide a vegetarian menu! Amazing.  Awesome Fact #6) The cheesy gnocchi melts in your mouth.   Awesome Fact #7) The roast fish is perfectly complemented by the crunchy breadcrumbs, the smooth potato puree, and the burst of corn and bacon bits. Definitely a winning dish.  Awesome Fact #985) The roast peach and almond meringue dessert uses anise without tasting gross! I hate anise and this dessert still impressed. Not my favorite roast peaches I've ever had, but still tasty.   BONUS: If you come for the last seating, you might end up walking away with a free loaf of bread!  Definitely now one of my favorite Toronto upscale dinner spots."}
{"text":"Great spot - we sat at the communal table - very fun option / still intimate but with lots of energy coming from the kitchen.  Our experience was fabulous - great friendly service, awesome wine selections, very tasty and creative food.  The breads were delicious...of course we had too much, but worth it!  Oh and the cheese too!  Great local suppliers and tons of wholesome options.  I look forward to my next visit...  One warning - Woodlot is not a cocktail spot - the guy beside me tried to order a vodka soda and it came in a ridiculously small glass - like something out of a little girls tea party set!  Stick with wine or beer!"}
{"text":"Noisy place on a Tuesday. My chicken-mushroom pie was soggy and had no mushrooms that I could find, a bit of a downer for $27. Others were happy with their fish and pork chop. Wine expensive, apps good, but overall rather less of an experience than expected."}
{"text":"Smells like baked bread - probably the best thing I could say about this place.  First impressions - interior is really nice, two levels, servers are really friendly and helpful. It is extremely busy, had to wait a while then they gave us a seat at the bar which is tinyyyy and cramped, whatever we just wanted to try it out.   Had some bolognese pasta (I never order pasta at a restaurant for good reason). It was boring, plain, and I probably could've cooked something as good at home. What IS good is that you can get the mains in two different sizes (which is good for some of us who can't eat very much). My boyfriend had the lasagna with chanterelles and bechamel sauce since he's a mushroom lover. It was unsalted and the flavour was flat. No nuances or umami from the mushrooms. The portion was HUGE however and we had some to take home.  All in all nothing special.  Would I return? No."}
{"text":"I can't say enough about this little gem. I actually take every opportunity to talk about the food and venue (open kitchen where you can see everything being made). These are the top lines things to know...  1 - The homemade bread is amazing. Eat it, then order some more to eat. 2 - The plates are perfect for sharing  3 - The accoutrement for the oysters is top notch 4 - The make their own ROOTBEER!! It is amazing. It has the taste if rootbeer with an afterstaste that makes it seem like it was created in some gastrometric lab. A lab that only produces molecularly perfect food. Therefore...it's a good thing. I wish more stuff had that lab taste. We ordered a shot and the waitress came over with a rootbeer/whiskey tipple that was a perfect part of the meal. 5 - The steak is fab but I could eat the pork all day. 6 - There is a secret drink on the menu. I don't know what it is called but if you like darker ale and campari it will change your life.  Go on...get stuck in!"}
{"text":"I really wanted to like this place...boulangerie in house?  Fantastic.  The bread was awesome, BUT the food...the service...the wait...  We had a reservation, no problems, but we started at 7 and waited 30 min for app (raw scallop), another 40 after that for 2 pastas (squid ink pasta and gnocchi), and then another 50 after that for 2 mains (steak and cod).   Nearly an hour between courses?  That's ok, there's awesome bread.  We asked both servers twice who were helping us for more bread between the pastas and the mains, both servers said absolutely!  And then none came.  Only when we pointed out it had been 45 min since pasta did they bring another basket, 1/2 as full as before.  Even water was a struggle - I get that it's busy, do you really need to carry a jug of water that only fills 2 glasses at a time?  Who does that help?  Management, get them bigger pitchers.  Or carry 2 at a time so you can serve an entire table of 4 (not an exorbitant party in my opinion...).   I called beforehand about bringing a cake for my friend's birthday - another 30 min and 2 requests just to bring it up the stairs (OH and the server told me it would take a while because they are slammed downstairs when I asked for it the second time.  I asked why?  I baked the cake.  I told them I didn't mind popping down to get it, and then he said they didn't want to bring it because they didn't know whose birthday it was! What the WHAT?  Is...is this a joke?  Let's go with yes.)...losing patience at this point because I know I spent money for time I know I'll never see again, and for food I barely remember because my memory isn't like that of an elephant's.  They brought it with no knife...we requested one, they said they wanted to cut it downstairs...to which my friend asked \"won't that take another half an hour?\" But it didn't matter because they whisked it away anyway.  But they did stick a candle in it which was nice.  I guess for $15 to cut the cake they didn't want us to lift a finger.  3.5 hours later we left ($5/person - our 4th member had to leave after 1.5 hrs).  I was ready for Elevensies.    The food!  I LOVE raw scallop! So I was...disappointed.  These were sliced unevenly - lopsided and varied sizes...the vinaigrette was nothing special, and then seasoned with coarse sea salt.  I was looking forward to the smooth texture of raw scallops...it was interrupted by the crunch.    Pastas arrived cold, gnocchi was good, but not the best, maybe because it was cold.  The squid ink chitarini was an amazing texture.  We ordered the large portion of both for 24, it was not, in my opinion, worth that in quality or in quantity.     The cod was overcooked!  Sandy in texture...sigh...and cod is so buttery normally...Steak was good but DROWNED in a rich, creamy, herbaceous sauce.  Looking at other tables they had about 1/2 as much sauce.    Our bill wasn't huge, after reading some of these reviews I thought we'd have lots of food (especially since the 4th left before we finished the pastas and didn't have any part of the entrée dishes), but we could have done double what we ordered.  But it took so long to get the first round a second ticket would have taken us into the next day.  I don't know if it was just a new chef on the pass, it was not what I expected.   Sorry, I only would recommend the boulangerie.  Would not go back."}
{"text":"Been trying to come here for a long time and finally decided to make reservations four weeks in advance. At first the time I wanted was not available but the day after it came available so I modified the date.   We got there and were seated immediately upstairs. I think the atmosphere feels better downstairs bit its intimate upstairs.  Got the hot toddy which has a leaf for fir in it like they took it off the Christmas tree outside. But it was a delicious drink!  For appetizers, we tried the Caramelized Onion soup which I think wasn't that interesting. And the grilled mushrooms which was fantastic. The textures and earthy flavors of the mushrooms were a perfect compliment. It kinda felt like eating mushrooms picked from the backyard but in a good way.  I had the toutiere as my main made with pork, beef and venison. So the flaky pastry was fantastic and as a whole it tasted nice but for $26, the ground pork/beef/venison didn't really distinguish itself. I feel for $26 you gotta be able to know what you are eating and for it to taste special.  The Egg Pappardelle wit duck was fantastic. The pasta was cooked perfectly al dente and there was plenty of duck, much more than expected.  I felt the waiter was nice and always came around to refill the water. Was surprised he didn't ask if I wanted another drink, cause I would have. The food came out really slow though. I don't know if this is normal but too many times we were sitting there waiting for food. They should quicken this up a bit.  Overall I liked the food, some things weren't worth the price (tourtiere), some thing were (pasta). If food came out faster I would have given it a higher rating."}
{"text":"Had the steak. I asked for medium-rare but I think it was more on the medium side. The flavor, however, was good and it was not bad. The service was great with friendly server and waiters. I sat at the bar and the bartender was very nice and helpful. It was a good experience overall."}
{"text":"We made our way to Woodlot after our reservation at Playa Cabana were not honoured. It was the best thing that could have happened since we had an amazing meal this evening.   We started off with the grilled haloumi cheese crostini and the burrata & heirloom tomato salad. We enjoy both apps, the crostini had this amazing pesto made with peas and the burrata cheese was so fresh and smooth.   For our mains, our table ordered the wood fired ribs, spaghetti and meatballs, pork chop and the flat iron steak. From the first bite, you can taste the quality of the meat. The ribs were so tender, they fell off the bone and the rub was the right amount of flavour. This was by far the favourite at the table. My sister enjoyed her pork chop, it was perfectly cooked and it came with a wonderful dipping sauce. At first glance, the portion of the spaghetti and meatball seemed very small. But the noodle were made in house and they gave you a mountain of meatballs. Lastly, my steak was cooked the way I like it (medium rare) and came with mushrooms which is a perfect pairing. We also shared the polenta fries which was served piping hot and had a tasty basil aioli.  For dessert, we ordered pavlova, chocolate cheesecake and the treat board. It was the perfect ending to our dinner.   I found the service to be very professional and friendly. The restaurant has a very cozy and homey feel which I loved. I would not hesitate to recommend this restaurant to family and friends. I can't wait to come back again."}
{"text":"The prix fixe was totally worth it (the one without dessert). Started with the French onion soup which was delicious, cleaned the bowl. I got the ravioli which was fantastic if a bit rich. Tasted some of the steak which was cooked perfectly. They brought out a bunch of sides and the kale salad was by far the best, the potato sides were a bit bland. Got a chocolate truffle at the end which was perfect. Ambiance was fun and cozy with the wood stove. Service was accommodating, honest, and friendly. Great wine and beer list."}
{"text":"What a gorgeous and lovely restaurant!  We were lucky to get a table in the patio. An old tree trunk has been sawed in half and converted into a table top. I love wood. It is so Canadian.  My group of 4 shared the table with another couple eating at the far end. Although communal in concept, there is no community happening. People are too immersed in their worlds to strike up conversations. At any rate, we had a fantastic time outside!  We shared an appetizer dish: gorgeous endive salad with tiny morsels of beets, grains (wild rice), endives and mushrooms. So exquisite.  Every one ordered a different dish. I ordered the (russet potatoe) gnocchi with mushrooms, cooked in bacon, and lest I forget to mention the sunflower seeds! It was rich and delicious and comforting and filling. I loved it! It's the perfect Canadian comfort food. My other friends ordered Lake Erie Pickering, Lamb and the vegetarian version of the gnocchi. Everyone loved their dishes.  This is such a gorgeous experience and a remarkable showcase of what modern Canadian food is.   Happy Canada Day!"}
{"text":"I would highly recommend the Woodlot. The service and value for money for amazing - but what was really impressive was the food. It was delicious. I got the gnocci and it melted in my mouth. For dessert, I got the meringue with the carmelized peaches and raspberry sauce. It was so good. A great dining experience!"}
{"text":"Came here last night with reservations. We ordered Arctic Snow Crab Salad on Toasted Brioche ($16), Carrot and Ginger Stuffed Sourdough Agnolotti ($26), and the Rainbow Trout ($26), and two beers.  We give 4/5 for food. It's definitely good, and the flavours are there, but fall short on some minor technicalities. The rabbit didn't fit so well with my pasta, as a few giant rabbit chunks were just awkwardly tossed in that you can't really eat while you eat the pasta, or maybe my mouth just isn't big enough. There was also a random cube of dried up cheese on the side of the plate that I really don't think was supposed to be there. But again, all very minor issues.  I can't speak for wine, but the beer selection is decent, featuring a few beers you probably haven't tried. It has two particularly good beers: the Trappistes Rochefort 8 ($10, Belgium) and Dieu du Ciel's Péché Mortel ($12, Québec). The other options were meh, perhaps with the exception of the two $40 beers from Trou du Diable. On the menu they incorrectly classify the Rochefort 8 as a Quad; the Rochefort 10 is Quad, yet the 8 is a Belgian Strong Dark Ale.  We give 1/5 for service. They weren't rude per se, but all of them were quite cold and said very few words, something you'd expect at a low-end sushi joint. We had three different servers: one who took our order, one who brought us food, and one who processed our payment, and they all had the same unwelcoming attitude. There was no introduction to the restaurant or the menu and little knowledge about it was displayed by our first waiter. We also found it pretty odd and frankly unprofessional that the waitstaff would take turns going to the corner to use their phone. When it was time to pay, we had the credit card with the bill and a brand new waiter showed up with no words, took the credit card and started punching in digits into the machine. We just found these people incredibly weird.  Overall: we enjoyed the food but the service was a huge let down."}
{"text":"I had a great dinner at Woodlot. The atmosphere was perfect for the middle of winter, and it was still \"happenin'' late on a Sunday night.   The food was great. Fresh house baked sourdough bread to start (amazing), a mushroom salad to start (this was my favourite thing I tried. Can't even describe it) and the pork chop with pear for the main (good size, cooked perfectly, and nice presentation on a warm, blackened piece of wood). Also ordered a side of cauliflower which was ok. I don't know why I ordered it, knowingly not loving cauliflower, ever. I guess I just want to be converted. Was too full to try a dessert.   The service was attentive and unobtrusive, the crowd was young and attractive, and the music and atmosphere was both warm and cool at the same time, if that makes any sense. No complaints at all, loved Woodlot. Will be back!"}
{"text":"I know it's only 9 days in, but this place has been my best meal of the year so far and I have a feeling it will stay that way for months to come!  We showed up without a reservation on a Saturday night and had the choice of either sitting at the bar or the communal table right in front of the kitchen. So if that's not your style be sure to make a reservation cause this place gets rammed, and for good reason.   With both a meat and veggie menu this place has something for everyone. That being said get the Lamb Tart, seriously it was unreal. I also really enjoyed the cocktail I had, forget the name but it was a bourbon with maple and bitters. The portions are fantastic and everything tasted amazing.  You will not be disappointed. We'll definitely be going back!"}
{"text":"Very cool decor. A large wood fired brick oven and the inside looks like a large pantry in a renovated garage.  They bake their own sourdough bread which is always delicious. Some of their baked goods such as their stuffed smoked cheddar gougeres and wood fired mushroom and TVP pie were pretty delicious. The service was excellent (the owner served us - super friendly guy) and the meats they serve are all whey fed/ organic / locally sourced etc. We tried their pork chop and the steak and well, while the presentation was solid, they were a tad bit salty and unfortunately, nothing that special. I think the items were a bit oversold to us so maybe our expectations were a tad bit high but honestly, it wasn't all that memorable. I feel guilty typing this mainly because the service was so superb.  If I were to go back, I would stick to their baked items on the menu and would definitely try the wood fired tourtiere - which I am being told is amazing. Woodlot is testament to the fact that the restaurant landscape in Little Italy is changing and living in that area, I can always appreciate variety."}
{"text":"My BF took me out for my birthday dinner here and we were both VERY disappointed.   Maybe we just happened to be in on a bad day, maybe the wrong chef was on shift that night,  but it wasn't the service that was disappointing IT WAS THE FOOD.  The restaurant is cute and you can see the huge wood burning oven they have there. The staff were all very friendly and service was great. We had what felt like the best seat in the house.   But....the food.  The bread that is made in-house was dry and some of it was burnt.   The gnocci was VERY tasty but portion was weak.   The asparagus was okay but portion was weak.   The steak. This is why I'm writing this review (I don't normally write reviews)... we went with the steak because we're meat lovers and you can never go wrong with steak. Plus, we love steak soo much and its very hard to \"screw it up\". The steak was BAD. It looked great. We asked for medium-rare and they brought us medium-rare. But it was soooo unbelievably tough, we found ourselves gnawing away at pieces for forever. Was like rubber. It wasn't even tasty. We were sad. We shelled out a lot of money, left hungry and disappointed. Thought about all of the wonderful food we could have gotten for way less money at the thousand of wonderful restaurants here in Toronto.  Okay, so maybe that is not a horrible review that deserves a 1-star rating. But this place isn't cheap. It's quite expensive. We don't mind going out for a nice, expensive dinner and it was a special occasion. But the money we shelled out for the toughest, most tasteless steak I have had in my life and leaving unsatisfied and hungry... I've rated it a 1-star because we will NEVER come here again, convince friends NOT to come here if they ask, and will avoid it forever.   This is just my experience. We read these wonderful reviews and thought \"why didn't we get that?\""}
{"text":"Ended up there by chance, and what a great surprise! Just amazing food, so creative and tasty, I highly recommend it. And the attention was the best so nice and welcoming."}
{"text":"The best flat-iron steak I've ever had, just melt-in-your-mouth tender, perfectly marbled and complemented by a robustly flavorful sauce. Despite the unorthodox layout of the restaurant, the atmosphere still felt warm and intimate. There was chatter all around me, but I never felt distracted outside of the conversation at my own table. Only disappointment was the bread, which I heard so many glowing things about. Maybe it was just an off day, but it was pretty pedestrian, IMO."}
{"text":"Arrived just before 9pm on a Tuesday night and was told that we (party of 2) could be seated right away if we were okay with the bar or bar rail.  The ambiance and decor was nice.  We ordered a French Onion soup to share as an appetizer and it arrived promptly.  After the bowls were taken away, there was an hour wait until the entrees arrived.  I think we were supposed to get bread, but maybe the waiter forgot about that.  My entree was the duck confit and pork belly.  It was okay, but unimaginative.  The pork belly was fairly dry, but I liked the consistency of the duck and it wasn't too salty.    I think Woodlot is great for Vegetarians because of its' separate menu.  I will hesitate to return again due to the mediocrity of the food and the distracted service."}
{"text":"I celebrated a special occasion here and we both really enjoyed the food. Everything is clearly high quality and the chef had paid a lot of attention to detail when preparing the dishes. The menu is small so that fresh ingredients and attention can be paid to the dishes which is something I love.   Our waitress was really pleasant, and the service overall was great  The bread is amazing :)  Very intimate environment because it is a very small space. The only thing that bummed us out is that since it's a small place, sound travels from table to table very easily. We had a quiet meal for a bit but by the time we finished our appetizer, a very noisy person was seated at the table next to us. It was only a group of 4 people, but they had one guy who spoke SO loudly, and seemed to always be yelling. It was so annoying to us that we decided not to get dessert and to leave and get something sweet somewhere else.   I would love to come back here and hope that no annoying people get seated near us because the food was VERY good :)"}
{"text":"The atmosphere is different depend where you sit. You can sit at the bar, the communal table, or the formal dining area.   My bf and I opted for the bar, we wanted a quick bite before heading to a concert. The staff was attentive, but the food took about 45 minutes! The pork main with apples was plated on a small cutting board by the taste was not that memorable. I had the tagliatelle with pea and mint, it was nice, something different I don't usually order. The side roasted turnips were good. The radishes seemed like it was trying too hard with seasoning, it wasn't that great.   I would go back to give it another shot or try their bakery side of the menu. Not somewhere I really want to go back to right away. Just a good option if I needed a change of scenery."}
{"text":"First, the atmosphere: pretty nice. We had reservations to sit in the loft, but from what I have gathered, the large table downstairs is first come, first serve. The table downstairs is right next to the open kitchen area, in hindsight it might have been fun to watch the kitchen from that seating area.   The service was ok. If yelp allowed half stars, I would knock this review down a half star for it. Our server made our questions feel a little unwelcome.   Example:   Me: \"What is the difference between the two lagers on the menu?\"  Her: [flatly] \"We have four lagers.\"   Ok, so ask me which two I am referring to or just describe all four.   Example 2:   Me: \"Is there any cheese in the beans?\"  Her: [again, flatly] \"There is cream.\"   Ok, well that still doesn't answer my question.   The last thing I ever want is to go to a dining establishment for a special occasion and have the server treat me like I am a nuisance.   We ordered the trip tip with shallots and sherry, a maple tofu dish served on white beans with preserved lemon and spinach, and a side of rapini. The tri tip was cooked to our liking, the rapini was ok, the tofu was weird. It was maple glazed and stuffed with prunes and walnuts (I think). Seperately, I think this tofu dish would have been ok, but then it was served on the beans... it did not work together. I was hesitant when I saw the dish on the menu, but tried to step out of my comfort zone and trust the chef's judgement. Mistake, it just didn't work on this dish.   I read several reviews on here before making the reservation. It sounded like most people left a bit let down and were not wow-ed as much as they were expecting. That was pretty much true for me, as well. I think I was lured by the two menus. Lesson learned, listen to your fellow yelpers. :)"}
{"text":"Great restaurant! The steak is one of the best I've had, and the cocktails are yummy. Everyone at the table loved their meals, including the vegetarians. Wait for food and drinks can be quite long."}
{"text":"Really bummed about our meal.  The onion soup was the only thing that made me feel better about the food here.  The place is adorable and smells amazing.  Someone small and reservations are a must.  We had the gnocchi and ravioli dish to start.  The gnocchi was cooked perfectly but the sauce was not that good.  The ravioli was a little too al dente for my liking but it was better than the gnocchi.  We ordered the pork chop.  It had fig and another sauce.  It was a good piece but didn't wow me.  It also was served cold.  Maybe they forgot it was sitting out before they served it?  I was really hopeful about this place."}
{"text":"I've eaten at Woodlot three times now and I think it's safe to say that the place earned my \"Favourite Restaurant in Toronto\" title for 2010.  Love how they change up the menu every once in a while, and although it is hard to get a proper table, the communal table and bar dining experience is still great.   Highly suggest that you order whatever variation of pie they have on the menu.  Although the price point is high, you are paying for good quality food served in large portions."}
{"text":"We came here on Thursday night and ordered two things from their vegetarian menu--the stuffed anglonotti and the gnocchi. Both were really good! The gnocchi was dressed with a mushroom ragu. I love mushrooms, so naturally, I loved this plate. There was a smokiness to the dish that was good as well. The anglonotti was excellent as well. It was stuffed with marscarpone...anything stuff with marscarpone is good, isn't it?!  I outsmarted myself though. We were a little concerned that there would be too much food, so we got half portions of each. I didn't realize that probably the full portions were modest sized ones that we could have finished...ah well, that's good to know for next time!  We had the treat board for dessert. It was the perfect size for sharing. There were about 6 or 7 treats for each of us. Probably, I would say only one was super sweet, while everything else was just right (at least for me). To my surprise, the macaron was awesome. I'm not saying I thought they would have made a bad macaron; rather I'm saying that because it's so eventhough macarons are so commonplace now, the ones here were kinda awesome.  I really liked the restaurant. There was a relaxed feel to it. The menu did not seem pretentious to me, and the food spoke for itself. The service was good and friendly too. People came by to  check up on us several times though the meal.  I'd come here again for sure. It'd be great if there were more places like Woodlot around as well though!"}
{"text":"The hype is unbearable.  For months now, everyone's been talking about Woodlot.  It's all that you've been able to hear around town.   \"Have you been to Woodlot?\",  \"Oh, we have a reservation at Woodlot in two months.\",  \"We're naming our next child Woodlot.\", etc.  It's the kind of thing that's made us stay away.  That being said, we'd been secretly eager to eat at a place that's been name-dropped by all of our friends.      Walking in all that I could think about was that the space used to function as the coke bar known as the Octopus Lounge.    A place known more for nosebleeds than nicoise.   All the remnants have been cleaned out, and the only white powder that remains is from the mouth-watering bread that's baked in house.  The Octopus used to attract lots of the city's acting scene... a crowd who now seems to be serving as the wait staff.   They wear plaid.  It works well.  The vibe is decidedly non-pretentious.  Almost force-ably so.    They do anything they can to make you feel as though you're a casual guest who's just walked in off of the street, not someone who's been on a wait list for two months for a saturday night reservation.    Everything in the design is gorgeous and open.  You can see the giant wood-burning oven in the corner.    You can see the chef preparing your meal by hand.    There are no hidden microwaves.   There is no deep fryer. There is no bagged salad.     The worst looking thing in the restaurant is you.  The food comes and it's superb.   It's not just good.  It's exactly what you've been looking for.  There's a reason that there's mad hype.     Perhaps the best thing about the restaurant is that when you leave YOU SMELL LIKE FIRE.    That's the type of intangible calling card that leaves you remembering the whole experience the rest of the night.  Go."}
{"text":"I was so excited about this place but left feeling rather 'meh'.  So, we were really late to our reservation, being new to Toronto TIFF traffic and there being a big festival in the adjacent Little Italy. We apologized. And yet, the host acted all smarmy and offended about it. We couldn't believe he'd act that way, given that only one was table filled in the entire restaurant at 6PM on a Sunday!  Our waitress was very good though, thankfully. Huge props to Precilla C. for mentioning the homemade sodas, as they weren't on the menu. Both the ginger citrus and cherry colas were flavorful; I loved the spices in the later.  We also shared a Hen of the Woods mushroom, which was delectably crispy and flavorful and fitting perfectly with the beet flavors.  Sadly my entree--the porcini-stuffed tofu--was a letdown. I don't mind paying $23 for a small dish of tofu if it's outstanding, but it was just okay. Basically, a stack of three small slices of tofu. It actually wasn't stuffed with the mushroom; rather, there was a small amount of mushroom sauce on the side, and maybe a tiny smattering of mushroom matter between the tofu slices. The flavors were good: savory mushroom, sweet peas, lemony sauce, grilled flavor on the tofu crust--but the ratios were wrong. There was too much bland tofu and way not enough mushroom or lemon flavor."}
{"text":"food was divine, beer was good, dessert was great, bread was next level. so so down."}
{"text":"We stumbled on this by chance and lucky us! The oyster comes with freshly shaved horseradish- the best I ever had (and yes I tried raw  oyster from both side of the coast). Unfortunately it was lent and I couldn't pick from the yummy meat menu. Seafood for me it is. Did I mention the amazing fresh made in house sourdough bread? I should have gotten more!"}
{"text":"DO NOT GO HERE.  1) the portions are extremely, unreasonably small for the price. (I cannot emphasize this enough).  2) the service was very bad   Only go here if you're willing to fork $150+/person by ordering mutliple dishes, go right ahead. If you're looking for quality food for a fair price, do not go here."}
{"text":"Food was regular, quality was medium and price was high. The only thing I enjoyed was the setup and decoration. I don't think I'll go back here"}
{"text":"I went, had the artichoke hearts and also had the hen. The sauce for the hen was amazing. The hen itself tasted like a normal hen. The ambiance of the place is great for a date - if one ever has to enjoy one. The dress code is also quite casual so I can see this place being a great date place / a nice place for a 2nd date.  Parking on Palmerston, the street that Woodlot is on, is not the easiest. If I were to come here again, I would park on College St. I had to make a whole loop down to Dundas and loop via Bathurst again because I wasn't able to find parking on Palmerston.  One thing is that they claim to have amazing sourdough - by my standards it was good. Would I keep on raving about it? Probably not - but it was still good. Quoting people who went to Italy and ate pasta there - \"the bread in France was better.\"  I think for the simplicity of it, this place is one of the better places to go to for food. The food is simple and the whole concept of the restaurant is great. I like how there is a vegetarian option, given that I like to eat vegetables as well.  My opinion, and this is perhaps because I followed this restaurant up with Scaramouche, is that Scaramouche is far superior for just a $ sign more. I also followed-up this restaurant with various places that have one less $ sign and they were just as good. My take is that this restaurant is not the most efficient allocation of capital."}
{"text":"After many attempts to coordinate an outting to the Woodlot with my friends, we finally got it together. Sure the only time slot we could get on short notice was 10:15 pm, but hey the gang was free, and the Woodlot had to be finally tried.  Walking in we got hit with the scent of fresh baked bread. Mmmmmmm most places get me right there. Once I got a hold of m self and started seeing again, I saw the cause of the godly aroma that played with my emotions. A huge wood stove that had been working it all day to produce delicious breads, among other things. Like most people, we loved the decor and overall atmosphere. It is just so cute and cozy.  The food was very good as well. Lots of flavours, nice combinations of spices, and even a good selection of things for our vegan friend.   The only thing that bugged our group was the service. It was nice, but sloooooow. We weren't sure if it was due to the late hour, or just that it had been a busy day, but it took too long to get anything. This, however, was not enough of a deterrent. I will be back for more. Even if I go just to smell the place :D"}
{"text":"I had high expectations for this restaurant since a friend recommended it.  But unfortunately it didn't live up to it.  I found all the food to be very heavy and salty.  The ambiance was good, service was good but the food subpar and super expensive. I would definitely not re-visit nor recommend it to anyone."}
{"text":"My lord, Canada. Look at you. House made root beer. Tourchiere. Pot pies. The best mignonette I've ever had -- it felt like a microfacial in Tahiti. And, wait for it, no really... you're going to have to wait for it. The dinner was all in for our four top. We were tucked away in the far upstairs back corner, and being tucked in by a restaurant is really what I want. Not a table in the middle of the room, or by the door, but in the table in a corner. There was a pork chop I admired. And maybe a steak (the night got blurry). And, the potato gnocchi was nutty-dense and flavorful. Also, warning: if you're the type to overload on bread + butter at the beginning, they make their own bread and it's perfect. I could come here to eat bread, oysters, and I know you've been waiting for it... their mystery drink: a lager with campari added, and lemon. Frankly, it's the best fucking thing to ever hit my lips (sorry, Love). Campari in beer. Are you fucking kidding me? Next up. I'm flying to Toronto to request they add campari to their root beer. If your palate leans bitter, then this Campari notion is where you shall rest your mouth and hope you're submerged in it with a pair of goggles and a straw."}
{"text":"This is one of those noteworthy places on all of the best-of lists which draws yokel tourists like me. There must have been a lot of us in town that week, because the place was packed, and we had to sit at the bar downstairs.  The meal starts with excellent, fresh sourdough bread.  As an appetizer, the pea empanadas, which come with a side of pickled veggies, were tasty enough, but not very memorable.  I don't think I'd order that again.    The sunchoke veggie entree is the definition of \"hearty.\" And, actually, so is the mushroom tart entree. Both plates were tasty and filling. But it is rather expensive for this kind of food.  Probably you are paying for the experience?  The bottled beer list was pretty respectable, though I wish there were more top end Canadian beers (e.g. Unibroue), instead of selections from places like Anderson Valley."}
{"text":"Good place for the indecisive.  It's a small menu in both variety and portion size.  That said, the food is delicious enough.  They take pride in their excellent bread selection and proudly start your meal with it. The ember roasted hen o' the woods mushroom salad ($13) was smoky good.  The sourdough spin on the standard spaghetti and meatballs (small size $16) was a nice surprise.  The kale salad ($7) was nicely complemented with currants, almonds and pickled shallots.   The cocktail (even those named after Game of Thrones) and dessert list was small and a little boring.    All in all, it's a good experience in a nice environment that is still cool but calmer than the loud, small plate joints that have taken over the rest of the neighbourhood."}
{"text":"Woodlot has an outstanding wood fired oven. It has a great aroma and adds a delicious flavor to everything which is baked in there. I know pizza isn't quite in line with the other menu items, but I would have loved to try a pie made here from scratch like all of the other dishes are.  For starters, we split the empanadas and the lobster, ham hook, & potato salad. I really liked the empanadas which came with a hot sauce and a Vietnamese salad. I liked the fusion on Latin American and Vietnamese cuisines in the dish.  I had the Sourdough Red Fife Chitarrini for dinner. The pasta was cooked perfectly, and the sauce was the perfect level of creaminess.  My girlfriend had the smoked ricotta and black pepper cavatelli. Again, perfect pasta and the dish was very tasteful too. Woodlot clearly exemplifies the difference fresh made pasta makes.  Our friend ordered the ribs which turned out to be my favorite of the entrees. The ribs had a perfect char from the dry rub and the meat fell right off the menu. I highly suggest this item.  For dessert, we split the peanut butter semifreddo. I'm not usually one for desserts; however, this was outstanding. It was freshly made so it took a while to come out, but the wait was worth it. There was a great juxtaposition of textures between the soft yet brittleness of the brownie crust versus the creaminess of the peanut butter center and the chocolate fudge top. Truly delicious.  On top of it all, the waitstaff is very knowledgable and friendly. I highly recommend Woodlot!"}
{"text":"Perfect rustic food in a perfect rustic setting. Getting a reservation was no mean feat, but I'm so glad I was able to experience Woodlot.  I started with a rum and dark pop - dark pop being the cola Woodlot makes in house (they also do a white pop). It's made with cane sugar and full of tasty botanicals, like Coca-Cola or Pepsi in the 1800s remixed with root beer. Delicious!  My favourite dish was the scallops, but I also enjoyed the rich and salty onion soup. The duck confit over white beans had a very homemade feel, but the accompanying pork belly was what stood out.  For dessert I had the lemon tart with blueberries hidden underneath. A layer of roasted marshmallow on top hit the perfect campfire note, although it was an odd juxtaposition with the rest of the tart.  All dishes seemed crafted with care, and my only complaint was the unnecessarily separate vegetarian menu."}
{"text":"So this place has been the talk of the town. Everyone has been raving about it.   I decided to go with some friends for a dual birthday. There was 10 of us.   Over all, i'm only somewhat impressed.  The food isn't amazing, but it is good. Not like everyone has been making it out to be.   The best way i can describe it is old classics done well.  They have their own bakery and serve you artisian bread. would be nice is the bread was actually warm.  I had a drink that was a variation of a cape cod, with fresh grapefruit. Great drink and done well. They served it in small glasses, which is how cocktails should be served so you can still taste the booze. Well done on their part.  I had the gnocci in a butter cream sauce with walnuts. Tasted fine, but i've made food very similar and i've had better gnocci. I treid my friends oxtongue terrine and wished i had ordered that instead.  For my entree, i had a chicken pot pie with hamhock. Not bad, and done well, though my personal experience dictactes that a good pot pie should also have a base layer to it as an added surprise. My pot pie didn't have this, though i kinda wish it did. It would have taken it from the good level to the excellent level.  Desserts were great but mine wasn't. The server recommended i have an applie pie which tasted too bitter to me. My friend had their marshmellow lemon tart which is to DIE FOR. Another friend had the mousse which essentially tasted like a ferrer rocher, just a little more bitter but still very good.   What kinda put a sour twist to the end of the night was Woodlots terrible reservation policies. For a group of this size, they require you to pay $40 per seat regardless of whether your entire group shows up. They also require you to choose from a $40 pre fixed menu, or a $55 menu where the host chooses what everyone eats. I understand theyre a busy restaurant but this is ridiculous. Foodies will never appreciate having their food chosen for them unless its a home cooked meal. Additionally, having such strict rules on reservations is just out right rude. In our case, they wanted to charge us $80 for two seats not filled (reservation was for 12, but two ppl only came for a drink and left). Once they left, we gave the extra table away (as the host had told us to do at the front door to avoid a charge), and it was seated and flipped twice while we had our dinners. So they made money of that table anyway! Then the server tried to charge us, and we explained that the host had mentioned to us to give away the table. In the end they didn't charge us, but literally lectured us for next time.   That was it, the lecture kinda ruined the celebration and the night. Reduced my rating overall."}
{"text":"Terrific food. Sourdough pasta, pork chops, ribs, stuffed poblano. Vegetarian menu a plus. Small streetside elevated patio."}
{"text":"It was good but not amazing. Our waitress was very nice. The sourdough bread was definitely flavorful-- it did not disappoint. We both got the prix fixe. We *loved* the oysters; those were a good deal. The hen-of-the-woods mushrooms were tasty but weirdly crumbly and unwieldy. It was a slightly awkward dish to eat. Our entrees were mixed. The pork chops were outstanding, but the pickerel was a bit off. It felt like more of a winter dish with the mashed potatoes and buttery sauce. It wasn't what I would hope for a fish dish on such a limited menu. We were too full for dessert. We did really like the game of thrones themed cocktails. In addition to appreciating the reference, the \"sun and stars\" and \"three eyed raven\" were zesty and well balanced. Not sure if we'll come back but glad for the experience."}
{"text":"Really really really enjoy the vibe, food and staff here.   They even have a separate menu for vegetarians. I love it! Meat eaters and vegetarians can both be happily satisfied here.  I love the warm kale salad so much that I tried to recreate it at home (with limited success).   The staff are very friendly and make good beer/wine recommendations.   They have a nice little patio as well."}
{"text":"For all the hype and gushing I hear about this place, I really didn't think it was anything special. The menu is really expensive for the quality of food  and portion sizes you get. I understand that this is a moderately priced restaurant but considering its location and the amount of great food around, this place really isn't worth your time. Specials were ok but nothing too unique. There is the wood burning oven, that everyone seems to love but really it doesn't add much to the menu. The only good thing is they serve pretty delicious homemade bread pre-meal. BUT you can pick up a loaf of this without having to sit down to a mediocre meal. The restaurant is fairly small, with little seating which ensures you will be seated very close to someone else. Loud and pretentious."}
{"text":"Ambiance, food, and service was great! We got the empanadas, whey fed pork and wild pickerel! The empanadas were delicious! The pork was cooked just right, not too dry like most places. The pickerel and mashed potatoes were amazing! Overall this is the perfect cozy date night location! Definitely will be back to try this place again in the winter time!"}
{"text":"Very cozy, warm atmosphere, and great even on a summer day we were on. Their foods are all fresh and you can see the kitchen staff working away in the open concept kitchen. The serving staff was pleasant and helpful. They even called to confirm my reservation from open table.  As a beer enthusiast, I was pleased to see that their beer menu goes from $6-$44 offering a wide range of bottles.   I ordered an appetizer of the haloumi cheese crostinis which were amazing, and offered a truly unique flavour combining the cheese, mint, and peas in the dish. Definitely something to try. The only negative part was that it came in a very small portion - 3 very small crostinis!  The main course was the carrot and ginger stuffed sourdough agnolotti which was absolutely the most unique pasta experience Ive ever had. On the sweeter side they manage to keep all the flavours balanced so you can taste every flavour in this combination. A bit heavy on the poppy seeds but overall one of my top pasta experiences and #1 for uniqueness.  My partner got the russet potato gnocchi 'a la poutine' which was a great twist, the dish was hearty and familiar with a fantastic gravy. Light on the cheese curds but i feel that was to bring out the taste on the gnocchi its self. Absolutely a dish Im going to attempt at home.  The bathroom was a large negative, as it doesn't even have a door on the mens so you are clearly visible from the hall. I can also see the seating getting busy at night and a bit uncomfortable but hey, thats every trendy restaurant in the area.  Woodlot was an amazing experience and is worth the higher price.  The server even gave us a free loaf of their sourdough bread upon leaving!"}
{"text":"Woodlot is alright. I heard it used to be better but from my visit there really isn't anthing wrong with it.  Food was tasty and service was good. There are some creative cocktails on the menu and the wine selection is alright as well. It is not a cheap place and things do add up quickly. I think if it were a few dollars cheaper it would have gotten 4 stars from me.  I would prefer if the lighting was not so dark, but that's just my preference."}
{"text":"Awesome ambience. Make a reservation or try for the community table. Had a really interesting biodynamic wine from Georgia. The country. Food was fantastic, too!"}
{"text":"Woodlot is a lovely little restaurant in Little Italy area.  I has a vegetarian menu AND meat menu.  Menu is short. All the food we had was very tasty. Excellent pasta flavour but a little too greasy.  Two appetizers for our table -  very tasty but also rich.  Prices a little high, but offering was for small or large portions.  We were fine with small portion and sharing the appetizers. Service was very good, attentive and kind."}
{"text":"This is a very attractive restaurant with a charming outdoor area. A good wine list, tried the \"orange\" wine which was like vinho verde, nice on warm day. Steak was tender, cooked to perfection with tasty side, the pork was good, tasty but a bit too much fat. Service was prompt and pleasant. A very busy local pub is on the corner."}
{"text":"This was a real treat! Incredible bread, Flat Iron Steak, Red Fife Whole Wheat Lasagnette and Georgian wine - all made this place unforgettably. Will be back!"}
{"text":"Very, very cozy atmosphere, especially with the large open stone oven and warm lighting. Nice place for the winter days. The place was a bit hard to find in my opinion and parking was extremely limited; you'll have to make do with street parking. If you don't like communal tables, book in advance. Otherwise risk the chance of either waiting for a table for quite some time, or sharing with others.  Came here for dinner: their breads were fresh and warm, very welcoming start to this place. The woods mushrooms starter was a nice little warm dish and quite fragrant (good vegetarian option). Their flat iron steak, however, was actually a bit dry... quite disappointing, especially considering what they are charging for it. Their gnocchi was okay but not something I would go back for; kind of bland. The seared sea bass was fresh and tender, yet the wow factor was lacking.The reviews raved about their French Onion Soup, which unfortunately when I went they said it wasn't available...  Their dessert menu was pretty good actually. We might have enjoyed this more than the mains. Not sure if their dessert menu changes, but the parfait was plenty on fresh ingredients, enough for 2-3 people. Their pot de crème was very rich and tasty. Definitely a sugar overload there. We also had a macchiato to go with the desserts, which I thought was too strong, considering the other ones I've had elsewhere.  A little pricey for what I would think it's worth but it's a cozy visit once in a long while."}
{"text":"This has been in my drafts for over a year, maybe even two? Thanks to yelp app updates, I can now post it!   I would love to return for dinner and hope it was as good as the last couple visits.  --- Great date night at Woodlot last night. Walked in with no reservations and sat at the bar. Service from bartender was excellent, he took care of us all night dealing with our drink and food orders and the tequila cocktail with maple syrup and rosemary was super tasty.  I've been there a second time with a girlfriend who is vegetarian and food was again very good."}
{"text":"Definitely some highlights but also some disappointments to our first visit.   Start off by saying it is definitely quite pricey for the amount of food. Gf is vegetarian and this place was pretty vegetarian friendly.  Complimentary Sourdough Bread, it was cold. (period). Didn't even finish it. Suggestion... why not keep it warm? Came with whipped butter but still would prefer it warm.  Starter (Ember Grilled Hen-o'-the-Woods Mushrooms) - Wow, these were literally the best mushrooms I've ever had, and i'm not vegetarian - The slight char brought out an aromatic and smokey flavour, which was quite unique - One of the dishes which I would order again  Gf ordered half order of Russet Potato Gnocchi and it was filling enough. She liked it but I thought it was quite plain.  I ordered the (Ling Cod on Celery Root Velouté) but they were out of cod and I believe it was replaced by some fresh caught Mackerel. It was very well cooked, 3 pieces of fish (which was more than I expected), slight crisp on the outside but moist and great texture. A creme-ie soup like sauce with few brussel sprout pieces and some hazlenut chunks. Had great taste and textures.  Service was OK. Atmosphere was really dark, couldn't take pictures.  We went when it was early during services and only had 2 other tables. Still needed a 40 minute wait for food, so I can't imagine the wait when they had full service."}
{"text":"Woodlot has been on our list of 'must trys' for a long time so we were thrilled to get a reservation during the Telus Tuesday promotion.  We were seated on the upper level of the restaurant.  Service was prompt with drink orders taken right away.  They have a few local beers on tap so we each ordered one and an old fashioned cocktail.  For starters, we had the scallops...delicious and done just right.  One of us had the whitefish potato salad which was also good.  For mains, we had an order of the snails on polenta (very good but a tad salty), duck with pork belly (excellent and I would say the standout dish) and the steak, which was a huge disappointment.  It had the consistency of pork and the meat itself was dry and tasteless, despite ordering it medium rare.  I can only compare the steak to the likeness of eating a huge slab of Chinese BBQ pork.  Not that BBQ pork is bad but when you order a steak, you would expect it to taste like beef.  Apparently, it was strip loin cut but we've had better strip loins at breakfast in cheapy diners.  The steak does not come with sides so we ordered the gnocci (good) and turnips (meh).  The highlight of the meal was dessert.  The lemon tart was simply amazing and the warm apple tart with ice cream was also good.  The chocolate pot du creme paled in comparison to the two tart options.  Overall, a great meal for those who didn't order the steak entree.  Not sure how it turned out so horribly wrong.  Great apps and fantastic desserts to end puts Woodlot on our 'maybe' list for a second visit.    Mentioned our comments to our waiter about the steaks so hopefully he will relay the message to the kitchen."}
{"text":"I won't even try to be funny, or clever, or charming.  A meal like this deserves proper respect.   Earlier this Spring, I took the SO to Woodlot to celebrate our anniversary.   It was the single greatest meal I've ever had in Toronto.   Located in a converted garage off the busy College strip, Woodlot is casual and welcoming. A subterranean bar beckons; a communal table frames a glowing wood oven; diners perch overhead and watch the show while devouring their dinners.   Not a white tablecloth or gloved hand in sight. Servers are knowledgeable, firendly and accommodating without trying to upsell--they needn't since, I make clear my intention to buy some of the house bread, Passover be darned.   Dinner began with a selection of bread from that wondrous oven; warm sourdough, wheat and multigrain varieties got the evening's carb count off to a quick start.   To follow, more bread in the appetizers. My date had a trio of squash and goat-cheese crostini. I generally laugh at people who order crostini, or bruschetta, or the like in restaurants. Why pay for toast when you can make it at home? I did not here, because 1) it would be a very bad idea to laugh at your sweetheart on your anniversary, 2) she drove, and we live in the suburbs. and 3) they were delicious; an alchemy of crispy charred bread and silky sweet squash puree, set off by mozzarella that screamed DAIRY!!! and some fruit compote. I admit, it's better than the toast that I make at home.  I had the french onion soup. It was the best french onion soup I've had in the city; bold, beefy broth, thick with caramelized onions and topped with a bistro-correct thin layer of cheese. Next to Balthazar's version in New York, and one or two I've had in Quebec, it was the best I've ever had.   Mains were similarly splendid. My date's vegetarian take on sweet pea ravioli was at once rich with egg pasta and cream and mushroom duxelle, and light with verdant peas and mint. My whey-fed pork chop was, in Homer Simpson's words, \"sacrelicious'; crispy outside and yielding porky pink inside; sided with intense stewed prunes, sop-worthy sauce and-oh yeah-BACON!!!!  This was a meal worthy of an ALL-CAPS, EXCLAIMATION_LADEN REVIEW!!!!  And I haven't gotten to dessert yet. It was bread pudding. With valhrona chocolate whipped cream. And brown butter sauce. The details, like the rest of the evening, are best kept private :)   If I were to quibble, I'd lament how quickly the sourdough loaf I purchased went stale. Then again, the one that I bought my dad disappeared within 24 hours, so maybe great breat isn't built for waiting."}
{"text":"Dined at Woodlot last night, and wow, what a great meal!  The place is as cozy as it comes, wood interior (go figure) with a cottage like feel.  Service was impeccable, fast, kind, efficient and not at all bothersome.   And the food..... mmm. We got the mushroom dish and gnocchi to start. The mushrooms were perfectly done, almost crispy, but delicious. The gnocchi was in a truffle oil and was creamy and scrumptious. For my main I had the pork, served on a wood board and perfectly cooked. Absolutely amazing. My bf had the pickerel. It was on a bed of pureed peas and winter vege, very good.... almost better than the pork. For dessert, a chocolate truffle pot with nuts on top. Not too big, perfect to share.   The cocktails were also great. They make their own tonic, which was actually great in my G&T. My bf got the bourbon cocktail which was also pretty tasty. We had a bottle of wine with dinner that was served in a nice carafe, and the server even took the time to let it breath before serving us.   Thanks for a great meal. I would definitely go back and highly recommend people try it!"}
{"text":"I've always known about Woodlot for quite some time and for some reason, I never found myself in the area or getting reservations here.  Now I'm kicking myself for not coming earlier.  I genuinely love this restaurant for many reasons but the biggest one would be the fact they offer incredible delicious vegetarian dishes that are not just pasta with some veg thrown in.  It has amazing tastes and texture that even my carnivore friends saying they'd eat that easily.    Normally my 5 star places are only reserved for the places that hit all the right notes for taste, atmosphere, and service.  And Woodlot does great in all those but the dishes make it stand out.    So this restaurant is in Little Italy right beside the very busy and crowded Bar Raval.  Woodlot is not very big but in the summer, they have a sizable patio.   It is 'cozy'.  Think of a rich man's cabane a sucre or hunting lodge in the woods and you get the idea.  There is an elevated section which is the dining room.  I would normally call it dim and romantic but the noise level makes it more towards dim & energetic.  The main floor has the large chef table and the open kitchen with it's large wood fired oven.  There is also a lower section for a bar...  not a lot of seats but their drinks menu deserves a visit.  I would easily say a perfect date night spot.   Service here is friendly and really knowledgeable about every menu.  Our server tried everything on the menu so she was so helpful in deciding on what to eat.  I personally believe now that I could have thrown darts at the menu and everything would be amazing.  Before I dive into all the dishes, I do want to comment on the portion sizes.  I've read in other reviews that people are disappointed on the sizes.  I would say that the plates maybe bigger in the past but I didn't think these were really small.  I would say sharing an app and dessert while having an entree left me really happy and full.  For the price points, I think they're very fair and worth the value.  Butternut Squash & Apple salad - I loved this salad.  The sweet crisp bites of the apple, with the tender squash, and crunchy sesame brittle are all great textures and tastes to make vegetables elevated.  I would say that this might be one of those dishes that are a bit light on the size but it is meant to be an appetizer 4.5/5  Roasted Brassica & Pistachio Stuffed Pumpkin - This is my favourite Vegetarian Dish of the Year.  Absolutely. Found on the vegetarian menu, I was happy to see a dish that isnt just pasta.  This was better than I hoped.  You had pumpkin carved up and stuffed with brassica (which seemed to be finely diced cauliflower), plums, oats, and some amazing spices that made me savour every bite.  Then it's all roasted and then topped with a glaze.  This so delicious with the light natural roasted sweetness coming from the pumpkin, the you get a lot of savoury amazing spice into the deep browned buttery glaze.  I hated the idea of sharing it but I ended up giving a third to my carnivore and he loved it too.  If you can change a hungry carnivore to eat a vegetarian dish happily... this is an outstanding dish.  5+/5  Duck Confit - Wow... this was another great dish.  Super tender and flavourful duck that had the crispiest skin I've had in a long time.  It was better than most Peking Ducks Ive had in the past years.  I would say possibly the best Duck Confit in Toronto.  5/5  Fire Roasted Broccoli - Ok so this was an odd dish that we added.  We thought chilli & fire roasted broccoli would be awesome.  This somehow landed on our table and went mostly forgotten.  Part of it was that it is a small dish and flavour wise, it paled compared to everything else.  I would say skip this. 3/5  Pumpkin spiced brulee - I always love brulee.  This one had an interesting twist as it actually had puree'd pumpkin in it and a hit of sea salt on top of the caramelized sugar crust.  Definitely a wonderful creamy end to the meal. 4/5  I figured after a year of dining out a lot in Toronto, I figured out my top 5 favourite places for 2017 and then you had Woodlot just come in.  It easily fits into my list of favourite places in Toronto.  With great service, amazing flavours, and a nice vibrant atmosphere, I can easily see myself come back again and again."}
{"text":"This used to be one of my favourite restaurants but recent changes have pushed it out of my price point. In their early years, they were certainly a splurge experience but it was possible to leave reasonably satiated with a full size pasta order - portion sizes have shrunk considerably since.   Though it's hard to justify paying $40+ and still be hungry, the food here is delicious and comfy. Their sourdough bread is especially lovely when fresh out of the oven. The Hen-of-the-Wood Mushrooms ($15) are also pretty flavourful and the homemade pastas (~$26) are solid choices too."}
{"text":"Went here for a girls Christmas dinner. Service and ambiance were incredible - great date spot and great for small groups.   I was disappointed by the food. Nothing was bad, but nothing was really exceptional and this was a place where I was expecting something special.  We tried a pate creme brulee as an appetizer, which tasted kind of strange and basically seemed like you were eating dessert. It failed the mark. For a main I had a tagliatelle with duck which was tasty but nothing great. My dining companions had a steak and the gnocchi.   We were planning to share dessert but the dessert menu only had two items, and neither of them seemed seasonal. (One of them was pumpkin pie. We were hoping for some Christmas type of desert items)  Overall, still a very nice place just just 3 stars considering the higher price point and just ok food."}
{"text":"Delicious! Took my boyfriend here for his birthday. Food was ambrosia and so was the wine. Highly recommend the entire dessert menu. Service was amazing."}
{"text":"There's a lot to like Woodlot. For starters, the place is warm and inviting. It's rustic, cozy, romantic, and as you walk in you get hit with great aromas from the stone oven. The food is very nice. It's the kind of place I would like to give 5 stars to. However, there were a few miss steps.  House Baked Bread Score: 5/5 WOW! Amazing bread indeed. There were two types of bread, each one super tasty. I will come back just for bakery alone! One minor complaint is that the butter was not very good. What can I say? - I'm a butter snob.  Warm Spiced Fall Harvest Salad Price: $15 Score: 5/5 This is a winning dish. Cauliflower is a modest ingredient, but in this dish it is elevated with a beautiful yogurt-curry dressing.  Ember Grilled Hen-o'-the-Woods Mushrooms  Price: $15 Score: 1/5 This dish was a total flop. There was a very small portion of mushroom sitting on a salad that was very confused in flavour. There was something as crunchy as nut shells in the salad.  Wood Fired Spiced Aubergine and Mozzarella Empanadas  Price: $15 Score: 2/5 The two empanadas were very small (two bits each.) They were very bland. You could barely taste the aubergine, and there was absolutely no wood fire flavour.  Crisp Seared Rainbow Trout  Price: $28 Score: 4/5 Very tasty fish beautifully charred on the outside, albeit somewhat overcooked. It was served with some barley balls wrapped in kale that were good, but not very flavourful.  Dry aged Chuck Rib steak Price: $33 Score: 4/5  Very flavourful steak with nice charring on the inside. It wasn't the best cut of meat, but it was nicely prepared.  Warm Kale Salad (side) Price: 7 Score: 2/5 This salad was way too sweet.  The wine offering was limited, with emphasis on expensive bottles. We opted for the half bottle of a \"house\" red that was pretty nice.   The service wasn't good. The server seemed unfriendly and plain disinterested in being there."}
{"text":"Short, sweet and to the point -- Woodlot has it all, from great cocktails, a lovely vegetarian AND meat-friendly menu, amazing service, and a warm, inviting atmosphere.   Haloumi crostini was amazing. Get it. Vegetarian gnocchi with morels was the most comforting dish, with light, pillowy gnocchi, meaty mushrooms, and nutty pumpkin seeds offering textural contrast. Smoked chocolate cheesecake was rich and luscious, the perfect way to end a lovely meal. Service was fantastic from start to finish, and the Super Duggans cocktail (a mixture of beer, campari and lemon) was excellent and perfectly refreshing on a warm summer day.   A little bit on the pricer end, and reservations are recommended, but definitely worth a visit every now and then."}
{"text":"I had been wanting to go to Woodlot for some time and was so disappointed when I finally tried it. I made a reservation three weeks in advance to get a 8:15 pm table;  that's how hard it is to get a spot.  This place is on the pricey side, and I went for a special occasion. I have no problem waiting or splurging on a restaurant that is worth it, but this place is not.   The restaurant is very cozy, I love the interior. Our waiter was very attentive and informative, and suggested a great wine that we all loved (we had two bottles of it). The food however is where this place misses the mark.     We shared oysters to start, they were fresh, no complaints here.  The bread was ok, but nothing noteworthy considering this place is a bakery.  For mains two of us had the pickerel, one had the pork and I had the crispy cauliflower risotto. All of the mains are $24- $28 and they do not come with sides so we ordered two that were $7 each.  The pork was good and fairly juicy, but not to die for.  The pickerel was bland and drenched in an overwhelmingly creamy sauce that also had no flavour. The vegetarian risotto should not be called a risotto.  It's more like a rice ball/pancake and it was incredibly dry and flavourless.  We skipped on dessert.  This place is trendy with a nice ambiance so I think people give into the hype.  The food is really nothing to rave about.  I won't be back and I wouldn't recommend this place."}
{"text":"Ok. ive waited nearly 2 months to come to this place that so many yelpers have been raving about. Now has raved about it. Toronto Life has raved about it. Clearly  the whole lot of you are either very hungry, dont eat very well or are just too luxurious for your ratings as this was neither a 5 nor a 4 star. Yes the space is really cool, and yes the bread they served was delicious. Was the food oustanding? No. Was it creative? kinda, but not really, creative means it tastes amazing, and it didnt. I had the crab salad, which was pretty good but not really anything that special. The duck rolls were absolutely flavorless, and my friends haddock was pretty good but the addition of a butter sauce was overkill and at the end of the day, it was haddock, not seabass, not grouper, not halibut, haddock. The dessert with the marshmallow was pretty awesome but overly sweet. They were out of ketel one and sold me on some stupid Toronto vodka (listen, Toronto is a vodka destination like it is a ski destination, sure we can make it just like we can put snow on a garbage mound and call it a ski hill, but its really neither , ever. )  Do not make reservations here a month in advance as you will be disappointed. Thankfully i didnt, just walked in and got someone elses table, but thank god I did as had I waited that long to eat here id have been sorely pissed."}
{"text":"Telus Special Restaurant #1  I am glad I can take advantage of the Telus April Specials that offers at Woodlot, where one can order a main and get free appetizer and dessert.  Woodlot does utilized the space really well.. downstairs with the open kitchen has this buzzing and energetic vibes, while it is cozy up in the loft! And with the dim lighting, even your date looks so much more sexier...   Grilled Scallops ($14)  - it was really fresh and have this nice olive oil vinaigrette sauce to round it off...   Grilled Haddock served on couscous($21)  - The fish was pan fried to be crispy outside and the fish was fresh and flaky.. but I think I will try another dish next time..it is good but did not WOW me!  French Onion Soup Veggie Style ($8)  - it is really flavoured.. surprising since it is not made with beef broth... and a taste of sweetness... (you sure it is vegetarian??)   Soma Chocolate pudding ($8)  - love those crunchy toppings... with rich tasting chocolate and a touch of orange puree..  - scrap scrap the jar, lick lick the spoon, smile smile that smile (oh I think I am embarrassing myself in public!!)   Apple Tatin ($8)  - I usually loves apples.. but this not doing anything for me!!  - the apple has this funny texture.. soggy..tasted bitter... and it does not even go well with the gelato...   Great value because of the Telus specials...The food were all nicely prepared, with complex flavour... I would come if Woodlot have special offers again...   I have to say, Woodlot is great to dine with vegetarians...that separate menu is just awesome.. made life easy for everyone!"}
{"text":"I don't get what the big deal is. I'd been wanting to go to Woodlot since it opened, but for some reason or another, never got around to it. Finally I decided to make a reservation three weeks in advance and to stick to the commitment. I wasn't terribly impressed.  Even with a reservation, we had to wait 20-30 minutes for our table at the bar. The staff were extremely apologetic and it seemed as if everyone from the bartender to the dishwasher knew they were running behind on seating us. I was expecting the staff to be too-cool-for-school, but they were all extremely friendly and efficient...a combination rarely seen at these types of places in Toronto. (Note to Toronto restauranteurs: Most of your food isn't good enough to forgive bad service. A three-day \"stage\" at Noma or Per Se does not an excellent chef make.)  On to the food. I didn't really care about the initial wait - the bar area was cozy and the staff were attentive, so I'm not holding that against Woodlot. We ordered the agnolotti with braised rabbit and onion soup to start, and the tourtiere and pork chop as our mains, with a side of brussel sprouts. The agnolotti were properly cooked al dente but were barely warm, and needed something (basil? black pepper?) to offset the savoriness of the rabbit. On the other hand, onion soup was excellent...but I've had a lot of good onion soup.  Neither the tourtiere nor the pork chop were particularly memorable, though we both enjoyed the latter more, even though it was slightly dry/overcooked in parts. Brussel sprouts looked fantastic, but they were a little undercooked for my liking and I could barely taste the cheese (despite being bathed in it).  Wine selections are interesting and reasonably priced.  Overall: Cozy space; friendly, unpretentious service; average food."}
{"text":"\"Woodlot had two distinct menus: one for meat lovers and one for vegetarians. Most dishes were prepared in the wood-fired oven with local ingredients that were cooked to mouth-watering perfection.  The server was knowledgeable with emotional intelligence to match. She was a skilled mind-reader, knowing when we needed a refill on our wine and when we just needed a little more time to gab. She recommended I start with one of Woodlot's signature dishes, Ember Grilled Hen-o'-the-Woods Mushrooms ($15). Delicate, but meaty mushrooms were combined with slightly crispy wild rice, black walnut, beet root and dill. The beet offered a sweet balance to the earthy mushrooms, and the dill added a slightly bitter undertone. Presentation was like nothing I've seen in recent memory--it was intricately plated and I savoured every last bite! Woodlot transformed this mushroom of the moment into a staple dish that will stand the test of time...\""}
{"text":"Came back with my girlfriend over the holidays and wasn't disappointed... again! Had the sea bass for my main, and it was outstanding. I would honestly rate Woodlot as one of the best in Toronto for quality vs. price."}
{"text":"Outstanding food and incredible service.   The food: great, innovative flavors; complex but well balanced; better than many trendy meals I've had at twice the price or more.   The service: best I've ever had; genuinely friendly and responsive without being overbearing; went above and beyond when there was an issue with one order - my daughter cannot eat cheese and she special ordered a main without cheese. The kitchen forgot to withhold the cheese, but our server caught the mistake before bringing the dish to the table and had the kitchen make another. So, our daughter got her meal 5 minutes after we did, which is a minor inconvenience compared to the miserable day she would have had. Her meal was comped, as well as dessert, all without asking. That was very nice and more than adequate compensation for the minor inconvenience, but what really impressed was the server taking responsibility for delivering a wonderful dining experience - that kind of attention and simple follow through are harder and harder to come by.    Note, meals are prepared from scratch when ordered, so be prepared to spend a couple hours on your meal, but really, that is as it should be - with good food, drink and conversation consumed at a leisurely pace, that is what fine dining is all about.  Highly recommended"}
{"text":"I finally got to sit down at the Woodlot. I tried on several occasions to just stroll in and eat but failed every time. (Me! Vivek! I know, right?) Now normally, I would say Eff this Ess and throw my hands in the air like a princess and possibly even leave a flaming surprise on their front steps, but I didn't. I just heard too many good things and was determined to sup here. I made a reservation.  Even on a Tuesday night, the Woodlot was bumping. We rolled in at 21:00 for a 21:15 reservation and by some luck we were seated right away. As we walked upstairs I took in the glorious decor. It's simultanously open concept and split level, with high ceilings, a bar and communal dining table on the main floor, and a proper dining room (that seats about 30) on the mezzanine. The dining room was delicately lit, decorated with native art and had the perfect rumbling for a date. I believe this sound level is most accurately measured in Sexy Decibels (SdBs).  Right off the bat we were offered the choice of vegetarian or normal (you heard veg-heads, bring it) menus. Beatrice Y nails it when she says that vegetarians can legitimately dine here without the indignity of having to work around standard meat-filled options. Some of the options on vegetarian menu were downright tempting, but I knew exactly what I wanted.   The ox tongue terrine with fig jam was a brilliant start. Not too salty, very tender and pretty enjoyable spread onto their house-baked bread. We eagerly moved on to our mains. My DC ordered a wild boar papardelle and I manned up to the chicken and ham hock pie. Both were motherflipping incredible. I have been comparing every papardelle I have had since to the Woodlot's version with its tender noodles and slathered in that delicious boar ragu. And the chicken and ham hock pie (besides being fun to say; try it) was incredimous. It just had this palpable homemade quality that is hard to describe. It was good trust me.  If there was a low-point in my evening it's that my sazerac wasn't perfect, but seeing that typed out makes me feel like a douchebag. Simply put: the Woodlot is a fantastic choice for an intimate dinner, prepared with excellence and without pretension. I like it.  Obligatory Title Pun: I'm getting a LOT of WOOD just thinking about it.  Menu Readability: Even the paper feels house-made. Courier. Smart.  Need to mention: Make reservations.  What this place teaches me about myself: I'm clearly in the mood for a vegetarian fistfight. I'm sure I will lose."}
{"text":"Easily my favourite \"fancy\" restaurant in the city. As a vegetarian, the love affair starts with the fact that Woodlot offers a full \"veggie lovers\" menu as a default to compliment the \"meat lovers\" menu (which itself includes a number of veggie options). No calling ahead to ask for veg options. No asking for the separate menu when you sit down. No asking the server to point out the few veg options on the menu. With thirteen years as a veggiesaurus under my belt, I can tell you this is a rare treat.   Next up is that the food is just so dang good. There a few staple items on the menu (e.g. the hen of the woods mushrooms are a must even if you think you don't love mushrooms), with variations on a theme for others (e.g. various stuffings in pastries, various types of scratch made pasta), and a few more new items popping up from time to time. The thing that never changes is quality. I have been here three times over three years and every time I am very happy with everything I've ordered.   I suggest giving yourself full run of the menu. Even with just one dining companion this is possible. Most recently my partner and I shared the mushrooms, a salad, a large pasta, a main, and a dessert, and found this to be a perfect amount of food. Plus bread. They give great bread here.   The cocktail list here is enticing, what with its Game of Thrones themed drinks. And they are great. However I suggest digging into the wine list. Woodlot offers a wide variety of natural wines from Canadian and international wineries that you can't generally get in the LCBO. If they have anything from Pearl Morrissette while you're there, get it. This Ontario winery has never steered me wrong. I had the Chardonnay recently and ohhhhh man I am still fantasizing, and honestly I don't normally love Chardonnay.   For a couple courses and a few drinks its easy to spend around $100+ a pop here but its totally worth it for a special occasion. Or a Tuesday, if you're feeling flush ;)   P.s. a special shout out to Melody, our server a couple weeks ago. You're sassy and I like it. Never change."}
{"text":"Not only is woodlot overpriced but the portions were small, the service was incredibly slow, and even with a reservation we had to wait 10 minutes to be seated. The food was good, but not infrediblyn exciting."}
{"text":"Woodlot is in the old Octapus Lounge and once you get over the fact that you used to dance all night there,  you realize they've really cozied up the place.  Lots of wood, dim light and great ambiance.  We were seated at the communal table on the main level (since we were walk ins - the upstairs seemed more happening, but it was a good vibe all around). Service was very prompt and attentive, (I couldn't tell if plaid shirts and beards were the uniform or just coincidence) wine list was fairly big and as everyone mentions, there are 2 menus, 1 with meat and 1 vegetarian.    We decided to try 1 from each, we got the pork and a root vegetable pot pie.  We had the wood burning oven right behind us so we got to see everything going out and it seemed that their pot pies were definitely a favourite, and the smell - it made you salivate!  The pork was incredible, perfectly cooked and so tender.  The pie, was...good...but didn't blow me away.  The crust must've been 90% butter because it was so tasty and flaky, but the root veggies seemed to lack a depth in flavour.  It had a mild curry taste but i would give it a 6. We shared the mini dessert tray, which included 2 of each of an almond flavoured macaroon (neither of our favourite), a lemon loaf type thing (I liked this but again not blown away) and chocolate mousse square (deliciously rich - be glad it's a small piece). All in all a great restaurant, I'd definitely go back and try some of the other dishes."}
{"text":"The hype has made it difficult to not be slightly disappointed, so my advice when dining at Woodlot is to lower your expectations (or just not pay attention to the hype) and then be pleasantly surprised.  Our table was upstairs in the dining room, which others have described as unpretentious but which I found stuffy and uncomfortable. It looked a lot like an Italian restaurant that was trying for \"minimalist\" but missed the mark. In fact, much of Woodlot's decor and food seems to have overshot on what it means to be \"rustic\" and \"unpretentious\" - both the space and the food occasionally go too far, and become just sort of spartan and joyless.  I felt jealous of the people downstairs when I'd head to the bathroom. Sitting at the long, shared baker's table near the kitchen or sitting at the bar may not sound romantic, but it looked more fun and friendly than the staid dining room, which made me feel like I was on an awkward first date.  I love the fact that Woodlot has a solid, standalone vegetarian menu. The service was also very attentive and friendly, and our food arrived quickly. The food was good - and some bits of it were very good - but it certainly wasn't perfect, delicious, or even particularly memorable.  The French onion soup was fine. It did what a French onion soup was supposed to do. My duck and pork belly was certainly \"rustic\", by which I mean \"kind of ugly and mysteriously greyish.\" I understand that Woodlot is trying to get away from all the rectangular plates, sugar-dusting, squiggles of sauce, and foam reductions that have turned so much of modern dining into a misery, but simplicity demands perfection - or at least slightly more effort than was evinced by my experience. My duck was bland, and the (nicely seasoned) beans - on which the duck and pork belly were served - were overcooked. The pork belly was delicious and perfectly cooked, but the tiny, stingy portion of it was stupid. It floated around on this huge sea of beans and was dwarfed by the duck leg - half the size of a credit card.  My friend ordered the trout, which was tasteless, watery, and served on a plate of vegetables that also tasted pretty much of nothing. We ordered a side of gnocchi that would've been lovely had their delicate seasoning not been spoiled by greasiness. They were also just kind of thrown into a bowl, and looked limp and soggy.  We were pretty full and opted to split a dessert. The lemon tart topped with blueberry and marshmallow tasted excellent, although we had to hack through the crust like woodsmen (so rustic). The lemon tart arrived, lonely and naked, sliding around on a white plate. Again, I get the whole \"rustic simplicity\" schtick, but it loses its charm when the food you're eating looks like the leftovers you'd eat at home. This style of \"comfort food, done expertly\" is meant to make you feel warm and cosy while reconsidering old classics, but either Woodlot hasn't quite got its ethos together yet, or we happened to be there on a particularly mediocre menu night.  Overall, Woodlot isn't bad, but it couldn't live up to the hype for me. I had a choice between Woodlot and Splendido that particular night, and now wish I'd gone with Splendido.  I wouldn't make reservations again, although I'd tag along if someone else did and they needed a dinner date. I wouldn't mind giving some of Woodlot's other menu offerings a try, but, given that there are so many other restaurants to choose from, I doubt that I'll have the time or the proclivity to return."}
{"text":"The good is great but the service is non-existent. I've never felt more unwelcome or more of an annoyance to simply order a second drink or ask questions about the food. I've been three times and each time was the same. Horrible, horrible service."}
{"text":"Wowza.  Is there such thing as a 6 star rating called \"I've died and gone to food heaven\"?  Because this is it.  Hands down the best restaurant in Toronto.    I like how they have divided up the carnivore and vegetarian options into two menus - it makes things really easy.    I went here with a bunch of coworkers and ordered only the vegetarian dishes (we had a couple veggie and vegan people in the group) and was not disappointed in any way.  The chef, whose name I think was David, was also super accommodating to the vegan in our group and changed up the dishes specifically for him.  Super considerate!  And this was not to the detriment to anyone else in the group, as it usually is - everything was super delicious.    Usage of some really fresh ingredients and excellent flavours.  We had the cabbage rolls (great!), potato gnocchi (perfect), mushroom tart (crust was out of this world), chanterelle lasagna (is there such word as yumtastic?  There is now.), root vegetables (carrots, turnips, etc. doused in butter... you can't really go wrong.), sides of fingerling potatoes and brussels sprouts (these were not too exciting, but then again they were sides.).   Accompanied by a glass of the Syrah and finished off with the super fresh apple tatin.  A perfect meal!!       We sat at the big table to the left of the kitchen, and the layout of the restaurant is such that you're pretty much sitting in the kitchen.  Which is kind of cool, because you can see what is going on and also ogle the merchandise coming out of the wood burning stove.  This is a bit dangerous because everything coming out of the oven looks yummy and you end up ordering it all.    The chef was also super nice and kept popping by to explain things to us - super friendly and he even popped by with a plate of SOMA chocolate chunks for us to eat.  The staff here are all very young, which is unusual in restaurants, but all were well versed and trendy but without being pretentious in the slightest (as you might see at restaurants like Terroni.).  Also, a tremendous sense of pride in the work they do, which I find extremely important!  Prices are not too bad - I think the most expensive entree I saw was $30.  I'm curious to try the cocktails next time I'm here (a cider and vodka drink looked interesting on the menu!)  I would come here again in a heartbeat, but good luck getting reservations.  YUM!"}
{"text":"My girlfriend and I came here for her birthday recently and were both quite impressed. After I had read some reviews of how bad the waiters attitudes were, I took notice to how we were going to be treated.   We were seated promptly in what we thought was the best spot in the house. Our reservation was made weeks in advance and it payed off. A half bottle of Rose wine was ordered and we were off to a wonderful start.   We had at least 5 questions about what certain words meant on the menu and our waitress answered them all in lamens terms. No attitude at all, in fact it was the complete opposite. The two of us settled on scallops that were like butter, which was paired with quinoa, grapefruit and pureed avocado. Delightful!  Next we ordered our mains with a side. I ordered the sweetbreads and my girlfriend did the temph version of my meal. The side was a root vegetable of some sort that was some exciting new flavour we've never had before. Don't ask me what it was exactly, it just tasted great. Half way through our meal, we ended up ordering another half bottle of wine, in which our waitress ended up charging us for a full bottle (cheaper than 2 halfs) which was a treat.  In a brief summary, everything was fantastic. Our meal (bottle of wine, app, side and 2 mains) came out to be 121 which is great for a higher end place. I recommend going here for special occasions! Make a reservation!"}
{"text":"I've been dying to go to Woodlot for a long while, but it never works out, perhaps because it's ridiculously difficult to get a reservation there on short notice. Generally, you leave them a voice mail and hope that they call you back with your desired availabilities. The interior exuded a rustic, communal vibe that felt very welcoming. We sat at the upstairs dining area which overlooked the entire open kitchen, as well as their famous wood-burning oven. There was also a roof window which allowed plenty of sunlight to brighten up the space.   I wasn't feeling for anything alcoholic that day, so my boyfriend and I each ordered a house-made soda ($3 each). He chose the cherry flavour, and I went with the white soda, which was an elevated version of a Sprite. The sodas were very delicious and refreshing, and they're a great alternative to cocktails.   The rest of our party was more than half an hour late for our 6 pm reservation, but thankfully, the staff was very gracious about it. I've previously had some bad experience with another restaurant's staff giving me attitude when I was 20 minutes late for a reservation, so I really appreciated the staff's understanding here. Once everyone placed their orders, we were given a basket of Woodlot's sourdough bread. I'm a huge fan of sourdough bread, especially served warm with butter!  Now onto the food!  Baked caramelized onion soup ($11) with aged gruyère and red fife sourdough bread. This onion soup certainly wasn't lacking in onions! There were heaps and heaps of sweet caramelized onions with every spoonful of soup! I also liked that the soup wasn't overly laden with cheese, which made it less heavy. Of course, French onion soups are extremely rich in nature, so sharing is highly recommended!  Two of my friends shared ember grilled hen-o'-the-woods mushrooms ($13) with wild rice, black walnut, mache and balsamic vinegar. The portion looked rather small, but I was told that it was actually quite filling. I didn't try any but heard good feedback about this starter.   Whey-fed pork chop ($28) with prune, bacon, brown bread and walnut sauce. This was an outstanding dish, both in flavours and presentation. I sampled one piece of pork chop and it blew my mind off. I hardly ever order pork chop at a restaurant (unless it's deep fried) because it's often dry and bland. But Woodlot's pork chop was moist, flavourful, and just truly delicious. I'll definitely be coming back soon to order this for myself.   Russet potato gnocchi ($23) with roasted aubergine, graine de paradis, chili, lemon and ricotta salata.  I really enjoyed the piece that I tried. The texture was perfect, and the flavours were bold and bright.  Naturally raised flat iron steak ($29) with mixed mushroom and béarnaise sauce. It was another stunning presentation on a wooden plank. I also thought that the steak was very tasty, and the béarnaise sauce was a lovely complement to both the meat and earthy mushrooms  Chicken and porcini mushroom pie ($27) with sherry cream, sunchoke, parsnip and parsley root.. The pastry was tasty and flaky, but the fillings didn't wow me. I actually liked the parsnips a lot, so I thought that there was too much chicken and not enough veggies, especially mushroom. Perhaps I'm not a big fan of chicken pot pies in general, but I preferred all the other entrées over mine.  Spiced bread pudding ($11) with chocolate chantilly, candied pecan and brown butter. At first, I mistook the chocolate chantilly for ice cream, and I think ice cream would've been a better pairing here. The chantilly was too rich on top of the dense bread pudding. In all honesty, the dessert was quite similar to a chocolate muffin. It was a bit of a let down after the fabulous entrées.  I feel a deep need to come back to Woodlot as soon as possible because I truly loved everything except my own entrée and the dessert. All in all, the food and service were fantastic, and the restaurant definitely lived up to my expectations!"}
{"text":"Food - good!  I think people can tell a lot about how seriously restaurants take their food by the quality of their GNOCCHI.  Thank goodness their potato dumplings were fresh-tasting, soft, mmm...   I've had gnocchi elsewhere and was quite disappointed in how hard they were, or the odd aftertaste they'd have.  Especially in a restaurant that would be Italian, to boot.  Yay: -veg menu laid out on the table, in addition to the reg. omnivorous one, and the liquor menu (mostly of wines; not so much for beers); -fresh-tasting food.  Seems that you can't really go wrong with any choice - everything is a foodie-friendly entree; -you could have the option of a larger or smaller portion of certain food items.  Say it isn't so: -portions of some items were very \"modest\".  My friend's salad arrived, and my first thought was how the portion was so small that I could eat it through my nostrils...  Well, not literally, but that's how I felt.  Plus the price was larger than the portion, at $14.  The taste, was consistently good, as with everything else there.  I wasn't overly hungry, but the portions of their salads could do with some good increase; (The size of the onion soup was just fine however.  I ordered it as an appetizer, and it was quite savoury); -service was o.k.  The host didn't smile very much.  Made me think of the outstanding service that we received from \"By the Way Cafe\" on Bloor - they're energetic, they smile, and definitely earn their tip.  I'd enjoy going again at some point.  The meal was on the pricey side - averaging $35 per person plus tip, in the end.  Still, sometimes you pay a lot and the quality is lacking... so that ends up as a waste of money.  Here, you're generally paying more for food but can be reassured that your taste buds will enjoy the trip.  If you're driving there, consider street parking.  I was there for dinner, parked by 5:30 pm.  After that, M-F, 6 pm-12 am, it's free to park on the streets - just mind the signs."}
{"text":"I've been here twice already and both times I was thoroughly impressed. The place is still new, so menu changes are bound happen. The first time I came here, they have been open for only two weeks - I had the crispy roasted porchetta, which I don't think they have anymore. It was quite crispy on the outside and really juicy on the inside. Too bad it's gone now. The 2nd time I came with a group of friends. Our orders were taking a bit longer than usual so the chef sent us up a free app of the whitefish potato salad. It wasn't breathe-taking amazing, but it was quite good and I'd order it again next time. For my main dish I ordered the whole wheat parpadelle w/ wild boar ragu. I highly recommend this dish. So homey, so comforting, it's like a big warm hug on a bad day. The rest of the table had the venison pie, and the duck cabbage rolls. The venison pie was as good as everyone's been claiming it to be. Can't really comment on the rolls as I'm not a fan of duck. It was also my friends birthday that night, I had told the waitress and as soon as we were done our meals, next thing we know it the whole kitchen (yes, the chefs and cooks!) were singing happy birthday to her. I think that's great. For such an extremely busy kitchen, they take the time to greet their customers personally. Tip well folks, these guys know what they are doing and they fully deserve it.    Can't wait for my next meal here!"}
{"text":"How much wood can a woodchuck chuck if a woodchuck could chuck wood? Well shiz. What didn't we order?  We started with oysters and sparkling wine. Some at the table started with their dark beer, campari and lemon twist cocktail. This sounds disgusting. It was actually quite good if you're a Bitter Betty.   Then there were some whiskey and in-house root beer shots. They were totally tasty and unnecessary. We then got a whole whack of food. The gnocchi, steak and pork chops were all practically flawless. The tortiere was delicious, but we were all bummed it didn't come in one of the copper pots like the photos had suggested. Who doesn't love eating out of a pot?   In the end, I think we were all too full to think and quite drunk. Which made the extraordinarily high bill manageable. But the next morning when I looked at the receipt my jaw dropped a bit. A lot. I had to pick it up off the floor.   PEPPER POINTS to our rad server, though she could likely calculate percentages, thus knew to be nice to us."}
