{"text":"Safe bet for a cheap buffet .  Nothing blew me away but the price is right.  Nice service and cool fish tank."}
{"text":"Chinese food is always a good idea. Very clean and great food. Amazing variety. Diverse customers, so must be approved by all."}
{"text":"The food was ok. My wife went into the restroom and witnessed one of the employees pooping on the floor. Will not be going back!"}
{"text":"This is the easiest place to go for lunch or dinner. The food is always good, we have been going here for 2 years. The servers are very attentive and always smiling."}
{"text":"Went here on a Saturday evening with some friends and I won't be going back. Basically, you get what you pay for. It's a cheap buffet with cheap food. 

The seafood is overcooked. 
Don't even think about getting the sushi. I tried one piece and could immediately tell that it was very bad quality fish. 
The fried food is over-breaded.
The food with sauces (like the orange chicken) is drenched with sauce. 
The vegetables are over-steamed. 

They do have Mongolian BBQ which I liked because I got to control how much vegetables/meat/noodles/sauce went into the dish. However, the meat is not good quality and the sauce is diluted so use plenty of both.

The only reason I'm giving them 2 stars instead of 1 star is because the service was top notch and very friendly."}
{"text":"Just ate there this evening.....lots of food choices, good taste, but the service was just okay. Friendly but took more care of regular customers than new ones....place was small as compared to other buffet restaurants but not their fault.....otherwise, left full and satisfied!"}
{"text":"Great price great variety.. Can't beat $7.99 for a lunch buffet.. The mongolian grill is the cherry on top, however a few more added spices and ingredients to the existing lineup would be a plus.. Some of the entrées aren't the greatest tasting but others make up for it.. There is definitely something for everybody and the staff is fast and friendly.. They get 4 stars from me, and I will definitely be back.."}
{"text":"World Buffet is great!! Fresh food, huge selection and good customer service.  Try it yourself. I rate it the best buffet on the West side of Madison!"}
{"text":"I have eaten here regularly, taken family and friends, and every time I've been satisfied. Sometimes their busy, sometimes it's quiet. The food is usually very good and fresh and the price is very good for the amount and selection of food they offer. Service is usually good, sometimes you can get someone new but most of the time they are very attentive and nice.

My biggest problem has always been with some of the customers, there is always a jerk who wants something for nothing. Or a lack of discipline parent with a screaming child. Not always, but you know who I'm talking about, reminds me of some of the reviewers here. 

I'll still go back."}
{"text":"Best buffet ever delicious crawfish great staff good clean food came here two days in a row!!!!"}
{"text":"I dont know whats up with 5 star reviews, i feel very lucky to be alive after eating that slop. holding temps. for the food no even close. Everthing had a sour off taste to it. If this place lasts till end of year i;d be surprized. Hopefully the customers won;t go first !!!!!!!!!"}
{"text":"Great service and clean place,  as for the food it was around the typical chinese food buffet style, they did offer a mongolian and sushi section.
They had quite a few isles with a variety of different items, some you don't find at a  regular Chinese buffet."}
{"text":"Lots of food but all inedible.  Everything was overcooked or undercooked.  We both tried fatty chewy chicken on a stick, unflavored low mein, greasy spring rolls, hard as rock pot stickers and broccoli with beef having to spit it out in a napkin.  We tried one bite of everything there and none of it we would go back for. There was tons of crab because no one was eating it......  Don't you guys try your food before putting it out?  The heavier waitress was running around the buffet grabbing sushi with her hands and eating it on the floor around people.  Horrible experience."}
{"text":"very.cheap. very nice noodle soup. vey good overall. i like the noodle best. my roonate said she is so happy. my another rommate said she really likes red bean baozi but i think it is jusk ok. i eat all my noodle and i feel so full now. i laugh all the time because i am so happy"}
{"text":"let me start by saying that i am a fan of chinese buffets and always lookign for new ones to try. i will also admit that i never expect the quality of any given dish to be the same as in a regular restaurant. the dishes have to be prepared a bit more bland since the same dish is being made for many people. if it's not spicy enough, they always have chili peppers/sauce that you can add. also, the food does sit for a while before you eat it, unless a fresh serving was just brought out. now, since i got all that out of the way...this is, so far, my favorite chinese buffet. very friendly, quick service. our plates have always been removed quickly and our drinks refilled right away. there is always a good selection of sushi, and for a buffet it is quite good. fairly basic, nothing special compared to going into a higher class chinese or japanese restaurant, but again, in those restaurants you can pay as much or more for sushi as you would pay for this entire buffet, so don't have unreasonable expectations. some of my favorites here: the hot and sour soup, dim sum, crab rangoon that rates as the best i've had anywhere, generals chicken that actually has a little bit of heat, and the rice noodles. even though sometimes the food isn't completely hot, i have never had anything that seemed stale or like it had been sitting around. i also enjoy the variety of fruit and 4 different kinds of ice cream that you can scoop yourself. and a sign asking you to eat what you take in no way reflects on the quality. it reflects on the rudeness and stupidity of too many customers. i have seen, not here but at other buffets, people pile up huge amounts of food onto a plate, pick at a few things, put the plate on the end of the table then go up and do it all over again. if you aren't sure of the quality or the flavor, take a little bit, check it out first. if you like it, take more. adults should know this! and the bathrooms are fine, the cleanest of any chinese restaurant i have seen. there is a sign asking you not to flush papers like another reviewer pointed out, but i am not sure if that refers to toilet paper; people will try to flush all kinds of things and end up causing serious plumbing issues. every time i have been there the bathrooms have been clean, so don't let silly rantings scare you away from this place. to sum it up, good service, good food, fair prices! great, i want to go there right now!"}
{"text":"A buddy of mine told me to skip this place, but I figured I would give it a try. The experience was nice in the sense that the wait staff clears your plates fairly quickly, as well as re-fills your drinks. However, the food was not fresh. Given that a good portion of it was seafood, it was a let down. 

Also, the variety of food isn't so great as to consider it a \"World Buffet.\" This place is a scaled down version of a typical Chines buffet. While most places are semi-decent in providing you with a large variety of food, this place is lacking. 

All-in-all: The customer service is good and the place provides a nice quiet dining experience, but the lack of fresh seafood made it a waste of a trip. I was stuck getting the same food repeatedly until I was full. I would advise skipping this place and going to Panda Express for a better variety and freshness (which is saying something)."}
{"text":"They charged us $33 for two adults and 1 two year old. Had two hot teas which was certainly not worth $2.50 each! Typical Chinese buffet nothing special fresher when they just open and goes downhill from there. Super pricey for what you get! My toddler did love the koi pond."}
{"text":"not the tastiest food - seems like an enormous number of dishes include fake crab (and almost all the sushi).  if you enjoy fake crab, this might be the place for you.  also - they discriminate against single diners; will not split their coupon $$ in half like other restaurants do.  can't recommend either location, though broadway is not so heavy on fake crab.."}
{"text":"Thought we would try this place out. 2-9-13.At 4pm
It's one that you can say been there no thanks not going back.
For 2 adults and 1 child that is 6 yrs, it cost $40.21.
The food is good, the place is very clean, the gals serving soda's was very nice.
Are favorite place we use to go closed up, and at it for what we had we would only pay 26 dollars.
So in all this place is to HIGH PRICED. 
Wont be going back."}
{"text":"I think once you figure out what you really like here you are all into it. To be honest, I never thought I would have liked it the way I do. It has some features I find appealing and it makes me come back all the time.

You don't need to wait at the table for something that who knows you might like or not. I love I can go and choose what I really like by myself. Staff is always friendly. They have a wonderful variety of SUSHI people! Do you know how much you would spend in 3-4 sushi rolls in another restaurant? BIG bucks! besides, they keep making the rolls fresh right before your eyes and you can eat as much as you like, WOW, for me, that's a ginormous reason to come back.

Some of the things I recommend are, besides the sushi of course,  the seafood delight (crab meat, shrimp, broccoli, carrots in a white tasty sauce) fried rice, the green beans, crab meat salad (creamy and kind of sweet) and my favorite desserts, the sesame balls with a red bean filling (believe me, I almost cry when I don't see them in the tray, they are sooo good) and the chocolate ice cream, they both make a sparkling combination and for me it's the best part! ;)"}
{"text":"This is absolutely thee worst place to eat at. Sure there's a variety of food but most if it is either undercooked,  burned,  or no flavor. The steaks here are so dry and rubbery. So gross. If you do come here the only thing I suggest is their catfish cause its very tasty and juicy ."}
{"text":"I finally got around to trying World Buffet after driving past it repeatedly, and on the whole I think driving past it was the wiser choice. The food was unimpressive, yet it was surprisingly busy. The service was quick and polite, but it wasn't enough to make up for the generic feel of what was on the plate."}
{"text":"I went after my coworkers recommended it as the best Chinese food in town. Maybe people in Madison don't know what good Chinese food is like... Cause this was pretty bad. The variety wasn't impressive. No real fried rice, really? The food was greasy and didn't even have good flavor. Very unsatisfactory. I got take-out and the price wasn't bad. But it made me miss the good Chinese restaurants on the east coast."}
{"text":"The food is worse than it was a year ago. It is edible but nothing is delicious. 


The membership card is a lie. I forgot the and the owner said I could bring it and ask for a stamp the next time. I come here again but a waitress says NO!"}
{"text":"Nothing special, but a little better than the \"average Chinese buffet.\"  I didn't get any water or drinks when I arrived, but that's not too big of a deal to me.  Overall the experience met my expectations and I would return in the future.

Pros: They have all-you-can pho, clean, plates cleared quickly, attentive/friendly staff,

Cons: Slow to replenish food, some food looked like they sat out way to long, charged for soda refills"}
{"text":"This buffet is pretty small. The workers are really nice. Theres only a little variety of food options. Theres mostly Sea Food. The chow mein was cold the last time i went.To be honest my favorite dish is the Butterfly Shrimp. I also like that they have the soft serve Icecream machine. This buffet is not the best, but its alright."}
{"text":"Worst place ever! Don't waste your time coming here. No food nor fresh food! They care more about saving money than making new fresh food for customers who comes here to eat late!! They also don't accept coupons even though they have their coupons everywhere on woodmans receipt and on madison/middleton coupon books! This buffet is a scam only! Don't waste your money and time especially your mood coming here! You'll feel ripoff the moment you see the nasty old cold food!!"}
{"text":"Not my top choice for a Chinese buffet. Over priced on the dinner & the food was barely warm. Service was the only great thing I would compliment on."}
{"text":"First timer at World Buffet tonight. Decided to give it whirl during a hangry attack with my boyfriend. Ugh. It was the opposite of delicious. Delicious and this buffet are diametrically opposed concepts in life. 
Went there on a Tues night and it was pretty packed. I thought hey, a lot of people here mean its gotta be decent right? WRONG. The price was very wrong, Bob Barker. I loaded my plate with little samples of everything; Beijing chicken, bok choy with garlic, pork gyoza with accompanying dipping sauce, low mein, and broccoli beef. Much of the food was cold and soggy. Gyoza were cold and rubbery, bok choy was soggy. I also got a beef dumpling that had an odd texture/film on the outside that could be assimilated to a memory foam mattress. My boyfriend got a ton of stuff too. Said the beef ribs were ok, but his low mein was also really mushy and pasty. Like chewing on a mix of Elmer's glue and bouncy balls. I went back and tried more food, praying to all the Buddah's in China that the rest of the buffet would be edible. I got chicken skewers which were decent. Fried shrimp was meh and the cocktail sauce tasted like it came straight from the horses ass with as much horseradish as it had. I LOVE sesame balls with bean paste and those were OK there. Boyfriend said the \"make your own pho\" was aight but there was no meat to put in the pho. Chinese donut was alright but I will never be going back despite the somewhat delicious donut.

THE ONE GOOD THING: the lady managing the front desk had some impressive tattooed eyebrows and she said I was very pretty. She said girls in China have a big face and I don't. And that I have really nice teeth. 

So overall, terrible horrible buffet. So bad in fact, we went to fry's across the street and purchased preemptive Pepto Bismol. Only thing I learned today from this experience was to thank my mom for 4 years of braces. Thanks mom."}
{"text":"WAY OVERPRICED. 
food  quality is definitely not worth the priced amount. i used to be a regular customer but stopped going; because my husband and i get charged different prices each time?? (dinner time) . I cannot view the bill because the chicken scratch they write is no way legible. Would give no stars if possible. Dont waste your precious time here."}
{"text":"This is my first review so bare with me. 

Food...was so-so, average at best. Some choices were palatable while others may       turn a few stomachs. I did not find a great variety of food and the sushi was quite limited. 

Ambiance....it's not the cleanest nor the dirtiest I've seen. There is definitely enough elbow room. If you're trying to impress someone it won't be here.

Staff...plates were cleared and drinks filled in a timely manner. Our waitress was friendly enough.

Verdict...if you live close and have a need to feed your face have at it but otherwise go  elsewhere."}
{"text":"It's good standard food for a Chinese Buffet.  The reason for the 5 stars is the little \"extras\"  

I *love* the mongolian grill section where you make up your own plate and they cook it on the spot.  

It's an ideal place to go with kids.  I can go with my two little ones and eat in peace without it being an ordeal.  The staff is consistently friendly and the food is consistent.

I disagree with previous reviewers about the bathrooms.  They're nothing to write home about, but they're certainly not \"filthy\" or \"disgusting\".  I certainly wouldn't stop at a gas station to relieve myself before going there!"}
{"text":"The food was a nightmare. My son got sick when we got home. Needless to say we won't be back!"}
{"text":"I come here mainly for their crab legs.  We usually go on Sundays.  The crab legs are nice and meaty, but very popular. The staff isn't able to keep up with the demand.  They usually go within seconds of putting it out.  No kidding.  A lot of times when I notice others have fresh crab legs on their plates, I'll rush up to get some and only few are left, and of course, they're the scrawny ones.  But if you can get some of the big, juicy ones, they are superb.

The rest of the food is only OK."}
{"text":"This is by far the best buffet around! I came here around 830 pm and the sushi was still great and fresh!"}
{"text":"attentive employees with great food and with a smile. I recommend the noodles. This place is very affordable."}
{"text":"Not a great selection. Food was barely room temperature. The seafood looked dry and overcooked. The chicken was rubbery. Bland and not very flavorful at all. The only American food they had was pizza, garlic bread and some sort of meat.  I have eaten Chinese food my entire life and this does not taste like authentic Chinese food. I wish I would have taken the advice of others who left their reviews.  Let me save you some money-don't go!"}
{"text":"We go here for Sushi, it's made fresh lots of variety and it's 12.95 all you can eat...say whaaat!"}
{"text":"Your typical Chinese buffet: fried items, fried rice, chicken in different sweet sauces, hibachi grill, broccoli beef, ice cream bar.

What makes World Buffet special? For me, the Pho section. I am not an expert in Pho, but I was very proud of the soup I was able to create. The broth was tasteful and the combination of vegetables and herbs I was able to add made it even more flavorful and aromatic. The best thing is that you can add any vegetable or meat: chicken, seafood or beef, cook it in the grill and add it to your wonderful personalized soup."}
{"text":"This is an update. I recently went here again and the food was not consistent! It was not like my previous experience at all. The food was old, stale, and tasteless, the waitresses were rude and looked unhappy. I saw a bug run across the floor near the meat carving section. I don't want to talk bad about a place ever, especially since I actually believed this place was great, but I had to update my review because I definitely don't agree with my first review anymore and I don't want others to believe it when things have changed for me personally. I guess I came on a good day last time, I'm not sure what happened but I doubt I will come back."}
{"text":"We couldn't wait until this venue opened. Unfortunately, we were extremely disappointed in the atmosphere, and overall food quality. Anything that was deep fried had such a \"grease\" taste you had to put it down. The sushi was below average but we expected that going in but wanted to try it for the benefit of the doubt. I always give restaurants at least an extra chance especially after they first open up, unfortunately we will not be returning."}
{"text":"The food was mostly cold, and it was tasteless....I just wasted time and money to find out I'm never coming here again. Safe your money and eat cardboard instead."}
{"text":"This exceeded my expectation of a regular Chinese buffet.  We went there for dinner during a weekday. The restaurant is very clean and they seem to rotate the food regularly so that you are not eating food that has been sitting there all day.

At first I was put off by the various different decor styles, but it is named World Buffet.  I got over it by the time I left.  They have a good selection of different soups and a salad bar.  They had Japanese, Chinese, a little American and a little Italian selection.

Me and my children are on a gluten free and dairy free diets and often feel that we do not get our monies worth at most Chinese buffets.  Here there were 3 or 4 meat dishes that were not breaded or in a dairy based sauce.

They offered a grill where you select the items to cook and they cook it for you.  We were so full that we did not have a chance to check out this part of the restaurant.  Next time we will.

We were full by the time we left.  Since our food allergy diagnosis, we have not been able to leave any Chinese buffet  feeling full.

NOTE: If you order a soda, you only get 1 refill."}
{"text":"This was the worst buffet I have ever been to. All of the food looked old and unappetizing. The service is also terrible. The lady at the front is rude. This place is just dirty in general. Do NOT eat here!"}
{"text":"I love this buffet! Everything here is so flavorful and delicious. Especially their crawfish, that's all I come here for. Must try this Chinese buffet!"}
{"text":"This is my favorite buffet in the area.  Staff is great and food is restocked quickly. The sushi bar is small but delicious.

The Korean BBQ chicken is amongst my favorites.

Highly recommend."}
{"text":"This is my new standard for all Asian restaurants. It is a buffet which we do not do often but the food is so fresh. Not one thing on the menu could be faulted. And oh what a selection, it truly is a world buffet. Plenty of American cuisine along with your typical favorites like General Tsao chicken, peanut chicken, crab salad, chicken teriyaki, pepper chicken, etc.  But how about a Mongolian grill and a sushi bar. The sushi rolls are made fresh right in front of you. The dinning room is beautiful with gorgeous chandeliers and the help is friendly. I must find something negative you say?  OK, you have to pay an extra $.50 for an ice cream cup, really? Well I went without ice cream and if you know me that was no easy feat. But seriously you must go here and we will return"}
{"text":"I happen to like this place. Could the food be better sure but that is true anywhere especially on a buffet. I have never had anything cold to eat here, unless it was supposed to be cold. They also now serve Crab legs every night. I eat here every weekend and have never gotten sick once. The owner is Ming. And the waitresses (Zoe,  Ping and Shan) are great, very friendly. Current dinner price - $11.99. Price went up when they started serving crab legs every night."}
{"text":"Good food Nice service Great Selection. Their Lunch price is good for the Quality and Selection they offer. The Pho and Fresh Basil is Great."}
{"text":"My husband and I have been there 4 times since it opened and have had a GREAT  experience each time. The wait staff is excellent and all of the food we have had is great. The place is very clean and well decorated unlike some of the other buffet's in the area. In fact we are headed there for dinner tonite. YUM"}
{"text":"UGH I have never been so sick in my entire life and I hardly ate anything! I went into this establishment starving and every chicken dish tasted terrible and had a very chewy texture to it. I literally ate just a couple bites of everything on my plate and left and just 90 minutes later, everything is dancing in my stomach so I'm forced to sit here and await my inevitable destiny of hurling everything right back out again. THANKS FOR THE WONDERFUL EXPERIENCE WORLD BUFFET!! I WONT BE BACK!"}
{"text":"If we have food poisoning in the morning, I'm changing this to one star.

We didn't go in the bathrooms.  The restaurant was really clean, overall.  I should have taken the cue from the 3 men storming out without paying that were leaving when we came in that it wasn't going to be good-- they were saying it was horrible.  I thought I'd try it.

My boyfriend and I found nothing to be flavorful, everything, and I do mean almost EVERYTHING to be at room temperature, the texture was lacking, and there were a few times we spit items out of our mouths as fast as we went in.  I should have left... I kept telling myself I should have just left but I didn't see any obviously glaring remarks for here about food poisining.

Boyfriend said sushi bar reeked of intense odor and he was too scared to touch it.  We had several plates of salad bar when the food was found to be profoundly sub-par.  We won't go back... and I pray like heavens we do not get sick..."}
{"text":"I have to say,  this place was clean when we were there for lunch. There was a nice variety of food on the buffet. The flavors were good, but not exceptional. My one complaint would be food temperatures....some items were cold...like someone didn't turn on the steam tables. We would probably try it again...hoping the hot foods would be hot."}
{"text":"Not bad, not a bet good. But I still go there alone.
I never take my friends unless they ask, they never will. 
I am so bored with World Buffet food. Why you call 
World Buffet. It's just Chinese buffet as every others.
Probably I go there so I don't need to talk to any one.
Eat, pay then adiós"}
{"text":"I drove all over Madison looking for a Chinese place with a buffet, and i'm so sorry I stopped in there.  The food was really very bad. I will NOT be returning."}
{"text":"The waitress was great the only problem we had was the food the noodles taste like cardboard and had no flavor the Crab buff is my favorite but not at this place it was Bland the egg roll was 50/50 shocking to me the plantain was good Mac and cheese was not looking great it looked water down but that's my in take tell me what you think"}
{"text":"went here the other night with  my cousin who swears by the place, staff was friendly food was very good, place was clean, and price wasn't bad we loaded up the food, they weighed it, and the food was tasty, I'll go back"}
{"text":"Customer service is like all other chinese buffet, very bad!! First, they give u drinks. Then they touch their phone until you're ready to pay. Then they refill your drink and expect a tip."}
{"text":"1.5: The food is edible but could use some heat, as in temperature.

Most of the food was hovering around slightly above room temperature.  Of the food sitting under heat lamps, a lot of it seemed to have been sitting there for a while.  The only hot things from the buffet were the eggroll (meh, found a few slivers of cabbage inside) and the crab rangoon (that was mostly cream cheese).  On the plus side, the General Tso's chicken tasted like General Tso's chicken.

After the first plate, my brother and I shared all of our plates. As for the sushi, most of it was variations of California rolls.  Standard, not great, but I have to say, I have never seen sushi with iceberg lettuce inside which confused me and made us laugh a bit.  I've had grocery store sushi that was more tasty.

The highlight of the meal was the Mongolian barbecue, which was probably because it was the only piping hot thing we ate all night but even then, the noodles were somehow overcooked.

This was definitely one of the most mediocre eating experiences I've had in a while, so I probably won't be back."}
{"text":"So, right away if I go into a buffet setting, and there are signs indicating for you to eat everything that you take, right away to me that means they are having issues with food costs, and their business isn't doing too well.

Some things on a buffet, I don't expect much quality - sushi on a buffet? I expect to be mediocre... dumplings? I expect to be frozen ones that are steamed/deep fried. Here, the sushi was atrocious. I don't think I've ever had worse sushi anywhere! The dumplings were ok, but it's hard to screw up reheating dumplings.

The hibachi/mongolian bbq service was good - and would be the only reason for me to come back, as that's something I missed from a place I used to go to often in Wausau.

However, if I cannot finish what's on my plate, I don't think a restaurant should be upset with me for it. Cut down how much crap you have out there that no one touches, or is just plain bad (especially the abysmal sushi), and watch your profits pick back up!"}
{"text":"This is probably the second best buffet I've been too here in AZ. 
First time you walk in, you are welcomed with warm smiles and hellos. 
The food has a decent selection of Asian food from Japanese sushi, Korean,  Chinese,Vietnamese and Mongolian. 
The waitresses are attentive and hard working. 
The restaurant has a very Chinese feel and setting to it. Neat place. 

This would be my second visit,so i would definitely recommend checking it out."}
{"text":"World Buffet was literally one of the worst restaurants I had eaten at. Let me start from the beginning. When we walked in, the place looked like a prison cafeteria from the first glance. The general atmosphere and the wall paint all indicated this. Then we were sat down at this uncomfortable booth and the place was so hot that I would've preferred to be outside. It's called AC people, use it. Ok so the waitress, with the biggest angry face asks if we want anything to drink, before we are even sat. She also barely spoke English and talked in such a quite tone that could barely hear her. Once I got my water, she just dropped it off, and left. Mind you we never even got a drink menu or any instructions really. So I go up to her and ask whether we just go and get the food? And she's just like yeah... Again nothing more. Can we get it once or several times? Nothing. The food offering was fine, it was general asian food basically. Well american asian. We gathered a plate and sat back down.Now at this point we wanted to also get beer or something but had to go up to the front to get a menu and ask them to bring us saporo, which was basically the best part of the experience. The food was terrible. It was overcooked, stale and tasteless. Some of the worst asian food I've had. Also they gave us a fork and a teaspoon wrapped in a napkin. No knife, no chopsticks. Anyways, overall a terrible experience. I think going to the mall food court would be a better idea. They have better service, it's even cheaper and the food is tastier. Also I didn't get a second plate, not because I couldn't or wasn't allowed, but simply because I could not eat more of that terrible food."}
{"text":"I shouldn't come here.
It was really bad experience with this restaurant.
When I went back home, I almost threw up for several times.
If I could give this zero, I will definitely gave this restaurant zero."}
{"text":"We weren't sure what to expect from this buffet, but we were very pleased with all of the options.  The food was very fresh, hot and plenty of options for the entire family. The sushi bar was fantastic, the soup was some of the best we have had and the main dishes were the best we have had in the area.  We will be making this a weekly stop with the family."}
{"text":"There are many many Asian buffets in the area but Worlds Buffett is the best so far that I have found, they have a grill so you can pick what you want them to grill for you
They have steak, crab legs on certain nights
And the best sushi selection of any buffet
Not quite sushi restaurant but very good
The staff is friendly and helpful 
Just a great place to eat"}
{"text":"One of the worst buffets I have ever been to after eating one plate I had my fill of dissatisfaction. I would never revisit this restaurant if you would even call it that. Food was almost indelible."}
{"text":"I have been to this place for quite some time but WILL NOT RETURN!! I Had an encounter with an old man that should of stayed home if children annoyed him!! and the owners cared less that I was rudly interrupted on my dinner!! HORRIBLE SERVICE!!  I WOULD NOT RECOMMEND THIS PLACE ANY LONGER!"}
{"text":"Good selection of Chinese but when the sign says world buffet I was hoping for more than Chinese food and French fries."}
{"text":"In all fairness, there was nothing at all wrong with this restaurant -- it was clean, the staff was extremely friendly and helpful, and the food was okay.

But overall the experience was just okay. The variety is kind of lacking for a buffet, though they do have all the (deep fried) traditional American foods that you find at Chinese buffets. And their potato puffs were the best I've ever had. The Chinese food variety was really lacking, though, and some of the food was not super warm by the time you got back to your seat to eat it.

So, it was clean and nice looking, the food was okay, and if all you want is your normal Americanized Chinese buffet, you'll get it here!"}
{"text":"The staff was rude and the food was barely warm although there was a decent selection. I had to stop eating after the first plate I had because I started feeling sick to my stomach and I had a severe stomach ache on and off for several hours."}
{"text":"The worse service the worse food 30 bucks for two people never in my life again ... YUCK  Food was cold waitress ignored my child and I table was never cleared... it was a horrible... never recommending this restaurant to no one.."}
{"text":"My partner and I dined there Thursday evening. There is a very large selection of Chinese items. The trick is to put small samples of items that look appealing on your plate then return for more of the items that you really like. While some items weren't all that pleasing to my palettes, I found many that were very tasty.  There is a large supply of different kinds of sushi. The senior rate during the week is $10.99 while it's a dollar more for the younger crowd. Oh the advantages of being old!  I highly recommend this buffet as it has good food and very reasonable prices. I would have given five stars except I reserve that rating for places that are nearly perfect."}
{"text":"I get there and the cook is cooking steak while he is on his cell phone then after he takes his time cleaning the flat top  to put my food on it watch was so blend didn't even take good at all I'm not coming back here cause there isn't that much stuff to choose from to eat here"}
{"text":"As others have noted, this place is VERY clean and the servers are attentive.  I've been to a number of buffets in the LA area and this place probably ranks above them.

The food is good, but not excellent and you can't expect that for a buffet.  I was impressed that they didn't try to short change by offering less expensive selections.  There was an ample amount of seafood selections.  I found myself going back for the calamari."}
{"text":"Normally the food is good but if its not busy you can tell the food has been out for a while and for 12.50 id expect better. Nice atmosphere and clean"}
{"text":"Just don't go here. As someone previously said it's WAY overpriced. The food is just as shitty as the price."}
{"text":"Food was ok, the waitress was nice, buffet was clean, but the manager was a real jerk.  We had a coupon from coupons.com that was loaded to my iphone and STATED on the coupon \"Show this coupon to the server to take 15% off your bill\".  The manager told us that we had to have it printed out on paper and he wouldn't honor it even though it stated that it just needed to be shown to the restaurant, not that it needed to be printed.  The restaurant owners were the ones who created it!!  And now they won't honor it.  Will never go back, the manager was very short with us and waved us off.  Not a good way to keep customers happy and coming back."}
{"text":"Fresh & delicious. Good location & environment. Only $8.99 for lunch. Definitely a nice place to go, especially for families."}
{"text":"The service is bad and the price high for what you get.

I and half Asian and have had good Asian style buffets and bad.  This is definitely on the bad side.

The Sushi rice had no vinegar and seasoning.  Sushi refers to vinegar and without vinegar it is not sushi.

There are lot of people out there if it has lots of salt and/or sugar think food tastes good or just don't know how good food is supposed to taste like.

This place is around the corner from where I live and I and my children refuse to eat there!

In fact I do a lot of cooking at home when I can find the time, but I rather eat frozen dinners (ugh) than eat at world buffet!!"}
{"text":"The female server is very rude yelling across our heads talking to another waiter and the food was cold and when I talk to the manager she didn't even act like she cared."}
{"text":"I can rate this 4 stars because I don't go into the bathrooms.  I have gone into them.  about a year and a half ago. 

There is a new sushi bar.
there is a \"Mongolian style\" section that you can create your own dish.

My fav is the Peanut Butter Chicken"}
{"text":"Pro: Convenient, plenty of choices available, its affordable, carryout sushi is $8/lb!

Con: Not the best English communication and buffets are hard to keep \"feeling clean.\" (Not that World Buffet does a bad job with these two points... They are fighting an uphill battle since most of the employees are non-native and buffets are buffets) ;P"}
{"text":"For chinese buffets in the area, this is the best. The only one that is better or just as good is the one in Waunakee. 
It's standard american chinese fare. Their beef and mushrooms is really good and their sushi isn't bad either. Its all very sugary, of course, but the items are fresh. The place is clean and the workers are friendly. I come here a lot."}
{"text":"I dined here with three others last Saturday around 3pm. The tab came to $38.00 without the tip.
The Pros: clean, pretty decor, friendly staff, wide selection of Japanese And Chinese foods which were tasty and hot

The cons: awful American foods: ice cream, Mac and cheese, jello.
Come here for excellent Asian -inspired foods (I will not claim they are authentic) Forget about the American foods. I was told that the fried chicken was OK although I never tried it."}
{"text":"The place is clean. Staff is friendly and attentive. I didn't ask for Senior discount it was given. There is a very wide variety of dishes to choose from and being cooked as they're supposed to be.  For those who commented on the american food-this is asian fusion- go to golden corral if you must. All- in -all this was an enjoyable experience well worth the time and money."}
{"text":"I haven't eaten here in almost a year, usta come here all the time. The food is as good as I remembered it . I too do not understand all the bad reviews of the place, although I only show one check in here, I have eaten here maybe 25 times. 9.00 for lunch on a Saturday is a very good deal, considering the amount of items on the buffet, my favorite is the soft shell crab, yummy. The ribs are very good as well.
I have never had bad service here either, the staff still remembered me from a year ago. Very friendly , very attentive."}
{"text":"A little different selection on the Asian food side. It's a nice selection though! Didn't eat the American food. Why do that at an Asian buffet? 8 bucks and some change for a pretty good lunch."}
{"text":"We tried the World Buffet for lunch today. There's lots of tables and booths although the booth seats seem very low to the ground. Our waitress was pleasant and friendly.

The buffet has many sections and lots to choose from: a Mongolian Grill with ingredients to combine for your own stir-fry, a sushi area, a Chinese food bar; an American food and appetizer bar, a salad bar and a dessert bar. The price was only $8.50 which is an excellent price for all of those options.

The ingredients in the Mongolian Grill section looked fresh and there was a cook there to prepare your food. I didn't try this, but I suspect this may have been the best option for the most quality food.

We did try some of the sushi options. Nothing stood out as being fresh or particularly tasty. It reminded me of the boxed sushi from HyVee -- OK, if that's all there is, but I wouldn't seek it out.

The salad buffet also didn't appeal to me. I did see numerous dressings and ingredients but I wasn't there for salad.

Same for the dessert buffet. Pretty standard stock of puddings, ice-creams, and pre-made cakes, none of which usually appeal to me.

I concentrated my efforts on the appetizers and Chinese food buffets. I tried the eggroll (terrible), the dim sum roll (ok), and the gyoza (good). The chicken teriyaki skewer was OK. The sesame rolls were light and fluffy on the outside but I didn't care for the sticky fruity inside. On the Chinese buffet the one dish which stood out and I went back for was the \"sesame\" chicken. It seemed more like salt and pepper chicken to me, but it was outstanding. I do recommend that dish. The rice and lo mein noodles were bland, the glass noodles were better but not great. We tried chili chicken wings, beef with mushrooms, chicken and broccoli, twice-cooked pork, etc. Nothing was bad but nothing was particularly tasty either. I left stuffed but not impressed by the experience.

If you are after a wide variety of food at a reasonable price, this is a good option. But if you are looking for an outstanding tasting experience, I would give this a pass."}
{"text":"Foods good nice selection. But I'm seriously irked by the worship music being played over the speakers. I don't care to be exposed to cult music while I dine."}
{"text":"Wow-wee-wow! I didn't hate this place; I sure liked it a lot better than the previous reviewer (Tiger W.), but it was rather mundane.... 'ho-hum', if you will. Not terrible at all, just nothing special. Good if you're hungry and not looking for a fancy-schmancy experience. I recommend on those terms. Good price."}
{"text":"I ate at the Old world Buffet only once before at the Monona Location for brunch and it was Ok for a Mother's Day brunch as you could eat healthy and not cram all the standard brunches in you that were rather heavy without the other good things like salads, vegetables and fruits. Families celebrating after going to church and enjoying each other's company are always good no matter what the food or gathering. 

Well they were celebrating their one year anniversary this May at their new Westside location with crab and rib eye on Sunday's and my son had come home from his university up north for the weekend so I thought this would be ideal for my two sons as they just don't get to indulge in crab and steak on their limited budgets going to College and eat a good variety of healthy vegetables and fruits and it is a buffet so I figured that my sons couldn't go wrong as they would have a variety to choose from. They already enjoy the General Taus that they like to get at Chang Jangs so I thought more variety with the crab would be that much better after all its a buffet.

I called first to verify their hours and they were still serving the all you could eat crab and they did so we decided to eat dinner there. When we arrived I was pleasantly surprised as it smelled good and they had signs saying they had no MSG which I felt good about. The water with our meal was even pretty good compared to the other water throughout Madison as in the country  we are pretty spoiled with the fresh spring fed well that is fresh and pure without all the fluoride, chlorine and other chemicals added. When you live in the city you are used to it but once you have had fresh clean pure water you never can go back as you know what clean pure water is like and its benefits so I usually drive around with my own 5 gallon containers and ask if they don't mind if I carry a glass with my own water in and everyone has always been accommodating so that's never been a problem. 

Ok their food now. Maybe it was just a slow night and we were eating food that was their end of the day? I'm not so sure though as we arrived a good 3 hours before they stopped serving so we went up and put the foods we wanted grilled on top on the noodles which were done promptly and were good although I asked them to cook mine a bit more as the seafood on it just didn't look very well cooked which they did and was good and we all enjoyed ours so you can't go wrong on this. 

We asked where the crab legs were and the cook said he would replenish those quickly and he did. I've eaten crab that was already cracked open and the kind you have to crack on yourself and these were the ones you had to crack on your own so we took our plates and crab crackers and tried several crackers and they were so thin that we Just couldn't succeed so we fingered we had 3 hours do might as well concentrate on the other foods as we could save that for last or tip the waitress extra and ask her to assist us. 

As we tried the other food it was mushy and bad seafood and was on the rotten side as it was old and smelly. We just grabbed an extra plate to toss the bad stuff on and next thing we know it an agitated waitress was at our table scolding us that we had too many plates on it. We explained that the extra plates were the bad food and showed her the rotten food and asked her to throw it out and maybe she should check on the existing trays we got these from as we wouldn't want   anyone to get ill and there seemed to be s language barrier as she exclaimed that they were a Chinese food restaurant  and that's how Chinese do theirs. We acknowledged that we knew this and that we liked their stir fry but seafood is seafood and we don't eat sushi but the salmon and other seafood was just not right. I cook my own seafood at home and well theirs is not good and coating a tiny piece of shrimp with so much unhealthy breading to my liking but I sure wasn't doing to say that to her. I told her we had tried all their different cracking devices and the crab was so thin could she please get these open for us and she said that wasn't her job. I said I realized this and would give her an extra 50% tip to do this and even handed a $10 bill for mine alone. They were winding down for the night by then so it's not like she was busy but she still refused. We struggled with these only to no avail as they finally kicked us out with the rest of the customers that seemed to be having the same problem as us. Others simply gave up and walked out as we should have just called it a night and left too. 
Moral of the story; don't go to a Chinese food place like this one to eat the crab special or any seafood as its not even clean & devine."}
{"text":"Decent Americanized Chinese food along with the staple salad bar fixings. The carved roast beef was moist, tender, and flavorful. The beef gravy appeared to be made from the roast and not a can or a package.

I agree with Heather C., The Crab Ragoon, Mmmmmmmmm ! I'm also a fan of the peanut chicken.

The wait staff was attentive about refilling drinks and removing used dishes.

$11 for dinner and $1 for soda hard to find much like it in Madison."}
{"text":"Hands down the worst Asian buffet ever!  Generally Asian buffets serve similar items and are not much different from one place to another with the exception of larger or smaller offerings you can pretty much count on them to be consistent with flavor and appearance.  This place was just exceptionally bad.  Bad variety, bad appearance and bad flavor."}
{"text":"If I could make this even less of a star I would.  This was the most expensive glass of water I have ever had. Typically at a buffet I can find something to eat, but everything was so icky looking that I couldn't bring myself to walk down half of the rows, the slimy uncooked fish, the strange things.  I understand \"World\" but you would think that would represent something other than Asian foods.  I did get a cup of the Egg Drop Soup, which was tepid in Temperature at best.  I tried their desserts, and even they weren't sweet...I drank my water and paid $13 for the pleasure.  NEVER AGAIN."}
{"text":"This buffet is probably the worst buffet I have ever encountered in my life. Came here for dinner and was seated right away. We got up to get food and there was literally nothing to eat here. It's only 6:30pm and they are getting ready to close already? The food tasted so stale and old. Its like the never cooked anything new??? Their bbq section was not even bbq? Idk what the heck to even call it...? Burnt section? Like come on..... service was ok, all the workers seems to have so much time cause all they do is stand around a talk. The cooks completely ignores that there are no food cause all he does is stand and talk talk talk. Worst buffet EVER! Do not come here people! Waste of time and money!!!"}
{"text":"Be careful -- 3 of us got Food Poisoning!

Took my family of 5 (2 seniors, 2 adults and 1 youth) to World Buffet for lunch on Saturday 3/7/2015. This is our first time to be there. We arrived around noon, and it was not very crowded, service was fine. There were not as many choices there (compared to Journey on the East side of the town), but they looked OK. I had some veggie salad, noodle soup from noodle bar, a few pieces of sushi, some stir fry etc - not a heavy eater, while I ate a little more than I usually do. Check out was nice and quick, till that time, we felt we had a good lunch.

That afternoon, we all felt very thirsty, which is a sign that the food we had for lunch likely had lots of MSG inside. Well, this is not new, we just had more water. However, at about 1:30am on Sunday 3/8, I woke from sleep and felt sick. As soon as I sat on the toilet, I knew something was terribly wrong -- I started to sweat like never before. My entire cotton PJ was soaked, and my sweat was literally dripping to the floor. And I felt so dizzy/lightheaded that if I didn't try my 120% best to keep alert, I would have passed out. I wanted to call 911, but wasn't able to stand up to grab my phone, nor could I yell out for help.  Then I started to feel nausea and after vomiting, things started to go back to normal. The episode lasted for about 1 hr -- I thought I was going to die... Never felt this scary in my life before.

Called my doctor at 5am and the on-call physician said most likely I had food poisoning. Since I skipped dinner on Sat, the lunch becomes super suspicious. And when I eventually got up the next day, I heard my parents were both sick as well -- similar symptoms, but (luckily) not as severe as I did. 

I called the restaurant owner on Sunday to inform him about what happened to us. He told me his location never any complain before, and we were the only ones. He felt I got sick because there were food I was allergic to without my knowledge, even I told him I am NOT allergic to anything. He said he will give us discount when we visit them again (am I going again??), and I told him the purpose of my call is to tell him we got really sick after eating at his restaurant.

So in case you are thinking to pay a visit to World Buffet, my experience is here for you to reference. Maybe it's an isolated incident, but it was so scary that I would think twice before I go..."}
{"text":"Ahh, World Buffet... You are just perfect for those lazy, I-don't-care kind of nights. I just want to wear my t-shirt and eat your sushi with cream cheese and sauces thankyouverymuch. The lettuce from the salad bar is always cut way too huge. My boyfriend really enjoys watching me struggle to eat it. He prefers getting pho, which you can construct yourself and they will cook it for you on the spot. Aside from the dim sum section of the hot bar, we tend to stay away from it (mostly) because a lot of it is super greasy, overcooked food. Despite the fact that this buffet is just a little pricier than I would prefer, it's a pretty good go-to for those nights you're just feeling something more chill."}
{"text":"This evening I got proof that entropy occurs in the universe. I was driving by the area, was really hungry and decided to have an early dinner in what, until that point, was one of my favorite buffets. Unfortunately I did not have the spectacular feast that I had expected. There were quite a number of misses: among them, the sushi and sashimi didn't have the freshness that I recall from this place, the hot-and-sour soup had a heavy film over it, and a number of dishes were quite dry - the fried chicken, the fried rice, and the sauteed rice noodles, for instance.  Other dishes were just OK, particularly those that are hard to mess up, such as beef and broccoli.  Nothing was outstanding this time around, and the only thing that kept me from bringing my rating down even lower was that they had fresh oysters, which were quite good; but even then, though they did have these on ice, they also put ice ON the opened oysters and the ice melt diminished the sea-brine flavor of the molluscs. In all, it was just OK but definitely not worth the 12 bucks (incl. tax) that I paid for dinner.  I hope that they can get their act together again and become once more the outstanding buffet that I remember."}
{"text":"Came here with some friends not to long ago.. Not impressed.
When you walk in it looks like it will be good, but the food wasn't that great, and I had two different food items I couldn't eat because they had PUBES in them. Gross!!!
Just another gross Chinese buffet. And the website stated 8.99 for lunch Buffett, when we got our bill it was $30! So not worth $15 a piece. I will not eat at this shit hole again!"}
{"text":"Don't go there. I'm warning you. The food was cold and was not good. The decor is hideous. I think it was everyone in there's first time cause I can't imagine anyone going there a second time. I wouldn't eat there again if it was free. Wish zero stars were an option."}
{"text":"Food was cold. Service was excellent that is why I have it 3 stars and clean restroom"}
{"text":"Went here with my wife and three young children on a car trip home.  I'm glad I didn't see the reviews, because we had a delicious meal.  Everything I tried was good; standouts included the walnut shrimp, the potato-cheese cakes, and the sushi, which was good for a Chinese buffet.  The food was hot, the service was reasonably attentive and polite, and the eating area of the restaurant was clean.

My only disappointment was the restroom; the men's room was filthy, lacking in urinal privacy, and covered with racist graffiti.  Use the bathroom before you arrive, or hold it 'til you get home."}
{"text":"I'm giving this establishment two stars for several reasons. I was greeted and sat immediately. I got my food from the buffet and the chicken was overcooked. The sushi tasted like it was made with the cheapest ingredients. I went to the restroom and discovered bottles of bleach underneath the sink, in plain view of a child who could drink the bleach. I returned to my seat and witnessed an employee drop a piece of chicken and kick it aside. Only to walk past it ten more times. This is actually my second visit.  Both times I have been unsatisfied.

Edited to add: The only thing I was satisfied with was how nice and friendly my server was."}
{"text":"Went here expecting more variety! The name is sort of misleading! Very limited to Oriental food. Not that bad but too pricey."}
{"text":"This place is pretty close to my place and me and a buddy decided to give it a try. Typical Chinese buffet, however, this place was AWFUL. By far the worst I've ever had. I say this because nothing was fresh, all the food was lukewarm, super old, and their grilled honey chicken looked like pork more than it did chicken. it was a serious gutbomb. (I left and my stomach was hurting bad. )Then the check came and for 2 ppl it was $30.52!!!! I could've just got 6 lil Caesar pizzas for the same price. Glad I tried it so I can warn ppl to skip this place."}
{"text":"Would not recommend, Most of our food was Luke warm at best. Calling this Chinese food is a far stretch. The employees were making better food for themselves than anything that was on the buffet."}
{"text":"Tonight wasn't the best I've had here food was old/ sitting to long. I've eaten here many time and was always happy not so much tonight. Service was good so may the kitchen was just having an off night. It's a shame I really do like this for a Chinese Buffet."}
{"text":"worst value for your money. went on a saturday evening. 5pm.....has alot of options, and it looked delicious, but was i wrong. food was bland, dried(orange chichen was like jerky) non of the soups had flavor. im being honest all their soups tasted bad, more like tap flavor. i love asian soups, these soups were horrible....for a saturday evening it was very dissapointed. with taxes it came out to be $16 and some change withna fountain drink. (i know i paid what i could have paid for a sit down asian bistro) the waitress were super friendly, but at the end you gomfor the food. end line: save your money, for 2 you are paying $32, and if u have kids well over $40. nothing is worth it here."}
{"text":"I am a glutton for punishment I know. I ate here several years ago & became very very very ill hours after doing so. Out tonight for a family dinner no one really enjoyed the meal we all thought it to be so so. The kicker for me was the man standing on top of the food counter to wipe the wall!  never ever again!!!! All I have to say is dont do it!"}
{"text":"The difference between this buffet and others is the fresh Mongolian style grill that comes with the fair price of the buffet. Lots of typical choices in the buffet, and the sushi is ok, but the variety with the grill makes them stand out for a buffet. I only gave them three stars because, well, it's higher for a buffet, but it could use some more local or fresh ingredients."}
{"text":"Good food for a reasonable price.  It's hard to find good authentic Chinese food in Phoenix.  This place has a large variety of food."}
{"text":"This place is the only thing near my house. I went here many times and each time I go, the food does not look interesting but actually taste nasty. The lady employee came to us to give our cards back after we pay and stand there to wait for me to write down the tip. I did not give them any and she ask why did I NOT leave any tips."}
{"text":"This place is the definition of spotty. Sometimes it's pretty good, but sometimes it's cold and needs a little freshening up. In my humble opinion, don't have a Buffet if you don't play on putting fresh food out. I will say this. If you go during lunch it's almost always hot and fresh so that's always good at least. Never had a problem with their service or not getting any drinks but seeing how this is a buffet you don't really see a huge staff presents anyway. I recommend going for lunch and lunch only. Dinner for some odd reason always seems to be 50/50 as well."}
{"text":"We loved this place.   Great service and the food was good.  Loved that we can get sushi, American and chinese!!"}
{"text":"It was decent for a buffet. Loved there mussels! Wish I knew how to make them myself! Food was not incredible but not awful. Floors were super sticky."}
{"text":"World Buffet has been very consistent in what they deliver which I think is a good thing. Lunch is very much the option for me as dinner strips down most of the meatless options in favor of fish/seafood which I have no interest in. The mapo tofu and vegetable egg foo young is my favorite from the lunch buffet table. Service is great(not that there is much needed since it is a buffet) and it seems fairly well stocked and maintained."}
{"text":"This is probably the best Chinese buffet you will find in Madison. It's not amazing or over the top by any means but for the price you pay it's a good deal for sure. Ample scope of Chinese dishes of general authenticity, nothing is ever kept out for more then an hour as its always the right temp and they are constantly changing out the trays every time I go in here. You can even find some standard American items for those not so globally prepared to go all out Asian yet. The hibachi grill is way cool. Pick from a while bar of food items and pile it on your plate and then serve it to the hibachi chef to grill up and serve in just a couple minutes right in front of you. Small range but good quality sushi rolls also available for a buffet place like this. A very tempting dessert bar also is available for diners and yet I have yet to indulge in that aspect because I never have room left after my main courses are finished. For the $10 to $12 you pay here it's well worth it considering it's more then that for a Rainbow roll at any of the other formal sushi joint in town."}
{"text":"The food quality is getting worse and worse. I used to go there every week because I live really nearby and I am super lazy but now I stop going to this place. 

I have been to this place for more than 8 times this year. Here is what I found:
Their food quality is getting worse and worse --- Fewer people come to this place --- They reduce the amount of food they make ---- Much fewer people come to this place. 

It is like a dead cycle. They used to provide good and fresh food, but now both the quality of their materials and the flavor of dishes are going down. When I went there, sometimes I can easily tell the chicken wings is not good because of they are really tiny and are of weird shapes.

If they continue to run their business in this pattern, I will not be surprised to see them close down in the near future.  Hope something could change in future."}
{"text":"Every now and then when I get a Chinese food craving, and I can't decide what exactly I want.  Good time to go to a buffet!   A coworker suggested this place, as it is fairly new and clean.  The food was good and at $6.99 for lunch you don't feel obligated to pig out to get your money's worth.  The staff is friendly and the refills were plentiful, I will definitely keep this on my Chinese food radar."}
{"text":"This is my favorite buffet! They have a very wide selection and dishes not seen in other buffets. Their orange chicken tastes just like pandas! It's a little pricey but so worth it. They put the best stuff out for dinner including crab legs, coconut shrimp and thick steaks."}
{"text":"All the negative reviews about terrible food and restrooms need to have a push back. If people expect 5 star restaurant by going into china buffet well there's something wrong on the first place with your selection. 
For the price you pay and selection you get that's what it is. We always have a good experience and despite not most pleasant restrooms (you don't have to use them if you don't like them) food is always warm, taste great and freshly made. Restroom are definitely need a change though."}
{"text":"I love this place. Go here often. Never had any problems. Very good and fair price. The staff isnt the best but the food covers for it all. Very good!"}
{"text":"Well, I wouldn't call myself a Chinese buffet expert. But if there were such a title, I would like to say I'm in the running since it's become sort of a family tradition of mine to try new Chinese buffets.

And in my maybe-expert opinion, World Buffet is among the top, with the exception of a few dishes: 
- the coconut shrimp, honey chicken, and spicy salt shrimp dishes were soggy (should be crispy dishes).
- sashimi was not properly thawed and still had bits of ice on it
- bathrooms smelled really bad

With all these negatives, 'WHY would you give 4 stars', you ask?

Staff was friendly, dining area was clean, food was not too salty, fruit looked fresh, sushi looked fresh (albeit some were still close to frozen)...all things I RARELY say about Chinese buffets.

With the exception of the dishes previously mentioned, the food was at or above par. I particularly enjoyed the beef short ribs, clams, coffee cake, fish balls with pork filling (in soup), and fried crab. These dishes were the best I've tasted in a Chinese buffet.

High ceilings and a brightly-lit atmosphere are icing on the cake.

And the cherry: compared to similar buffets, World Buffet is a couple bucks cheaper ($11.99 on a weeknight).

Now if I could only become a professional buffet critic..."}
{"text":"The staff seemed very friendly. The food however was pretty bland and didn't taste very good at all. The veggies had a weird flavor. Edible but not tasty. Mac n cheese looked runny and nasty so didn't even try it. Probably won't be back again."}
{"text":"Date:  Sunday March 25, 2012 around 5:30PM 

Monday - Friday
Lunch $7.59

Monday - Thursday
Dinner$10.99

Friday - Saturday
Dinner $12.99

Saturday
Lunch $8.99

Sunday 
All Day $11.99

*************

What I ate: 
Sushi 
Hot n Sour Soup 
Plantains 
Ice Cream 

Sushi - This was just ok. There is more sushi here than at other buffets, but I think the quality is very poor. 

Hot n Sour Soup - Two spoonfuls and I stopped, this really thick and didn't have that great flavor.

Plantains - The first batch were yummy, crispy and sweet. The second batch was bland and lacking.  : (  left me craving plantains. 

Ice Cream - Nothing went wrong here. 

Other items they had there: 
Basic Chinese buffet stuff... noodles, rice, orange chicken... you know. 
Escargot, that's right... snails. 
Crab Legs
Whole Salmon and Sole 
Mongolian Grill 
Sirloin Steak 
Ribs, beef and pork 
Shrimp 
Oysters
Muscles 
Sushi, including sashimi

*************

What I saw: 
When one of the managers was wiping the food, he saw a piece of cantaloupe that had fallen out of the bowl onto the counter... what would you have done? 
He picked it up with the tongs and placed it right back in the bowl.  If they are this bold in the front, what are the doing in the kitchen? 

The crab legs had barnacles on them (little black bumps, sesame seed sized... see what happened when you squeeze one, barf). No, I'm not a crab snob, but realizing that they were serving \"dirty\" crab and that was probably in the sushi I ate. 

*************

Atmosphere: 
High painted ceilings painted with a blue sky and clouds. 
The décor is nice, definitely not Asian. 

Service:  
Bad service, we had to place our plates on the table next to us, and ask for refills.  When we asked for a steak knife, she said they were over there, and pointed towards the buffet. 

************

The clincher: 
If I had any doubt of if I should return... this removed all doubt. 
When we went to pay, the cashier and a waitress were arguing. 
Two youngsters did a dine and dash and the waitress was expected to pay the bill. 
The cashier, an Asian woman, said she was helping a customer and saw the two walk right out... but it was still the waitress responsibility. 
Is this normal? Do waitresses have to pay for dine and dashers?

I'll never go back, but if you want to, I used a coupon from this site: 
http://www.couponmap.com/arizona/peoria/85345/restaurants/world-buffet/"}
{"text":"Good food, sushi was really good & the pink lemonade. Except the attitude and the bad vibes didn't feel very welcomed ."}
{"text":"I went to World Buffet on Mothers Day to 499 D'Onofrio Dr.  & it will not be happening again ever.  I asked not up stairs.  I can do 2 steps but not full stairs.  And I asked for a table not a booth. The guy laughed.  They seated a family of 3, then a family of 2 I watched the family of 2 go up 2 steps to a table.  I looked the guy in the eye and he said we have no tables yet. And he laughed at me.   I went back to my daughter out loud talking to her I said why don't we go to Journey on the East side of town where we can relax and Enjoy more these people are so RUDE.  I am not spending my money in a place where people laugh at your requests.  That is so very bad CUSTOMER SERVICE.  I will never ever step foot in there ever again.  I understand they were busy.  Journey was even busier.  But my requests were met with a smile. World Buffet you suck for customer service."}
{"text":"This was not my choice and a long way from home. My wife and I met some friends here. I thought there was plenty of elbow room and the tables were spaced far enough where you didn't have to hear the next table's conversation. Enough of this preamble, let's talk food.

They have all of the Chinese food you would expect along with the Sushi and a sprinkling of Korean and Filipino dishes. I had the crab cakes in the little shells which I though were good but a tad greasy when they touchdowned in the stomach. The pancit was great and could rival any similar dish in any Filipino restaurant in the Phoenix metro area. 

They had all kinds of chicken dishes which for the most part were good. My favorite was the spicy chicken. Pro Tip - the chicken wasn't spicy (this is coming from a gringo that doesn't like spicy food). The spicy chicken was probably my favorite dish in the whole buffet. They had this stuffed garlic or spicy crab that was also very tasty. I believe that is their signature dish that they are most proud of at World Buffet.

I had some Desert Banana that is similar to Turon but without the eggroll wrapper. The banana was good but not great. Overall, I enjoyed my meal and it came out to $30 before tip for two people."}
{"text":"Awesome! Hot and fresh, with lots of seafood! Dim sum too and many other items you don't find on other Chinese buffets! They keep the snow crab filled too! Yummy!"}
{"text":"Very Americanized versions of imaginary Asian dishes like General Tso's chicken and \"Mongolian\" beef. There's also Pop 'N Fresh pizza and Costco-looking breaded shrimp. If you are strategic, plan to get there on a Friday night, around 5pm, and you can grab some fresh-out-of-pan potstickers or steamed Shaomai that seem freshly made. Chicken Sate (broiled marinated chicken on skewers) is usually good. 

Avoid the very mediocre sushi made by the grumpy old sushi man. He touches it with his bare hands and it's been sitting underneath warming lights. And the peanut chicken is, well, just odd. Some nights, green beans stir fried are fresh and hot, other times they are wilted and sad little desiccated stalks that have been sitting for hours. There is a dessert bank of freshly cut fruit, ice cream cups and some puddings and cakes that look like they come from mixes. 

Since it is a self-serve buffet, service consists of bringing and refreshing drinks to your table, along with removing plates between courses. Usually it is cheerful and prompt. 

Pricewise, it is ok. It is quantity over quality, and ideally doesn't make you sick - though I would stay away from that sushi if I was you."}
{"text":"Not my favorite buffet. Always found the food kind of bland here, but what kept my family and I coming back were the crab legs. Service was fairly good. I'm always impressed by the cleanliness of this place. It's rare to find a buffet that keeps it's aisles clear of wasted food on the floor."}
{"text":"$16.20 gets you the Buffett and a drink. The food was ok. Lots of choices. A lot of the seafood was very \"Asian \". That is, I don't think your average American dinner would enjoy it. I did like the fried shrimp."}
{"text":"My husband and I went here for the first time a few weeks ago. We had seen their ad with a coupon so decided to try it after church. The sushi was ok at best but the rest of the food on the buffet was very good. My husband and I agreed we wanted to come back...until we got the bill. The ad showed prices and times for both their locations. The  ad did not show dinner prices where going on all day on Sunday. I didn't bring the ad in, just the coupon. They said they could not take the coupon because they had crab on the buffet...what?!?.... And had to charge us dinner prices. So we paid, walked out to the car, and I saw the ad said the other location charge dinner on Sunday's but this place did not say that. After a moment of debating, we went back in to complain to the manager. He took at least five minutes to come talk to us. Then he kept telling me the ad was a typo and he couldn't do anything. After several minutes he took $3 off our bill for the coupon but refused to give us the lunch price. I had even explained that we had never been there and would not have come if we knew that would be the price!  It left such a bad taste in my mouth! I spent five years working in restaurants and the customer is always right! 

A week later, my in laws took us out to dinner and asked about a Chinese buffet. We told them we liked to food here but we just couldn't go back because of how we were treated! Now we are still on the hunt for a good Chinese buffet, thanks to the manager that argued with me over $7! They lost a lot more than $7 by doing this!! There's too many restaurants in Madison to run a business that way. If your ad is wrong, you honor it, period!!!"}
{"text":"This place gives Journey a run for their money.  It offers up a pretty good selection of your standard chinese-american fare.  They have a mongolian stir-fry, noodle bar and a sushi dude rollin \"fresh\" rolls.  

The sushi is about what you'd expect from a grocery store.  The General Tso chicken is up there with the best of them.  The noodle bar is pretty solid.  They offer udon and glass noodles, tripe, \"beef balls\" and other meat products as well as an assortment of veggies.  After the Noodleman boils up your selections you choose what to add from the basket of sauces and oils. Not too bad.

They don't have soft serve ice cream. Instead they have a selection of single serve ice cream cups.  They had some roasted duck sitting out on the counter.  I wasn't brave enough to try it though...

All in all this spot has everything you'd need to make it your westside go to chinese buffet.

Check in on Yelp and get $3 off 2 adult buffets!"}
{"text":"I don't understand the bad reviews here. When this buffet first opened we heard from some friends that it was just so-so and not all that great, so we didn't even try it. Over time we started hearing some positives about it and decided to give it a try.

We've been here probably 15 or more times and each time it's been very good. Even during their busy times the wait staff have been very attentive, the hostess very nice, the food's always been good and the ambiance pleasurable.

We always recommend the World Buffet and take friends and family there. So far we've heard no complaints and everyone always says they enjoyed it and it's one of the best Chinese buffets they've eaten at."}
{"text":"I came in here with my service dog and was seated in a room all by myself. The hostess told me that everybody was allergic and didn't want my dog around. I didn't even eat and they charged me five dollars for my water. I ended up having to wait for the hostess to stop putting her makeup on so that I could give her the five dollars .  I rarely go out and when I do it is by myself I have never been so disappointed in my life!   I now know how it feels to be treated like a second-class citizen.   I did get a chance to look around that second back room and it could use a good cleaning."}
{"text":"Some older reviews made me question if I was even at the same restaurant these people reviewed, if this place really was as awful as some say, they've gone uphill since then. It's a very typical Americanized Asian style buffet with LOTS of options, which makes for a good place to take your family, if they don't like Chinese food there are other (limited) choices. One thing that stuck out in my mind was how noticeably fresh the food was, especially the salad bar. They had great kimchi and other typical Chinese foods you'd expect at this type of buffet. They have a sushi section, mostly California rolls and imitation crab. Not 5 star sushi but definitely not bad. The atmosphere is admittedly a bit weird, I felt like the two staff that were there stared at my table the whole time. They also have signs that ask that you don't waste food, which is a little unprofessional in my opinion and left me scared to try some things. All around it's what you'd expect for the price."}
{"text":"This is probably my favorite Chinese buffet I've been to since moving to thePhoenix area. There was a good selection of well prepared dishes. Most were lvery fresh. All of the seafood dishes I tried were excellent. Crab legs were a real plus. We'll definitely be trying this place again."}
{"text":"We were visiting from out of town and family wanted to come to this buffet.  This buffet was pretty good for sushi. Not so much for normal Chinese food or American. They had a wide variety to choose from. They had your traditional Chinese food , plus a selection of American food too. I like the selection of sushi on this buffet. . The pricing for this buffet was ok, but I would of liked to see them add crab legs on their weekend buffet. All in all the food was good and could not complain about the service."}
{"text":"I was not impressed with world buffet.  The food was just okay, there were some very strange combinations like fish covered in cheese which really turned me off.

We will probably not be back..."}
{"text":"Forget about the apathetic reviews... this place is awesome!

All you can eat sushi?  Check!  All you can eat yellowfin tuna/ Ahi? Double-check!  All you can eat snow crab legs, shrimp, and crawfish?  All you can eat melt-in-your-mouth Korean beef short ribs and more? You get the point! (Please note that crab legs and ahi are only served on Sundays.)

Come here hungry, and you'll most likely get the bang for your buck!  Unlike most Oriental-American buffets, this one keeps their stuff hot & fresh and they also have Mexican food and a decent section of deserts.  The service is good but not superb and some of the items are mediocre. 

So, yes... overall, I'm a happy customer and I think that you'll concur!!!"}
{"text":"I used to LOVE, LOVE this place BUT it has hit the nasty level where I will no longer return. We have been coming here since it opened, like 7 years or so, and I used to brag on this place like no other. This last time was the most disappointing in a series of decline. The food is no longer \"hot\". Once upon a time, the food would actually have steam coming from the pans, not this time. Barely enough heat to keep Mr Inspector happy. The shrimp is now only a minute piece of minced shrimp surrounded by a heap room temperature nasty breading. Pasty low mein, dried out rice, soggy cabbage,no mashed potatoes, chicken wings were sitting out way too long.  Nothing is freshened up until the very last of old dried up product is removed from the pan. I understand that it saves \"them\" money but, it's just plain nasty for the customer.
  For 2 adults to spend nearly 40 bucks (including a tip) for mediocre food doesn't do it for me. Plus, they no longer sell alcohol. Yelp states that there is beer and wine but when I went Feb 2015 I was told NO to a house white wine. I'm sure it saves them money on the license to serve but that doesn't matter to me because I will not return to their sub par food. It's sad to see a place we once really enjoyed succumb to obvious penny pinching that will probably be the very thing that will bring death to the business. I hope for the owners sake, I will not see a \"closed\" sign on their front door.
  I hope the owners of the establishment reads this because it's coming from a regular patron to one that will not return because of the continual decline."}
{"text":"Come here takeout all the time. Price is really cheap for the amount of food you can get and the people at the counter are always nice and inviting. The place looks nice as well, I really dig the fish tank with all sorts of stuff in it. Great selection great food."}
{"text":"Not too bad... It's really nice inside, very colorful and clean! I also liked that they had the March Madness games on their TV too :)

The staff was extremely friendly and it wasn't as busy as I thought it would be on a Sunday morning. They had a pretty nice variety to their buffet, however I wasn't all that impressed with the food...particularly the american dishes. The pizza, mash potatoes, and mac & cheese were kinda bland. Not to say the food was bad - it was just okay. I liked the asian style dishes a lot better and the spicy tuna they had was pretty decent.

The price is fairly cheap for a buffet so that was cool. I'd come back here again if I was nearby and in the buffet sort of mood."}
{"text":"They get one star only because I can't go any lower horrible horrible food I definitely can't understand how they are still open"}
{"text":"Great price, but the food is certainly not as good as other buffet such as Journey, not much choices especially for the sushi."}
{"text":"Closer to 2.5 stars.  The restaurant is clean and service is decent, but the food is not the best.  I suggest sticking to the usual hot fare like the orange chicken, beef and broccoli, noodles, etc.  Those are all fine.  While they did offer a seafood selection, I found a lack of quality and freshness.  I tried the crab legs but could not get the meat out.  No matter how much I battled it, it kept sticking to the shells.  Crawfish had a weird taste.  The sashimi and nigiri was not good.  Now I don't expect stellar sushi at a buffet, but I've been to other buffets that do it better.  Once I gave up on the seafood and went back to the regular hot food, it was a much more enjoyable meal.  For dessert, I was surprised when I actually liked the mocha sheet cake.  Lol.  Normally, I always feel fooled when I get the sheet cake at buffets.  They usually look decent and get your hopes up, but taste awful.  This one was good, albeit a little artificial tasting.  It still had a nice chocolate coffee flavor.  Also, they did have those fried sugar biscuits.  You can't go wrong with those.

2.5 stars.  Bottom line:  Clean and friendly.  Go for the regular hot food.  Seafood might disappoint."}
{"text":"This place is horridly disgusting. After getting a cup of egg drop soup, it was discovered  there was SOAP in the soup. I alerted the management, and had to deal with a less than competent man (the owner) with limited public relation capabilities. I sincerely felt sorry for their poorly treated waitress, who apologized over the manager. To add insult upon injury, the manager refused to remove the infected soapy soup from the buffet & STILL SERVED IT TO THE PUBLIC FOR HUMAN CONSUMPTION. Gross & distasteful"}
{"text":"This was a decent place nothing special. Price was ok during the day. Food wasn't the best quality actually seemed more later or leftovers. Sushi was good quality I would stick to fully cooked food though."}
{"text":"It seems getting worse now, the selection is very limited, with many empty pans. I don't think I will go back anymore!"}
{"text":"Second time attempting World Buffet, it was pretty tasty first time around, was hoping that a subsequent visit would confirm that. They have quite a selection of different items, although I think adding macaroni and cheese and mashed potatoes to the buffet line does not equate to calling it a place that serves cuisine from around the world. If you don't mind brushing the 'cheese' off various dishes, then you'll get your seafood fix. The price wasn't bad for the variety. It'll be quite sometime before we head back to World Buffet for the coconut shrimp."}
{"text":"Came back recently and their noodle soup bar is not the same anymore.  I think because they had such demand, they couldn't make the broth from scratch anymore.  It tastes like a broth made with bouillon cubes."}
{"text":"This place does some things very well but the food needs some help.  
The staff is very friendly at the greeting counter but not so much back at the cooking station.   The place is immaculately clean and the serving islands are impeccable.  High marks for this.  They have a good variety of food.   
My problems were that none of my food was hot.   Almost everything was barely warm.  The sweet/sour chicken did not taste that good and used that chicken mash for the interior instead of solid chicken.   They may have also used that elsewhere.   It is chicken with filler or something and I hate it.   I also didn't care for the Crab Rangoon.   It was ok in flavor but the consistency was different from what I am used to.  
The best dishes were the broccoli chicken-excellent flavor and tender chicken, peanut crusted chicken-really good and crunchy with great flavor,  
So all in all I was able to put together a good group of foods that were quite tasty.  I just wish it was hot.  Probably won't go back again.  I would rather spend my money on something more to my liking with even better flavor and of a higher quality.

Went back a few weeks later.   Focused upon the dishes I liked best.  They had good flavor but still not warm enough.   Not flavorful enough for my taste.   I tried an apple desert they had.  It was way undercooked.  Bottom was completely uncooked and totally dough.  Yuck.  They still get 3 stars because of the cleanliness and pleasant atmosphere with lots of room to move around."}
{"text":"I wanted to give 3 1/2 starts but couldnt so I rounded up.  Arrived around 5pm.  Not many people by any means.  But the food was tasty and the employees were nice.

The only complaint is that there is a strange odor.  Not sure what it was but I ended up being so focused on trying to figure out the smell that I just needed to finish and leave."}
{"text":"I had a date night with my mom!  She invited me for dinner and picked this place to try.  It was both of first time.  We came here on a Thursday night, they were busy but not packed.  We were greeted and sat quickly.

There was a ton of food.  Appetizers, soup, dim sum, entrees, sushi, bbq, etc.  Some of the appetizers were old and hard.  =(  The wonton soup was missing wontons.  The egg drop soup was good.  The \"chinese\" food was good.  The fish was dry.  I think the BBQ sat too long (super tough).

The place was clean and service was great.  Just the food was so so.  Our bill came to $26+, I thought the price was a little high..."}
{"text":"My husband and I tend to go to buffets because we like the variety of food. This buffet is amazing. They have probably just about anything you would imagine for Chinese food. They have a good selection of American food too, so our kids liked it. They have Pizza, mashed potatoes and gravy, chicken nuggets, wings, sushi, bbq station and a variety of desserts. The only thing they were missing is crab legs. Lol We will definitely go again! I recommend trying this place out."}
{"text":"meh. besides mongolian grills, pho, and sushi bar, nothings really edible. They sometimes have crab legs, sometimes don't (I was irritated that they didn't have crab legs so when I asked about it, server said \"U like crab leg? We have it tomorrow.\" How about maintaining regular food schedule?) They don't really refill the foods on weekdays. A lot of dishes were stale af."}
{"text":"I've been going here for about 5 years now, and while the bathrooms were a major source of contention, everything else seemed to be pretty good.  However, in the last few months this buffet has taken a header right into the crapper, literally.  Another reviewer mentioned that they have signs in the bathroom asking that you not flush your toilet paper, rather dispose of it in a little garbage can next to the toilet.  You don't have to be a genius to figure out that is some nasty, literal shit.  The bathrooms have air freshners in every stall and on every counter.  They also have two automatic ones mounted on the wall.  The smell of overpowering air freshner hits you in the hallway before you enter the horror room.  

Unfortunately, not just the bathrooms have deteriorated.  The quality of the food has taken a turn for the worse as well.  We're talking grade C chicken chunks with bones in it.  Gravy for egg fu young that is crusty and clumped, egg rolls burned to a crisp, and flies galore.  Mmm, flies, how I love to eat when there are flies landing on everything.  Also, I noticed one of the employees picking at her eyes and face, I wanted to march over like a crabby mom wagging a finger and say \"stop that!  Go wash yer hands!\"    

Then they charge you a premium averaging 12 dollars per person for this culinary extravaganza.  But I can assure you the best part is when 2 our of 3 people in your party are forced to spend the rest of the day in their own bathrooms, at home, with gastrointestinal pyrotechnics."}
{"text":"Very clean- cleanest buffet I've seen and bathrooms were good.


Good variety of foods AND soups.
Sushi and Kimshi (Rotten cabbage?) were great (according to wife)


Dim Sum, Mongolian BBQ, Sushi, Chinese, Seafood, Salad Bar, and American food.  All were hot and fresh and great flavor.  I had many varieties of chicken and egg drop soup + one shrimp and broccoli dish. they had Mongolian grill~foods were hot and fresh at 3:30 PM

Service was good (but they were very slow, we went early)

Prices were reasonable....  had 2  $8.99/plate lunches and drinks ended up with $22.00+tip. 
-Convenient parking.

-One of the better Chinese Food buffets that I have been to."}
{"text":"We ended up here because that is what the group chose.  We would have never gone on our own nor would we based on our experience.  We ate here on a Sunday night and nothing on the buffet appeared very fresh.  I risked my stomach on the sushi and am pleased to say I survived.  Sushi was pretty low quality laced with that not-so-authentic mayo sauce, but it is a buffet so what should I expect.  Rest of the food was limp, but edible I guess."}
{"text":"My infatuation with buffet should come as no surprise to anyone but I steer clear from ones that do not have a good standing in the crowd. A little hesitant at first as this joint is rated Average, but, we still did muster up our optimism and ventured to this joint for Dinner. Now, their prices for Lunch and Dinner if I recollect were $8ish and $14ish respectively. That's a considerable bump so one would expect better quality and options when planning a Dinner trip. Alas, it wasn't so.

Ambiance : Clean and pleasant with a cute little koi pond at the entrance!

Service : Swift and unobtrusive
 
Food : Majority of the food was still \"leftovers\" from Lunch that they didn't bother on replenishing. We didn't see any \"Special\" dishes to elevate the whole Dinner idea, the ones that had Dinner stuck on them were more \"meh\" like a different version of shrimp or chicken.

The Variety on offer was average and certainly NOT the largest local buffet as they claim. The Quality was OK but we didn't get to try quite a lot of them as they were still waiting on their turn to be restocked.

The one highlight of the meal was Sushi. Quite easily one of the best \"Buffet\" Sushi's I've had. 

If you were to give this place a try, I'd say skip Dinner and save those extra bucks."}
{"text":"My boyfriend has been begging me to come here. I finally broke down to get it out of the way. I usually check reviews of places before going some where, so I had my expectations very much lowered. Some how, this place was still disappointing. There was very little selection and the food wasn't very good. The sushi was average.

I really don't advise going here, but if you do they have coupons on their site. They're far too overpriced without it. Even with it I still wouldn't pay the money, but oh well.

Oh, and it definitely doesn't compare to Journey. I don't particularly like Journey because the fish made me sick, but Journey has an pretty amazing selection. This place does not."}
{"text":"This is our family's go-to Chinese buffet. Since we rarely agree on Chinese takeout, this is the best bang for our buck. 

Honestly, the food is not the worst I have ever had! In fact, the sushi bar here is better if not comparable to some of the sushi restaurants in town. 

Of course there are the Americanized, sweet/fried options, but there is a solid salad and fruit bar and Mongolian Grill (fill a bowl with ingredients and it will be cooked on a flat top grill.) 

The restaurant is bright and clean, as are the bathrooms. Lol. A cute Koi pond with turtles is a nice distraction for kids and the staff is polite and efficient. 

If you are curious about a buffet but were leery to try one, you will be fine if you come here."}
{"text":"Food was actually pretty good, but service was pretty terrible. Couldn't help but feel unwelcome and ignored. The staff was chit chatting away while our drinks sat empty and we wanted to order additional drinks. We got the hurry up and get out of here check & they laughed at the undeserved tip we left. We shouldn't have left a tip at all. An annoyed looking girl then asked if we were done after we paid our bill and I smiled as I told her yes. I only wish we left a bigger mess for them to clean up."}
{"text":"great selections. Sushi, mongolian bbq, Dim Sum, and even fried checken. It tastes homemade and delicious."}
{"text":"First time here and hands down a new favorite.  From the noodle bar, to fresh sushi.
Also, I got a steak to order over a flame broiled grill! Deliouses"}
{"text":"Really decent! The sushi is fresh and quite good for a buffet. I liked everything I put on my plate for the most part. I was a little disappointed that they use instant mashed potatoes....but whatever. Also, soda refills are NOT free and that came as a bit of a surprise when the bill came, seeing as how our server made no mention of this. Despite bad mashed potatoes and paying for soda refills, World Buffet was exactly what I expected and what I wanted on a night I couldn't bring myself to make dinner. I wouldn't come here for a nice night out, but it really did the trick tonight. We left full and happy, and I believe that even the pickiest eater could find something they enjoy."}
{"text":"This was pretty good. Everything was good. Not great. Not bad. Definitely not horrible. Just good. If you need a place that you can sit down for a quick decent bite, not a bad place. Just my two cents."}
{"text":"The food is good always decent and the price is good however, the service is terrible.  The dishes are not removed from the tables and you must constantly ask for refills of whatever you are drinking.  The service staff is non caring and would rather talk to each other than do their jobs.  Too bad - we used to come here often but no more."}
{"text":"Do you like deep fried breaded meat in brown sauce? All the mayonnaise-doused sushi rolls you can cram into your gullet? Mashed potatoes and pizza for your picky child of a roommate who will still bitch the whole time about wanting a burger? 

HAVE I GOT THE PLACE FOR YOU

Honestly if you are expecting fine dining at a 13 dollar Americanized Chinese buffet then you need your head checked. The sushi is OK, but there is quite a variety and it's out of the ordinary for a place like this. I see some rumblings about there not being enough variety but they easily have 4x more stuff out there than any Indian joint I've been to around here. It's a double edged sword though, lots of food = lots of old food. Go earlier. There are all sorts of condiments available. The noodle bar is nothing special, go to a Vietnamese place if you want some pho, you're here for General Tso and his lesser known cousin Mongolian Pork."}
{"text":"The Pho bar was my favorite. The soup was HOT and the noodles were great. Plus there are a lot of add-ins. I've never been to a buffet with a Pho Bar. Sushi was okay for a buffet. The food was fresh. I enjoyed my experience. We had a huge group of 22 people."}
{"text":"I've only been to two other Chinese buffets in my life - one in Austin, Texas around 2004 and Journey on the east side a few months ago. Between Journey and World Buffet I personally preferred World Buffet. The Texas joint was a more fancy-pants affair (not actually fancy, but more thought put into the presentation and ambiance). 

WB is in pretty dire need of an update, but the dated 80s-ness of the place is probably what helps to keep costs down. Dishes, silverware, and the serving areas were clean, and the food was hot on a weekday at noon. For around $8 with a coupon you can't ask for much more. 

The two best things I sampled were the breaded bites for sweet & sour chicken (though I'm a weirdo that goes sans sauce and dunks them in spicy mustard) and the sesame chicken (though, as Pat D. noted, there was no sesame or traditional sauce involved, but a nice pepper coating that I really liked). 

I tried two pieces of their veg sushi - it comprised cucumber, avocado, and I think melon? It was about on par with grocery store sushi but I appreciated they were more creative than just a boring cucumber roll. 

On a random note I could not find any white rice, but the fried rice was fresh. I enjoyed the very light strawberry and mocha cake squares on the dessert buffet - usually I'm too full for dessert but the airy texture satisfied my sweet tooth without leaving me full of regret. 

I don't think WB will be a regular stop, but I do think we'll be back. We'll probably give their takeout a whirl - the website has the same price as the buffet, but a sign inside listed it at around $5 a pound. Either way, you'll get a good amount of food for a low price."}
{"text":"A decent choice for a buffet that edges out its sister restaurant in Monona. Food-wise it's pretty identical, but the ambiance is much, much better. 

In the former Pedro's space behind the mall, this World Buffet is lighter, brighter, and more updated. Items and areas are more clearly labeled, and there are some nice touched like wall art and a koi pond. 

The food is pretty identical to Monona, but with a few more choices. There's a soup bar, stir fry area, sushi bar, several areas for your Chinese food standards, and a bunch of desserts. The items seemed a little fresher than our visits to the other location, but we were also there on Christmas day so turnover was probably higher than average with the movie theater just down the road. 

Our server was kind and quick with drinks. The \"sesame\" chicken from the other location was called pepper chicken here (which makes sense since it's coated with pepper and has no trace of sesame I've ever seen); unfortunately it seemed to be made with chewy dark meat, though, instead of the white meat version I had previously. 

The sushi looked a little better and held up more, but the sweet potato roll I tried threw me for a loop by being topped with orange roe. I thought that might be what it was, but shrugged it off since it was their veggie offering of the day. Once I started chewing, though, the fishy taste confirmed my hunch. I never would have eaten fish eggs on my own (I don't really enjoy anything that comes out of the sea), so I guess I can scratch that off my unintentional bucket list. 

The westside location is a little more expensive than the older Monona location, but honestly the extra buck or two might be worth the upgrade in ambiance. Don't forget to check in on the Yelp app for a dollar off, good for up to four adults!"}
{"text":"I like coming here. The food is good the people are friendly. It's nice they added a TV. The buffet is good and the crab legs are really good."}
{"text":"I used to go to this place every week for a couple of months, but I now stopped. 

The reason is simple, the food quality went down significantly over time. 

You can easily see this from the tiny chicken wings they served, cold dishes and less variety of food. To be fair, the only thing remained good is the noodle soup.. 

I was really loving this place because it is near my house and is a convenient place to eat some Chinese food, but I will not come back again."}
{"text":"Family member and I came here around 4:30. Got seated pretty quickly. The buffet is good sized. They have everything from sushi, sweet and sour fried pork, general tsos chicken(which tastes more like orange), smoked salmon. I liked the coconut shrimp and the lo mein noodles. It was the only thing decent. Everything else wasn't that great most things were just warm or cold. The dessert was probably the little highlight of it all. The pink and orange little cakes. It was steep on price for the lack of quality on the food. $31 for 2 \"dinner\" buffets."}
{"text":"Excellent service
The other night, it was around 8:20, me and another 5 adults came in looking for something to eat. The lady was nice enough to ask us if 40 minutes is enough for us to eat. We decided to stay and they lady started to ask us what food do we want so that she could tell the chef make since there were barely any food left. So we started to order the main food that we want (mostly were seafood), and when they bring the tray out, they were very generous to give us 4 or 5 full trays of food. Excellent service. I would definitely come back"}
{"text":"Amazingly good food. 10x better than anything in Milwaukee. Very large selection of both Asian and American foods.


Price was a bit high. 16.50 for dinner. Not sure if the price included drinks or not."}
{"text":"That was seriously the most disgusting meal I have ever had. I was here a number of years ago and it was okay. It is obvious they have resorted to cutting way back on the quality of food. Half of the food had obviously been previously frozen. The salad bar was in eatable. THE SALAD BAR. For desserts they have cream puffs that they don't even bother to take out of the plastic trays they came in. And they were freezer burnt. They had mashed potatoes and macaroni and cheese that had both sat out under the heat lamps so long, you could see the botulism starting to grow on them."}
{"text":"- Food was terrible; gave my friend and I horrible stomach aches.
- Very over-priced.
- Saw a half bitten-into dessert that somebody put back onto the buffet table.
- When asking the guy who was making the sushi about one of the sushi rolls, he just side glanced me and mumbled some incoherent response to my question.
- I almost slipped on a large puddle of water in the middle of the floor. They had no signs up warning people of the large puddle and no one showed any intention of cleaning it up.
- Saw a little girl take a hard fall when she slipped on the same aforementioned puddle of water that still nobody had cleaned up yet.

I will never return and I highly advise everyone to steer clear of this restaurant. It was just a hot mess."}
{"text":"I don't know why when i find a great chinese buffet they sooner or later start to disappoint me. I do LOVE the walnut shrimp and one of my very favorite things to eat is crab ragoon but i have to say this item has gone way down hill. They are now so dry and the texture is gritty, i had to spit it out. I was just waiting for them to try to charge me extra for wasting food but it was not edible in my opinion. One of my favorite places was China One and they are now closed, lets hope this place does not follow but they need to do better."}
{"text":"I was very disappointed with this place. I never expect too much when I go to a Chinese buffet, that has \"sushi\". The sushi was primarily made up of cream cheese and rice. The Chinese food was sub par in my opinion. The almond cookies were even cheap and tasted nothing like an almond cookie."}
{"text":"Took my family here for the first and last time. This place was so gross and as we were eating a roach was crawling up the wall behind us. We told the manager we didn't want to finish our food because of the huge roach crawling on the wall and showed her. The managers response was I'm sorry but we have the best pest control in Arizona. Nothing else. No discount, nothing. I'll never go back there. Ruined our night."}
{"text":"Ok, I'm just going to say it and give up any food-snob credibility I might have... if you're looking for sushi rolls (especially the kind with all sorts of sauces and goofy ingredients), this place is about as good as it gets in Madison (ok, the duck roll at Murimoto is better, but costs more than \"all you can eat\" rolls here...)  Last couple of times I've been here there have been at least 10 different rolls being freshly prepared.  The rest of the buffet is all hit-or-miss."}
{"text":"Been to Journey a handful of times, so I decided to try this place out to get my Chinese buffet fix. The overall experience was about what I expected. The place is clean and well lit. The food selection is not as good as Journey, but World Buffet still had a great selection to choose from. My schedule was a little weird, so I went in around 330. This made me weary of stale/cold food, but I was surprised that the place was relatively busy and food was as fresh as it could be. If I didn't have to take the belt line to get here, I would consider coming back. It is pretty cheap (25 for 2 with drinks), but I would choose Journey over it if you are on the East side of Madison."}
{"text":"The Place itself was very clean...ample parking courteous staff.
There wasnt a HUGE selection of food but there was enough to pick from. Most of it was good. I specially loved the sushi available. The price for (2) adults including 2 sodas was $30.32 a bit high if you asked me.

A HUGE Disappointment on the selection on dessert  They had:

CHOCOLATE & VANILLA ICE CREAM
AND ONLY (3) choices of pastries - star shaped cookies, small squared chocolate cake & another one that I wasnt too sure what it was. 

Would I recommend this place? NO
Would I come again? Probably Not

My search for a Chinese buffet with delicious food will continue!"}
{"text":"Good food then average Chinese buffet. They have Good selection and carry authentic and American version dishes. Desert collection is very impressive."}
{"text":"-Very clean restaurant.

-Even cleaner restrooms.

-Pretty decor.

-Friendly staff.

-Delicious food, including Dim Sum, Mongolian BBQ, Sushi, Chinese, Seafood, Salad Bar, and American food.

-Fresh food rotation. Buffet lady with headset talks to the cooks in the kitchen and new food appears. 

-Reasonable prices.

-Convenient parking.

-One of the better Chinese Food buffets that I have been to."}
{"text":"WORST BUFFET EVAR!

The food was gross, the service was slow, and it was the worst 25 dollars my bf and I have had the misfortune of spending on food. Seriously, we barely ate anything and when we asked to speak to a manager, he offered to comp our sodas... that's it. 

Worthy of a health department inspection."}
{"text":"I was quite impressed with this place.  Sometimes a buffet restaurant can gross me out, but this one stood out from others that I have been to.  With so many Chinese restaurant/buffet's to choose from in the valley, I would definitely give this one a shot if in the area.  

It's location is very easy to get to located right off the 101 on the S/W corner of 91st ave and Olive in Peoria.  Situated in a newer looking commercial building and very nicely decorated on the inside.  Ambiance is pretty nice with the food fresh and looked after very intently by the employees.  I would like to add that it is very clean in the place.  Nothing is worse than a dirty restaurant.

With the right prices, great service, and choices in food, World Buffet has something going for itself.  If you're a buffet fan, put this place on your list!"}
{"text":"Awful.  Wanted to try a new place today and decided to swing by.  The fried rice was mushy, the low mein was bloated and mushy, the main dishes like orange chicken and broccoli beef were cold.  The egg rolls tasted like they had cinnamon in them. Most of the dishes looked like they had been sitting on the buffet unchanged for quite a while. 

The service was no better.  We were greeted abruptly as if we were interrupting something at the door and were seated.  We got our drinks and that was the last time our server came by our table.  The wait staff stood at their station on their cell phones. 

We won't be back."}
{"text":"I am always on the fence about any type of buffet style restaurant. World Buffet is clean and the staff is friendly and accommodating. The woman who sat us overheard my 4 year old asking for chicken nuggets ( which they don't have during the week) and said she would have the kitchen cook us up some. 
From the adult food perspective, everything was fresh and warm- not so easy to come by at buffets."}
{"text":"I will just be honest and up front... I am not a fan of buffets. It is impossible to have food sit out under a heat lamp and be as good as a dish served fresh. With that preconception in mind....

Atmosphere: The cleanest buffet I have ever been to. There is soothing music playing in the background. The music is not loud enough to be annoying but rather creates a nice ambiance. The walking aisles are wide enough for easy movement to and from the buffet area which is centrally located but separated by a half wall partition. 

Service: The service was prompt and polite. Paying the bill was a little confusing because one normally buffets charge in advance and two at a buffet you do not really have a dedicated waiter so whom and when to pay was a tiny issue. 

Food: This is where all buffets fail and it is not for lack of effort it is simply a flaw in the design of buffets and should be anticipated before you take a seat at one.

Korean BBQ: Was actually pretty good because despite sitting out it does not lose its texture. It had hints of ginger and had a nice chew to it.

Orange Chicken: Tasted good but was mushy due to sitting in the orange sauce.

Spicy Chicken: Bad texture and was not spicy.

Fried Rice: Flavorless and had uncooked grains.

Crab Puffs: Ok but tasted like they had been sitting under a heat lamp for some time. They were not crunchy they were rubbery and the filling was luke warm.

They have many other buffet options including non Chinese dishes to choose from but I did not partake. They serve sushi as well. I do not think this sushi contained any fish but I did not inspect too closely because there is no way I was eating sushi from a buffet.

The cleanliness of the buffet was a huge surprise but as always the food was a let down. If you want to go to a buffet and know the food will not be great because it's a buffet then you might as well go here."}
{"text":"Yummy food, nice wait staff, and cute fish pond. My kids love coming here. The only thing I would love to see there would be more vegetarian options on the buffet. Also I would so love if they had cream cheese wontons. A girl can dream right?"}
{"text":"Not real clean, kind of out dated but the food is decent.  Depending on order in or takeout, it can get a bit pricey. We will go here when we are tired of the usual and want something other than Panda."}
{"text":"Ginormous buffet!! Everything looked so beautiful,fresh and delish...only problem was food was tepid at best.  
Sushi bar, noodle bar, Mongolian BBQ, Bao(sp?) 
But.....took a bite of something mis-marked and I must confess, I hid it in my napkin then ran to the bathroom to dispose of it because I didn't want to get caught wasting food. 
The chocolate pudding and brownie bite were my favorite as well as the red bean bun; yummmm"}
{"text":"World Buffet is CLEAN and still has great service! The food is terrific with a diverse selection. It's ALWAYS busy, so you know that the food is fresh  (go in a buffet with no diners and you wonder how long the food has been sitting there)

They have received the GOLD AWARD on their recent inspection from the Health Dept, which is as good as it gets! YIPPEE!"}
{"text":"Where can I start? When entering a new
resturant I look for great customer service and great quality food.  This place offers this 100 percent . 

Customer service is top notch.  Both the managers and workers make an effort to assist you with any concerns. They always look to approve their service and welcome your feedback.  A great example would be when I spoke to the manager one-to-one about new strategies in perfecting customer service and marketing; she was very excited about tips and tricks I conveyed to her.  I think her restaurant will become very popular.

The food is excellent and very inviting!  I had to limit my portions because I wanted to try everything!!!
Seafood heaven... 
American style delight... 
Asian Fusion galore and much more 
(Look at my photos I've post and you realize that World Buffet gave me a wonderful experience).

Helen's upcoming deals that I'm excited about?  Groupon and LivingSocial discounts.  This is a great idea and I can't wait!

Go in and experience World Buffet the right way!"}
{"text":"Good, standard American-Chinese buffet. The service is friendly, and I've enjoyed most everything I've eaten there. They keep the dishes filled, so you never have to wait long for refills on anything. 

I don't recall the bathrooms being overly disgusting or overly sparkling clean...generic bathroom to me."}
{"text":"I took my family here and none of us liked it. The beef and broccoli was pretty much rubber and broccoli. The only reason I gave them 2 starts is because the sushi was ok. I ordered a hot tea and even that was flavorless."}
{"text":"This place is pretty solid. Everything was pretty tasty. A lot of your usual Chinese buffet foods - done acceptably. Nothing was like zomg delicious, but if you're ever unsure what to eat, this place gives you a nice eclectic Asian palate. Meaty stuff, veggie stuff, seafoody stuff. The sushi was pretty good too.. I liked how the rice was still soft. Nothing fancy, but definitely .. again.. solid. :)

Everything here didn't seem like it was sitting out for awhile (except for the mashed potatoes-- which tasted like the boxed kind which was childhood nostalgia for me). Food were all hot/decently warm.  It's as clean as I would expect from a Chinese buffet. Bonus, I liked how bright this place was. 

Waitstaff was kind. Not hoovery. 

I would come here again."}
{"text":"Bigger selection than most buffets I've been to, but nothing is awesome. Quantity over quality. But overall not bad."}
{"text":"First time to come. The outside looks pretty good with a wood door. Great place and various choices!  I would like to come next time."}
{"text":"I ate here on a Sunday evening with a large group of friends who told me in advance that the place was edible. I thought it was better than edible, but I may not have the world's highest standards. 

Like you'd expect from a buffet (perhaps especially one called \"World Buffet\"), there's tons of variety in the food options. Most people seemed to like the frozen yogurt. Lots of watermelon always makes me happy. I wouldn't go in with too high of expectations, but if you're looking for something to feed a crowd, this place is definitely functional. Parking was no problem and there was plenty of seating. Bonus points if you speak Vietnamese."}
{"text":"Worst buffet ever fiance got food poisoning and hour after eating there had to go to hospital. Than two weeks later a friend of mine also got sick after eating there also food wise poor quality and not work the price their is a Mexican buffet on monona Dr that is amazing called LA rosita so much better"}
{"text":"I went here with my wife, son and sister in law (btw if I could review my sister in law she would get 1 star) and the food was just not as good as I remember. I had been here about a year prior and the food was cold and tasteless. And the day after my sister in law got sick. I am not blaming this on them because I don't know but maybe. I don't think I'll stop by here again. The service is good and all the staff is really attentive."}
{"text":"dead on...meh, i've experienced better...best part of the evening playing with the food. scared the daughter with crawfish, convinced the son to eat escargot, then attempted to get both kids to kiss a giant shrimp with eyes. the husband says three stars, but honestly i don't think i'd eat at this joint again."}
{"text":"Ahhh my former coworker would drag me to this place all the time because he had the hots for one of the waitresses.  I'm not a big fan of buffets, I like my food hot, fresh, and made after I order it.  But I gotta say, this place is not bad at all.  I always try to make a game out of this place, gotta try to get my moneys worth!  Same goes to all buffets, I either get my moneys worth, or lose to the restaurant, and I don't like losing.  Daddy knows what to eat and what not too!  

We usually come for lunch, and the food is pretty good!  I love their mushrooms, and short ribs, and steaks, and wings, and the bak choy and dumplings.  I might get a few rolls, and tons of mussels.  Stay away from the rice and noodles, those are tricky food designed to fill you up!  Can't trick me!! 

The place is okay in cleanliness and the bathroom is uh okay.  The staff is friendly and attentive.  Overall a great place, and probably will be back in the future.  FYI I lost to this place every time.  Prices too high to win lol!!"}
{"text":"Best Chinese buffet in the West valley!!  That's it, the sum it up line.  I live in Surprise with several Chinese buffets and I rather commute to this one!  As good as a Chinese buffet can get! 

I always have fresh sushi here, fresh food, you can even have them cook a \"make your own bowl on a huge skillet.\"  I can't get dim sum items anywhere else in the valley except here, reminds me of going to the tea houses in San Fransisco with my mother when I was younger.

P.S. I take my mom here when she visits from San Fransisco, she loves it and thinks it very clean looking and fresh.  
Another personal note: my mother is Chinese, and grew up in China.  She loves this place.  

Hope that encourages you to try it,  I have been here more than a handful of times and my kids even love it.  They like picking from the variety of seafood, mac and cheese, pizza, pot stickers, fresh fruit, ice cream, sushi, and steamed items.

Hungry yet?!"}
{"text":"Ah...the mysteries of the Orient. So many mysterious cuisines and ingredients. The combinations of flavors and textures and the \"waste nothing\" approach to preparing food. You picture little Asian grandmas in the kitchen, meticulously tucking the pork and bean paste filling into each pork bun. You imagine them crafting hand made dumplings, egg-rolls and wontons. You think about a couple of middle aged Asian men busy stir frying ingredients in giant woks over hot stoves, wiping their brows as they furiously tend to their tasks.

That is not what happens here and I'm sorry to disappoint you.

If you have ever visited an Asian supermarket...check out the frozen section sometime. There is a vast selection of ready to microwave dumplings and pork buns and meats and vegetables of all kinds. There are egg-rolls and wontons and pot stickers and shrimp and octopus galore. Over in the condiments aisle, there's General Tso sauce in a bottle and Hoisin and Bibim Bap and Bulgoki and seafood sauce.

Throw the above items into a microwave/pot/oven/wok and then you place them on a buffet. That is the type of meal you'll get here- which is not to say that is is a bad meal at all, but you don't need an Asian grandma to make the treats being served on these steam tables because they have been manufactured by a machine, frozen and reheated for your dining pleasure.

Many Americans don't venture into an Asian supermarket and for those Americans, the bloom is not off of the rose. Me? I can't stay out of an Asian supermarket once I locate one, so the value for me here is that someone else prepares the food for me, does the dishes, and refills my drink. Although a piece of tuna sashimi was still mostly frozen, it was an OK place to chow.

Try eating the shrimp which are fried in their shells with the shell and the head still attached. They fight back a little as you chew them up, but they are far tastier. Try a snail with some of the dumpling sauce or hot mustard. Damn good. Do not let me see you put a slice of pizza or some mashed potatoes or french fries on your plate here. Do grab piece of fried chicken, however.

I've been lucky to have gorged myself at much better Asian buffets before, and I prefer the Hong Kong style (which this is not) but despite the 2.5 stars I'm giving World Buffet, I will return because this type of grub is hard to find in AZ. $15 per person ain't a bad price and that includes a soft drink and the all you can eat crab legs, oysters, sushi and sashimi."}
{"text":"We have eaten here once before a few years ago and decided to try it once again when the restaurant we wanted to go to was closed.

It was fairly clean, well decorated and had a reasonable number of entrees; unfortunately, that's about the best I can say for the place.  We tried a fair sampling of most of the food and nothing really stood out; in fact, most of it was pretty disappointing.  We were here during the lunch hour  so we figured the line would have been refreshed fairly frequently but everything tasted pretty tired. True - it's a buffet - and you shouldn't really expect a great deal in the way of innovation or flavor, but the World Buffet fell short of even average.  We won't return and I can't recommend it."}
{"text":"The walnut shrimp was my favorite item on the Buffet.  Also nice size tempura chicken pieces.  White rice also good."}
{"text":"I use to go here awhile back before I moved, I recently went here on the Memorial Day holiday; and it was the worst & last experience I will ever have with this restaurant. Everything and I mean everything was old, disgusting to say the least. The crab Rangoon was hard as a rock, the peanut butter chicken (my favorite) was hard, cold. Only small portions were in the trays, look liked they had been sitting out all day. Even as the crowd began to gather nothing changed, several complaints amongst customers in the dinning area, as well to the waiter/waitress and the cashier as well, nothing was offered in exchange in any of the complaints. The meal didn't agree with me and I left it in the restroom before I could pay & leave. I felt terrible for three days after eating here. 
This place has changed and definitely gone down hill, I would not recommend this place to anyone!
I was disappointed in my experience, the food, the complaints I over heard as well, but most of all the response to these complaints-treat your customers like family if you run a family establishment!"}
{"text":"Great buffet! Very clean and all! most of the food was fresh! but some I was a little disappointed. Overall great place!"}
{"text":"This place was disgusting !!! with a capital DIS the restaurant smell was unpleasant. the Service sucked  and none of the food was fresh it makes my stomach queeze"}
{"text":"In all fairness, I did not eat here.  However, I have parked in the parking lot and walked inside, and promptly left after the warm, stagnant seafood smell hit me.  I love buffets and have been to many buffets that included seafood, but I just couldn't bring myself to eat here. Sorry"}
{"text":"I expect a couple of things from a Chinese Buffet:

1. Clean - This buffet is ALWAYS immaculate
2. Good variety of food - Even when I was in my first trimester of my pregnancy I could always find something that I wanted to eat 
3. Food is rotated often, I always go for the same foods, which must be the most popular because every time I go back up for more food there is a new batch.
4. Good price - Can't beat the price here.

Overall, its a great China Buffet, I've been there more then a dozen times and will always be my first choice when I am looking for a buffet"}
{"text":"Two words....Not good. 
There are other much better and nicer buffets for the same price. I recommend you pass and go elsewhere...unless you like mediocre food that is either over heated or under heated."}
{"text":"The worst Chinese Buffet I have ever wasted my money on.Food tasted like it was sitting there since the night before.I told my wife \"Look around\" she said why honey? Take a good luck because this will be the last time you see this place."}
{"text":"World Buffet hands down in my opinion offers literally the best A. Bang for your dollar and B. The highest quality of options and food of any Asian style buffet around town. Always fresh, clean and great service. Highly recommend!"}
{"text":"Came here only because my friend wanted to go to a buffet. The food is crap, not one thing i had is decent. Even the fried chicken wings r disgusting... Like how can you make that wrong?? Anyways one thing I want to highlight is the sashimi... I attached a picture below but basically it looks like death X4... Would never return."}
{"text":"You go to World Buffet for the food, NOT the ambience.  The furniture show it's age (years worth of wear and tear) and the decor is very bland, with a 1980's feel to it.  (But they do have a cool large fish tank).

But the food is what's most important.  The buffet lunch has a nice selection, the salad bar is plentiful, and there are several options for soups and desserts.  All of the things I tried were good, but nothing was great.  It was a plus that although most of the food was Chinese, they did have some other alternatives (pizza, meatloaf, mashed potatoes and gravy).

This is not fine dining, but if you're looking for a filling lunch with a variety of good food for $10, this is the place to be.  And because of this, I was a satisfied customer."}
{"text":"I have to recalibrate.  I had thought any Chinese buffet is good anytime, because you can go around and pick away at stuff and get a wide range of interesting flavors and a bounty of varied nutrition, just by being selective.

This was before I went to this Chinese buffet at 4pm on a Tuesday.  That there were only a couple cars in the parking lot should have screamed 'Danger Will Robinson'  but I had a $1 Yelp coupon. 

4pm is \"dinner\", so it costs more than \"lunch\" but at 4pm what they do is scrape together what was left over from lunch in the trays into piles.  Isolated piles of things left over from lunch, and the heating pans can't keep things warm enough.

Still, the discerning pickmeister who is only interested in a few bites of wide-ranging and tasty nutrition has a chance, with the immense range of offerings at a place like this.  The green beans with onion were solid;  the hot&sour and egg drop soups were kept hot; the two sashimi offerings were very thin but very nice.

Everything else was questionable, to dubious, to atrocious.  A huge pile of crawfish looking red and glistening - - the worst crawfish I've ever had - - the meagre tails were dry, off-tasting and tough;  most of the entrees in the pans were not only way past their lunchtime prime, but were lukewarm and very, very tired after their long afternoon;  they had a huge roast beef looking thing but the colors were downright scary - - it looked horror show, really - -  so I didn't try it;   a blast of kimchi hopefully to live things up was old and room-temperature and just plain off;  the glop that they put in the hot stuffed mussels tasted especially gloppy,  and the pork dish tasted like, I'm sorry, like something from the hog's netherest regions.  Everything on the plate was extremely hit or miss - - the range running between somehow barely edible to badly, badly flawed.

Weird too, was being seated as the only person in one section directly across from the forlorn soup chef with nothing to do - - he was hunched in a chair directly across from me, and just stared at me as I was eating.

One bright moment was following a server just coming in from the kitchen and refreshing the fried fish tray  - - so by avoiding the one piece of fish left over from earlier, and taking a piece straight from the kitchen, this fried fish was zesty, tasty, lovely texture - - a real joy.  I tried following around the server when he came from the kitchen after that, but didn't have the same luck when he seemed to be basically just re-arranging the vegetable lo mein into a fresher-looking pile,  and although the new tray of peanut butter chicken did look fresh and hot,  we are still talking peanut butter chicken here.

So - - this is a general truth - - eat at places where the turnover is HIGH,  and they do each aspect of the offerings decidedly WELL - - and never go to a buffet when the parking lot is empty."}
{"text":"My wife was excited to read that this place had sushi.  I didn't look forward to going here as I'm neither a sushi fan nor much of a seafood fan.  I looked forward to there being a single dish made of chicken.

I arrived and not only found that this was one of the cleanest buffets that I've ever seen, but there was an incredible variety of dishes.  For very picky eaters like me there were a few American dishes like pizza, mac-and-cheese, and potato salad.  There was also lots of sushi to make my wife happy.  The price wasn't terrible at about $10.50 each.  Got water to drink and the waitress tried to charge us for soda but was very apologetic when we pointed out the mistake.

The one thing that disturbed me was the setup of the restroom and that someone sitting at a certain table or two could possibly look in through a briefly open door and see a man standing at a urinal.  There was a small metal wall, but I would've asked for more."}
{"text":"The food is ok. The service is ok too. Nothing really surprised me. I was eating mussels when I broke my tooth because of the sand. It was't cleans up enough. It was my first and last time and I don't recommend this place to anyone."}
{"text":"Standard Chinese American Buffet fare...

The staff is courteous and seems eager to please. The food is pretty much the same as you'll see at most buffets in Madison, just with a bit more selection.

The mongolian grill is solid, the general tso's chicken is the best I've had at a buffet - good chunks of quality chicken instead of the sauce and breading trying to hide gristly cuts.

Ultimately the rest of the \"Chinese\" dishes are not particularly good, but if you fill up on the solid salad bar, some sushi, the potstickers (very good), and other random items like fruit (large selection) and the very buttery garlic bread, you'll at least fill yourself up.

Lunch pricing with soft drink ends up being 11.33 after tax, which is barely worth it at lunch on a weekday. The dinner and weekend pricing is not worth the price"}
{"text":"Nice selection,  Mongolian grill was great. Clean and very good service, price was right."}
{"text":"8 people in our party Monday night- 12/28/15.
Quite a few common food items on the buffet were empty the whole hour we were there.
Sweet sour chicken and others empty.

Quite a disappointment -"}
{"text":"Another visit to Phoenix, and another visit to World Buffet, one of my nephew's favorite places to eat.  Again - good food, good service, clean, and pleasant."}
{"text":"Had the lunch menu, Most of the food is okay, some of it was dry from sitting longer than it should.

The staff was very friendly and helpful, made it a pleasant experience. 

Realizing when a buffet parking lot is empty the food suffers the dreaded time sitting and getting over cooked.

Desserts on the other hand were all fresh and tasted awesome.

Would recommend when it's busy so the food isn't sitting long periods of time.."}
{"text":"I love when the have pho, but they don't have it very often. Lots of choices, good food, typical Chinese buffet."}
{"text":"I stopped going to this place years ago. the food is horrible and the people are sooo rude. and the seafood made me sick. don't waste your time or money"}
{"text":"Blech. Sorry. I try to find one positive even with places I don't care for. The hostess was very sweet and friendly. I got food to go, but things needed to replenished at 6:30 and what we did try was mediocre at best. Won't be back."}
{"text":"I didn't go by any review. Food was good, service quick. Wait staff attentive and friendly.  Crab legs overcooked,  but what can you expect at a buffet? This is not Red Lobster! Soups are good and the selections are good. We will definitely be back."}
