{"text":"First time trying this place and last time I'll ever come here. Terrible service.   Ordered shallot chicken and gang jeong. Received gang jeong and crispy original chicken. Went to the counter to ask if they gave us the wrong order. Person working the counter tells me it's original chicken. I tell them we had order shallot chicken. Person finds our order in the pile of receipts in front of her and tells me she would not have put the order for shallot chicken through because they were sold out of shallot chicken and we must have ordered the original crispy chicken. My fiancée then called them out and said we had paid them for the shallot chicken. The cashier then gives us $2 back and doesn't even apologize.   DON'T lie to your customers."}
{"text":"We seem to be on a fried chicken binge lately.  We only tried the regular chicken, versus any Korean flavoured chicken- comparable, if not just a notch better, against Popeyes chicken.  The fries were better than Popeyes, and the bulgogi fries were a nice alternative to add some sweet BBQ flavour to the fries.  The wait was a bit long, but we did order all drumsticks, so we knew they were freshly cooked - another comparison to Popeyes, where the chicken sits under a warmer (likely due to high volumes of orders).  4 stars because my kid ate a lot of food here- but still prefers Cluck and Cleaver."}
{"text":"I went to Wow chicken in Chinatown to get a snack for my son and I after school. It is my first time, the menu was good, simple. I ordered the 5 pieces of chicken breasts deep fried with a side of soy garlic and a side of small fries. Service was good, and food was fast, within 10 minutes. The food was very good, the fries were battered, and everything was good, I will be back when I'm craving some WOW chicken, next time I will have the sauce mixed already. Giving it more of an Asian feel and crispy. Do try it for yourself!"}
{"text":"I mean, I know not a ton of people want to go for lunch at 11, but today I just happened to want to eat at 11:20, and it was a slight bummer that they didn't open till 11:30 - but I digress, the fresh air was probably good for me.   I didn't even know this place existed until I walked by it today (I was actually planning to go to Quickly for lunch, which didn't open till 12PM unfortunately...). It had been a while since I had fried chicken, especially \"Korean style\" fried chicken, so my friend and I figured why not.   Wow chicken is really almost a nicer fast food joint - order at the counter and they'll bring you the food. The menu is pretty good - for a $10 lunch, 4 pieces with sides, its not a bad deal. They have a lot of different flavours of fried chicken - I tried the Scallion Fried Chicken (Half a chicken, $16), with bulgogi fries. I also had a piece of my friends soy garlic fried chicken.   The chicken itself is done very well - the batter is crispy without being too greasy, and the chicken is tender - even the breast wasn't dry. However, I don't think this \"scallion mustard sauce\" that I had on the side was inspiring at all - not only was it difficult to eat the long strands of green onion together with the chicken, there wasn't really a flavourful sauce to speak of - in fact there wasn't any additional flavor at all, so I think this scallion combo was definitely a miss. However, trying the soy garlic flavor was delicious - a great combo of sweet, soy, and not too sticky. I would definitely get that next time.   The fries were actually really good - the bulgogi fries turned out to be just a flavouring powder for the fries, and was pretty yummy. Generally fries can be hit and miss, but these fries were done very well.  Overall, for $23, it's a bit pricey for 5 pcs of chicken and a small fries, but I'd definitely come again for the lunch special.   And the Décor? Well, of course theres Kpop on in the background, but the sitting area is very nice - doesn't feel cheap at all."}
{"text":"Ordinary Korean resto. Over rated. Service is not existent. Will not come back. Very disappointing."}
{"text":"Good crispy chicken bits.  Ordered the Gang Jeon chicken bits sweet.  Loved the crispness. Wish it was a little more sour.    It very good over all"}
{"text":"Seriously Terrible customer service. No concept of taking phone orders  short and curt Not coming back."}
{"text":"We stumbled across this place just a few spots down from Quickly. For whatever reason, Quickly was closed and does not open until 3pm on certain weekdays. I'm glad we tried this place out though. The Korean fried chicken was juicy and tender. Not too greasy and the batter was well seasoned. The bulgogi seasoned fries were a nice touch. Service was OK."}
