{"text":"I am a regular here. Tonight I had chicken souvlaki wrap it was delicious as always. They man who served me was very friendly  and entertaining. I will be going back and I would recommend this place to everyone."}
{"text":"Have been wanting to write a review for weeks now and finally will do so now! Would like to give a 5 star rating to this place. We have had the wraps from Wraps On The Go from a different location on different occasions and loved them.  We decided to order trays for our casual wedding rehearsal party for July 15th, 2016. The owner was very friendly and worked with us to make sure we had everything we wanted.  The wraps were delivered at a timely manner, were very fresh, and all trays (2 large trays of wraps, a fruit/cheese tray, and a dessert tray) were all very beautifully presented. Everyone very much enjoyed the wraps and the rest of the food! The owner delivered our food himself and refused to take a tip! Thank you so much for catering our wedding rehearsal dinner! Everything was wonderful and just as we wanted it to be.  Highly recommend this place."}
{"text":"This place is perfect for a quick grab of lunch. All the wrap filler is fresh and prepared in front of you. It's reasonably priced and the staff are friendly.   Sometimes there are line ups at peak hours but nothing drastic. The location is a bit hidden as it's downstairs into basement level but it has an atm nearby and direct access to the bay subway station.  The building has been recently renovated and the outside seating (across from the shop) has been put back but numbers around 6 tables for 2.   As I said before these guys are quick, cheap and offer good quality food. Their range is decent enough for a wraps speciality place...the lentil soup is a particular favourite if mine.   I have also experience with 'wraps on the go' as a catering company as our office near by uses them quite a lot and we have been nothing but impressed with their service. We've given them very short notice for orders (morning of) and they have always come through for us. Their food is always fresh and well presented. they also have a small but growing hot food options. Which are well made and tasty.   I can't speak highly enough of this business! Very customer orientated, friendly, good food and well priced. They are not suited for big sit down groups but seating is available."}
{"text":"It's a hidden place underground outside west Bay Station subway exit.  In a pricey part of town you can get a decent breakfast or lunch here without breaking the bank.  The proprietors are friendly and the bagels bigger, softer and better than stuff you would get at Tim Horton's or MacDonalds.  A buttered bagel with medium coffee would run you about $1.99 plus tax in the morning.  If all you're looking for is a simple sandwich/salad/wrap for breakfast or lunch, this is a good option."}
{"text":"I'm not sure if I just had a one off bad experience or if everyone else is accustomed to different chicken shawarma because the ratings here lie. Last time I checked, my chicken shawarma was being roasted fresh on the spitter and didn't have to be warmed up in a microwave. I also get a lot more meat in my wraps, not just a small Tupperware sauce-sized amount. Also, my chicken shawarmas don't usually taste like plastic and limp cheese. I'm super disappointed with this place. The man who served me highly suggested the chicken shawarma, so if this is their best wrap it won't get better than what I tried. I didn't even want to feed my son the chicken or any vegetables from the wrap. I took two bites of it and had to throw it away because it just didn't taste flavourful or fresh at all. The turnip was soggy and not crunchy and the onions tasted rubbery.   I love wraps but I won't be coming back here again. This was money wasted IMO."}
{"text":"Have been coming here for lunch for 8 years. The food is fresh, made-to-order, fast, and great value. Roger, Dane, their mother, and the rest of their crew take great care to make custom wraps. Personal favourites are the chicken shwarma and seafood specials - a total steal! My other half loves the ribfest wrap with extra sauce. And they have the coolest to-go packaging that snaps open for a mess-less lunch. Also have salads, snacks, fruit, catering, but I love the wraps. The move earlier this year to their new location provides an even more convenient and updated space."}
{"text":"The staff is incredibly sweet, fast and polite. They have a decent selection of wraps and salads. On the side they always have fresh fruit and berries for a reasonable price as well as other treats (their brownies are delicious!). Not a go to restaurant kinda deal as the name inclines but an amazing lunch."}
{"text":"There are a lot of wrap places but in a food court where at 8am there are few choices  But it's the right choice  They take a fresh bagel and toast it and then using a fry pan like you would do at home make a scrambled egg  Add lettuce and 2 tomato slices (not one like elsewhere) some mayo and catsup and voila the breakfast classic   Handmade and home made goodness   No wonder people line up for generous wraps (they have broccoli and carrots) to have made to tuck into later for lunch"}
{"text":"I don't recommend this place, food is not fresh..Or should i say fresh from the microwave! I saw the lady microwaving all the food..might as well bring my own lunch. I have no idea when did they cooked their food.. food inspection should   be done in this place!"}
{"text":"3.5 stars  This place looks like any other fast food restaurant but their wraps are pretty damn tasty. It also makes a very affordable meal at less than $10 including tax. The ordering process is very similar to a subway, you choose the pita (white or brown), the veggies and the sauces to go on top.   The veggies are always fresh and they will stuff plenty of them in your wrap. One thing I was disappointed about was the meat. Unlike other shawarma places where you get fresh rotisserie meat off the spit, the meat here is pre-cooked. However, when I had my souvlaki it all tasted just fine...the chicken was surprisingly moist. They have a few different sauces and those are really delicious! The no-drip wrapping for their pitas is an added bonus to prevent things from getting really messy.  What's more to say, they have around 22 different options...about 3-4 of which are vegetarian. They even have breakfast pitas. Oh, and the owner is quite friendly and has a good sense of humour! This will definitely be one my top places for a quick and satisfying bite."}
{"text":"Can't believe I haven't reviewed this place yet as I've been here dozens of times.  Working in Yorkville has it's downsides, one being there are few cheap lunch options.   This place (formally Mega Wraps) is one of the only places to get lunch for under $10 nearby my office.  The staff here are all incredibly friendly, especially to their regulars. They will stuff your wrap with anything and everything you want, the veggies are varied and always fresh.  I normally get a large Greek salad with chicken souvlaki on top and a side of tzatziki. The tzatziki at this place is like crack, it's seriously addicting."}
{"text":"Great spot for lunch. I ordered take out via Ritual and it was my first time. Service was great, the worker (owner?) walked me through how Ritual works at his place and even gave me suggestions for toppings the next time I order. I love when people do this because I always want to try every topping and sauce, even if the flavours don't go well together. Great value for the price, the wraps are huge and taste much better than Pita Express."}
