{"text":"XO Ice-Cream and Waffles is now open and is so close to my house so you can believe I am so excited! This is a handmade ice-cream shop that you do not have to go downtown for! It is right in deep SE  Calgary! Located in Auburn Bay, the shop offers unique flavours as well as beloved classics and seasonal delights.  The menu features a selection of oh-so-unforgettable ice cream and sorbets, fluffy waffles and unique sundaes, all made fresh on site. On top of beloved classic flavours, they have seasonal delights on rotation. Some of the ice cream flavours they have are: 

- Vanilla Bean: I have had this one and its good but typical

- Chocolate: I have had this one and it is also good but again, typical! 

- Salted Caramel: I have had this one and it is really good and becoming more popular across ice-cream shops. The first time I had this flavour was at village ice-cream. 

- Strawberry Rhubarb:

- Mint Chocolate Chip: 

- Coconut:

- Pistachio:

- Blackberry Lavender:

- Vanilla Waffle: I have had this one and loved it 

- Earl Grey: I have had this one and again this flavor is full of earl grey flavour which is amazing because it is better to be loaded with flavour then just a hint! 

- Mango Sorbet:

- Blood Orange Sorbet:

- Espresso: I am not a fan of coffee so to be honest I will probably never be able to try this one to tell you what it tastes like because even if it was good to the coffee lover it would probably taste bad to me since I am not a coffee lover and prefer tea- hence why i love their earl grey ice cream. 

- Cookies and Cream: I have had this flavour and it was really good! 

- S'mores:

- Elderflower Lemon Zest: I had this one on Wednesday June 27th, 2018 and I loved  that when I walked in there it smelled immediately like lemons. Then when I looked into the kitchen all you could see was buckets and buckets of lemons which was amazing to know it was fresh. I was a little disappointed when I asked the lady working the till what elderflower was and she couldn't tell me. However, this one was very good and different but a little too lemon zesty for me especially when you are eating chunks of it. 

- Raspberry Rose Sorbet:

The owners favourite flavour is coconut! 

The waffle flavours they have are: 

- Classic Sugar:

- Churro:

- Chocolate Chip:

(All come with a yummy chocolate dip)

I haven't had any of the waffles yet but I really want to and I am very excited to try! 

They also have waffle pops: 

- The Party (White Chocolate and Sprinkles): 

- The Nutty (Chocolate, Almonds, Coconut and Caramel Drizzle):

- The Berry (Whipped Cream, Strawberries and Chocolate Drizzle): 

Or you can get a sundae that combines the waffles and ice cream together! Choose any flavour of ice cream for this unique sundae that combines the best of both worlds! I haven't had this yet either and probably will not only because I want to try the homemade ice cream and waffles separately!"}
{"text":"Local hard serve ice cream for SE Calgary in community of Auburn Bay. 

Small store but serves great delicious yummy old school hard ice cream. 

Waffle cones are tasty and I had the chocolate mint and it was top notch.

Been here once and left very impressed. Staff are helpful with samples and payment was simple. 

Overall we have local ice cream for SE Calgary. Support local!"}
{"text":"Nice choices, great tasting, family run and all of it made in house! Including the cones. Worth a visit."}
