{"text":"It pains me to give this place a two star review. I have lived in the neighbourhood for a little over two years now and have been longing for a pizza place that is closer than Martino's on Dupont. I was very excited when Yeah Yeah's opened - I love a great NY pie, AND they claimed to be offering some East Coast stuff as well (e.g. donair sauce).   My initial experiences were fantastic. If those had continued, I would be rating this place a 4 at a minimum, possibly a five. The pizza here was an excellent example of something close to NY style and used quality ingredients. I was immediately impressed by the pepperoni (little cups of heaven - incredible balance of savoury and salty, featuring little puddles of rendered fat in each one), smoked bacon (real smoked bacon with the right amount of fat), and charred green onions (delicious and innovative feature on white pizzas). The right balance struck between cheese/sauce/dough, which is a challenge for NY style - it is supposed to be light, with some chew, and neither too wet (should be foldable without falling apart) nor too dry. They were also very generous with the portions of toppings - the pepperoni pie truly was a pepperoni pie, just a thing of beauty.   I have tried every kind of slice they offer, as well as some of the unique weekly features (mixed bag, but some definitely delivered). The pepperoni and the white are the highlights for slices. I also have ordered full pies, which were excellent until recently. Have not had a chance to try the garlic finger pizza. The East Coast donair sauce is okay - the balance is a bit off, with it being too sweet, even for the style, with not enough depth from an acid.  Anyway, now the sad part. Went to order a pizza yesterday, my standard - pepperoni and bacon. Noticed the prices had increased. Note that the current prices shown at https://www.yeahyeahspizza.com/toronto/ are incorrect - they were the initial prices when it opened.   The initial prices were totally fair. It is disappointing that a place increases their prices only a few months after opening - it carries with it a stink of trying to attract people and then jack up the price. You should just be honest and price it that way from the beginning. Anyway, this in itself isn't a kiss of death - if the food still measures up to the price, I can live with it. Unfortunately, that isn't the case.   It seems that the restaurant simultaneously increased the prices while decreasing the quality. My pepperoni and bacon pie, while costing more, was no longer the beautiful pie it used to be. The amount of pepperoni was less than HALF of what it was previously, and the smoked bacon was similarly reduced. What used to be a field of delicious meat was reduced to a sparse sprinkling. Further, the pie was dry - the balance of my previous pies was nowhere to be found. Looking at it, it was clear that it had less sauce and cheese compared to before. Just so disappointing.   After looking at the new prices, I think they have started a new two-tiered system for pricing. The pepperoni pizza, which is now $24.75 ($3 more than before), must be the only one that includes the correct amount of pepperoni anymore. If you order pepperoni on a build your own pizza, I guess you now just get half the amount. Which isn't communicated on the menu, and is honestly a pretty cheap move. Terrible business practice all around.   I might try to order one of the \"souped up\" pepperoni pies, and add bacon to it (bringing the total to $26.75 plus tax, which is really hard to stomach), but the cutting back of the cheese and sauce will likely still make it a bust.   Seems like another instance of the tried and true story of a greedy restaurant owner. Open up with good product and fair prices, and then once you gain some popularity and trust from your market, increase the prices, start nickel and dining with the menu (charging premiums for what was standard before), and reduce the quantity of ingredients to increase margins. Like, come on - I can maybe accept one of these, but all three? Get out of here."}
{"text":"If you're from the east coast trying to get your garlic finger fix .. don't bother it's nothing compared to it specially for $17. Didn't try anything else from the menu but I'm sure everything else is great! Just specific expectations .."}
{"text":"Ordered a margarita pizza (lots of basil) and a meat lovers to go( a hint of chilli)Pizzas had a nice thin crust and lots of flavour.  You could tell the pizzas were handmade by someone who cared about what they were doing.   The place has a cool vibe, more like parkdale or queen west. At least 5 + tables.  Guys behind the counter were clean and friendly."}
{"text":"Perfect place for a quick and easy lunch. Pizza has a thin crust and simple but good ingredients. They always have a featured pizza too."}
{"text":"Great addition to Toronto. Original location in Dartmouth. Pizza is similar to NY style, nice and thin. Great interior, the pizza Slice wall a nice touch. Alongside boxcar (next door) a good reason to venture north of Bloor st!"}
{"text":"Really good pizza by the slice. Tried the Boss, Pepperoni and the POW (pizza of the week) which was a white pie with thinly sliced potato. All were very impressive. Perfect thickness and crust."}
{"text":"Yeahyeah, love me some Yeahyeahs!!! This is pizza worth trekking to Summerhill for. There's a nostalgic feel to it somehow. I feel like the crust is how my senses remember pizza from when I was growing up, and getting pizza was the ultimate special dinner. The pepperoni pizza has those real deal pepperonis that are smaller and curl up, crisping at the edges in the heat of the oven. I love everything about this pizza and can't wait to try more toppings. Also - they have donair sauce, and it is sooooooo gooooood. I ordered it with a slice for takeout, and the donair sauce they served me was cold , which I wasn't thrilled with. I don't know if they always serve it cold, or if it was just that counter person, or just for takeout? Anyways, even cold, it was INCREDIBLE stuff. I was eating it like, this is cold, why... well even cold its still kinda good... holy crap this is good.... I love this and I don't even care anymore that it's cold. I had a little left after my slice was gone and I brought it home and ate it with pita bread. DELICIOUS. Get yourself some and enjoy. ;)"}
{"text":"Ordered a pepperoni pizza. Extremely disappointed. It was very dry, salty and thin. Little cheese and hardly any toppings. Not a great choice for the price of the pizza."}
{"text":"I had lunch today at Yeah Yeahs Pizza.  I had read about it recently on Blog TO about how it \"comes to us from Nova Scotia\".  I love love love pizza and I'm originally from Nova Scotia so I thought I'd check it out.  I had a slice of The Meat pizza.  I was still hungry so had a slice of The Pepperoni.  The crust was really light and chewy.  I couldn't really taste the tomato sauce.  There was a lot of meat on The Pepperoni but it didn't have a strong flavour, which was surprising considering it was a pepperoni slice. They were both fresh out of the oven.  I'll go back to check it out."}
{"text":"Gone downhill since opened. Overly salty. Not a lot of flavor. Nice sized pie but was there even sauce on it? All I could taste was salt."}
{"text":"i tried the Margarita today. it was very good.   the crust, the most important part for true pizza fans, was chewy and flavorful. everything else was well-balanced. this is a solid pizza place."}
