{"text":"Worst place to eat. To begin with the food sits there all getting cold and when you order all you get is warm food not even hot. Also the Hispanic guy that works there as a sales manager is extremely racist he refuse to serve me because he said he didn't want my kind of People there. I would never go there and I recommend no one else bothers going there service is bad, People are rude food is cold. He said he could careless if I or anyone else goes there because he still gets payed. The other ladies the said nothing to try to correct the situation"}
{"text":"Friendly service. Chicken was rock hard, and over cooked. The lo mein was flavorless, and boiled,  not fried. The steamed veggies were not cooked all the was through."}
{"text":"Pretty gross orange chicken which I am still debating whether it was actually chicken. Other stuff was very mediocre at best. Cheap but not worth the damage. Hit up something else in the food court and save your taste buds."}
{"text":"This place has delicious food! At least what I get! I love the fact that the chicken is real! I am very picky about the food I eat. The employees there are always pleasant. No over the top friendliness or smiles, but never funky or bad attitudes. I ordered tyre 2 messy entree. It it's like $7 and some change. Give them a shot! You will enjoy it!"}
{"text":"First time trying this place. Stopped in for a quick lunch while at a conference. They are located in the food court inside Northlake Mall. I ordered the fried rice combo with orange chicken and bourbon chicken. Got to the register to pay and they don't have ANY soy or duck sauce. Lady says they haven't received their delivery yet. I wish I'd known this prior to ordering and I believe that they deliberately don't tell customers because once you pay its too late. The orange chicken was too sweet and the bourbon chicken was just ok. There were some really dried up pieces in the mix. Probably left over from yesterday.  Really wanted some soy and duck sauce. Would have helped with the taste. I prolly won't return."}
{"text":"Well, after having a pretty terrible experience at Maki of Japan at the northlake food court, I was eager to try Yeung's to see if their Asian food is any better. Better, yes, is it much better no?
I got the singapore noodle and the lo-mein. The lo-mein tasted like soy sauce, the flavor was not impressive. THe singapore noodle while greasy lacks salt, i was seriously about to walk back and get a couple packets of salt for my noodle. The price  here is $6.10 for a 1 entree with 1 side plate. Spring rolls are $1.32...Soups are like $1.50. The price is not bad, not much different than Maki. They accept credit card but not American express."}
{"text":"In todays trip my friend and i stop shopping at concord mills

First for lunch in Popeyes

And diner was Chinese 
Lotus express

Was good price buy one get 2 nd 1/2 price

Was great taste to be fast food chain

Thanks again guy keep it up"}
{"text":"First of all, I have no idea who Yeung is. Then again, I don't know who Leng is either. Hey, I don't even know who McDonald was. But I like all of them. But I'd put Mr. Leng in front of Mr. Yeung if I had to compare them. Well, they used to be good. Their General T'sao and Lo Mein-ish noodle was really good.

Now, the noodle's drier and the chicken is just too sweet/spicy. But it's still ok. The location isn't the best though. Do keep in mind that this is inside a mall. One is in Northlake Mall and the other is in Concord Mills mall. The one at Northlake is in a fairly okay food court. But the Concord Mills food court can get a bit weird. IDK. Anyway, it's good enough to go try it."}
{"text":"Good stuff, located in Charlotte Northlake Mall. Quick service, food was good. 2 meats one side, especially impressed that Singapore noodles was a choice! General tso was a little too breaded but other than that it was good"}
{"text":"Raw! Every piece of chicken I tried to eat was raw. The flavor of the broccoli was good which is the only reason they aren't getting one star. Unfortunately I got the food to go so when I got home I only have 2/3 of my dinner to eat. Disappointed"}
{"text":"The General Tso chicken was good and the crab ragoons were great."}
