{"text":"Stars way down. I forgot how awful the service is here and went back again today. The food is still OK but the service has probably gotten worse. The women behind the counter seemed to be asleep on their feet and said as little as possible to me."}
{"text":"Greek salad with chicken kabob was very good. Spanakopita was delicious  - be sure to ask for it to be warmed a bit!!"}
{"text":"Excellent food and pretty good service.

Been going there for over a year now, and I must say, I've yet to try anything there that I didn't like.

My only minor gripe about them is when you order something that includes a salad and you agree to have what they refer to as \"everything\" on the salad, they only put a few things on. I feel it a bit much to specify each topping when I literally do want everything they have on my salad :-/

Regardless, I'd definitely recommend 'em for lunch, never tried 'em for breakfast. Just beware of their menu, as they don't quite have everything on it, so updating it would be nice too :-)"}
{"text":"Down in the GTA. Felt like a farmers market downtown. Got up early and wanted a good breakfast. Got coffee and stopped by yiannis kitchen for an eggs benedict breakfast. $6.95 for a big plate. Sorry no picture to show except a clean plate."}
{"text":"I've only tried their vegan grilled vegetable pita, but for the price ($5.95 incl tax) it is pretty filling and yummy. The vegetables (beware: lots of onions) are sauteed in quite a bit of oil, then wrapped simply within a white pita, which they grill/warm for you right before giving it to you. My main complaint is that the pita is soggy from the water from the veggies and oil. I wish they roasted the veggies instead to reduce the sogginess and also use less oil.

Other vegan options include a vegetable platter, featuring potatoes, rice, and a salad. The soups are usually not vegan (contains dairy), so double check if you have intolerance."}
{"text":"Bad service, bad quality of food and bad attitude.

Avoid this place as much as possible. The old geezer cook did not even know how to cook a proper sunny side egg - burned on the bottom and raw mucus egg white on the top is not it.
Not to mention the female cashier had an attitude to boot."}
{"text":"I've walked past this place a hundred times on my Saturday morning visits to St. Lawrence Market.  This day, I needed a bit of breakfast to tide me over for several hours.  I noticed that the menu had Eggs Benedict, so I was hooked.  What could be better?  A poached egg on a slice of ham and half English muffin with some hollandaise, that would a great deal for $6.50.  Surely you can't expect more, after all, that's the price of a McD Egg McMuffin meal.

Not what I expected!  There were 3 (three!) poached eggs on 2 half muffins, with a generous blanket of hollandaise, and home fries on the side.  Instead of a slice of ham, or even pea meal bacon, this version was on a bed of breakfast sausages sliced in half.  Comparing to my usual reference eggs benny at fine hotels, this was a total head shaker.  At the Hilton, I can have 2 eggs for $14.  Yianni is an incredible deal in comparison!

The only discontinuity is that the hollandaise was not fresh, rather it was made from a preparation or powder.  But for $6.50, I have absolutely no right to complain!  This is a fresh, generous meal with a stunningly low price."}
{"text":"I have been coming here for many years for their beef gryo on a pita. Lots of meat and full of flavour. The service is not bad. I am confused with the other comments about rude service as i have never had that issue. It's a take-out place. So the 30 seconds of service you get is not a big deal. Lunch time is about choose, pay, find a seat and enjoy. 
But you have to go at lunch time when the pita is fresh and the meat is moist. Else the pita might be dry and better to get a gyro plate instead."}
{"text":"Searching through the depths of St Lawrence Market for something I was interested in eating, I came across Yianni's. There was a line up so this seems popular with regulars. I ordered a custom omelette without issue for a total of $5.93. It is cash only, and they let me know where the nearby ATM was located. Food is alright. Nothing to get excited about but it did the job and I would go back."}
{"text":"In favour of trimming the fat, I've cut out Mustachio's for the time being, so I thought I'd give their neighbour a try and order a salad.  I'm sorry I did.  The guy taking our order was rude.  Okay, fine... I only interacted with him for like a minute, but come on.  A little civility goes a long way.  And it's not like it was even busy, certainly not busy enough to merit him yelling \"who's next, who's next\" in our faces as we glanced at the menu when we were the only ones standing there.  The only saving grace was the girl at the cash who was quite pleasant.

The Greek salad with chicken was drenched in a gross dressing.  The chicken was dry and tough.  Roughly about 30 minutes after eating this lackluster salad, I got the sweats and felt like I was going to throw up.  Without getting into gory detail, let's say that lunch was on borrowed time.  I've got a pretty iron stomach, but something was definitely rotten in the state of Denmark.  I suppose the only credit I can give them is for that relief, much thanks!  Having parted with my lunch, I felt better and I know now never to return to Yianni's."}
{"text":"I ate here without reading reviews, thankfully, because I enjoyed my lunch! Not much to say... you walk up to the counter, order your food, then pay. So I'm not sure how service can be so bad for some people! I had a chicken souvlaki sandwich- the chicken was taken right off a skewer, and it was marinated & cooked very well. The pita was also delicious, and held up well to the generous amounts of chicken and veggies. As a quick lunch, I really enjoyed it!"}
{"text":"We ordered gyros and a Greek salad with chicken.  The chicken on my Greek salad was a little dry.  The gyros tasted okay.  I would have liked a little more meat in the gyro.  But overall, the lunch was okay."}
{"text":"Had a Greek omelette with Greek potatoes here for brunch on Saturday. The omelette was slightly lacking in vegetables and didn't have the best texture, but it was otherwise good. I enjoyed the Greek potatoes on the side!

My biggest complaint: the lack of tables at the St. Lawrence Market!"}
{"text":"Gyro and the burgers are in a perfect portion for a quick lunch!!!
The spanakopita is NOT fresh!!! They come in as frozen dish and you can tell it's not fresh by the crispiness of the pastry......not so much!"}
{"text":"English breakfast for $6.30. And its so good and so filling. 3 eggs, lots of toasts, and your choice of bacon, ham, or sausage. They have deserts too. I tried the baklava, not a fan but it did compliment my breakfast."}
