{"text":"Had the spinach baked with sole in white cream sauce today, it was good. Not too creamy and not too runny. Everything was fine. I also tried their HK coffee and tea mix, it was the usual. Not a bad place to go to for tea restaurant, and its close by and not too expensive as well."}
{"text":"Got the preserved egg and lean pork congee set (comes with the congee, plain rice noodle roll and deep fried dough stick) for $5.50. Big bowl of congee. Fairly good on the toppings. A tad salty. The rice noodle roll was fresh and the proper consistency, but didn't have the sesame sauce. The deep fried dough stick was the best one I've had in a really long time. It was super crispy without being hard and crunchy, and the inside was moist, but I didn't have to spend a lot of time chewing to bite a chunk off. If I wasn't as health conscious, I would have ordered another. 

My brother got the cutlet pork with rice. He picked tomato sauce, although he could have picked from black pepper sauce and probably things like onion sauce or gravy as well. The tomato sauce has real tomatoes in it. The cutlet pork was nice and crispy while staying tender on the inside. There was a good amount of cutlet pork and there was a lot of rice. This one was $5.99 and came with a cup of soy milk. The soy milk was pretty good too. It was Chinese style soy milk, and it wasn't super watered down. I emphasize the Chinese style in the soy milk not to be super obvious, but because I've had Chinese restaurants serve me Western style vanilla flavored soy milk and I almost cried because of it. If I'm at a Chinese place, I want Chinese soy milk. Thanks."}
{"text":"Chinese food court.
This place was hammering out takeout orders like no tomorrow. Customers must have called in advance and made their orders because people would just pay and take 2-3 bag full of food to go. This made the wait time for my food take about 10-15 minutes.

Ordered a fried udon noodle with beef $7.50 tax in. Portions were filling. Tasted good and had a decent amount of beef. Comes with a soya drink.

Can't go wrong with cheap, filling Chinese food. Next time I would call to make order in advance."}
{"text":"Yogi's Noodle has been inside the Chartwell Shopping Centre food court for as long as I remember.  Serving classic HK style fare such as baked and fried rice, stir fried and soup noodles, the list goes on and on.  

It's been a while since I've eaten here as my go to place is Hong Kong Style Tea and Fast Food a couple of kiosks down.

Food is pretty solid here.  Food comes out quick and hot.  Today I ordered the Baked Fried Fish Fillet with a Spinach White Cream Sauce on Rice and it quite good.  Still prefer the food at HK Tea and Fast Food but there is a lot more variety at Yogi's.

Service was very good and polite. They can be very busy during lunch and dinner rush but they do take call ins.  

Good job!"}
{"text":"Maybe they had an off day or I am expecting too much. ..  I asked them what dish was quick and fast.  So Hainan chicken it would be.   15 min later, the dish was presented.  The rice was plentiful but overly oily and tasteless.  The chicken was half of a leg quarter... wtf?  I know prices have gone up but not by that much for you to cut back THAT much.   Anyways.  The chicken was the tofu North American breed, very well done and void of any flavor(s).   The soy milk had more flavor than the 2.   I will pass on this place going forward as there are other selections beside that cater more for my taste."}
{"text":"Quick, Fast, Cheap!

Sometimes that's what one needs. Yogi's Noodle located in the food court of Chartwell Centre.

Lunch Specials? Afternoon Tea set?

Beef Ball Noodle with Drink ($4.50) though is on the smallish side but great if you want a snack. 

A lot of choices to choose from. There's a reason that it still in business after all these years!"}
