{"text":"1. Maki set
The maki sets contain large rolls but the rolls are similar so it almost feels like you ordered one type of roll. 

2. Sashimi boat
- Each piece was thick and evenly sliced 

Service
Great staff 

Decor
There are individual rooms with curtains or tables in the main dining area. 

They take reservations but we've never had to wait. The location is not the best but there is lots of parking."}
{"text":"It went downhill quite a bit over the last year, it's just a generic Korean owned Japanese restaurant now. Some sushi items are pretty good, but nothing amazing. Some, like the spider roll, are just plain terrible."}
{"text":"This place has great service. Fast and super duper friendly, I don't know how one could keep up that cheery demeanor for a whole waiting shift. 

The food here is pretty decent (well at least the bento teriyaki combo I ordered). Not super cheap (9-12$ for lunch combos) but pretty standard pricing for this sort of place.  I haven't tried the sushi yet, but it looks good.  I will update this review when I have more deets!

The atmosphere is more old school Japanese restaurant vibe rather than hip and modern Chinese sushi shop decor like at downtown-ish locales. 

There were surprisingly quite a few people inside at lunch time even though this place is tucked away in the middle of nowhere. I guess it is popular with the business lunch crowd. 

There are a bunch of lunch combos with some Korean items in them. I would go back, its just a bit out of the way for most people."}
{"text":"Good fresh sushi in North York. Huge menu with lots of choices. Usually fairly quiet at lunch during the week so a good choice for a business lunch. Prices are reasonable."}
{"text":"Yoko is the one restaurant I go to if I'm looking for consistency. I love their staff and service (although it can get quite busy on holidays and weekends), the atmosphere is simple and homey, the food is always great."}
{"text":"This is my new go-to sushi place as they have gotten better over the years and the service has always been great. Excellent variety of food and sushi and the space is cozy but inviting. The chicken katsu is great but they are most well known for their green dragon."}
{"text":"I have been going to Yoko for a while. Recently the power was out all over because of a bad storm and I went to see if they were opened.  They had candles on all the tables and said they could still serve us the whole menu.  Their debit machine was out because of the power and they insisted we stay and pay them next time. I was very impressed, the staff here are amazing and SUPER friendly.

I since have started to go back for lunch and the lunch specials are an amazing deal and the portion sizes are GREAT.

Highly recommend this place.  Since the service they gave during the power outage I have become a regular customer and would recommend to all my friends. Can't say enough good things about the staff here! :)"}
{"text":"Great atomosphere, and great staff. A fun place for one or a group with cool booths that is sectioned off for larger parties. Sushi is incredible with a huge variety to choose from. The portions are pretty big so there is always some to take home. I highly recommend this spot  even if it's just for take-out at lunch!"}
{"text":"Yoko is near my workplace and occasionally a few of us venture over ther for Friday lunch.
The food is decent. I've never been overly disappointed but certainly not wow-ed by the place.
Yes, the decor leaves much to be desired but the staff are friendly, if not a tad on the slow side service-wise. 
It's an A ok place to grab some sushi. Prices are comparable."}
{"text":"Terrible. Just don't. The service is bad, food is worse, and priced well above what other (better) places charge. I ordered a simple tuna roll and they served me salmon. When I asked the server if it was tuna she didn't know ... And after she took it back another woman came to my table and asked me if I ordered tuna (yes) then another 10 minute wait to fix it. Also I think that if you pay $15 for two small rolls it isn't unreasonable to expect more than 2 pieces of ginger and less than a dime size of wasabi. I would have asked for more if anyone had come back to my table. I finished and waited then gave up and went to the front to ask for my bill. 

Go somewhere, anywhere, else."}
{"text":"Went here for my dads birthday, and there is literally nothing bad i can say about this place. From walking in, we were grreeted by literally all the staff smiling at us and the venue is absolutely adorable. Its cozy and welcoming, not to mention totally authentic, I felt completely transported. There is SUCH a large variety of foods, the onlt problem with this place is that you dont know what to eat because everything looks so good! The food was AMAZING. I've always been such a food food critic when it comes to japanese cuisine, but this place is definately on the top of my list. The sushi is to die for, we ordered an extra plate (even thought we wouldnt eat it) JUST so we could take it home!! I without a doubt recommend this place to everyone and anyone, and will definitely be coming back!!"}
{"text":"I came here for a weekday lunch and it was nothing special.  Got a Salmon Bento Box (the daily special) for ~$10.  Service was good, the place was decorated all 'Japanese' like.  The box itself was just ok, I've definitely had better.  Probably wouldn't come here again.  

The restaurant is surrounded by businesses, so I'm guessing they survive on the lunch crowd.  This place has been around for a really long time."}
{"text":"This place has some of the friendliest staff I've ever met. It really goes a long way in my books when the service exceeds my expectations.

I don't know if you can call Yoko's location a good location or not because during the day, it caters to many businesses around the area for lunch and whatnot but at night, it's almost empty most of the time.  I'm sure during the day, it garners enough business to stay afloat because this place has been around for a long enough time. 

Because it's empty a lot, I'd probably consider this a diamond in the rough for people who don't live in the area and are looking for decent Japanese/Korean restaurant that is not all-you-can-eat.

Decor:
There are a lot of private booths in the restaurant and are barrier-ed off by thin wood walls interlaced with white paper.  There are private rooms that can hold 4-8 people and ones that are for 2 (though a bit claustrophobic).  The entry-way for each room has a curtain.  Those there may be visual barriers for these rooms, sound definitely travels around the office if you're rowdy.

I'm guessing this restaurant is modeling itself after traditional Korean restaurants in Korean town whereas you ring a bell to get service. 

Food:
The top notch menu item for me are the maki rolls.  Everything from the Spider Maki - Red Dragon Maki - Black Dragon Maki are fantastic..and not to mention HUGE. I would say that each piece possibly has a 1.5\"-2\" diameter which if you can fathom it, is pretty darn big.  The rolls are all presented well on wooden tablets and usually have some sauce laced along the side for decorative and taste-complimenting purposes. I recently discovered why these rolls were so big and why they tasted a bit different and it's because they put pieces of sweet potato inside.  You would think that's maybe a cop-out and just an excuse to skimp out on the primary ingredients but I can assure you that they do not do that.

I don't recall the texture of the types of Sashimi that they served unfortunately because I don't order it as much at Yoko.

The tempura here is not really to my liking as the batter they use is not as crumbly as I prefer.  It's more of a uniform batter that I'm not a fan of.  I really don't have any other way of describing it unfortunately.

I've ordered the Kalbi here before(beef ribs) and they've been tender and marinated the way you would expect it.


Service:
Like I said, the service here was spectacular.  All the time the staff has been very attentive to my orders.  They are always smiling and say hello/goodbye.  I know this is standard service in Japan where even the staff at McDonalds are super friendly, but whenever I see it Toronto, it's a welcome breath of fresh air.  

Even though not all of us order set meals (that include soup and salad), they still bring out soup/salad for everyone.  The apples and oranges you get at the end of the meal are cut decoratively and are always fresh.

When I came for take out, they served me tea and gave me apples and oranges while I waited and even though it was take out, I still decided to tip because of the hospitality.

Overall:
I wouldn't say I'm a regular here but it is one of my go-to Japanese restaurants when I'm craving good rolls. 

Service good..
Rolls good..
It's all good."}
{"text":"I came here with co-workers for lunch. I haven't had sushi for a while so I thought I would splurge from my usual frugal spending and got the Yoko Bento C combo. It is $14.95. I only gave $18 in the end since I didn't have a calculator on me, so my tip was a little short. However, it was hidden with my co-workers bills so they probably made up for it. Oops.
The miso soup was salty but is that like saying the turkey was dry? The salad tasted fresh. It took some time for our boxes to come.
The chefs seemed to be Japanese as they weren't speaking Cantonese or Mandarin. I don't know what it was and cannot pin it down but my physical reaction was I didn't want to eat the food in front of me and that it was unappealing but that might just be me having a bad day. What I know objectively for sure was the food was average at best. The sashimi was just okay though maybe subconsciously something about it put me off and my stomach felt a little funny after. The sushi and maki were the same quality, nothing special.
I like the bean sprout thing and that was a little above average and this white cole slaw thing in the corner was good.\
Nothing throughout the meal was really tasty.
Bottom line, my meal was slightly below average (60/100), though that could be me. At best, it was just average (65/100 which is lower than what I would call \"good\" which is 70/100 and what I give 80% of the places I visit). I do not know the going rate for my meal so it might be reasonably price I but I did not feel I got good value for this meal. I actually think it is money not well spent.
3.0 stars (65/100)"}
{"text":"This Japanese restaurant has been in the current location for decades.  When we went in for dinner, there were only two tables including us.  

We order a sashimi boat.  The fish is fresh and the temperature is just right.  It has raw shrimp, salmon, white fish, white tuna, and hamachi.  It gives us a very good impression.

The next one is spicy tuna maki.  Not a very special dish.  Then comes the dynamite and soft shell crab maki.   The layer of rice is thin, the roll diameter is big but half of it is filled with yam.  The yam overrides all other ingredient tastes.  There is little, close to none, avocado.  Disappointment.

The chicken donburi is very good.  Chicken is tender and juicy well mix with the rice and egg.   The boogugi is ok but beef is in large pieces.  The grilled mackerel is ok and can be better though the fish is fresh

Overall it is a average Japanese restaurant.  I bet lunch should be lot more busier than dinner"}
{"text":"I have been to this place a couple times for sit ins and even though it is a bit pricey, they never disappoint. Their sushi is great and we just ordered take out recently and I cannot express how good their service was even though we were waiting for a take out platter of sushi. The sushi was also delicious and fresh. They were also the only Japanese restaurant that was opened on Monday which I was very happy with after driving around for hours looking for some place open. We will definitely be coming back!"}
{"text":"I absolutely love this place!
Their vegetarian sushi pizza is to die for. 
The owners are very nice and the service is always great!
Another thing on the menu that I like are their green dragon roll and their dynamite roll. Prices are decent."}
{"text":"My go-to sushi joint around the Scarborough border area! Love the service here. The staff is always friendly and appreciative of their customers' business. They also treat their regular customers really well (sometimes with freebies!). I've only ever tried their Maki rolls and sushi bento sets, but I should probably try their Korean dishes since I come here often. The maki rolls are really yummy! Always fresh and filling (for me at least haha). This sushi restaurant can be a little bit on the pricier side (though I have seen worse restaurants with sub-par offerings). The food here never disappointed me and is worth the price."}
{"text":"I really enjoy coming here. My husband and I are regulars and don't have one bad thing to say about this place. The staff are very kind, hard working, and pleasant. The cooks always say hello and the servers are very swift and nice. They have the best kalbi, bar none! The prices are reasonable and I love their sushi. But that kalbi is really out of this world. It's perfectly cooked and such a nice quantity. I take my mom there a lot and she loves it too. Staff there recognize her now and are always super sweet to her. They know how to make and keep loyal customers."}
{"text":"Worst service ever for lunch ; waited 30 minutes to be seated; after finally placing our order, we waited another 30 minutes to be told that we still had to wait because the sushi bar was too busy. Had to change our order to get something \"faster\" and was charged extra because we chose the Friday menu on a Wednesday and waited another 20 Minutes! 
I'm not saying that the food is not good, but the service sucks. 
If they had told us, right from the beginning that it was going to be a long wait, we could have chosen something different."}
{"text":"Ordered a bento box at lunch time on a weekday. 

The meal was satisfactory overall, but I didn't find anything exceptional about the food or service. Restaurant wasn't too loud, so you can have good conversation. 

I give it 3 stars for decent enough food, average pricing, and average food for a Japanese restaurant in Toronto."}
{"text":"Wow. This place has been here for a really, really long time. For those that don't know, Yoko is a Korean-owned Japanese restaurant.

Came for lunch today. Got to sit in a semi-private room (2 tables in the room) with a call button (Korean restaurants sometimes have a buzzer/button that you press to notify the server that you want them to come over). Menus are quite extensive. Most of the items are Japanese, but if you're in the mood for Korean, you'll probably find something that suits your taste buds as well.

Had:

Shrimp tempura lunch set ($8.95) - Comes with 3 pieces of shrimp tempura, 4 pieces of veggie, rice, soup, salad, and three veggie sides (today's were sesame oil broccoli, black peppered bean sprouts, and shredded potato with mayo. Tempura pieces were large, and fairly crispy. I would have liked the batter a tad lighter, but I can deal with this. Salad dressing was a tad more sour than I would have liked. Shredded potato had a good texture, but the dressing was a tad...strange for shredded potato. Other than that, everything was quite...standard.

Most of the service was quite good, save for one small mishap where the server thought I was done with my meal (even though I had two pieces of tempura left in my bento) and tried to take away my sauce. Easily rectified though. S'all good.

There are cheaper places to eat standard Japanese fare, but this one's alright."}
{"text":"Sushi is my forte. I love sushi, I live for sushi and I seek out great sushi. This is the original place I had my first taste of sushi as a child. Yes I did say child. I thoroughly enjoyed the atmosphere as well as the food.

It is decorated with the traditional light wood pattern and the have little partitions to separate each table on the outside and have little rooms with 2 separate tables of 4 in them. 

It is located in the middle of an industrial area in which you would never think to find a restaurant, let alone a great restaurant in there. Be warned that during lunch hour on a weekday this place is packed full of suits. 

The food is excellent. The sashimi has suffered a little bit of a set back as they do not serve the infamous squid sashimi anymore as it is one of the pricier fishes. They have the best salad/soup as starters and great entrees that come by the mounds. Food is reasonably priced as far as sushi goes. 

One of the best things about this place is that the sushi chef takes his time and puts in a lot of care and effort into presenting their plates, as with many Japanese chefs (even though he's Korean). Ordering a black dragon roll, it comes looking like a dragon complete with a head and tail with crazy sauces lining to sides to make it look like it's on fire.

It has a wide selection of great food from the raw fish to the cooked entrees and everything in between. There is something for everyone on this menu and well worth the little extra for the freshness of the food."}
{"text":"Service excellent : Place spacious and nice.  Stops there ! :(  Food very disappointing. Tempura extremely greasy to the point of saturation.  Meat had lots of cartilage in it : not good quality meat.  

Group of three all of us had to leave food and left hungry.  So sad."}
{"text":"Sorry Yoko, I see the potential but I just simply didn't enjoy my dinner here. The food wasn't bad but when things on the menu aren't what they seem, we have a bit of a problem here.

I heard the special rolls were good here, so we went and ordered 5 of them - spider and dynamite which was part of a combo plate, Chicago, Yoko special, and the spicy scallop roll. We have done this at many other restaurants and have enjoyed doing this as some of us really like the rolls. At most places special rolls are different but Yoko's special rolls are all identical, with tempura yam, avocado, cucumber, tobiko being present in all the rolls we ordered minus the spicy scallop. 

The rolls itself were actually pretty good, there isn't too much rice, and the shrimp tempura, soft-shell crab and the yam tempuras were all nice and crispy. But I must say that the biggest problem here at Yoko, was that all those rolls were absolutely drenched with a sweet soy-based sauce, making the rolls slightly soggy and masking the flavour and textures of the rolls. For example, the chicago, Yoko, and spider rolls were only distinguished by the shrimp tempura, unagi, and the soft-shell crab respectively, but there was no way you could tell the difference when all you could taste was the sweetness of the sauce (which was made even worse by the fact that the yam is also very very prominent and sweet. It would be nice to have a creamy mayo based sauce instead. The spicy scallop roll also failed to impress as it was mostly bread crumbs. But full marks for actually making a roll where there was a bit of kick to it!

We told the staff the sauce was overwhelming and the rolls were way too similar to each other but was told that customers wanted more sauce and that if they didn't want sauce to indicate when ordering, but there was no way to know this beforehand. The lady that took our order did tell us that the rolls would taste similar but I didn't expect that four of the five of the rolls would turn up identical from each other. I should note that the Chicago and Yoko special rolls didn't end up looking anything like pictures on the menu. 

I'm really disappointed overall in Yoko but if you do end up coming here, ask them to lay off on the sauce and I think you'll have a lot better experience than I did."}
{"text":"Spacious parking dining area, friendly service, average food, accepts credit card = 3.5 stars

Ordered Love boat A (~$31). It is perfect for two to share. It comes with salad and miso soup as appetizers, and a scoop of ice cream to end the meal (I am not sure if they offer ice cream to everyone or just a big group). Salad dressing was refreshing and miso soup had tofu and seaweed in it. The quality of sushi and sashimi on the boat was just average, nothing special or disappointing. It was enough food for two of us. I got to try spicy salmon roll from the friend, and it was far too spicy and greasy... I would not recommend this roll. 

Overall, not bad for the price. BUT I recommend going somewhere else for better sushi if you don't mind paying a bit more or a cheaper takeout sushi places for the same quality sushi."}
{"text":"ordered the black dragon roll for takeout 
huge roll but drenched in sauce
it was also really warm 
felt like i was eating an unagi don rather than sushi"}
{"text":"I love that this place is right beside my office, cos there is truly feck all around the area.
The food is great, fresh and the service is awesome, normally.

I have had some moments when I was given the wrong fish, had to get my lunch to go because it took the food a long time to arrive and I'm not crazy about the fact they stuff with spicy handrolls with loads of crunchy bits that quickly go soggy. That's why I'm giving them a 3 star.

But for the most part it's a wonderful spot, the staff are genuine, kind and lovely"}
{"text":"I thought the food was pretty decent. I live nearby this restaurant and don't like to go too far when I have to grab a bite to eat.  I usually have the cream cheese and salmon maki which is good and they are not skimpy on the cream cheese which was surprising.

However, I am writing because of an experience I had with one of their wait staff, it was not a good experience either. In all my years of eating out and in restaurants all over the world, that was the first time I had ever had a wait staff tell me I needed to leave a tip.  I was paying with Debit and I like to leave the tip in cash for servers, maybe I am wrong and this is not more convenient for them, but that's the misconception I labour under. 

After handing back the debit machine and the receipt being printed, the wait staff said ' you didn't leave a tip', I proceeded to tell them that their tip (and I give more than the prerequisite) was on the table in cash.  To this they replied, 'oh'.  Maybe I am wrong , but I found this to be incredibly rude, and I have not been back since."}
{"text":"The food was average, just average. We ordered a boat and it came with sushi, sashimi and a California roll. The sashimi had salmon, red tuna and white tuna, which was average like all other typical Japanese places. They had 2pieces of seared tuna which was terrible, it was hard, because it was not seared well which caused it to overcook, making it dry. Also, it was a piece towards the end so it was small and dry. Very disappointing. They're sushi was just average, nothing special in particular, the regulars you get at any other restaurant. The California roll was also disappointing too because they did not use enough seaweed so when we tried to pick it up with chopsticks it fell apart. It just seemed they were trying to save on seaweed so just enough was used to roll and didn't roll it tight enough. They're service was good, people were nice, environment was very quiet maybe because we were the only table there. I was recommended by a friend to go, but I was very disappointed and will never go again and mot suggest it to my friends."}
{"text":"They used to be good but their food doesnt seem as fresh nowadays also their bulgoki is not fully cooked (you can see the red)."}
{"text":"Had to try it since I never been here. The service was pretty good overall. The miso soup was not hot enough. The fish does not look and taste appealing. The size was average. The price was fair but it could do better else where."}
{"text":"I love this place - I just found it, and have become a huge fan!
The Red Dragon Roll is something to be desired, and even the California Roll (which normally is not my favorite), was excellent!

The fish and avocado was very fresh and the service (albeit slow) was very friendly - even the chef's greeted me with overwhelming warmth!

The price is a bit on the high side, but it is definitely worth it!

I'm looking forward to my next visit :)"}
{"text":"This is a good place when it comes to fresh food. I assume they use fresh salmon instead of cans. Portions are really big. Beside price it looks and taste amazing."}
{"text":"Pretty good in terms of quality of food and service. The only really complaint I had was that options available for the boats. There was one for $30.75 which gave you about 35 of so pieces of sushi/sashimi and then it jumps all the way to $53 for the next size up. I would have liked to see a boat option in the $40 range which gives a bit more than the $30.75 boat. 

The fish was pretty fresh and on par with other Japanese restaurants and they even provided two pieces of the higher quality cuts of salmon which are fattier than the common salmon pieces and so much more yummier. The boat comes with standard salad and miso soup.

I did not leave with a full belly but left pretty satisfied."}
{"text":"This place is my go to place for sushi. My boyfriend and I go weekly. My favorite roll is their spicy salmon maki, it's the real one not the one with the mayo stuff added. Love that they are open late. Even at the end of the night their food is always fresh, including the miso soup and edamame which can sit around and get old."}
{"text":"Was in the area so we decided to try this place. 
Service was a bit slow due to how busy the place was on a weekend evening but they took care of us and gave us salads and soups and ice creams for the entire party even though only two of the orders actually came with all that. The food was alright. Nothing really stood out to us. We tried the lobster roll, bulgogi dinner, and California and green dragon rolls. Everything tasted average, The rolls are big, very little rice, almost too much ingredients inside and I'm not sure all the flavours worked together. But it tasted fresh so that's a plus. Overall, I'd come back if I was closer to this area."}
{"text":"I think that this place is in between 3 to 4 stars so I'm a little sad I can't do \"3.5\" in this case.  I have never truly been ever disappointed by this place but I have never actually been blown away.  

Lunch & dinner are quite quiet but there are lots of businesses around this area so I guess there is a loyal crowd who comes in.  Their cooked dishes (teriyaki chicken, teriyaki salmon, etc.) are not too special but what really impresses me is their yam maki.  

Their yam maki is a must-try.  While they have a daily special on their lunch menu, I always go for the yam maki because it is delicious.  It's not your average yam roll with a chunk of tempura yam in it. The sauce on this roll is excellent and they have avocado in it.  The roll is quite big so if you don't have a huge, huge appetite, it may be worth pawning a few rolls off to your friend or packing it home (word of warning - it is not as good once it's cooled down).  

Their salad dressing is also quite delicious.  I am a big fan of \"vinaigrette-like\" dressings and the two best places are definitely Yoko and Le Cafe Michi - they've both absolutely nailed it!  :)"}
{"text":"Brought a friend from out of town for my second visit. She vouched for the sushi set lunch but I was royally disappointed when I asked for the vegetable maki set ($9.95) and they gave me giant maki rolls filled with ... ugh, lettuce. 

I already ate a salad before my main came, so why would I want a second wrapped in rice and seaweed?!"}
{"text":"This place is amazing !! The staff are so friendly and hard working . Fast service the food is always fresh and delicious they can make anything on the menu just the way you like it and the portions are just perfect for sharing so you can order multiple items to share . The prices are also very fair and the environment is also super friendly . 
You can also book for privet events and they even have a karaoke machine for you to have your entertainment."}
{"text":"Didn`t get a chance to dine in. Take-out service was fast and the ambiance and staff were so welcoming. Ordered the green dragon roll. Plenty more rolls which I was surprised with. At Ginza Sushi, this would actually qualify for 2 orders (8 rolls). Around $11 for everything. Presented very nicely. I`d give it a 5 if not for the over powering taste of sweet potato in the roll. Still yummy though! 

The salmon sashimi was fresh and I`m pretty sure they squeezed lemon on top to give it the tangy taste which was ok. Would`ve been better if they left it as is.
Their wasabi though did not meet my `spice`expectations and not enough ginger, which I probably could`ve requested beforehand.

I`d come back for sure since their lunch specials looked reasonably priced."}
{"text":"I've been here plenty of times over the years and still believe this place is a hidden gem in North York. Their sushi is always fresh and their hot items are equally delicious. I would recommend an appetizer,  the Kalbi ribs and a sushi/ sashimi platter to share for a party of 2-3. You will get a fair value for what you pay and if you're looking for a private dining experience, they have small rooms and booths available great for first dates, business meetings or for more intimacy. They also have a small party room in the back where you can host a corporate event for a small party. My only disappointment with this place is with their grilled mackerel, which they used to grill to perfection.. Now when I order this dish it's a hit or miss.. May be differences in chef skills??"}
{"text":"Yoko is a hidden gem. Located in an industrial mall you would never expect to find a high quality sushi restaurant. The decor is miles away from the super expensive chic boutique type restaurants. In fact it is a complete throw back to the look of the older established sushi restaurants I first came in contact with back in the late 80's and early 90's. The staff are fantastic, especially for those who may have forgotten what customer service looks and sounds like. The lovely ladies serving you are pleasant, courteous and prompt. The chef takes great care to turn out each piece and it shows in appearance and taste. If you find yourself nin this neck of the woods and want some great service and great Japanese food..you gotta come to Yoko...In the words of the immortal Arnold Schwartzeneger, 'I'll be back'"}
{"text":"I came with high expectation for Yoko Japanese Restaurant and I left feeling so disappointed.....

The Good:
- Great Services: the staffs are so friendly and they have this good exciting energy
- Seating: We have a lot of privacy in our private room.. but we were there on a Friday night at 9 pm and we are the only one there...
- Rolls: The Black Dragon Roll ($14.95) so nicely presented!! The one of the best one I ever have! And it is both tasty and pretty to look at! +1 star

The Bad:
- The Sashimi Medium ($35.95) though looks so massive and nicely presented in a boat,  it is the most horrible sashimi I ever ate... 
The Salmon is the only fresh ones... The other fish does not taste fresh, taste fishy and a little slimy... It is the  first time I really want to throw up when I put those tuna fish is my mouth. My Boyfriend comes to the same verdict. We just could not finish what we order - 2 stars

I don't think I will be back to Yoko Japanese again.. at least I won't be ordering any raw fishes...

BTW, they do have a good selections of Korean dishes.. maybe I should have order some of those instead??

They accepts Mastercard, Visa and Amex."}
{"text":"Came here through a recommendation that the special rolls were above average. Went here for lunch and we ordered the chirashi and spicy scallop maki to try. I thought the food here was decent, the spicy scallop had more spicy fried bits than scallop and the chirashi was a smaller portion than I expected. I particularly enjoyed the sushi rice, it was sweeter and chewier than other places I've been to. We sat in a booth near the back so it was bit harder to wave a server down (although they did have a REALLY LOUD caller button). The restaurant looked very old, like the furniture was pretty outdated and they really needed a deep cleaning of the whole place. Overall, I feel like there are other sushi restaurants that I would enjoy more so I don't think I'll be coming back anytime soon."}
