{"text":"I was really looking forward to trying Yolanda's Spuntino Casa after having found out about them about a month ago and been following their pictures on Instagram.  The decor is great, nice setting down by the water and the service was on point.  The cocktail I had was good as well and the apps were good to very good (really enjoyed the arancini) but I was dissapointed with the gnocchi.  I heard they made gnocchi in house so was really looking forward to that dish but it was like mush.  I was with a friend who I had invited to come to Oakville from out of town to try this place so I didn't want to make a big scene but if this is how they meant to serve the gnocchi I am surprised it is still on the menu.  

Overall, I hope that is was a one-off bad dish and while I would consider going back but there are so many other places on my list to try"}
{"text":"Wayyyyyyyy overpriced for the portions.  I ordered the large Italian mixed plate and got served on a cutting board 2 small pieces of focaccia bread with two cut small sausages and 3 small pieces of cheese. A complete ripoff for $36."}
{"text":"Small Plate Italian...what a fantastic idea so you can try different things.   Service was very good and food was terrific.  I recommend the stuffed olive (think Scottish egg but with an olive) Hmmmm delicious!"}
{"text":"Had dinner with friends at Yolanda's for the first time this weekend. This place is a big improvement over the previous restaurant that was located here. Had the braised short rib with polenta and an outstanding seafood soup for a starter. Excellent wine menu to go along with the food."}
{"text":"Very disappointing.  Staff with attitude. If your going to charge the price , step up and deliver ! Food was Mickey Mouse . Acting like a 5 star, a  one star at best."}
{"text":"Nice to see Yolandas finally on Yelp. 
Cant believe it took us so long to find this gem. I get the feeling we will be back again and again. Saturday night dinner for 4 this past weekend and it was a great experience from start to finish. The space is architecturally very cool inside. Cant wait to try the patio this summer. The vibe was energetic and most tables were full. Despite that fact, our server (Dawn) was top notch. Knowledgeable, attentive and fun. Cocktail list is nice including some bourbons and MadMen style retro offerings. This place pay attention to detail - the glassware, cutlery, plates, serving planks .... all very nicely selected. The wine list is a bit limited but what they do have is perfect and well priced. The wine was served by a sommelier. Our friends asked for vegetarian options and Dawn went through the list like a pro. They found a very nice variety of voices. My wife and I shared the beet salad and the crust-ini for aps and the gnocchi and short ribs for mains. All served hot, very tasty, nicely presented... and generous portions. Perfect deserts topped off the night! We have been back since and the food and service were consistently excellent.  Will continue to return over the summer ..."}
{"text":"Too bad when the service doesn't support the location or food. We went for lunch on Monday after Canada Day. Felt fortunate to get a great table in front of open doors looking at the street and across to Lake Ontario. Rather slow for anyone to come for a drink order and even slower to deliver our glasses of wine. Waitress misunderstood much of our order. She brought the wrong appetizer but said the correct one would just be a couple of mins. 20 mins later we received our Zucchini Frita.  We did tell her it was cold which she said couldn't be. She should have tasted it!!  Main courses were quite good, a Tuna Salad and Pollo Milanese. No offer of pepper or other interest in our experience. Having been there for an hour and 40 mins, we decided to forego desert or coffee. Bill arrived with a charge for both the  app we ordered and the one we didn't. No manager or owner ever came by. I'm sure the location will continue to attract customers. It's a great setting but lost a chance for us to become regulars."}
{"text":"Our first visit was during the afternoon and we were seated on the patio. During the lunch there were men working on the awnings. They were drilling so loud that you actually had to stop your conversations. Also I know it's outside and all but maybe try to do something that would help with the bee situation. We had one glass of sangria each and the bees were constantly around. So much so that when I went to swish one away I knocked over my drink accidentally. My second visit was last night. To say I was unimpressed is an understatement. The first server was completely uninterested in helping us and looked like he wished he could be anywhere other than at work. Then due to the heat we went transferred to a table inside. We were a large party of 12 so I was happy they could accommodate us. Once inside and enjoy the air conditioning we met our new server. Again he was the same or maybe just because we are a large party he was intimidated. Not sure the reason but once again the service was shit. We had to ask multiple times for him to even return to our table. The food was excellent as always I have no complaints there. However wait for it here is my biggest complaint. Actually our party was so disgusted we will never return and I would advise everyone in a large group to read this. Our server broke the check down for us so we could pay separate. We fully were prepared to have a tip automatically added as we are such a large group. However the restaurant tried to pull a fast one on us. It was a Thursday night so wine by the bottle was 1/2 price. 12 ladies and a girls night out we ordered a few bottles. What the restaurant did next is appalling. They actually charged the tip based on the full bottle value on all of our bills. So this practice more than doubled any tip they should have received. When one of our girls approached the server it became a verbal battle. I being the out spoke one decided to step in. I spoke with the manager. (Skinny guy grey hair and glasses) during our discussion he disclosed that this has been happening and blamed it on his pos machine. I am disgusted that not only has h known about this for the past two and half months that the restaurant has been open but that they continue to allow this to happen. I think they should be embarrassed that they feel it's okay to rip off innocent parties and then blame it on a pos machine. Hello it will only charge you for what you enter. Have you thought about fixing the problem??? Or did you think no one would notice??? In the end he agreed to return all of the tips on everyone's bill. We did not live anything extra for our server as he also new what the scam was."}
{"text":"What??? I used to really like this place- had a couple great experiences with solid food and great service. And then this time we open the menu to...fewer options and way higher prices. On everything- food, wine, cocktails. $17 for mozzarella crostini is just laughable. 
So, the actual experience: the cocktails were really good, the arugula salad was so soaked with dressing we had to send it back (waitress seemed super unimpressed with that) and the pastas, while delicious, were minuscule. 
Basically it seems like they've turned this place into another overpriced, tiny portion fancy restaurant. Thanks, but Oakville doesn't need any more of those."}
{"text":"Great location, beautiful view of the 
Marina , friendly service but food is disappointing and overpriced."}
{"text":"My husband and I were so happy to find a beautiful dining place here on the waterfront. Yolanda's is an awesome place to look at but not to eat. The food is over priced, the service was terrible and slow. We waited for our food for a long time and when it finally came the grilled calamari was cold and tasteless. They're missing good food, good service and speed in the kitchen."}
{"text":"Solid ambiance and yummy cheat day food. Not to crazy on a busy day. Rice balls and eggplant parmesan we're great choices."}
{"text":"3.5 food, 4.5 ambience. The patio is key.

Tried a few different things for dinner, including the garlic knots, gnocchi, and rigatoni special. The portions are small, like others have said, but you sort of know that going in. The gnocchi was a bit overcooked and soft, but it had good flavor both with the basic pomodoro and the rose sauce. 

Drinks here are also on the pricy side, but they do make a mean cocktail. While they have a decent wine list, it could use some better mid-range bottles.

Overall, it was a good experience; one that I would enjoy repeating."}
{"text":"Great food and good service.  However their tap selection could use some work. Essential have the same beer on tap 4 time."}
{"text":"Great ambiance and very instagram worthy aesthetic (and lighting on the patio). Serving staff were kind but the wait for the food plus quality of food itself were disappointing. We ordered the casa burger, gnocchi pomodoro, gnocchi crema, and halibut and all were lacking in flavour. A Pomodoro sauce should have way more tomato flavour, the gnocchi were so large that it overpowered the little flavour in the sauce, the risotto with the halibut was undercooked and mildly tasted like pesto but was otherwise bland (it had sliced garlic in it...), and the burger had 2 tiny double patties that were overcooked and pretty mediocre though not the worst I've had. Again, cute ambiance but not worth the price/wait if you're looking for a good meal."}
{"text":"Really cute spot and perfect for enjoying nice weather. Wine list is pretty extensive and the food is rustic Italian and delicious. This was a great dining experience. The place feels feel modern and sleek while also being laid back and a perfect place for relaxing and dining with friends. I hear one night of the week they have excellent wine deals but it's also packed. 
I had truffle cream gnocchi that was fabulous, he had the halibut, which I tried and can verify, it was also delicious. For dessert we split the affagoto for two. It's a hard/weird dessert to share since it's hot coffee poured over ice cream which essentially creates soup, but it was phenomenal. I believe we had a charcuterie plate and salad for starters but that's fuzzy due to all the wine I consumed! Which by the way, was also excellent."}
{"text":"Not bad, but not great either.

The good:
Location and overall ambience. 
Was satisfied with the food on the whole.

What needs work:
Service - our waiter (young guy with glasses) was friendly but not really on the ball.  Would disappear for long stretches of time to the point where I'd have to ask another waiter where he was.  Really didn't have much to say when I asked him what he recommended on the menu.   Maybe he was new, but you expect a higher level of service and professionalism at this price point. 

Music inside far too loud - our table of 4 could barely hear ourselves speak at times. 

Final point and somewhat out of their control - we had flies buzzing around us all night.   

Overall I had a decent time but that was more due to the company rather than the restaurant.  I'd hesitate to go there again for a meal (but maybe drinks; outside patio looked amazing)."}
{"text":"I do love it here. The food is Italian, with a bit of a tapas-like Spanish influence in the portion size. Good quality. The beef tartare, with that incredible olive oil, absolutely did it for me. Great sommelier. Great wines selected for us. Great servers. The patrons can sometimes be hilariously wealthy, snooty and judgy housewives with elderly rich men, but this is not the restaurant's doing. Just be prepared for tables of middle aged judgy types surrounding you. But we loved it and we will recommend this place to absolutely everyone, with the warning to be wary of the judgy onlookers."}
{"text":"4 of us had dinner on Friday night. Shared platter of cured meats, meatballs and all had the branzino. Branzino was excellent. We would all go back. Great atmosphere for a fun night out."}
{"text":"Nice open patio, great food and drinks and attentive service. Great lunch spot on a sunny weekend. We tried the grilled seafood, fried bread knots and arancini.  And the cocktails! Just a block away from Bronte Harbour so the location is perfect for an after lunch stroll along the water. I will definitely return."}
{"text":"Romantic, Italian inspired place.  Really great selection of wines, not a huge list but great variety!  I had he Crostini with mozzarella flown in from Italy that was to die for!!  I paired that with the side of Brussels sprouts and a pear insalata because I wasn't super hungry.  I wasn't disappointed!! 

Also, great service!  The waitress Dawn and hostesses were all extremely attentive and nice.

Great spot for a date or nice dinner with friends."}
{"text":"Great food...  Portions were a little small,  but taste was spot in..  Outside patio is an excellent addition and well setup.."}
{"text":"Great time great ambiance 
Clean
Friendly
Great food
Amazing white sangria 
Fresh pasta"}
{"text":"Food was amazing :)
Loved to Miami feel to the newly renovated patio.
The heated floors will be a hit this winter!

Ryan"}
{"text":"Yolanda's continues to deliver dinner perfection, time and again. After dining there many times over the past 18 months, it is a go-to spot for me as an out-of-towner. The service is impeccable and attentive. The wine list is inspired and original and matched to every dish on the menu. The menu, then, is diverse, original, tastey with original small touches that make every plate a celebration of flavour and appearance. The use of fresh ingredients raises the bar on the quality of each meal. If you can make the time, go and dine at Yolanda's!"}
{"text":"Yolandas has a great patio right at Bronte and Marina but unfortunately the service was very slow and the Food WAY overpriced. The servings are those weird little sample servings. Our bill was $100 and we left hungry.  Not sure why Yolandas can't give a regular serving size for an entree that is $32 but maybe it's meant for just sipping cocktails and not to actually eat a proper meal. 
I recommend for cocktails, not for food consumption. Their pizza might be okay, but we wouldn't know because the pizza oven was not in service. Meh"}
{"text":"What a great summer spot! Bronte harbour serves as a great backdrop to this local favourite. The Italian inspired menu, from what I sampled, is worth a second visit. The fritura misto was light and crispy, the grilled octopus was cooked perfectly. Not chewy at all. Disappointing was the zucchini fritto, heavy on the batter and the mint was a poor herb choice. Enjoyed the heirloom salad or their panzanella salad. Light and fresh. 

Great social spot, think I was sitting next to the real housewives of Oakville ;) 

Ciao and Bon appetito"}
{"text":"No doubt the setting here is perfect and the decor is on point. The food is ... good enough. Service was a bit disorganized but friendly. I think we had 3 or 4 different servers ask our table about ordering.

Didn't try the cocktails though."}
{"text":"A beautiful patio, right by the lake. Great for a hang out with friends, a fun family dinner or even date night! The food was yummy - basic rustic Italian, but done well as the flavours all aligned perfectly. I had the kale Caesar salad with tuna and it was a good size. A bit pricey but worth it for a treat. Free parking available on the street too! Going to come back to this little piece of heaven to enjoy some good food and wine! ;)"}
{"text":"I had great experience with the gnocchi. Food was delicious, wine was good, service was good, during the summer it's the best!"}
{"text":"Not bad. Not amazing. I went here for the first time with a friend for lunch. We tried their \"Taste of Oakville\" fixed lunch menu. I had the minestrone soup to start. I am NOT a soup person, but it was a wet & chilly day and the lake view outside our window made it seem chillier. Given such, the soup was really good. Very tasty, nice and hot, and the beans & greens were an odd but decent mix in the broth.

Grilled calamari for my main. It was in a Tomato-based sauce which, again, I'm not always a huge fan of, but the sauce was delicious and almost pesto-y [actual culinary term. Look it up]. The Calamari itself was good except for the parts that were burnt (and tasted so)! It was over-grilled in some places...but still a yummy and satisfying dish.

Tiramisu for dessert. It was almost a bigger portion than my calamari! That's my only con, that it was almost too much for just one person. But I paired it with a solo espresso which made it an EXCELLENT thing.

Decor/ambiance? Seems like they're mixing a lot of styles...a little much, but overall a nice spot right on the lake. 

Would I come back? ...to try their regular menu, on their patio, in the summer time, maybe. Otherwise, no. So many other spots nearby."}
{"text":"After a fun afternoon at the Mississauga Waterfront Festival, we went down to Oakville to catch the last bit of sunset by the Oakville Harbour #Yelp100days, and to find food because we were starving, even though Bao already stuffed her face at the food trucks earlier lol

We quickly spotted Yolanda's Spuntino Casa, an Italian restaurant at Bronte/Marina and dived in for dinner and drinks. The patio looked absolutely inviting - dreamy lights, fun music - reminded me of the happy hours on Miami beach ;)

The cocktail drinks were delicious and strong! They also have a big wine list too. Branzino tartare was flavourful... the onions definitely made a statement in that dish, even though I hated onions :/ lol. The creamy cavatellli with clams was my fave!! I love that chewy texture of the pasta and it is not as filling as gnocchi... so I can't stop eating it ;D The tiramisu dessert was a bit sweeter than I have anticipated. Nonetheless, it was still tasty :)

Service was great. Price point was a tad expensive. But I'd definitely come back again - I had a great experience!

P.S. We also had fireworks that night too... random right? You can sorta see it over the trees at the restaurant. Such a perfect way to tie up the evening :D"}
{"text":"We wanted to love this place-- a view of the water, a covered patio, promises of authentic Italian but unfortunately food is just ok and the service needs much improvement. For example, don't clean the table and spill the food on my dress! Please refresh my water glass without me having to chase you down!
The bread is yummy, the wine selection is alright. The mains just didn't hit the spot for us. It's typical North American Italian taste."}
{"text":"Exciting place which is essentially a major covered patio in Bronte by the harbor. I used to be there with a friend over a very hot day in end of September, they had to shut the movable color roof just to keep the sun off from everyone. We both ordered the grilled octopus and it was great. The service was friendly and helpful if a little unperceptive sometimes. Seems like a great location to bring a date in the summer season time, not sure how well adapted that big patio would be for the cooler months."}
{"text":"I had two completely different experiences here. The first, a Sunday brunch on the patio. The atmosphere was bright and airy and the mood was relaxing. Add a pitcher of their white sangria and you've got yourself a good time.

I returned the following weekend for my mom's birthday dinner to find a completely different atmosphere on the patio. Much trendier, louder, and seeming more like a bar than a restaurant. There was also a VIP party blocking off half of the patio. As a table seated right next to them, a heads up when we made the reservation would have been nice. 

Service was slow both times, but friendly and accommodating when we requested to move inside for dessert. The free dessert platter was a nice touch. 

I found the food hit or miss and sometimes overpriced for what you get. The highlight for me was their kale caesar, which was phenomenal and almost too filling for a starter. Their arancini and meatballs are also quite good. The three pasta dishes we tried were decent, but the steak unfortunately was a miss - overcooked and just not flavourful.

Overall a nice place for a weekend brunch and potentially a good spot for evening drinks and apps with friends, but would not return again for a family dinner on a weekend."}
{"text":"We enjoyed a delicious lunch in a bright and pleasant patio shielded from the high wind by a movable glass window/wall and white awning. The pizza and panini were perfect but the fries very ordinary, I'm guessing the oil was well used and not hot enough to get that crisp outside and hot soft centre or the fries had sat around too long. This was balanced by a very delicious house made ketchup. Lunch was concluded with an excellent expresso. The dessert menu looked very tempting! The service was attentive but not pushy. We will  certainly be back for more and can definitely recommend Yolanda's."}
{"text":"Fantastic food and service! We ordered the panino, zucchini and heirloom tomato salad and it was WONDERFUL. Our server Josh was very attentive and had great recommendations on both food and drinks. The overall vibe and decor is very inviting (especially for out-of-state visitors like ourselves) and cozy/chic. If we are ever back in Oakville this will be our first stop. Wish we could give more than five stars, we didn't want to leave!"}
