{"text":"I love this place!  If you want to order pick-up and grab a bunch of well-priced, huge maki rolls for some guests or dinner, this is the place! Some rolls are only $1.99-2.99!   Everything is made fresh when you order and I will tell you, I have had to wait a bit longer than a half hour for my order before (for pickup) BUT it is worth it and the people running it are very sweet. Plus, the hours are great! Open until 10pm some nights!   Delicious sushi!"}
{"text":"Horrible name, extremely small space yet with two tables for dine-in.    The sushi takes forever, but that means it is made to order, so I guess you got to take the good with the bad.  They are very heavy on the rice, but the sushi is cheap.   The shrimp tempura has this bitter aftertaste which I can't figure out where it derives from.  The soy sauce packets are dark soy sauce, which is completely wrong for sushi.  But it's the only sushi local in the area, and does to job when craving for a fix when one is not feeling too picky.    They got chicken wings and other small snacks, including lunchboxes.  While I was waiting for my sushi, a six year old kid came back through the door five minutes after buying his lunchbox and demanded more sauce on his rice.  The guys here were more than happy to top him up.  York Yaki, you gotta take the good with the bad."}
{"text":"Ordered a few times from this place for take out while I was at work.   The Teriyaki Chicken is good as it was recommended to me as they make the sauce in house from stratch. Every time we get sushi takeout they do not give enough soy sauce packets even thou we asked for more we end up with half a pack each when we divide it, so we end up eating the last couple rolls without it.  They do not have any lunch menu specials which is no good as the Bento boxes are expensive compare to other sushi places in the area for lunch.  Their speciality rolls are well priced - Green and Golden Dragon $5.99 for 8 pieces, Red, Black and White dragon $6.99 for 8 pieces, Spider roll $8.49 for 8 pieces.  The size of the speciality rolls are good and filling.  Quality is okay, guess you get what you pay for."}
