{"text":"Don't tell people calling in orders that it's going to be a 20-25 minute wait when it's actually an hour. Then after paying say that the name will be called once it's ready, yet orders are just being stacked up without anyone checking on them until walking up there and asking after 15 more minutes.... and food was cold."}
{"text":"Yoshi's does a great job of handling a large lunch crowd.  The dining room is large, clean, and attractive, and the food is pretty good."}
{"text":"I'm not one to complain but we just spent 42$ on sushi online. I clearly made two different memos on our orders that I have a dairy/soy allergy. I asked for a spicy salmon roll with mayo on the side and to add crab. The crab was mixed with mayonnaise. Why wouldn't the chef just add plain old crab instead of mixing the crab with an ingredi That contains soy? The chef should know not to mix the crab with something that contains soy if the customer instructions clearly stated twice that I have a soy allergy. I didn't get to eat dinner tonight because the chef was careless. And the 12$ on sushi was wasted. I would have ordered a regular salmon roll and not wasted the extra $ on spicy mayo that I could not eat anyway, but there is no regular salmon roll on your online menu. We won't be ordering from yoshi anymore because of this. Very disappointing."}
{"text":"Tis was our first stop today out of 4. Meh... Just not our cup of tea. There is a wait but most disappointing to us was no sushi bar. We cant comment on the food, only the sushi. Sitting at a table, no sushi bar, no interaction with the chef, it just takes away from the whole sushi experience. There's a lot of better places in the area...."}
{"text":"Food is generally bland. Sometimes order is not correct. Food takes a while to come out. Wait staff is not very friendly. Used to enjoy Yoshi's but not anymore."}
{"text":"Well well well, after all these years El Yoshi is still going strong.  I have been dining here since it first opened 13 years ago. They have moved across the street from the original location and still rocking it.  Love the wed half priced sushi rolls.  The hibachi is always good. Wish I could dine here more often."}
{"text":"New LB and Snow rolls are great! Try them on Wednesday--- half price sushi roll night!"}
{"text":"Food is awesome, service sucks though. Every time I order to go I feel like I'm annoying the person answering the phone :/"}
{"text":"This place is so yummie and affordable. Even during the lunch rush the do not take long. The beef and onions, mushrooms and the sushi are mouth watering. Will return many times a week."}
{"text":"Used to go here in a weekly basis when we lived in Huntersville.  We still try to go when we're in the area.  Food is good. Love their volcano roll. Employees are always friendly.  Will continue to come here when we are in Huntersville."}
{"text":"This place is a really good. The atmosphere is good, the staff is great also. The food is always nice and hot, the portions are about on par with the restaurants around.   The waitresses are very nice and always polite. We have been very few times where the restaurant was understaffed. The location is also not too bad.   Overall the price is good enough for 2 eat under 30$. The menu takes some getting use to, it's all on one wall. It is however large enough to were a group can look and see if they have to.   Overall, this place is pretty good, it's reasonably priced , service is good, and it's easy to get to."}
{"text":"The sushi is very good and half price on Wednesdays!  Yea!   The restaurant is relatively clean and the prices are reasonable.    The only complaint is the chicken is usually tough and stringy ...... they need to find another way to cook the chicken.   However I go there for the sushi, not the chicken."}
{"text":"One star is far too many for this place. Teriyaki chicken & shrimp was Awful!! underseasoned bland meal . Sweet tea wasn't sweetened at all. Spring roll was over cooked and lacked flavor. Never Ever Again! YOSHI?? Should be YUCKY. Huntersville, NC location."}
{"text":"Sushi was very good and filling. Wait staff was friendly and accommodating. I was amazed at the generous portions, let's just say I left full. Great place for some fun and tasty sushi."}
{"text":"I usually go to Nikkos downtown for Sushi.  It is a great place but you pay through the behind there.  This Yoshi Grill is a solid place.   EVERYTHINH ON THE MENU IS VERY, VERY GOOD.  Domestic beer 2 bucks.  International beer 3 bucks.  Cheap, tastes good, good service.  GIVE IT A SHOT.  PS-  1/2 PRICE SUSHI EVERY WEDNESDAY"}
{"text":"AMAZING Japanese steakhouse-style food...but FAST!! Good prices too, I went here all the time when I lived in Charlotte."}
{"text":"Really great restaurant here in Huntersville. The food is all super reasonably priced, there are awesome combos, and everything tastes great! I've been so many times and have never had a bad meal. All the employees are great too; super friendly and they are always working very hard. Totally recommend it for casual Japanese food."}
{"text":"LOVE THIS PLACE!! This area has half off sushi on tues and thurs. If you want to turn a friend on to sushi this is the palce to take them!"}
{"text":"Great food. Awesome prices. I love coming here so I can get sushi and my wife can get habachi chicken.   They have a great sushi combo where you get a role, meat, rice and side for $11!! More than enough food to feed two!"}
{"text":"What happened Yoshi's? We use to love this place. As of tonight...not anymore.   Strike one- ordered my favorite sushi roll/ the only salmon roll I can eat while pregnant, the bagel roll. To my surprise when it came out it was crab not salmon(whuuuut moment, this makes the name make no sense). To their credit however the board does say crab, so that's fine, but seriously when did that happen? Their roll has always been salmon and cream cheese, but I digress.     Secondly, the Katsu chicken no longer comes with traditional Katsu sauce, no no its served with some sort of dirty looking mayonnaise. My husband was kind enough to try it, he said it tasted like a Dijon mustard, which is still strange.  Two stars for still being nice, but seriously I'm leaving with a half full belly and crushed dreams."}
{"text":"Yoshi's is a nice place to grab some quick sushi or hibachi for lunch. Recently it moved into the old Tijuana Flats location in Huntersville from across the street. The old location was better in my opinion because it was smaller and more quaint. The new space is larger, almost too large. The pricing is about an extra $1 higher across the board than it used to be.   Ordered the hibachi chicken/shrimp combo which came with rice and a side & drink for $10.50. They used to have a mixed veggie side, which is no longer, so I went with broccoli. I'd like to see the mixed veggies back as it had carrots, cauliflower, zucchini, etc. The order took longer than I remember, and the food was just ok...I had higher expectations. The shrimp were a little overcooked and the chicken & rice were dry, requiring more shrimp sauce than I like.   All in all, solid place for lunch if you want a couple rolls or hibachi, though I miss the old place."}
{"text":"Yoshi's Grill is basically a fast-food Japanese restaurant.  They cover all items from sushi to hibachi dinners to tempura.  I've been there a couple of times so far for lunch.  Both times have been somewhat average.  There's not a lot of atmosphere to the place (it is \"fast food\" after all).    The first time I dined at Yoshi (insert Super Mario Bros soundclip here), I tried the sushi.  The rolls we tried were good, but they couldn't compare to sit-down sushi restaurants I've been to here in Charlotte.    Today, we tried the hibachi combo meals.  I ordered the hibachi shrimp with broccoli and steamed rice.  A side comes with it and I opted for the salad (I do love a good ginger dressing!).  The hibachi food was good, but still kinda average.  It is by the University, though, so maybe students won't care.  But the prices for the meals were a bit higher than I like to pay for lunch at a \"fast food\" place.   $11 for the meal, drink, and tax?  And their meat and sushi combos were $10.25 + drink and tax.  Ouch.  Granted, it was healthier than a Big Mac (which I don't eat anyway), but you get the point.  Price is a big thing.  Especially for lunch.  And the restaurant was practically empty.  How about a lunch special, Yoshi?  Students and state employees aren't raking in the dough, you know..."}
{"text":"I come here often. I love there teriyaki chicken. It's the closest I can find to what I used to get in Seattle. Great prices, big portions, good food. Never had a bad experience . Try it if you haven't already."}
{"text":"For being the first time here it'll probably be my last! Let's just start out by saying service completely sucks! We waited at the \"line starts here\" sign and waited... finally a young lady came up to the counter and helped a man that just walked in to the side of the register l (I'm assuming it's a pick up order) the  proceeded to help us after he was done.. the order taker asked what we wanted to drink very rudely! Then slaps a number card on the counter (for never being here I didn't know what that was)... next we are sitting there what felt like forever no shorter than 30 mins for our food and there was only 2 tables ahead of us... food tasted very different! My wife nor did I like the food, or the sauces... Sushi tasted like sh**, I've had better at a buffet.. that's sad when it's part of what you advertise!   I think it's definitely a management issue at this location! Staff doesn't have any cares for anyone!   Good luck if you should choose to eat here!"}
{"text":"Hoping I don't offend too many people this time around, therefore noting right now that anyone can see this place is very, very popular--the lines outside at lunch on weekdays look like an anticipated NYC restaurant opening. Obviously, a lot of people like Yoshi's Grill a lot. It's quick, and likely many lunch folks believe it's healthier than, say, Five Guys next door. (I'm not touching that one. ;) Everyone needs a Five Guys fix once in a while.)   If, OTOH, you're a sushi or sashimi intermediate to expert or have learned to be careful with your sushi/sashimi, here's all you need to know: 1. No Asians in sight, behind counter or in the restaurant. No sushi bar. No sushi chef in sight. 2. No sashimi, and highest \"Nigiri sushi\" price is $1.75.  3. No sign of much fish in any sushi rolls. Cream cheese, everything else on earth, but not much fish. California roll level.  4. The BIG One: When I asked where the salmon comes from (given a certain problem recently noted in Alaska), it took almost three people to find out. And then I was still asked what I meant, to which I replied \"Atlantic or Pacific NW or...where?\" Answer: \"Oh. A farm. It comes from a farm.\" Having tasted it, very briefly, they are being very forthright. Points for that.  5. That said, you can get a lot of rice (although very little and very bland fish) for $15, including your bottle of Dasani.   I could go on...but you probably get the idea."}
{"text":"My favorite lunch place when I'm in Charlotte.  Very big selection and everything is great.  I usually have hibachi chicken or beef and it's always incredible.  Crab sauce goes with just about everything - highly addictive.  Friendly staff is quick to get refills or anything you need.  Great place for lunch, affordable, fast and very good."}
{"text":"When I worked up in Huntersville, I ate at Yoshi's all the time. Especially on Wednesday, it is half-price sushi.   The prices are just right and the portion of food you receive is very good. Just know that most of the rolls are basic don't expect high end sushi but it is still VERY good for the price point."}
{"text":"i think yallz iz cute"}
{"text":"THey now have half price sushi at this location too on Wednesdays.  Here they are moving across the street to a new bigger location."}
{"text":"I've been eating here since it was located beside Harris Teeter (across the street from current location). The food has always been delicious.   We stopped by after the Davison parade on Saturday (haven't been here in 3 ish months). They must have a new cook or new management. The food for our entire group was terrible. And, I burped the (super fishy tasting) squid salad for the rest of the day. I'm sad to say I won't be back."}
{"text":"I Love Yoshi's. I've ate at Yoshi's ever since they came to Huntersville!  No matter what you choose from it's awesome!  I love teriyaki chicken or hibachi shrimp with sweet carrots and shrimp sauce, heaven!!!  Prices are very reasonable. If you're new to the area you've got to check them out!"}
{"text":"My boyfriend took me to dinner here tonight and we were not disappointed but we were also not completely impressed. For the price, it truly wasn't anything terrible. I got worried that everything came out so fast but maybe it's not such a worry. I got the hurricane roll and he got the hibachi chicken and we shared a miso soup. Now, the miso...honestly it's nothing to write home about. I've had better miso from packets in the grocery store. My hurricane roll was pretty good. Was it $8.00 good? Maybe not but it was tasty. His chicken was a little tough but it tasted nice with the mushrooms. His fried rice though had very little flavor. I'm glad we went. The place itself is pretty cool. Probably won't go back but give it a try. You might love it."}
{"text":"Live right down the street from this restaurant so we tend to eat there quite often. Never had a bad meal. They will even do GF which is great for my diet sensitivities."}
{"text":"Sushi is mediocre at absolute best.  Lots of rice and not much meat  Chicken used is completely disgusting...always always dry and has a lot of cartilage in it (gross)  Steak is also very dry and of the lowest quality ive had and would expect more out of golden corral or any other buffet  Shrimp sauce is ehhhh  Very long wait if they are busy"}
{"text":"Great place to eat. Have been coming here for years. Teriyaki chicken and steamed broccoli is my favorite."}
{"text":"Big fan... Great and well priced food. I usually call ahead and pick it up... I do miss the online ordering..."}
{"text":"When my wife and I don't want to cook, we come to Yoshi's Grill. We usually get the Vegetable Hibachi but lately we have been ordering the Chicken Teriyaki and Beef Teriyaki. Haven't had a bad meal! Everything we have tried is good. The fried rice is really good. I can just eat a whole plate of that. A nice addition is the egg roll. A favorite spot of ours when we need a quick and healthy meal."}
{"text":"This place has great food. It is consistently great. I will say that the service is very slow. We waited 40 minutes to get our food. With kids in tow, that is recipe for disaster. But, we will be back for the good hibachi chicken and veggies"}
{"text":"Yoshi's is my family's favorite place to go for sushi! Wednesdays are half off sushi, which is a great deal! The staff is always so friendly and overall, the service is great. Highly recommend any of their teriyaki dishes."}
{"text":"Fresh food at decent prices $7-8 bucks a plate approximately.  I am a regular customer. I order the vegetarian hibachi plate with teriyaki sauce (my preference). The food takes time to prepare, but tastes fresh. Only issues I've had is the chicken teriyaki dish, chicken is almost always too dry and sometimes my veggies have charred spots. Dine in or carry out. Very clean place."}
{"text":"The sushi portion was generous, but the sushi rice was hard and the rolls fell apart easily.  The fish tasted ok, but not the freshest.    The staff was nice, but it took almost 30 minutes for us to get our food when the dining area was only 1/3 full."}
{"text":"I went during lunchtime w/a co-worker. The restaurant was full and I noticed a lot if pick-up orders  coming through. They took a very long time to bring our food to the table but the sushi was fresh and the Hibachi Chicken was very good. It wasn't served hot; but it was warm. The atmosphere was nice. Flat screen tvs and dim lights."}
{"text":"Was in town on business and this place was close by. Went here for lunch twice. Very good Asian food.. Nothing remarkable. Solid spot for lunch"}
{"text":"Our favorite spot for sushi and such. It's not fancy and there is probably a better selection elsewhere but Yoshi's is very good at what they do! Service can be on the slow side (but always pleasant) when busy but if you know this going in and you'll be satisfied. They have something for everyone and it's reasonably priced. We feel like regulars here and won't be leaving anytime soon!"}
{"text":"This is the go-to spot when you're in the area and you just happen to crave sushi. Service is friendly and you can't beat their half price sushi Wednesdays!"}
{"text":"My wife and daughter are big fans for lunch, we've never been here for dinner. I like the hibachi chicken, i skip the rice and get double veggies. Gotta keep my girlish figure. I'm not a sushi fan, but my girls like it. Weekends aren't very busy, so an easy place for a quick lunch. I suspect that if you're a sushi snob, you might be disappointed. But for the casual diner, this place does the trick."}
{"text":"Nothing fancy, but the combo meals are a good value. The sushi was not  great but was good. Miso was the same as every other place and the yakitora chicken was good."}
{"text":"I went for 1/2 price sushi on a Friday because some friends dragged me here. Even at 1/2 price it is still kind of expensive for some forgettable sushi. I got a spider roll and a panther roll. They are massive and take about 3 bites per piece. The atmosphere there reminded me of eating in at a Fast food place. It's an okay place on half price days, but even then I think I'll stick to places that require less of a drive like Ru San's for cheap sushi."}
{"text":"If you don't plan on dining in, PLEASE CALL AHEAD. This location is very popular around lunch time, and attracts a lot of people. My wait was minimal due to ordering ahead. The food itself is not bad, but it's not the greatest Japanese food I've tasted either."}
{"text":"Go with low expectations. Yoshi's is the poor man's sushi, and what you get, it's pretty good. There are many better sushi places, but also consider how much more expensive they are based on the quality. Yoshi's still provides a decent meal with a bit of variety and you won't feel like you're getting sushi from a fast food place.  I recommend sticking to the sushi rolls. You can get a fair amount for pretty cheap. It's also not very crowded, and I've been there multiple occasions for a quick bite. I've never experienced any problems with service.    Staff is friendly.   Parking is easy."}
{"text":"Yoshis is usually good and has good service but tonight the service was terrible. It took an hour to get my food with no explanation. The food was not up to its usual standard. I will be trying to find a new Hibatchi spot."}
{"text":"Moderately priced... Large amount of food... Appeared to be a good appetizer for an additional $5... That's when reality hit for myself and my work partner. The beef with noddles was a complete failure for us both. We did not even attempt to try and finish our plates. As for the chicken katsu... Nothing good about it. Over cooked dry breaded chicken. Not the Panko style coating which is katsu."}
{"text":"The food is good but I can't be the only one who has noticed that it takes FOREVER for the food to come out. There is no rhyme or reason to how it comes out either.  This is about the 5th time I have been here and we had some people finished while others had just gotten their food.  The food is good but the wait makes it not worth the trouble sometimes."}
{"text":"Food is always good but service tends to be a bit slow."}
{"text":"I do wish the food here was better because it's so convenient to my house.  They have a huge menu it literally covers the whole wall.    They serve chicken breast in their chicken dishes which is a plus but overall their lack of \"authenticity\" is disappointing.  The Teriyaki sauce is very salty and the sauce served with the Hibachi Chicken is kind of like Thousand Island dressing.  I have also ordered the Chicken Katsu which is basically fried chicken strips.  They didn't have authentic Katsu sauce, but they brought me a mayo sauce that was not good.  The shrimp in the Hibachi Shrimp are not very big or tasty.  I probably wouldn't order that again.  Their Fried Rice and deep fried gyoza are good.  And I do like their ginger salad dressing but unfortunately their salad tastes like bagged iceberg lettuce with carrots.  They also have some decent egg rolls but they serve them with packets of the worst plum sauce.  A normal sweet and sour sauce would be so much better.   As far as sushi goes, I've only tried the Shrimp Tempura Roll and it was just ok.    Service is pretty good even when it's busy.  Overall.. just a decent place in a pinch."}
{"text":"First time patron. Friendly staff, always checking on your drinks and refilling. Yes, there is a wait - but the food is fresh, hot and flavorful....except for the egg rolls - pass on those next time!"}
{"text":"The food is more of an American-Asian hibachi style.  The quality of the food is cheap and the flavor of the food is very bland. My first and last time."}
{"text":"Grabbed lunch togo. It was very good. It just took a bit to place the order and get it. Other than that everything was fantastic. I got sushi and they had everything I needed in the togo bag without my having to ask for anything."}
{"text":"This place is pretty good if you have a mad craving for sushi on a Wednesday night. You can't beat 1/2 off sushi. I have tried several rolls here and they are pretty good but some lack flavor. We only ever go on Wednesdays because I'm not sure it's worth full price.   My husband does love the teriyaki chicken and rice. Good veggies and ample portions. Chicken is not dry and salty like a lot of Japanese places."}
{"text":"I love hibachi! You can probably tell by all of my hibachi restaurant reviews. Yoshi's isn't my favorite but it's not terrible so don't take my three star rating the wrong way.  There is lots of parking and it is a large restaurant.  I would say my problems with my experience was the long wait to order, the extremely ridiculously long wait to receive my food (over 30 minutes), and the steak was overcooked. Upon entering the restaurant, they have a large menu posted on the wall. I ordered the hibachi steak meal that came with rice and a choice of a side.  I chose the sweet carrots which were delicious. I got the steak cooked medium and it was so overcooked it was actually chewy. No pink showing at all.  I will say that the rice was good and so were the mushrooms that came with the steak.  The shrimp sauce was a little salty for my taste but it was still good to use on the rice.  I think it was a good deal for $10.  It was a lot of food for a good price.  I think next time I will substitute veggies for the rice and skip out on the rice.  Hopefully there won't be such a long wait for the food next time.  I will be back sometime to give it another chance since I'm such a hibachi connoisseur."}
{"text":"I want to say that NC has a lot and I mean A LOT of hibachi places. But Yoshi's has become my food \"crack\" house. I love the hibachi beef with fried onions. I come at least twice a week. Before Yoshi's,  i avoided sushi. My family is part Japanese but yuck. Yet at Yoshi's, I have had 3 rolls I love (tempura asparagus, cucumber, and the California roll). I always, i mean seriously, ALWAYS get the hibachi beef and fried rice. I want to get the steamed rice, but the fried rice is so freaking good I just can't deviate. I did venture away from the gold (I mean sweet carrots) and got the grilled cabbage. The nice woman taking orders at the counter let me leave the bacon off without an attitude. So so good. Friendly service, clean place, great (GREAT) food, and very reasonably priced combo meals put Yoshi's ahead of all others."}
{"text":"Great customer service and great food. Would highly recommend. It isn't the most authentic food. It is very Americanized, but it is delicious! I've had the rice, noodles, chicken, shrimp, beef, and egg roll. Highly recommend all of them.   Food 5/5 Service 5/5 Price 5/5 Atmosphere 4/5"}
{"text":"The food is pretty good.  I've had pretty much everything on their menu, because I lived two minutes from there.  Here is the deal...  The sushi is actually better than most \"fast food-y\" type of sushi places.  They even have a HUGE platter for like $35-$40 bucks.  Been there, ate that.  Good and fed like 3 hungry teenage sushi eaters and myself.  The edamame and side vegetables are generally overcooked with the exception of the onions. (The onions are generally crunchy...bleh!)  The chicken katsu is a little dry but pretty decent in flavor and hibachi items are pretty good as well. I would stick to the combo meals if you are eating any type of meat but go on Wednesdays if you want sushi or if you're a student Thursdays I think are some kind of discount too.  There are a few draw backs.... The service is INCREDIBLY SLOW!!  You can call 15 minutes earlier and it STILL won't be done, and the parking is a b-word on the discount days.  Also, it's actually pretty expensive, with the exception of the platter and discount days.  The price of food on normal days is comparable to Ishi's or Tsunami's non hibachi side on weekdays.   Still, it's good in a pinch, and I normally play with the fish in the tank because it follows your finger around."}
{"text":"Price, food quality, portion sizes, and casual atmosphere round this gem out to be a 5-star place for lunch.  Only critique is that speed is inconsistent (sometimes blazing fast, sometimes quite slow).  Otherwise, this is our go-to for \"everyday\" Asian/sushi in Lake Norman."}
{"text":"The food is good ( Teriyaki Beef, but the service definitely needs work -- I think businesses begin to take for granted patronage. I don't feel bad they have a new Mexican restaurant moving next door, keeping them competitive and working for our patronage.  They are at strike 2 with me with service..."}
{"text":"Delicious, very ample servings for a good price, and I was amazed by their service!! Seriously, it was one of the best customer service experiences I've had in a long time. I highly recommend this place."}
{"text":"My family loves Yoshi's.  They have the best carrots I have ever eaten. I always order the kids chicken hibachi, it is a lot of food for a good price.    They serve beer and wine and have nice outdoor seating. There is a fountain and cornhole, which is great to help keep the kids entertained.  I don't like sushi so I don't have any comments about that."}
{"text":"As other's have said, Yoshi's is basically fast-food Japanese. I enjoy eating here and I think their prices are reasonable for sushi. I've never ordered something that I didn't like. I couldn't give them 5 stars because sometimes it takes a long time to get your food and the staff isn't always friendly."}
{"text":"Pretty good food, good alternative to local dishes.  Had the teriyaki chicken w/zucchini and onions as a side.  Chicken was a little dry, I was a little disappointed but nothing that couldn't be fixed with the lite-soy sauce (good on them for having it).  The rice, also a little dry/lacking flavor I'm used to - but again, a little lite-soy sauce brought out the flavors.  I'd go again - I'd like to try their sushi selection - looked great!"}
{"text":"Decent food for the main dishes, parking is a pain at peak hours, Sushi isn't the best I've had but its not the worst. Staff are very nice and helpful. Portions were decent sized too. Where its located they squeezed as much businesses as they could in there and didn't add enough parking. It is a good spot for getting food and coffee and some shopping but parking ugh...  Sorry this review isn't my best, its hard to excited about this Yoshi's. But I'd try it again. Just like the review stars say, its A-OK."}
{"text":"Half price sushi on Wednesdays is awesome! My fiancé and I got 6 rolls for around $25! Cant beat that however it's cheap sushi so you get what you pay for. Nothing special but will doo the job for a quick bite."}
{"text":"Can't go wrong with the grilled salmon teriyaki! Although everything I've ever had has been delicious, fresh, and served with a smile."}
{"text":"Love their food, the staff is nice and I LOVE that you can switch your rice for other sides which seems like a simple thing to be so happy about but most places don't let you switch out rice and if they do they charge you way more for it! Love this especially when I'm trying to diet"}
{"text":"Fast service and great lunch specials. I went with the sushi which was pretty standard though fresh and tasted good. They have a nice sauteed zucchini  side which was really tasty (especially for those who love garlic). It was pretty busy but the line went quickly and we were able to find a seat no problem. I still liked noodletasia a little better but it was still very good!"}
{"text":"1 star for service! Great food. I placed an order to go and was told it would be 30 minutes. 55 mins later it still wasn't ready. When I called  I felt as though they gave me the \"sorry, but we are busy\" speech. I also spoke with a manager and she didn't seem concerned either since it was \"sushi night\" and the girl should have told me 45 mins. Again, food is great but service keeps customers coming back."}
{"text":"Great chicken & steak combo! Delicious every time!"}
{"text":"Yoshi's is the sweet little spot to drop in for a few sushi rolls or to belly up to a large serving of hibachi.   I've routinely hit up Yoshi's and ordered their shrimp hibachi - a mound of shrimp and veggies hibachi grilled with a side of your choice over a mound of rice. All of this goodness is served with some delectable dipping sauce. Surely the sauce is heinous for you as it's a pink, perhaps mayo? sour cream? base, but it's tasty nonetheless. The shrimp is always cooked to perfection and the veggies always have a bit of a crisp to them (no mushy carrots here). I've ordered sushi from here too and while the rolls have always been fresh, don't expect any crazy combinations to come your way. They shine with basic, tasty rolls.  If you don't want to wait for your food (which, at busy lunch time can be 10 minutes or so), I recommend calling ahead or emailing your order in on their website. Their site also has details on their daily promotions which are pretty sweet, as a full hibachi meal will run you roughly $10. Not terrible, but not cheap for a quick lunch.   I'll definitely come back to Yoshi's for another shrimp hibachi...or ten."}
{"text":"Great food and great prices. Have been here 4 times now and ordered something different each time. Very fast, food is great. Usually eat sushi or do the combo 1."}
{"text":"Great sushi, great prices, Sucky Service. That is what is expected with low prices on sushi, so I am not complaining. Well done!"}
{"text":"Good beer price. Pretty good sushi and alot better service then the one in huntersville. The sushi is pretty good and the hibachi meals are good. Its a decent place to catch a good bite to eat."}
{"text":"Not up to par with its other store. The service sucks. The sushi chefs are no where near as skilled as the ones at the university store. Living smack dab in the middle of both of these i always go the other way. Great potential but you got to get a better staff in the kitchen and the front because there just flat out rude"}
{"text":"I really wanted to like this place!  My husband and I checked this place out for dinner the other night.  We both got one of the combos.  We were immediately impressed by the prices and the amount of food you get.  However, when we got our food, we were VERY disappointed.  The sushi rolls fell apart and the fish did not taste fresh at all.  I got the fried rice with my combo and it was probably the worst fried rice I have ever eaten.  It tasted very stale and reminded me of play doh. (No I don't eat play doh... but I'm sure you get what I mean.) We were very shocked because of the awesome reviews.  I did noticed that a lot of the people had ordered hibachi and not many people sitting around us had ordered the sushi... maybe Yoshi's is better at hibachi food?"}
{"text":"Love Yoshi's.  I don't live in the area but when I'm in town I love to stop in at Yoshi's. Their tempura is delicious and so is the cabbage with bacon. Portions are good sized so I never leave hungry.  Hope to visit again before I leave town.  If you're in the area it's worth a try."}
{"text":"Very good! We went after finding out Noodletasia was closed down. This did not disappoint. Ordered the habachi shrimp and sweet carrots as a side. It was delicious. My husband got he chicken and shrimp egg roll which I actually kind of like. That is actually saying something because I usually hate egg rolls. Good place to eat at."}
{"text":"3.5 stars.  I've eaten at Yoshi's many times.  It's my go-to place for quick, tasty, and reasonably priced sushi.  They are not necessarily speedy, but at least I know my food is always made fresh.  And I do think their sushi is better than Sushi Star or Noodletasia across the street.  Some of my favorite dishes include their fried gyoza, seaweed salad, shrimp yakisoba, bagel rolls, and their spicy salmon and tuna rolls.  On Wednesdays, they have half-priced sushi, and it gets packed!   If you are not planning to dine in, I recommend phoning in your order first, since the waits can be up to an hour.  I do wish they offered online ordering to make ordering simpler.  Regardless, I'll keep returning because the food is good!"}
{"text":"It's a struggle to find a decent hibachi chicken meal in the entire LKN area. Yoshi is the best of all the ones I've tried thus far... However there's so many better places in the Salisbury, Concord and Charlotte areas. I came to Yoshi's today and the girl taking my order was repeating my order (after I had told her as clearly as possible what I wanted) and she said something incorrect. I corrected her politely \"no mushrooms\" and she responded \"that's what I said\"  with major attitude . I responded \"no mushrooms AND no onions\" politely and she just kind of rolled her eyes and changed it on her register.. but I told her that when I first ordered!! And then I said I wanted a drink too. While I'm getting my money out she made a drink and sat it in front of me and I said  \"what is that?\" And she said \"Coke.\" I knew I didn't tell her what drink I wanted... wtf?? I said \"did I tell you what I wanted for the drink? I'm pretty sure I just said a drink\". And she responded \"what did you want?\" And I said sweet tea and she made it and sat it in front of me.  Hibachi chicken is good. Their shrimp sauce is too salty in my opinion. This was the only decent place for Japanese food in the area in my opinion.. But after my experience today I won't be back for a long time."}
{"text":"I'm here again and it's wonderful I just love this place!!  Having snow roll and zucchini and onions yummy"}
{"text":"Good Sushi for the price.  They have updated the decor and it looks better.  I am a little confused, or maybe I watch too much Bar Rescue and Restuarant Impossible:  I feel like they want to be a hangout (TV's, wine/beer, cornhole boards) but they can't happen with the order and pay at the window kind of thing.  It is very casual - a place to run in with kids and eat but is situated like fast food.  The wait staff is nice but a bit slow, they bring your order out but you have already paid at the window.  Anyway, I do sorty of hate the textured walls but liked the new chairs, 'Y' and bamboo backdrop.  We do like Wednesday nights, very cheap but decent food."}
{"text":"Tried it again after a long wait. Good customer service. Clean restaurant. I ordered a combo meat dish with Japanese noodles so I could really get an idea if this should be a regular stop or not.   The portion sizes are large. That's a positive. The Japanese noodles are pretty good. Another positive. However, the chicken and beef are both bland. Not positives, hence the three stars."}
{"text":"This place is a joke. We ordered 2 shrimp broccoli and zucchini dinners with a volcano roll and a salmon nigiri. The vegetables had no flavor and were barely cooked. All of the food was so bland and cold. I would not waste my money."}
{"text":"I have had Yoshi's over a hundred times and the last couple of months have been disappointing. The precooked food that has been sitting out all day doesn't taste good at all. When the food is fresh it's extremely good, but when it's been sitting out it's awful. It needs to change or I won't be coming back."}
{"text":"I'm a fan, my fiancé no as much. He thought it was kind of bland.   We both got the steak hibachi. I loved that my side dishes could be veggies instead of rice.  The steak bites were a bit small, but I was okay with that."}
{"text":"After a long time , had Japanese and this is great !! Amazing food and a lot of options for meat and non-meat eaters. Definitely will visit this place again!"}
{"text":"This was my first time here the service was great and they gave me assistance with my order. I ordered the Combo #2 which included: 1 sushi roll, 1 meat, 1 side item, and a drink for $11. The sushi was extremely fresh I ordered the spicy tuna roll. I would definitely return."}
{"text":"Good habachi. The ginger dressing for the salad (just lettuce n cut up carrots) is great. I always order 2 of them. Sushi is fresh. Customer service could be better but it's ok. My coworkers and I go here a lot for lunch."}
{"text":"Great food and good price. They have lots of options so you can be sure to find something you like. The service is awful!!!!! We continue to eat there for the food, but the ladies that answer the phones, take your order, and bring your food have ZERO customer service skills. They literally put me in a bad mood because they cannot be friendly.  Update: More recently they have been a little friendlier, but they could still be kinder/more helpful."}
{"text":"The food is great for the price, but they're slow, even call-ins. Great place if you don't mind waiting."}
{"text":"Experienced Yoshi's for the first time. Food was excellent and the staff was terrific. I definitely recommend this restaurant."}
{"text":"Sorry Yoshi's... the sushi I had today was not that great.  I know it was half price on Wednesdays which tends to slam the place with business, but for some reason I don't remember your specialty rolls being that big.  Pretty much took two bites to eat each piece....it took some fanagaling to keep the pieces from falling apart on you in your dipping cup, but I managed.  Going to downgrade you guys to a 3 star for now.  The person manning the register was a bit snippy too, but I didn't have a huge problem with it... just noticed it later when I was watching the line stack up with people trying to decide what rolls they want.  It may take me a while to come back, especially since it is a bit of a drive from the office and the parking lot here is a little short of horrible."}
{"text":"The food is amazing, however, don't even try to come on your lunch break from work because even if they aren't busy, you'll be waiting 30+ minutes at minimum.   Other than that, favorite sushi place in huntersville!"}
