{"text":"Yours Truly is a signature restaurant in the Cleveland area. The notso fries are THE BEST! The inside is decorated like a diner and aside from having a main entrance and a side one that is a bit unorganized, this place is great!"}
{"text":"Valley View location is as sleepy as the Chagrin Road store is bustling.   Generally a good place, but had a bad customer service experience with them this week. They refused to honor a Groupon for the amount I paid for it contrary to the fine print on their own Groupon offer which could not be more clear. The manager was polite, but brought another employee with him as if I was going to cause a problem. Kinda weird over-reaction for merely calling them out on the inconsistency. I left feeling like a cheap jerk and doubt I'll be back.  Update 4/6/2012: Groupon wrote me back apologizing for the situation and refunded the $7 I spend on the ill-fated Groupon I bought for Yours Truly.   Still no response from Yours Truly to an email I sent to them on the same day I contacted Groupon."}
{"text":"Tried this place yesterday since Champs had closed. It was great. It is set up like a little diner, real retro!  The food was good, so was the service. The crowd was a healthy level to see them survive but immediate seating. Great lunch spot!  Less than $10.00."}
{"text":"We love Yours Truly! Their breakfast is tasty and great value! They have a combo for 2 eggs, your choice of breakfast meat, hash browns, toast, and a drink for only $7. The atmosphere is always relaxing and the waiters/waitresses are all super friendly. We come here almost every weekend."}
{"text":"Yours Truly is a great family owned local chain restuarant.  The breakfast is great and the food is always fresh.  On the down side, it is a little expensive for the portions they serve you.  I had an $8 chicken wrap the other day which came with a slice of cantaloupe on the side.  When I got home I made myself something else to eat since the wrap was pretty small and the meal wasn't very filing.  I will stick to breakfast only in future visits."}
{"text":"I hadn't been to a Yours Truly in a while when I visited this location recently, and was greeted with a friendly diner atmosphere.  I was a little overwhelmed by the menu, which covered several different kinds of foods, though few of them were particularly healthy options.  I settled for traditional pancakes, which were good.  The food came very quickly, and I was out of there in no time."}
{"text":"Friendly greetings from multiple staff members as we walked in. Unfortunately, that was the highlight of our experience. Food is typical diner food and was average. Service was terrible. Slow and forgetful. Forgot to come to our table, forgot to bring straws, forgot to go get straws, forgot to order our appetizers, forgot to come back with check.   Too many other restaurants around. Choose another."}
{"text":"The omelet s were fluffy, fresh ground coffee, friendly waitstaff & gluten free toast."}
{"text":"So happy to have a Yours Truly in the downtown area! They have a diverse menu, the food is great and the staff is super friendly."}
{"text":"Horrible experience on a Sunday morning.  The omlette was undercooked and toast was cold and barely toasted.  The service was equally as poor.  Waste of time and they don't seem to care."}
{"text":"I have Celiac's (No Gluten), and I understand that I'm taking the future of my stomach in my hands, so to speak, every time I eat out and that I have a 50/50 chance on whether or not I'm going to get sick from a meal at an establishment. That being said, Yours Truly offers a gluten free menu, including for brunch today, gluten free pancakes, so I thought my chances were actually pretty good to come away from a meal at their place unscathed. So when I explained my allergy to the waitress and asked that the kitchen prepare them either in a separate clean pan or on a clean griddle and was told \"we can't guarantee your meal won't be contaminated\", I knew my odds had just dropped significantly. But at this point, I've committed to this restaurant for brunch with my family, so I asked if the kitchen could at least try to prepare my meal in a way in which I could eat it. With every bite of my stack of pancakes I essentially rolled the dice. I guess I will just have to see what happens (Update, I did not get sick so I'm adding a star to my previous review). Other than my gamble with my food, the service was pretty slow and the heat today both inside the restaurant and on the patio was inescapable."}
{"text":"I really wanted like this place because a dear friend is a server there. On an early Sunday evening about five tables were occupied. Two of us, it took fully ten minutes until our presence was acknowledged. No eye contact, no anything.  And then, only because I asked the manager if we should seat ourselves. Then another seven or eight minutes to get our table. I asked the manager if my friend was working and received a surly \"no\". After that, our server was prompt and friendly. I ordered the turkey ruebin sandwich and my wife ordered a Greek omelet made with one whole egg and two egg whites, gluten free toast. Our food came in good time. It was tasty. However the toast was not buttered and no butter was served on the side or available on the table. Also, the Greek omelet was missing the olives! Our server stopped by occasionally to refill waters but never once asked how was our food. The strangest thing of all, my wife's table knife was strongly magnetized. Every time she picked it up, it would drag along her spoon or fork! I found out later, my friend was in ER with severe dehydration. I'm glad she's better today."}
{"text":"The service was very slow for breakfast. We were there for 1.5 hours. Breakfast should never take that long. The server was okay, she seemed to be flustered during the whole visit by our party of seven. We ordered water but did not get it until several minutes later and after she asked again what we wanted to drink.  There was a mix-up with the food and people got the wrong things.  One of the members of our party did not get her food until well after everyone had theirs and was eating. It also took a very long time for coffee refills.  The service definitely took away from the experience.  The following are individual reviews from each of the members:    Because of the order mishap, my meal was compensated for by the restaurant which I thought was a good move, I didn't even have to ask for it. The food (when I did get it ) was nothing too special. I got the M & M omelet with a side of hash-browns, it was okay to say the most. All in all, I wouldn't return to Yours Truly for a Breakfast Club gathering, but as always, I did enjoy the company!   Ordered the Sedona signature omelet, got the M & M signature omelet instead. The omelet itself was pretty good even though it looked dried out. I would order it again if I'm ever at another Yours Truly.  The waitress wasn't good about refilling water as my water was empty the entire time.   I had the medley which had eggs, cheese and bacon in a pita. I got my eggs over-easy which paired well with the crunchy pita and crunchy bacon. It was a really good choice for a lighter breakfast (not too heavy or greasy). I'd definitely order it again. The food was much better than the service but nothing you couldn't make at home.  Sedona Omelet- cheese, ham, green pepper, and onion The omelet itself was good. It wasn't anything special, but it was better than your normal greasy spoon omelet. It had some fluffiness to it and there was plenty of ham, green pepper, cheese, and onion. The hash browns were nothing to get excited about and the portion size was small (which was probably a good thing). The coffee was actually not bad compared to regular diner coffee. The service was not very good at all. Our waitress was very nice, but not particularly attentive. If you plan on going to this place make sure you are not in a rush to get any where afterwards.   I had the Palermo omelette, it looked like a burrito, but was decently good, but nothing to brag about."}
{"text":"Yours Truly is an excellent restaurant, and it really has that classic diner feel, but with a modern twist. The interior theming is a modern interpretation of a 1950s style diner, and it's very unique. Their menu features classic American foods, along with excellent breakfast options, and some more unique items. There are lots of healthy options available for those who don't like burgers and fries, and the menu really has a lot to offer to everyone. One of my personal favorites is the turkey reuben, which is really a great sandwich, and is one of the best turkey reubens that I've ever had. The wonderful views of the Cuyahoga River, the outdoor patio, and the direct access to the towpath are all huge assets to Yours Truly, and visitors of the Cuyahoga Valley National Park and the Cleveland Metroparks often stop by for a bite to eat while taking a trip down the towpath. Yours Truly is a great choice for a nice meal with family or friends, and I highly recommend it."}
{"text":"Great service. Great food. Great location. I highly recommend this place. We had bunch and the food was awesome as well as the service."}
{"text":"Nice little find on our way back to Cincinnati. Food portions were large especially considering the affordable prices. My husband and I both had breakfast and enjoyed are meals. Highly recommend the hashbrowns. Service was good as well."}
{"text":"This place is an absolute joke atleast on a Saturday. I waited in line for over a half an hour just to get my food so I expected divine food since it was this busy. I got their Crispy Chicken Sandwich which was $10 way overpriced for what I got, $2.50 for tiny refillable glass of pop/soda.   When I received the chicken sandwich I had a very mixed opinion of it mostly negative. The chicken stood out it was moist crunchy and delicious (but so is Steak and Shakes) the rest of the sandwich was an atrocity. Some old lettuce on a bun that felt like it was made out of plastic, slightly burnt slices of bacon, fresh tomatoes and that's about it.    After paying the tip the total came up between $15.50 or  $16.50 definitely not worth while it should of been less than that. If I went to Steak and Shake I could of got a Chicken Sandwich and a Milk Shake at drive through window for a bit less than that.   That's not the worse part of it tho, the half an hour wait was the worst part with a bunch of screaming kids, people running into each other and not enough space in the restaurant to accomodate the guests plus tons and tons of noise.   I will not be making a return to Yours Truly instead I will stop at Steak and Shake or Denny's will save my self some time, money and hearing.    PS. Yours Truly on Rockside Road has people trying to rush you out of their restaurant as soon as possible since the place is too crowded and small for their own good.   GOOD RIDDANCE."}
{"text":"I've driven by this place many times. Finally tried it out and I would definitely recommend it. Great breakfast. The decor is very good. Clean place too. I will be trying out their lunch and dinner sometime in the future as well."}
{"text":"Stopped here this afternoon while on a towpath bike ride.  They were very busy.  We asked for an outdoor table and the hostess/waitress saw that a table was just vacated so she went over herself and quickly cleaned it for us.  She was very accommodating about an allergy issue and was just great throughout.  For the most part we really enjoyed our food; I just didn't care for the wafer fries too much.  It is a casual diner-type atmosphere."}
{"text":"Stick to breakfast fare and you'll be fine. A note to management: chocolate sauce is not hot fudge."}
{"text":"Stayed downtown right next to YTR for about a week. This breakfast, lunch, and dinner spot was great. I tried all three on separate occasions. Breakfast was almost exactly what you'd expect from a typical dinner except YTR brings the freshest squeezed most delicious OJ to the mix. Lunch was a fish sandwich that tasted spectacular aside from it slightly falling apart with each bite. Dinner was a burger and \"notsos\" burger cooked to perfection and the \"notsos\" we're reasonably priced and delicious. Overall very affordable and a great bang for you buck spot in downtown Cleveland."}
{"text":"I wish I could critique the food, but it never came. We had theater tickets for 7:30 and arrived at 6:30 (cutting it close, I know, but I had to work until 6:00). We placed our orders but it still hadn't arrived by 7:10. I understand that they were busy but being in the location they're in, they should know that they need to get people in and out of there ASAP. Most restaurants in the theatre district are aware of showtimes and the kitchen needs to pick up the pace accordingly. All I can recommend is to get here early and maybe you'll get a nice meal before a show."}
{"text":"Nothing special here.  Just a solid breakfast spot that offers up the usual fare.  This place is always busy when I go but the food and service is just o.k.  Never really bad yet never that great.  Every time I go, I keep waiting for the place to take their food and service up a notch, but it just stays the same.  With that being said, if your looking for a solid All-American breakfast with no frills, then this is your spot- even though they could be so much better."}
{"text":"The newest downtown YT does not disappoint!  Same quality food and great service, but in a trendier setting, including a fun bar on the 1st floor and 2nd floor balcony seating.  A great option when you are in the vicinity of Playhouse Square and are looking for a more casual restaurant."}
{"text":"Yours Truly is a great place top Stop in for a bite and have a drink while you wait. The atmosphere is cool and comfortable. The place is very clean. Food is always fresh and feels like you're eating a homemade meal every time! I used to visit the one in Medina every so often, but I was very excited to see one open up on Euclid. Great place to catch up with family and friends. The staff is always chipper and polite. The breakfast is my favorite!"}
{"text":"I have to agree with the earlier review. The service wasn't awesome and the food isn't spectacular. It is about what you would expect from a diner-type atmosphere. I know Yours Truly has a special place in a lot of hearts out there, but it is just usually ok in my book. I have had better diner food elsewhere."}
{"text":"Went here with a groups for breakfast and everyone loved their food. We were seated right away on a busy Saturday morning and our food was out in good time.  I will say though, the waiter was pretty short with us and seem to rush us out the door even though plenty of tables were open.  Would definitely recommend this place for breakfast! Unsure how the other meals go here."}
{"text":"It doesn't get better than this place for comfort food or the best omelet your money can buy in NEO. Friendly service always, and I love the family atmosphere."}
{"text":"DIRTY.  The silverware was caked with dried food.  One of our glasses of wine arrived with pithy fruit residue on the side of the glass and lipstick already on the glass!  The server said the glass must have been intended for a mimosa?!  Floors were sticky in some spots, greasy in others.  My chicken was rubbery and undercooked in certain spots.  Officially done with this place.  It's filthy and the food is sub-par.  The Board of Health needs to shut this place down."}
{"text":"Yours truly?  Sounds like I am signing off a letter to someone I really like.  Well maybe that's perfect for this place as I really liked my breakfast visit the other day.  We went on a sunny Fall Sunday.  Given this restaurant is situated along the Erie Canal Tow Path, there were plenty of changing leaves and scenery to delight the eyes.  The important thing to note is this restaurant sits at the back of a complex.  Turn at the chocolate place in the gray building and wander to the back and you should find it just up from the parking lot.  I was warmly greeted by the host who immediately found me a table in the diner section- a little odd as my booth felt like it was floating in the room but it was spacious and I knew the server couldn't miss us!  Our server, Carina, was terrific!  Always quick with a coffee refill and a quip, here is someone who loves mornings and seems to love taking care of people in her section as well.  My friend had the \"Killer Skillet\" (looked amazing with 2 eggs, hash browns, sausages, bacon and toast) and I had an omelet (they have several reciped ones but I went with my stand by which was quite tasty and served with some crispy bacon on the side.   If you want fruit substituted for the potatoes or toast- it will cost you an extra dollar and I just didn't think the small cup of mixed fruit was worth it.  Most places these days will sub it out for free.  But the prices are reasonable with breakfast for two coming in around $25.  But the food was good, the location convenient and the service spot on!  And given this was a Sunday morning- I expected a wait and yet there was none.  Score!  I always love it when a plan comes together!"}
{"text":"Hmmmm, I don't think I will be returning to this place any time soon.  Why? Well, the food was bad, the restaurant loud (I mean really loud) and the booths were very uncomfortable.  I swear there was a foot between me and the table!   On the plus side, our service was excellent.   I'm just disappointed that we blew $35.00 on lunch and didn't enjoy it.  I had a simple soup and sandwich--how bad could it be, right?  Bland soup, and a very crunchy sandwich, no lettuce, no anything--dry as could be.   We walked out and said never again!"}
{"text":"My burger was delicious.  My entire family wanted it.  This location was nice. The kids liked it.  Our server was outstanding.   Although we are visiting the area, we would consider eating here again when we return."}
{"text":"I was spending a couple days in the area and used YELP to help me hunt down breakfast spots. There are the usual Denny's and Bob Evans...but life's to short to go that route (if possible). Yours Truly was a short distance from the hotel, and on the Erie Canal towpath. The path is one of the reasons I was exploring the area, so I tried it out. I ended up eating here both mornings. Nice fast service, the food was fine (had to send back some burnt bacon, but the second attempt was really good) and a bright clean atmosphere.   I'll eat here when visiting the Cuyahoga Valley National Park again."}
{"text":"Ok not great. Average diner-style food. Nothing special, good for picky or boring eaters. Not the best place for foodies."}
{"text":"Nice location on the tow path river there. Plenty seating and a big patio, clean bathrooms with 2 extra outside the entrance. The food was what was to be expected given the fair price. Pretty big menu with the options typical of a diner. I had a burger and a salad and it was cooked well, french dressing was really sweet. Service was pleasant, we were checked on often while things were quickly brought out. Will enjoy going to this location again."}
{"text":"This was the first time I've been to this Yours Truly location. Nestled in the Halle Building on Euclid Avenue, this YT really has a lot of character.   Two of my coworkers and I went here for lunch around noon on a Tuesday. The restaurant was busy but we got a table right away and were able to choose between sitting upstairs or out in the little patio area. We chose the patio area (it opens up into the Halle Building, not outside) because it was different and frankly, we didn't feel like walking upstairs.   I think my biggest regret about my visit here is not remembering our waiter's name. He was so friendly and attentive (but not overbearing) that I forgot that's what REALLY good service is like. Although he made some great suggestions on food choices, the three of us were all set on having some variation of the tuna salad. The other two girls chose the tuna melt and one got an order of the notso fries. I chose the Choose Any 2 option and got the mushroom barley soup (the soup of the day) and the half tuna salad sandwich. Much to my delight, they were out of cups to put the soup in and so I was given a free upgrade to a bowl of the soup. IT WAS DELICIOUS. There were actual sliced mushrooms, the barley was perfectly cooked and the broth was very flavorful. The tuna salad was also delicious and prepared just the way I like it: not too much mayo but just enough that you don't need to put extra on your bread.   I would definitely recommend Yours Truly at Playhouse Square in the Halle Building to anyone. I also hear they have delicious breakfast all day! :)"}
{"text":"I went to this location for an early breakfast before work. The staff was incredibly attentive. My coffee glass was never less than half full. The manager and I believe the owner both took time to ask me how my food was and if I needed anything! The food was delicious - I got the eggs bruschetta and the bread was crusty and delicious while the veggies were super fresh. I absolute recommend this place for a quick, friendly, delicious experience!"}
{"text":"50's diner theme - check extensive menu - check  My in-laws took us here for lunch on xmas eve.  It was a nice change of pace and much needed break from all the meat and starches that I had consumed during the week.  I opted for the Napa Salad, which consisted of baby spinach, grilled chicken, walnuts, gorgonzola, grapes, dried cranberries, and a side of house made vinaigrette. I must say, not bad for a diner, and i was very appreciative that my chicken wasn't overcooked.    I'm sure we'll be back sometime in the near future to sample the rest of the menu.  I loved the location and the proximity to the canal; it made for a nice scenic drive after our meal."}
{"text":"It was a typical diner but with less food options. I don't think I would go back. I ordered a burger in hopes that it would be served with fries, but it was only the burger. I don't think I would go back."}
{"text":"So it was NYE, and my boy LT and I had just finished the final work out of the year. Obviously it was important to nourish our bodies after one last grueling work out. LT being in love with Cleveland decided to take me to a spot just a block or so from his apartment. As we trudged through the slush and below freezing temperature, I began to wonder and question LT's thought process. Walking in, I loved the vibe. Large space that was clean and diner-like. The menu was extensive, and they actually had hash browns! Not the \"home fries\" stuff. I got the Kill-it Skillet. Amazing proportion. Asked for over medium eggs and actually got over medium eggs. Good diner food. Great service. Would definitely come back if in the neighborhood."}
{"text":"Anything wow, the food took a long time, like 45 - 50 min, and we were only like 4 tables! It's good, but not sure if I'll repeat."}
{"text":"Very friendly staff, a large space, and nice seating downtown. I'm told by my friends that the mimosas good. I only ordered breakfast, which was below average. For the eggs bruschetta, the eggs were over easy, but rubbery on the edges. The dish included too much spinach (I think it was blanched or sautéed), which overwhelmed every bite. In my opinion, they needed to spice the spinach, decrease its amount, and perhaps add another green to it, such as dill; or switch to another green entirely such as arugula.  I also ordered half a Greek salad, which was huge. I actually asked the waitress when I got it to make sure it was the half order. The components were fresh and flavorful, and the kalamata olives were of exceptional quality, but it was doused in dressing, again overpowering every bite. When the lettuce was pushed aside in the bowl, I could see about 1/3 inch of soupy dressing sitting on the bottom.  I also took a bite out of a friend's order of the monster hash. It was good, but had more cheese on it than potatoes, keeping with the theme of unbalanced ratios of ingredients.  About 8 of my friends and I ate there, and none of us walked away wowed by his/her dish. Overall, the meal was subpar. The chef needs to revamp the menu and recipes."}
{"text":"Love this place it's food is always fantastic. Great breakfast and lunch. The kill it skillet is delicious, so are the waffles. They have real malts served with tin cup. Sweet potato fries and sliders are wonderful too. Excellent atmosphere inside like 50's diner, and outside patio by the tow path is beautiful."}
{"text":"We decided to try Yours Truly Restaurant for breakfast. It was a 10 min walk from our hotel. The restaurant is located at Playground Square. It has a pretty prime spot.  We opted for patio seating. I wanted to people watch and plus the weather in Ohio is AWESOME! Our server was Mae and she was an absolute sweetheart. We decided on the Barcelona Omelet and the AM Wrap Up.  I didn't have a chance to taste my boyfriend's omelet he pretty much inhaled all his food. Needless to say, he enjoyed his experience. LOL! I, on the other hand, was so-so about the AM Wrap Up. The eggs were pretty bland. It didn't have any seasoning to them. I tried to use the salsa to jazz it up but to no avail. The Italian sausage was okay but nothing spectacular. My food was just okay.   I'm giving it 3 stars because the server was nice and my boyfriend enjoyed his food. I think I might have gotten the wrong food. My bad. So, if If I'm ever in the Cleveland area again I will try it again."}
{"text":"Friends frequently gather here as it's a good east vs. west location and convenient to everyone.  I have always had the notso omelet.  I'm not an omelet kinda girl but this one is delish!  Service is always hit or miss.  They also struggle to accommodate groups of more than maybe six."}
{"text":"Love this place! it's my \"go-to\" restaurant. This YT location is right on the border of the Cuyahoga Valley National Park. Their food is outstanding and the prices are very reasonable. Try the Eggs Bruschetta or Gorgeous Omelet for breakfast... you wont be disappointed."}
{"text":"Great dinner tonight before a show for 10 of us! Erica was fantastic!  Food pleased everyone and the service was unbeatable. Very casual and clean space. Would recommend to all!"}
{"text":"I remember going to this place when I was much younger, and the food was great then, but now, I'd have to say....IT'S STILL GREAT!   They've refurbished this little dinette since my visit many years back, but the food and service are still great. I had one of THE BEST omelettes I've had in a long time at this Yours Truly and with a side of english muffin, it was all superb. One of the things that makes it both quaint and difficult; the size. This YT only seats, and this is an estimate, maybe 20-25 people. If you're looking for \"intimate\" then this place is it.   However, there's decent parking, and the prices are good as well.   So, if you ask yours truly where I'd go for a great bit of breakfast/lunch fair with great service and good food...you'd know what I'd say;)"}
{"text":"Delicious, quick breakfast. Omelette wasn't greasy, very light and delicious! Pancakes were fluffy and over easy eggs cooked to perfection! Great service and price for the money!"}
{"text":"What a great breakfast/brunch place! Came here for brunch on a Saturday around 10 AM and were able to get a table on the upper floor for four people right away. It was already starting to get packed that early.   Their menu offers almost anything you can think of for breakfast, including Bloody Marys and Mimosas (grapefruit or with orange juice). I had the corned beef hash, which was quite filling and very satisfying.   Their prices aren't too bad and you can get coffee, eggs, toast, and hash for under $10. They have gluten free options too, which can be hard to find for breakfast/brunch.   Their location near Playhouse Square is right downtown and only a 10 minute walk from Public Square. It is near the Healthline or the train at Tower City, if you are looking to use public transit.   Yours Truly is definitely on my radar now, especially since they have a location in Shaker Square. I'll have to come back to try more of the breakfast variety and non-breakfast entrees."}
{"text":"I had lunch here today with my daughter. I stop in here once a month or so and generally have a great meal and great service. This afternoon, I waited 27 minutes for a glass of wine. It came out a minute before my entree. Kept trying to find my waitress but she disappeared for a half hour. Brought me the wine with no apology or reference to how long it took. Really bush league service. Very disappointing. Next time I'll ask for a server I've had and have confidence in."}
{"text":"The bartender Ryan is great! Very attentive and caring. Truly enjoyed our experience!!! Great spot"}
{"text":"Love this place. Stop here for breakfast on my way back to D.C.  Straight up diner atmosphere less the hike boxes at the tables"}
{"text":"Food quality, services and price were awesome!! Strongly recommend 'the Sunrise' for breakfast!! Truly enjoyed!!"}
{"text":"A great child friendly place. My children absolutely loved the train table and the children's menu. The food was delicious and the service was great. Our family will definitely be dinning there again."}
{"text":"Food: Delicious diner comfort food. I went for breakfast and had perfectly cooked scrambled eggs, hash browns that were golden on top and almost creamy on the inside, and buttered toast. I also had a single pancake that was fat and soft. If you're looking for that kind of a meal in downtown Cleveland, this is the perfect place.   Decor: There is none. It's half suburban looking diner, half industrial space with exposed pipes and a concrete floor. The walls are painted a boring white and gray. Of course there are televisions all over which annoys the heck out of me. I wish this place had tried for something a little more fun and designed and a little less suburbs-in-the-city. It could've been a real standout place that had spark and life. Right now it looks like any other place you'd seen in Parma, but with an underfinished quality.   Service: Good but unfriendly. My server didn't smile once. She never came back to ask how things were or check if I needed anything. It's yet another example of this city's real need to train staff on basic customer service rules."}
{"text":"Fabulous experience.... check them out.  You won't be disappointed! Great on all aspects! Nice little gem"}
{"text":"Hostess was unpleasant and seemed overwhelmed. We were not greeted for almost 5 minutes. Took about another 5 to be seated, though there were about 8 open tables. Food was average and so were the prices. There was nothing wrong with it. I'm not sure if I would go back."}
{"text":"Service was lackluster, had to wait a while for refills, but food did come out fast and accurate.  Portions are too small for breakfast for the money, they try to fill you up with toast. My breakfast was a bit undercooked which is a huge No No and safety violation. Also i feel like they can do a world more with their current menu selections.  Lastly my server was touching her hair the whole time and then touching our food which had me paranoid that i was gonna find a lock of hers in my food. thankfully i didnt but they definetly need training on whats kosher for customers."}
{"text":"You totally get your money's worth. The food portions were huge in my option, which is a good thing. I had the hearty Mac n cheese which was very hearty; I somehow managed to finish the whole thing. The service was great too. Since I have certain allergies I was sure to let my waitress know who in turn told her manage I believe who came out to confirm with me. Long story short, they go out of their way to make their customers happy. I'll be back when I get the chance!"}
{"text":"One of my favorite breakfast spots, and always on my list whenever I visit CLE. They have the best orange juice I have ever tasted, and the \"kill it skillit\" is AMAZING."}
{"text":"This is exactly a great place for downtown.  A restaurant in downtown Cleveland area that is reasonably priced with very good food and service."}
{"text":"Service: We walked in and was greeted by Sam who had a awesome personality. Then our waiter Joey came over whom had a matching awesome personality. Sam took our drink order and Joey brought them right over. We didn't even wait 2 minutes. Food: There was so much on the menu that looked good, but we came in for breakfast, so we flipped to the very back of the menu. All of our food was cooked up our liking and very flavorful. Space: There was plenty space. Downstairs, upstairs, and the bar area."}
{"text":"Yours Truly is a great local restaurant chain that serves all day breakfast (yes!) and a variety of other amazing dishes. We like to go here for weekend mornings, meeting friends and family for other breakfast or lunch. The coffee is always great and fresh. They also make a decent Bloody Mary.   My personal favorite dishes: Notso Fries (seriously, amazing. Dangerously calorie laden though) Napa Salad Eggs Bruschetta (something a little lighter for breakfast but still filling and delicious!) Killit Skillet (for those days where you are super hungry)   Check it out! My biggest issue with YT is that they're so busy that it's often a long wait to get a table, even for just 2-4 people."}
{"text":"The food was okay, the monster hash is good and everything else was okay. I was almost disappointed with the service. They were really busy when we went, which is fine, I understand things get hectic and busy. We waited for a while and the manager ended up taking our order. Unfortunately he got my order wrong. We were on a time crunch so I just said I would take eat what they gave me, and I didn't notice until after we left (again in a rush) that I ended up paying for the full cost of the wrong order - most of which I couldn't eat. I wouldn't normally care but it cost almost twice as much as what I wanted.   I understand that this particular place had just opened, so I understand there are always kinks. I would try it again - just go with a lot of time and really go over your order at a slow speed. Service was nice, just disorganized."}
{"text":"I come here for breakfast fairly frequently on the weekends, and it is always a pleasant experience with very tasty food.   However, this past Saturday there were some major issues, and it took 15 minutes before a waiter even came to our table, and even then our drink and food orders were messed up.  Also, our two dishes came out at completely different times.  Not sure what was going on, but I think there was a problem with one particular waiter.   Near the end of the meal, I asked the manger if we could have some sort of a discount due to how bad the experience was (which is something I essentially never do), and instead of giving just a discount, they gave us the entire meal for free.   I am leaving 5 stars because the experience is usually great here, and the one time the experience was bad, management was truly sorry for the issues and completely made up for it."}
{"text":"Great basic breakfast food. Nothing is too fancy. Just classics for the most part with small changes. Big fan of the omelettes (I have ordered the Notso omelette a few times!). I think there are better and more interesting breakfast places in Cleveland, but when my family and I want something nearby and good, we go here!"}
{"text":"Office ordered lunch. I picked chicken salad melt. Absolutely disgusting, looked gross, tasted gross. Just hope I don't get sick from the few bites I had."}
{"text":"I frequent this location pretty regular basis. It's clean, affordable, and they make the tastiest Eggs Bruschetta. My only complaint is the service can be slow. If you are going for lunch make it a long one because you won't get back to work in under an hour."}
{"text":"This place was very good. I would highly recommend it for breakfast.  The service was great and the pricing is very reasonable.  I tried and omelette as did the two people with me.  All of us thought our food was very good."}
{"text":"Great place for casual dining and fast service. Menu is HUGE, lots of salads and sandwiches along with their all-day breakfast menu (the reason I picked it to begin with). Not a good place for vegans, but vegetarians have some options. Our server, Alyssa, went out of her way to make sure the omelettes were dairy-free if ordered without cheese and talked to the cook about how my husband wanted his egg made on the breakfast sandwich. I enjoyed my vegetable omelette, the egg was fluffy and not oily on the outside like at some places and it had lots of veggies that seemed like fresh cooked ones, not frozen veggies. Even the cup of fruit that came as a side was better than I expected and included fresh berries- yum! My husband and I enjoyed his food as well: buttermilk pancake and egg breakfast sandwich. I will go back when I'm in the area."}
{"text":"Some friends and I had breakfast here a few weekends ago. We sat outside and it was very pleasant with a light breeze. It has a great outside spot. The meal was good and cooked to order. My only comment would be the rye toast was a little too hard, maybe toasted a bit too much. But other then that the eggs were perfect as well as everything else. The food seemed to take a while to come out though. The service could have been a little better (but the girl was very nice) and I have had much worse service at other high class dinner restaurants. I am planning to take a friend there soon while the leaves are changing colors."}
{"text":"Very cute little diner. Good service and lots of choices for breakfast. I had oatmeal with strawberries and bananas and also the traditional Lebanese hummus. The hummus was probably the best I've ever had, and the oatmeal was almost too much to finish! Nice views through the windows around as well."}
{"text":"I've been in Cleveland for a year and this is worst food we've eaten. In all fairness, the service was fast and friendly and the decor and atmosphere were pleasing   We visited on a late Friday afternoon for lunch. The food arrived quickly, but I would've waited longer had something better arrived.  I had the fish fry, fried fish and french fries.  The outside of the fish was burnt but inside the batter was still wet, the cottage fries were obviously frozen and my guess - freezer burnt too.  I'm not against frozen fries, especially at a diner, but they were really really bad - dry mushy insides with a limp exterior.  The accompanying coleslaw was tasteless!  My husband had the gyro, which was even worse.  I'm pretty sure the meat was from a frozen package, heated, then placed on thick, stale, tasteless pita bread - no tomato, no lettuce, no onion, just a thin spread of what they call tzatziki.  No side on this dish.    Our expectations were not high, after all it's diner, but even a diner has to have standards.  We won't be back."}
{"text":"Nice place right off the towpath. Food wasn't out of this world, but it was good. They serve smoothies and your basic food items. I got the buffalo chicken wrap and coleslaw, both were good. They also have a nice patio you can eat out on. I'll continue to come here, more for the convenience of being right off the towpath, but again the food was solid."}
{"text":"This place was great.  The food and service were spot on and the patio over looking the canal was very relaxing. Will definitely be visiting this place again the next time we are near."}
{"text":"Where do I begin ... I ordered a drink , real simple nothing fancy just kettle and soda but the soda was flat. This was followed by hummus and pita bread which the hummus was overtly lemon zesty , heck all we tasted was lemon. The pita bread felt reheated and old and that just ended the whole experience  here. On the bright side out waitress was very sweet and cheerful but the rest of the entire experience was more disappointing than a wet London summer."}
{"text":"We went for dinner tonight, and I think the word that sums it up best is BLAH.   Two of us had the fish fry. Blah. Fish was almost devoid of flavor. The accompanying fries... blah. Again, tasted like nothing much. The cod dinner? Blah. Mild to the point of almost no taste, although the accompanying vegetables were good. People often talk of reasonable prices here, but we felt we paid way more than we should have for the food we got.  The Notso Fries appetizer was good, but it's pretty hard to screw up a plate of fries covered with cheese and bacon.  Service-wise, we had the kind of server that completely ignores the fact that anyone at your table is talking and just completely talks over you. That about sums it up."}
{"text":"Its an adorable location, I was with a big group in the loft space and our waiter was perfect in handling all 20 of us. I got the french toast and a mocha coffee, which was way better than the mocha at Peet's or Starbucks. The toast was nice and more than anything Im in love with how reasonable the prices are.  Check it out!"}
{"text":"Good quality food for a fair price. Bartender was very attentive. Mac N Cheese is pretty good."}
{"text":"Went here for breakfast today.  Fast, friendly service, reasonable prices, good breakfast."}
{"text":"Very good, had the envelope and notso fries. Great service. Will be going back very soon!"}
{"text":"open on Labor Day? check. central location for a bunch of my family to meet up? check. decent prices? check. diner menu? check.  Yours Truly seems to be a small chain of diners in Ohio. the fam took me here for my goodbye meal before my flight.  I was in BREAKFAST MODE, so I ordered the \"Barcelona omelet\". big-ass omelet with jalapenos and onions, with some really spicy salsa on top. I destroyed the whole thing in no time. ordered the cottage fries with it - these were similar in appearance to ruffled potato chips, but with the thickness and texture of french fries. pretty good.  the homemade lime-ade was tasty too.  the benefit of having children at your table means they never finish their meal. now, one of my cousins and his housemate are on Weight Watchers, so I used that as leverage to guilt them into ceding the kids' leftovers to me. bahahahaha! sampled some bacon (crispy and delicious), breakfast sausage (a bit spicy and greasy, as it should be), and a chocolate chip pancake (okay).  service was decent. at 11 AM it was somewhat packed, so service lagged a little. our waitress was quite friendly.  there's an outdoor patio area, which is pets-friendly.  solid diner place. nothing outstanding but not bad."}
{"text":"This was a staple of my childhood! The envelope, notso fries, and milkshakes are the best! I love the one in downtown Chagrin, but the restaurants in Mayfield, Mentor and in Beachwood are also great! The service is usually friendly and fast, plus the food comes out hot and quick. I often take visitors who come to CLE here to eat. The seating is spacious and like a high end diner. Prices are reasonable I just wish they served beer and wine!"}
{"text":"Sunday breakfast before the game and it was a pleasant experience. The food was quality and served hot. I had the sunrise breakfast which was good. The atmosphere family friendly. Definitely recommend and will visit again."}
{"text":"The food is good a cheap here with a lot of options. I come here a lot because it is close and convenient but I actually think the staff here is consistently nice but totally incompetent. Don't assume you'll be in and out, more than half of the time I come here they completely ignore me. I have seen a lot of reviews saying the staff is great but as a consistent customer I have to say it's a great place but with consistently the worst service."}
{"text":"Hadn't been to a Yours Truly in a while. Had a mostly good experience here. Enjoyed by veggie quesadilla and monster hash. Despite the crowd, we were seated right away. Service was the main issue this visit as they got my order wrong, but they did make it right.  Would return here before going to a show at Playhouse as the food is filling and they seem to get orders out fast."}
{"text":"Enjoyable atmosphere right on the canal. The old style diner feel is great. Very affordable and the omlets are great."}
{"text":"Waited 15 minutes for service and it wasn't even busy.  The waitress that seated us threw our coffee on the table and walked away when I asked her a question.  So rude!"}
{"text":"So happy this place opened up right around the corner from my place! Came here on a Tuesday night and there were plenty of seats available. The restaurant is much more spacious than what it seems like from the outside- they even have an upstairs area and some seating that extends out into the Halle building lobby.  Our waitress was bubbly and very attentive without being overbearing. We ordered the burger with the fried egg on top (forgetting the name now!) and the egg was PERFECTLY cooked. My boyfriend got the General Tso's Chicken which came with 2 sides (we got mac & cheese and saffron rice) along with a huge side salad that could have been a meal on its own. The chicken was just as tasty as typical general Tso's but much less MSG and oil.  The food and décor are casual but that's exactly what we wanted in our neighborhood! Would definitely come here again."}
{"text":"I dont understant how anyone can like this food. Everything is pre made highly processed crap. Anyone can pull food out of a bag and heat it up.  The buckeye chicken sandwich looked like someone stepped on it and the bun was soggy. The mac is comparable to hospital food, burger was plain and overcooked (ordered medium/ got well done), and the natso fries were natso great. The only reason why  i give it one star is for the decor"}
{"text":"Nice little place with that diner feel feel to it.  This was our first trip to this chain and we went there by chance.  It was just my wife and I and we were looking for something with a more relaxed setting.  We knew it was good for us when we walked in and foundation kids play area near the front door.  Meals were fairly priced and everything was good and served hot.  The reason I gave it 4 instead of 5 is because there really wasn't anything exceptional about it.  Just good food at good prices with good service."}
{"text":"Monday late morning brunch...place was 90% crowded during that time (always a good sign).  Our large party was seated almost immediately, however.  The food was good...I had the corned beef hash w/2 eggs.  Nicely done.  Everyone else (including the five kids in our party) seemed happy with their food.  Refills were frequently made, too.  Only complaint was how long it took the food to get out from the kitchen.  We were running a little late for our movie as a result, and we tried to order pretty quickly.  Minor issue."}
{"text":"Very good! We had a variety of food including chicken sandwich, tuna, chili, hummus and Italian sausage. Everyone enjoyed their food and the service was great."}
{"text":"I love this place. The food is fantastic with great variety. The people that work there are extremely friendly. I love the culture of family there. I visit this location at least once a week. Its a must visit!"}
{"text":"The food here is really good.  I don't know why, but I love diner food.  I was up here yesterday and ordered the Palermo, but instead I got some omelette with mushrooms and tomatoes.  I was so hungry, I didn't even bother saying anything and ate it anyways.  I got hash browns and a side of rye toast with it.  It absolutely hit the spot.  The hash browns weren't as greasy and salty and I like them, but my cardiovascular system is thankful for that.  We sat at the counter and our server was attentive and nice.  I was here back in May of last year, and it was a great experience too.  They also sell beer and wine.  I will be back."}
{"text":"Great spot for any meal. Quick, friendly service, good prices, and something for every American tastebud."}
{"text":"Love this diner.  Open kitchen, great vibe in a retro feel.  Lots of TV's, great food and friendly awesome waitstaff.  The food is yummy. Always busy with a great bar to eat at.... and love the all day breakfasts you can get.  Highly recommend this place."}
{"text":"I moved here recently and love breakfast spots, so I decided to try it out. You have to walk up stairs to get to the restaurant which the location is beautiful, with an outside patio. Kristina waited on me at the counter, alongside a couple other guests.  She was welcoming as soon as i sat down.. busy, but attentive, efficient and very friendly.  Everyone was smiling while busting their butts!  I ordered the M&M.. Muenster and mushroom omelette. It was delicious! Great place!!"}
{"text":"Eggs benediction     I was in town to see family and we decided on yours truly for Sunday brunch.  We just beat the crowd and we're seated immediately yay.  I tried the eggs Benedict since i have never had it and all the cooking shows have their competitors make the dish.  It was fantastic!  I'm not a big eggs eater but I scarfed it down in a hurry.  The prices were very low too.  I definitely recommend"}
{"text":"Great service. Very good breakfast. Coffee was very good. Highly recommend this location. Going to a play and they were very. Accommodating."}
{"text":"My wife and I love this place for breakfast. You can't beat the atmosphere if you enjoy a small diner - like place. We often stop by while biking on the trail and it has some outdoor seating during good weather.  The lunch and dinner menu is good as well but I prefer the breakfast offerings. The service has always been great as well."}
{"text":"My wife and I are here at least once a week. The staff is friendly and fantastic. The food is always done right and quick. If your looking for a quick reasonably priced lunch or a nice laid back dinner, this is the place to come to."}
{"text":"Great breakfast alternative for those staying at the hotels off Rockside at I-77. Lots of windows overlooking old Ohio & Erie Canal.  Terrific omelet with Gorgonzola cheese and Canadian bacon.  Cottage fries are a rare find anymore.  Waitress was a little Scotch with the coffee.  Just a great place to start the day-- you'll know it when you walk in the door."}
{"text":"I recently ate here on 2 separate occasions.  One never expects diner food to be excellent, however most diners I have been to carry with them a standard of high service.  Unfortunately, I cannot say that Yours Truly meets that same standard.   One of my visits was on a busy weekend and the other during a slow weekday dinner. Both times food was mediocre, and worse still was the attentiveness of wait staff. It is crazy to me when the managers at such establishments come by, and ask how everything is and you kind of think to yourself \"Are you kidding me?\" For what it's worth, the food is o.k. as far as diner foods go; actually the menu is quite large. The service however really leaves room to be desired"}
{"text":"Had the chicken salad platter for lunch today with a side of sweet potato fries and it was horrible.  What a disappointment."}
{"text":"I was not particular fond of the waitress we had. She seemed very uninterested and was trying to get everyone in and out as soon as possible. I'm not sure if she was having a bad day, but the service from the waitress was left to be desired.  Besides that, the food was absolutely delicious. I had a very good omelette and the pancakes were soft and fluffy, full of flavor."}
{"text":"Great restaurant, really glad to have one downtown near my apartment. Food is always great. YT is a Cleveland staple for comfort food. Unfortunately the service is lacking half the time. Had terrible service yesterday. Otherwise it would be five stars."}
{"text":"We get incredibly fast service every time we go here. Dunno if we are just getting lucky or what. Anyway the sweet potato fries are ridiculously good here with the tango sauce. My girlfriend and I always get the Monte Cristo because it's one of the best sandwiches we have ever had including the offerings of many higher priced establishments. To top things off we really like the \"oldschool\" feel of the diner and the music that they play. After moving up here from Cincinnati we've had a VERY hard time locating a decent restaurant in Cleveland when compared to Jeff Ruby fair and the local establishments I frequented down there. I'm not sure if it's just the economic downturn in Cleveland or what but it's most definately NOT \"rocking\" my taste buds. =) This Yours Truly is a diamond in the rough for us."}
{"text":"Yours Truly is one of those places where they have a huge option of choices from breakfast to lunch. As good as some of their lunch options are (sweet potato fries are super yummy), I have to say I usually always order breakfast! In fact, I normally order the same thing every time I go! I have to say my favorite is the Gorgeous Omelet. It has Gorgonzola cheese, ham, spinich....and you can order it with egg whites too. Great spot for brunch with the family and the Valley View location has the cutest little toy train table to keep the little ones occupied if there is a little wait on a busy Sunday."}
{"text":"Love this place! Good service, great food, we always recommend it. In fact, we drive 20 minutes, every week to come here!"}
{"text":"Great Sunday brunch spot! There are many options to choose from that are inexpensive and very tasty. I got the sun cakes which was 2 eggs, a choice of meat and 2 pancakes. I was happy and it was a great way to start my Sunday."}
{"text":"Met a friend for brunch last Saturday & was totally disappointed in not only the level of service but the quality and taste of the food.  The omelette center was runny and uncooked and the extra side of \"peppered bacon\" greasy and under-cooked.  The noise level was HIGH and a chaotic environment topped it off.    I remember the first Yours Truly that opened in Shaker - now, that was service & good food!  Rockside location needs quality control ..."}
{"text":"This is the first yelp review I have every written so that proves that I was so impressed! Daniele was our server who was super friendly and positive! Great server! The food was so good too! I got the salmon which was very good! My sister got a cheeseburger with fries and she said it was one of the best meals she ever had! My mom got a house salad with chicken salad which was great too! I wish there was one of these restaurants in Wisconsin, where we are from!!!"}
{"text":"Great little spot!  Came two mornings in a row, and loved the French toast, hash browns, orange juice, pork sausage - all of it was far better than your average breakfast spot."}
{"text":"Spinach salad was awesome. Enjoyed lunch so much I'm taking a friend back for dinner. Dinner was ok. Stick to lunch. Not really a dinner spot."}
{"text":"Usually good burger kind of place. Today our server stinks & our app that came with our dinner was burned.  The hair in my ranch dressing was an especially nice touch.  The only saving grace was that Damon the manager was very apologetic and nice. He's the only reason I would return."}
{"text":"I've only had breakfast here, multiple times.  It's a walk away from my apartment building, and some mornings, especially after a hefty night of drinking, we pre-order some breakfast dishes to go and walk over to pick it up. The prices are average/above average, but the portions are HUGE, so the price is fair.   I've had many of the omellettes (the veggie is my favorite). One night after seeing a play in Playhouse Square, my boyfriend and I found ourselves at Yours Truly buying booze and ordering breakfast for dinner. Worth it.  The layout of the restaurant is super cool. We usually sit at the bar located to the left right when you walk into the restaurant, but some times we find a booth that overlooks the streets of downtown Cleveland.   It's a great little place, and the quality is up there. The portions are big so the price is worth it. They also have an INSANELY awesome happy hour booze menu.   I'll remain a regular at Yours Truly."}
{"text":"Really like Yours Truly! Have been there twice for lunch. Nice atmosphere and good service. Parking is a little challenging. I have had the Greek salad with chicken and the turkey club with sweet potato fries. Both meals were very good. Definitely recommend."}
{"text":"Really enjoy Yours Truly. This is the first time I have visited this specific location. Went for breakfast on Sunday morning with my family. They weren't too busy so we didn't have to wait for a table. The layout inside is pretty cool and a bit different. I got the Sunrise breakfast with eggs over medium, bacon, hash browns and gluten free toast. A little bit greasy but pretty tasty. The service was decent. We didn't wait long for our food. We did have to ask for additional silverware and for a drink that was forgotten about. We didn't have issues finding street parking since it was a pretty quiet Sunday but during a busier time, it might be more challenging. They only have street or garage parking nearby. Overall, it was a good experience. I would definitely go back if I'm near downtown for breakfast."}
{"text":"We came here because the reviews on yelp said this place was really really good but after waiting 30 minutes for a table to end up sitting at a table that was way too small to sit at and then the food coming out cold. The food itself was mediocre at best, Waffle House grade material. I wouldn't suggest this place to anyone"}
{"text":"On my way back from Omaha to my home state of Massachusetts (the land of Massholes and middle fingers a-plenty) we looked on Yelp for the perfect breakfast place, and lo': we found it here at Yours Truly. The menu was extensive and we both ordered omelettes. They were fluffy and filling and they certainly didn't skip on the ingredients. I liked that we could substitute home fries or toast for a fruit cup or grapefruit. Our hostess was very friendly and seemed happy to accommodate our request for tea. Our server was good enough but perhaps she had been there too long as she just didn't seem to have as much spring in her step as the hostess. One of the owners was there to help seat people and help out with checking on our food, which is great to see! If I ever stop by a Yours Truly again and it is just as nice, then five stars it will be!  For the price you're paying, the food seemed good and you have a lot of choices. I also really liked the atmosphere as well; cozy and Christmas-y without being in your face."}
{"text":"First time at restaurant. The place was clean. Being a vegetarian, it is difficult to eat out. Melanie, the waitress was very accommodating. I ordered an omlette , no cheese. INTEAD of fried potatoes, she substituted rice.(and dry toast.) When billed, the omlette plus 3.00 for egg beaters and I was charged 3 dollars for the rice which should have been instead of junky fries., so the price was jacked up. I am disappointed for the overcharging. Thanks Melanie for not adjusting the bill when I brought it to your attention. The food is good, but billing is questionable."}
{"text":"Stopped by to have breakfast here on my visit to Cleveland and it's a nice diner/breakfast restaurant. The menu was diner-like, but it was a bit fancier than a diner. There are also a few TVs inside for those looking to catch their news or sports. It was a Sunday morning at 10am and for a party of 4 we waited for about 15 minutes, which wasn't all that bad. The restaurant was pretty big, with some counter seating and outdoor seating available as well. I took a look at the menu and it was extensive! There were tons of items on there and those menus are the ones that get me because I can stare at them FOREVER and not be able to make up my mind.  I eventually settled on the Killit Skillet with a side of Corned Beef Hash. The Skillet came with two eggs (mine were sunny side up), bacon, sausage, golden hash browns and a toasted ciabatta. I couldn't complain about a thing on my order as everything was perfect. I especially loved the ciabatta as it was toasted with some butter on it. The side of Corned Beef Hash didn't look like the most appetizing side, but it was still good. The service was also excellent as our waitress was very accommodating with our requests during our visit. A solid breakfast choice if anyone is ever in the area."}
{"text":"Had a voucher and got 2 salads for $11. They were very fresh. I got the Napa Spinach Salad. It had grapes, cranberries and strawberries plus walnuts and a raspberry dressing. Had lunch here with my friend and we really enjoyed it! I haven't been here for a year."}
{"text":"Providing an exceptionally refreshing respite from the woodsy workout of the towpath, Yours Truly--just a quick ten or so steps up from the trees to the cozy patio--astonishes. It is the epitome of I-know-why-the-old-folks-flock-here comfort food. Cheap drinks ($6 vodka-enriched summer limeade packs an unexpected punch--though it was a tad too tart for your reviewer) and scrumptious meals (looking at you textured/tasty veggie burger wrap--wouldn't have known you were a frozen patty affair had the server not unwittingly disclosed it) combine to create the perfect forest lunch. The foodstuffs are served hot and appear surprisingly swiftly, particularly the fried artichokes which were the perfect synthesis of juicy and crispy-rich. It should be noted that dogs aren't allowed on the patio, a rule enforced with an iron fist, though some hungry hikers got their grub to go and munched outside of the awning at benches in the sunlight. This sad dissing of Fido aside, however, YT's patio is a perfect fair weather perch for ravenous, (and God forbid) spandex-clad bipeds."}
{"text":"No, no, no, no, no. Every time a work colleague or friend wants to meet here this is what I want to say, but I always go anyways. I eat the over priced egg salad sandwich or the lackluster over priced pancakes, dry bread sandwich or runny omelet and try to enjoy the cool location, but I would never pick to come here. No. I'm sorry. I really held off writing this review, but after so many visits and signing checks for lack luster food, I'm speaking up and saying no next time. This is obviously my person opinion because people love this place, but since so many people love it, they can find someone else to meet them instead of yours truly."}
{"text":"I want to give them a better rating, I really do, because it's a cute little restaurant with nice people and a tastey menu, located in cute little Valley View.  But their service was once again horribly slow when I visited a second time, and it wasn't even busy.  We seemed to have 3 or 4 waiters randomly serving us at different times, all 4 of which vanished when it came time for getting our check and paying.  It was ridiculous how long the check/payment process took for them.  And we had to kind of grab the waitress's attention as she hurriedly gave us our check and tried to leave to ask for a box, she never offered, which is bad service considering how much food we had leftover.  They need to work on this!"}
{"text":"Average food.  Breakfast is good, but how hard is that . Great space Very clean  Nice decor Great location Expensive Below average service."}
{"text":"This would actually be a 2.5 stars from me - but the rest of my party had no issues.   Pro: Nice place in a decent location.  Staff are extremely friendly and accommodating.  Neutral: Not great for larger parties.  Don't accept reservations, but will take \"phone ahead requests\" - whatever that means.  We had a party of 8, and I'm guessing on a normal busy morning we'd have been split between 2 booths - as it happens, a similar party was just finishing up as we arrived. We got a corner booth and they added a couple of 2-tops right in line, seating us all just fine.  Cons: While most everyone had a decent meal - mine was a disaster.  I ordered the corned beef hash - as did another in my party.  My feeling is that they did not realize there were TWO identical orders for hash - as my food arrived many minutes after everyone elses.  That was not a huge deal - what WAS a huge deal is that it was essentially raw.  Cold and the potatoes in it were crunchy. Further - the description on the menu lead me to believe it was \"home-made\" hash - what it actually was was Dinty Moore from a can - the typical fare of $1.99 breakfast greasy spoons.  HOWEVER - when I told our server that it was uncooked - WITHOUT HESITATION she said it would come off the bill.  Others in my party got the \"eggs bruschetta\" and that looked awesome (and was well received by the 3 that had it).  Another in our party had a monte cristo with sweet potato fries, and that looked excellent as well.  Prices aren't outrageous, the coffee is decent. Just don't order the hash.  The friendly staff is the saving grace at this place.  I'd give it another go based on that alone."}
{"text":"We were in Cleveland for the night and had dinner reservations at a high end restaurant. We stopped in here because it was next to our hotel and thought \"why not\". Well, it was GREAT we wish we would've stayed and ate there instead spending $100s elsewhere for food half as good. The drinks were amazing, which we didn't expect because they were SO CHEAP! We had an appetizer one day, and returned for breakfast the next day. Definitely would recommend it! And our bartender/server Erica had a great personality and we just loved her!"}
{"text":"Awesome service, food came out fast and it was delicious. I would recommend you try it. And they serve breakfast all day."}
{"text":"Not especially friendly service. My burger, clearly of the frozen patty sort, was undercooked. \"Fries\" were flat discs that tasted more like packing material than food. Location is nice, right by the river, but the service and food quality made this an overall bad experience. Will not return. Ever."}
{"text":"This place is seriously one of the best places around I go there almost every weekend for breakfast and the prices and the menu are both great the food is amazing and it's always quick and done right and made perfectly and everyone there is really nice if you're around that area or looking for a spot for breakfast lunch or even dinner it's definitely a place to check out I recommend going there."}
{"text":"The breakfast was quite good. The omelettes were cooked to perfection. If your staying at the Crown Plaza it's great to head next door. The prices are fair and relatively inexpensive.  Great atmosphere and lots of places to sit."}
{"text":"Took a recommendation from a local on a good breakfast place. This place smashed it!!!! I had the corned beef hash it was great, it took up most of the plate. The waitress was excellent and informative. If you are staying in the Playhouse district, put it on your list."}
{"text":"Great location near the towpath but overall not impressive. I ordered a burger with fries. I don't remember which burger exactly but it came with cheese, bacon, and pickles. No lettuce, no tomatoes, nothing else on the plate. It was okay but it seems to me that if you order a burger at some place that serves it on a plate instead of in a bag, you should get all the stuff to put on it. Basic stuff. The fries were those weird food service round disks. Okay but not great. My friend got the sliders and was full at the end of the meal but not overly impressed. She ordered cole slaw which was, to our amazement, the best part of the meal. It was really good. The cole slaw. Beers cost $3.50 domestic, $4.50 import."}
{"text":"As a non-Clevelander and a non-east sider it took me awhile to get to a Yours Truly. Once I did, I really enjoyed it. I was so happy to have this location open downtown as it is a great spot for breakfast and lunch. My go to is the chicken wrap with cottage fries, cole slaw and tango dressing. It is somewhat basic, but the tango sauce is elevates it. I love the fries, but have to pour a good amount of salt on them because they are intentionally unsalted. The fries taste great dipped in the tango sauce or ranch."}
{"text":"Came here on Mother's Day with my cousin ,hoping to have some good breakfast, but I end up not eating because the waitress misheard what I ordered . I ordered what was called the Sun Toast on the menu , and that was suppose to be French Toast with powdered sugar and some kind of meat on the side . What I got was the Sun Fest, which came with two eggs , toast , and a bowl of fruits . I was dissatisfied at that moment, because I'm not a fan of fruits and I have to have meat so I can be full , but there was none of that on my plate, so I ask to look at the menu again just to make sure what I ordered was correct. I told the waitress that she can just cancel my order. She then asked if I wanted to order something else , but I told her \"no because it took a whole thirty minutes just to bring a bowl of fruits with some toast and two eggs out. I don't want to wait any longer \" . After that the manager came over to apologize and asked if I was sure that I didn't want to order anything else . I felt bad that the manager had to come, but It wasn't a big problem or anything . I'm satisfied that they manage to have a manager like that . Hopefully  , next time there will be a waitress that will repeat my order just in case of miscommunication, because I really want to come back and see what this place have to offer ."}
{"text":"Disappointed. Service was slow and inattentive. Scrambled eggs didn't taste like real eggs. Sausage and bacon were both undercooked. Cheese was processed cheese. Home fries frozen. Would not recommend."}
{"text":"Great little place for a good breakfast!! The staff is friendly and always in a good mood. Orders are takin fast and the food is prepared quickly and it very good. The coffee is hot and you cant go wrong with the Four Buck Breakfast. Nice choice of omlettes to choose from. Always clean!!"}
{"text":"Stopped here after reading a Yelp review or 8. Dinner. The host was sweet and funny. Sat us right away. The menu is not too long to get lost in or be ridiculously undecided. We got the Buffalo Bites-excellent. White chicken, moist. Maybe a little too much sauce but we just pushed it aside. Burger- wonderful. Moist, huge, nice bacon. And the NotSo Fries. What? Like a thick cut potato chip still soft in the middle crunchy on the outside. Covered in cheese and bacon and a spoon of sour cream. (Would make a great drunk treat). Service was on point. The atmosphere is great-wide open, glass, high ceilings. Overall a great pick for any meal. We will definitely be back."}
{"text":"Had Breakfast this morning and it was delicious. I had the Notso omelette which was 3 fluffy eggs stuffed with crisp bacon, hash browns and cheese. Topped with sour cream and served with toast or hash browns. The raisin toast was very good. Service was fast and friendly."}
{"text":"Yours Truly or Mine Falsely? Everything in this universe is impregnated with its opposite. Take Tom Petty's classic song \"Into the Great Wide Open\". The opposite would be \"Out of the Bad Narrow Enclosure\" which basically means the same thing.   The breakfast is good. The service is also. I love the tile floors and the old fashioned feeling I get when I am there. The restaurant is right next to the Tow Path and there is some nice nature to observe. I always go for the Sun Burst or something like that. It is 4 or 5 dollars and comes with 2 eggs, fruit salad and a slice of toast."}
{"text":"Great diner.  Headed here for lunch and got a burger.  It was cooked perfectly and tasted excellent.  Highly recommend you give this place a shot.  The waitress also kept the cup filled with water.  I always appreciate that.  Prices very good too."}
{"text":"We were staying in Independence and looking for something local, cheap and with lots of options. This place definitely did the trick. This was actually my second time here and both have been super good.  We weren't super hungry so we got the soup and sandwich/soup and salad option and it was the perfect size. I had the chicken noodle soup, which tasted like home. I also upped my salad and went with a cesar. I wasn't a huge fan of the amount of pink peppercorns, but it was good nonetheless and much larger than expected.   At our table we also had the chicken salad sandwich, which was very fresh with apples and grapes. We also had their version of loaded fries which were really good! I like the flat shape of the potatoes and they sucked in the flavor really well.  In addition to the food, the people here were great. You could tell it was a local-home-type place and I would definitely go back."}
{"text":"My husband, son and I come to YT about once a week.  The servers are very sweet and the food is AMAZING!!!   Omelettes are so big and fluffy and the veggies are fresh and plentiful.  The portions are big and their prices are very reasonable. Their coffee is the best I've ever had in a restaurant.  I also recommend the Tuscan Chicken wrap.  It is amazing with their sweet potato french fries."}
{"text":"It's a convenient, delicious, well priced, diner in downtown Cleveland. The service is great, and it's nice to have a decent priced sit down place near Playhouse Square."}
{"text":"I was visiting some relatives in town and they took me to this restaurant Yours Truly. The atmosphere was real nice, very family oriented. Their hummus was very good (surprisingly) and their fries were real good too. I like to dip the fries in the hummus =) All the food was pretty good and well priced. And our waitress was really nice which made the experience that much better. I would definitely come back."}
{"text":"I love this place. The food is delicious! I  highly recommend the Teri Tosser salad. The outdoor patio is a nice touch. The restaurant has a nice ambiance, which is important to me. I've been here at least half a dozen times, and have never had a problem with the service. I think the pricing is fair. The only thing keeping me from giving this place five stars is the wait time. Sometimes it takes a little longer than I would expect from a restaurant like this. I will definitely continue to eat here."}
{"text":"Seriously doubt you will find a better breakfast in the Cleveland area. The ambiance is nice, friendly waitresses, and the portions large. The hashbrowns are particularly good."}
{"text":"My son and I were there for the first time yesterday for our mommy/ son valentine dinner. The food was decent but is was absolutely freezing in there.. We were wondering if the heat was even on. I saw some of the workers layered up also."}
{"text":"Awesome new addition to playhouse square and downtown Cleveland. Next step make it 24 hours. Love the current diner hours though. Nice inside. Very friendly staff. Fast service. Can't ask for much more as a resident nearby."}
{"text":"So great to have Yours Truly in downtown CLE!! Awesome selection of food, always delicious. Friendly and attentive staff! Couldn't be happier about this new addition to the downtown food scene."}
{"text":"Great menu with several vegetarian options. The service is fast and friendly. Most items are scratch made (hummus, veggie burger). Family owned and operated. Very consistent. We had the hummus and two veggie burgers. All very flavorable. We also had sauted spinach and onions."}
{"text":"The setting at this yours truly is beautiful and the staff is so friendly and create a great energy. The veggie omelet is delicious and cottage fries are a great side with the omelet. We had a quick fresh breakfast this morning and enjoyed a hot coffee with cinnamon. Always a go to for breakfast or lunch. The sante fe omelet is really good as well."}
{"text":"Went to Yours truly for dinner before a movie around the corner with a few friends. I thought the decor inside was so cute. A modern day diner- just a little cleaner :) The service was great.. The waitress knew we were trying to make a movie and since everyone came after work, we all arrived a bit late after being stuck in rush hour- cutting into the time we gave ourselves for eating. But she was great- she made sure she expedited our order and was attentive, friendly, and provided fast service! The food was also great! We all shared the Lotso Notso fries- they're basically little potato homefries smothered in cheese- what's not to like about it?? I LOVE breakfast for dinner, so I was glad I had the option of that along with a HUGE menu of regular food items. I got the Killit Skillet without the bacon or sausage and it was delicious! The food is reasonably priced as well! I know I'll be returning to YT for dinner and probably a few hungover breakfasts! (I'll probably try another location closer to home - hope they live up to this location)!"}
{"text":"I actually liked it here, food was decent. Prices were GREAT! Service was good. Very open space, large windows. Plenty of brunch options, and nice staff."}
{"text":"Considering how many times I've eaten here, I can't believe I haven't written a review by now! The nutshell version is- I really enjoy coming to this place. It has a diner feel, but with what I consider to be a little better quality than your average diner. I always sit up at the bar and get great service by the women up there. On a typical Saturday late morning, it wouldn't be uncommon for their to be at least 5 screaming children, which is why I try to get there a little earlier on weekends. I've ordered off their lunch and breakfast menu, and I have to say I enjoy the breakfast the most, even though their burgers are pretty solid. My favorite thing to order is probably the eggs benedict- they serve it pretty traditionally with English muffins and Canadian bacon, and I'm never disappointed. Overall, I just like the feel of this place, as well as the consistency. I think it's a good place for a casual lunch meeting, or a weekend brunch."}
{"text":"This place is great.  Good food and reasonably priced along with great service.  Also has a wide selection."}
