{"text":"Very nice place in downtown, the staff very friendly and the food super tasty. Definitely I would recommend this restaurant to my friends."}
{"text":"I've been here a couple times so far. The first time was for the lunch buffet which was $16.95 a person. We went right at 11:30 so we were the first ones there. My coworkers and I were pleasantly surprised because there was more variety than we thought. The food was pretty good and they served fresh naan to every table. I was happy to see that because at some other restaurants the naan is just served at the buffet so it's not hot and crispy. We ate so much we couldn't function the rest of the afternoon.  They also have lunch boxes and charge $1.89 per 100g. I went back last week for the lunch box and its great for times you don't want to stuff yourself and be in a food coma. Naan is complementary with the lunch boxes. I thought there would only be a couple pieces but there were 4 pieces and they made it fresh too! They sure know how to make a foodie happy."}
{"text":"Nice place in downtown Calgary, very authentic. It's fresh. I loved Channa murgi deserts."}
{"text":"I just took a date here after remembering having an excellent meal here a while ago. My date was a vegetarian so we ordered three veg options and some naan and that was the perfect amount for us.  We started with the paneer tikka, and after that I knew we were going to have a special meal. The paneer was quite flavourful which I find is uncommon. Most paneer has almost no flavour, but the light charring of the tikka brought out the delicate but real flavours of Yuga's paneer. Also, I usually don't like cooked green peppers, but the paneer came with grilled peppers and onions that still had some snap to them but were fully cooked through. I ate the grilled peppers with almost as much pleasure as the paneer.  For mains we had the baingan bharta and fish curry. These dishes complemented each other really well. The baingan bharta was ever so slightly sweet and the fish curry was savoury and piquant. Both curries had serious amounts of flavour and real, fresh spices that would occasionally burst like little flavour grenades from a coarse cut of ginger or coriander. The naan was exactly right, crispy in some places, chewy in others and singed with that tikka smoke just right.  This was one of the best Indian meals I've ever had. I wanted to share this especially because they don't seem to get many sit down diners in the evening and I want them to stick around for a long time!"}
{"text":"They served under cooked chicken in biriyani . It was around 8.30 pm take out order. I think they were busy to close shop. I will not visit this restaurant again."}
{"text":"We stopped here on New Year's when we discovered our favorite Sushi place was closed. This was so good. The best butter chicken I have had in Calgary and there was a lentil dish that was weird but tasted so good. We have talked about it ever since."}
{"text":"Got a lunch box to go from here today and was very impressed!  The lunch to go they had was a buffet style. You just help yourself and fill up your box, and they charge you by weight. The buffet spread actually had much more variety compared to other Indian restaurants, and everything seemed very well-prepared. There were a few items I havent seen in any other Indian restaurants, so I was super excited to see those!  This is South Indian cuisine, so a tad bit different from the 'Indian' food most people are used to eating. They had a bunch of veggie options too! My whole visit was less than 5 minutes, so I can't comment much on the atmosphere or service (although the lady was polite and nice), but the food was great!  Will definitely be going back! :)"}
{"text":"I eat at the lunch buffet here around 1-2 times a month. Its a bit pricey at around $20 after tip but what you get for that money is a good variety of fresh and tasty Indian dishes and hot Naan bread. A few dishes change day to day for the buffet and they are not greasy like some Indian places. I love the fish curry here since. Also the desert selection maybe limited but they are solid Indian deserts."}
{"text":"I should have come and take the box to go.   16.95 for lunch buffet was pretty expensive.   I had butter chicken, tardioo (spelling) chicken, delicious naan, good salad, and rice with meat.  They were great!!!   Just wish they can offer the low price for lunch."}
{"text":"Lunch buffet is great! Slightly expensive for a regular lunch affair but worth it off you want to spoil yourself!  Selecting of foods is great. No charge for Naan bread which was fresh and delicious.  They also have a take out box for lunch which you can fill up from the buffet and pay by weight. This would be a good lunch option.  Staff was friendly and were attentive even though it's a buffet."}
{"text":"Yuga offers decent Indian lunch buffet.  Hot Naan basket gets delivered to your table which compliments the hot dishes at the buffet like Butter Chicken, Kadai Beef, Paneer, 2 kinds of Daal, Vege Curry with potatoes and peas, Fish Curry that's so good.  Also, there are appetizers like tandoori wings, papri chaat, raita, onion bhanji (pakora) - one of the best I've ever had!, and 4 kinds of desserts - marble-sized sweet gulab jamun, warm rice pudding with almonds, fresh fruit salad (apples and cantaloupe) with mango custard, and ras malai (quite sweet).    All in all, a good buffet."}
{"text":"Veg Manchurian appetizer is delicious and was a great recommendation from the staff. The entrees looked small but were actually a lot of food. Overall delicious meal.  We tried to order too much rice and the server stopped us -- Thanks! Then we proceeded to order too much naan and nobody stopped us -- .  The only major drawback is the time it took to get the food -- way too long for a near empty restaurant."}
