{"text":"New owners required another visit. 

How can a place that does so many things right still be so wrong??? Bean sprouts, peas, and carrots in the fried rice told me that somebody knows what they're doing....until you taste the rice and it's minute rice.

Plenty of cabbage, slivers of pork, mushrooms, and julienned water chestnuts in the Pork Lo Mein told me that somebody knows what they're doing.....until you taste the blandness of the noodles and sauce.

General Tso's Chicken was like pieces of slag making you afraid of breaking a tooth. 

No return visit here until new owners take over once again. You want good Chinese take-out you have to stick with Frankie's Wok up the street. 

This place also committed the ultimate fast food sin of the owners placing a tip jar on the counter. I never understood this practice and think it's very shabby. You OWN the place AND work the counter....why the tip jar???


I was a one man sandwich shop owner and tips never even crossed my mind."}
{"text":"Awful.  Our lo mein and spring rolls smelled and tasted awful.  I literally spate out the first taste of the spring roll, it was so awful.  I would never, ever order from them again."}
{"text":"Good food, great prices and fast delivery! Perfect snowy Sunday night dinner."}
{"text":"The food has changed and not for the better.
I think it is under new ownership with new family recipes that are not good."}
{"text":"Having eaten here more than a few times, I think I can write a fair review.  

For American Chinese food, it's just great.  Big portions, cooked properly, not skimpy on the ingredients.  And the rice seems to always be flavorful and perfectly cooked.  

The interior is spare: just a few tables and chairs. But it's kept clean and quiet.  People eating here is a rare sight but they get to go orders almost non stop...a good sign.  

Go eat there, get the Ma Po Tofu and just enjoy (and wonder if you're going to be able to finish it all!)."}
{"text":"Well, I'm sorry to have to give this place one star but today I have to. We ordered food for delivery today...both dishes of Sesame Chicken were unedible! 
We were unsure if that was actually chicken in there...I will spare you the description but it was mostly cartilage and fat of whatever it was. The sauce was so thick and gloppy stuck together gelatin-like that you couldn't even mix it to cover the meat (?) and rice. And speaking of the rice, it was way overcooked. Just all around terrible so basically I just threw my money out because no one would eat it. I've never experienced it this bad here...I thought about calling to complain but figured they wouldn't understand me anyway.

And I have to add to this that the name of this place is just tragic."}
{"text":"We ate dinner here last night and the food was excellent! I ordered online which was very convenient. The woman behind the counter was friendly and my order was done when I arrived in 15 minutes. We had General Tao's chicken, curry chicken, wonton soup, and pork lo mein. Everything was wonderful. 

We will be getting dinner here again. I'm excited to have a place like this so close."}
{"text":"I'm not sure why there are so many negative reviews on this restaurant, the food is delicious.  I grew up in Brooklyn, NY, married a southern bell, and spent 5 years overseas eating some of the best foods ever. After living in the Cleveland area for 6 years now, one thing this area lacks is good food spots. The food is great, the service is great, they deliver. The restaurant is super clean, and the food is actually seasoned well. My family and I eat here at least once a week and we can get enough.  This food is good, I will never travel to any other Chinese restaurant, enjoy!"}
{"text":"Easy online ordering service. Prompt and accurate delivery. Food was delicious! General Tso's was exactly as expected with the white rice perfectly cooked and egg drop soup was tasty and hot. Very positive experience."}
{"text":"They speak broken English, they deliver, their prices are fair, the food is decent, and it's the best option for Chinese food delivery in the area.

If you're looking for anything better then you'll be wearing something other than sweatpants or gym shorts to get it."}
{"text":"This is my favorite Chinese restaurant in the area and I've eaten here a good 25+ times. I have a few favorite dishes and stick to them. The steamed dumplings are the best! My favorite by far compared to any others that I've tried. Also, for main dishes we go with the Sweet & Sour Chicken, Sesame Chicken, Beef Lo Mein, and Lemon Chicken as regulars. My wife's favorite is under the \"Healthy Dishes\" -- the Steamed Tofu with Garlic Sauce. Additionally, the Wonton Soup and Egg Drop Soup are also good. 

Looks like this place has gotten a lot of bad reviews from one and done quitters and lame complainers with meaningless opinions about the fish tank and the like. FYI this place wouldn't be in business over 10 yrs if it was unsanitary and had health violations, so I'll trust the health inspector has done his job. Personally, I've never gotten sick eating here, either.

Again, as far a Chinese places go, this would be the first place I would recommend someone try in the Cleveland area."}
{"text":"Awesome take-out, delivery Chinese food. There shouldn't be bad reviews here. No it's not P. F. Changs but excellent for the $$."}
{"text":"PROS
-Menu options. Like many Chinese restaurants, the menu is very lengthy and offers lots of choices.
-Value. I got the sesame chicken lunch special that came with fried rice and an egg roll (and fortune cookie!) all for $5.50 today. 

CONS
-Taste. The sesame chicken was pretty standard. The fried rice, however, left a lot to be desired. Egg roll was just okay as well.

BOTTOM LINE
-I might go back and try something else, but I definitely would not be getting the fried rice again."}
{"text":"This was a fun one.  From the half filled goldfish tank with more than a bakers dozen of large fish in it, to the hocking of pho designer sunglasses and jewelry, I know this was going to ether suck or be a rare treat.  

I ordered my pu pu platter and began to wait.  Should I buy some D&G sunglasses 3 for 20 bucks?  Or some Gucci merchandise? Or maybe I should move so I don't get permanently stuck to whatever substance was on the floor.  During the entire wait, The (I assumed) owner was in a very heated conversation on the phone.  I did not speak the language, but it was very intense, and borderline uncomfortable.  So to pass the time I made up my own dialogue for the argument.  Which now is about what the best Pink Floyd album is.  The person on the phone was for Dark Side, but the owner was solidly for Wish You Were Here.  We all know its The Wall.

The pu pu platter?  Crab Rangoon - average; Chicken - rubbery; Dumpling - rubbery; Ribs - rubbery; (pattern?) Beef - rubbery; But a great deal I got on a set of Dior sunglasses."}
{"text":"SPOILER ALERT!!!! Total garbage. I gave this place 1 star even though it deserves NO stars. 

Pros: absolutely none, unless you're a fan of puking
Cons: you will leave hungry because after the first bite, you won't want  to continue
        - once walk in, you will think twice about your decision
        - the chicken I had tasted like...I don't know what it was but it was not good
        - carry-out food was does not come in your standard chinese carry-out box
        - no fortune cookie
        - made my car smell 
        - your day will be completely ruined knowing you even went there"}
{"text":"They deliver which is a huge plus for the neighborhood, but what they deliver is sub par American chinese food in smaller than average portions. I was not impressed the two times we've ordered and after the 2nd order arrived far past estimated delivery time, I won't be placing another order."}
{"text":"This is one of my to go places when I want to have authentic Chinese food near my work place. The place is small yet tidy and the service is decent. Their portions are big so order accordingly. 2 plate of ma po tofu was enough for 3 of us

3/30/2018: I came here for the Nth time for collecting my to go order. Tofu family style and chicken lo mein have become one of my favorites from this place. I ask them to make the dishes extra spicy  as I'm fond of hot food however you can ask them to prepare them the way you want.

6/28/2018:
My usual order from her is either one or a combination of these dishes:
Vegetable lo mein
Chicken lo mein 
Tofu family style with white rice
Curry chicken
Lunch special vegetable lo mein with egg roll
Hot and sour soup

The thing I like about this cute little place is that unlike most of the Chinese takeaways, they do not add sugar to each and every dish they make. High 5 for that. I'll keep adding items as and when I try them ."}
{"text":"This place is probably a health hazard! It's stuck in the 1970's and is dirty. There is a fish tank that is breeding bacteria and fungus. It's just gross. Don't waste your time."}
{"text":"Are we sure this isn't a \"front\" for something because they certainly don't do chinese food well!"}
