{"text":"best ?? of my life so juicy so fried so big so yummy literally highlight of my day   I would come here again!!! ?? for life"}
{"text":"It's on the second floor of the main complex. Was a tad hard to find but the food was worth it"}
{"text":"This little BBQ/dumpling restaurant is tucked away in a quiet corner upstairs of the Times Square plaza. I came in about an hour before closing one evening but food came out quick, piping hot, and in large portions. We ordered the beef slices in chilli oil (cold dish), spicy wontons, lamb with carrot dumplings, BBQ cabbage, lamb skewers, and chicken heart skewers. Beef slices were delicious! My only complaint is a few too many peanuts on top. Spicy wontons and lamb dumplings I've definitely had more flavourful ones that weren't mushy on the inside. The skewers were perfect for me; not overly seasoned or overcooked. I'd come back for the cheaper prices."}
{"text":"Tried this place out a few times and you will always walk out full and satisfied. Most of their dishes are fresh, big, and hot! If you go there for the ambience/ service, go elsewhere. Their northern style charcoal BBQ on a skewer is pretty good and I am sure it goes well with their cheap beers. I haven't yet tried their BBQ \"BULL PENIS\" but I am sure it might suit others. You have to try out the BBQ chicken wings on a skewers! It tasted so good and crispy. Dumpling is so-so and I have had better. I like their noodle selection as their have the ones with soup and the \"lo mein\" style as well. They made their noodles extra spicy so you might have to ask them to tone it down on the spiciness if you can't handle it."}
{"text":"Food was inexpensive and the portions were pretty big. I loved their beef pancake wrap, I've never had one with so much veggies and I loved it!  The noodles surprisingly came on a huge plate again with lots of veggies, and tasted okay. I prefer the smaller portion from Asian legend which comes with thicker sauce, more meat and bean curd but my husband disagrees.  They definitely can improve on cleanliness especially cleaning out their dirty chopstick holders (look at the rims in the picture). These holders are empty so not sure why they wete on the table. It was gross to look at,  we didn't notice before we ordered or we would have walked out."}
{"text":"Food: 2 stars Dan Dan noodle is quite spicy and there's next to no soup, just some sort of spicy oil with mysterious topping of minced meat? Peanuts? A little dry and a little too salty. There was barely any peanut flavour. Quite disappointed. If you like oily spicy noodles though, this might be right down your alley.  Lamb dumplings were pretty juicy and tasted only  slightly gamy. Little too much skin on the dumpling and the skins were a little too soggy and tasteless. I mainly just ate the filling. Sad to say but I have had better Dan Dan noodles lamb dumplings elsewhere. I would not recommend this place.                                                             Ambience: 3 stars Very hidden restaurant located on 2nd floor of times square building. It's actually more spacious than you would think looking inside from the entrance. Nice simple decor inside with large windows looking out onto highway 7. Not sure if they newly opened but everything looks pretty new and clean.                           Service: 2.5 stars Lost some stars from lack of effort. It's prime lunch time and it's completely empty but upon entering, server seemed indifferent and not very welcoming. Very minimal service. Most if not all signs at the front of their store is in Chinese so I'm not sure if they're doing a promotion but I got 10% off my bill."}
{"text":"Another Dumpling BBQ Northern Dim Sum offerings opens up in the area. I cannot comment how Yummy is the dumlings and bbq but I can tell you it was a fail in other areas.  Seriously if restaurant wants a down time in between lunch and dinner it is totally acceptable as kitchen staff does work really hard during rush time. But don't give customers the attitude if they want to give you business at off peak hours.  At first I thought because I don't speak the language and did not order a table full of food, but the other table of 2 got the same indifference treatment.  Spicy Noodle ($6.99) ???? has a nice balance of sour and spiciness which I enjoyed. Something really homey and rustic.  Will I be back? Not likely. As there are now so many places in the area that serves the same thing with at least a smile and thanks me for my business.  PS. Why the couple got served hot tea in a pot and the waiter had to ask me if I want a glass of hot water? I don't deserve to have tea as a single diner?"}
