{"text":"I went there for a quick smack since I did not have two hours for omakase.    I had the chef choice chiralshi  right at the bar.    They include a decent salade and Miso soup.   Decent portions of quailty fish.   (As good or better than japango around the coner- but minimal wait and we are not  in Tokyo.    So now I only cone here for premium sushi.   $35 plus tax.  Please do not compare the prices to the McSushi places on queen.     Japanese trained sushi master who uses quility fish/ techiniques from Japan."}
{"text":"One of the best authentic Japanese restaurant I've been too. I believe this restaurant was recently opened. The interior decor is very simple. Dark and wood. I like it.   The sushi and sashimi were perfect. From the rice to the fish. Usually I find Saba (mackerel) very fishy but it wasn't at all. The selection of fish were all fresh and sweet.  The head chef was was very creative in selecting the fish. Definitely recommend this place"}
{"text":"Bottom line: Don't go this place, you will regret it. There are many good, at least better, restaurants around, with the same or even lower price range.  If someone tells you the food here is good, that person is either lying or s/he really needs to explore Toronto more.  But the worst thing there is the service.  One of us ordered a sushi roll dinner set. She waited until the rest of us have finished ours. Then asked a waitress when her order will be brought. We waited for another 5 - 10 minutes and asked another waitress the same thing. After 3 times we were irritated and just asked for the bill. (Yes, we placed our order at the same time, there is no misunderstanding or anything)  Guess what? The sushi roll came!  Then it was the final surprise Yutaka prepared for us: we asked to split the bill and the waitress there literally divided the total by 4. And we all ordered different things with different price  So, respect yourself, don't be fooled by the declaration like we did."}
{"text":"I have been here twice now and loved the food each time! They have the best Japanese food I have ever tasted. Everything is very fresh :D I recommend both the lobster and kaisou salad; although everything I tried was fantastic."}
{"text":"Personale cordiale e giovane. Pronti a rispondere ad ogni esigenza. Abbiamo mangiato il Ramen....buono!!! Il maiale sapeva di vecchio. Ambiente da curare meglio.  Tutto un po' caro rispetto al cibo e location."}
{"text":"This restaurant is very good. The service is nice and the food is delicious. Even the bathroom is sanitary. The food is a bit expensive compared to our homeland of Vancouver but for Toronto it is ok. Yutaka also seats a lot of people unlike Japango around the corner which seats 15 and it's like the size of a closet.Recommend."}
{"text":"I liked the new interior of this restaurant. Service is friendly. 15%off for grand opening. I had the toro which was quite good, very fresh sashimi. Their grilled items are also quite well done. It's a little of the expensive side but I liked the quality. Will be back."}
{"text":"Just forget it ! I went there yesterday on a business trip. I found the Sushi, the service and the environment rather mediocre. The Miso soup and the wine was a desaster."}
{"text":"We got the sushi dinner, the sushi maki, and the soba noodles for an early dinner. Amazing and such friendly service! The sushi dinner included spicy salmon roll plus some other sushi rolls. The fish was fresh! Loved the experience here!! Def will be making another visit"}
{"text":"We ordered a beef tataki, grilled mackerel, negitoro roll (fatty tuna), and a spicy scallop roll. Although a very small sample of the entire menu, these items were absolutely delicious compared to the same or similar dishes at other sushi locations.   The beef tataki was very fresh, gently and thinly seared on the outside, and served with two dipping sauces of sweet wasabi and ponzu with green onions.   The grilled mackerel was perfectly crispy and grilled on the outside while the inside remained juicy and tender, providing that iconic mackerel taste grilled mackerel lovers crave.   The negitoro roll was the best roll I've ever had, period. The chopped up fresh fatty tuna mixed with thin rings of green onion rolled up and topped with more fatty tuna results in an extremely succulent and flavourful bite, a medly of flavours combined in perfect matrimony.   The spicy scallop roll was decent but not something I would crave or even order again  ahead of other varieties of sushi, although this might be a personal preference. Nonetheless the roll was still high quality as the rice used in both rolls we had here we're very distinct and seasoned well.   Overall, great place from the few items I've tried, will definitely want to go back and explore other things they have to offer!"}
{"text":"Dined here the last night, never been a fan of seafood, but the way the waitress, Sherry, explained the complete menu for a while 15 minutes, that drew my interest and we ordered 5 dishes, and none of them was any less breathtaking than the other. Fantastic food, especially the lobster and the sushi. Would go there again and again and again!  And just ask Sherry to be your waitress! You'd love it!"}
{"text":"Very comfortable ambiance.  Sushi was excellent and reasonably priced.  There is a normal menu (printed western style) and a handwritten menu that added some character to the menu experience and reminded me of some small restaurants in Japan I visited."}
{"text":"We had a lovely dinner. The food was delicious, and the servers were charming. The portions were good - not huge, but satisfying to all of us, and the price was reasonable. Nice place!"}
{"text":"As a previous reviewer has stated, this location used to house the Garden restaurant which had to close its doors due to unfortunate circumstances. The management have now renovated it and turned it into Yutaka Japanese Cuisine. I went here last week and it's disappointingly mediocre.  I will start off by saying that the food itself tastes good (nothing special though), but is incredibly overpriced in terms of both quantity and quality. The same quality of food can be had at kyoto for much less money, and Japango serves much better food at the same price as Yutaka.   A large number of items on the menu (around 5) that I wanted were also \"unavailable\" when I went last week, which was irritating. In terms of the items that I did manage to order such as the fried shrimp, oysters, grilled chicken, sashimi and rolls all tasted good, but as I stated earlier, were nothing special and overpriced for the quality and quantity of food.  And now comes the worst part of the service. My friend and I had ordered a grilled yellowtail head which took almost 30-40 minutes to arrive. And when it finally did, the entire interior of the fish was completely RAW! Now I understand that everyone makes mistakes, but considering how long it took them to prepare the dish and how expensive the menu is, this mistake was simply unacceptable.  We informed the waitress of the error so she took it back to the chef. At this point, we didn't even ask for compensation because of the sheer disappointment in the place. We just wanted to get it over with. At the price of this place, I somewhat expected the chef to prepare an entirely new yellowtail head as compensation, but disappointment again. He simply chopped our half picked apart fish into smaller pieces and re-grilled it; the end result being a somewhat burned exterior, but cooked interior.   The waitress offered us free ice cream as compensation afterwards which was nice, but it didn't wipe away my disappointment.   The only positive thing I can say about this place is the very nice and spacious interior, and the pleasant waitresses.   In conclusion, I'm very disappointed in this place. A grand opening should show the best that the restaurant has to offer, but I got overpriced, mediocre food at best. It is a real shame, because they have a great location and a really nice interior. But I simply can't recommend Yutaka Japanese Cuisine in its current guise to anyone considering the large number of better Japanese restaurants in the same area. I sincerely hope that they can improve in the future."}
{"text":"Thrilled to see more authentic Japanese restos moving into the hood!  Excellent service and very nice décor!  Extremely reasonable prices too for the quality of fresh fish offered!    Chef's special sushi dinner ($35) offers good value for money.  I especially liked the toro sushi which literally melted in my mouth!  The set includes a miso soup and a side house salad (both pretty standard fare).  The Yutaka salad and Goma Ae were both quite good.  The portions are big and perfect for sharing.  Karaage was a bit of a disappointment.  The sauce on top made it soggy.  Otherwise the presentation was very nice!    The robata grill items are a-ok.  No complaints but nothing to write home about.   Desserts are a little boring:  ice creams and a crème brûlée.  We went to Kekou for gelato instead.  I will definitely return when I crave sushi at mid-range prices.  This place is huge and did not fill up on a Sat evening.  Plus I'll be comfortable coming here alone since we saw a few solo diners."}
{"text":"I originally had written a long review about Yutaka but honestly it isn't needed. It's a great restaurant. Japanese clientele are always found in the dining room. The reason? Because Yutaka is a close replication to a mid scale sushi restaurant in Tokyo. It's one of the few in Toronto that attempt to do it the way it is in Japan given the ingredients we have access to here; and they do a good job. The owner and chefs of this restaurant should be recognized for their hard work.   Things to note:  This is not an all you can eat experience (this does not exist in Japan). This is a la carte proper. Your experience will be of quality.   The pleasant smell of the restaurant... Japanese sushi uses vinegared rice. If a sushi restaurant doesn't smell like vinegared rice than the restaurant is not providing the true Japanese taste. This personal test has never failed me to separate great sushi restaurants from the typical North Americanized ones."}
{"text":"I've been here multiple times, and always find the food good - the daily specials are usually good (though only available for dinner).  Star dishes include the grilled black cod, the lobster isobeyaki and the grilled wagyu (when available).  The a la carte sushi is also usually quite good.  The service is generally friendly and helpful, though there were one or two visits when it was extremely slow.    It's definitely one of the more comfortable places to have Japanese food downtown right now - comfy booths, lots of space and no lines.  If you're looking for authentic Japanese food, but are tired of izakayas and ramen shops, this is definitely a good place to check out."}
{"text":"In a twist of fate, the 20+ year old Garden restaurant was forced to close its doors after a fatal shooting incident last year. The management didn't give up and decided to completely renovate the location and turn it into a Japanese restaurant. This is the background of this review and this restaurant is Yutaka.   Yutaka in Japanese means plentiful or abundant.  I ordered the sashimi lunch from the sushi bar ($19) and I can feel the abundance in it. Not only in terms of quantity (about 16 pieces) but also in quality. It has fluke, seabeam, albacore, octopus, house mackerel, salmon, squid, and tuna. They are all top notch quality. I would highly recommend against dipping the fishes into soy sauce so that you can taste the sweetness within and the salty water the fishes once swam in. In this regard (price / quality ratio), Yutaka matches if not surpasses its predecessor.   Interior decor can be improved upon. It's a typical modern dark brown colour scheme. It's a bit lacking in colour considering the vibrant corner its in.   Service is good but I do see servers making small mistakes for other clients (like my plate was initially given to another table)  Overall a four star restaurant. I will bring my friends and colleagues over."}
{"text":"Disappointed that they would not accommodate our large group - required us to pay with one bill. This is really hard to do when you it is a work function and everyone needs to pay their own bill. This policy needs to change especially when you are located around so many large businesses and hospitals!"}
{"text":"The best mid priced sushi in the city. Not as good as Shoushin or the like, but also significantly cheaper. Get the chef sushi dinner."}
{"text":"I went on a recommendation however I have to say I was quite disappointed.  The decor was very nice and thought we were in for a treat.  The first warning sign was the wait staff didn't know the menu.  Any off menu items had to be ordered directly from the sushi chef at the bar.  Much of what we ordered was clearly thawed and frozen many times over.    What completely killed the experience for me was when a cockroach went running past all of my food...."}
{"text":"Came here because this used to be the location of my favourite restaurant, so I thought I would give it a fair chance. Unfortunately i was horribly disappointed.   This place is nothing special.  The service was sub par.  They kept trying to push the daily specials on us.  They did not bring us any water or tea.  We had ordered a side of rice which we did not receive yet they tried to charge us for.  We got some sushi and tempura shrimp.  Both were mediocre.  All in all, I won't be going back there again."}
{"text":"Overpriced food and the quality of the meat was very, along with service. Lunch special was only salmon and was kind of sour had to return all meal and wasn't even asked why or offered something different. If you want good sushi Japango is next street over on Elizabeth and is basically the same price for much higher quality.  Miso is also salty beware."}
{"text":"The best Japanese restaurant Downtown. Very fresh sashimi and sake with reasonable price for such quality. We had the live lobster sashimi which comes also with the miso soup cooked with lobster head. Ordering that is the most wise decision i could make that night. Yum."}
{"text":"Horrible experience. We ordered terriyaki salmon and 20 min later we were told they ran out of salmon. And waited 30 min for 5 pieces of fried gyoza. When I asked for take out box the waitress rolled her eyes. Super long wait of every food item and unfriendly staff."}
{"text":"Wow super Fresh beautiful Fish - They know what they are doing and all real Japanese Staff and chefs. I absolutely love this place. Its all about the raw fish - and the lobster dish for $18! I want to try the cooked food but the fish is so good I have not except the lobster."}
{"text":"Renovations have made this place feel so much nicer.  There's plenty of well-spaced tables and booths for private chatter, but I think the place to be is at the sushi bar (isn't it always?).   I came here for sushi a la carte yesterday, and was pleasantly surprised to find that even smack dab in the middle of the week, the seafood was fresh.  Ordered: scallop, fresh spot prawn (on daily special for $6-8/piece depending on the size), hamachi (I think? Slips my mind at the moment), and ika/squid.  The scallop was seared on top with a blowtorch. The hamachi was delicately garnished with a tiny dollop of grated ginger and sparing slivers of green onion.  Spot prawns, still quivering, were presented on plate to the photog-heavy diner next to me (the chefs were more than fine with the diner taking photos - they even turned the plate for optimal shots and kindly offered best angles!).   Friendly waitstaff and chefs chat with you if you're up to it, check to ask if you're enjoying your food, and tell you about the dishes you're enjoying.  I really wanted to try the chawanmushi, which one of the chefs highly recommend (he pointed to the other chef who makes all of them) but I was already running late for a concert so had to skip it.    All in all, exemplary service and delicious food.  I'll definitely be back again and will have to try the chawanmushi for sure."}
{"text":"Sushi and meals are so good at lunch time but servers are terrible. They don't check the table often. Drink is so slow. I just order tap beer and ramune then I have to order again. On that time, Only 4 or 5 tables and 3 of servers... not busy at all the time... after I got drink I have to wait to ask meals so so so long. Servers stay inside of bar... no one stay hall... finally I got server but she doesn't know about menu... just nothing... why no one stay with her?? I really sorry for chefs... meals are so good but server kills restaurant."}
{"text":"Very average sushi at a \"fine dining\" restaurant.   I ordered a dynamite roll and salmon sashimi. However, given the portions and quality of the food, the price did not do its reputation justice. The dynamite roll was decent, but probably the worst I've had. The salmon sashimi was pretty good, but did not taste as fresh or as cold as I would have hoped. I have read other reviews and maybe it's because of what I ordered. However, it definitely was an overall average dining experience. I might come back to try what they're more known for, like the chirashi bowl.  The restaurant itself was modern and intimate. Since we arrived closer to closing, they were able to accommodate for our party of 7 very easily and with little wait. Service was friendly and prompt, but we waited a bit for our food to arrive."}
{"text":"Came here before watching a show (the Bodyguard) at the Ed Mirvish Theatre at roughly 6p.m. on Friday.   As a party of five, we decided to order a variety of appetizers and dishes to share. We got two lobster specials, a variety of their sashimi and sushi specials, and then two portions each of the chirashi, una-don, and nabeyaki udon.  The lobster sashimi came first. When it arrived at the table, the crustacean was so fresh that it kept moving its claws continuously. For $38 each, the lobster came with 6 pieces of sashimi and a lobster miso soup (that would arrive later). The sashimi was tender, and the accompanying sauce that was given (a dashi mixture) paired well with the sashimi.  The sashimi and sushi came next. The kinmedai (golden big-eye snapper) was a beautiful rose pink and quite tender. The madai (Japanese red seabream) and the kinmedai were both delicate in taste. I personally wasn't a fan of the kampachi (amberjack), which was super dense and buttery - but the fish was undeniably fresh and rich. My absolute favourite was the suzuki (seabass) - the searing on the top definitely brought out all its fat and flavour, and the slight seasoning of salt accentuated its richness.  The uni sushi, however, stole the show. It is, without a doubt, unparalleled as the best uni I have ever had. There was no taste of saltiness or fishiness whatsoever. Once it entered my mouth, it melted into a lump of buttery, sweet, rich, delicious cream that dissolved with the rice. Definitely fresh, but also quite pricey at $30 for two pieces...  The chirashi paled in comparison after the uni. Though decently fresh, nothing really stood out in terms of taste. The unagi was okay, but because the fish was so fatty, the rice ended up being doused in oil and sauce. Surprisingly, the nabeyaki udon was really good! It was warm, homely, and super umami. And no wonder - upon digging further, I found lots of mushrooms (naturally existing umami/MSG) scallops, and fish. The udon was chewy, and the broth utterly delicious!!  The lobster miso soup then rounded things off. The lobster taste was rich, and there were solid chunks of the two lobsters we had ordered within the soup.  Overall, a solid meal! The rating for the food may be closer to a 3.7 as it is on the pricey side, but the service was entertaining and great, so I have rounded the score up. The server's incredulous look and awkward smile every time we ordered was knee-slap funny, and everyone there is very friendly, polite, and smiley."}
{"text":"Went there on a Tuesday with two others and had very disappointing service. Ordered the eel, and two dinner sets. The eel came in 15 minutes, but the next two meals didn't come for another half hour.   The meal itself was expensive, underwhelming in taste, and insufficient in quantity."}
{"text":"Visited on Monday around 8:30pm. Atmosphere was quite, clean and reminds me of a feeling of those high end sushi restaurants in Ginza, Japan.   Sushi bar has 2 chefs. Waitresses were not attentive. Walked into the restaurant and stood there for about 5 minutes until someone came to seat us (They were all at the back kitchen doing something..)  Menu price was decent. Ordered Tai sushi (nigiri), came half torched. The Tai was really meaty, the torched of the skin has an extra kick from the melted fish oil on the body and the skin was a bit crispy. Very flavorful, very fresh. Sushi rice was use of Japanese rice, mixed with a good amount of sushi vinegar. Balanced everything well in that piece of sushi.   Spicy salmon- not authentic, fusion, not good. Though they did not use sriracha.. used other kind of chilli to make the sauce. It was basically a salmon with cucumber roll and spicy sauce on top.   Negitoro maki- special of the day when I went. $10/roll or $16/2 rolls. I ordered 1 just to try it out and I can have room to eat other stuff. I wouldn't say they used 100% toro, maybe chu-toro and some mix of maguro. Not enough green onion to my liking, but I love how authentic the maki was- chef put wasabii in the roll during the making. Flavor was good, fish was fresh but not super strong toro flavor.   Sashimi (appetizer size)- came with salmon, maguro, tai and mackerel. Chef has torched the tai and mackerel for us. All fish was really fresh. The flavor of the maguro was what I tasted back in Japan (again taste of memories). They were all good in their own way and flavors.   Godzilla egg- meat wasn't dry yet not juicy. Egg inside was runny. Kind of like Scotch egg but Japanese fusion with Tonkatsu Sauce or okonomiyaki sauce.   Ramen of the day- Spicy Tonkotsu. I find it too salty. Noodle, and cha-shu was alright. Same supplier as other restaurants. Not speically made in house."}
{"text":"Yutaka doesn't get enough love! It's much more spacious than its neighbour Japango and in my opinion the service and quality of food are both superior as well.   They have high quality product for the price point and both their lunch and dinner combos are a steal considering what you get. It's definitely not cheap, but this is the kind of restaurant where you definitely get what you pay for.   Highly recommend the chef's chirashi as well as the oyster shooter! If you're tired of cruddy AYCE but don't want to break the bank for omakase, you can put a tasty dent in your weekly budget instead at Yutaka :)"}
{"text":"I would rate this place a 3.5*. I ordered their chirashi don and it was about $25 or something near that price. The sashimi was really fresh and was pleasantly surprised when it was served with sea bream fish. It's not a typical sashimi to include in a chirashi don. The rice was a little blend compared to other chirashi rice but didn't bother me. The dish came with a side salad and miso soup, both average to what I have tried in other Japanese restaurants.  I really enjoyed the sashimi and would have given it full marks but had to dock marks off for a few things. First was the chopsticks...if they're going high end they should give customers proper chopsticks not the wooden take out chopsticks. Second, my pet peeve is dirty dishes and my soy sauce dish was not washed properly. Other than that I think the food was great."}
{"text":"Was in the area, and looking for a new place to try, and came here. A nicely decorated place in your typical Japanese restaurant style with the waitresses and other staff members in the traditional dress. The staff all seems to be Japanese, and not Chinese or Korean pretending to be same, but I could be wrong. The latter is more typical. The food seemed expensive for lunch relative to the majority of similar places around here (you can get all you can eat sushi for less then a bento box here).  Overall, the food was of sufficiently good quality to impress me. The service was excellent; my tea cup being refilled often, they checked if the food was good, etc. Even though the place was busy, I did not feel ignored as sometimes occurs during busy times at these places. Overall, 4 of 5 as better deals exist for lunch in the area, but given the service, you get what you pay for."}
{"text":"It was a choice between going to Japango or trying Yutaka for the first time. We elected for the former but it was packed and we had no reservations so waiting was not an option. So we ended  up at Yutaka.   This turned out to be a blessing in disguise because the food here was fantastic. We had the beef tataki, tempura appetizer and chef's special sushi. The beef tataki is a must try and every piece of sushi was fresh, tender and just dissolves in your mouth. Your tastebuds will thank you for eating here. The Uni sushi that came with the chef's special was so good we had to order some a la carte on the side.  Food and interior decor was overall great. Only issue was that there was a slight delay in waiting for our food and it felt a bit unorganized as we've probably communicated with every single server. Also, disposable chopsticks were used which kind of tainted aesthetic of Yutaka. But that's just my opinion, sushi this good deserves to be eaten with more proper utensils."}
{"text":"Yutaka is my to-go spot for decent sushi.   Unlike most decent and authentic sushi bars in dt, Yutaka simply has more seats lol and it's not crowded - a great option for good food and zero concerns for staying too long.. so you don't get pushy stares from waitresses wanting to kick you out and hand you the bill, like what you'd expect at a small sushi bar (namely Japango) :P"}
{"text":"Had the Chef's Chirashi Lunch  Really liked this chirashi especially because of the fish selection. At $28, you'd be getting their seasonal premium fishes which changes and a few basic ones.  In this particular one I had, it contained: chutoro, ocean trout, madai (japanese seabream), ebi, ika, hamachi, tako. They were all fresh and delicious. My only issue was the rice was kinda dry and hard instead of sticky as how I like my sushi rice.  The server was nice and very enthusiastic in explaining what was in the chirashi.  Finally, a great alternative when Japango is full! Also, this place is more modern and spacious than Japango so it's better for business lunches or big groups."}
{"text":"The Chef's sushi lunch is $28, but feels like a great deal - 6 small negi toro maki, 10 pieces of nigiri with a fresh assortment of quality fish, with a run-of-the-mill salad and miso to boot.  I definitely recommend it!"}
{"text":"This is by far the best Japanese place to eat in T.O.  Ever dish is a work of culinary art The fish is prepared behind the sushi bar and it is a pleasure to watch the chefs work. The menu offers many choices ; I suggest any of the Chef's specials. A full bar with many brands of sakes , and Japanese beer. The service was excellent , with a friendly staff. The most enjoyable meal !"}
{"text":"We got here walking down Dundas looking for food at 8pm on a weekday, it was an occasion but we weren't too picky knowing we didn't have a reservation. Passing by we saw just a few tables and were skeptical at first, but the Yelp reviews assured me it won't be too bad, so we stepped in. Promptly greeted and seated, the restaurant was quiet and very spacious. Very modern with darker décor for an intimate atmosphere, there's spotlights along the side to focus on the chefs and the bar, making it look quiet cool.  The menu is pretty simple - sushi and sashimi à la carte, some hot food items from the kitchen, a decent variety of drinks. They also have dinner sets that come with miso soup and salad starters. We went with the sashimi dinner, beef teriyaki dinner, and a dynamite roll. They made a mistake putting in the order, but were prompt in resolving right away! Service was timely and nice, which was appreciated.  The sashimi dinner comes with 12 pieces of sashimi and a bowl of rice, featuring the usual variety of common sashimi. Everything was nicely presented and was pretty good, though nothing was outstanding. The beef teriyaki was not bad, also nothing special. Everything was nicely and cleanly presented which I really appreciated.  The highlight came at dessert - we got the green tea crème brûlée and ginger ice cream. The oval dish that the crème brûlée came in was deceptively deep, and the cream was very smooth. There was enough caramelized sugar for a good crunchy top and the green tea flavour was evident yet not too strong. The ginger ice cream came with a sesame snap to add some crunch and was very nice and refreshing. The portion was good for the price, and I was glad to get a ginger ice cream well done at a restaurant! A great way to end the meal."}
{"text":"I expected a lot more from this spot but was disappointed thoroughly.  First off the reservation system on their website didn't work properly so I had to call in (it kept showing no tables were available on a Sunday evening) to book. Ah well the place is clean and big.  We ordered the following  Chicken Teriyaki Dinner, Tempura dinner and a Spicy Tuna roll. They came with rice, salad and miso. Miso soup was bland as is the norm here in TO. Salad was mundane. The spicy tuna was forgetful. The rice was mushy and the roll didn't have a kick as well. I didn't the Teriyaki Chicken but apparently it wasn't anything special either.  Now for the tempura this was a sorry excuse for Tempura as it was barely warm. Decent serving but it neither had the crunch nor the freshness one craves. The batter was poorly done as well. I would say little better than a food court level.  2 Star and when one factors in the price 1.5 star."}
{"text":"Great Japanese restaurant close to Eaton Centre. Chefs choice Chirashi had nice fish selection. The staff was also friendly and accommodating of our toddler."}
{"text":"Nous y sommes allés un lundi midi et avons pris la formule Sushi lunch pour 2. Nous avons eu 16 sushis, 6 makis, 2 rouleaux, deux soupes misos, deux salades et deux glaces.  Tout était excellent. Les sushis étaient variés, le poisson très bon et tendre, le riz était spectaculaire.  L'accueil et le service étaient parfaits. Le restaurant était très propre.  Le menu du soir ou à la pièce est un peu cher, mais la formule du midi est vraiment abordable et vous en avez beaucoup pour votre argent !"}
{"text":"When we first arrived, we noticed there weren't many people in the large restaurant.  Yes, this place is still fairly new.  Either way, we knew we would give it a try.  The menu is quite varied.  It's not like the izakayas around the city (or across the street for that matter).  It's a Japanese restaurant that serves robata grilled items, sushi/sashimi, and other cooked foods.  You're not welcomed with people shouting \"irrashaimase!!!\".  No one shouts at you when you leave either.    We chose to order the following sushi a la carte:  Seabream Amberjack  Yellowtail  Horse Mackerel  Red Tuna Ocean Trout   The first plate we received was perfect.  Each piece of sushi was expertly cut and it was amazing.  The rice was balanced, flavourful, and held together nicely.  Just the way sushi should be.  Unfortunately, the second plate was not as precise as the first (tuna was cut in rectangles and didn't drape over the rice, the Seabream was a tad misshapen).    The black cod was expertly grilled.  It was tender, silky smooth, and flavourful.    The tempura was lightly battered and wasn't greasy tasting.  Get the 2 shrimp+5 vegetables.  For the same price, I thought 3 shrimp wouldn't be enough and 10 pieces of veg just wasn't going to cut it.  We also tried the hamachi piripiri something or another.  It was 5 pieces sashimi with a tasty sauce each on a small bed of blanched green onions surrounding a little salad.  I liked it a lot.  I'm a sucker for yellowtail.    Lastly, we had the tuna tartare topped with a quail's egg.  It was good but it was distinctly Korean tasting since it was mixed in what I believe was gochujang.  Anyways, we were happy to have tried this new place.  I just hope they develop more consistency in their sushi because damn, that first plate in itself was enough reason to go back!  BTW: The wasabi is the real deal here.  They also serve a special soy sauce that tastes completely different from the one on the table."}
{"text":"Yutaka is definitely up there in terms of food quality,  in particular their raw fish. Had the sashimi dinner combo which came with a crisp salad and miso soup. The assorted sashimi was well presented and each piece was smooth, meaty and tasted fresh. The salmon and butterfish were definitely favourites. Their dragon rolls are equally as good, each piece decked out with the perfect combination of ingredients.  Also tried the \"Godzilla's Egg\" special, which was quite good for a non-raw-fish dish, though the portion size was kind of small.  Only area that Yutaka lacks in is their service. The waitstaff are friendly but seem to be always occupied, and if you don't call them over you might be waiting the entire night. Had to do this to ask for water, place our orders, and get the bill. Otherwise the food came out fairly fast.   Overall, great sushi place. Though a bit pricier, the quality of sushi is on point!"}
{"text":"A surprising and wonderful delight in the middle of downtown!  This restaurant may not be 5-starts comparable to places you might get north of the city, or stand-out classic like sushi kaji, but for a place that is at dundas/university, this is a more than welcome addition.  This place is quite large, and I was surprised how busy it got for a Tuesday! They don't let you book online despite having (and I assume paying for) an online reservation system, it always says it has nothing available.  I tried calling in but no one answered, which may be for the best, since once we arrived no one spoke English that well.  BUT I did email in for a reservation, so that is your best option if you want to snag a particular seat.  I wanted to sit at the chef's bar, since I wanted to do omakase, or chef's choice/off menu.  These chairs have backs to them, so they are the same as the table chairs (although this restaurant has many booths that looked quite nice).    Service was a mixed bag, but in the end, for me, it added to the authentic feeling.  Our male server did not (admittingly) speak English very well, so when he went through the daily specials we had to pay close attention to what he was saying.  We told him we wanted omakase, and asked how much money he thought we should pay for it (you set the price and the chef goes from there) -- we suggested $70,and he said, no no too much, $40!  Well, a few minutes later he came back and said the chef said for that price we should just get the chef's special sushi set (which is on the menu), so we just spoke to the chef directly from that point on and set a price of $60.  (You can pick the price from $60-80, makes the most sense)  We told him we mostly wanted sushi with just a bit of sashimi.  It is important to note that our meal took almost 3 hours! That wasn't because it was plate after plate of food, rather, we were left with each course for 30-40 minutes.  This was nice because it allowed you to be relaxed and just enjoy yourself; but good to know if you're on a time constraint.  I can see from the other reviews we were not the only ones who had a longer than anticipated experience -- this was because as far as I can tell they have two dudes making food for the whole joint.  Highlights included (for me): squid with ikura, wagyu beef, the tuna - oh the tuna!, mackarel and the salmon.  You know it's good when a standard sushi you get no matter where you go, like salmon, tastes completely different and fresh.  Yum!!  We also ordered the chicken wings off their robata menu because my co-worker recommended them and they WERE SO GOOD so also get those (salt flavour).  Total for $60 omakase (10 nigiri, 1 maki, 4 sashimi, one soup each), one bottle of sake to share ($22), chicken wing ($5) was around $80 each including tax.  (not tip)    Took forever to get our bill because this is a traditional restaurant, so you have to ask for it and then be persistent in paying.  Chef was friendly but not overly insistent on having conversation, just the right amount.  Saw lots of take out, that could be good too.  Oh and bathrooms were nice! my favourite! :-)"}
{"text":"There are many Japanese restaurant in Toronto. There are some that can gave you the true experience of what Japanese food is like if you were to visit Japan. There are some that mimic the Japanese style food and gets you the understanding of what Japanese food is like. And there are some just slap the name \"Japanese\" on some food (like rice and raw fish) and call themselves \"Japanese restaurant\".  This place? Barely doing using the name Japanese on some food that doesn't remotely close to what Japanese food is like. (Yes, this place is worst than some asian all you can eat place.)  Here is how... When I walked in, the restaurant seems nice and the decor looks pretty good. But disposable chopsticks? That doesn't look good. (Even food court at Eaton Centre serve with real knife and forks.)  Menu is pretty much lunch SPECIAL driven, which is understandable, and may be a good thing to someone who has a hard deciding what to eat. I chose the unagi-don (BBQ-Eel on bowl of rice) and a chef's sashimi lunch. (Both came with a salad and bowl of miso soup)  The server came by later and asked me if I would like to have two bowl of salad and soup, or if just one set is fine. With the menu being lack of vegetables options, I choose to have two sets of salad and soup.  Salad and soup came, is nothing good to write about. See the picture I posted. Some of the lettuce had brown edges. The carrots was dried-out.  After a bit of waiting, both dishes came at the same time. Sashimi should came first as it needs no cooking time, but I guess since they use pre-cooked BBQ-eel, it was just a matter of reheating it? Then why it took soooo long?  As stated above, BBQ-eel was a pre-cooked one, and it came on top of a very small portion of rice. And the RICE, THE RICE... Right now in Canada, you can buy rice directly from Japan at a premium price.  You can buy Japanese-style rice grown in USA and other places in the world. And there are option that you can use as substitute for the Japanese-style short grain rice.  This place uses none of the above. NONE OF THE ABOVE!!!  The long grain rice they use was cooked to a point that it's not sticky, and that's  probably why they gave me a spoon for it. Also the bowl had a lot of sauces in it, making the entire bowl being overly sweet. I had to use the other bowl of plain rice that serves with the sashimi to balance out the sweetness. So how should I rate this? Hmm...  On to the sashimi. It came with 9 different cuts of different types of fish. While it looks good on plate, they did put the fish from a light to oily to sauced order, just having this-and-that all over the plate. It came with a bowl of warm rice in double the size of the unagi-don. Should came with a sushi rice that is slightly flavoured with the vinegar? Well, I don't know, but certainly not a bowl of simple long grain rice...  Price-wise, the sashimi is a bargain, 18 pieces of fish, a bowl of rice, a soup and a salad for just $28 in downtown Toronto? Come on. If I order just that, they at least would get one more star. Heck, if I ignore the rice, I would have gave it a 3 or 4 stars and continue to mislead people to try this place. But the half-filled bowl of BBQ-eel over rice, came with a salad and soup, at the $20 price tag? I can buy a whole fresh eel and barbecue it and put it on top of a bowl of premium Japanese rice for less than that.   I just felt that the BBQ-eel rice bowl, has about $10+ of it goes toward the restaurant and not the food.  So it's a one star."}
{"text":"Japango has been my go to restaurant for a while now, but Yutaka has recently won me over. How? One big piece of heavenly otoro.  I went for their Chef's Sushi Lunch ($28) which includes 10 pieces of nigiri sushi and 6 pieces of maki. The maki was negitoro, which was excellent. The nigiri sushi were also excellent, especially the big, fatty piece of otoro. The sizes of the sushi pieces were also excellent.  For comparison, I ordered Japango's deluxe sushi dinner ($30) which includes 12 pieces of nigiri and 6 maki. The maki was a shrimp tempura roll, which didn't feel on par with negitoro. In addition, the nigiri fish selection weren't as great. There were 2 pieces of maguro and 2 of salmon. The rest were ok, but overall I didn't feel the \"wow\". Even though there were 12 pieces, the size of each piece was much smaller. Japango's sushi is still excellent though. Japango's 55 dollar sushi moriawase is an excellent set with an awesome sake clam appetizer and otoro sushi in the set, but 55 is a bit expensive and I can't order that all the time.  I think Yutaka has won me over as the go to place when I want a kick-ass sushi set with otoro. For $28 before taxes, the Chef's Sushi Lunch is a great deal. The thing that would make it even better for me is including Uni. Of course, fish selection is seasonal and can change from time to time, and it might depend on the chef, but I will go back to Yutaka to try the Chef sushi dinner to see if it will trump the lunch. if it includes Otoro and Uni, then it will be heavenly!  Quality: 9/10. Service: 8/10. Value: 8.5/10. Overall: 9/10 (Not an average)."}
{"text":"Place needs a little fine tuning. Waiter was nice, but not on the ball. Had to repeat some requests to other staff passing by because our waiter forgot items.  Finished all food and waited awhile for last roll that didn't come until we reminded waiter.  Then we got doubled charged.  Luckily we caught it. Salmon sashimi was very good, the rolls were ok. Appetizers were good.  Too much stiff competition nearby so I wouldn't recommend this place."}
{"text":"I was first attracted by the extremely large windows.. The interior design is very lovely. Everyone is very welcoming! If you're for new experiences, this is the place to go.. It is not your typical sushi spot, it offers specials such as \"live lobster sashimi\" which I was very fascinated by. A whole lobster came, with the sashimi nicely sliced up and placed on the body area.. As I was about to dig in, the lobster started to move. I freaked. I did not think \"Live Lobster Sashimi\" actually meant LIVE Lobster Sashimi. It was quite intense but I managed to get through it and once done, they brought the head back to make a miso soup.. As the main course, I ate \"Chef Sashimi\" dinner which came with about 20 pieces of very tasteful fish (if you're for fresh fish, must go, you will never turn back to crappy farmed fish again). It was accompanied with miso soup and salad for about 35 dollars.. It is quite pricey but for good fish, why not! I have been about 3-4 times and learned not to go on friday or saturday because it gets crazy busy.. and it takes awhile for the food to come, which will definitly ruin the experience so I would suggest going on a regular weekday.  Will be back for more!"}
{"text":"As a long time fan of Japango, I'm now fearing for their future given Yutaka is a fierce competition. My experience at Yutaka was phenomenonal. The restaurant is spacious and clean, and service was attentive. Mostly importantly, the food was fresh and delicious.   Ordered the Chef's sushi dinner. It had a nice selection of fresh fish, was made to perfection!  The only reasons it's not 5 stars are: 1) a bit on the expensive side(but if they can guarantee the consistency of quality and freshness, then it's worth it!) 2) they could upgrade their sound system.   Liked the decor of the restaurant. However, the music selection would be more refined, and they could have better speakers with better bass.   Definitely would come back."}
{"text":"I'm so glad that I happened upon this place on Dundas when I wanted a quick break from my conference grind for lunch. This is an excellent Japanese restaurant, especially for the price. The service is excellent, as would be expected at a Japanese restaurant, and the food I had was exquisite.  I ordered the chef's sashimi lunch, which meant that they brought me some special soy sauce to go with the fish, and provided a wider array of fish than with the regular sashimi lunch. The presentation itself was breathtaking (definite Instagram fodder), but it was also tasty. With sashimi, the fish has nowhere to hide, and in this case, it simply shone. And even though they were just accompaniments, the miso soup and mixed salad were well prepared.  I look forward to paying a return visit here next time I'm in Toronto."}
{"text":"I have to disagree with the previous reviews. The sushi here is really mediocre. The freshness and quality of the fish is barely passable. On top of that, the service is subpar and slow. There are plenty of other sushi places within walking distance from here."}
{"text":"I went to this restaurant two nights in succession; once to take a party for my daughter's birthday party and the second just to show a friend.  Both the evening's experiences were very good.  It is a large open restaurant opposite the bus station on Dundas St., of all places.  Overall the quality of the service and the food is a significant step up from the student type \"Japanese\" restaurants owned by Koreans or Chinese along Bloor Street and Queen streets.   The price point is also a step up from these establishments too, but well worth the differential.  The Greene Dragon and the Red Dragon were both a delight, particularly the latter, which was clearly a work of art. My friend and I swooned over the quality of the Maguro sushi, which really put them into a category of a 'better' Japanese restaurant.  The various tempura were standard and yet well executed, as was their Karaage and Ebi mayo, they arrived piping hot, which is difficult to accomplish.  And the bills: - one for five people and one for two, were similar, in being just under $200. (The latter having significantly more flasks of Sake!!)  The service was exceptionally attentive, and had beautiful Japanese characteristics.  Notwithstanding its unlikely location, I would recommend."}
{"text":"I was wrong about Yutaka. Been walking pass this place for a couple years because I thought this would be a rip-off Chinese operated restaurant.  I was down to try this out as it was recommended by a friend. Arriving at around 8:30 on Friday night, it was kinda empty with just 1/3 filled. (They deserve more customers!!) My boyfriend and I ordered a Chirashi don, Sukiyaki pot, and a couple more sushis. Their sashimis were amazing, I would compare them with the insanely over-priced Miku, yet they are so much more reasonably priced in that case. (Yes, still pricy around the area!) Anything from the sushi bar is worth trying and there was one particular type of fish (find in pics as I do not recall the species) that we ordered again!  Do not bother trying their kitchen item. Perhaps it is just the sukiyaki. The beef was rough and thick. Speaking of authentic sukiyaki that are relatively sweet, the chef might have accidentally pour two cups of sugar or mirin in this one. Too much soup for a sukiyaki and this had became a flavoured shabu-shabu with tons of sugar.  Need not to mention about the interior and atmosphere. Just refer to the pics from Yelp, they're accurate and real. Servers had the brightest smiles in town and were all super helpful and nice!  Worth trying and will definitely come back for more sashimi!"}
{"text":"I tried the spicy tuna, dynamite, spider, and spicy scallop sushi. It was really good, but i felt as if the Wasabi was watered down a bit and was not strong enough.   The interior is BEAUTIFUL!  The staff are wonderful and really attentive."}
{"text":"Came here for dinner on Monday.   It was delicious.   From the great service I received to the recommendations, everything was delicious.  The sauce on the red dragon was amazing.   The sushi tasted so fresh.   I ate half of the grilled squid (forgot to take a picture when it came) but portion was very good.  Spicy Salmon was a little pricy compared to most places standard 6pc for $8.  Also had some sukiyaki, great on a cold day and a very rich broth that it was definitely a good suggestion by the wait staff.  Would definately go again as there is tons on the menu to still try.     Prices are slightly higher than most places, but quality is definitely there."}
{"text":"I cannot believe that Yelp let me down for the first time ever. I really do not understand the rave reviews for this place. I tried to give this place a chance but really this place is expensive for no reason. The sushi is subpar at best and more compareable to an AYCE quality of fish and my salmon terriyaki dinner was grossly over priced and portion size was extremely small. The seaweed salad had more Salad than seaweed and it just looked like a salad on budget cuts.    The service was not spectacular as well. It was a busy Saturday night, but really they should just staff for it instead of stretching their 3 servers so thin.    I do not know if I am more disappointed by the food in this place, the poor service, or the fact that my Yelp App let me down.... I am going to need a moment to cry for a bit.... haha!  Anyways, this sushi place is fancy looking but I would rather have great tasting food for a great price minus all the bells and whistles."}
{"text":"This is more of a 3.5 but given it was surprisingly good in a competitive dining area (Japango is just around the corner), upgrading - Yelp please allow half stars soon?  Arrived around 6:30pm on a Thursday evening and barely any patrons, still new I guess, so a reservation was completely unnecessary. Server was fairly attentive and water/tea was constantly refilled.    We ordered the mixed tempura (shrimp and veggies) and grilled miso cod - just the right amount of flavour, love the seared grill taste. Also tried both the chef's sushi set (in our opinion, opt for the regular, the fish selection does not justify the premium) and the regular chirashi. The fish were fresh and cut perfectly!  This place is great for a more comfortable dining experience vs Japango if you're not into bumping elbows with other diners. The food is just a notch below, and my heart is still with the Japango roll... but the spaciousness makes up for it. Worth a try!"}
{"text":"TL;DR Food: Awesome, authentic, beautiful. Service: Great!  This is a serious and authentic Japanese restaurant. If you're not with a big party I would suggest sitting at the counter and watching the sushi chef and his assistant work. It's beautiful. As I like to, my friends and I ordered a bunch of dishes to share. One was curious about the salmon skin maki which was crunchy and delicious. The chirashi don was fresh, plentiful and beautifully presented. The sea eel sushi was fine and subtle, rather different than its freshwater cousin. The futomaki was a delectable mish-mash of flavours and textures, both interesting and crowd-pleasing. The miso soup was not overly salty, just smoky enough with a hint of some flavour I couldn't quite put my finger on. I hope to return for dinner to order from the robata.  The service was excellent. Saori, our waitress was charming and knowledgeable. All around it was an excellent experience."}
{"text":"Pro: Good sashimi, fast lunch, cool atmosphere.   Con: Indifferent service, slightly overpriced, portions could be more generous.   Verdict: Would recommend."}
{"text":"Modern and stylish Japanese restaurant.  Nice staff and services.  Great atmosphere and reminded me having meal in Tokyo."}
{"text":"I come here at least once a month, it's my go-to for excellent sushi in the core.  IMO, it's the best mid-range sushi option in terms of both price and quality (i.e. not Miku or Ja Bistro level, but much better than most of what's out there).  Sashimi is always fresh (the Chef's Chirashi dinner is my go-to) and other dishes like beef tataki, tuna tartare, etc are solid.  Decor is nice and service is generally good too.  I think it's much better than Japango, and I've brought several friends who also agree."}
{"text":"This place has really great quality fish. We noticed that when we were trying the sushi rolls and the sashimi. The fish tastes fresh and has good flavor. The portion of fish in the rolls and the cuts of the sashimi were a generous amount. We also got the ramen of the day and the udon noodle soup. Both were really tasty, definitely recommend them. We chose to get the sushi plate as well which is $25.   Overall it is quite pricey compared to other sushi restaurants that I have been that have the same level of quality. Especially since the portions and amount of pieces you are getting in the dishes are smaller/less than other places. The menu doesn't really have a lot of large entree options. There's a lot of small side dishes and individual pieces of sushi (2 or 3 pieces) but again prices are a bit much.   The atmosphere is really cosy and comfortable with dim lighting. It's good for groups or a date.   Service was great and friendly staff.   Overall really great quality of food."}
{"text":"One of the best chirashi I've had but it is quite pricey. At $35 for the chef special chirashi dinner, the fish was very fresh and the presentation was beautiful. There were many different kinds of fish including mackerel, red tuna, otoro, chuutoro, shrimp,etc.   I left feeling satisfied and perfectly full. The interior was quite nice as well but I found it quite odd that they had disposable chopsticks and a handwritten menu that did not match with the atmosphere they were trying to present.  Overall, very solid place for sushi."}
{"text":"We ordered sushi lunch. I lived in Japan for a long time, but the sushi here are really nice. I would like to say even you paid the same price it is not guaranteed you can eat the same quality sushi in Japan. A must try."}
{"text":"Excellent choice of fish beyond the standard fare from multiple sources ensuring freshness- Portugal, Japan, Canada, etc. I went 3 times during my stay in Toronto and had an excellent experience each time. The waitresses were attentive, friendly and knowledgeable. The chef was also engaging (I sat at the sushi bar), and made several pieces that were new to me and delicious, like marinaded Oba leaf. Lovely venue too."}
{"text":"I recently visited Toronto and I literally booked a hotel nearby just so I could eat here again. I chose to sit at the sushi bar this time and initially things started out fine. I ordered some nigiri and I got soup and salad.  I have absolutely no complaints with the food, I will come here for sushi literally every time I am in Toronto because it is that good. I don't know where they get the fish but it is outstanding. However, they were completely understaffed and I found it offputting that the menus were changed by hand like some cheap Chinese restaurant. I nearly had to hunt down someone to pay my bill.  It really hurts me to write it because this place is soooo good. Please fix your staffing issues"}
{"text":"Haven't had such bad experience in a restaurant for a while. My friend (there were 7 of us) got there first and no one approached her to greet for a bit. Another couple came in a while after and they immediately greeted them and ignored my friend that's been standing there forever. Even when the couple told the servers that my friend was there first, they just ignored and asked them to their table without even attending to my friend.   After we were seated, they gave only one menu and it took us forever to even get someone to notice us when we raised our hands to order our food/get more menu/get some water. Water didn't even come until we're almost done eating. And they missed out on some of our orders and what not all of us were very dissatisfied with what we've got there.  Food--- all of us ordered different stuff and they're all bad except for the grilled hamachi Kama. We ordered 4 miso soups and they only served two and we had to kept on asking for the other 2 too. Sushi rolls and all are just bad and we could easily get better ones at other places.  What Got us even mad was there was a notice stating that for 6 or more people there'll be a 15% service charge for the table and we're okay with that despite the crappy food and attitude we got. But when the bill came they charged us 20% service charge and they said it's mandatory charge.   We went there cuz there were so many good reviews and recommendation about this place and we've never gotten the chance to try it out. After this experience we received here, My friends and I will never ever step foot in this restaurant ever."}
{"text":"My wife and I had their chef's sushi and chef's chirashi. The flavour of the fish was average, nothing out of the ordinary. Rice was good and well prepared, which is to be expected. The place seem to be quite understaffed, demonstrated by the fact our tea was never refilled once during or meal.  The price is high for the quality served. Won't be going back any time soon."}
{"text":"Didn't really know what to expect when I visited Yutaka, but my stomach and I left content.  The restaurant was clean and well furbished, and our waiter was courteous and friendly. My friends and I ordered a variety of rolls and dishes from their \"kitchen\" section on the menu. The sushi was good, it was better than the average around here but nothing particularly stood out which felt a bit weird given the place presented itself as more upscale.   Their red dragon roll was the most popular at table. I particularly loved the oyster isobeyaki- loved the taste the yuzu added. The edamame could have used more salt on it.  While the food was good, as a GTA-er, I could find sushi of the same quality around my hood so it wasn't worth the trip for me to come all the way down for Yutaka. However, if you're in the area and wish to have some authentic Japanese cuisine, this place would be perfect."}
{"text":"I stopped in here without reading any reviews, took a chance on sushi which is breaking all the rules. But must admit the salmon (all I ordered) was fresh and outstanding. I wish I was staying a bit longer so I could come back and try their other dishes. The service was very good too!"}
{"text":"The interior decoration of this restaurant is pretty good, and that's the reason why we decide to have dinner here, but unfortunately this is all they have.  I would like to talk about the food first, it was not that terrible to eat, but absolutely worse than Japanese restaurant that I have been in, and their food is definitely overpriced.  The service, I have to say it is really disappointed me, you have to wait for a long time to finally get your food, the worst thing is that they don't even remember what you have ordered, we ordered 4 sets and they only brought us 3 of them, which is really rude. By the way they separated our bills in a stupid way: simply divide the amount by 4, totally ignore that the food that each one of us ordered get different price. Generally, if you like Japanese food, there are lots of great restaurants in Toronto, don't waste your money on this one."}
{"text":"No issue with food quality which was very fresh and good.  The issue is the size of the dishes which I found extremely small portions.  The cod cost $15 and it was about 3x8cm...very small!     The sushi was quite good and very fresh!   Presentation is on a simple white dish, nothing special.  The taste and quality of the raw fish was very good.     The servers are very polite and good BUT they are really busy!  They should probably have one more wait staff on and it would be perfect.  I expect to come back but be a bit more focused on my ordering and stick with the sushi and definitely not the rip off cod,"}
{"text":"Went there with a large group of around 14. We had two tables and there was a bit of confusion as they seemed to treat our two tables as separate groups so we got food at different times and then meals got mixed up. The staff was very nice (our server memorized our order without writing it down!) but a bit overwhelmed it seemed.    The food was excellent, really high quality, tasty, well presented and fresh. We had miso soup, salad, ramen, chef's sashimi, chef's sushi, gyoza, fried chicken, tempura, deep fried shrimp (advise not to get this as it is basically battered shrimp deep fried), black cod, fried chicken wings, various sushi rolls and for desert we had green tea ice cream and green tea cream brule. What stood out is the quality, variety and freshness of the fish and the cut. There was definitely an uniqueness that makes their food stand out among Japanese restaurants.   It was somewhat shocking to see lobster torsos with their legs moving and plated on the counter. Meanwhile the lobster's tail had been cut off then the meat extracted and prepared behind a see through glass counter. I am not a vegetarian but even I felt for those lobsters.  The atmosphere was somewhat drab and dark. I think the specials would have looked nicer if written on a board rather than written with marker on a piece of paper at each table.  The final bill was pricey. I know this because it was the first time my daughter ever said a meal was pricey, a meal she did not have to pay for ;-) I would have to agree that for a meal that was not considered fine dining, the price was too high.  Overall, I do like Yutaka but I think I would save some money and have good quality Japanese elsewhere."}
{"text":"Menu is way too over price. Fish is not fresh and the portions extremely very small. We ordered a unagi dinner, a CHEF's sushi dinner and a chirashi dinner. Our raw fish dinner didn't come until my friend finished his unagi rice which meant we waited around 40-50mins for our food and the CHEF definitely forgot our order because the restaurant wasn't pretty empty at that time and they didn't make it until we asked the server about it."}
{"text":"The service was mediocre and we had to waive down the servers multiple times. The food was so-so. We got the green dragon roll, which was average, and the spider roll, which we did not like. The sake sushi was decent."}
{"text":"We pass by this place often so we decided to drop in and see if it was any good. Let me say we were pleasantly surprised.   We ordered the udon, karaage chicken, green dragon roll and Wakame salad. The presentation of each item was excellent and we actually spent time admiring the dishes prior to tasting the food.  The Wakame salad is your typical seaweed salad nothing too different than what you can get elsewhere. The karaage chicken was good being crispy on the outside and tender on the inside. Next comes the udon which was excellent as the broth was delicious and the udon was a good tenderness. Our favourite item that we tried was definitely the green dragon roll. The rice was nice and soft but didn't come apart easily. The avocado melts in your mouth when you eat it. Spectacular.  Service here was good. The waitresses were very friendly and came by often to refill our tea. The food also came quickly.  I would recommend this place as the food is good, service superb and the ambience excellent."}
{"text":"I'm a fan of the Godzilla's Egg. I found this a novel presentation and delicious at that!   Skip the oden. The broth is a tad too salty with very little soup. Though, there was a lot of stuff to go with it. I asked for hot water to dilute it to my preferred taste.  Our server, Cheri, was awesome. She was friendly and enthusiastic about the menu. We enjoyed her recommendations very much! Ask for the Daily Specials menu."}
{"text":"Had dinner here, we ordered chefs sushi, deep fried seabream, one of their specials, sukiyaki and an avodcado roll. The sushi is fresh and delicious with an excellent variety of fish available. The quality is much better than the knock off sushi places."}
{"text":"Great menu with lots of options.  Sushimi was really fresh and tasty, even mackerel was really good. I enjoyed the shrimp tempura as well. Their grill was closed this evening which was unfortunate because it had a few interesting items that I was looking forward to trying.  Will come back again."}
{"text":"Great value! They pay attention to the key details: freshness, variety, quality rice, well prepared--including fish to rice ratio. Further, I noticed the quality of soya sauce and wasabi. And, I loved the clean modern spacious dinning room. Hard to find at this price point! I expected prices to higher."}
{"text":"Fairly good quality sushi in Toronto. It's definitely on the higher end of the pricing spectrum but you pay for what you get."}
{"text":"??????????????????????????????????????????????????????????????????????????????????????ISOBEYAKI???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????"}
{"text":"Excellent, fresh, professionally-made sushi like I'd expect to find in Japan. And it was not that expensive for the quality. I will be back."}
{"text":"Yutaka is very spacious. The waitresses there were friendly, and we got our water filler before we asked for it.  We ordered beef tataki, negi toro (sushi rolls with fatty tuna pieces), grilled mackerel, and scallop sushi with cucumbers.  The beef tataki came with two sauces: a yellow wasabi mustard sauce and a ponzu sauce with green onions. They were both really good. The beef itself was pretty quality too.  The negi toro was one of the best rolls I've ever had. You would think you know how rice tastes, but for some reason, the rice seems to melt into the fatty tuna. All you get is a mouthful of very soft and fresh fatty tuna. I definitely recommend ordering this dish.  The grilled mackerel was very well done. It's a relatively small piece, but they give you the piece that is the perfect balance of lean fish meat and fatty fish belly.  The scallop sushi with cucumber was unfortunately nowhere as good as the negi toro. The scallop texture was overpowered by the crunchiness of the cucumber."}
{"text":"Excellent sushi, sashimi and service. But bring along Visa 'cause they don't take American Express."}
{"text":"Good place, well located and very friendly staff. Ordered Katsu-Don and it was delicious with good amounts of meat and egg. Rice was soft and well done according to the Japanese recipe."}
{"text":"I ordered the Chirashi Lunch (19$) and the some pieces that I got were beyond my expectation, as I did not order the Chef's Chirashi Lunch which would have better quality pieces. The fish includes sea bream and yellowtail, which were very fresh! The tuna and cooked shrimp quality was not as great.   Overall, a spacious restaurant with good service and conveniently located. Not the cheapest option but decent value."}
{"text":"This is definitely a neighbourhood gem! I've passed by so many times over the years but never bothered to step in. Turns out the food is not bad.   I had the Chirashi Dinner, $25. Comes with salmon, sea bream, yellowtail, albacore tuna, tuna, cooked shrimp, egg and the usual mushroom(?) garnish. My friend had the Sashimi Dinner which has the same fish, plus a piece of sea bass. The dinner comes with miso soup and salad, both good.   Large restaurant, very quiet. Good alternative to the nearby Japango if you want something more spacious."}
{"text":"I wander past this bank of black windows all the time, but didn't have an excuse to go in until now. We ordered mostly from the special's menu, which was hand-written, decorated with stars and with little comments to highlight interesting items. I thought that it was very charming and cute.   The Godzilla Egg is like their version of a scotch egg, with a runny yoke in the middle and served on a salad. It was delicious and filling, a nice surprise. The Baked Lobster is a little out of place. It was well executed, with plenty of lobster meat stuffed into the head and tail of the lobster and smothered in sauce. I just don't know what made it Japanese. The one item we ordered from the regular menu was the Dynamite Roll. The shrimp is freshly fried so that it was still warm when devoured. In all, good quality and interesting menu choices available.   The service here is excellent. The waitresses are very polite, eager to explain anything you need and actually smiling when delivering anything to you. It's in the little things that they do, like hiding a knife (used to cut open the Godzilla Egg) behind their back until last minute or being instantly there when you are looking for them. It is a bit expensive, especially with all the restaurant choices in the area but you get value back in the food quality and the service."}
{"text":"This place is more of a 3.5 star place, rounded up to 4 because the food makes you forget the decor. The decor is fine, clean with lots of dark surfaces, but is still a little charmless. But who cares, you're here to eat.  We had the karaage with negi-mabushi sauce and kakuni. The fried chicken was tasty with the sauce giving it a little sweetness and a very slight spicy kick. The braised pork belly was exactly what you want in the dish: unctuous, tender, melt in your mouth flavor that's savory, not salty and just a little sweet.  For dinner, we had the chirashi and the chef's chirashi. From what I could tell, the difference was the chef's chirashi included a fried shrimp head, squid topped with salmon roe and maybe a few extra pieces of fish cut a little differently, plus a special soy sauce. Both chirashi were attractive and included some pickled veggies you normally don't see. Both were generously topped with tasty, flavorful fish and I'd order either again.  Service was fine and on a block with other Japanese dining options, this is a solid choice."}
{"text":"Went with a new dining companion last week who does not eat raw fish or much meat (unless it's fried chicken). I stuck to my usual of the chefs sashimi dinner which was once again excellant. My friend got the tofu steak, the karaage with the sauced option and the seaweed (sunomo?) salad. I tried a little of all 3 of her dishes and I must say that I'd order them again.   The karaage wasn't heavy at all despite being sauced. The tofu steak was wonderfully crispy on the outside. I very rarely have tofu, but I'd order this again as a side to share. Perfect for sharing. The seaweed salad was very impressive with young red and green fresh seaweed. Not your typical seaweed salad. It is served with the dressing on the side which is a creamy, nutty, sesame dressing. I will take pics of these items the next time I order them and post."}
{"text":"??????????????????????  ???????????????????????????????????????????????????????  ??????????????????????????????????  ???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????  ??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????  ??????????????????????????????????????????????????????"}
{"text":"We went into the restaurant and there are no staff at the front.  I think the owner came over and direct us to the table.  We sat there for almost an hour and we got no menu or even water.  None of the staff came by and ask.  We had to wave many times to get their attention.  Our food all came at once where our table was not even large enough to fit them all.  Also the fish is not fresh.  It was hard and dry and quite disgusting.  The meal was rather expensive for the quality.  This is no different than any AYCE place."}
{"text":"Maybe it once was, but definitely not worth 4 star anymore. Interior was old. Spicy salmon roll was worse than supermarket's, spot prawn was mushy and terrible after taste, only sashimi (dinner) was so-so, though salad and miso soup were boring. Most likely never going back."}
{"text":"Ok, I get it now.  You can get all you can eat sushi for much cheaper and you'll get almost everything they have here. However they do everything better; plain and simple.  They're not reinventing the wheel, just making it better.   Their prices are higher but the quality is also better.  A dinner for 2 cost us about 80. But it was very good."}
{"text":"Good quality sashimi, comparable or superior to Japango which is down the street. The modern decor is pretty decent for a sushi restaurant, it is spacious and the dining experience felt comfortable and private which is uncommon in most sushi restaurants. It is also not too loud and  the sushi chefs and waitresses are dressed in very charming attire.   The rolls are small (in a good way without all the filler bread crumbs) and they are the perfect size for one full bite without the roll being uncomfortably large. My favourite part of the meal was the soup udon, with a large variety of ingredients including enoki mushrooms, shiitake mushrooms, fish, chicken, shrimp tempura, scallop, etc, making the soup very fresh and savoury (without being too MSG and salty tasting). Will be coming back soon :)."}
{"text":"Food was good, just a little too pricey for me. I got the spicy tuna and dynamite rolls along with zarusoba noodles. I would like to compliment them on their presentation and wasabi. For the price that I saw on the menu for the rolls I ordered, I expected more than 6 pieces each. I was quite shocked and let down."}
{"text":"Very nice \"fine dining\" sushi place!  We ordered 3 items: 1. Karage with honey sauce 2. Medium fat tunabelly with scallions and wasabi maki roll - $10  3. Raw oysters with yuzu sauce - $18  1. Not oily at all and had a very nice crispy coating. The sauce was light, sweet, and delightful. There are 2 choices of sauce for this dish, you get to choose one. 2. This was from the Chef Recommendations page. First time having tuna belly. I enjoyed the light taste of wasabi and crispy onions. My friend and I felt that the rice and seaweed overpowered the tuna filling and would choose a sashimi tunabelly as an alternative in the future.  3. Our favourite dish! You get to choose 1 of 2 sauces. We got the yuzu which was light enough to taste the raw oysters which were from British Columbia. The sauce also added a good amount of salt, and the lemon a bit of tasty sour.  Overall the food was delicious, beautifully presented and made with fresh ingredients!"}
{"text":"My baseline for visiting a sushi restaurant is Japanese ownership and chef. Here two out of three owners are Japanese and there is another Japanese chef in the kitchen. Why waste time with pretenders?  It does not guarantee quality sushi, but it is a foundation and one goes from there. My review is based on sushi and rolls as I did not have any of the cooked items from the kitchen.  Food The sushi is a 3.5/5. The chef is Japanese and offers good quality fish. The rice is nearly perfect as well. They are not serving typical downtown false so-called sushi, but taking their rice and fish seriously here. The selection is above average, but does not offer any special or rare items. When asked if there are any special items available the answer was 'saba.' Well, nearly 100% of sushi restaurants have saba. The size of the sushi nigiri is absolutely second to none. Each piece was large, perhaps some of the largest I have seen in Toronto. I was impressed by all aspects of the sushi, but had to deduct points for one big flaw and exception. The fish is clearly frozen and subsequently thawed. We were not expecting Yasu quality sushi here and at these prices, but one can taste the thawed pieces distinctly. I had saba and aji and tai and hamachi and they were all good. Yet, ever so typical, menu items were also unavailable. is there one sushi restaurant out there that stocks everything the menu claims or keeps its menu updated? The salad and the spinach appetizer were very good and also came in stylish bowls.  Service was good. Walking in there and seeing 2 young girls I expected the worst. My prejudices aside the waitresses were nice and professional. Unexpectedly my waitress who was Asian-Canadian and not Japanese knew her sushi. Imagine that. Her service, and what I received of her companion, was polite and caring. She also refilled the water, smiled, was friendly, accommodated and waved and said good-bye. No complaints about the waitresses at all, which explains the above average tip. The chef made a mistake and sent over free sushi too, which was not expected. The generosity is appreciated. The waitresses are dressed in Japanese hakame, the traditional formal wear of Japan. It is a nice touch that adds authenticity and shows that they may be in a high traffic area that is not known for its classy or high-end residents or clientele, but Yutaka ('good harvest') is actually trying.  Atmosphere They have a modern design. The aisles are wide and straight. The restaurant is clean and there is a good combination of tables, booths and counter dining.  Japanese cleanliness aside, this place wins my approval for having lots of space, offering a gap between diners and offering customers choice. The washroom was clean. Japanese pop music was playing on the speakers. I like how this place looks, the setting and the breathability of it.    The price is a tad higher than the average Dundas West sushi joint, but we all know that those places are not serving real Japanese fare and this place is. Factor in the above average quality, the service and definitely the size of those sushis and Yutaka is actually a bargain and a better value than the dozen sushi cheats up and down the street. Those $5 hokkigai sushis would have lower quality rice and half the clam anywhere else.   Funny anecdote: their dark windows are very reflective. I had no idea we ladies check our appearance so often and so consistently in shops' windows (yeah, I did lol). Everyone passing by checks herself in the windows next to you and it looks like they are looking at you.  I have little hesitation returning here when I want cheaper, but acceptable sushi that is not exactly Miku or Yasu quality. They have a la carte sushi, lunch specials and combinations. The chef is from Osaka, which means downtown Toronto now has actual Japanese sushi at Yutaka, Hiro and Ematei. There is also Ichiriki.  29.08 edit/update: I went back today based on my enjoyable experience of two weeks and the service.was.brutal. The waitress from two weeks ago was not there. A waitress who had come from BC was there. A second waitress with a dyed strand of hair who was there last time was there. And there was more petite waitress with a butterfly necklace and I got stuck with her. She was terrible and just did not want to be there. And I didn't want her to be there either. First, she left me sitting there for the longest time and wouldn't take my order. It took so long I really was about to leave or move myself to the counter so I can place the order directly with the chef or something. After finally after 15 minutes or so waving her down I placed my order. Then she brought the food in 5 minutes (because the chefs work well), dropped it off and left. Er, how about cutlery or a chopstick? Nope. I flagged the other waitress (with the cool hair) and she got me chopsticks. And finally I could not get the bill. Don't go Tuesdays you may be stuck with her."}
{"text":"Excellent sushi and udon, quiet, excellent service, a liiiittle pricy but it's worth that much. will come back for sure !"}
{"text":"The sashimi I had here left a fishy taste in my mouth after my meal. A sign of subpar quality. Soggy tasteless soft shell crab... It wasn't properly thawed before frying? I thought the chefs here were experienced and had good reputation? So disappointed.  The high prices gave me false hope... While their decor and ambience looked nicer than others on that strip, it wasn't much different food wise. Not worth my money."}
{"text":"Food is decent, atmosphere is nice and things are new and clean. Servers' were extremely nice and patient, but a bit slow, maybe because they were understaffed at the time."}
{"text":"The sushi chefs were speaking Japanese!! Definitely authentic! Service was very attentive! Staff were very friendly and we even got some extra sushi to try out the different types of tuna they had!! A new favourite sushi restaurant for us!"}
{"text":"Yutaka is a large comfortable place near Dundas and Bay. I've been here a number of times and always enjoy. There's daily specials which are good and the menu has excellent sashimi and sushi selections. I usually order the chefs sushi dinner. Wine, beer and sake menu is surprisingly thin for a restaurant of this quality and that's my only complaint. Service is crisp and fish is fresh."}
{"text":"For once the reviews on yelp has let me down! Considering the good ratings for this place on yelp, I had very high expectations for this place.   My friends and I came here on a Saturday after shopping and being hungry. We were super excited for sushi and Japanese food.   The service here was super slowwwwww. Took 1+ hour to get our food after ordering. As we were already getting hangry, this place didn't give us a good impression.   I got the sashimi dinner and my friends got a sushi dinner. The quality of the sashimi tasted like AYCE fish. For the price I was paying for, I thought I would get better quality and variety of sashimi.   The sushi was bland, simple, and terrible. Tasted worse than AYCE sushi. My friend had food poisoning the night of this...  The only tasty item we got was the baked oyster... it was a disappointing night that made me hate sushi. Definitely never coming back."}
{"text":"I like Yutaka. Their menu consist a mixture of \"crowd pleasers\" (such as roll-type sushi) and some pretty authentic tasting Japanese dishes that are not as common.   The fish here is fresh, and you can get really good sashmi here if you are willing to splurge for it. I myself prefer to eat more cooked, izakaya-type foods.   The Chawanmushi (a small bowl of very smooth textured steamed egg with enoki, mitsuba and shiitake mushrooms, chicken and shrimp, dash of yuzu) is extremely nicely done and I highly recommend it. So is the braised pork belly (kakuni), which is veyr tender and juicy.  The sushi rolls are ok. I got the green dragon roll (unagi, avocado and cucumber) and though it tasted good, it is a pretty ordinary item. I would suggest trying something more adventurous.  Overall, I would come back to Yutaka again."}
{"text":"Yutaka is definitely an underrated restaurant. Their chirashi bowl is amazing and one of the better ones in downtown Toronto - I would dare to say that it is even better than Japango! The variety may be limited, but the quality is definitely there. The second dish that I got was a restaurant special - lobster with cheese and herbs. It was absolutely delicious - extremely flavorful to the point that I couldn't resist using my hands so I can lick every single drop of sauce and eat every piece of meat.   Overall, I would come back again if I am craving some sashimi!"}
{"text":"Updating my Yutaka review so that I can share a story...  Two girlfriends from Japan, who live in Kochi, were visiting Toronto, and after 2 weeks of the many different foods that Toronto had to offer, they were craving sushi.  Both were very skeptical that Toronto would have authentic sushi, but I told them to join me at Yutaka and let me know their thoughts after the meal.  The moment we got in the door and we're seated at the sushi bar, one of the girls said \"it smells like Japan, like the ocean!\"  She said it made her feel homesick for the first time on this vacation. A good sign indeed.   You see her father works at the fish market in Kochi, so the smell of fresh fish was like home for her.  After chatting with Sushi Chef Fukushige, they accepted his recommendations and while they enjoyed everything, and were very impressed by the vast selection, they were most intrigued and pleasantly surprised by the salmon sushi, which is not as common there as it is here.  After we left, I asked if they considered the meal at Yutaka authentic Japanese, and received two very appreciative and enthusiastic nods saying yes in Japanese.  Yutaka for yet another win.   -----------/    When I asked my mom where she wanted to go for dinner on Mother's Day, she chose Yutaka, so I knew right away the place had to be Japanese owned and operated = authentic.  It turns out that the owner and head sushi chef is someone she knew when he worked as a sushi chef at Cafe Michi.  The space is very open, stylish and dramatic with beautiful stone tiles on the wall behind the sushi and Robata bar that runs almost the entire back wall of the restaurant.    I have seen reviews complaining about the prices here, but if you know - and can taste - the difference between authentically prepared sushi and other Japanese cuisine vs the places that cut corners to save money, then you will appreciate the quality and attention to detail at Yutaka.  My mom let the chef create a custom Omakase dinner for her, which included a Yutaka Salad (an interesting blend of lettuces with raw broccoli, avocado, grape tomatoes, peppers, wakame, toasted pine nuts in a tasty soy, sesame, balsamic vinaigrette with shaved and fried leeks on top for an artistic presentation) as well as Tiger Shrimp from the Robata bar, and an exquisitely prepared and beautifully presented plate of sashimi.  Celebrating Mother's Day, I was in the mood for 2 of my childhood favourites Chawan mushi and Tempura, and Yutaka did not disappoint.  Chawan mushi is a steamed egg custard and Yutaka puts bite size pieces of chicken, shrimp, enoki and shiitake mushrooms and mitsuba (Japanese parsley) which gave it a slightly herbal taste.  The tempura was perfectly fried, not at all greasy with generous servings of shrimp, sweet potato, eggplant, red pepper, and squash.  Mom said it was her favourite Mother's Day meal ever,!  So if you are tired of standing in line for hours at Uncle Tetsu, waiting for Japanese Cheesecake,, just walk around the corner to Yutaka and have some delicious authentic Japanese food served by an all Japanese staff, a rarity in Toronto!"}
{"text":"They have really good udon! I'd definitely get it again.   Nabeyaki Udon had some pieces of fish and chicken, a shrimp tempura, egg and veggies.   It comes in a black bowl that keeps the udon hot.     So authentic and tasty, yum. They have more selection of udon for lunch; it would make a perfect meal on a cold winter day."}
{"text":"Came here for the first time with my family a few weeks ago.  I had this place on my list to try for the longest time.  I'm a huge fan of Japango so it was hard being in the Dundas St. area to pick another Japanese restaurant that serves similar dishes.  I see that a few Yelpers commented that this place was better than Japango which then really caught my attention.  It was obvious as I walked in that this place definitely has a better ambiance than Japango.  It's very spacious and comfortable.  I read that the men who started this place have worked in the Japanese business for many years included sushi chefs from Le Cafe Michi, and Edo/Hiro.  Not sure if these guys still run the place but I'll definitely ask them on my next visit.  Yes, there will definitely be another visit.  I think that I'll need a few more visits because it hasn't quite won me over compared to Japango.  I read from other Yelpers that the grilled food was over priced so I played it safe and picked the sashimi dinner and chirashi dinner that had great reviews.  I really liked the fish that was selected in the sashimi mix especially the sea bream.  We also had the baked oysters to start and that was delicious.  Overall, the service was great and we really enjoyed our dinner."}
{"text":"I gave a star for the waitress who smiled so beautifully at least even the food was so disappointing I would give it for the customer service.   We saw that it was crowded when we walked pass so we decided to have dinner there. We didn't expect much since we could see from overall of the store. So we ordered the dishes that couldn't be bad, but it turned out unexpectedly worse than we could imagine. We ordered tempura and the panko was not enough so it looked like sad shrimp losing skin and the sauce was watered down by water so it tasted off and lack of any flavor. The vegetables were so tiny, it was like mini size for kids. Then our grilled mackerel arrived and it was even tinier. It was not worth the cost because we ordered as dinner not an appetizer. We were so sad that the fish also not prepared well and it was filled with bones. The tofu steak was even sadder, it was cooked by wrong kind of tofu and it has been pre-cooked as giving some grilled marks, but it was actually cold inside and tasteless. We were so disappointed.    I have experienced Japanese food my whole life and I would say this restaurant was the worst."}
{"text":"Best jap food in town.  Price is resonable,  i will concider it is cheap with the quality of food they served.  Service is very good , all staffs are very friendly.  I will come back again for sure"}
{"text":"An OK 3.8.  Clean and spacious place, good service, globally good sushis and sashimis (not a one-bite size -- some are too large; not all fish are tender-mouth-melting). Rolls are pretty good and better sized.  Hence, if Japango around the corner is packed (often as it is very small), Yutaka is likely one of the best alternative nearby."}
{"text":"Yutaka has a great open concept sushi and robata bar, and the place is really new and clean. The staff there are super friendly and I heard them speak Japanese, so definitely authentic!  I would highly recommend:  Green Dragon Roll - loads of creamy avocados and good amount of delicious eel (they don't skimp)!  Spicy Salmon Roll - they place a good chunk of salmon in the roll (not chopped up) and it comes with a side of tempura bits, a nice touch.  The other items we had:  Tsukune with salt (chicken ball) - from the robata bar was ok for me, but my husband quite enjoyed it.  Age Dashi Tofu - overall a good dish, but wish the soy sauce was on the sweeter side.  Karaage - we opted for honey and fish sauce. It reminded me a lot like Korean fried chicken. Perhaps next time we will skip the sauce altogether so it's more like the traditional karaage.  Overall I highly recommend Yutaka, it's still new so I'm sure there are still room for improvements. So give Yutaka a try!!  Normally I would go to Japango, but I think they've changed ownership and unfortunately their quality is definitely not what it used to be :("}
{"text":"The restaurant is nice and clean in a great location. We came on a Tuesday evening and it was maybe half full. We ordered:  Sashimi app: tasted pretty fresh  Crisy soft shell crab: it was fairly large and really crunchy and tasty  Special lobster dish(forget the name, see pic): no idea what ingredients on top but it was really tasty  Green tea creme brulee: delicious  Overall the food was delicious. Service was good but theyre probably understaffed."}
{"text":"Good quality sushi, overall good experience, apart from long wait for the food to be prepared."}
{"text":"BOTTOM LINE: Yutaka has overtaken Japango as my favourite mid-tier Japanese resto.  I've been a long-time fan of Japango, but not so much their cramped space that makes a lot of restos in JAPAN look spacious! Yutaka is the opposite and perhaps even too cavernous, but it works. There are rows of seats, cubicles and, of course, the bar seating where you can watch the chefs at work. As others have mentioned, service can be variable, and there's a been 1 or 2 times where they forgot to fill my order.   But where it matters though, the fish, is where Yutaka shines. Their CHIRASHI DON is a hefty portion of fresh cuts of sashimi. Their menu also offers quite a selection of individual fish you can order at fairly reasonable prices. They offer an OMAKASE but I have not had a chance to order it.  They also offer a wide variety of other offerings including noodle soups. To that end, I would highly recommend their NABEYAKI UDON, with its hearty broth and chock full of fish, chicken and veggies. It's a great winter dish to order. Finally, although I haven't had their robata dishes yet, it's on my list to try next time. They regularly offer various specials, and on of my favourites is their steamed mushrooms (enoki, king oysters, etc.).  With Yutaka on the block now, there's finally legitimate competition to Japango, and that can only be a good thing."}
{"text":"--- Food --- First time coming here! I ordered Chirashi Dinner $25 while my sister ordered Sushi Dinner $25. I highly recommend the Chirashi - you get a variety of different fresh & mouth-watering sashimi pieces on top of a bed of rice. The sushi dinner was alright - all the sushi were only 1 version, not as exciting compared to the array of choices for chirashi, in my opinion. The sushi came with simple salad and miso soup as well.   --- Service/Atmosphere --- The Japanese waitress was extremely polite and friendly. She didn't follow-up on the food but she was very attentive to refilling our hot/cold water whenever it ran low! We sat near the booth area by the large windows by the street. It was comfortable however it became quite blinding to look at my sister as the sun started to set. The interior is nice.  --- Overall ---  I definitely recommend getting the Chirashi Dinner! :) Yes, slightly more pricey than average but I throughly enjoyed every bite of it."}
{"text":"I really, really like Yutaka and it is easily one of my favourite Japanese restaurants in Toronto. The staff are super friendly, the restaurant is clean and they offer izakaya dishes on the menu while the ambiance is more formal and less rowdy than most Japanese izakayas. Their sashimi is fantastic - it's always fresh and reasonably priced. My go to is always the sashimi dinner and negitoro rolls (2 for $16!)."}
{"text":"The food and the restaurant is decorated well, but the quality is mediocre, and the service is not pleasant. The steak tofu is over cooked, and the sauce of chicken wings are too sweet. The green dragon sushi is quite good, though. The service speed is quite slow, considering the small size of each dish."}
{"text":"3.5 Round Up to a 4  So when is the best time to enjoy an excellent \"Chef\" special chirashi/sushi/sashimi at Yutaka or most of the Japanese restaurants around town? The answer is no one knows... not even the Sushi Chef as it is really depends on the shipment that arrives everyday.   I was all psyched up to enjoy one of the Chef Special during my visit to Yutaka. And sadly after talking to the chef telling me that's not any fresh and unique fish available... I ended up just ordering a normal Sushi Platter.   Sushi Lunch ($19) has a good selection of fresh fish which I really enjoyed. The only think maybe the spicy roll which was overdosed with spicy mayo.  I like the spacious and comfortable seating.   I came right at 11:30 am when the restaurant opened to beat the lunch rush. By 12:30 pm, the place was full and seemed like they need more wait staff. So come here either for early or late lunch!"}
{"text":"From the outside you wouldn't know that this place is actually a very, very nice restaurant since they have these dark tinted windows. The inside is pretty modern and kind of fancy actually. It seems to be run by Japanese people. The menu is very diverse so there's something for everyone. They have sushi/sashimi, robata (basically barbeque), noodles, and a guu-like small plates menu. We tried the negitoro maki rolls, udon, and the red dragon roll. The red dragon roll was delicious and fairly priced. The udon was AMAZING.... definitely as good as udon I've had in Japan. You get an authentically-made shrimp tempura, fried egg, and some meat & veggies. If you get anything from this place, get the udon! The negitoro was good, but it was also like $12 for 6 pieces so I'm not exactly sure that was worth it. Overall, this is a great place that seems to do everything and every single dish we got tasted good. It's like Guu but more high-end and without the crazy atmosphere."}
{"text":"Food: 5/10. Sashimi was alright for a Saturday. The fish came from the same supplier/grade from everyone else in town (2 grades better than Loblaws). Soft shell crabs were soggy. Value: Too expensive for the quality of food. But they have to pay for the prime real estate. 100 bucks for 2 with a draft. Pretty standard in t dot. 5/10. Service: Adequate. Remarks: will not go back as there are many Japanese joints in town or in the immediate area. Nothing special here. I would rather to goto Guu for less money. I was there because next door Kimchi Korean house was acting like a buffoon.  Forecast: this place will not last long."}
{"text":"Hands down the best Sashimi I've ever had! My husband and I ate here because it is near our hotel. We had a few rolls and the Chef's sashimi. It even came with special soy sauce. The fish melted in our mouths and it was perfect with the Smokey soy sauce! Magic! We would definitely come here again!!"}
{"text":"The sushi restaurant we were planning to go to had too long of a wait, so we went here instead. It was a nice place on the inside. Dark walls & dim lighting. I had the plum wine, which was delicious. We had edamame, & various sushi rolls that I can't seem to remember. The sushi was good. But the service was very subpar. It took a really long time for our server to greet us, & when we got our food, he disappeared for a really long time. Couldn't get his attention to get the check. Perhaps he thought we wouldn't tipping since it was a group of younger adults, who knows. But our waters were never refilled & we only saw him 3 times. So for the price you pay here & the service you receive, you're better off eating really good somewhere else with lower priced s"}
{"text":"My wife and I came here for dinner. I ordered the Ramen and she got some sushi. I absolutely loved the Ramen, she was not too impressed with the sushi."}
{"text":"I came here for my birthday dinner last night and I can honestly say that this place served the best sashimi that I have ever had. We ordered the chef sashimi special, two pieces of uni, lobster sashimi, oysters and the spider roll.  The fish sashimi was melt-in-your-mouth heavenly. The oysters were small, but fleshy, fresh and delicious. The lobster sashimi was a first for me and a definite must try. They take the lobster head garnish and turn it into soup afterwards too. This was the first restaurant that had properly cleaned and fresh uni. The spider roll was not the best but certainly not the worst.   All in all, I loved my experience here. The staff were very kind and patient. Service was relatively quick and there was a high level of responsiveness from staff. Although some may argue that the price is hard to justify, I would say that you're paying for the freshness and quality of ingredients.I definitely highly recommend this place."}
