{"text":"Switched, again, to new ownership. This time a previous employee owns the place. So far so good, though I've only had breakfast food."}
{"text":"I can't believe that I've worked down the street from this cafe for 4 years and never had tried it. My office just found it and had breakfast DELIVERED earlier this week. LOVE that they deliver to businesses!!  And today, I had the most amazing Southwest Breakfast burrito!!! We will all definitely be back!!"}
{"text":"I came in for lunch and had the hot plate special - hot turkey sandwich - and it was hot and made with real slices of turkey breast.  Smashed tatoes, green beans, cranberry sauce and I was in and out in 30 minutes.  Tasty and timely, now that's the ticket! The new ownership is catching their stride, kudos!"}
{"text":"Fantastic food for fantastic prices (from Chicagoan point of view!) and the service could not have been better. The pear & Brie Fremch toast was unique & delicious!"}
{"text":"If you live,work, or play in the Tempe area you have to come into Yvonne's Cafe! The environment friendly and inviting. As for the food it's prepared to order. The owners are new but they are customer focused and care about their Brand and reputation. So stop in try them out I bet you'll be pleasantly surprise!"}
{"text":"Love this place. They are awesome with my daughter, very kid friendly.  Today I'm having the tuna melt with pasta salad. Yummm.  Very friendly staff with a home town cafe feel."}
{"text":"Coworkers and I ordered lunch and it was pretty dang good. Delivery was fast - we ordered 3 sandwiches/burgers, fires and a salad and it arrived in about 30 mins. fresh off the grill. I had the chicken Caesar salad with a side of fries. The salad wasn't anything spectacular (I wasn't expecting it to be. After all, it's just a Caesar salad!), but the greens were fresh, (not wilted or discolored) the croutons crunchy and the chicken moist & tender. The fires, however WERE spectacular! I love french fries (they're my weakness!) and Yvonne's fries are lightly battered and seasoned, crispy on the outside, tender on the inside and so delicious!  Earlier in the week, my coworkers had breakfast delivered, and said it was delivered just as fast, was piping hot and delicious, so I can't wait to give breakfast a try!"}
{"text":"This is the best breakfast bargain in Arizona. The daily specials are only $4.50! The food is great! Try the homemade chorizo or the country fried steak, both with eggs, potatoes and toast or tortillas. They only do breakfast until 11:00 and lunch, closing at 2:00. This is a great stop on the way to the airport ."}
{"text":"I used to frequent Yvonne's on a regular basis.....not any more! :(  As many other Yelper's have commented - since this establishment has come under new ownership, the food has gone downhill, and the friendly service as subsided!  Since I work within about a mile of Yvonne's, whenever I had customers in or had a business lunch, this was a nice, friendly establishment to come to for lunch.  I have tried eating here three times in the past two months- and I just cant do it any more.  I took 5 of my employee's here yesterday- and I appologized to them when we left (because I picked the restaurant).    To top off the sub-par food - I checked in via Yelp, and to my surprise received a coupon for 20% off my meal.  When I presented this coupon (that had the clock ticking on it, showing it was still good for 3 more hours) I was told this was an old coupon and they wouldnt accept it.  I asked for a manager - and she came back and said they would, but this time only - and all but made me feel like I was committing a crime by trying to cash in my coupon.  Good luck Yvonne's!  I hope you can turn it around.  You had a great reputation, but my experience with the \"new\" Yvonne's will not have me coming back."}
{"text":"My original review mysteriously disappeared that I did on 9/12 so I am posting again. I am only giving it two stars because I like the wait staff, otherwise it would be a one star.  Since the new owners took over, the place has changed dramatically and the pricing has gone up in the 20% range.  I agree with Neil S and Cameron K, the new owner can be arrogant and does not like constructive criticism.  I used to go there 3-5 times a week for lunch, now I am down to 0.  Actually, most of my office has stopped going there. The whole wheat bread is now some kind of sweet whole wheat with little seeds.  The coleslaw which was a sweet slaw now consists of multicolored cabbage and is anything but sweet. They were making it similar to the previous owner but not as sweet which didn't make me happy but the major change pushed me over the edge. The last 3 times I had gotten chicken noodle soup, there was no more but one piece of chicken in it and that was much smaller than your pinkie nail. I think the new owners came in and wanted to make it their own rather than realizing that the business they bought was successful for a reason. Were they trying to attract a new type of clientele?  Now they are going to have to do that.  Now I am going a lot more to AZ sandwich, Dilly's, Munch a Lunch.  My standard lunch at Yvonne's was $10.50 without a soda and quickly shot up to $12.45 for the same.  I can go to the other places, order something comparable or in some cases better Plus get a soda in the $7-$10.50 range so I guess Yvonne's has seen the last of me. The sad thing is that I am a creature of habit, like going to the same place, and I never would have strayed to these other places to make the comparison if I hadn't become dissatisfied."}
{"text":"Great breakfast had the Irish omelette very tasty I would go back and order it again.  One of the best Country potatoes had. Very friendly staff"}
{"text":"We've been going to Yvonne's for years now and it used to be great. Recently, the ownership and menu changed and with it went everything else. The new owners decided to change the menu which seemed like a good thing at first as it added variety and new options. After trying a few items on the new menu we realized that change is bad. We ordered some old classics and some new dishes after going there a few times and were sorely disappointed with everything.   In addition, the service has gotten significantly slower. While the wait staff is still friendly and works at the same speed they always have, the wait time for food itself has increased ten fold. When we spoke to the manager about this, he just said that's how they run things and that 30-40 minutes is a normal wait time. That is not a normal wait time for a diner in a business area for lunch. We always went to Yvonne's to get a quick bite to eat that was good and filling. Now we can't get in and out inside an hour? I don't think we'll be going back anytime soon.   Best of luck to the rude and non-customer service focused new management. I hope that your wait staff doesn't suffer too much from your poor choices. From the emptiness of what was a once packed lunch service that we experienced yesterday, I'm guessing everyone will be rethinking their decisions for change very soon."}
{"text":"This will be my first 1 star review. I hate to do it, but the truth must be told. I live accross the street from this place and was anxious to try their food as it is so conveniently located. Well, I am disappointed to say the least. I ordered the \"Country Fried Steak\", w/eggs over easy.  The steak just didnt taste good. I assume that it is a frozen supplier cheapy.  Now to the eggs....and this is a first for me, the eggs were so over done, that the yolk was completely cooked all the way through! If I were at the grill I would have tossed them and thrown two more on. Friendly staff, maybe the lunch menu is better, but I'm not going to chance it."}
{"text":"Today was the last day for purchasing Breakfast Burritos from Yvonne's. I work in the area and received my miniature breakfast burritos that left me hungry. The burritos were once a handful. They were half of the size of the to go container. For $5 there should be more food there."}
{"text":"Every Friday at our office, anywhere from 3-8 of us order breakfast from Yvonne's. Their breakfast is decent, they have a very inexpensive daily special, and they are one of the few places nearby that delivers.  The last few Fridays, they have shown their irritation over us paying individually for our food, until last week, when they refused to split any more orders from us more than 3 ways.  Well, we simply found somewhere else to order breakfast who were happy to have our business."}
{"text":"I did a search for somewhere new to try the other week, and have returned here three times since.  The food and service is amazing.  It has the feel of an older diner, and the old familiar service to match.  The food is superb.  I only wish they were open later, to grab dinner on the way home."}
{"text":"This place is great, unfortunately I have no time to actually sit there and eat but I get my lunch delivered. I'm within walking distance and the food shows up fast, usually within 15 min. Thank you guys!!"}
{"text":"Yvonne's is walking distance from my office so my co workers and I use to frequent this place for a hearty lunch. The food is nothing special its plain diner food and well the service is very very slow. The waitresses would be a bit bipolar one day they are super nice and others they were rude it was a strange way to treat regulars. I stopped going here since it wasn't worth spending the money when there are better lunch spots in the same area."}
{"text":"Really solid lunch spot.  Food is always consistently good and I've tried almost the whole menu."}
{"text":"Great little place.  Great service, with a smile.  Home-cooked meals.  Skip the chain restaurants and come here!"}
{"text":"Just got back from out of the country and were welcomed back with very warm friendly smiles... Great food and service, good hometown food"}
{"text":"Yvonne's is a part of the family here in Tempe.  Through a change in ownership, their dedication to their customers has remained constant.  The food is great.  I have several favorites to include the BLT Stacker and their croissant sandwiches.  This is a charming small cafe with a pleasant atmosphere.  I frequently bring out of town guests here for a quick business lunch. They had a rough day for their deliveries today, we had our cooked order in ten minutes when they personally ran a quick delivery to keep us from having to wait for the delivery driver who was on a delivery further away from the home base.  Exceptional service.  Bravo, Yvonne's!  Keep up the great food and even better customer service!"}
{"text":"I love Yvonne's! They have an awesome $2.99 daily special.  Aw man, the biscuits and gravy on Wednesdays are really good.  They are pretty fast on the delivery as well. They are one of the few places that deliver to my office early in the morning.  It is our go to place to order breakfast."}
{"text":"After coming to this cafe for a couple years and ordering the patty (sirloin) melt like I always do, I was thoroughly displeased with the order today.  The patty melt barely had any swiss cheese, and the patty contained a couple pieces of bone, yes that's right, bone.  They were each about the size of a grain of rice.  So, no thank you to Yvonne's, I want to keep my teeth.  We are all struggling in this economy, but when the menu says sirloin, that's what I expect...not bone fillers and heaven know what else was in the patty."}
{"text":"Today I tried this place for lunch for the first time.   I ordered a Santa Fe melt. The menu said it had green chili. But It came out with bell pepper.....  Im not going to draw a conclusion about this place just yet. Maybe yelpers can tell something from my experience."}
{"text":"The owner came in our office and dropped off some menus for us too see, my co-worker and i were in ahh and decided to order chicken tenders.....1 hour later!! I called the place to see what was going on and the lady placed me on hold without explaining anything 10 minutes later she said that it was on the way. After 1 hour and 15 minutes the food finally  arrived & i was a disappointed. Not only was my food cold but  for the price i could of gone somewhere else."}
{"text":"It was disgusting. The homefried had no flavoring not even onions. The potatoes weren't done. Half the bacon wss overcooked and the rest was still raw. The eggs wwew hard. Like they put them in the microwave.  The toast was burnt as well. It was impossible to eat. $10 in the trash smh"}
{"text":"I'm so glad I found this cute cafe near my work.(Must love coca cola) Theme is Coca cola inside. It's bright and clean. Staff is very friendly and helpful.  I enjoy stopping over for a quick breakfast in the morning (must be the best kept secret in Tempe and I wish we were open on weekends cause I want to try the Banana Foster Pancakes!!!!). A few weeks ago my company did a small catering order with them for lunch and it was superb."}
{"text":"Ate here once.  I found the burger utterly uninspiring.  It's pretty standard diner fare, except they don't do it particularly well.  It feels a bit like eating at a cafeteria with waitresses.  The staff is friendly enough, and the prices are fair, but they need more flavorful food, better decor, and less cheap feeling furniture.  Maybe a decent lunch option of you work within walking distance."}
{"text":"This is a cozy neighborhood cafe. Very bright and cheery with the bright red decor and lots of windows. The place was quite busy when I was there for lunch on Wednesday. Service was great!  Quick and with a ready smile.  The food is good, not great but homey, like Mom would make. The potato salad is top notch. The presentation was a little bland or lacking, very plain. Dressing up the presentation a little might make the overall meal seem more appealing and less \"sterile\".   Price was a little high for amount and quality of food received, but again the fast and friendly service was appreciated. I would go again, but not necessarily as a first choice."}
{"text":"I was in on Friday. Everything was very chaotic and the wait times were absolutely ridiculous. The employee was very friendly however she informed me that there was new ownership, which would explain the new system they have implemented. They have gone back to the ancient ways before the computer system. They are definitely taking a step back and ruining one of my favorite restaurants. I most definitely will not be returning if this is what I have to look forward to. What a bummer!"}
{"text":"I'm very disappointed! I've ordered from this place numerous times for delivery and visited the restaurant a number of times as well. Today I ordered food for a meeting and a colleague did the same. The food for my group was fine but my colleague found a dead roach AND a live one in her salad! She called and was told it came from the warehouse (?) How does one not notice a dead and a live roach in a salad while preparing it? At any rate, my colleague is now trying to contact the health department and I am now trying to force myself to throw up. Never again."}
{"text":"Yvonnes catered a company breakfast for us this morning and it was amazing. Brenda and Cory we very helpful in deciding what would work best for our needs. They delivered it on time. Very pleased with the whole experience.  Looking forward to using them in the future."}
{"text":"New owners, great service, delicious all American food. Great breakfast and lunch menu. Clean Coca Cola diner. Love the BLT, patty melt, and grilled cheese sandwich"}
{"text":"Club sandwich with French Fries and a side of ranch. This is just a go-to when you want to get a bit wild for lunch. I've tried their breakfast which is amazing because they have the crispest bacon and their bacon egg and cheese croissant is the best of the best. Getcha self some!"}
{"text":"This place is so awesome!! The food is excellent, I have tried many different items. And they deliver, and they are fast! I can't say enough about how excellent their customer service and quality is!"}
{"text":"It's close to my office, so it's very convenient for me to pop in for a bite. I usually eat my lunch quickly while reading the news and they always are quick with taking order, bringing food and check. I can sit down and have a nice lunch in under 15 minutes. Bravo!  Ooh, and they also do breakfast, which is super handy for those really early mornings. And, for those of us who like to eat breakfast for lunch. Yes please!  Note: they only serve breakfast til 11am, but that's close enough to lunch, right?  The theme of the place is nostalgic and vintage CocaCola gear. It's definitely got the cafe feel, home cooking thing and the decor to make you feel like your at your great Aunt Edna's kitchen.   They also do quite a bit of catering. That side of the business is adjacent to the restaurant. I've never had their catering, but only imagine it's top notch.   Their service is great. For a reasonably small location, they always have at least 2-3 people on the floor helping. Even when they're busy, they take care of business. Albeit, on girl mans the phones most of the time - presumably for catering calls.   The food is good. It's straight-forward and made like you would in your kitchen at home. They have a blue plate special everyday and I look forward to checking out that white board.   If you're in the area of University and Priest in Tempe, pop in and check em out. You won't break the bank, you'll be comfortably full and your stomach will thank you later."}
{"text":"So this place delivers - that's nice.  A co-worker of mine ordered a round of breakfast for us and I'm already full of regret.  Veggie Omelet - $8 + $1 for cheese. Choice of 3 veggies, the eggs are definitely egg beaters and taste like sugar was added. The provolone cheese was placed neatly atop the omelet and melted into a gelatinous blanket. This omelet is tasteless and has an oily feel in my mouth. Gross.  This came with a side of cold, soggy potatoes, also flavorless.   Cheese Danish - $1-$2 for a danish that clearly came from some crappy Costco. It was dry and had a minuscule amount of cheese filing.  GROSS unless you have extremely low standards and don't mind dropping 12 bucks for a breakfast that may as well have come from a low income middle school cafeteria."}
{"text":"I work within walking distance and used to go to Yvonne's all the time. I was a regular until the new owners purchased the business. I gave it 3 tries and have not been back since, nor will I ever go again This is how my last breakfast at Yvonne's in Tempe went:  Waited 3-4 minutes to be greeted - I ordered coffee and breakfast Another 5 minutes for my coffee to arrive. At this time,  regular customer came in at the 10 minute mark and was instantly greeted, and given coffee. I was neglected from this point forward.  10 minutes later, the regular got her breakfast.. 10 minutes later she finished, and paid while I sat, with my coffee unfilled, waiting for my food to show up: -Rubbery ham -Overcooked  egg whites -Dry toast.  30 minutes to get my food and not be given any customer service what so ever.. I'd like to blame the training of the staff for this one, but it was one of the owners herself that was my server...  This place was far better when the previous owners were in control"}
{"text":"Have been eating here for a few months now.  Days where we are busy at the office we just call and get the food delivered. They have a buffalo chicken sandwich that is out of this world good.   Their Fries are outstanding and always taste the same.  Love eating here"}
{"text":"we ordered your food this morning and had it delievered at our workplace. it was hot and WONDERFUL . YUM"}
{"text":"What a great breakfast/ lunch place that even offers catering! The owners here will walk up and greet you personally. The menu for both breakfast and lunch is extensive. You'll want to go back again and again to try the different offerings. In addition they deliver to local businesses and the restaurant  offers free WiFi! Nice place to eat and keep up with work. The ambience is done as an old 50's diner with all the Coca-Cola memorabilia. And the service staff is friendly and helpful. This is a must try!"}
{"text":"It's cafe food at cafe prices, what more do you want?  The service was good and the time between our order and delivery of said food was fast!  I would eat here again and probably on a regular basis."}
{"text":"Oh Yvonnes...what happened.  Our waitress, while very very nice, was sooo slow. The food was alright (I definitely remember it being better). Their house made Coca Cola bbq sauce was delish, but the sandwich it was on was sub par. Our table was sticky (we watched it get cleaned), like movie theater floor sticky.   I dont anticipate another visit anytime soon."}
{"text":"I found this first trip very satisfying but nothing super special. The staff were pleasant and my half sandwich and salad combo was just fine. The place was clean and service was fast.  I feel that you could come here daily an they'd get you your usual without having to ask you what you wanted.    I got the egg salad sandwich and a garden salad that was very plain. I want to come again and order their cheeseburger . It looked so good on other people's plates!"}
{"text":"This place is the best, as well as the owners Cory and Brenda!!!!! You must try the fries... wish I could give 10 stars"}
{"text":"Every body, new owners! Food was good and service was fast. Server had a big smile. Best wishes!"}
{"text":"Stopped for breakfast today.  Pretty basic stuff very friendly prices are reasonable.  I had the Veggie sandwich which was pretty good and coleslaw which tasted exactly like what they serve at KFC.  My mom had 2 eggs and home fries which she said were amazing.  My husband had an omelette which was so so mushrooms that were in it were canned which I don't really care for.  My son had a pancake which was really fluffy and good.  Nothing was terrible all of it came to right around $30."}
{"text":"Giving them 5 stars because their service is amazing, the food is always tasty, and their dining area is awesome and always clean. This is my favorite place to eat in the area!"}
{"text":"What an awesome place in Tempe!  The staff is super friendly and provides great service.  The food is great with a menu that has plenty of options for everyone :)"}
{"text":"Went there on a Saturday and received immediate service. Everything we ordered was on point! Pancakes were massive and delicious! I especially loved that they had flavored coffee creamer. That's difficult to find at mom and pop restuarants now a days. We will definitely come back!  P.S. Not good for people with babies though, as they do not have a changing table."}
{"text":"Very nice local breakfast place--fresh food and friendly service.  Very close to my work and recommended by a friend--will be going back!  The breakfast burrito was just right--not enormous like some--but big enough for that hungry young college kid.  Will be trying their lunch soon."}
{"text":"Yvonne's is a little hard to find there on the north side of University but it is worth looking.  They have a nice diner atmosphere with vintage Coke ads through out the place.  They have a regular blue plate special and different soups of the day.  I found the blue plate today very tasty. (Chicken sandwhich with mushrooms and swiss).  The onion rings are also delicious.  I seemed to get a batch of kinda small fries but they seemed to be cooked well and were tasty.  The waitress was friendly and attentive.  Yvonne's is a decent place to eat.  They also split out our check at the end which is handy for lunches with co-workers."}
{"text":"I saw their ad on Facebook yesterday night, decided why not give them a try. Well I was not disappointed. Our waitress was nice and polite and the food was really good. Sorry if I did not post pictures... It was too late I finished it. :)"}
{"text":"Great food, great prices!  A must try is their housemade ranch dressing:-)  Waiters are sweet, fast and your food is served to you in under 10 minutes.  I love the Turkey Melt.  Be sure and watch out for the cardboard peeping Elvis in the restroom, ladies- about gave me a heart attack- TWICE! LOL"}
{"text":"I use to order from here all the time, but things have changed the last few times i've ordered breakfast. The veggie \"omelette\" i ordered looked more like  scrambled eggs with veggies mixed in. I ordered Onion, Mushrooms and spinach, but only little flecks of spinach were in the omelette.When i called at 8:10 to place my delivery order i was told they had a large order that was placed right before mine so it might take a little longer then usual. I work directly accross the street and i received my food a little more then an hr later and it was not very hot. it just looked gross, and to be honest the food truck food tastes better."}
{"text":"Just okay - seems to be a popular lunch place for folks working in the area.  The fries and potato salad were very good.  The sandwiches not so good.  We ordered the cheeseburger and club, both had no 'life' to them..."}
{"text":"First time visiting this little gem and found it to be a very good lunch choice.  It has an old-school, small-town vibe to it.  I wasn't expecting a sit-down, waitress type of set-up, but it worked out just fine.  Everybody greated me and were very friendly.  Timing of order taking and food on the table was pretty fast.  The food tasted great and I will definitely make a return trip or two to Ynonne's."}
{"text":"I am currently waiting on a Cobb salad to go.  It's been about 25 minutes #liveyelping #yelpondemand. I will edit this as needed if this Cobb salad for some reason provides a mind explosion experience in which I will completely understand the 30 minute prep time.  Alright it was pretty good."}
{"text":"My husband and I went to Yvonne's for breakfast.  The menu has all the breakfast mainstays covered, and the food was very good.  The prices were also a nice surprise. I especially liked the fact that the place was very down to earth and friendly. Great neighborhood place..we will be back."}
{"text":"Decided to give this place another shot this morning for breakfast.  They have a great special for $2.99 so I went around the office asking friends if they would like to order something with me and they all did.  I called, placed all of our orders, and the girl says ok we will get it out to you when its done (no time frame mentioned).    51 minutes later...I finally realized hey its been a long time, let me call and see if something happened or they got lost (even though they are right down the street and have delivered here before).  The same girl answers and immediately puts me on hold which is fine, then comes back on and I tell her I'm just checking on my order.  She asks my name, puts me on hold again, then says oh it should be ready in 20 mins or so.  WTF? 20 more mins for 4 orders of eggs, pancakes, and potatoes???? um no thank you.    I said well I guess I will have to cancel my order because I have a meeting in 30 mins.  She tells me ok one sec...yeah about 20 mins. I said wow that's a long time.  Her response was so do you still want your food? Uh nooo.  Now I feel bad because not only did I not get my food, but now my co-workers don't either :(  I heard they have new management (and not to order from there anymore) but I thought I'd give them a shot today and now I'm regretting it!"}
{"text":"Great breakfast/lunch joint.  The staff is friendly and the owners remind me of restaurant owners back east, they come out to greet you and ask how everything is. Service was quick and the wait staff friendly.  I've eaten there a few times for breakfast now and my favorite dish is the biscuits and gravy...best sausage gravy I've had in awhile.  The French dip is also a great lunch item and the fries are awesome."}
