{"text":"Limited food. False menu advertised. Small portions. Not worth the regular prices. Taste decent. I saw this restaurant on restaurant.com . It's new on restaurant.com . They showed a large menu with a big variety of foods including dinners with all meats including whole catfish, other fish dinners, jerked chicken, shrimp, different beef dinners, goat, and other chicken dinners. They showed inexpensive appetizers liked smashed yams $3.99, meat & potato pies $4.99, and the one thing I really wanted smashed black bean & meat patties for $3.99. We went there specifically for the catfish dinner, jerked chicken, black bean patties, and the smashed yam appetizer. When we got there, I was very disappointed. They just posted this menu on restaurant.com and they posted their original old menu. Every single food item that we went there for was no longer on the menu. None of it. It was a very small, limited menu. The very first question they asked was \"Do you have a coupon of any kind?\".  Yes, I did. I told him I just looked at their menu they just put on-line and why were we handed a limited menu? He said no one ever ordered the catfish, jerked chicken, black bean patties, beef dinners, other chicken dinners, etc.....So they took 3/4 of the items off their menu.  Nothing irritates me more then having a restaurant purposely false advertise their menu just to get people in the door.  There was 1 fish dinner for $15. There was 1 beef shishkabob dinner for $11. One 3rd dinner which was piled high with spicy rice-small, some beef chunks, and plaintains for $15. On the menu, they showed this rice dish with a lot of beef and plaintains. The appetizer yams for $3.99 was gone and they had a dinner of just smashed yams for $15!! I ordered the rice dish with beef and plaintains. We ordered stewed wings for $8.  A sausage appetizer for $5. And coconut shrimp for $9. The portions were very small accept for the sausage appetizer. They were definitely not worth the prices paid. For $8, they gave us 6 tiny wings. They gave us 6 shrimp for $9. My dinner for $15 was a large plate of rice with 3 pieces of beef and 5 slices of thin plaintains (like bananas). I believe this is why they asked first if we had a coupon. I think they cut way back on the portions because they knew we had a $25 off coupon. The restaurant was decorated ok, in an African theme. We were the only people in the restaurant at 4pm on Saturday evening. The food was definitely overpriced for the portions you got. I don't know if they cut way back on the portions because they knew we had a coupon, or if they just skimp to begin with. The flavors were average. The owner was our server. He was nice but not attentive. I wouldn't go back here. I don't think this restaurant will be open very long. They're going to get too many people irritated by posting a menu they don't have."}
{"text":"If you want an American dinning experience don't bother. If you want good food, this is the place. The restraint is not fancy. It is clean and comfortable. The food was very different. The four of us ordered enough food for eight. We tried a lot of different dishes. Some of us like some of the dishes while others didn't. No food was disliked by all. This is not fast food. Bring some good companions and enjoy each other while you wait for food fixed from scratch not from a bag. Be flexible. Some items were not available but similar dishes were substituted. Both goat dishes were very good. Chicken gizzards and plantains were very tasty. Who knew?"}
{"text":"Was incredibly excited when I learned of this place through Groupon. We bought the Groupon & quickly planned our dinner outing. It is situated in a corner of a dark/sad little strip mall, which was not a problem as we were former Peace Corps volunteers. Our focus was the food not the ambience. 

We were expecting service to be kind of haphazard since we lived in West Africa. The service was bad. We were not informed that items we had ordered were not available until approximately 20 minutes later. Half of the menu items were not available. We were charged for the full price of the appetizer combo even though we were only given 3 out of the 4 items, and 2 of the 3 items given were substitutions. They did not have the peanut soup (which is why we went) and the spinach \"stew\" was very dry although the flavor was reminiscent of my time in Ghana. The server/owner seemed nice but obviously overwhelmed as there were several tables waiting for a long time as well as people waiting for take out. The bill was wrong and when we pointed it out to the server, he appeared annoyed, as it was only, \"a few dollars.\" 

We won't be going back."}
{"text":"For an adventurous eater, the food here is a delight. Spicy and sweet (it had my nose running), proteins you don't find elsewhere (goat and gizzards), and off-the-chart yummy seasonings. Reasonable prices too.
   The big downer is the ambience. The place for many years was an Italian restaurant, and it's still decorated like one. And worse, it still smells like one. The carpeting and stinky drapes need to go.
     You'll have to weigh for yourself whether the great food or the bad setting wins out."}
{"text":"We have been looking for some good curry goat and found it, there are no Jamacan spots in north Phoenix. This place is a welcome change from the usual. I had the Zollof rice with goat and it was soooo good! My boyfriend had Ayamesha and loved it. We also had meat pies that were pretty tasty, not as spicy as the Jamacan style but still good. We'll def be back!"}
{"text":"This restaraunt is in a fairly rundown strip mall in Glendale. The interior of the restaraunt was plenty spacious and clean but extremely dark, even at mid day. The food was reasonably tasty and wonderfully spiced but the luncheon menu was pretty limited. I had the goat stew and my lunch guests had the Yam Porridge, all of which was heartily consumed and enjoyed. The portion sizes were good and the overall eating experience was as well. The server was friendly and well mannered but extremely inattentive even though there were very few people in the restaraunt.  When we were ready to order we actually had to get up and summon him to the table.  Several items that were on the menu were actually not available to order.  The food though good was in my opinion overpriced ($55 for three at lunch, including meals, sodas and tax). Though I am happy I had an opportunity to experience and enjoy the meal, it is unlikely that I will return to this restaraunt and would only recommend it to friends for the purpose of enjoying a meal as a distinctive change of pace."}
{"text":"The service was great and the food was excellent!  We will definitely return for more meals.  Large portion sizes.  My wife, daughter and myself have enough food for 2 to 3 days."}
