{"text":"Great food and very good service!  We will definitely return here to dine!"}
{"text":"I love Zappitelli's. For a neighborhood homestyle Italian restaurant it is terrific. I've been many times, but this visit my companions and I had veal parmesan, cavatelli with meatballs and the veal + veal special which was a smaller portion of veal parmesan and three veal cannelloni. The veal cannelloni were amazing. Tender pasta stuffed with ground veal, ricotta cheese and spinach covered in mozzarella cheese and red sauce, it was really delicious The veal parmesan was tender and nicely fried with lots of cheese on top, just the way I like it. The cavatelli is always good. I've been dining here for years and was persuaded to write a review after reading some of the negative reviews. This is not high end dining, it is delicious comfort food in a small, family run, neighborhood place. The sauce is good, the service is good, mostly young teenagers who really work hard. This place is always busy and does a tremendous amount of take out as well. If you need take out, I highly recommend! The containers they use ensure that your food is still piping hot when you get home and the portions are so large that you are actually getting two or three meals for the price. A great value!"}
{"text":"Good Italian food especially the sauce at decent price. Love this place. Our go to place for home Italian when out."}
{"text":"Good pasta, big portions.  Wish they would pound out their chicken when the make chicken parm!  They are charging to add cheese to your salad if it's \"to-go\", not happy about that."}
{"text":"Unbelievable pasta! Sauce to write home about! Very friendly service. You can hear the owner Anthony yelling out waitresses names when their order is ready which adds to the charm and ambience"}
{"text":"I've been to many Italian restaurants in Lake County, and this one has topped them all so far. Fantastic!"}
{"text":"It's rare my boyfriend and I order food and don't keep what we don't eat for leftovers but in this case, there was no way we were keeping what we didn't eat. The reviews we saw on Yelp made us think \"let's give them a try!\" and I'm really wishing we didn't. We ordered a chicken parm sub, meatball sub, and a large pizza. The prices were higher than what we wanted but due to the raging reviews we thought it would be worth it. Wrong. The chicken parm sub wasn't terrible but wasn't good either. It tasted good at the time because I was starving but as I got towards the end of my half I was not impressed. Soggy bread, bland sauce... nothing to write home about. The meatball sub (which I didn't eat) looked good but based on the look on my boyfriend's face it wasn't very good. The bread looked very soggy which is never good. The pizza... ugh... The sauce was not good (too sweet and just so not good) and the crust was soggy and tasteless.  Overall, what a disappointment... We won't be returning."}
{"text":"This is a great restaurant, the food portions are huge, me and my wife share one dinner and still get full! Or you can eat till your full, and take home the leftovers and eat it the next day. The place in Mentor is better than the one on bishop Rd, believe it's called Stonebridge try it you'll like it. PAPPY"}
{"text":"Sauce is bit bland, food is bland. However if you don't know real home cooking, or are not Italian, your going to be happish..If the cook would use the spices in any Italian grandmother's kitchen, he could improve 100 percent. This joint would never make it in Iittle Italy. But in mentor....it does."}
{"text":"This was my first visit here. We stopped because of all the positive Yelp reviews. First, our server was very sweet and nice.  My boyfriend and I got the antipasti salad for two with the house dressing. It was enough salad for four!!  I'm sorry I didn't  take a picture of it, we just dug right in when it came. The bread that was brought to the table was warm and fresh and the size of a hamburger bun. We ordered chicken parm with homemade spaghetti and a small white pizza to share. Holy cow, it was a ton of food and it was all delicious. We had enough left over for a whole other meal."}
{"text":"So my boyfriend and I Love to try new restaurants, and we really wanted Italian. So we decided to give this place a try, my boyfriend ordered spaghetti and I ordered the lasagna.Now we both have high standards when someone puts \"homemade\" on their menu, and they said that their spaghetti is homemade. Let me tell you, it definitely was homemade and amazing! The noodles actually stuck together when you spun them onto the fork! The sauce was flavorful and I wouldn't change a thing! So the spaghetti was really really good, But my lasagna was AMAZING!!   Huge portion, baked and loaded with cheese! I hate when restaurants are cheap on the cheese but this place defiantly does it right! We will be back!"}
{"text":"We have eaten here many times and have never been disappointed.  The portions are so large that it is enough for my husband and I to share and still take some home.  The pasta and sauce is all fresh and homemade. Most dinners come with a side salad and we always get the homemade balsamic vinaigrette. They have a standard menu with daily specials. We got the stuffed chicken parm and it was delicious, the cheese was brown and bubbly and the chicken was tender. The \"side\" of linguini that came with it was overflowing and mouthwatering. My mother in law had a meatball sub and shared some with us. I am not a fan of meatballs but these definitely were the best. We always recommend Zappitelli's to friends and family looking for an authentic Italian meal."}
{"text":"Five of us went to dinner here. I highly recommend call-ahead seating. I actually called at noon to put my name in for 6:30pm. I don't know why they call it call-ahead seating because they literally held a table for us (isn't that called a reservation?). Onto the food and service...service was appropriately paced for a packed Saturday night. PORTIONS ARE HUGE. Save yourself some money and split entrees, seriously.  The, \"side\" of spaghetti that came with my entree was the size of an entree at other restaurants.  No joke.  The chicken parm was okay. It really lacked salt.  Cheese was good, sauce was okay, and I am a sauce person.  It was a little on the bland side for me and lacked any character.  Hubby said his pizza was pretty good.  The youngster liked his cavatelli.  The lasagna was the size of a miniature boat.  Again, split the entrees.  Quite a few beer selections for imports and domestics which was nice.  Overall, I thought the food was pretty good but not as great as some have purported. My absolute fave Italian place was Mama Catena In Euclid but they went out of business. That place was incredible.  One thing Zappitelli's could do is have separate lines at the counter for PICKUP and DINE-IN.  The entrance gets clogged up with people waiting in one line for pickup orders and people wanting to be seated. Not efficient."}
{"text":"I took my grandfather there. We split the ribs (which they only have on the weekends) they were great. The meal comes with two racks, green beans & mashed potatoes. They bring a starter salad and roles. We ordered an extra salad, it turned out to be more than enough food. The only reason it's not 5 stars is the service was extremely slow. And a different waiter had to go get our waiter several times because she saw us ready to order, needed more drinks, wanted to pay, etc."}
{"text":"I was a regular customer for the last 2 years, and did enjoy  the food overall.  I ordered takeout during lunchtime, and  would order from the daily lunch special  menu regularly. I had a couple of bad experiences now with this place when it comes to customer service, and caring about the community that supports them day in and day out. The management just does not seem to care about the customer, and does not want to take an  extra step to make the customer happy!  The lunch special runs until 2pm daily. Today at 2:09pm I tried to order and was turned down by management. He babbled across the room to the woman who was helping me on the phone. I am a regular, and 2:09pm is not that far off from the cut off time. Most restaurants would be a little flexible, especially for a regular. This has happened twice now in the past 6 months. Customer service, and common sense goes along way in the restaurant business. I will find another place for regular takeouts."}
{"text":"Everytime we are in the area we have to have one dinner here.  I don't crave pizza, but the fettucine alfredo was absolutely outstanding!! Fresh and steaming from the kitchen, the first thing that will appeal to you is the delicious aroma.  Plenty to take home, but reheating not as superb.  I'd recommend sharing (even if there is a fee) and enjoy it fresh.  The mannicoti is fabulous.  The Italian sausage is great. Take home a cream puff 'cause I guarantee you won't be able to eat on there after dinner."}
{"text":"Upon arriving to Zappitelli's we were told the wait was going to be 25-30 minutes. We waited for over an hour prior to being seated. Two employees kept going into the parking lot to look for someone. When the last waitress came in, she said \"O there you are\" to a family in the corner who had walked in 5 minutes prior. They were seated instantly.   It is one thing to wait longer than you're told; however it is ridiculous for employees to go in the parking looking for someone they know and not seat people who have been waiting over their quoted time. Not to mention there was a table empty for 20 minutes before someone cleared and cleaned it and many others that were empty for a long time with employees walking by, looking at them and not stopping.  Once seated, our waitress was speedy and kind. I ordered the hot pepper parm and it was good (I would get it again, but it wasn't the best meal I've ever had).  My boyfriend ordered the Walleye, his potatoes weren't crispy, and he said his meal was \"ok\" but he wouldn't order it again."}
{"text":"First things first, expect to take a doggie bag home because portion sizes here are HUGE.   I've been to Zappitelli's twice for a sit down meal and definitely was not disappointed either time. This past time I went with my family and ordered the potato gnocchi. I could only eat half of them because there were so many, but that was not for lack of trying :). If I had room I would have downed the whole plate.  Beer selection is ok, nothing spectacular.  My one complaint is that we were one of three families in the restaurant at the time, and they seated all of us right on top of each other. It would have been nice to have at least a table in between, especially when it wasn't that busy."}
{"text":"Great food, a little too heavy on the sauce though. Prices are high, and I get it because they give wayyy too much food for 1 person. So, maybe they can cut down on portions and their prices? The cannoli's are awesome."}
{"text":"Excellent family-style Italian with incredibly large portions. The chicken parm was very tasty and my side of pasta was large enough to be an dinner itself. My kids ordered pizza and, surprisingly, it was just average. Go for the pasta and other entrees and you won't be disappointed."}
{"text":"There is two other booths with people so it's pretty empty today. Been without a refill for about 25 mins. Both ladies who are waitressing have been out of sight the whole time. When we see them they are just walking back and forth. The cook from the back had to hallor at them To bring out food. the girl who brought it out didn't know where it went and still didn't bother with a refill. Let's just say I won't be back."}
{"text":"One of my favorite Italian places in mentor.  I was from Chesterland originally and miss Guidos and Zap is a great replacement. There sauce is awesome and meal positions are huge! And they deliver if you are close."}
{"text":"I really like this place. It is a nice lil family joint where you can go get a nice dinner. You will have enough left overs for lunch and dinner the next day too. Chicken Parmesan is about $16.  I particularly like the sauce and usually end up buying a quart or two to take home and freeze for later.  Wait staff are usually high school girls and MOST of the time they are pleasant and do a good job. Sometimes you get one that is too busy doing everything else but her job.  They also have a case of desserts like eclairs and such, I've never had one but it looks pretty good."}
{"text":"Stupidly good with enormous portions. The veal parm is  insane and a great value; two adults could split it."}
{"text":"I've pretty much given up on Yelp.  Most reviews are from teens who aren't experienced or those folks who appreciate a lot of food contrasted to honestly good food.  Zappitelli's gives you lots of mediocre food for a little money.  Ordered small Deluxe Pizza.  Toppings were only marginally OK except for the Ham.  What's that about?  What killed this Pizza was the crust.  Tasteless, and extremely soggy and soft.  I confess as a South Philly & NYC former resident, I'm spoiled by thin crust Pizza cooked in coal or wood fired ovens.  Nice crust and made in store.  I live in Florida now and Antony's Coal Fired Pizza in Tampa and Orlando are very good.  Just saying so you know good Pizza can be found outside the Northeast.  I then saw \"Homemade Cavitelli with meatballs.  Sounded good and difficult to screw up.  Nope, they did.  Hard to believe the Cav was homemade.  Why, because all consistent size and length and tasteless.  Also, cooked to the point that they were literally mushy starch.  The meatballs were large and again barely edible.  The gravy as I call tomato sauce tasted like out of a can.  So, why did I go? Yelp reviews were close to 5 Stars.  Seriously?  Also, I saw they claim to use DeCecco Pasta, my favorite brand pasta after homemade.  How this could possibly be anyone's favorite Italian Restaurant is very sad.  I don't know how Yelp can improve real experiences, but maybe have a Yelp Pro where only mature diners can offer reviews.  Until then, I'm out of here.  Sorry."}
{"text":"I come here every Sunday for pasta. The dinners are generous enough to split with a dinner partner or to take home for another dinner. I split mine with my husband and order a second salad. For what you get, we are always satisfied.   I presume the ingredients are good based on what's on the table:  fresh cheese, mild hot peppers, sea salt, real cream, Colavita balsamic vinegar. Extra virgin olive oil. It's all good; is all good including extra napkins.   The food here is just like home.  Love it."}
{"text":"Definitely try out Zappitelli's if you're in the mood for a huge plate of Italian home cooking. The bread and salads that come with the entrees are pretty good, and always come out quickly. I always get the Eggplant Rollitinis, which is considered a special, but always offered when I visit. The portion is so large that my boyfriend and I always split it...yet I always have enough that I have to box it up.   I'm a vegetarian, so I'm kind of bummed that they don't offer more options."}
{"text":"Everything I've eaten here has been 5 stars and I'd recommend! The portions are huge, which is good because you're going to want to eat your leftovers for sure! Waitresses are all very friendly and it's locally owned."}
{"text":"What a great family place. Food was very good and it didn't cost that much. You receive a ton of food so you have plenty for lunch the next day or a late night snack. I can't wait to go back. I also loved all the different choices in regards to pasta. The service was also pretty good. They offer wheat pasta and also gluten free."}
{"text":"At first entering the aroma of sauce hits ya, smelled wonderful, & I thought what a very small space & was filled & no extra seating, but to my surprise was seated on the other side which was comfy, the downside only 2 servers & they were busy did wait about 10 minutes which was fine, ordered personal size Pepperoni Pizza & Chicken Parm with rigatoni, last time I had Zappiteli's was well over 10 years ago when a co-worker would bring in a ghoul sheet pan of lasagna or Pizzas, boy I tell ya it still tastes the same, quality & quantity is served here the pasta was cooked perfectly, chicken parm was huge as soon as it was coming my mouth watered, first was the pizza had 2 slices, shared it with my brother he loved it being his first time having it, when he tasted his Chicken Parm he was amazed on the quality/quantity of the food never had anything like this, my dessert was creme filled puff pastry it was huge & was to die for.     Our experience today was great, servers were very attentive to each customer not even if it was hers, I saw her refill the other servers customer that showed me how well they both worked together, the customer tipped them both which to me was very generous, I will return soon with my family & enjoy our meal, I highly recommend Zappiteli's..."}
{"text":"Food was delicious.  We all had huge portions.  Definitely enough for lunch and probably dinner tomorrow.  We dont eat red sauce at restaurants because its usually terrible compared to homemade but theirs is good. Very fair prices and excellent food. Nothing to complain about at all."}
{"text":"What an incredible traditional Italian place! Huge servings, incredible flavor, and great family service!"}
{"text":"We were back in town to visit so this was a must. I had cavatelli with meatballs (comes with a big salad and bread). This meal was served in a serving bowl. Like what I would put on the table for my family... I got 3+ meals out of it!  I like everything here. It has the bones of classically good Italian: perfectly cooked pasta, decent sauce, great meatball texture, good bread and olive oil on the table."}
{"text":"One of our favorites for Eastside Italian.  I promise you'll be shocked at the portion sizes! I particularly love their gnochi. They also have daily specials that sellout quickly.  A smallish neighborhood establishment in a strip shopping center with good food.  The ONLY reason I didn't do five stars is because I don't consider many to be that perfect!"}
{"text":"Let me start off with: the food is great!  As for the overall service, scores a C at best.    We came here on 5/14/14 for dinner after my daughter's school recital.  Even with 2 empty tables, we had to wait over 20 minutes for a table.  Literally, 2 tables, empty.  Now, we came on a Wednesday.  Not a Friday.  Not a Saturday.  They must have been short staffed.  The food took about 40 minutes to come out.    The waitress was wonderful.  Not her fault at all.  But, due to a mess up in the kitchen, I got my food, and my 9 year old was left waiting for another 20 minutes while they re-made hers.  I was done and had my food boxed up before she got hers.  By the time we got out of there, 2 hours had gone by."}
{"text":"Have To Say This Place Is Awesome....great food...one of the best places in mentor to eat"}
{"text":"Stopped here for lunch with my girlfriend on a Sunday afternoon. This was our first visit and I can say for certain we will be back. We got the antipasti salad for two with the house Italian vinaigrette and it was very good and there was more than enough. We ordered a small white pizza and chicken Parmesan to share. The pasta is homemade and delicious. There was enough leftover for another meal."}
{"text":"Amazing food! Amazing portions for the price. HOMEMADE NOODLES and I am picky when it comes to Italian food!"}
{"text":"Yum, my joint in mentor if I am in hiding I am probably here laying low, the meatball pizza is good and they get it!! They focus on the bread!! The way it is supposed to be done."}
{"text":"Great food great portioning , how could you go wrong . I love it. We eat here sometime once of twice a week . Chicken park is great and enough for two people , salads are always a great size and the dressings are always good . I really like this place you'd be wise to check it out"}
{"text":"Growing up in an Italian household I have a high standard when it comes to scratch made, red sauce Italian comfort food. Zappitelli's is some of the best I've had outside of my Mom or Grandma's house! I had the gnocchi with meatballs. The gnocchi were light and not gummy like I've experienced at other establishments. My Dad had the stuffed hot peppers parm which he said were excellent and a very unique menu item. The other three at the table all went with the chicken parm which was tender and flavorful.  All entrees came with delicious homemade rolls, salad and a large side of house made pasta.  WARNING: Bring your appetite as the portions are extremely generous!  Overall I definitely recommend Zappitelli's to anyone in Northeast Ohio who wants a quality Italian feast at a great price.  We will definitely be back as soon as we can!"}
{"text":"It's been a while since I have been here, actually years.  My fiance and I went here yesterday for pizza.  I do remember them having very good pizza.  We got there right as they opened and ordered a pizza and 2 salads.  Their homemade balsamic vinaigrette  salad dressing is out of this world, and they do have it for sale.  The pizza came out hot and fresh, and smelled soooo good!  The taste was right one, the crust was perfectly cooked, I mean perfectly!!  As I was finished, I overheard 2 older gentleman talking to who I presumed to be the owner about the garbanzo bean soup that is sometimes on the menu, and my interest was peaked.  They did not have it on the menu, so when I inquired with the owner, he was telling me about it.  I sounded so good as well.  Just before checking out, the owner came out with 3 containers of the soup and gave 2 to the older gentleman and 1 to me, I thought that was awesome, it was all he had left and it meant a lot to me that he would do that.  The soup, I  ate later, and it was phenomenal!!  We will definitely be going back more and this is now our pizza place of choice!  It was so fresh and perfectly cooked.  And the cannoli's and pastries are to die for!  Please check it out, you won't be disappointed!"}
