{"text":"We first ate at Zarra's about 5 years ago, and we were immediately impressed by the food. My husband is Italian and his mother is an incredible cook, so we have high standards when it comes to Italian food. I had the Cavatelli con Polo Primavera di Judith and it was fantastic. That dish remains one of my favorites followed by the Linguine di Contosta with the spicy \"palmieri\" tomato sauce. I love red sauce, and can't believe how many different types of red sauce they make here, each more flavorful than the next.  My husband has worked his way through most of the menu, and his favorites include the Polenta Calabrese, Pasta e Fagoli and Cavatelli e Verdure di Rena. There are so many good dishes it's hard to pick a few to recommend! We may have started to go there because of the food but we remain loyal customers because of the people. Each time you dine at the restaurant it is as if you are being welcomed into the home of the Zarra family, and it's a place you don't want to leave anytime soon. Johnny, Judy, Donny and Jamie, as well as their entire staff make you feel welcomed and it's truly the best place to relax after a long work week (or work day!). We grew to love Zarra's so much, we even had our rehearsal dinner there, and our family is still talking about that night. We feel like Zarra's is one of the best kept secrets in the city, and want everyone to know what a phenomenal restaurant they are missing!"}
{"text":"My wife & I had a great dining experience. I had the sampler plate & my wife had the manicotti, both dishes were excellent. If I'm ever in the area again I will be sure to stop. Great staff as well."}
{"text":"Two years ago I visited this area and went to Zarra's.  We LOVED it.  I found the atmosphere both unique and eclectic while at the same time homey.  Donny (our server) was terrific.  The food (sorry Donny) was even better (albeit too plentiful).   I was sad to have left town only eating at Zarra's once.  

Two years later, and with high expectations, I (with 4 others) were at Zarra's again.   In a word, FANTASTIC.   

This place is great.  The food is terrific, the people who serve you are like family, and there is nothing not to like about this place.  Love it!"}
{"text":"Came in late and just had some app's - The stuffed banana peppers were awesome as well as the calamari antipasto.
Super nice people and a crazy eclectic atmosphere - you gotta check them out!"}
{"text":"My friend and I stopped at Zarra's on a whitewater paddling trip a couple of weeks ago. Please be warned... this is not your neighborhood (american) Italian restaurant. If they did have any pizza or calzones I must have missed it because I was distracted by the extensive menu of authentic italian dishes. The hardest part of my experience was choosing what to eat. This is one of those places where you're not going to be choosing something you think you'll like, you're going to be deciding between dishes you know you'll love. The decision is made easier by Zarra's excellent family of staff. 

We sat outside near the outdoor fireplace fueled by a real wood fire. The scene, smell of the kitchen mixed with the wood fire, and excellent company set the stage for a perfect evening. 

I enjoyed a regional craft brew that was delicious, an appetizer sampler, and a seafood entree with a spicy red sauce over a seafood medley with pasta. The shrimp and scallop were huge and perfectly cooked. The scallop was especially savory. 

We stayed for a couple hours eating, drinking, and taking in the city through this small neighborhood gem. When you do go inside take a look at the pictures on the walls and notice they are all family of the owners. If you're lucky John will tell you the history of the establishment, how he met his wife there, and came to own it so many years ago. When you go to Zarra's you'll feel like part of their italian family for sure. We liked it so much we went back for dinner the next night while we were still in town. After all, how can you say no to an authentic italian family dinner?"}
{"text":"I went here for my birthday with the SO. We sat in the patio area, which is really nice. There's cute lighting out there and a big iron stove that wasn't lit while were there, but looks awesome sitting in the corner. The inside of the restaurant is also something to see. Unfortunately, it's not a good enough reason to come check this place out and I can't offer you another.

For starters, we asked our server about one of the wines and her answer was simply that she didn't know. There was no offer to ask someone else nor any effort to find the answer, just she didn't know. Not a big deal, we decided to just risk it on the wine, but not the best way to start dinner. 

We ordered the Manicotti di Antoinette and the Melenzane Romano. They both came with dinner salads and bread. The lettuce in the salad was all romaine and it was crunchy and fresh. Everything else in the salad came from a can, maybe a jar, I don't know, but the freshness ended with the lettuce. The salad was topped with chickpeas, beets, olives, and a couple slivers of roasted pepper. The dressing was homemade, but nothing special, a very basic vinaigrette. The bread was so utterly disappointing I'm not sure where to start. The bread was served in a basket wrapped with a towel, but it wasn't warm. It was dry and bland. It wasn't served with butter, which is good because even room temperature butter would have ripped right through this stuff. 

Service was already completely lacking at this point. We waited 15 or 20 minutes for our salads, which wasn't so bad, we had wine after all. We didn't see our server much during that time, but we did see her again shortly after we got our salads because she had our entrees. Fine dining at its worst! Timing is important, but nobody at Zarra's seems to care.

The entrees were underwhelming as well. I ordered the Melenzane Romano, which is described as \"Fresh eggplant lightly battered and browned in olive oil, layered with marinara sauce and grated romano cheese; then baked to perfection. Includes sautéed mushrooms and sautéed spinach. $18\". The eggplant was really good and their marinara is great. The mushrooms and spinach on the plate were so, so, sooooooo disappointing. The mushrooms were boring and the spinach was just a blob of tasteless right-from-the-freezer ickiness. The SO ordered the Manicotti di Antoinette \"Another house favorite. Each homemade crepe is individually prepared and filled with Judy's special ricotta filling, then topped with tomato sauce, a sprinkle of grated romano and baked in the oven. Served with your choice of meatball, sausage, or eggplant romano. $18\". Again, great marinara & the eggplant he ordered with it was good stuff. Not bad, but not worth the price, not even close.

Since we still had some wine, and it was my birthday, we decided to stay for dessert. Turns out, we shouldn't have bothered. We ordered the Tirami-Suzy. It's good that they don't actually call it tiramisu since it's made with cream cheese and not mascarpone. And, ordering dessert added about 45 minutes to the whole experience. Their version of tiramisu is heavier than it should be and not good. It's just wrong. That kinda sums up everything about this place, it's just wrong. The service was bad (we ended up getting up and going inside to pay our bill), not much that we were served seemed fresh, and their prices are ridiculous for what they serve and how they serve it. They get two stars because the place is actually pretty cute. Lucky for you, it's not the only cute place in Pittsburgh."}
{"text":"I loved this place! The atmosphere was quirky but in a good way. The staff and service were great and the food was the best part. We live in San Francisco and are constantly seeking good Italian food, and this place definitely fulfilled our expectations when we were home in Pittsburgh for the holidays."}
{"text":"I was a visiting surgeon from Chicago working at UPMC and stumbled accidentally upon this absolute gem one night when I was looking for dinner alone. The food was fabulous. The owner, Donny, could not have been more gracious and generous. The staff, Chelsea, made sure that I felt right at home. The eggplant was spectacular and one of the best I've ever had. I sat at the bar and ate dinner and had a conversation with everyone at the restaurant that made me feel like I was right back at home in Little Italy in Chicago. I'll be in Pittsburgh for another two weeks and I'll try to make it back here at least once each week while I am here."}
{"text":"Quite honestly the worst Italian we have ever eaten. Four of us were here from out of town for a Steelers/Browns game and stayed at the hotel across the street (a Renaissance Inn - pretty nice). The hotel had a sign for the restaurant and the staff recommended it. We checked in late and didn't want to hunt around on a rainy night, so we went for it. Beer was warm, Sangria was horrible, bread was bad grocery store crap, salads were marginal with way too much dressing.  Of the four entrees, on one was more than 50% eaten when we were done. $150 of bad, bad food. When we talked to the owner/manager (we think) and told him what we thought of the meal, he waved his hand and said \"sorry your food sucked\" and then walked away. 

I got a Yelp account for the sole purpose of writing THIS review. 

Horrible."}
{"text":"I hosted a business dinner at Zarras tonight.  The experience from the unique dinner room to the appetizers, soups, dinner,desserts and after dinner drinks was first rate.  We travel a great deal and the combination of the owners personal service to the quality of the food was outstanding.  We all agreed the next time we came to Pittsburgh we would stay at the same hotel so we could walk to dinner at Zarras.  This is a 5 out 5 stars."}
{"text":"There are many people in this world, especially in Pittsburgh, who wouldn't know  \"good atmosphere\" even if it somehow miraculously came up and bit them on their posteriors -- or even if it had been created by the finest Hollywood set-designers.    Zarra's has perhaps the most cozy atmosphere of any restaurant in Pittsburgh.   And you would be hard-pressed to find a more classic Italian Restaurant Atmosphere in any restaurant in New York (with the exception of John's on 12th Street).   When I hear people complaining about Frank Sinatra or dim-lighting or eclectic antiques, as one reviewer here has done, I want to ask them what they consider to be an appropriate atmosphere for an old-fashioned Italian restuarant.     For many Pittsburghers, I'm guessing the answer would be:    Led Zeppelin on the sound system, flourescent lights, great big posters of the Steelers, and lots and lots of cigarette smoke.    Maybe some video games in the front.   Plastic chairs.   

The beauty of Zarra's may in fact be wasted on many people here.   That's okay with me, though, as long as it stays in business -- no long lines outside the door!

Certain dishes are better than others -- the sausage is fantasic, the lasagna, not so much.    But in general, what you get is classic southern Italian cooking -- in an environment that transports you out of the banality of our modern world.   If you don't find the modern world banal, then perhaps Zarra's is not for you."}
{"text":"Perhaps the worst Italian food I've ever had the displeasure to consume. And as importantly, somehow was charged $80 for two pasta entrees, two house wines and a couple of bourbons. Watch your wallet and bring your own Briosci! Yikes!"}
{"text":"This place is weirdly decorated and probably dusty. There were little bugs flying around our table. The food was not very good. We will not go back."}
{"text":"Great sausage   Wonderful spicy rich flavor obviously made with feeling.  That almost made me go to two stars or??? But my family was just so disappointed overall that I'm sticking with one star. 

Ambiance:  kitchy Italian knick knack filled dining room which is a little over the top but fun.  No problems

Service was terribly.  So slow. We arrived before 9 and it was 9:50 before anyone took our order and then only because we flagged down someone. Our waiter was nowhere to be seen in this half filled not busy restaurant.  

Meal comes with salad.  Could be yummy but we can't say since ours never came. 

Entrees included that yummy sausage but also cold dense ricotta noodles   Other yelps raved over this dish so huh??? Maybe the chef was asleep or we were getting the final dregs of the day.  Unclear. 

Got the bill.  They charged us for blue cheese on the salads we never got.  Huh again?   Didn't correct the bill but offered us free tiaramusu which also NEVER came. Huh. 

We called and complained and the owner seemed nice and apologetic but stilll....

One star."}
{"text":"Fantastic! Delicious food, a charming atmosphere, and great service. The only reason I didn't award five stars is because the price was a little high."}
{"text":"Wonderful food and taste of old world romance from the music to the lighting.  The decor is eclectic Italian which, combined with the music and cozy fireplaces transport you to another world. The food is pure Italian from recipes brought over from Italy.  A hidden gem!!! Had a wonderful evening with my Italian husband who gave it an A plus.  The restaurant is run by the owners and you can feel the personalized, caring family attention. We'll be back!

For an appetizer we have the melanzane and for  the main course we had the sampler. Both were so superb!

Thank you Donny!"}
{"text":"We had an amazing dinner! Our server Gary was very nice and attentive. Dave Zarra carried on a conversation with my 9 year old for probably 10 minutes and followed it up with ice cream and after dinner drinks for us parents :-) The manicotti was absolutely delicious, my husband loved his rack of lamb, and our little guy really enjoyed the ricotta noodles. Stop by and enjoy great food and even better service!"}
{"text":"Ugh. I was fooled by the other reviews here and stopped by Zarra's tonight.

Definitely like grandma's cellar in the worst way imaginable. Collectibles all over the place from mail order catalogs (read: singing trout on the wall for chrissake) and signs on the wall to hire Zarra's for your bar mitzvah.

The food was mediocre at best and way overpriced (I got the alfredo: kind of like a jar sauce plus some herbs tossed in, my boyfriend got some seafood pasta with rubbery mussels). 

Avoid avoid avoid unless you're with a group of senior citizens who can't handle intense flavors or music other than g.d. Sinatra! Aaagh!"}
{"text":"Food is delicious (we tried various pasta dishes and all were excellent and their basic side salad has beets and great combination of lettuce and veggies) and the family running this place are all really friendly and nice.  They are sincerely interested in getting their customers to come back."}
{"text":"Best tiramisu I've ever had, hands down! A little pricer than I expected but very worth the price. Husband loved the rack of lamb!! If you're staying nearby, you should try it!"}
{"text":"Excellent Italian food- just like grandma used to make. The sausage and meatballs are home made and delicious!!! Judy's noodles are to die for!! The decor is eclectic and fun!! Take the whole family!!!!!"}
{"text":"food was disgusting.....service was horrible....decoration was plain ugly"}
{"text":"Great homemade food. Family owned and operated, which creates a homey and welcoming dining experience. The selection of unique beers is also excellent."}
{"text":"Very very good food and extremely friendly! Many choices to select so we will be back."}
{"text":"If you just want the skinny- Delish!!!! Authentic! Genuine! A wee bit overpriced with the add ons. DO NOT let that deter you. Read on for enjoyment purposes only.

Okay- I never write posts, but I feel obligated to do so here. Let me preface by saying I am a FOODIE, I work in the restaurant industry, I live to find great places to eat, and I travel...A LOT.
So today I had to drive up to Pittsburgh for work and ended up landing at the Residence Inn in Oakland, PA, because:
 A. I waited to long to book at the Hampton, and B. Love the Marriot Rewards points.

Needles to say, I arrived late, tired, and a wee bit dissapointed at my lodging accomodations (the staff makes up for it in friendliness and hospitality).

 None the less it is time for dinner, and of course the Front Desk is pitching this allegedly \"AMAZING\" italian restaurant (they even had a sign in the lobby)- by the way just accross the street and the ONLY restaurant on the street (and it's not the prettiest of streets mind you). Any of those reading this that travel shares my first thought of \"Danger Danger... Do not eat there!\". 

But, all they had downstairs were stoffers mac n' cheese, and some chicken chinese stir fry, so I decided to spend some time not catching up on email and take a look at the Zarra's menu online. Once I started reading, the interest of the 2nd generation Italian in me was peaked. 

So I gave in and gave them a call. Maybe I got lucky... I don't know, but I got the nicest coolest guy on the other end of the line. It goes like this...
\"Zarras , Good Evening?\"
\"Hi, what time do you close?\"
\"Ahh...we're open and seating, what time do you want to eat?\"
\"\"Oh I just got in and am staying at the hotel across the street and was checking.\"
\"Oh yeah, come on over, we'll gett you seated\"
\"Can I order something to be delivered to?\"
\"Sure thing we can do that\"
\"Ok great, I'll call you right back\"

I was so stoked by the non a-hole response that I normally get, where a restaurant sums me up as the 8:45 pm wishy washy annoying last minute order of the evening, that I called back 5 minutes later to order something (even though I realized at that point I wasn't hungry).

I will paraphrase this conversation for those that I have lost, am about to lose, or who are just plain annoyed by my endless diatribe (I can't help it! I dig this place!). A lady answered and asked for my order. I asked her what is good and she knew the menu and started rattling things off.

We landed on the ricotta pasta with meatballs AND sausage (I'm italian- if they say they make both from scratch- GAME ON), with a side salad w/homemade balsamic.She told me about all of the desserts they make from scratch and extra tidbits of yumminess, but for once I stuck to my guns.Ironically- this was this biggest mistake of my life. I should have ordered one of everything, charged it to my company account, called in sick the next day, and just nurtured an Italian Indulgence/hangover.

I decided to walk accross the street and pick up the food. It is a small place in between what I can only describe as row houses (hey, I'm from San Diego and live in DC- give me a break). You walk into this dimly lit but nice and clean front sitting area with a bar. They were folding napkins and closing for the night. I won't go in to detail except to say- Cool, Genuine and Quarky characters. 

I wanted to sit at the bar and start chatting with everyone working there. A guy in his 30's offered to seat me right away, and then the lady who took my order came over to help me. Everyone was of course Italian and REAL! But the best- an older Gentleman dressed better than any man I've ever dated (owner?) that told me before the restaurant this place was the Electric Banana (I have not researched that yet- assuming an 80's accident in naming vs what I'm thinking). What I got from him, was that he has been the owner since the getgo. I could literally write another 5 pages about just how fun and unique the people are that run this place.

I left with my food in tow wishing I could hang out and drink with those guys. Came back to my room and started working, forgetting about my meal. SHAME ON ME! Then it hit me and I started unwrapping the 3-time foil-wrapped container (I'm already in love, because red sauce gets everywhere in the bag!). 

One sniff and one bite- this is like my grandma's, like mine (because my grandma taught me). Meatballs perfect. Ricotta pasta- not what I expected, but in a good way. It's like a gnocchi, but cut like pasta, but different. I dunno- it's good! Dressing delish, like visiting Long Island family. Sausage, chunky with whole fennel seeds...ding ding ding!

I only wish I had tried more there. I ordered the ricotta pasta because many of the other items were a bit steep- my only complaint. But with the quality tasted thus far, I can imagine it is well worth it!

Note to self- should I stay at the Residence Inn from now on, just so I can eat here? TO BE CONTINUED..."}
{"text":"Hole in the wall across from our hotel. Superb food and the most quaint Italian atmosphere. There's both inside & outside seating, but I recommend sitting inside to get the whole feel of Southern Italy! Between my family, we had the manicotti with sausage, lasagna with meatball, seafood linguini, tiramisu dessert & chianti wine. All amazingly delicious homemade dishes. The bread & salad were fresh & the wait staff was friendly. True Italian run joint- highly recommend it if you're in the area!"}
{"text":"HIGHLY RECOMMENDED!! We were looking for a place to eat that was still open late at night, near our hotel, Residence Inn (off of Bigelow). Looked online and several sites suggested Zarra's. Called the restaurant, they just closed for the evening, but they asked how many were in our party, and if we could get there quickly, they would stay open for us. We arrived a few minutes later, and had the whole restaurant to ourselves. They seated us at a table they usually deserve for family. My 4 month granddaughter was a little fussy (traveled by plane from the west coast, to NYC, then long car ride). The chef already left for the evening, so mama (owner of the restaurant) did the cooking. Her son Donnie, and a waiter (sorry! Forgot his name.) seated us, waited on us, and served us. They made us feel like family. They even held Malia (whose fussiness finally subsided). The dinner, dessert, wine, and after dinner drink was absolutely DELICIOUS!! Salad was yummy with anchovies. Rack of lamb was succulent, filet mignon tender, perfectly cooked, and juicy. Manicotti to die for, accompanied by a suggested Italian red wine. Dessert ~ heavenly! My husband and son-in-law loved every bite of their cannoli. My daughter and I agreed that the tiramisu was the best we EVER had. Layered, light, and absolutely tasty at every bite. Not too sweet, not too rich. Zarra's family-owned restaurant was among the highlights of our first trip to Pittsburg, PA to attend our nephew's wedding. Can't say enough of this place!! Great food, service, & family-style ambience!!

~ Warmest regards, 
The Reidy & the Halsey families
Vancouver, Washington"}
{"text":"We were staying at the Residence Inn across the street from the restaurant (for the University of Pittsburgh move in) and tried Zarra's.  Our waitress had worked there for only 4 days but was excellent!  We had the stuffed peppers for appetizer, tilapia, and ricotta noodles with eggplant.  All very good!  The dinner salad and Italian bread were excellent too!  The interior is unquestionably unique and eclectic.   

(The front of the restaurant changed over time from being a Go Go bar, disco place, pop and a punk rock bar.  It drew many artists that later became very famous)."}
{"text":"This place is a unique Pittsburgh gem. My now-husband took me here for our first date (surprising me with a rare PGH restaurant I hadn't been to). The fun decor, home-y atmosphere, and delicious food made it a perfect place. He then surprised me by taking me there the night we got engaged --so of COURSE, we had to have our rehearsal dinner there! SO sweet, accommodating, fun. Can't recommend this place enough. It is unique --if you're looking for a stuffy \"foodie\" establishment, don't come here. If you want delicious food and authentic, family-owned business --support this Pittsburgh treasure!"}
{"text":"I ended up here after I had to cancel reservations at Asiago's due to a baseball game and I could not find parking in the North Shore. I'm happy my gf found this place. Food was awesome and so was staff. I will definitely come back! Waiter bought me a slice of cheese cake for my birthday! Homemade and was delicious!"}
{"text":"This is a wonderful hidden gem! The service was great, and the food delicious. We had multiple appetizers, and meal choices, and everyone cleared their plates! Highly recommend!!"}
{"text":"Zarra's is amazing.  All the food is homemade and very good.  This family owned restaurant is a fabulous find and I strongly suggest anyone who likes outstanding Italian food to try it. 
The decor remindes me of an estate sale that serves wonderful food. The menu changes for the weekend so come during the week for a larger choice."}
{"text":"Our hotel recommended this place (\"...like having dinner at your Grandma's house.\").  
I certainly felt like I had Italian grandparents for an evening!
The food was very comforting, especially for a snowy March day.  They were out of the house Merlot, so we got a bottle of the Montepulciano to go with the Linguine di Contosta and Zarra Sampler.  We cleaned our plates, but still shared the cheesecake for dessert (which was not too sweet or rich) and were treated to a special after dinner drink.  
The owners checked on us regularly and were very convivial, a great dinner for our last night in Pittsburgh."}
{"text":"Astonishingly tacky, bland, and overpriced. Normally I'm down for a good kitschy restaurant but $25 a plate for food I could've made better at home is criminal. We ordered some cocktails from the bar first and the bartender/server proceeded to literally scream at the tv about how trump was going to fix the economy. He managed to ruin my Moscow mule by pouring it in a glass and clumsily dumped it into the copper cup afterward. It took them nearly thirty minutes to give us bread that wasn't fresh or even toasted. Apps were atrocious, four measly stuffed mushrooms that were mushy and bland and \"fresh\" calamari that was drowning in balsamic vinegar. House salad was also doused in so much balsamic it was impossible to eat. Food took way too long to come out, I got the linguini: bland and swimming in butter, the (single) scallop wasn't seared and tasted like tofu. My friend got spaghetti and meatballs and it was literally just unseasoned Ragu dumped on a handful of noodles and a single over cooked meatball. Also throughout the night a ten year old Boy Scout was serving us water? A truly baffling experience; this place is a swindle."}
{"text":"Phenomenal food, portions and service. Great ambience.  This is fourth time here and have never been disappointed .  I have tried a new dish each time and always tastefully done. Portions are very large and always end up taking half home. Cherries Jubilee is very tasty and my favorite dessert of three tested."}
{"text":"In a nutshell: eclectic decor, yet intimate. Overpriced. Smells like your grandma's perfume. 

I didn't have a great experience here. I usually don't mind weird decor but some of the stuff they have here are just plain creepy. It's weird to catch a mannequin or doll staring at you in the corner of your eye when you're eating. Just saying. The dining room was cluttered and the smell is overwhelming of talc powder. The smell was so strong, it kind of made me sick. So I was really hoping the food would be amazing. The menu looks impressive because it doesn't look like your average Italian menu and it has a lot of homemade items. I ordered Judy's Homemade Ricotta Noodles and it was good, but certainly not life-changing. The sauce was on the sweet side and although it was good, it could not balance the overwhelming flavor of black pepper from the noodles. The black pepper turned the dish incredibly spicy. I don't know if I can quite call these noodles either. They're more like huge chunks of pasta dough, about 3/4 inch thick pieces cut into 1 in. by 3 in. pieces. All dishes come with a mixed green salad, not your typical iceberg lettuce salad most other Italian restaurants give. The service could also have been better. Our waiter did not smile once and he spoke to us with such a condescending tone, despite us giving him no trouble at all. With food not all that special, steep prices, rude service and creepy decor, I don't think I'll be back."}
{"text":"A terrific Italian meal.  I'm from Philly where we get great Italian food. Never expected \"South Philly\" in Pittsburgh. Nothing better than home cooked Italian! Family restaurant run by family. Waitresses were incredible. Sat and talked to us like we were regulars. Great experience. Recommend it highly."}
{"text":"Yikes!  This place is like if an old creepy vaudevillian uncle invited you to his house for dinner. It was cluttered and not clean. Our table was wedged in the corner and a spooky, green faced witch was three inches from someone's right shoulder!  The cold bread took forever to get to the table, the food was ok, not spectacular. The clams were shriveled, cold, and stuck to the shell. I had to pry mine loose and reconstitute it with the sauce to salvage the meal. A 20% gratuity was automatically added on the bill. I hope the little boy scout filling the water glasses gets a cut."}
{"text":"We were invited to Zarra's because friends had the Groupon and I'm so glad they asked us to join them.  Our evening was fantastic.  Three of us chose the Linguine di Contosta (linguine with mussels, shrimp and scallops) but each prepared in a different sauce - all delicious.  Flavorful and not overpowered with garlic or salt like some places.  My other friend had ricotta and homemade sausage - he liked it so much that he was on his last bite before he thought to ask if I wanted to try it. (I found out why).  The salads are served with a house balsamic dressing and had a lot more than just the basics.  If you come, absolutely save room for the tiramisu!

We had two waitresses who worked in tandem. Pleasant, knowledge about the menu, and attentive throughout our entire evening, they were on top of everything.

The decor is definitely unique. From interesting (old diving helmet) to pretty (paintings) to cool (various swords), there is everything and anything.

I will definitely return and recommend Zarra's to others. I am quite surprised by the negative reviews on yelp."}
{"text":"I asked at my hotel for a nearby restaurant, and was directed to Zarra's, right across the street.  It's a little deceptive--you have to go through a bar in the front to the actual restaurant, where the decor is very nice, and the staff is friendly...and unbelievably incompetent.  I put in my order.  The waiter seemed to have trouble grasping which dish I wanted, so I opened the menu and pointed it out to him.  That was at 8 p.m.  By 8:30, I was wondering what the problem was.  Ten mintues after that, a waiter came over and asked if I'd ordered yet!   So I got a menu and pointed it out again, mentioning that I'd ordered it some time ago.  And ANOTHER twenty minutes passed before my salad, bread and main course arrived virtually simultaneously.  What, they couldn't have brought me the salad a little sooner, seeing as they'd screwed up so badly already?   The food was okay, but nothing special.  But don't come here unless you're planning to spend a LONG time waiting.  (And, no, no one apologized or even said anything about the wait.)"}
{"text":"My boyfriend and I don't usually do Italian food often. Admittedly this is because we've only really enjoyed Lidia's and that place is too expensive for frequent dining. We've been talking about trying Zarra's for awhile and tonight we finally did. 

First - the decor: It is so quirky. We loved it. There are a variety of weapons and... old toys... and stuffed ducks and such a mismash of things in the dining room. We spent part of the meal discussing which of the swords, daggers, crossbow we would bring to a duel with each other. 

Second - the food: It was good. It was really good. I had the alfredo and it was creamy and seasoned and the pasta was al dente. My boyfriend had the ricotta pasta with a meatball and the meatball was giant, the pasta fluffy and unique and delicious. He says the tomato sauce was also delicious. I don't know because I don't like tomatoes, but I believe him. Our meals came with garlic bread and salads and the lettuce was crunchy and fresh. My only criticism of the food is that the salads were maybe a wee bit overdressed, though we liked the balsamic dressing. 

The waitress was friendly and it seemed like a family-run operation. 

We'll go back."}
{"text":"Excellent food and ambiance. Very accommodating to a table of 10! From appetizer to after dinner drink, everything was delicious! Would definitely recommend to others."}
{"text":"One of my favorite Italian restaurants so far! I loved the food and we all left feeling great due to the awesome experience. 

Don't let the pink painted building with bright blue neon lights catch you off guard. The atmosphere is unique with revolvers and swords on the walls. The service is down to earth and very good. But the food...oh the food...I left wondering and hoping the next time I could return was sometime in the very near future..

I had the shrimp dish with mushrooms and spinach. It also came with a bowl of pasta and marinara sauce.  I want going to eat the pasta...but it only took one bite for me to realize how awesome it was. Yum. Others had the Fettuccini Alfredo. It was so creamy and delicious. The bread and olive oil mixture was sooo good! 

I am so looking forward to going back!"}
{"text":"What a great experience. This is a true, family-owned taste of Italy. Mom works the kitchen with Dad behind the bar. Our waiter was their son and his service couldn't have been more attentive. My son had the calamari pasta and my wife had the ricotta noodles. I went with the sampler and the lasagna was the lightest pasta I've ever had. The red sauce was fresh and authentic. We ended the night with fresh house-made desserts. The connoli and creme brulee were excellent but the ricotta cheesecake was unbelievable. It was, by far the best Italian meal we've had. Well done!"}
{"text":"If I can give zero I would.  I'm walking out of this place with my family as we speak.  I bought a 80 dollar Groupon for 40. Good deal right? Wrong. 
I went to this place with 4 people including myself. The Groupon states that you only have to spend 80 worth of food. The \"chef\" came over very aggressive asking to see our Groupon. My dad went to sign in his Groupon as she tried to snatch if phone out of his hand.  I told her to hold on he is loggining in. She told us that we didn't order 4 entrees. I explained that wasn't in the terms in conditions. She told us that we were trying to \"rip her off\". Are you serious. We ordered appetizer and entrees adding up to 80. She literally was being so rude and my dad is a senior citizen.  Will never be going back. 

Anyways bread took over 20 minutes. And appetizers were just ok.  
Suggest if you want Italian. Go to cheesecake or somewhere on the south side."}
{"text":"Decent food, but at unfortunate fine dining prices. As a mom n pop Italian family restaurant, this would be great, but the pricing is way out of scale with the actual food. Prepare to be underwhelmed."}
{"text":"Unexpected find with a lot of family charm (tons of nicknacks in main dining room) but high prices. Dinner includes salad and bread with make your own olive oil dip and Parmesan but ranges around 20-30$ which is high for what they offer. Alcohol is pricey for ambiance but very friendly staff. We had come because they gave my friend a free plate last time she came in for coffee!
Veggie perspective- 1-2 veggie options. I had the ricotta noodles with eggplant mezzanine which was good not great. Salad was excellent.I loved the tiramisu which was very rich. Ricotta cake I wouldn't order again. 
Probably will not return due to pricing and ambiance style."}
{"text":"Now let me give Zarra's back some of its dignity.  I've been here twice, both on special anniversaries with my boyfriend. I must admit the first time was much better and would've gotten it 4 maybe even 5 stars because our meal, especially the lobster ravioli was delicious and they gave us a complimentary dessert liquor at the end of dinner.  The second time we went the food was mediocre and, yes, it was overpriced.  BUT the atmosphere in this restaurant is what allows it to keep its dignity and maintain that 3 star rating.  There are several antique knick knacks around the seating area and that will help to spur up conversation no matter who you're with. The music is nice, Sinatra style tunes.  And it's cozy, the staff is very nice and due to its unlikely location on Bigelow it feels like you're dining in one of Pittsburgh's secret treasures.  I say, give it a try and create your own experience out of it.  You may find it completely worth it.  I know because the first time was such a delightful experience, that even after the second mediocre meal, I would give it a third try.  I love the restaurant's antique eccentric atmosphere."}
{"text":"Was in town visiting CMU and one of the professors we met with recommended this place. When we entered the décor was a little overwhelming at first, but after a while we enjoyed pointing out new and interesting things hidden throughout the restaurant. Overall the dining area is large yet cozy.

There were six of us but no one was starving so we got two orders of the stuffed banana peppers and three orders of the Zarra's sampler to share. The samplers were entrées so each one came with a salad which we also shared, and the table had fresh bread with olive oil, garlic, cheese, and red pepper flakes for everyone. Everything was delicious. The eggplant and sautéed spinach were my favorite. The lasagna had so much cheese, it was amazing. We walked out of there with full bellies and had basically licked the plates clean.

Our waitress was very attentive and helpful. At one point the owner or owners son (not sure which), stopped by the table to say hi and make sure we were enjoying ourselves. Overall, it was a very good experience."}
{"text":"If you are looking for an Italian place that resembles a small family run restaurant this place has all the looks of it from the unique decor and pink building. However, the family itself leave a lot to be desired. The mother is the main cook and I will say she usually does a fairly good job. The son Donnie is a complete waste of space for this restaurant. He claims to be a waiter, but it's hard to be a waiter when you are sitting at the bar or watching tv or on his phone outside. 

I can't even get started on the father. He is clearly the owner and mastermind and financial guy for this restaurant. Unfortunately, if you googled the definition of obnoxious, ignorant Italian man it wouldn't even come close to explaining the efforts this man goes through to be and sound like an ass. He routinely screams/tells (talks?) at his staff and even customers. Sorry Zarra's but you'd be better off without him. He literally does nothing for the restaurant except hang out and yell at people.

The only thing this family has going for them is the rest of the staff who haven't quit yet. I'm only giving them 1 star because giving 0 wasn't an option. 

I mean...who washes silverware in Windex? Gross! Ammonia on my utensils? No thanks! I'll never go back"}
{"text":"Zarra's is on the short list of places I hit every time I visit Pittsburgh.  It's the closest thing you'll find to eating at your Italian grandmother's house.  The decor is a hodgepodge of antiques and odd artifacts that make it very homey.  The staff always includes Zarra's family members and they always remember you.

The food is fantastic.  The sausage and meatballs are made in house by Johnny, the recipes are from Judy's family and some of the dishes, like the ricotta noodles, you won't find anywhere else.  I get mean cravings for the sausage and peppers over pasta.  Your entrees will come with giant garlic bread and a salad with homemade dressing.  Unless you stop eating halfway through your meal, you'll never fit dessert, but, if you do, the sweet creations are also all made in house.  I recommend the homemade cheesecake, it's light and fluffy.  One year Judy made me a homemade cake for my birthday and it was the best cake I've ever had in my life.

Sometimes the meal takes a bit longer than you may expect but that's usually because the staff is chatting at your table but I'd rather have an overly friendly staff any day.  It's not uncommon for the owner to pull up a chair and shoot the breeze."}
{"text":"This is by far the best authentic Italian Restaurants in Pittsburgh. Their southern Italian flare accompanied by their made fresh daily pastas and entrees will leave you hungry for more. They import Italian wines that agree with everyone's pallet and the desert is to die for! If you haven't tried it, the missing out!"}
{"text":"Loved the decor, but the food and the service did not measure up. The salad was delicious! But the entrees were ok at best. Our waiter looked angry all the time. I would not return."}
{"text":"hands-down the best, most authentic italian food in pittsburgh!!!    

the sausage -- spicy & just plain awesome -- is made in-house.  the ricotta noodles are unlike anything else in the city and are also homemade.  and, the rack of lamb is out of this world!  i've truly never had a bad meal here.  good wine selection & delicious after-dinner drinks!

the owners are amazing and go out of their way to make everyone feel welcome, which is helped by the homey decor.

also - in the summer, this place has one of the best patios in the city!!!"}
{"text":"I came here with my parents this past Fri. evening at around 6pm.  I live a few blocks away and Zarra's was one of the closest places I had bookmarked.  Given that my mom is a picky eater and enjoys casual Italian eateries, and that my parents were staying in Oakland (not at the hotel across the street, FWIW), I figured it was as good of a reason as any to check it out. Zarra's is most definitely an old school red sauce joint, so it fits the bill for Pittsburgh Italian comfort food--don't come here if you're expecting trendy, cutting-edge fare.

For our entrees, my mom had the meatless lasagna ($16), my dad has the Zarra's sampler ($22), and I had the ricotta noodles ($18).  All of the entrees came with side salads, as well as a shared bread plate.  The bread was insubstantial and mediocre, and came with an oil dipping sauce, which is a good thing, since it wouldn't have held up to butter.  The salads were along the same lines, consisting of spinach dressed with a vinaigrette sauce and a few vegetables that most likely came out of a can.  You can get blue cheese on your salad, which my mom and I did, or anchovies, as my dad did, but just be aware that these additions come at an upcharge.

Fortunately, the entrees were better.  The manicotti had an interesting pointy shape and light texture that was different than any I've eaten before.  Flavorwise, they weren't too exciting, which was also true for the red sauce.  Each entree came with a side of sausage, meatball, or eggplant, so I chose the latter for mine since I'm inherently leery of ground meat.  The eggplant added some variety to the dish, but I found it a bit on the mushy side.  My mom and dad enjoyed their entrees--my mom is picky about the composition of lasagna, so I was happy to see that she ate it without picking it apart.  I tried a bite of it, and it was pretty similar to the lasagna she makes at home, which is probably why.  I didn't try any of the other items, so I can't directly comment on them except to say that the meatballs are huge (about 3\" in diameter and twice the size of meatballs I've had at the meatball joint downtown).  I wanted to try the baked Alaska since I'd never had one, but my parents were too full to share it with me, and I didn't want to get stuck eating the whole thing, so we ended up passing on it.

Overall, we were generally satisfied with our meal at Zarra's, despite the lackluster start to the meal.  The fare was exactly what I expected, satisfying my mom's pickiness and filling us all up after a long day of travel or work.  The service was excellent, as was proper given that we were about the only ones in the restaurant other than a few people sitting on the porch by the time we left.  As others have mentioned, the decor--right down to the toilet seat in the women's restroom--is interesting and eclectic, and makes for good conversation.  While I probably wouldn't go out of my way to return, I wouldn't be opposed to coming back sometime--perhaps to try the baked Alaska--given its convenience to my apt.  3.5 stars."}
{"text":"This was a great place for dinner. Food was great. They have portions that are gigantic.  Could not eat it all.  Family atmosphere but had a great adult dinner experience.  If you need snooty, go somewhere else. If you want relaxing and treated like family , you're in the right place."}
{"text":"Really cool place! The food was great, and I was very impressed by the genuine hospitality of the waitress and the owners. Great food, great people!"}
{"text":"Went here tonight with a groupon. I personally found the atmosphere interesting and cheerful (there are several decorations all around including some swords/paintings). I particularly liked the fireplaces. The entrees included a salad and bread which was nice. I got the pollo Romano as my entree and thought it was very good with a good sized portion. Service was also very attentive. Plan to go back!"}
{"text":"Meh. We enjoyed the food but nothing super extraordinary. Problem was the bill just didn't justify the experience and the wait staff, although pleasant, was slow and inattentive."}
{"text":"Food: we tried the ricotta noodles and we were disappointed. It tasted like bland uncooked dough. We appreciated that our entrees came with shared bread and a salad on the side. However, it was a cheap/cold baguette, like you get from Walmart, while we were expecting it would be made from scratch in the kitchen. The salad had too much seasoning and was made with vegetables that were most likely coming from a can.

Atmosphere: we sat by the gas fireplace which was pleasant. However, we found the decoration ugly and messy. Guns, swords, skulls and pirates on the wall were clashing with the rest of the decoration.

Service: Worst service ever. The waiter was pushy and kept watching us. When it was time to sign the check, the waiter was standing next to us telling us how much we should give him as tip (seriously?) He checked what we put as soon as we stood up.

Avoid yourself the trouble, try another restaurant. Also check the pictures I posted with the menu for Friday night. Quite overpriced IMHO, with the cheapest entree starting at $21."}
{"text":"This place is the quintessential Mama's Kitchen. Everything is amazing, and try the cheesecake. It is the lightest and fluffiest dreamy cheesecake I have ever eaten."}
{"text":"Great ambiance, great food and amazing service. Donny was serving us, he is super nice and friendly. I will recommend everyone to try going there at least once and also talk to Donny."}
{"text":"The fact they say they make Italian food is embarrassing. The Olive Garden is better. My mothers fiancée couldn't even finish his meal. The setting is nice and looks beautiful inside. But this place isn't Italian."}
{"text":"A great place to go with family and friends, have Italian food and drink lots of wine. An unassuming place from the outside on a quiet street in pittsburgh, Zarra's is warm and cozy inside. Do pay attention to the many random objects on the wall, but do not let it distract you from sitting down and enjoying the wine and the company of family and friends.  I had the sample plate and it was perfect. A nice sampling of several southern Italian favorites. The wine kep coming, so we kept on eating and drinking.

For desert, try the cannolie and a nice espresso.

Next time that I am on Pittsburg, I am going."}
{"text":"What a wonderful surprise to find such an eclectic family-friendly restaurant in Oakland. I felt like I was in an Italian grandmother's dining room! The food is amazing; get the house soup: it's basically a matzo ball made out of ricotta. We came for my daughters birthday and when I made the reservation they offered to bake her a bday cake. All the food is AMAZING! Staff is nice and friendly. Sit on the balcony of weather is nice."}
{"text":"The first time I ever ate here was about 2 years ago. I sat at the bar and had an amazing time talking to Donny. Then the food came and I fell in love. Everything is made from scratch with love, and you can really tell!!!!! I raved to everyone who would listen to me about this place. It's a warm, welcoming environment and I 100% recommend you all come here!"}
{"text":"Get Johnny's Famous Filet Mignon.

You won't regret it.  It is $37 and it is so huge it takes up 1/3 of the plate.  It was over an inch thick, could have fed a small family of four and I ate it alone.

Donnie took care of me and my mother very well! This was one of my most memorable birthdays dinners ever!"}
{"text":"Really satisfying, classic Italian food. I am not of Italian descent, so I can't speak from any experience of \"authentic\" home-style Italian food, but the food I had at Zarra's was close to what I would imagine simple, tasty home-style Italian to be.  The salads that came with the entrees were tasty, and were definitely a little step up from the usual sad house iceberg salad I'd expect to be included with a meal. The bread and dipping oil that came before the meal were delicious. I was in the mood for something simple and home-y, so I ordered the the Ricotta Noodles with sausage, while my boyfriend had the lasagna with sausage. Neither dish was mind-blowing, but they were tasty, satisfying, and comforting.

This is not super fancy gourmet food, which is fine, since I don't want (/can't afford...) that all the time, but Zarra's is very good for what it is. A word of caution- be aware of the prices before you go! Zarra's is definitely at the upper end of that \"$$\" range for Yelp... Our meal of just two pasta dishes (seriously: no appetizers, only waters to drink, nothing with seafood, etc...) came out to about $30 per person after including tip, which was a little more than we were expecting to pay for a casual, mid-week \"it's-late-and-we-don't-feel-like-cooking\" dinner out. This is definitely my fault for not looking more closely at the menu pictures on Yelp (the menu on the website does not have prices). I will definitely return, but next time I'll be mentally prepared to get some wine and appetizers to make it a true date night!"}
{"text":"Had dinner there last night and was terribly disappointed.  The wine that was recommended was terrible and we had to ask for water twice.   The waiter was the owner's son and the owner and his wife were at the table beside us.    Appetizer took 45 minutes (Bruschetta) and seemed to have canned mushrooms on it.   You could taste the brine.    Finally asked for bread and a salad from a passing waitress who ended up being the one to bring it to us.   Our waiter had disappeared.   He reappeared 30 minutes later to bring our entrees.    My date had something with chicken and pasta with marinara and I had the scallops and marinara.   The sauce was terrible and seemed more like a paste than a traditional marinara.   Not fresh at all.   The scallops were chewy and had no flavor.   2.5 hours and $120 later and I will NEVER return.   Absolutely awful.  Oh yeah, the salad consisted of nothing but lettuce and one beet and the dressing was terrible."}
{"text":"The place was weirdly decorated, food was just ok, family trying to make it.  Might be back.  Alcohol was slightly expensive."}
{"text":"I honestly can't get over how much I loved the salad here. It was some of the best vinaigrette dressing I have ever had, period. Also the bread and olive oil was especially tasty. Stuffed banana peppers were something unique as an appetizer. Not earth shattering, but solid nontheless. The ricotta noodles were good. The ravioli was actually very good. The sausage was better than the meatball, but both were definitely above average. The ambiance was quirky and weird. Service was friendly enough, but definitely slow. Prices were good (at least for someone from Miami). I would definitely recommend giving this place a shot."}
{"text":"Amazing food and top notch service!  Zarra\"s is truly a Pittsburgh gem.  Get to it and enjoy their meatballs, but remember to leave room for the homemade tiramsu.   Deeeeelish!"}
{"text":"After walking by this place probably a hundred times I finally took a chance and went in. The place is decorated with the most interesting collection of knick knacks and artwork. The restaurant is truly a family run business and everything from their ravioli to their sausage is homemade. I've been here enough times to have tried half the menu and I've yet to find something I don't like. My favorite is the ricotta noodles. If you go give the canollis a try, best I've ever had!"}
{"text":"Food wasn't good; most tasted microwaved. Decor was off putting as well. I was really surprised given the other reviews on yelp, but then noticed all the 5 star reviewers had only one review.. of this restaurant."}
{"text":"Nothing cookie cutter about this place
 Unique food and decor.  A limited menu but everything tastes like your alternate-reality Italian grandmother made it with love just for you. Try the ricotta cake.  And the homemade sausage."}
{"text":"Really good, hearty Italian fare.  Perfect if you are staying in Oakland.  Wine list was extensive, but pretty overpriced, really.  The bread was old style, crispy, garlicky, etc... The salad was wonderful - had beets, garbanzo beans, and a heavenly, light, balsamic vinegarette.  I added the crumbled bleu cheese to mine.  Yum.  
My mom got the linguini with shrimp and scallops.  The scallops were perfectly cooked.  The pasta was done aldente (perfect), but the sauce needed a little extra salt.  (Maybe they cater some to the retirement community across the street?).  I had the ravioli sampler plate - home made pasta on the raviolis - OMG, good.  Could've used a little more salt as well, but the parmesean cheese at the table made up for it.  Meatball, large and tasty.  Sausage was the bomb.  The sauteed spinach (which I was really looking forward to ) lacked flavor.  Parmesean cheese added to this as well.  My dad had the lasagna sampler and was very happy with it.
Overall, 4 stars for a solid meal.  I'd rather have things undersalted than over, and let me make corrections.
The staff was attentive, and the decor was awesome!!!!
A definite must return spot!"}
{"text":"If I could add half a star I would! If you like Italian grandmas, their cooking, and their living room decor, then this is the place for you. Family owned - mamma is in the upstairs and Jr. waits tables - all food seems hand made, which means the pasta is fresh and the red sauce is yummy. The best thing on the menu is the eggplant in all forms. Meatballs and sausage are second rate, though. Grisly is the word that comes to mind. Stuffed mushrooms too bready. But the greens and beans are good and the dumpling soup is authentic with delish homemade broth and dumpling - ask to make sure it is cooked through to avoid it being sticky in the middle. Excellent chicken parmesan. The bottled beer list is good but pricey, as is the wine. So split an appetizer and a pasta dish and have just one glass of red and all will be well."}
{"text":"This Italian restaurant is located slightly off the beaten path off of University of Pittsburgh's campus. When you walk inside and walk past the bar, the restaurant opens up to one semi-large room with approximately 15-20 tables, with various eclectic items on the walls ranging from swords to photographs. You will be seated easily as there are rarely more than a few groups dining at Zarra's. For this reason, you might expect to be waited on fully and quickly. However, in the four times that I have been to Zarra's this has not been the case. All four times it has been approximately thirty minutes from sit down to order, followed by an hour from order to dinner, with another thirty minutes from the end of dinner to check. Although I am happy to have dinner at a relaxed pace, it seems unnecessarily long at Zarra's given the lack of patrons present.
 Along with the lethargic pace of dinner, the service is performed at a sluggish attitude as well. Servers often disappear for tens of minutes at a time, leaving first time diners to wonder where they have gone. Despite the fact that there are few tables being served at once, there never seems to be a server nearby when assistance is required. 
 As far as the food goes, Zarra's serves classic Italian-style food. The food is a  decent value for the price, with most entrees being prices in the 20-30$ range. The pasta dishes are especially tasty with \"Judy's\" sauce making the dish regardless of which plate you choose. For this reason, the food is what makes this a place that I have come back to multiple times. If you are willing to set aside 2-3 hours for dinner, and don't mind a little quirkiness, Zarra's is worth checking out. Overall, the food is decent and the experience is something you wont likely forget; for better or for worse."}
{"text":"Zarra's is like having dinner at Grandma's house. The dining room is kitschy and filled with tchotchkes.  There's a faint musty smell as well.  Those things didn't effect my rating though. Here's the deal, food is not bad but considerably overpriced. We ordered the ricotta noodles with sausage ($21) and manicotti with meatball ($22).  You get about 5 or 6 ricotta noodles. I could've eaten twice that. Sausage was very good though. As for the manicotti, one manicotti is not really a meal.  The meatball is great, however. The sauce is on the sweet side. Dessert was tiramisu ($9) and one espresso ($4.75). Both were very good. But in my opinion $58 plus tax and tip for two people for average food (and small portions) is too much."}
{"text":"So this was my first time here, staff off with ambiance a+ it's such a quaint intimate setting with really cool decor.. Gives you a home feeling with the table settings! The staff is friendly and awesome ! I ordered to start calamari salad which was fresh and tasty !! Followed by our entrees homemade ravioli meatballs sausage !! It was honestly wonderful and reminded me of home cooking !! For desert we had their tirmasuzy which was good!! I'm baffled by poor reviews it was just a great place!! Def give it a try on your own"}
{"text":"I liked the decor, the soup was good, the food was below average. But the owner was a creep. He kept flirting with me and my friend and even asked for pictures with him. He made us feel uncomfortable and I couldn't wait to leave. I will never eat there again."}
{"text":"this place had the worst food i ever had in my life!!!! they were very rude .. dont ever go here!!!!! super gross!!!"}
{"text":"Great food, great people. I would come back to Pittsburgh just to eat here. 

My friend and I were driving across country and this place came highly recommended from a Pittsburgh local. We arrived close to closing, they seated us, were extremely friendly, and courteous to us. Owned by a family, you can tell this is the sort of honest family owned restaurant that is hardly seen anymore. 

The food was exceptional. The cook is the owners' daughter in law, and the food is among if not the very best Italian food I've ever had. The salad course had an exceptional balsamic dressing, the lasagna was without fault. I am not a guy who usually eats lasagna, but this was out of this world. 

The owner's son was bar-tending and comped us an exceptional dessert drink of his own concoction, which was a surprising blend of what I can only imagine was Kahlua and Bailey's Irish Cream.

Plus, this place had a lot of local history behind it. Originally called the \"Electric Banana Club,\" this place was a hotbed of punk rock activity in the 1980's. Even though it's now a very traditional Italian restaurant, you have to appreciate a place that has that much character and history. 

We only stopped by, but you'd be hard pressed to find Italian food this good, anywhere in the country. Do yourself a favor and stop by."}
{"text":"From the moment I walked through the door I was mesmerized by this unique treasure in the heart of Oakland.  Apparently, Zarra's used to be the premiere punk rock club of Pittsburgh and the walls are adorned with memorabilia from the day. I truly felt at home as the owner Johnny \"Bananas\" Zarra took me on a tour of the restaurant and told me stories of filming The Godfather of Pittsburgh, of which he played a supporting role. We sat down for dinner and the menu was filled with as much personality as the building itself.  The meal, cooked by Johnny's wife, Judy was nothing short of spectacular. We started with southern Italian style calamari marinated in balsamic vinegar. Then I had the Lamb lollipops and my date had the ricotta noodles. SPECTACULAR!!! We felt like family the entire evening. I can't wait to go back."}
{"text":"When you come from an Italian family you tend to judge food based on your family's standards. This place is legit. The sauce and the meatball confirm that. The ricotta noodles were amazing."}
{"text":"Amazing authentic homemade Italian cuisine with great knowledgeable staff. Wonderful decor and atmosphere. Definitely a restaurant worth visiting."}
{"text":"The decor at this place is definitely strange, yet it will absolutely capture your attention.  From the beautiful stained glass to the plethora of swords, the wall decorations will definitely provide for interesting conversation!

Despite the kitchy decor, mismatched chairs and tablecloths,  the food was fantastic, and the service was attentive.  From the scallops to the rack of lamb, my family enjoyed everything that we ordered.  It's nice that all of the entrees come with garlic bread and a salad.

When I'm back in Pittsburgh, I'd definitely return.  My only concern: we were there on a  Saturday night, and the place was pretty empty.  I know it's a little off the beaten path, but I wonder how it's going to keep surviving...."}
{"text":"Great Italian restaurant. Got the manicotti and it was very good, good portions. Definitely worth going back to. A lot of things made in house and you can tell."}
{"text":"I wish I would have known about this place before I wasted time eating dinner at another D grade Italian restuarant in town. I only had a Cannoli and bite of Tiramisu, but it was leaps and bounds more authentic than my earlier Shrimp Scampi. My Caffe de Carol ( Coffee with liqueur) was pretty awesome too.

Everything here is homemade fresh, so I'm sure the food is legit. Sadly the service leaves a lot to be desired. I had to leave the table and ask for my waiter twice. Nevertheless, if you are staying at the Residence Inn in Oakland cross the street and try this place."}
{"text":"I really like Zarra's.  The owner/waiter/bartender is a cool guy to talk with.  They cleaned up the front room, looks way better.  Food is still very good, but wow.  OVERPRICED.

I had rolotini (appetizer), small salad (with bleu cheese and anchovi after being asked,) and a beer (Dolomite...after I asked for Peroni and it was suggested as being good.)....total: almost $30.00

THIRTY BUCKS FOR 4 little rolotini ($9.50), a small salad ($6.50 +$1.75 for the cheese and fish), and a beer ($7.50) (plus tax)???  It's insane!

Add in 5 bucks tip...and it's borderline ludicrous.

Come on."}
{"text":"I went here a few weeks ago with my parents, and we had a great experience. One of the owners, and our server, was incredibly friendly and helpful, and made us feel welcome even though we were one of the last tables there. Plus, the food was really good. Manicotti does not disappoint!"}
{"text":"EXCELLENT FIND with very eclectic decor - like my grandma's on a holiday when everyone is coming over. Got a love the mismatch chairs tablecloth and napkins. Makes you think company is coming.

Very nice sized entrees (we shared and added an extra salad and sausage). A good fresh salad - variety not just plain old iceberg you find passing as salad - and the balsamic was good.

Great homemade bread and even freshly grated parmesan to die for! 

The housemade sausage and meatball was a great addition to Judy's Ricotta Noodles - think big gnocci like pasta - with a flavorful sauce my grandparents would proudly call 'gravy'. 

And dont pass on the desert, the tiramisu was fresh, full of flavor and big enough to share!!! 

Overall a 5 star performance!!! Thanks Donny!"}
{"text":"Love Zarras!  The atmosphere is really fun. Not to be taken too seriously. Judy the chef makes everything from scratch. It is good home Italian cooking!   Have been here many times and always had a great meal!!"}
{"text":"Great food and very friendly staff. Highly recommend. Was out on a business trip and couldn't have felt more welcomed."}
{"text":"Zarras has always been one of my favorite hidden gems in Pittsburgh. The food is insanely good and authentic, but my favorite part is the warm ambiance the restaurant gives you. Personally, I feel like I'm eating dinner at my grandmas house when I got there. It's an absolute treat to go to Zarras!"}
{"text":"Stop by after work thinking I would have a nice Italy dinner.  I will not return  for another meal.  The eggplant tasted old and was not to my liking."}
{"text":"This place is really good.  What made it from 4 star to 5 star was the family devotion and effort which really shines through.  As for the food, it was really good, and plentiful.  We also ordered way too much.  I will return soon
I did return, not nearly as good as the first time I went."}
{"text":"Not sure where to start.  The interior looks like someone went to a yard sale and put together the dining room.  Food service was slow but the food was just as bad!! They had little kid serving us and dinner took well over an hour, funny part is no one  in the place, should have known right then to leave If you like Italian food that taste like it was frozen just before served this is your place."}
{"text":"I have such a soft spot for Zarra's - I remember when this place was the Electric Banana and I love that they have all of the kitschy items and oddball antiques which gives this place so much character and provides for a unique dining experience.  This is a family run business - and the servers are wonderfully friendly and the food is fresh and delicious and if you are lucky enough to be there on a day that Judy is in the kitchen you are in for a real treat.  The food is always good, but you can always tell when it's made by Judy's expert hands.  I've been here many times and will definitely be back again and again.

Probably my favorite thing on the menu is the Ricotta Dumpling Soup.  It is one of the best soups that I've ever had in my life!  I've sometimes gone there just to get soup and salad because the soup is that delicious.  I've tried many of their entrees, but one of my favorites is the simple Algie i Olio which I sometimes add the Italian tuna to the dish to make it even more mouthwatering and delicious.  Judy's Ricotta Noodles are warm, pillowy delights topped with the rich tomato sauce - absolutely delicious!  The Melenzane Romano is another one of my favorite dishes.  There are so many great things on the menu and even though I've dined at Zarra's many times, I still haven't tried even half the menu because I keep going back to my favorites time and again.  Great Italian food!"}
