{"text":"When ZeZe Food & Drink opened it quickly became one of our go to restaurants. We've worked our way through the menu; Korean Steak Tartare, Beef Cheek Crostini, Pizza, Crostini with Burrata and Pine Nut Brittle. Everything on the menu is delicious. The menu continues to evolve with a focus on fresh and sustainable ingredients. 

We were in the process of planning our wedding and still looking for a location for our rehearsal dinner. We decided to speak to the owner Haeyeon to see if we could hold our rehearsal dinner at the restaurant. 

She was thrilled and amazing to work with - she asked for our input on flavours, types of food we enjoy and any other inspiration. She created a couple of options for each course for us to try at an incredible tasting. 

She worked within our budget and created the type of meal we were looking for. Our rehearsal dinner was a huge success with oysters, burrata and melon salad and tuna crudo as appetizers. The first course was a seared scallop in pea puree followed by pork loin with miso mashed potatoes and lotus chips. Dessert was an incredible sake sorbet with mango and coconut snow as well as a surprise traditional French wedding cake - croque-en-bouche - chocolate filled cream puffs with caramel threads. 

Our friends and family thoroughly enjoyed the meal that Haeyeon and her team put together for us. We would highly recommend not only trying out ZeZe for a meal but also for catering or private events. This is a great local restaurant with fresh and interesting flavours, great drinks and awesome service."}
{"text":"We worked our way through most of the menu, the steak tartare was excellent. The pana cota was also great."}
{"text":"Theres really nothing better than enjoying a delicious brunch at this cute little place. I got their omelet and it was absolutely amazing. Its served on a skillet and it was so flavorful and oozing with deliciousness. Brunch entries range between 10-15$ Their latte's are also pretty good. 

Love this place!"}
{"text":"This place is still great. We come here for brunch regularly. Food is fresh, delicious and excellent quality!! It's seriously my favourite restaurant in the roncesvalles area. They also just opened a patio. You should totally check this place out!"}
{"text":"Quaint little place. Excellent atmosphere, delicate dishes, and a fantastic drinks menu.  I will definitely be back."}
{"text":"This is definitely a hidden gem of a restaurant. This summer I took up dragonboating and was relied heavily upon on where to go for brunch. My general go to places are closer to the downtown core, and so i used trusty 'ol Yelp for suggestions. The first few times we went to Easy Restaurant, Mitzi's cafe (twice), and Cardinal Rule. To be honest, they were disappointing. Every poached egg I got was overcooked, and generally, nothing really wow'd me. But what can you do? those were the places that were supposed to be the good brunch places.

Today, after practice we went to Easy. It was full, and with a 45 minute waitlist. so we went to Cardinal Rule. same result. not completely full, but nothing that could accomodate a table of 6 people at the time and wait was about 20 minutes. So, I take out my phone, go to Yelp, filter by distance for brunch, and up comes Ze Ze Food and Drink. Only a 2 minute walk for Cardinal and Easy, so off we go.

We get there, and though they didn't have a table for 6, the server/hostess accomodated us. She managed to kindly have one group (who just sat down) move to another table, so that she could rearrange a table of 4 and a table of 2, into a table of 6. 

The Brunch menu has all sorts of delicious dishes. No Eggs benedict, but they have poached eggs. As I've been disappointed in the past, I decided to forgo the poached eggs, and got the breakfast sandwich with smoked ham, while my group got french toast, huevos rancheros, and spicy baked eggs.

It took a little while for us to get our food, but when you try to have 5 egg dishes and a french toast come to the table at the same time with one person cooking, that's bound to happen. We weren't in a rush so I don't think anyone minded. The server apologized that it took long, which she really didn't need to do. But it was appreciated nonetheless.

Once we did get the food, it more than made up for the wait in my opinion. Everything looked delicious and hot. And when everyone cut into their eggs, they were nice and runny like they're supposed to be. My breakfast sandwich was amazing. It consisted of 2 free run eggs and smoked ham, on homemade focaccia bread, smothered with pickled mustard seeds. I ate every last bite of it.

Suffice it to say, this is now my goto brunch place in the Roncesvalles area. I only wish I found it sooner. the fact that they don't have a 45 minute waitlist is beyond me, but if that means I get a table right away, I'm fine with that."}
{"text":"Feels like we found a secret treasure in  Parkdale! Kale salad was gorgeous and delish, and the Korean steak tartar was a delight. The pork tenderloin had so many complex flavours yet working together flawlessly. Come on over so that they can expand the wine list!!!"}
{"text":"I really love this space - very inviting, comfortable decor and furniture makes you feel at home and welcoming service to boot. I've only had brunch so far so I leave room for future reviews but for now...brunch!

I'd say this menu focuses on lighter fare which works for me as I don't eat meat. My friend and I both had the 2 eggs sunny side up with buffalo mozzarella cheese and toast. It came with a balsamic drizzle that was nice but not necessarily. The food tasted fresh, the coffee was good and the price was right - $8 for the eggs! I wasn't wowed but I wasn't disappointed. 

Definitely worth another visit."}
{"text":"That muffin was great, well beyond you're typical muffin
Coffee was ok

That muffin, though"}
{"text":"Excellent cocktails/ beer list and delicious food/bar snacks... All at a great price! What more can you ask for??"}
{"text":"Everything here is just excellent. Highlights:
- Bread products. The pizza crust is arguably the best in the city (actually the pizza is amazing, period!) The banana crumble muffins haunt my dreams.
- Meats. The beef cheek omg . . .
Honestly though it is like picking favourites among my children. The quality of ingredients here is evident, as is the chef's meticulous passion. I am going for brunch next Sunday and will let you know (though I can't imagine it will disappoint!). Get here!!"}
