{"text":"Good food.. great location. staff needs to show they care and have not forgotten clients who have been seated. i think a little time spent on training them wont hurt. Food taste is great and thats what should bring people back. c'mon Zeera u can do it"}
{"text":"A lil expensive for the size and quality. Idk if they did it on purpose, but the nihari has a tad bit strong zeerah flavor. I don't have much experience with bun kabobs, but what I got wasn't what I expected. Instead of a hamburger the meat was tender and spicy (like a shaami kabob)..but it definitely wasn't bad."}
{"text":"Their food is good especially Nihari and bihari kabab roll.  I must say this is the best Nihari I ever had in any of the restaurants, but reason for my 3 star is, its too expensive keeping in mind its just take out. These are the prices restaurants normally charge for dine in and service...  Overall a good take out place if you are single and don't want to cook at home."}
{"text":"This is like my go to place for take out when I'm too tired to cook after work or class. Just call ahead and pick it up. They take debit too which always helps.   Their Bihari kabob just melts in your mouth. Their haleem is good too.  But note that beef biryani is only available Fridays. Which sucks cuz it's so good I want to have it on every day of the week damn it. Haha."}
{"text":"Got the bun kabob chicken, palak paneer with garlic naan and a mango lassi. I highly recommend the bun kabob, it was absolutely delicious. The palak paneer was good but I felt like there was not enough paneer in it. The garlic naan was really good. And the mango lassi was what I would expect a good lassi would taste like :)  The place don't really have dine-in and usually only does takeout. The staff there is really nice and friendly. I would come back again:)"}
{"text":"i am a Pakistani and i would not buy anything from that place. It is waste of money no matter what you buy from there the gravy tastes the same for all their foods. The only thing i buy from their is naans and sometimes haleem. I have even stopped buying naan from there. I recommend Kabbah whics is atleast clean."}
{"text":"Tried this place about 2 months back and I got so sick. I ordered their beef bun kebob and it tied my bowels in knots for 3 days.  I have no doubt that the meat was bad. I guess I should've stopped eating when I noticed that the beef tasted funny...but I had attributed the taste to what I thought were the spices they used. Big mistake. I had to call in sick for 3 days! Terrible. Avoid."}
{"text":"My sister got me a bun kebab from this place, and it was good.  Not too spicy (for me) and a nice mix of toppings and masala.  We also tried a few other dishes, palak paneer, butter chicken (or chicken tikka masala, can't remember), but both were really good.  I wasn't expecting much from this place because most Pakistani restaurants in Toronto unfortunately are not too good and others have completely overdosed there food with spices.  This place is worth giving a try.  It is take out only I think."}
{"text":"Excellent Quality Food , Nehari, Biryani, kabob, haleem and specially naan  are v fresh and tasty. Staff is cooperative, good customer services. Prices are on the higher side but quality is also good."}
{"text":"We ordered one Naan bread, one Nihari, and one Chicken Biryani to go. The Naan Bread was good. The Nihari was good too. But the Chicken Biryani, was just ok; it wasn't the greatest. They used big leg pieces for the Biryani instead of small cut pieces. The two leg pieces of chicken I got in the Chicken Biryani were both uncooked; as they were pink near the bone and I can see a little blood around the bone and vein as well. I lost my appetite after that. I just threw the chicken in the garbage. For the price they charge, the food should be well done at least."}
{"text":"First thing first their food tastes good but quantity is not good. I received my food really hot to the point I burned my tongue but since I did a take out I couldn't go back. Chicken Biryani is not worth it literally comes with a piece of chicken and loads of rice.   Won't be becoming their future customer"}
{"text":"Tasty nan . Bad service. Expensive. must improve"}
{"text":"Good nihari and near authentic bun kababs! Is not very cheap but it works out if you are 4-5 people and get the family size meals"}
{"text":"I have been ordering food from Zeerah ever since they opened. Best naans in Mississauga, hands down. Their mutton biryani (which they only make on Saturdays, and run out way before closing time) is to die for. My family loves their Haleem, Nihari, Chicken Biryani and Chicken Bun kebab. Their Brain Masala is also delicious. Excellent , authentic, reasonably priced, home cooked food."}
{"text":"If you are a vegetarian, this is not the first option that should cross your mind. If you are looking for low fat / sodium / healthy food this is also not the place that should cross your mind.   Nevertheless I still ended up there for the second time in almost 11 years. Wanted a quick vegetarian Thali for a senior visiting us and all we had at home was non Asian food. Thinking she might not like non Asian food I went next door to a newly opened restaurant that had a Thali on the menu, but they were still not ready completely. As I had little time I ended up at Zeerah.   Ordered a Mixed Vegetables Curry a rice and a Paratha. All the three items had excessive grease and were overly seasoned. Not a good experience.   The vegetables were clearly not fresh cut in the kitchen - they came from a frozen bag. The flat bread was overly chewy and full of grease."}
{"text":"Visualize this. Any chicken curry fo $6.50 plus tax. Small container has one chicken wing only and the rest curry. If you get the large container for two, one chicken wing and 1/2 of chicken thigh. Taste wise no real complaints but tell me if it is a rip-off or not.  Beef Nihari is good though."}
{"text":"Dropped by here based on a couple of local recommendations.  Was interested in something different for lunch outside of the usual suspects.  I am relatively inexperienced with Pakistani food but have been to Lehore Tikka House a couple of times and really enjoyed it.   Upon walking in don't  expect much in the way of decor. Place seemed clean enough but the handwritten signs are not really helpful. I already had an idea what I wanted anyway and there is a much better takeout menu pamphlet available on the counter. Not sure why they don't just put a blown up version of that on the wall.   I order the beef kebab on paratha. The kebab was well spiced and tasty although a bit heavy on the onions. The paratha wasn't that fresh and a bit oily but decent enough.   I find their prices a bit out of whack for what is supposed to Pakistani street food. I paid almost $15 for two ground beef kebabs that were not that substantial and the only toppings were onions and some chutney.   When I compare that to the other local lunch options like shawarma, West Indian roti, banh mi, or even a good old fashioned burger you are paying more here especially for a take out only joint.   I might give it another shot but probably something else on the menu"}
{"text":"Ordered take-out from Zeerah last weekend and was happy with the food. It was spicier than expected but I'm okay with that. I had the butter chicken with rice and palak paneer, and a piece of garlic naan. The paneer was okay, but was not like classic Indian style palak paneer. Butter chicken and naan were great. I would go back if I'm ever craving Indian food in a hurry!"}
{"text":"Takeout place. All food is very good. I have tried their rolls, bun kabobs, biryani, nihari, korma. Naans a great too! A must try!"}
{"text":"The taste is very authentic and the price is very affordable.  Their Behari Kabab is succulent, moist and has just the right amount of spices to wake your taste buds.  The haleem is pretty good but felt as if it was a bit bland and could have used a bit more spices.  Their Chicken Karahi is amazingly tasty and you can not go wrong with it. Their naans are a bit small in size, so you might need to order an extra one.  They are also pretty well known for their Bun Kababs which was surprisingly tasty and has quite a kick to it and you cannot go wrong with a price of $3.19.  Overall, the food is well worth the price and definitely worth checking out."}
{"text":"We went there after one of the reviewer's comment here on Yelp saying, \"...mutton Biryani is to die for...\". Man, that was a mistake. Completely false!!! The Biryani tasted like Pulao with insufficient salt... this is the second time eating here, and we won't be returning. For all the positive reviewers, I think they haven't had good Pakistani food before...! Go to Karachi Kitchen instead."}
{"text":"I've been getting biriyani and other items from Zeerah on-and-off for a few years now. It feels like things have been going downhill with each visit.  The food is unnecessarily greasier than it needs to be... to the point where a lot of the food tastes heavily of stale oil. The place look constantly dirty and someone when I catch glimpses into the kitchen while waiting for my take-out, I hope I don't get sick from eating the food.  Based on my most recent experience, I won't be returning."}
{"text":"Ordered the BBQ family platter on skipthedishes. Amazing flavour and you get so much stuff! Will definitely get this again."}
{"text":"Takeout kiosk only. Great Pakistani fast food. Bun kebabs and qeema naans are amazing. Good tea too"}
{"text":"I paid 40 dollars worth of food today. Will not be going back. Ever  . Its poorly packaged.they barely speak English.  Got my order mixed with another. Food oils it's xoloures with tumeric  . No real flavor. X gets the square"}
{"text":"Its a take out restaurant only so there isn't anything service to talk about. The food tastes great, I have tried their beef nihari, bun kebab and chicken karhai. good place!"}
