{"text":"I went to Zen 8 Grill with my friend last week. I had the Tom Yum Pho. Normally I go for stirfry noodles, but I didn't want peppers. The Pho Is not a traditional pho because they use coconut broth, but it was delicious. It's a little spicy but the coconut broth compliments it well. My friend had the chicken teppanyaki. They give you two sauces, and they both were delicious. The teppanyaki comes with potatoes and bell peppers. My friend and I both noted that these are very strange vegetables in a Japanese restaurant. I feel like broccolini or something more Asian inspired would be better suited. But I'm not a huge pepper fan, so maybe I'm biased? 

After, we had Johnny Bombs. They are drop shots they do that come with a chant on their drums. Our server, Heather, was great on the drums and was very fun with the whole experience. 

Overall it was a good experience. Service was great, my food was good, and I really enjoyed the lively environment. Can be a bit noisy, but you're in a casino, what do you expect?"}
{"text":"I went there for lunch with my wife and there was a mold in the dessert (cake) I was eating.. They did take the cake out from the menu but there was no sincere apologies from the management whatsoever. I am really disappointed and will never return in this place ever again!!!!"}
{"text":"Came down here for a birthday party - one of party was fairly good friends with the staff, so you would expect we would receive good service, if not even better service, but not at all. Service was a GONG SHOW. 

Our waitress had no idea what was going on; drinks took forever to arrive (even though the restaurant was fairly empty), appetizers and mains came out at the same time etc., We were given the excuse of a \"family-style restaurant\", but that only works when you are actually ordering family-style.

Food was fine, nothing to write home about.  A couple of dishes came out cold and had to be sent back - no discount on bill for the inconvenience. 

I would never go out of my way to visit this place again, may only give it a shot again if I was at the casino."}
{"text":"The short: Food came out quickly, hot and fresh. Service was attentive and responsive. Yum!

The long: I am a sushi lover, and we all know that our city has its iffy sushi spots, but this is not one of them. Yes, it's surprising to find food of this quality inside a Calgary casino, but it's an awesome spot to go before (or after - they are open late!) heading to the Saddledome. As a bonus, you can also score a better parking spot by arriving early to park, then enjoying a leisurely meal before your game or concert. Our party of four especially loved the Osaka Dumplings and Rock n' Roll rolls, and the Gekkeikan Draught Sake was delicious and well-priced. We will absolutely return!"}
{"text":"I really like this restaurant, we just tried it while on our way across the street to Saddledome to see the Bryan Adams concert. I just took one star off because it took a full 20 minutes before a waitress even came to see us- I know the place was very busy but there's really no excuse, the owners clearly need to hire more staff when customers are waiting for 20 minutes before even getting their drink order-----then some people are going to get frustrated and just leave and then that's all lost money. When the waitress finally showed up she was very adorable and accommodating, I made sure when we saw her to order everything including drinks and appetizers and entrées in case we might going to see her again for an hour... The food was very good I had some sushi and my husband had Teppan-Yaki chicken, I was shocked at how reasonable their prices are. Usually casinos will soak you financially. All in all it was very good. Oh Also the waitress gave usSomebody else's bill because she could not figure out how to number the tables... So perhaps the wait staff could use a bit more training but other than that it was very good. And a great location, I know I will be back soon."}
{"text":"I wanted a posh Japanese themed outing. We were going to Madam Butterfly and I didn't want to go to just any normal sushi restaurant all dressed up. I remembered that Zen 8 was a bit more on the fancy side of things we decided to try it out.

Well. I sure hope the Teppanyaki is better than their sushi, because the whole experience we had was awful. We came early and were the only ones in the restaurant at the time but instead of getting a table we get placed at the grill - not a big deal, just weird placement. 

Our waitress takes our drink order; I get the Hello Kitty martini. Which takes over 15 minutes to get... we got our dinner order in before it even arrived.
When it did arrive it was the best part of the meal. We ordered popcorn calarmari, gyoza, spicy tuna roll and a mango roll.

The popcorn calamari was ok... but it was basically like eating deep fried batter, the gyoza had good flavour but the spicy tuna and mango roll really was a disappointment. There was a sliver of mango in two of the 6 pieces, none in the rest. The spicy tuna tasted very bland and a bit old. 

Needless to say, we won't be back."}
{"text":"Do you like hour old soggy veggies? This is the place for you. We sat at our table just after 6 and there were cooked veggies on the grill from the customers before. We ordered our meal and were served those vegetables after 7....unsanitary and gross!! I would expect new vegetables to be cooked with my meal, not served. We complained to management and she didn't seem surprised. The service was also INCREDIBLY slow. We had 1 drink in 1.5 hours. Brutal. Don't eat here......we did get new veggies after we complained"}
{"text":"Located inside the Cowboys Casino.

Was impressed with the space - nicely decorated Asian style with a modern flair. There is a grill area where you can come in at certain times depending on the day of the week, sit with others in a square and have the real Japanese experience. Or, you can seat at a normal table/booth and order from the menu, like we did.
The food was FANTASTIC and the menu was clever. I have eaten at many a fine Asian restaurant in Vegas and this was right up there with quality, care and freshness.

Service, unfortunately was slow and spotty. They need to work on this.

We also had a table of many a hooligan right beside the 2 of us trying to have a nice date night and that....  was not cool. We hurried it up to get out of there and we could have had a better experience if not for them but we do not blame the restaurant so much for these animals' foul potty-mouthed behavior.

Ordered:
The wagu beef burritos (OMG, to die for!)
endamame
potstickers (only 25 cents each on Thursdays)
Small cup of won ton soup (REALLY good)
Pad Thai (no complaints)
Dynamite Rolls (sushi) (Fresh and great presentation)

Food, 5/5 we thought, and the drinks were also good, pints were on sale for him.
The prices I thought were very reasonable too.

Watch your bill though as the dishes come out sporadically as they are made and we never got our endamame until we asked about it when it was time to get the bill. They offered it to us to take home and in the end took it off the bill. No explanation on why it was forgotten about?

Would return, maybe to try sitting at the grill/wok as that is always a cool, interactive experience."}
{"text":"Went last night (Thursday night during stampede).  There were 4 of us. It was not very busy and yet the service was incredibly slow. They have sashimi on the menu but not sushi which was weird.  Yet you could order sushi but they give you 5 pieces if sushi per order so we ordered way too much. And then they said ya it says 5 pieces if sashimi with extra charge for sushi.  Bad menu.  Sushi was ok.  Service sucked. Won't be back.  Too bad.  I liked the one downtown.  Waitress was never around. Don't know where she went as the place was not busy. Decor is kind of low budget too."}
{"text":"I feel like a total turd for writing a very critical review based on a single experience - a VIP grand opening party.   I've decided to do it though because it was probably enough to keep me from returning on my own dime. 

When a restaurant hosts a media/corporate/vip event I kind of expect them to have their A game on.  I'd never post a glowing review without having a return visit as a normal person but in this case they probably turned me off completely so I feel I can write that review.

Two positives of the night:

The Teppanyaki chefs were very entertaining.   The guy frying up rice was forming the piles into hearts and using it as a way of flirting with all the ladies that were standing around watching.  I assume this is a regular feature and something that would normally add a little extra excitement and flare to a dining experience. 

There was a tasting of sake which was very interesting.  It was being served cold  (don't try that at home with a cheap sake though...) which I found interesting and we ended up getting into a very interesting conversation about sake.  It was very informative but probably not a regular feature in the restaurant. 

The negatives:

The service.  Not a single server spoke a word to me.  At first I tried to get the attention of someone to take a drink order or to order something from the menu as the samples were few and far between.  In the end,  I was kind of just curious if I could get attention with eye contact alone.  The answer was sadly no.  

The food.  I think they invited too many people or logistically didn't plan this party out.  There wasn't much food and what I did try was very disappointing.  I had half a spring roll which was from frozen and I'm not sure it was even heated.  It was very cold even though I saw it walk out of the kitchen.   The fried rice I enjoyed watching it made but it was just ok and probably too buttery in flavor.   I talked to some that had gotten to try the sushi and it wasn't even made with great fish.  I don't eat tuna but the word from the Teppanyaki fish was that is was too salty and fatty.  

Unfortunately the two negatives are far more heavy than the two positives.  When I left I regret having even made the trip downtown for that and that's kind of the overall feeling I'll carry with me from that experience."}
{"text":"The gentleman who told us they'd be happy to do take out (the sign up front says Dine In Only)  seemed nice and was happy to tell us any time before 6 or after 8 are generally not busy. So we came back to get dinner, and sadly were disappointed.  My pad thai had more salt flavor than anything else. My Gandhi roll was better, bit for $10 I expected more.
Sadly, we won't be back."}
{"text":"We came here for a friends birthday celebration. The atmosphere is nice and fits the Asian-Fusion theme. 
The chefs at the teppanyaki station were fabulous. They put on a great show without compromising the quality of the food. And the food was amazing!! I had the tenderloin and it was cooked to perfection. My husband had the tuna steak, also cooked to perfection. Both were seasoned so nicely and the presentation was beautiful. 
So why only 3 stars you ask? 
The servers were absolute crap. 
They use a system of \"texting\" your order to the bar or kitchen and it is a terrible system. We had to wait so long for drinks that we started ordering them 2 at a time. And the food was consistently brought to the wrong people all night (there was 12 of us). Normally, as a party of 12 I would expect some minor confusion, but the restaurant was completely empty except for our group, so it really shouldn't have been issue. I mean, the chef at the teppanyaki station managed to get all our orders correct and in the right order (8 of us in a row). 
So, final thoughts: I will absolutely return if I'm in the area (Cowboys Casino) and in the mood for an amazing steak and mojito (wow, those mojitos were amazing!), but I wouldn't go out of my way to go to Zen 8. I'm sure there are many other great Asian-fusion restaurants around the city."}
{"text":"Garbage. 
Miso soup is never hot. 
Sushi rolls NEVER STAYED ROLLED. I've eaten here 4 times too many, each time was shit but I'm a strong believer in chances, I always eat at a place 3-4 times before cutting it out. HATE this place. Terrible sushi rolls. Edamame is so hard and cold just gross. don't bother going here, ever. I'm saving you a huge disappointment."}
{"text":"I will say I was actually pretty impressed with this place given that it is in a casino. I was very skeptical at first but it turned out good! The sushi is actually pretty good in this restaurant. I tried quite a few rolls but I would recommend the rock n roll and the angry California roll. If you want a classic they also have a good dynamite roll. So overall if you're ever in the cowboys casino I would suggest checking this place out."}
{"text":"I was working on the Stampede grounds and came in here for lunch.

They have a lunch menu with most items ringing in at $9.95 but things do go up to around $14.95. The lunch menu is a good size with a range of sashimi, rolls, noodle dishes, and the like. Our server was very friendly and speedy at getting our order taken and refilling our tea pot.

I went with the roll and sashimi combo. It came with scallop, tuna, and salmon sashimi and a choice of roll. I went with the most exotic sounding one, the Rock 'n Roll. Its a huge roll deep fried in tempura. Very delicious.

For non-sushi people there are noodle dishes. My dining companion got a good sized bowl of pad thai. 

Overall a great experience here for lunch."}
