{"text":"Food is so good! They have a new menu out with new pasta dishes and pizza's. Service is great they deliver also. Their food is like having a restaurant like olive garden deliver to you. The average delivery time for them is about 35 minutes pick up is 12 minutes."}
{"text":"I order a small pepperoni pizza during my lunch break they said it would take 35 mins... (kinda of long for a small pizza) when I get there the pizza still wasn't made it was just going in the oven when I got there. Almost an hour for a small pizza and it was undercooked not only was I late getting back to work I didn't even have lunch...


Do not suggest this place if u only have an hour lunch break"}
{"text":"If I could give them no stars I would.  I called during business hours, and no one answered. After a second call someone picked up the phone and hung it up.  Don't bother wasting your time.  

Go to Gioninos (330-562-8144) instead!  Their pizza is tastier, and they care about your business!"}
{"text":"I drive 7 miles out of the way and past several other pizza places just to get pizza from avon zeppies. The staff is very friendly and polite.....that's the main reason I go there! 
Prices are reasonable. My order is always ready on time. 
Food is fresh and pizza is loaded end to end with toppings! The home made salted chips are one of my favorite items on the menu!!!"}
{"text":"The phone was answered quickly to take my order and money for delivery. 

The delivery wasn't quick though. Told me an hour. Fine. It's been 1.5 hours and no call to say they are late or that they will be refunding any portion of my money. 

We learn this when we are kids. If you are going to be later than what you said, you let somebody know and then let them know when you'll be there. 

People generally understand if things happen IF you communicate!"}
{"text":"Love Zeppes Original Calzone & sub, excellent food, made right. Jen the manager is the best and treats returning customers like family. Always order from this location"}
{"text":"Worst place ever. Pizza had a fly in it and ths guys their were jerks. They spit in the pizza and drink beer and alcohil n the back. This place should be shut down asap. Tried talking to an employee named bryon and he was extremely rude. Do not go here"}
{"text":"This place should get zero stars but you don't have that option. Paid for a pizza and was told it would be 20 minutes. Got there and they forgot about my order. After waiting 40 minutes for the pizza home to find they put the wrong toppling son it despite the ticket being correct. Called and the girl said, \"I didn't make it. What do you want me to do about it?\" Go to gioninos and save yourself the trouble of this place. Terrible"}
{"text":"I was staying at the Fairfield Inn. Delivery was a few minutes early, the driver was polite. My order was hot and correct. They did not include a fork, which I thought they would since I am at a hotel, however I did not add it to the notes on my online order, so no harm. 

My boneless wings were delicious- tender and juicy, with just the right amount of sauce on them. 

My pizza was very good. Great amount of toppings evenly spread on it. It could have been cut a little better, as it seems the center of the pizza wasn't fully cut, but this was only a minor issue. 

Price was fair, maybe just a little expensive, for what was provided. I will order again!"}
{"text":"Ordered garlic Parmesan. Wings swimming in sauce with shakes of grated Parmesan  on top. Wings was soft fried terrible.i will not be back"}
{"text":"Pizza is just what I expected.  Good taste, good price.  Quick service.  Plenty of great choices besides pizza.

I ordered a medium which was more than enough for one person.

The people were friendly -not sure what's up with the other review."}
{"text":"This is my favorite pizza spot. We usually order a large w/pepperoni &  extra cheese.  They cook it perfect everytime."}
{"text":"@ Matt N.

I have had the exact same problems with Zeppe's pizza in the past too.  They want to give you a free 2 liter when they mess up your expensive food order.  They only carry caffeinated products which our family doesn't drink anyway.  I only order the occasional calzone because they botched my first pizza order so badly and wouldn't do a thing to make it better.  I was several months pregnant, had just moved into Chesterland and ordered 3 pretty expensive pizzas.  I had been told they have the best sauce and honestly, that part was true.  The pizzas arrived nearly 45 minutes late and one of the pizzas was not as I ordered it.  The manager at the time kept telling me about their \"world class service\" yet didn't offer to fix anything, credit us anything or offer a deal on a future purchase.

I'd give their food 4 stars, service a 1.

I think they should take down the \"world class service\" poster in their establishment.  Aren't there laws against false advertising?"}
{"text":"Love this place, brisket sandwich is so good and in just had the Philly a few says ago and I'm going back for another one here soon. People are great also."}
{"text":"Horrible excuse for pizza! Cardboard, tasteless crust, tasteless, texture less cheese, and toppings that had no taste. I had no idea anyone could throw this much tasteless stuff together and try to pass it off as pizza!"}
{"text":"Food's not bad, service is not so great.  Let me describe a typical call to order a pizza.  Phone rings, employee answers, before you can get a word out of your mouth, you are greeted with a \"Welcome to Zeppe's, can you hold please\" [CLICK}.  After holding for several minutes, I call and get the same \"Welcome to Zeppe's, can you hold please\" [CLICK}.

After 2 or 3 times getting the same thing, I hang up and call somebody else.  I wouldn't mention it, except after a while it seemed like the norm, not just an occasional nuisance."}
{"text":"I ordered there chicken parmesan pizza and ordered garlic sauce on the side instead of giving it to me on the side they put it all over... the pizza was disgusting and made me so sick I had pain in my stomach for about 2 days. That was my first and last time ordering there."}
{"text":"I love zeppe's they  are very friendly but they never get your order right, so if your going for a cheese or peperoini pizza ya I would go there. 




Ps. 
     Dont order anything like pineapple, ham or Jalepeneos"}
{"text":"Used to deliver to us but now they don't, we're only a few miles away! I'd love to give this place more but cutting back on range to save a few quick $. You just lost a paying customer Zeppe's! Hope your as happy as I am!"}
{"text":"The last two times I got carry out from this location, it was pretty bad.  I have found that this place is only good when this girl is back there cooking the pizzas.  Otherwize, the pies are undercooked and skimpy on the toppings.  Time to improve now!"}
{"text":"Open until midnight on the weekends, but don't call after 11. Got hung up on initially, then after calling back was answered with \"we close at midnight\". Didn't think it would take 45 minutes to make a pizza, but if you refuse orders after 11 close at 11. Also has completely botched our toppings in the past. Half mushroom and pepperoni doesn't mean all mushroom. Just a bad place you'd be better off ordering Gionino's across the street."}
{"text":"My family and I go here on occasion and have had good luck with our order being right.  The food is good and is priced fair."}
{"text":"Ordered a pizza online and never received it- when I called I spoke to Lincoln and after telling him that I have a confirmation email for the pizza he decided that it must be my internet( makes no sense) and there's nothing he can do because they are closed. So... not the end of the world but it still sucks, waiting 1.5 hours for a pizza that's not coming and having to talk to a jerk when I call and ask what's up. I feel like I should stop in and ask to talk to a mgr about what happened, but really what would the point be in that- it wouldn't solve the problem and I'm sure that whoever is managing a pizza place doesn't care anyway- other thought was to stop in and ask for Lincoln and see how his face to face attitude is vs his phone bravado- life goes on"}
{"text":"These guys Rock at this location!! Always fresh food and great pizza. Their wings and wraps are always good. If you are ordering one or many pizzas, they come through...."}
{"text":"Ordered online (got a confirmation email) and waited more than two hours, and they never showed up.  Tried calling them, and they were closed.  Wrote to their corporate office, and didn't even get a reply back. Definitely will not be ordering from them again."}
{"text":"Great pizza delivered on time. Delivery and phone workers were both very friendly. Would recommend and eat here again."}
{"text":"I worked at a Zeppes when I was younger and ever since then it's been my favorite pizza. I'll gladly pay a little more for it because it always turns out good."}
{"text":"All these stars for an over priced grease pit!
Wake up. Zeppe's is proud of their heritage, prying on the SUCKER.

A few years ago a Zeppe's employee tried to steal over $250,000 from the grease pit.
Customers are still paying the money back."}
{"text":"UPDATE.

Purchased taco salad and they forgot to add the chili.  Not  returning, no reason for this."}
{"text":"This location USED to be good. Last 3 times I ordered (and each time it was simply a pepperoni pizza) there was so much sauce and cheese and grease that the toppings virtually soaked through the crust and made it super soggy. Last time I asked for the pizza well-done they burnt the hell out of it. Plus the employees always act like you're putting them out when they're taking your order over the phone."}
{"text":"Their subs are SO tasty!!  Quick and friendly delivery."}
{"text":"Walked in after 20 mins of making an order and they had not even started it yet. No apology or nothing, just acted like everything was normal. Just let me stand there. The cashier went from taking cash at the register to straight over to making the pizza and handling all food items without washing his hands. 
Customer service or cleanliness are not even a thought here. Plenty of better choices around."}
{"text":"Great subs and Jo Jos at good prices."}
{"text":"DO NOT BUY PIZZA FROM HERE.  Last night was the first and last time I'll eat this slop.  I was looking for something different than I usually get here in my neighborhood and thought I'd try this place.  Never in my 5 1/2 years of living in Royalton have I ever had such bad Italian.  The pizza was beyond soggy when I got it, so I stuck it in the fridge for a couple of hours hoping it would be better cold.  NOT.  Still soggy, I mean as soaked as a wet dishrag.  Then when I called to get a refund or new pizza or something, the manager said they don't do that, that all the pizza places he worked at didn't do that.  So I proceeded to tell him Antonios does, Augies does, My Pizzetta does, and I forgot to mention Papa Johns does.  All the really good, legit pizza places work with their customers, and that's why I keep going back to them.  If they did something wrong, they fix it.  Anyway, he finally agreed to a whopping $5 toward my next purchase, I guess thinking I was going to eat slop again.  Worst pizza and worst customer service from an Italian joint ever."}
{"text":"Stopped in to get a slice of pizza at lunch while out running errands. Boy am I glad I did! Pizza was tasty and fresh, dining area was clean, and the staff was helpful and extremely friendly. Ended up taking home Zepperoni rolls and they were awesome! Will definitely be back!"}
{"text":"So disappointed. Ordered a caprese sub. The description on the website says \"Roma tomatoes and fresh basil\". My sub had neither of those ingredients. What it did have was diced tomatoes and dried basil. When I called to complain, the response was, \"Sorry. My GM says he made the sub and he says he put basil on it.\" I tried to explain that it was dried basil, NOT fresh basil, which is what was in the description, and the definition of a caprese. All I got was, \"Sorry, have a nice day.\" 

Thank you...we will take our business elsewhere."}
{"text":"I ordered tonight and asked for a Zeppe's Calzone with no banana peppers.   I received a Zeppes' Calzone WITH banana peppers.  It wasn't a huge deal at all, nothing major.  The real problem started when I called them to tell them of their mistake.  When I told the store manager what my problem was he SNAPPED at me at told me to bring the calzone back to the store.  I live 13 miles away and I said I was already at home and unable to return.  He then lectured me, saying that if one person gets a credit,  everyone will want one.  In the end he said he would give me a credit for a freaking 2 liter of soda.  He ruined my order and wanted to give me some Pepsi.  Nice.  I hope that credit is comfortable because it will be sitting there until the next time I feel like getting snapped at for being annoyed that I was given food I didn't like.

This was the 2nd and last time my wife and I will be eating there."}
{"text":"Mmmmm it ok...I think their pizza is greasy - like take some Bounty and press blot repeat.  Not reheat able due to aforementioned grease - but tasty when you immediately eat it hot. 

We also got dessert - the cinnamon twist - those taste like an elephant ear perfection so don't miss those!"}
{"text":"Me and my husband used to love going to zeppes two years ago, recently we came back into the area we lived in and decided to get our favorite pizza.. unfortunately the pizza Crust is made much more dry and buffalo chicken pizza now has tomatoes which really ruined the flavor. Also they are pretty pricey for such a bland and basic pizza. I will not be coming back."}
{"text":"I am happy with their sandwiches, but experienced poor service on more than one occasion. Usually they do a bad job explaining their specials and end up with weird surcharges."}
{"text":"Visiting from out of town. Always try a pizza when away from home. Sometimes it works out. Like this time :). As a family we had 3 different pizzas on 2 types of crust (I only eat thin). Also had the \"this and that\" everything was hot and delicious. Came promptly and the service was very accommodating and courteous. We are staying in a hotel. Ordered while down at the pool. Ask them to call before they got here so we could decide to have food delivered to poolside or room. Everyone was so pleasant to deal with. Would recommend this pizza and appreciate the staff and their kindness."}
{"text":"Ordered a 16 inch supreme and a party size 1/2 sheet.  Pizza was GREAT!!!!!  Lots of cheese and toppings.  Better then the Zeppes that I usually go to-will not tell which location but they tend to skimp on the cheese and toppings.  Will travel a little further and go to this one next time."}
{"text":"What happened to the pasta sauce? Used to be one of the best. Now it is crushed tomatoes and water. Thin, and no flavor. Maybe this franchise is trying to save money. I do not remember their sauce being that bad. Their pizza is still one of the better pies around."}
{"text":"Over priced, poor customer service. On several occasions my take out orders have been wrong or missing. I have had pizza with missing toppings. Ordered subs, that come with home made chips, and no chips. Calls all result with the same excuse...\"we ran out\". Tonight the same excuse again. How can any resturant run out of anything on a Saturday night. No real attempt to make good. No monetary refund for the chips or missing toppings. On all occasions they promise to give credit for next visit where they will double the topping, double the chips. Never come through. 

So my rating of one star is because of the poor service vs. the high price point ($8.99 for a 10in sub, includes a side of chips) over the past several years."}
{"text":"Whats not to Love about Zeppes pizza it's delicious. This is one of my go to spots when I want pizza. It's something about Zeppes that I liked. The staff was friendly and catered to our needs. I also get the meat lovers which I think is the best. OVERALL GOOD QUALITY PIZZA"}
{"text":"Great place Stopped here one night right before the closed and order a thin crust pizza, half pep and half Hawaii! The pizza tasted great and the service was very friendly!! The original post about unfriendly people is probably just on bad experience definitely come give this place a try!"}
{"text":"Ahh, Zeppes.  I will give you 2 stars because you sent out a replacement order when our first order was problematic.  Zeppes used to be great.  I used to love their chicken parm....1 large succulent chicken breast, copious amount of sauce, lots of provolone, salad with lots of diced tomatoes and cheese with dressing, and 2 bread twists.  Tonight I received 2 dried out, burned chicken tenders, dried out noodles with almost no sauce, hardly any cheese, no bread twists, no salad dressing, and a salad with a half cherry tomato cut in half and a sprinkling of cheese.  What happened?  The replacement order had the same dried out rubbery chicken strips but they weren't quite so black.  It seems like you guys are cutting corners....with only increases in prices.  Will not be returning."}
{"text":"As a first timer ordering Zeppe's, this was an awful first impression for a delivery to my home that is approximately 1 mile from this location. 16\", XL thin crust doubled over on itself after a lap around the Avon Nuremberg ring. We eat with our eyes first, and this experience was unpleasant upon reaching my tastebuds."}
{"text":"This place has poor customer service. I have ordered from here several times and they always find a way to screw up the order. I only ordered from time to time at this location because there is not many restaurants in this area.Today is that last day I will ever order from them. I had an order delivered to me and something as simple as barbeque wings. When the order was delivered I took the items back to my office and realized there was no barbeque sauce on the wings. I called and they claimed it was as I looked at plain wings. I took a quick break from work to return the wings and the guy looked at them and kept shaking the container around and says \"there's barbeque sauce\" as he continued to shake the wings around to search for it. Then had the nerve to tell me they looked rinsed off. WTF?!!!! I had not eaten anything all day and was at work had them delivered.  Who rinsed them off? Who does that? No business from me ever."}
{"text":"We were also staying at the Fairfield Inn, and we decided to get pizza at Zeppe's. Everything was amazing, but I would definitely recommend the calzones. I feel like the pizza crust has a unique pattern that gives the pizza a different look. In regards to our delivery man, I would say that he was very polite and was a few minutes early. I would like to say that eating Zeppe's pizza was very pleasant, and we will always remember it when we come back to Avon."}
{"text":"Was at home painting one day, can of paint cracked open to the air and this painter needed sustenance so I ordered delivery from Zeppe's!  I had seen their ads in ValPak.  The Samuel Adams battered fish fry was WONDERFUL.  I would've liked a cup of cole slaw but it is not included in the meal and I hadn't thought of it at ordering time.  Also ordered a veggie pizza.  The crust was the zigzag crust they are known for.  Very good, but I think their sauce needs something.  Some type of heat or zing would be good! I broiled some pepperoni I had at home and crumbled it up over the pizza and it added the missing something.  Can't wait to try their entree salads next time.  Their food is very good and arrived ahead of schedule.  Glad to have a Zeppe's in my hometown."}
{"text":"Decided to order since I heard they have a really good gluten free crust.  It was expensive but everything GF is , definitely better than the hut's. I know when I order from them it is going to be expensive compared to others.  We had the Zepperonj roles which were good but not worth the 8.99 for six. Also had a large pepperoni and sausage pizza I enjoyed crust was light and fluffy and was not overly greasy .  My biggest gripe was the pigeon wings we received instead of chicken wings.  They now charge by the lb for their wings I can see why and I would be very surprised if they actually weigh them out. I forgot to take a picture I hit them late after everyone else and there were only a few left. The mild sauce was very good but what a rip off. We had 12 of the smallest wings I have ever seen .   When I told everyone that was a lb nobody could believe it . So we basically paid a buck a piece for pigeon  size wings.  I would go back for the GF pizza but definitely not the wings.  The rest of the items we ate were very good just very expensive."}
{"text":"Nice clean place and reasonable pricing. I really like some of their breadsticks and cinnamon bread... pizza I am okay with. Staff is very helpful and nice too.  It's just a carryout so don't make any plans to sit there and eat. I would definitely recommend it!"}
{"text":"My girlfriend decided to get some pizza. I haven't been had Zeppies in a while . I see now why I haven't. The pizza was like warm when we got it. The driver didn't even have the pizza in a warmer unit !! Forgot the garlic sauce ugh. Then we commenced to eat. It was Nasty!! Will definitely not be going back there no more!! They use to be good now no not at all. Oh and they weigh the wings by the pound so you never know how many wings you will get at any time . 4 thumbs down on them"}
{"text":"Can't say that I'm that impressed, it's pizza and not bad. Today's was exceptionally greasy though. We picked up at this location for the first time and it is in need of some updates. It's a bit rough inside. The full menu wasn't posted and when I asked to see one they just responded they were out... no offer to help me by asking what I was looking for, making suggestions or anything. Our typical order is Zeppe's rolls after heavy drinking and those have always hit the spot in those moments. It's carry out or delivery only. Looks like they may have sales by the slice at times from the warmer they had off to the side"}
{"text":"Very very disappointed with this restaurant. Highland Heights, OH branch.
A group of us ordered lunch to be delivered from here today and long story short... we were told to never call them again, they never wanted to do business with us ever again.
Long story version...
I keep giving them another chance since the food is generally pretty good, but the service is horrendous.  It is the closest one to where we live and it's a 20 minute drive. We will call for pick-up and they tell us 20 to 25 minutes. We will wait about 10 minutes before leaving to give them a full 1/2 hour and we still end up having to wait another 20 minutes. 
Recently a small group of us decided to start using them for delivery at work and they are usually 1/2 hour later than they say they will be there and all the food is cold. Even still, we would give the driver a decent tip, figuring it's not completely his fault.  But today was just the worst ever and the customer service they offer was beyond deplorable. We ordered on-line, they don't have the lunch specials on the website, so the lady that entered the order put a note on the order stating we wanted the lunch specials, not the full meal.  When they delivered, they only brought one thing that was ordered and told us that they didn't understand the note, so they deleted the balance of the order.  We were fine and accepted that, just requested that they make the balance of the order and bring it back.  They did come back, but forget yet more of the food.  They did offer to give us 50% off, so that would have been fine if it had ended there. But the manager ended up calling back and speaking to one of my coworkers and was extremely rude claiming that they have nothing but problems with our company and that she will not do business with us again.  Well, that's fine... but there are aprox 200 employees at our company, that's a lot of people to never serve again.  Thanks Nikki - you are definitely giving a few of us reason to write a review, too bad you couldn't just leave it at giving us a discount and moving on, you would have gotten a good review about customer service even during a bad situation.  I write those too..."}
{"text":"We Love Zeppes pizza!! For a chain they do a great job with consistency & the pies are very tasty!! Another thing I like is they will always help you with specials if you  
Don't have a coupon & they have late hours compared to their competition (that extra hour from 10-11 is a beautiful thing). Zeppes is very good as is the help!! Never had a rude experience yet & the help is xtra friendly!!"}
{"text":"Love their Pizza and service I order at least once a week. They are the BEST PIZZA IN NORTH ROYALTON !!!!"}
{"text":"What's not to love about a pizza place?  It's sort of local and the food is good.  Delivery is fast and there's a great online ordering system.  Nutrition information is nowhere to be found, but maybe I'm better off that way.  Eating the cheese calzone makes me feel guilty because it's so oohey-gooey.  The pizza is great.  The garlic twists are really good, if you like bread-stick types dishes.  I hear the boneless wings are surprisingly good.  Overall, this is a great place to grab a take out dinner.

The thing I don't love is that there seems to be some variance in pricing and menu items.  I'm boring and order literally the same items every time.  Sometimes my salads are small - sometimes they're big.  The same thing happens with my pizza.  And sadly, also with the price.  I've found that when I question my order taker about the difference in price, my order magically ends up being $5 lower.  Hmmm.  I hope the owner eventually catches on to this.  It seems like someone's trying to skim off the top."}
{"text":"It took exactly one hour for our pizza to arrive, and it really wasn't worth the wait. We ordered the extra large pepperoni with the $12 coupon. It came with a $2.50 delivery fee that we weren't told about ahead of time.  The pepperoni and cheese was fine, the sauce okay but a little sweet, but the crust was bready and hard. Overall, a below average pizza, not as good as a home-cooked Giant Eagle frozen pizza would have been."}
{"text":"Ordered some pizza and delivery was quick. The pizza though was not my style. Sauce was sweet and almost metallic tasting. The dough was too soft and cheese left much to be desired. All-in-all I will probably never get their food again. It reminds me of the crappy pizza place in my hometown."}
{"text":"YES PLEASE. Locally this place is the bee's knees for pizza. Savory sauce, well cooked dough, and awesome pizza creations? Sign me up. They put the pie in pizza pie. Seriously. The crust is crimped so it visually look like pie crust."}
{"text":"First things first. Zeppes pizza is ridiculously amazing. Probably the best pizza around. However every time I order from this location it takes 2 hours to deliver to me. And they forget something from my order every time without fail. Can be frustrating and unfortunately this is the only location that delivers to my house."}
{"text":"We ordered two sheet pizzas, and one gluten free pizza for a party on a Sunday.  They delivered perfect pizza, right on time.  The driver was friendly.  I also appreciated how easy it was to order online...everything was fine.  The pizza was very good, much better than other chains, and was hot!  Made planning food for a party effortless.  They also offer subs, sides, pasta and soda.  Also, they included plenty of heavy paper plates, napkins, and forks."}
{"text":"Zeppe's used to be my go-to pizza place but recipe changes & new management has driven my business away for good.

They changed to a thick cut pepperoni. Ick. Pizza pepperoni is supposed to compliment the cheese & crust perfectly. Their pepperoni is the only thing you taste on the pizza. 

Their prices are too high & you don't get nearly enough for your money. 

They get 2 stars because the teenager who took my order was so polite and tried very hard to be accommodating....until the owner took over. 

Bottom line: There are too many other great pizza places in the city to waste time on this one! Try Antonio's across the street by Marc's or Coleone's in downtown Avon."}
{"text":"Ordered a family sized pepperoni pizza, 1 lbs of boneless wings, garlic twists, and a 2 liter of Pepsi. Delivery was slow and took over an hour. Pizza was luke warm but tasty nonetheless. Wings were a little soggy and there wasn't much sauce or flavor. Not sure we would order from them again."}
{"text":"The food is good, but delivery can be slow. The wings needed more sauce, but my son ate them. The staff is always very nice and friendly
 We have had a few computer glitches where the system lost our order, but the manager made our order fast and gave us a discount. With all the other places in the area, Zeppe's always keeps up with the compatition with quality and great service."}
{"text":"Great food, great customer service so friendly I will absolutely be coming back. The new margherita pizza is my absolute favorite. The new owner is really nice and helpful."}
{"text":"I never write reviews. I just wanted to say how incredible I think this location has become. The past few months have been better than ever ( new management maybe?)... I order for my family a few times a month, and we are impressed every time. The employees who take the order over the phone are always extremely nice, the food is always fast, hot, and good. Thanks to the employees and management, we appreciate you !!!!"}
{"text":"Pizza was decent.
Online ordering had some trouble.
Debit machine wasn't working and I had to leave and go to the bank for money"}
{"text":"Had my family over for dinner we got pizza and pasta salads the works me and my family were extremely impressed the shrimp scampi pasta was delicious  I never write reviews but I just had to give them a big thumbs up"}
{"text":"We were staying at the Fairfield Inn and called Zeppes for a delivery. Our order came on time."}
{"text":"Good food I love the wings and the pizza is pretty decent for a chain store great specials too"}
{"text":"The pizza was terrible. The toppings seemed tossed on and quality was not good.  With a verity of pizza places in the area I would try someplace else."}
