{"text":"Apparently the Zhe Er restaurant at Kennedy Square next to Moji has been here for 6 months and replaced the old vermicelli restaurant. Never noticed it before so decided to give the place a try. The restaurant specializes in Qingdao/TsingTao style cuisine. The servers were extremely friendly and helpful, the food came quickly, and best of all, the food is good and reasonably priced.  We ordered the pork bone soup with black fungus and winter melon. Very meaty and delicious. Very similar to the Korean pork bone soup minus the heat.  The Tsing Dao style fried clams was also very tasty, although on the slightly saltier side and a few were sandy. But still plenty of clams and delicious.   The abalone was quite small but of excellent quality. Came still in the shell and was quite tender, so I assume it was frozen and not the dehydrated type.  The house style cooked butter fish was the only dish I didn't particularly enjoy because it was too salty for my taste. The fish itself was decent, but the soy sauce was too over-powering. Guess this is typical with northern-style Chinese cuisine.   Finally, the house style eggplant was awesome! They are basically eggplant french fries! Crispy on the outside, soft on the inside, and covered in a slightly sweet and tangy sauce. This was the first time I've had eggplant cooked like this and it was delicious!   Overall, really enjoyed this place and was much better than I was expecting. Will definitely come back to try some other menu items."}
{"text":"So good to have the food taste from my hometown! Probably the first Qingdao restaurant in GTA? The food tastes very much like Qingdao local lol, like it a lot!"}
{"text":"This is one of the hardest reviews I have ever written.  It is because not only I am not knowledgeable about Tsing Tao cuisine, its characteristics, its flavor profiles and its specialties, but also because I cannot truthfully say I enjoyed the food.  The hard decision is how I should frame this review.  What I like -  - It is home style cooking.  It looks like and smells like food that comes out a home kitchen. It resonates with the Chinese slogan on a front window \"in the wind and rain, we wait for you here\".  Homey.  - It tastes bold, no matter it is saltiness, sweetness, sourness or spiciness.  I don't know if it is a characteristic of this cuisine, or if it is just the style of the chef  - The portion is large relatively speaking.  3 people only need 2 dinner dishes.  Mind you the plating looks small, because the plates are deep  What I don't like -  - It actually tastes way too bold to me.  Is more really more?  Then again, it can be because I am not used to this flavor profiles  There were other customers during my visit.  They looked like families and college students.  It could be because the food reminded them of homes."}
