{"text":"The pasta and meatballs I got was okay, and the portion was okay. There was a large spill of something sticky at the table and floor where I first went to sit. Overall just okay."}
{"text":"I heard about it, and tried finding it a couple of times.  Unfortunately the place is gone.  There is a bakery in it's place."}
{"text":"I HEART ZOULPY!  This place is a happy place. A lovely, friendly, busy emporium of diner delights and greasy spoons. You'll fall in love with the owner and staff as soon as you approach the counter.  They'll make you whatever you want. The menu is posted above the grill and the specials updated daily on the blackboard. Their homemade soups are delicious and make you feel like you just came home after tobogganing with your older brother. Hearty. Warm. Savoury...  Zoulpy's will get some badass lineups during business day lunch hours, but it's worth the wait if you've got the time. It's also the perfect spot for a hangover-cure brekkie where the coffee's hot and there's always a newspaper lying around. And hey- you can have a beer with that too!"}
{"text":"Firstly, let me say the following sentence is completely my opinion and is not bound to any fact or research at all.  This place must be a mob front.  It has to be.  Without question.  Why?  There is absolutely no way that they can serve up the food that they do, in the enormous portions that they are, and turn any sort of profit.  When you're working for the theatre and you're on a small dime, you look for any sort of discounts that you can.  Zoupy's became a place that you'd go to gorge.  A true to form deli, it appears to be family owned and you've got mom's behind the counter that do NOT want you to go hungry.  Ordering a smoked meat sandwich, though tasty, could for the more modest appetite be split with a person.  This is especially true if you are to get a side of fries that comes out like a side-of-beef-of-fries.  Read \"big\".  The food is extremely tasty and they have daily specials that are always big on size and flavour.  Do yourself this favour.  Even if you're going to eat the food there, get it to go.  That way you can at least when you realize that the eyes-stomach ratio is not going in your favour, pack up the spoils and take it home with you."}
