{"text":"At 5 pm today I went to the Oakville location for my first (and last) ever Zoup experience. I am feeling a little under the weather, so I thought a nice bowl of soup would be the best thing. When I arrived, the unenthusiastic teenager they had working the Frontline offered to let me taste test any of their soups before purchasing. On my second spoonful (testing the butternut squash soup) I had to immediately spit back up the soup ad it SCALDED my lips and tongue- I cried out in pain and tears filled my eyes. I informed the employee that the soup was far too hot to serve, he turned to his Co worker and asked if the soups had been checked for temperature yet today...to which she replied \"I don't know.\" When  this employee went to check the temperature of the soup I had just been given, he said \"oh, it's 171 degrees F\" Ummmmmm are you people trying to take my skin off? Are you asking for a lawsuit? And after all that, I was offered a lazy \"uh...sorry?\" And only after I reiterated to the staff how badly I was hurt. I wanted to purchase soup so I joked that maybe I should wait an hour for the soup to be cool and for my tongue to heal, then when I went to pay my debit card was giving trouble going through. I got frustrated and left. They could have at least offered the soup to me for free considering the quite literal pain and suffering they put me through. 171 degrees. Unbelievable. You need to train your staff properly before someone gets seriously hurt! 
Oh and by the way, it is 2 and a half hours later and I still can't enjoy my own dinner before my mouth feels like it had 3rd degree burns in it. Seriously, I can feel shreds of loose skin in my mouth.

THANKS ZOUPS next time I will make my own"}
{"text":"I love, love, love the soup selection at of soups, sandwiches and salad at Zoup, but I have one major complaint.... if you go at lunch time there's NEVER a place to sit. This Zoup is very small. But really that my only complaint about this place. I really do like the fact that they allow you to sample any soup to aid making a soup selection. I also love that they serve warm wheat or white rolls."}
{"text":"Zouped! Couldn't wait to go there mostly b/c of the gluten free offerings. Had the tomato soup-and selected a salad. The very nice young man at the counter was aware of gluten issues then the girl put FLOUR tortillas on my salad. Employees need more training if you are offering these kind of specialties. The soup was less than good, the salad was like something out of a vending machine. Very awful. And I got hardly any change from my $10 bill. My companion had tomato soup and toasted cheese. Vending machine quality as well, maybe. They upsized my soup for a 99 cent fee without even asking, so I ended up with alot of bad soup. Don't waste your hard earned money for mediocre food. We both had diarrhea and gassy stomachs all night. (Gluten free????)"}
{"text":"I've never been in here yet! But my sister got me a Turkey sandwich from here and it was very good. I forgot whats the name of the sandwich! The bread was super fresh and tasty. The turkey was flavourful, and the sauce they used complimented the whole thing along with the cheese! I would love to stop by and try their soups!"}
{"text":"I wish I could give this place less than one star.  Was in on a Saturday,  they are technically open however they are telling all new customers they are closed.  Apparently the evening staff failed to prep soup for the next day so this location basically has no food ready for consumption.  Just ordered soup and salad and the two completely incompetent staff members can't seem to get it right."}
{"text":"Zoup has a large variety of soups on a daily rotation.  Soup was delicious and warm.  I got the Mushroom Bisque and throughly enjoyed it.  I ate a combo with the a pesto sandwich which was nice but not as good as the soup.
Service was fast making this an excellent lunch break stop."}
{"text":"My wife and I tried out Zoup today for lunch which we were excited about trying since it just opened. It was a toss up on either trying this place out or going to the good old tried and true Panera's, also in Points East Plaza. We both tried the soup and sandwich combo for $8 a head. Add another $2 for a drink and tax, your up to $12 per person for \"fast casual\". You can eat at any sit down restaurant for lunch for that type of money which is why I think Zoup is way out of its value proposition. I had the chic and dumpling soup which was basically Campbell's out of a can, good but nothing special. The sourdough bread which comes with it tasted like someone having fun with a box of bisquick, dense and tasteless. I also had the southwestern Turkey sandwich which consisted of three pieces of razor thin turkey, pepper jack cheese, and a tomato on a roll. My wife had a salad and chic fajita soup which was broth, tortilla strips, and so much cheese it was pretty much un-eatable. 

If this place charged $5 or $6 for a combo with a drink included, it probably would not be bad for the money but for this much, I will go to Panera all day long or go to a normal sit down restaurant. 

R.I.P Zoup. With your rich prices, I think your days are numbered. Meanwhile, I don't think the folks over at Panera are too worried about you taking much of any market share."}
{"text":"Wow! Delicious....The Collard Green Chicken Barley soup is delicious as well as the Chicken Potpie!!! We need one of these locations in Charlotte NC. ;)"}
{"text":"For a quick, convenient, healthy option, this is definitely 5 stars. The owner is fully engaged and excited to offer so many great soups!"}
{"text":"Stop in for lunch and glad I came. Great selection of soups, salads, and sandwiches. They let you sample the soup selection before ordering which was fantastic because they have a wide variety from chili to seafood chowder. I did the soup and sandwich combo. They give you more food than Panera does and taste better too. The service was fast. I definitely recommend stopping in."}
{"text":"Good rotating menu of soups. Their spicy soups dont have enough kick. I am not a person that wants my mouth on fire, just want the flavor. Just something like Chicken Tortilla Soup just doesnt have enough heat. 

But its a good place to grab a soup and sandwich on the go. They could expand their sandwich options, but it is call Zoup! not Zandwich!"}
{"text":"I got a small soup and half salad for $12. The bean soup was very mediocre. The quinoa salad was so disappointing with minimal ingredients and lots of lettuce. Overall, the food was not flavourful and the value was poor."}
{"text":"Prices are comparable to Panera in my opinion. Food was decent, employees were friendly. Place was very clean. I had the chicken pot pie soup which was pretty good, wish I would have taken them up on the sample offer. I had the turkey club sandwich which actually kinda looked like someone stepped on it, not sure if it was the way it was pressed or grilled? Would have been better with some lettuce on it. I will be back to try some other options."}
{"text":"I forgot a sandwich here a couple weeks ago and they called me and offered to bring the sandwich out to my work...  Great service here!!"}
{"text":"They absolutely get Good soup but I don't think they got very good sandwich at least not good four cheese melt sandwich. I got chicken pot pie soup that was delicious. Definitely will come back for the Soup."}
{"text":"Delicious soups!  Innovative and unique flavorings that easily surpass other eateries of similar types.  Sandwiches and salads are also better than offerings at other places.  Friendly and efficient staff."}
{"text":"Was a little bit disappointed in my meal. I ordered one of the new soups and was slightly astonished at the small portions and poor quality. The bread tasted stale and the soup was okay, nothing special. I rather stick to Panera instead!"}
{"text":"Yum!!!! Staff is so friendly and the soups are fresh and delicious.  Think I only have a few left to try!   Half sandwich and soup is great combo as its a good price and plenty of food.   Really clean restaurant and love the convenience!"}
{"text":"I'm going to be a little big headed and say I'm a zoup expert! I've been eating here for years, the first one opened in Solon awhile ago. I always get the chicken pot pie. I have had their sandwiches too.  Never once have they let me down. I am obsessed with soup year round and make reasons to be able to go here. A quality place will let you taste what they have before ordering. Here you can taste a spoonful of every soup before ordering! It does make deciding a little more difficult! Haha definitely eat here!"}
{"text":"I was actually quite impressed with Zoup. The lobster bisque and mac and cheese soup was delicious!"}
{"text":"I stumbled into Zoup for the first time a few weeks ago because I wanted something quick and didn't feel like spending big $ like every other place at Crocker.  Since then I have been back about 5 times!  I took my husband, and my brother and both are now big fans.  The employees are always really friendly, and they offer samples of the soup before you buy it.  The chicken pot pie soup is AMAZING, thee ingredients are good quality.  The only down side in my opinion is the bread they give you on the side, it's very bland.  They have a great looking salad menu, although I can't seem to part with the soup and the MTB sandwich!"}
{"text":"It's a blustery, cold day in downtown Cleveland, and the only relief I could think of was a piping hot bowl of soup.  So I headed back to Zoup and man am I glad I did!  I tried the Pumpkin Pie Bisque and it was quite possibly the best soup I've ever had in my life.  It was creamy and delicious and had the right blend of sweet and savory.  If not for the humiliation of my friend Jamie, I probably would've licked the container clean.

I also ventured even further from my usual order and tried one of their combos -- so much food!  Definitely puts Panera to shame, and I love me some Panera.  The salad greens were crispy and fresh, and, well you already know how I feel about my soup selection.  I capped my meal off with a fresh roll and a pop and now I feel like I could pass out at my desk from sheer contention and utter fullness.

Be sure to get yourself to Zoup before the Pumpkin Pie Bisque is gone.  You'll never be able to forgive yourself if you miss it."}
{"text":"First time customer. Delicious soup and bread tastes fresh! I like ability to sample soups. This place gives panera a run for their money!"}
{"text":"Zoup was OK, as we wanted quick & easy. I would not recommend,due to service. Cashier had an attitude, due to the fact that she could not get the order correct. Soup was similar to what I buy at Sams or Costco, really good, simply warm & serve. My grilled cheese was not grilled. but it was cheese.
Pricey
Best of luck to all"}
{"text":"This place is great! I think it's awesome that they let you sample soups before you order. I got the chicken pot pie soup and the southwest turkey combo. Both were delicious and filling. Next time I will try the tomato bisque soup which was also delicious!"}
{"text":"I have been anticipating the opening of zoup! in Strongsville for some time. Today was my first visit and it did not disappoint. I was greeted with a warm welcome and explained the details of the menu. Without any explanation for example, I wouldn't have known you can sample any soup or that there are 12 different soups everyday! It was nice being educated on the menu because I wasn't left standing with no guidance. 

The food was great. I did the combo and thought it was a great value for your buck. The half sandwich size was above average & the chicken curry soup was better than expected. Go check it out!"}
{"text":"Great salad great soup. Everything taste really fresh. Very well-prepared. Your servers were very helpful very nice. My only compliant with all the snow!"}
{"text":"Zoup! It sounds sorta like Soup!, which is served here ice cream parlor-style (complete with the samples).

To me, the atmosphere is modeled after Panera or Atlanta bread. The restaurant was clean and comfortable--several other diners were hanging around with their laptops.

Although the service was speedy, it did not come across as friendly. I felt like I was being sped along in a way reminiscent of a Seinfeld character.

And for the soup itself... it was one step above Campbell's, as far as I could tell. My pea soup was chalky and dull, and my wife's lobster bisque had a familiar flavor I couldn't put my finger on until the drive home: Egg nog!"}
{"text":"This place is ok. Nothing was bad,  nothing wowed me. All tasted like stuff I'd make at home."}
{"text":"Husband and I needed to grab dinner and decided to give Zoup a try. It has been in the complex for a while now and we wanted to try a new place. We were immediately greeted by a gentleman from behind the counter with a big smile. He asked if we had been there before and of course we hadn't. So he ran us down the menu and told us to take our time and let him know if we wanted to try the soup. I tried the roasted tomato and brown rice soup...AMAZING! So I ended up getting that and the power salad. My husband ordered the lobster bisque and a Cesar salad. The gentleman who made our food was super friendly and had us engaged the entire time he made our food. He even included the catering menu for us  for our works. 

We took our meal home and dived right in. I ended up filling up on the soup and warm bread roll and saved the salad for lunch the next day. My husband ate the whole meal in silence, meaning he gave it a thumps up. 

We will be coming back again for the great food and friendly service. We are also considering  having them cater for our large family event at the end of the summer. They delivery for free!"}
{"text":"I can respect a manager who is right up front working with the rest of the crew & never forgets a face. He also remembers what our favorites are & what we haven't tried yet. 

Top that off with enough of a variety of soups, sandwiches and salads to accommodate any dietary need/style, and you have a great lunch option that will please everyone in your group.  I would choose this place over Arby's, Chipotle, Burger King or any of the other options in the area."}
{"text":"This was my second visit to Zoup, and the first one to this location. After visiting Zoup years ago at its first location in Waterloo, I ordered a cup of veggie soup that I thought was just-ok. Something a grade above canned zoup, and suitable on a cold winter day.

I decided to give Zoup another chance today with my coworkers at its location in Richmond Hill. Overall the staff were friendly and efficient. It was nice to try all of the soups before deciding which one to settle on.

I opted for the lentil and sausage soup since it had the most flavour of the other options - and also wasn't thickened with an absurd amount of flour (I'm looking at you Chicken Pot Pie and Lobster Bisque). It stated it was 'spicy' but wasn't really spicy at all. There were also huge chunks of garlic and mushroom in the soup that made it a little unpleasant - there wen't any in the sample and I didnt realize this until after the fact. 

As for the combo, this is where things turned into a bit of a disaster. I ordered a the soup in the Pick Two combo with a grilled cheese melt. What I got in my Zoup bag was far from acceptable. Firstly the cup of soup was a paltry 8oz, and lukewarm, and then the 'sandwich' itself was basically a tiny white roll microwaved with maybe - and I mean maybe - 2tbsp of shredded cheese mix on the inside. Not crispy, not cheesy, not toasted, not hot, just mushy. For $11 dollars with tax the value of this combo was unacceptable. The cheese 'thing' was chewy and tasted processed and was a sorry excuse for a side sandwich. I took a bite and threw the rest out. If I was the franchise owner and saw something like that leaving the kitchen I would be shocked. 

And yet again, as it was in Waterloo, the soup wasn't really even that outstanding. Soups should be outstanding at a place that is called Zoup. I get that it is a franchise, but I've had better soups and sandwiches at Panera and Fresh Fusion for the same price point. And yes, even Tim Horton's soup and sandwiches are better than Zoup, and also half the price.

I left feeling disappointed again, and won't be returning."}
{"text":"Service was excellent.  The shop was very clean, and the staff were friendly. They offered free samples of any soup I might like to try before ordering. I ordered two soups (had a coupon for one free) and two sandwiches, and they had no problem changing the sandwiches to my requirements.  With the coupon, I felt the pricing was good, and the food was tasty. We had the chicken pot pie soup  with French bread (the server said she thought it was the softest of the choices when I asked) and liked it enough that we would order it again, and try some others.  I will go there again, but I think without a coupon it would be a bit pricey, so I would probably wait for one.  This is the only reason I did not give them five stars was the sandwich prep person did touch the microwave with the same gloves on that handled the food, and then handled the food again.  It is hard for servers at any shop to remember not to touch other surfaces when handling food, and a microwave is not the worst surface to err with, so I mention it only because it is a small area that could use improvement. I wish I could have given them a 4.9 based on everything else."}
{"text":"I admit I wasn't all that excited about going to a soup and sandwich place and when we got there it was packed. Naturally I thought even less of being there. 
I chose to endure and I was very surprised how quickly the line moved. The staff was very friendly and offered to give us a test of anything thing we wanted. My daughter tried the tomato soup, I took a small taste. It was very good. I chose the Try two combo, a safe choice of turkey club and a cup of the chicken pot pie soup. Wow! Both items were fantastic! This place has moved on to my preferred list. The food and service is great even if you don't care much for soup. I'm sure you'll be happy with whatever you get."}
{"text":"I wish there were more Zoups like this across he Cleveland area. We need one of these downtown! Good food and courteous people. This place gets busy at lunch... Usually a line out the door. (Be careful, they can run lonnnng during that time of day)"}
{"text":"The food was pretty good, but the service could be friendlier.  I also thought that it was a bit overpriced for what the food was."}
{"text":"I went in around 4:30 in the afternoon. So store was mostly empty. Staff was friendly and helpful. Sampled a few soups, the chicken pot pie and chicken and wild rice seemed kind of thin to me. Settled on the cheddar potato. Flavor was pretty good, but had a very grainy texture. Cheddar was defiantly of the powdered variety."}
{"text":"This is a great restaurant for a bowl of soup. The interior is modern and clean, with plenty of seating. They have approximately 100 kinds of soup which are rotated weekly. You can sample any soups that you like, which is a great way to decide your favorite before you make a purchase. This week's choices included Lobster Bisque (very tasty with chunks of meat), a creamy chicken wild rice medley (loaded with meat and veggies and rice), chicken dumpling (small dumplings but a pleasing flavor), and macaroni and cheese soup (very rich and cheesy-packed with noodles).  There are 4 different sizes of soup sure to fit the appetites of everyone from young children to starving teens to weight conscious adults. Each soup comes with your choice of sour dough, wheat, or a French bread roll.  The rolls are fresh and have a nice crusty outside. Other soups that sounded interesting today included a sirloin chili soup and seafood chowder. They also offer a selection of sandwiches and salads. Both times I have been here the staff have been friendly and polite. This is definitely a spot I'll be returning to soon."}
{"text":"They have 12 different rotating soups every day. You can sample as many as you like. I had a delicious carrot and ginger soup. You will find traditional soups as well as various gluten free and vegetarian options. They also have a variety of salads and sandwiches. Staff are super friendly. All in all, a welcome addition to Greenway."}
{"text":"This is my second review because I really like this place.  Zoup is hands down my favorite place for lunch. The food is always really good and I love that there is always something for everyone. Every day there are options for all dietary needs like gluten free and vegetarian. They also have hearty options and this makes my diverse group of friends happy.   As good as the food is it isn't the best part. Zoup is warm and cozy with the friendliest staff ever. They are always happy to answer any questions I have and they chat with me as well. I never feel like a number. Maybe it's because they are locally owned.  You can tell everybody cares. The owner is super sweet and even has her kids working there. Way to go Zoup. Thanks  for being a healthy and friendly lunch and dinner place to go."}
{"text":"Went for lunch today....long line and long wait (10 min.), but was worth it, the food was great and healthy!!"}
{"text":"Love, love, love Zoup - wish there was one closer to my home.  The chicken pot pie soup is amazing and so are most of the others I've tried.  Sandwiches and salads are also good.  Set-up there is similar to that of Panera.  Yum."}
{"text":"Love this place. This Zoup is not just great food, but excellent service, clean atmosphere, and awesome employees.  The food is always fresh and served quickly. It's a great lunch spot, but I love taking it home for dinner."}
{"text":"Clean, efficient and delicious. Great healthy options, nice portions, and well made. Not slopped together like other places. The workers here seem to take pride in what they do and is shows in the food. Left feeling satisfied and not overly stuffed like I had eatin too much. Perfect lunch portions to make sure you don't go into food coma afterwards. Love having this place in Strongsville."}
{"text":"Love Love Love Zoup!!!!  Always great selection and tasty soups. My only selfish negative comment to report is for them to bring back the Veggie-Terranian sandwich.  Try the Spicy Crab Bisque,  so good."}
{"text":"Apparently my gripes have paid off.  I heard from a coworker that they had some management changes at this location and it's true.  The new people are super friendly and make you want to give them a big hug.  AND the speed of service will no longer require you to take a catnap."}
{"text":"The staff is always very friendly. The soup choices are great. There are often buy one get one free coupons available. The lobster bisque is fantastic."}
{"text":"For a soup and sandwich shop this place is great. The variety of soups available Dailey is impressive for a small location and you don't have to wonder if you will like the soup, you can sample it before you buy. Can't go wrong."}
{"text":"This is an overpriced place that sucks. Cheddar broccoli soup was terrible. Tasted old and I paid 3 times what it should have cost me.  At Bob Evans you could get a whole quart of soup for less than what they charge for a cup at this place and it would taste better. McDonalds soup (when in season) is also better. Wont be back. Warn your friends."}
{"text":"Great selection of homemade style soups and sandwiches. Free samples of all the soups so you know just what you are getting. Good portions, free wifi, and friendly staff."}
{"text":"Not gonna lie.  I drove past this place every day for months and never gave it a second thought.  One day I just decided to pop in to try something new and BOOM... new favorite place!

I usually try a few soup samples and then do the soup and sandwich combo meal.  They always have some new and interesting soups (or some of the classics if you're not feeling to adventurous).

If you haven't tried this place PLEASE do.  Imagine if Panera Bread tasted better, was less expensive, and had more variety... that's what Zoup! is :-P"}
{"text":"Luv they're soups. Fresh homemade. Well worth the cost. I can't stand canned soups. I especially like to buy here in summer as many places don't have soup. On a raining summer day or chilly winters eve - luv these soups. You can sample as many as you like before ordering. Now that's a plus."}
{"text":"Great soup and salad selection. They let you taste the soups if you cant decide. Hot, healthy choices, a great alternative to fast food. Since we were \"first time visitors\" the friendly staff explained their selections. Soup is served in different sizes with choice of bread, multigrain roll was good. We had Rustic Vegetable and Turkey Chili, both delicious, also Greek salad tasty."}
{"text":"Sweet employees! As usual the soups are delicious and the sandwiches are so yummy. Clean location and very specious compared to other Zoups that I've been too. It was empty... We were like the third clients to walk in. Kinda nice to have the place to ourselves nice and quiet."}
{"text":"I'm a soup-a-holic and could easily eat soup everyday for lunch, so when I heard this place was coming to Middleton, I was so excited. After going, it is definitely some place I'd stop back at. Wide variety of food options and all the nutritional info can be found online so looking ahead is always an option. 
No one should get a soup they don't like since they let you sample before you order! Staff was very friendly and you could definitely see them all working hard to get orders out as quick as they could. They were also very patient as a group of us (8) stopped in for lunch and wanted to taste test. Major favorites were lobster bisque, veggie beef, chicken pot pie, and potato.

The lay out of the restaurant was unique and I actually really liked it regardless of what other people have had to say. There are 2 different seating areas. One is more in the \"thick\" of the checkout line. The other one is in the back and was much quieter. It also had a lot of windows and would be a good spot to watch the Middleton traffic. 


2 things I was a little bummed about:
-The price. $7.73 for a bowl of soup and a hunk of multi-grain bread was a little too expensive for me for just lunch, however the other local businesses average over $7 for lunch so Zoup isn't over stretching by any means (IE: Noodles, Jersey Mike's Subs, Panera)
-The soup temperature. We did stop in right when they opened so it may have not had enough time to completely warm up, but my soup wasn't hot enough. Thankfully I took my order to go so I was able to warm it up at work."}
{"text":"Terrible service!!! How long dies it take to ladle out a bowl of Zoup. Answer over 15 minutes. Not including 10 minutes to wait in line to place the order."}
{"text":"It's okay... prices are high but the food was okay. Customer service here is horrible. They need to step up their game if they want to keep this business running."}
{"text":"Lots of choices and samples available. Soup tasted fresh. Great location and space."}
{"text":"I usually order the lobster bisque soup which is fantastic. One of my favorites! Today I decided to go with a salad and I am glad I did. The Loco Burrito salad  was perfect. The dressing was so good. I highly recommend it. The half portion was just right for lunch."}
{"text":"BEST. SOUP. IN. TORONTO. I travel 20 minutes each way to get their lobster bisque even though I pass dozens of soup restaurants en route. Their lobster bisque has big luscious pieces of freshly cooked lobster. Every spoonful you need to chew the delicious lobster. It is incredible! 

The staff are always very friendly as well."}
{"text":"Not bad, not bad at all!

I love soup. I love sandwiches. I also love salads. This gives me no reason to dislike Zoup, unless the food sucks. Which it doesn't. It's not amazing, but it does the job and it's fairly healthy (or at least you can always find a soup selection that fits your specific dietary needs). Selections change daily and can be found on the website. 

Now I need to go to Souper Market and compare."}
{"text":"When I think about robotic establishments, where the servers are really not allowed to have any personality other than \"perky\" and \"shiny\" and \"super-duper helpful,\" Zoup is at the top of that list. (Other places that fit the bill include Sonic, Panera, and Applebee's.  Places that TRY to fit the bill, but where the employees just come off sounding tired and depressed, are Chipotle, McDonald's, and any huge movie theater.) This is NOT a selling point. I don't know why the staff is trained to sound like Ryan Seacrest or someone from the Today show. It's just annoying!

The soup is great. I won't argue that. But in both locations I've been to, I cannot stand to talk to the people behind the counter for more than two minutes!!!

What's wrong with me that I see friendliness and I assume it's fake? Well, I guess I just know bad acting when I see it. You don't have to be emo or super goth or anything. Just be relaxed and normal.

(Oh, and by the way ... I would highly recommend the split pea or the Italian wedding soup with turkey meatballs.)"}
{"text":"I am so happy to see a Zoup in the area ! I have always loved the Chicken Pot Pie soup with the pie crust crumbles added on top. I love that they have a separate line for sampling and ordering. I know that I get impatient sometimes with people asking too many questions and holding up a line. Great idea!

The soups, sandwiches and salads are all very affordable with nothing reaching over $8 (that I saw). I have only ever had the soup and a new favorite would have to be the Spicy Chicken Enchilada. 

*Make sure to get a punch card*

Welcome to the neighborhood Zoup!"}
{"text":"I used to live right next to Zoup. And I have to say - I'm not really a soup person. But Zoup changed that. I found myself dropping in there more and more, because I just couldn't get enough.

They have 12 different soups for you to choose from. And it's 12 new ones every day (except for 2 that are there all the time - chicken pot pie, and lobster bisque. So I guess that's 10 new ones, not 12). They have over 100 different recipes that they go through, so the variety is fantastic.

Besides soups, they have salads and sandwiches. But those are pretty ordinary. Their soups, however, are extraordinary.

I even got to like Zoup so much, I sent a bunch of my clients, and friends, there, and Zoup even catered my housewarming party.

The only reason I didn't give them 5 stars is the wait times. If you come during lunch, they can be quite lengthy - as much as 10-15 minutes.

But if you go for dinner, it's usually pretty empty, and your food is ready very quickly."}
{"text":"I finally went to Zoup the other day and was definitely sold! I had the corn crab chowder and it was fantastic! I wasn't super hungry, so I wasn't tempted by the sandwiches or a combo, but I always have room for soup! They really stress the sampling, so feel free and go to town, though I only tried one and my mind was made up. I can't wait to go back and just keep trying!"}
{"text":"I would have given 4 but my recent visit made me to chop one off. I think I visited this place thrice, I always had good vegetarian options and their breads were fresh and awesome, but in my recent visit, it was a late lunch, I did not liked any of their vegetarian soups and their breads were not at all fresh, so I am rating 3. I like their Soups & Breads. Service is not that great."}
{"text":"Please don't waste your money here. My husband and I each ordered soup and salad, all of which were nearly inedible! The chicken Greek wrap had a strange taste and the soups were so salty that we could only eat a few bites. We spent nearly $30 and ended up throwing nearly all of it in the trash."}
{"text":"I still really like the idea of Zoup and it's convenient for me, but I've had some bad experiences recently. A lot of it has to do with the actual food, which is unfortunate. i'm not sure if it's just me, but my last two attempts to eat salad here have destroyed my digestive system (sorry, that's the least graphic way I could put it...). I think I may need to either stick with soup or Souper Market, as their soups and salads are nothing but delicious. Since those bad experiences, I've avoided the place and honestly don't really miss it. Sorry, Zoup, you probably won't be seeing me again any time soon."}
{"text":"I would give this a 3 star for the soup but the sandwich barely had anything in it and the service was the WORST. There were 2 ladies who rolled their eyes at us while we were deciding our order and it took literally 10 seconds.. The owner is even rude. Every other location is awesome, this one is horrible."}
{"text":"I used to love zoup, but lately it's just meh. Under seasoned and bland. The service was super friendly though."}
{"text":"Unhappy w/ the oriental man who shouted
Hey guys hows it going? There was my teenage daughter and I. Granted she may have been dressed like a boy.(shes a hockey player and they don't  wear makeup and like to dress casual but she had a long ponytail and a hat on. The man again said can I start you Guys out with something? I said this is my daughter in case u hadn't noticed. Unfazed, he said what can I get you today? No apology. Of course now my daughter doesn't want to eat there. At that point I should have left.
But no, I had enjoyed Zoup in my area and was hungry so I ordered a quinoa wrap to go. Wrap itself was ok but rice was hard, avacado tasted old and veggies didnt taste right. Big mistake. Should have walked out earlier. Cant say I recommend this place. Food not fresh & customer service? Well when you cant determine the sex or ur customer and dont apologize when informed of your mistake, well game over. Ill still patronize Zoup in my area but not here."}
{"text":"I like that you can taste whatever zoup you want. Just ask!"}
{"text":"Good selection daily of soups, you should check the website out before you head there to see what they have available and if it suits your taste.   Be careful though as some of the soups can be fairly high in caloric count.   I used to get their tuna sandwich when I ate fish, they put capers in the tuna and it gives it a great flavor.   I would get a soup and half a tuna sandwich and that was usually a very satisfying lunch.   Now I stick to the soup and the nice hunk of bread you can get with it.   

They are great about letting you taste stuff prior to ordering it and the service at this location is good.   The dining room is clean, and maintained and the staff is friendly I have no complaints about this place and it is one of my regular stops for lunch in the area, along with Dibella's subs.

Check them out if soup is your thing, I recommend them."}
{"text":"My first visit to Zoup the staff was super friendly. They explained the menu and gave samples of any soup to try. I had the Cobb salad and their signature lobster bisque. Tasted fresh and delicious. One of my new lunch destinations."}
{"text":"1.  Good soup.
2.  OK sandwich.
3.  Too expensive.  And again, too expensive.
4.  SLOW service.
5.  Annoying layout and seating options.

And the last time there, one of the dudes behind the counter barked at my colleauge when he tried to return his tray to the counter area when he was done.  \"Hey buddy, the trash is over there.\"  Really dude...come on."}
{"text":"With my two young daughters in tow, we stopped in at Zoup! at 5:30 pm for a quick, light, early dinner before soccer practice. If you've never been to Zoup!, you should know that it's a chain higher end fast food place, next level - maybe like the Chipotle of soup/salad/sandwiches. There are always a great selection of hot, fresh soups and the salad and sandwich game is strong there but this time we got just soup. They have a side order size that is 8 oz, a great size for kids, and three breads to choose from. We had chicken pot pie soup, loaded baked potato and a mushroom bisque. All the soups were great, rich and creamy and lacking the doughy taste you get from some places' creamy soup that is thickened with flour but not cooked long enough kill the flour taste. Each soup was relatively simple and good; hearty, felt homemade and were exactly as advertised. The chicken pot pie soup was homey and hearty, the baked potato was filling and comforting with hints of bacon and vegetables and the mushroom bisque was rich and earthy. The bread was fresh and tasty. My kids are fans of soup, and for three with drinks we had a light, tasty dinner with drinks for less than $20."}
{"text":"I gotta compare Zoup to Panera.  And hands down Panera wins on quality.  Zoup does let you try any soup you want before you order it which is great so there is no buyer's remorse!  A good option but Panera is where it's at for a cup of good soup."}
{"text":"Fantastic soup! I had the chicken pot pie soup and it was delicious. The chicken caesar salad was alright, but I've had better."}
{"text":"Soup is great. Prices are absurd for what you get. This has kept us from coming back $7 for a bowl of soup? Apparently we are not the only ones who feel this way. We were the only ones there during our visit and we frequently go to target and I've never seen a lot of people in the restaurant."}
{"text":"I love zoup because I love soup and quick lunches. I almost always get the chicken pot pie soup and sometimes the melted cheese sandwich. The soup is always really filling- they try to get you to get a bowl (16oz) but I've found the cup (12oz) is always enough even when I'm really hungry."}
{"text":"I would go to Panera 100 times before ever going back to this place. $4.50-5.00 for only 8 oz of soup, and the soup is bland and really just nasty. I've been here several times and I'm always disappointed. You can find better tasting soup from a can and a better tasting sandwich from McDonald's."}
{"text":"Perfect snappy lunch without that icky fastfood guilt. Spicy crab soup and ham sandwich just the thing this frisky 25 degree afternoon"}
{"text":"Zoup, cute name and as you can guess a lot of soup choices.  They have 12 (I believe) soups that go on a  rotating basis, as well as a couple that are always there.  I've had the chili, chicken and rice, & lobster bisque.  Each had a good flavor, not incredibly creamy, which I prefer.  There are a couple different sizes to chose from as well.  They also have a nice sandwich selection, wraps, and salads.  The chicken in the salads doesn't seem as fresh as what I would like, so I skip on that option.  However the wraps I have not picked a bad one yet.  My favorite is the Quinoa and Brown rice wrap, a tangy balsamic vinaigrette, and a lot of veggies, carrots especially. 
They also have Diet Coke, thank you, thank you.  Not a huge Pepsi fan.  
Good, quick stop for lunch! Would recommend"}
{"text":"Zoup is a really decent place to have lunch on winter time, taste-wise is one of the best choices around downtown area. 
You can try the soups before and you can order online to pick up there, so you don't need to wait to get the stuff.

However I think is a little pricey 8.49$ the combo: soup and a small sandwich. And it doesn't really  make you feel full.
If everything were a few $ less I will be there almost every day for sure!"}
{"text":"In comparison to other chain restaurants, the soup at Zoup is pretty good.  They have a lot of interesting flavors.  For a quick-serve format restaurant, the staff is friendly and attentive. There is a lot of deliberate, loud banter between the kitchen and counter staff, which is a fun change of pace.  

They offer a wide variety of soups -- many very interesting -- on their rotating menu.  One thing that I really liked was that they offer small samples and tastes, which is great because of the variety of the flavors that typically would not be found in this area.  For those open to trying some new and unique flavors of soup, the samples will help open doors to some tasty new options.  

Most of the soups had substantial portions of ingredients.  On the down side, some of the broths have an odd gelatin-like consistency to them, which detracts from the overall quality. Also, prices are pretty high for soup.  Prices vary, but in comparison, these are $1-$3/cup higher than the \"high\" end of what diners would pay at other restaurants known for their soups, and full bowls are even more pricey.  Also, the soups were served pretty warm, but I prefer soup to be much served much hotter.  

Zoup is located in a strip mall with a very odd parking lot.  Those with larger vehicles and pickups may have some challenges navigating in and out of parking spots.  

Despite the price and earlier-mentioned quality issues, I will probably eat here somewhat regularly -- mostly because I like soup in general, and want to work my way through some of their unique flavors."}
{"text":"Chicken pot pie soup was the bomb.
Daughter got the roasted garlic chicken kale, which was very tasty"}
{"text":"I really hoped that I would like Zoup....but it was a disappointment both times we went there.
It's basically a soup-focused Panera....which is to say, too much money for institutional food served quickly in a clean place. In total, we've probably sampled six of their soups and each is undistinguished. The salad is meh! The one sandwich we tried was basically so-so. In my mind, it deserves 2 stars because if you need some vittles on a short timetable, you could do worse, but I'd prefer to eat at Bruegger's, which is down a few stores."}
{"text":"Eh. It's okay. The employees were really nice and helpful, but the food wasn't that great. I had a chicken caesar salad with canned chicken and what seemed to be just garlic mayo as a dressing. I also had the Sicilian soup, which was pretty good, but desperately needed more salt. Not worth the $6.xx each. I did get a cookie, though, and it was fabulous. It's nice to have somewhere new to run for lunch/dinner in Southpointe, though. I'll probably be back to try some other soups and a sandwich at some point."}
{"text":"Good and simple concept. They have a couple of soups and salads. Everything looks fresh and clean."}
{"text":"Great service and delicious food. Try any of the chicken sandwiches. This is by far the best Zoup I've visited. The staff was very friendly! Exceeded expectations!! 5 stars!!"}
{"text":"Searching for a quick bite to eat today and we came here for the first time. It's counter-service ordering and I heard them calling folks up when their orders were ready, but ours were brought out to our table which was cool.  I ordered the California chicken salad and it was very nice. Perfect portion, flavorful tuna salad, avocado....all good things. The kids meals seem a little heavy on the bread/crackers and one suggestion would be to offer fruit as a side for the kiddos and adults alike.  I didn't try any of the soups - my family tells me the baked potato soup was \"bacon-ey, cheesey, and potato-ey\" which they were happy about. I thought it looked too thick and a bit congealed but that's just me.  Won't go out of my way to come here again but it's a nice option for fast out and about dining."}
{"text":"Awesome soups! Love the lobster bisque, three pepper chicken and vegetable bounty. The sandwiches and salads are also good. I had the caesar salad and the veggies were all fresh. Fast service and a clean dining area. Happy they opened in my neighborhood!"}
{"text":"I work near by so I have gone in from time to time, as well as ordered food for my staff from there. A while ago I went in and got a cobb salad-the salad was missing some ingredients. A while later I thought i would give it a shot again and this time it was missing the gorgonzola cheese. Since I always drive back to eat at my office I didn't bother driving to get them to fix it.  I get that people will always make mistakes and I typically don't complain but I'm hoping with this review they can be more careful. When someone pays $12 for a salad a few times a week they would like to get at least what they paid for. I called the store back and told them- the young woman was very nice and apologetic and offered me to speak with the manager for a free salad. I am not interested in a free salad or any sort of compensation- I would like to get what I pay for. Won't be going there again or ordering for my company from here."}
{"text":"Obviously if you're not a soup fan, this isn't the place for you.  They do have sandwich and salad options but those are downplayed to the dozen or so soup choices each day.  The soup is really good.  I've been there twice and have done a cup with a sandwich.  

I do feel this is a bit pricy for the atmosphere and type of restaurant it is.  For soup and a sandwich I feel that I like the quality of food at Panera a little better.  Zoup just has more options as far as soup goes.  

This location gets very busy at lunch and the line can get slow.  You'll definitely have to prepare for that.  A good option in this area as there are many restaurants to choose from, just not one I could afford to do on a regular basis."}
{"text":"Not very impressed by the quality of the food. 
Good service, but the food is overpriced and not as good as I had hoped for."}
{"text":"This is simply one of my favorite lunch spots.  This was my first time at this location. Zoup has one of the best Lobster Bisque soups I've ever had.  It can give any seafood restaurant a run for its money!  They have 12 soups daily and you can sample each and every one of them if you'd like to. They also carry salads and sandwiches. The soups are yummy and it's always hard to decide!  My 2 favorites are the lobster bisque and chicken pop pie."}
{"text":"Have been here twice now. This time I had the soup and sandwich. It was the club sandwich. It is prepared slightly differently than what I was expecting and was absolutely delicious. Had their mushroom soup to go with it and was a very satisfying lunch. I will go back again. Highly recommended.

https://www.tripadvisor.ca/ShowUserReviews-g181740-d6728995-r334838480-Zoup-Richmond_Hill_Ontario.html#"}
{"text":"Consistently terrible service, find representation of poor management."}
{"text":"This place seems a little overpriced, but the food is awesome. This location puts other Cleveland locations to shame."}
{"text":"Stopped here for lunch while traveling for work. Came at 1130 was already filling up. I didn't sample any soups, but settled on dill pickle chowder and cheese pesto melt. 

I thought portions were good for $8 lunch. Soup was unique and good and I enjoyed my sandwich. This is clearly a popular lunch spot for the businesses nearby."}
{"text":"Posted online hours of operation on a Saturday was 11:00 am to 8:00pm. Arrived at location and posted on the building was that they closed at 3:00 pm on Saturday. 1 star for poorly managed Internet information."}
{"text":"Upon walking in, I was greeted warmly and with a smile by the soup server behind the bar, Joseph. He offered samples of all the soups, and told us which ones were the bestsellers and which ones he recommended.  All the soups I tried were tasty, I settled on the spicy chicken enchilada. Soup was hot and good, but I was most impressed by the welcoming, attentive staff. There is something to be said about good service, and we definitely received that at Zoup.  Also, prices were reasonable."}
{"text":"I'm normally a Soup Nutsy regular when eating in The Path; however, I was recently hit by a craving for lobster bisque and the Soup Nutsy couldn't deliver. Out of desperation, I decided to try Zoup! in Simcoe Place.
 
Here's the verdict:
 
Lobster bisque lacked the rich flavour I expect of a bisque, contained chewy lobster pieces and had the colour of my Nana's beige wool coat. 

I also decided to try a Greek salad as part of a $10 \"Try Two\" soup and salad combo. The salad had very little feta, few olives and no oregano (blasphemous!), but was heavy on fresh dill (wuh?) and hot banana peppers (just plain bizarre).  

On a positive note, the combo came with a fresh, warm sourdough roll.  I suppose that's something."}
{"text":"I love the food as much as the servise best place ever. Just wish i would remember to bring my punch card ugh"}
{"text":"Lobster Bisque. That is all that needs to be said. Get it.  NOW. It's beyond delicious. I'm shocked by some of the poor reviews. Look, this place is fast/casual not a fancy place at all. In my experience, I find that if you get the SOUP (zoup!) then you can't go wrong. Plus you get to sample ANYTHING before you order. If you don't like the taste on those, you only have yourself to blame."}
{"text":"This place is great. 

We were asked if its our 1st time ordering here, and it was. We then got moved just a tiny bit for one of their representative to explain how things work here. Told us all about their combos and available soup options for today.

Every day they have different soups - soups of the day, and then they have their standard soups which you can get any day. 

They also allow you to sample the soups before you order which is great! I sampled a couple of soups, one of which was supposed to be cold and if I didn't sample, I would never would have known. 

They are a little bit on the pricier side, but their meals even tho small, are very filling!!

I got my meal to go, and it came super quick. What surprised me the most is that they called my name without me mentioning. I guess they get your name off of your credit card if you pay by card. 

*****
Update: I got a \"power quinoa\" salad, and it's the good, but was very disappointed to notice that there was only 3 grains of quinoa in there."}
{"text":"Great idea for a day like today. I LOVE that I can try the zoup of my choice and make sure I like it before I buy it. There is nothing worse than having to play guess with the cook.. Wish the frequency cards lasted all year since I am a frequent zouper. The only thing I don't like is the amount of space around lunch time.. But I understand why."}
{"text":"I like their soup and you can get free samples before you buy.  The soup is a little expensive but the main problem is their menu and pricing is way too complicated.  They need to simplify.  Too many add-ons and combo adjustments based on the kind of soup and size.  So the bill is often incorrect.  But the staff usually gets annoyed when I question it.  So I usually just avoid the place altogether and go to Panera if I'm in the mood for soup."}
{"text":"Came here the other day.. Probably won't be back

Nothing much to say except good service and decent soup. 

Not the best soup, not addictive and definitely not worth it to pay for small soup and half a sandwich that won't keep me full for $12...  For 2 is $20+ tax  ..

Overall decent franchise food if you don't want Panera bread lol."}
{"text":"I have been eagerly anticipating the opening of this new enterprise here in the Greenway Blvd/Greenway Station neighborhood! Apparently quite a few others in the area were too!
Their claim to fame is a daily, rotating menu of 12 proprietary soup flavors but what really sets them apart is that you actually get to taste any of the soups you're interested in before you make a gigantic gastronomic error......that you don't find out about until you're back in your office. A big plus that I well appreciated, as I'm not big on really spicy hot foods (I see no reason to have your eyes water, and your lips go numb, other than to hide poor cooking). So getting to have a taste of the Shrimp and Crawfish Etouffee, which ended up beating out the Chicken Pot Pie soup, before ordering gave them one extra star in my rating!
Your order does come with a mini-loaf of French, Multi-grain, or Sourdough bread, so don't forget to grab some butter as you go through the line.
In addition to soup, they also offer a wide selection of salads and sandwiches, which you can mix-and-match as you prefer, pairing soup & salad, soup & sandwich, or salad & sandwich. Another offering I'm looking forward to down the road is the Boule! Which is whatever flavor soup you want in a sourdough bread bowl. One of my favorites!
The only negative I've had is that they're still working out the kinks and service (especially today) was very slow, especially since the only thing that had to be made for me was the sandwich portion of my order. I give kudo's to management however, as they saw the long line of people and came around handing out cards for a free side of soup! That's the attention to, and appreciation for, customers that anyone wants to see. If that kind of customer service continues, they'll be around for a long time and escape the Greenway \"Black Hole\" that has been the demise of many a decent food establishment there.
I will say that you could probably save yourself more than a couple of minutes by ordering ahead, on-line. You won't be able to get your free taste of soup, but if time is of the essence, then I highly recommend ordering that way. There were a number of pick-ups that came and left while I was waiting my 10 minutes+ in line today.
One last thing to clue you in on. There will be a lot of yelling when the soup or bread is coming out of the kitchen but do not fear! It's not the Soup Nazi denying anyone some great tasting soup. It's just letting staff, and customers, know that fresh, hot soup or bread is making it's way to the serving area and is one step closer to your tummy!"}
{"text":"Delicious soups! I like that we are able to sample before buying. That being said, the prices are a little steep. I stick with the side, or cup of soup so I don't end up spending a ton on a bowl. I also like the chicken burrito salad. One time, they forgot the avacoda and the dressing (which I didn't realize until I was all the way back in my office) So I called, and they promptly sent me a $5 coupon in the mail for another time. I appreciated that a lot. All in all, I like this place a lot"}
{"text":"This is the type of place that the office parks around Greenway really needed. Initially, I was put off by the crazy wait times for an order in the opening weeks (a 30-minute wait for a simple salad and soup, even when ordering ahead of time), but Zoup! has done their very best to get the kinks ironed out as far as that goes. Yay for them and the rest of us too because I really wanted to like this place, since I love soup and I am currently working nearby. The rest of the menu is pretty terrific too. I cannot wait to see what they do for summer (Gazpacho anyone?)"}
{"text":"Om nom nom. I love soup. I seriously love soup. Sometimes I go to Panera or Artisano just for soup,  and when I'm low on options Tim Hortons will suffice in a pinch. So when we happened to be in the area for lunch, I demanded soup. And could not be swayed. So off we went: me, hubs, and our 2 year old.

I should make a note here that Chinese soups are very brothy - usually quite watery but full flavoured, and you mostly drink the soup and leave the meat and veg because all the flavour has been boiled out into the water. Whereas... other soups are thick and chunky with veggies or meats and you eat everything. I crave thick soup every now and then, with diced up veggies and meats that you enjoy all in one spoonful. And that is why I love Zoup. 

With so many soups on rotation, you can pick to whatever your mood is, or you can go with their staple chicken pot pie or lobster bisque. And the best part is the sampling, because it's so hard to decide! They don't rush you, and let you ask as many questions as you want, and check in with you when you're done to make sure you liked it. Plus, with the bread and the little crackers, it's a match in Heaven.

If this place was closer I'd be coming here a lot. It's definitely on the pricier side, but for those who really just want a comfy bowl of warm soup on a rainy day, this is the place to go."}
{"text":"I knew walking in that I should have just left. Most of the soups were not available and the customer service was horrible. No warm welcome, employees playing and laughing, and the place looked dirty. Lesson learned to listen to gut feeling. My soup tasted like crap and the salad  dressing looked old. I didn't even attempt to eat it. This is one of the worst locations I visited and to be honest they should just close the place down."}
{"text":"The crab bisque was soooooooo good! I also had the quinoa salad which was great too. Definitely a nice place for lunch! Nice warm bread too!"}
{"text":"I'm happy to see Madison now has a Zoup!  I have been to a Milwaukee location and loved the soups. The fact they are so eager to offer a soup sample is great. The young man was also very friendly and suggested a soup that I wasn't sure about. Turns out the Thai Curry Chicken was perfect. The soups are also served at a piping hot temp which I love. I'm more of a salad fan and find theirs are a nice light side to their hearty and rich soups. The bread rolls served are also quite nice. Friendly service in a comfortable space. Try it out."}
{"text":"Try the rattlesnake soup. It's actually very good! It honestly has a creamy pepper soup taste...with a bite to it. Get it...bite?? But seriously, it is really good."}
{"text":"Soups here are AMAZING!!! they really taste home made and fresh.  Always a nice variety each day too. Im addicted! I had the creamy chicken rice,  chicken pot pie,  and wedding soup with turkey meatballs amongst others, and theyre all my fave. So incredible.  Salads are also delicious."}
{"text":"I really like this place! I always experience great service! I will continue to eat here! It's worth the money!"}
{"text":"Had never been to a Zoup! but have always wanted to try it. The young man who took our order was wonderful. He explained our options and offered us samples. He was very patient with us - my daughter's friend changed her order a couple of times. He kept assuring us that it was no problem. Our food was delicious. Will definitely return."}
{"text":"Decent food, but a little pricey for what you get. Quick option if you're looking for something in Southpointe. Clean & friendly environment."}
{"text":"Um yeah ok so like I came here, and there were ZERO zebras, elephants, monkeys, not even some squirrels. Just some clam chowder. Which I'll admit was very decent. Still made me look like a real buffoon in front of my date though Zoop. Thankfully I brought my martial arts trophies with me and I was able to charm her with my knowledge of the 8 limbs."}
{"text":"Honestly, you can't go wrong here. They let you sample as many soups as you want so you're sure to find something you like. Add your choice of roll and you've got a yummy lunch or dinner. In addition to soups, they have salads and sandwiches as well. One sandwich worthy of a shout out is their ham and cheese with maple. Sounds a bit odd to put maple mayo on anything but trust, it works."}
{"text":"Soups are good but NEVER very hot in temperature. More like luke warm.  Also I wish they had more gluten free options. It is nice to close to work although.  Employees are friendly."}
{"text":"Great variety of hearty, thick soups that are a meal by itself. Been here twice, great selection each visit.  Come with a choice of different breads. 
 Bit over salted though. Trying out the soups helps you narrow your options. Lots of veggie choices. 
Tip: when ordering a sandwich with your soup, ask them to fill your soup after the sandwich/salad/ wrap is ready. I ended up with a very lukewarm soup by the time my sandwich was prepared."}
{"text":"Checked out the new Zoup! in Mentor for dinner.  Overall not a bad place to stop for something fairly quick...along the same lines as Panera but with less options (more soup choices, less sandwich choices)  They do encourage you to sample the soups for free - as many as you'd like.  I sampled the Hearty Potato & Chicken with Dill - actually was a really good soup.  I decided to go with the Lobster Bisque which is supposed to be the specialty and is served every day (the other soups are different each day)  The soup was 'ok'... I've had better lobster bisque at seafood restaurants.  But, for fast-food soup - not too bad.  The sandwich I chose was the Chicken Toscana.  The chicken was pretty scarce, not many peppers, a little heavy on the onions and not much cheese.  Overall the sandwich was just average.  It took quite a while to get the sandwich put together....hopefully just part of the learning curve since the location hasn't even been open a full week yet.  I did feel it was over priced for the quality - close to 14.00 for a cup of soup and a sandwich.  I'll give it a month or so and try it again.  It certainly won't put Panera out of business.  And, it'll be a good spot to stop for an appetizer while waiting to get into Melt when it opens in the same plaza :)"}
{"text":"I tried the loco burrito salad and cheeseburger royals soup. The salad was great and plenty of toppings. The soup was awesome and plenty burger mixed in."}
{"text":"Love love love zoup! They need to start expanding and opening more locations throughout northeast ohio! Personal favorite: chicken pot pie soup!"}
{"text":"So they have a few soups that are pretty good, and one or two of the sandwiches are pretty good.  I particularly liked the cold cucumber soup they offer only in the summer and the lentil curry(?) soup they rotate in.  The lobster bisque is on point, but really it's so rich that it's only an occasional thing for me.  Most of the other offerings were fairly uninspiring.  For the most part i'm not sure the quality and portion size justifies the expense."}
{"text":"So many selections and the food is so good. They provide samples if you want to try some soups.

Service is good.

Would be nice if they had calories posted. I think i over ate. Good food"}
{"text":"Really good food here.  Lots of choices for soup, salads or sandwiches.  The only thing that bothered me was having to talk to so many employees in the line.  But all the employees are super nice."}
{"text":"We got lunch there last week for the first time. Upon entering, the staff welcomes you and is very friendly. What we really liked about this place is that you can sample any of the numerous assortment of soups that they offer for that day. This is a great way to find something you really like so you can be sure to enjoy your meal. They had many varieties and the soup I had (creamy tomato) was delicious!

We also had our 89 year old father with us, who is now on a strictly blended/pureed diet. We made a special request to get his soup blended and they were happy to accommodate us. That was huge for us and means we'll be back for sure!"}
{"text":"Zoup is a stand out in the fresh, good and healthy food set that should be on everyone's list.

I ventured into this Canonsburg hidden gem with a work associate who knew better than I that I was in store for a hearty and great tasting lunch.  With so many options for lunch who knew that this would be a regular stop when I'm in town.

The soups change daily which is something you don't see to often.  Not to mention that they are all very good.  Hmmm . . . how do I know?, because like many ice cream shops you can get a little taste of any of the soups to see if it meets your palettes desire for the day. Everything from Tomato basil to Southwestern chicken are awesome.  Nice flavors, with a good amount of contents.  So many places say they have soup and you get, well mostly broth.  Not here . . . get ready to have a hearty cup, bowl or whatever size fits your fancy, of good tasting and filling soup.

Now to make it better they have great sandwiches, and you can customize as you see fit.  Want it as a wrap, just ask.  In the mood for a salad instead of a sandwich, you can get that too.  The best part is you can have the best of both worlds by getting a bowl of soup and then adding on a half sandwich or small salad.

You could go to McDonald's or Five Guys but why?  Zoup has a better selection, is better for you and leaves you satisfied every time."}
{"text":"I'm sorry, but this place is horrible!  I've been to Zoup about 6 times in my life,  3  to this location and I won't be going back.  

The soups are overpriced and they all seem to taste the same, very bland, lacks flavor, and very overpriced.  Don't get anything with a cheese base, something does not taste right.  

The Sandwiches are very very small and contain zero substance.  Also, all the breads they have seem to be very bland too.  

If you want real Soup drive East on Detroit  and go to Lehmans Deli."}
{"text":"Contrary to the previous reviewer my experience with service at Zoup! was mediocre at best.  Myself and a colleague got through the order process just fine but then waited while literally everyone that was in the lunch-line behind us was served their food before I finally had to get a little pushy for them to get our food order finished.  Once in our seats we discovered our soups were lukewarm at best and returned them for some warmer fare.

The quality of the food was definitely above average but the lines at lunch were extreme and the available tables, virtually impossible to find.  I would definitely give it another try but I would make sure it wasnt at high noon."}
{"text":"Great place for lunch! They let you try as many soup soups as you would like. They get crowded at lunch so watch what time you go!"}
{"text":"Zoup! This place is a gem, their dedication to customer service makes you feel special. Their menu hides nothing, you know exactly what is in your soup. The staff is knowledgeable enough to completely answer every question. The soups, salads and sandwiches are to die for. That chicken pot pie with extra crust crumbles is number 1 for me. Love this place!"}
{"text":"Not at all impressed with portions for the overcharged price at Zoup.  I recommend the \"mom and pop\" owned Wrap Shack on 306 (across from Kirtland High School) has more fresh overstuffed wraps and big salads for reasonable prices along with soups of the day.  While $4.99 for the soups, you can tell it is home made and a huge portion to fill you up... downfall is you need to call to see what the soups of the day are."}
{"text":"First time tried Zoup, ordered Chicken caesar salad and corn & roasted red pepper soup. Soup is just as normal, but the salad is NOT so fresh at all. The salad is frozen and getting black....From the pics u might have the idea what I was trying to say...."}
{"text":"2nd visit on a lazy snowy Sunday afternoon.  Sampled the chicken pot pie, chicken tortilla, and lobster bisque.  They were all really tasty!

Ordered bowl of lobster bisque and asian salad and chicken pot pie soup combo.  You get a choice of bread ( sour dough, French, or multigrain) but they are all merely okay.  Not even sure if the bun comes with butter as it's just sitting on the tray.  They need a nice flaky biscuit like the type Ravi's offers (hint hint).  

Service is slower than I expected.  They don't seem very organized getting things made and sent out.  Other than that I have no complaints.  Who doesn't like soup on a cold winters day?"}
{"text":"As this is a simple concept, I have kept this review very simple and short. 

I have been here many times because it is a health option to the otherwise greasy food out there. I love their soup and salad deal and is always looking forward to trying the new soups of the day. 

Pros

FREE SAMPLES. I can try as many of the soups as I want. 
Delicious salads and soups

Cons

Some of the soups are too salty (dont get them)"}
{"text":"I really like the concept of this place. I saw they were having a grand opening driving by and my hunger convinced me to stop by after my class at Anytime Fitness. 

I'm not sure when Zoup! opened, but the most confusing thing was where to order. They insist on having you sample at least one soup (zoup?) before ordering, and were friendly and talkative about them as well as the salads and sandwiches. But I was sampling at the same time as the group before and after me, and the order of the line got extremely jumbled. All of the customers were nice about it as no one was in a hurry, so that was fine. 

I ordered a combo with a salad and soup, and after ordering the salad they started making it immediately before hearing my soup order. When I tried to order the soup from someone else (who had asked), I was told to order that part at the other end of the counter, at the register. I did so and paid, but then had to wait longer for my soup! I'm not sure if that was the way it was supposed to work or not--even the employees seemed confused. I'm sure these kinks will get worked out though, and everyone was so friendly. 

I also checked my bag before walking out and noticed it was missing the bread. Went back and told them, a different employee was again confused but I did end up leaving with everything. Sort of an ordeal but it's probably just from opening week! 

I ate everything at home--when I put the small salad on a plate it seemed huge, and I was only able to finish half. The soup, salad, and bread (try two combo) is only 8 dollars. Next time I might just get a cup of soup, or just a salad. Everything was hearty. I liked all of the food (including all of the soups I sampled), except for the chicken in the salad--it wasn't as good as I expected it to be. For the record I got the salad with guacamole and didn't even use the dressing because the guac was so flavorful. I'd get it again but without the chicken.

Apparently they have hundreds of soup options that rotate every day. I'll be back when I want something fast that's not fast food! Zoup! is a chain and I know I've seen it in other places as well. 

To be clear I am not complaining about the people working--they were wonderful! But the ordering process was unclear--are we to order by the food, or at the register? Perhaps no one will ever truly know..."}
{"text":"Surprised that I'm not foursquare mayor here yet. Soups are good. Manager is good. Some younger employees can't handle the busy lunches and that can be frustrating to us customers. Especially when I say which soup I want and end up with something completely different. 

Moral of the story always look at your receipt when they give it to you. 

Everytime I check-in to Zoup on foursquare they message me on Twitter with a simple thanks and sometimes a question or two. I have a lot of respect for a company that stays on top of their social media abilities. Very genuine. 

So back to the soups. Good soups. Lobster bisque and Chicken Pot Pie soup are probably the most popular. Trust me, I go a lot and talk to a lot of people there. I tend to try different soups everytime, and pair it with a cobb salad. 

Good lunch spot for people working and living in the Independence / Rockside area."}
{"text":"Great food, friendly staff, cute, modern, clean restaurant. Free samples of soup before you order. Gluten free options."}
{"text":"We all really liked the place.  The soups we sampled were all pretty tasty and my daughter gave their broccoli cheddar a thumbs up.  

It costs a little more than I expected but hunger was calling and my husband is trying to be healthy.  If we had this in our area, especially in downtown Baltimore, I would probably find myself here often."}
{"text":"Fairly average to me. 

Soup I tried was the Dragon Bowl Noodle soup which tasted like a typical hot n sour on your local chinese lunch buffet. Would probably rate 1/5 if that was the only thing I got.

The sandwich I got was probably the highlight of the meal - Pesto 3-Cheese and saved it from being a total disaster. Service and the location and views out the window were also very great. The restaurant was clean and nice."}
{"text":"FIX YOUR LINES AND EVERYTHING WILL BE FINE.

There are two clear signs posted when ordering food.

1.) If you do not know what you want and want to sample soup, line.

2.) You know your exact order and would not like to waste your time behind people sampling every soup, line.

We came in and immediately went to the #2 line and a worker told us that there is only one line and we had to stand in the #1 sample line no matter what... NEWS to us, been going there for a while. We went to the back of the line and what do you know when I'm up there is some gentleman in the #2 line and lets me in front of him and I asked the cashier if the damn #2 line even exist and she says no so the gentlemen behind me gets very confused and tells us some worker told him the opposite last week.............he goes to the back on the #1 line and this just shows how ridiculous it is. Get your croutons in order Zoup because this wont cut it. 

So idc if we have to stand in the #1 sample line but make it clear and take down the other sign because there are tons of other people that are just as confused.

Thanks

Kobe"}
{"text":"I don't know if the soup was good or not as I threw it away when I got home.  While the girls working that day wore gloves, the big dude in there did not.  He kept wiping his nose with his hands then handling the soup ladles and soup containers.  Unfortunately, he served up my soup to go.  Won't be going back to that location for a long time."}
{"text":"I have been to this location twice so far. Both times I got the combo (your choice of 2 items, either soup, salad or half a sandwich)

The first time I tried the chicken pot pie soup, with a half a chicken sandwich. My second visit, I tried the over stuffed pepper soup and salad. I enjoyed both the combos I have had. 

Their combo is priced about $7, around the same price as the Pick 2 at Panera. 

I like that they let you sample the soups if you can not make up your mind.

The only negative I have is the soup by itself. I think the soup on its own is slightly over priced."}
{"text":"Had a nice bowl of soup today, pepper steak soup, along with an included mini loaf of multi grain bread.  Nice place and atmosphere, workers seemed friendly.  Pricing maybe a bit high, but a good place, will be back."}
{"text":"Singapore Squash soup was AMAZING!!! Hot, robust with a black Pepper zing and home made taste freshness. Bought the \"TRY TWO/make the soup a CUP\" combo and surprisingly I got pretty full after only finishing off the soup and sourdough bread  (in all its fresh, soft squishy glory). 

Disappointed with the Cranberry Goat Cheese salad though-- apple slice garnishes were really brown from oxidization (would prefer no garnish if it can't live up to your FRESHNESS claims.) Luckily,  a generous sprinkling of walnuts, cranberries and goat cheese was its redeeming feature...until I got to the end when a few nuts had that \"starting to turn rancid taste\"!!!

Although it was VERY busy during lunch, staff was generous in doling out samples to those waiting in line to order as well as making sure surfaces were wiped clean.  The wait time was not too bad considering it was their busiest time! 

So I would've given 5 stars for the soup quality, wait times and cleanliness but the salad's brown apple slices and nuts  plus the unfriendly cashier brought it down."}
{"text":"This particular location has gotten better.   I would have previously given it a 2.  The service was previously slow, ingredients were just ok etc.   I met a friend for lunch today and was very surprised.  The restaurant was not crowded at lunch, the staff was very personable and most importantly the food was ok.   My go-to at Zoup is always the Chicken Pot Pie soup which I usually pair with a salad or sandwich.   I did sample the turkey chili today, which was pretty tasty, I would definitely order on a future visit.   Today I ordered the Pot Pie soup and Greek Sandwich wrap.  The soup was pretty good, the sourdough roll was pretty good as well.  Previous visits included day-old, dry sourdough bread.  The Greek wrap was just ok, it was kinda messy and non-descript.  I bit into it and thought that I had the wrong sandwich, tasted like chicken salad instead of a chicken sandwich.   I probably wouldn't order the sandwich again, but all in all I would return at some point."}
{"text":"They absolutely get good soup, I got chicken potpie! It was delicious! But I don't think they have good sandwich. At least not good four cheese melt sandwich. Will come back for soup!"}
{"text":"First time coming here with my mom soup was delicious although their salad wasn't really good, tasted like it was one of those fast food types of salads, service was okay there was a lady there that for uptight with me and my mom because we kept sampling out the soups, my honest opinion for the same price panera bread is a lot better and has better quality :/"}
{"text":"Great place to get soup/salads.  They have rotating soups every day and are very good.  I also love that they let you sample before you buy."}
{"text":"I tried Zoup in Mentor today. Don't be fooled by the name, there is absolutely nothing special about their soups or their sandwiches. Overall it felt like a fast food joint minus the drive-thru(which is probably a good thing, let's not eat soup in our cars, people).
I feel like I've had just as good(not to mention cheaper.... much cheaper) lunches by microwaving a can of Campbell's(or Progresso if you're feeling fancy). The soup was mediocre and not worth the wallet-gouging price they were asking. They certainly don't claim it anywhere but it's obvious that nothing about their soups is \"fresh\". I would wager that it boils down to(get it? \"boils down\"?) shipped-in cans of whatever that might have been prepared 24 hours ago(if we're lucky) soup that gets reheated in the restaurant.
The 'sandwich' was even worse. How a place can so exquisitely ruin a grilled cheese sandwich is beyond me. It tasted (and looked) like it had been microwaved or cooked under heat lamps.
All I wanted was a grilled cheese and tomato soup. Zoup did not deliver a tasty meal and it certainly was not worth eight bucks.
I would not go here again."}
{"text":"Wow.   First time I have been here.  Super clean and impressive dining room and outstanding food.  I had split pea soup and Sammy hammy sandwich.  Very good"}
{"text":"Update: I would love if the salads came with options for mixed greens instead of romaine lettuce!

 I work nearby and absolutely love coming here. I'm treated very well and am immediately greeted and can begin sampling the fresh soups that change every day. Their menu for the day is on their website. They also have a punch card which let's you get a free meal!! I love the healthy options and that you can sample as much as you like. Great healthy and fresh food, lovely service, and very reasonable prices. They also have gluten free, vegetarian, low-fat options and more, and they're all easily distinguishable on the menu which really helps those of use with dietary restrictions.
I always recommend zoup to my coworkers."}
{"text":"We went for lunch and were not entirely happy.  My chicken toscana on a whole grain wrap was hot and grilled nicely.  My soup was tasty but not very warm.  I told an employee and she said she would warm it up.  She put a plastic cover on and went into the kitchen.  When I got it back the lid was all blown up in a bubble and the soup was super hot.  When it cooled I ate it, but had a funny taste in my mouth for an hour later---plastic seepage?!  My husband ordered a tuna on whole grain wrap and grilled, but it was not grilled.  His soup was also not warm enough but he doesn't like to complain--he just won't come back!"}
{"text":"One of my go-to lunch spots. It's a quick walk from my office, and their soups are delicious. My favorite is the lobster bisque, which thankfully they have every day. Love the rotating soup menu! The loco burrito salad is yummy. The pesto 3 cheese sandwich is a great accompaniment to the soup."}
{"text":"I have mixed feelings about Zoup! During my first visit about a month ago, I would have said that this place gives Panera a run for its money. I tried a soup and salad combo, and it was fantastic. I thought the staff people were all super friendly, and the restaurant itself was nice and clean.

During my second visit last week, that all changed. I sampled the dill chowder soup, which tasted burnt/overcooked like it had been sitting for too long. I ended up getting the curry soup, which was quite good. The cashier girl told us, though, that the restaurant could not prepare any salads because it \"ran out,\" yet I watched the man behind her prep a salad at the exact same moment she made that comment. Hmmm ...

She was also really quiet when speaking, didn't try to smile and seemed very uninterested. Somebody slap some enthusiasm into this girl!

Because I was told I couldn't get a salad yet saw a salad being made before my eyes, I opted for the tuna salad sandwich. Once I bit into my tuna salad sandwich, I opened up the sandwich to make sure tuna salad was actually there. Tuna salad was indeed included, but it was smeared on so thinly that I could barely taste anything. I put more jam on my toast, more cheese on my grilled cheese, and more cream cheese on my bagel than the amount of tuna salad that Zoup! puts on its tuna salad sandwich.

I don't know what to think. I really loved Zoup! during my first visit. But my second visit turned everything around."}
{"text":"The only thing that I can think of while i'm out here is that you can do better.   For soup, well its better then wawa's but i still like panera's better.   Its decent soup but again we're not speaking of anything that you couldn't go to the supermarket and heat up yourself.   The price ruins it also as it is expensive.   Keep going and you'll thank me later."}
{"text":"I'd never heard of Zoup! before I visited Middleburg Heights.  Thanks fellow yelpers for the suggestion.  The gal behind the counter was great (Jen?).  She gave me the \"newbie\" lowdown on their soup, salads and the try before you buy samples.  I tried the Mulligatawny and North Indian Lentil soups, both delicious.  Then she told me about their pairs soup 'n salad...I jumped on the option adding a Summer Berry & Mozzarella salad and Cobb salad to the order.  All for under $20, a great deal.  For me one of the best things about this whole experience was that the lettuce didn't have that \"preservative\" taste so many commercially made salads have - even Panera.  I will definitely hit Zoup! any chance I get."}
{"text":"Came here for the first time and got a disappointing Cobb salad. If I wanted a box of lettuce I'd have gone to the grocery store and saved myself $12. I got the full size and  expected the toppings  to be proportionate. It didn't have much chicken at all and had 4 thin slivers of a boiled egg, I had to ration toppings as I ate to avoid a plain bowl of lettuce, it was quite uncomfortable. I didn't realize a full size Cobb salad at Zoup didn't warrant a regular human portion and one whole egg. I was also told they no longer have avacado slices so I had to add the sour watery puree which I was charged for so it can be smeared on top of the dressing containers which for some reason had to be stuffed in the salad box instead of being placed in the bag with the cutlery. To make the meal more disappointing I wasn't served the bread that comes with the salad after being asked to choose between two types of bun. I'll probably just go the freshii next door for tomorrow's salad."}
{"text":"I haven't been to zoup in a number of years. Today I went with a couple of colleagues. They have on average 10-12 soups available daily. I opted for the lobster bisque with half of the greek chicken wrap. First off, if you are in a rush this location around noon is not the place for you. There was quite a line just to order and just as much of a line to get your food. It took about 30 minutes from the time we entered to actually get our food. Despite the hectic pace, staff was friendly. You can try any soups you like prior to making your final selection. Now back to the food. Lobster bisque was tasty. Rich and creamy with large seafood chunks in it. The wrap was meh. Not bad but just ok. Given the dropping temperatures I am likely to drop by this location again, just will come after the lunch rush."}
{"text":"Great service!  We walked in and were warmly greeted.  She explained the selections and offered us samples.  My mom and I both chose the choose 2 combo.  The cobb salad was decent and the lobster bisque was very good.  My favorite part was the warm bread that was served with it.  I would definitely return for a quick lunch."}
{"text":"Loved this place. So many soup choices...hard to select. And the bread was yummy, too. Service was friendly. All items tasted fresh....not sure how they make all those soups fresh daily."}
{"text":"First timer at zoup over here!!

Gonna keep it simple.....staff were friendly and polite. Guy didn't know what BOGO meant, but hey learn something new everyday. The set up in this store is kind of confusing where you are supposed to order. I guess you enter one side to sample and come out the other to order? Idk. 

The food was very good. Flavorful and I like that they change up the menu daily. That's cool, except if you LOVE a flavor you cant go back and get it next day it would seem. Although they seem to resemble one another such as fajita explosion vs over stuffed peppers. Similar. The french bread is to die for. Perfect blend of crispy and soft and I like that they have smart balance butter to go. 

The prices are prettttyyyyyy steep!! If i didnt have the BOGO coupon it would have cost me a pretty penny. $8 for a bowl of soup? yikes. The salad was a good portion too except they forgot my dressing. Thanks goodness I was going home and had dressing there otherwise I would have been even more sad to arrive and find I didnt have dressing. 

I will be back, Its a good healthy option in the area. Hoping they send more coupons in this email sign up every so often and I will be sure to double check my order too!"}
{"text":"Very clean with nice staff.
I had a good sandwich with corn and crab chowder soup and a piece of French bread.
They also have bread bowls.
Only drawback is that it's pricey."}
{"text":"For being brand new, this place is operating fairly effective. It's definitely a quick lunch and go place.  The inside was modern, comfortable, and clean. Someone yelled a welcome to us as soon as we walked in akin to mod pizza or cold stone. The set up isn't entirely intuitive but we figured it out. They encourage you to taste all of the soups and claimed to have over a hundred soups in rotation; although I couldn't find a list of potential of all soups anywhere. I tried the chicken pot pie (delicious), lobster bisque (distinct cream flavor), and settled on chicken dumpling. The broth was rich but the dumplings were gummy. I also got a tuna fish sandwich which was meh. The helping of tuna was miniscule but I liked the lemony caper flavor to it.  It was a little expensive for the serving size and quantity. I'd probably go back for a soup fix in the fall and winter but keep it mainly to a special occasion quick lunch place."}
{"text":"I always go to this location because it's right by work. The soup is always great. I love trying the different kinds they offer. The only thing that bothers me is when I order salads the lettuce is sometimes old. I order wraps some times too. I'm not sure why I get charged for a full wrap when they only come one size. I can order the same wrap and soup and have different bills. Overall it's a good place for lunch and I recommend ordering online if you're going in around 12."}
{"text":"This is my first Zoup experience and I have to say, I should have tried it out sooner! I got the lobster bisque. It was perfectly seasoned. Perfect saltiness and just the slightest hint of heat on the back of the tongue like you would get from old bay seasoning. This is the smoothest cream soup I've ever had. The lobster was very plentiful. You get chunks as well as smaller bits all throughout. And the lobster was tender, not overcooked like I expected. The bread that comes with the soup could use some flavor but I like the chewiness. Overall, great soup! I look forward to trying their others."}
{"text":"Before you eat here I've got something to tell ya; Zoup! is a fast food chain. Go in with this expectation and you'll be fine.

It's a simple concept, offer a dozen different soups at any given time and about half as many salads and sandwiches then paint them with a \"low calorie\" brush and serve them fast casual style. It's the Chipotle/Panera model for the soup/sandwich crowd. They tout their product as \"fresh\" but, given how large this chain is and the level of culinary education that their average employee probably has acquired in his lifetime I have a hard time believing this. Are the soups made from scratch on-site every day? Ummm, no. Is the bread baked in ovens in the back room? Don't think so.

Like others have said before me, it's not terrible. It's just not that good. Their prices are in line with the other fast casual businesses ($5.65 for a cup of soup/$6.95 for an Asian chicken salad) and their layout is basically booths around the perimeter tables in the middle. It's a get 'em in get 'em out joint from beginning to end. To their credit, they do offer free wi-fi (shouldn't everyone?). Our meal consisted of the following:

Mac 'n Cheese Soup: Tastes like canned broccoli cheese soup without the broccoli. The elbow macaroni noodles where a tad gummy.

Turkey Club Sandwich: Not a bad sandwich. Very simple. It's turkey, tomato, swiss cheese, mayo and bacon served warm on toasted ciabatta. Kinda hard to mess this one up.

Asian chicken salad: I tried to find something relatively non-combative to the system so I went with this. Like all fast food chicken it had that fake, rubbery texture with painted on grill marks. Like I was actually hoping it didn't come out of a bag. Silly me. The sesame dressing was sugary but the romaine was fresh and crispy. Nice textural elements from the crispy noodles and almond slivers.

Chicken chili: Holy salt mines. What the hell is it with places and cramming tons of salt into their food. I thought Panera was bad. Once I was able to get past the insane salinity the tomato-based soup (definitely not a chili) wasn't bad. Very little chicken, though, with some low-level heat.

Overall, Zoup! was a bit disappointing. The food is processed, packed with sodium and marketed with misleading nutritional information (numbers shown are for the smallest size of soup, half salads w/o dressing and sodium numbers are conspicuously absent). We stopped in thinking it would be something more than it was. Live and learn.

One more thing, on our visit the guy that took our order was quite pleasant."}
{"text":"On a business trip looking for a light dinner.  This fit the bill.  I had half Asian salad and a side of curry Thai chicken soup.  Both were fresh and delicious.  Salad greens were nice and crispy."}
{"text":"On my lunch break I ran into zoup for a quick lunch , the service was great and the workers were super friendly! So close to work and the best soup around I swear ! Defiantly my go to spot for lunch"}
{"text":"I really like soup and they have a good variety. The employees at this location are very polite. This plaza gets busy around lunch time but the lines move fast. Today I had potato soup. Very good."}
{"text":"This place was excellent. Great service and great food. Bread was fresh and the soup came out perfect temp...didnt have to wait an hour for it to cool down. Best part is you can sample pretty much there whole line up before you order."}
{"text":"Zoup is a great place to grab lunch downtown. Depending on your menu choice, this place can get a bit pricey. I'm fine with that, though, because I enjoy Zoup's quiet cozy atmosphere. Zoup is an escape from the hustle and bustle of other fast casual spots on Euclid (i.e Chipotle, Jimmy Johns...). 
 
The White Chicken Chili is super yummy with just the right amount of spice."}
{"text":"Great restaurant when eating with a group you're not too familiar with. Zoup! Will definitely have something that everyone will leave raving about. Taste-test all hot soups while you wait in line :) They rotate their offerings every day, but a few favorites, like the delectable lobster bisque are available every day. Order online for pickup ready in as little as 15 minutes! Nutritional and dietary info is updated for each location on their website daily. The Loco Burrito salad is fantastic as well, but beware that the \"spicy\" labeling is not used lightly!"}
{"text":"I've only been to one Zoup! in my life, which is this one in Middleburg Heights. I think they should rename this place \"Poup!\" because that is what you will be dong within 4-6 hours of eating here. Also expect to throw up a little in the back of your mouth. Not recommended."}
{"text":"Good hearty place for a variety of well prepared soups.  Avoid the bread bowl and get the bun.   Delicious."}
{"text":"Good spot. Sometimes the soup selection could have more variety though. The place is always very clean and the staff is usually friendly. The best part is that you can look up the soups online daily- and even order online! Definitely need to work on covering all grounds as far as offering sweet, savory, spicy and brothy on a daily basis though."}
{"text":"Stopped in few times for lunch. Soups are hot and fresh and bread is baked fresh. They have a variety of different soups like Mexican chicken with black beans and wild mushroom soup. Pair it with a sandwich and a drink and lunch is 22 bucks for two. They do not serve coffee which I thought was ironic. Convenient location at Cedar and Warrensville ctr."}
{"text":"This was a really great restaurant.  I had the lobster bisque and it was delicious.  I got it with a turkey sandwich and the meal also came with a roll of bread.  It was a good amount of food for the price and everything was delicious!  I love that you can try all the soups before you buy."}
{"text":"Meh
It's national grilled cheese day an I got the pesto tomato an cheese sandwich The cheese wasn't fully melted but cold :(
The one ladie was very friendly an nice letting us taste the soups 
The other one not so much 
So this is why I give it 3 out of 5 not real close to 4"}
{"text":"My kids begged to come back a second day in a row while we were in town. The woman behind the counter recognized us, made lovely conversation with us, then brought tears to my eyes as she took a card out and paid for our meal. Thanks Zoup!"}
{"text":"Since the hunger for soup is not a regular occurrence for me, I find it easily satiated at Zoup. And let's be honest, if you're in Independence and have the craving for a bowl of soup, there aren't too many other great options. 

I find the selection to be ample and the soup to be satisfactory - certainly not life-changing but good enough to keep your tummy warm. You can pretty much taste anything you want so I am often tempted to simply fill myself on samples and leave satisfied without spending a dime... but inevitably my guilt gets the better of me and I buy something. I personally think their chili's are the best thing on the menu. 

I usually end up getting a sandwich and soup but always feel disappointed with the sandwich. Although the sandwiches are fresh, there is nothing about them to make you want more. I end up justifying the purchase by telling myself that I am required to get a sandwich to soak up some of the liquid in my stomach so I'm not hungry again in 20 minutes.

Overall I like Zoup and will continue to go on a rare occasion simply because there is nothing better in the area (at least as far as soup is concerned)."}
{"text":"Great food...Friendly Staff...Fast Service and will make it on our dinner list going forward. Good overall selection of soups...said that the Lobster Bisque and the Chicken Pot Pie are always on the menu however everything else changes. Daughter had a salad and she was impressed....a nice little change up for food"}
{"text":"I got the XL Italian wedding soup and a whole chicken Toscana sandwich. Walked it back to my hotel at the renaissance and the soup was a major buzz kill. Basically all broth. Maybe 1oz of turkey meatball and 2 oz of veggies and pasta. Really pathetic. No wonder no one was in line here for lunch like the other places in the food court... Pathetic"}
{"text":"I want to love this place because it is near my work, they have a rotating variety of soups, and they are fast and nice. However, the soups are WAY too salty for me. I wish they'd cut back on that - salt can be added, not removed. I've tried several now, and each time my husband ends up eating my soup because I can't."}
{"text":"I don't get the glowing reviews. I've tried this place several times now. I didn't go one-star because of the great service and ability to order online without any issues. But the food is terrible to me, except for the gazpacho. Once I ordered something, I forget what, but I could not eat it because it was so salty. A couple days ago I got the dragon-fire noodle bowl, which was supposed to be full of Asian tastes and veggies like mushrooms, scallions, etc. It was none of that. It was brown broth that tasted like there was a little Sriracha mixed in, then about a tablespoon of noodles. NO VEGGIES. I tossed it. I also got the BMT sandwich - basil, mozzarella and tomato. The amount of ingredients inside the sandwich were razor-thin slices of tomato and cheese, and a little basil. It was basically an expensive side-roll. I am tired of wasting my time and money on this place, I have given them so many tries and so much has gone right down the sink."}
{"text":"I love soup.. but I love Clear Soups..  too many thick creamy soups.  Another Panera."}
{"text":"This was my first time eating at Zoup. It was a great experience. I had the Chicken Potpie soup with a half Turkey Club sandwich. This soup is their signature soup which is served every day. There are 100+ soup recipes with 12 served daily. They will let you sample any of the soups. The soup was excellent and the sandwich was good. The service was very friendly and the restaurant and bathroom was very clean."}
{"text":"I go to this zoup quite often... I think the soup is pretty good... I like the fact that its so many to try, the overall staff if nice the tall guy that works there at night is alway polite and greets there is also other nice staff employees as well.. Keep up the good service."}
{"text":"I am a big soup fan so when I discover this thing call Zoup! I was elated. The variety of soups you get is mesmerizing. Every time I walk in I have mini panic attacks because I can't choose from all the great soups. The menu changes every day, with the exception of a few regulars. Best chicken noodle soup and broccoli cheddar soup I have ever had in my life. 'Nuff said. 
Even my wifi connects automatically."}
{"text":"12 different soups made fresh daily! Awesome!
Don't get caught up in the tasting station (at the far right). If you're ready to order go to the cash registers and place your order. All the soups I tried were great! I was a little disappointed in the grilled cheese. It was alright, but not crunchy and crusty like something I would want to dip in my soup. I'd definitely go back though. There's been a huge lunch rush, so go before or after noon."}
{"text":"Absolutely love this place. You can't go wrong with the lobster bisque and chicken potpie !!"}
{"text":"A-OK is about right. This chain eatery is all about soups, with a side of salad and/or a sammie. A strong lunch contender indeed, but it didn't really leave me craving more. 

I chose the \"pick two\" option and tried the burrito salad with a side of soup. I loved that I could sample the heck out of all the soups I wanted, although it didn't really make the decision any easier. The stuffed green pepper, mac n' cheese and lobster bisque were all delicious, but lacked that \"homemade\" soup flavor that warms you from the inside out on a cold day. These soups tasted more like something you could grab at a big-name grocery store buffet, or pre-made food area. 

To avoid giving too much info, I'll defer you to Kaitlin D's review regarding the salads and the reason why I'm not in a rush to return. The burrito salad was delicious--although hardly the \"healthy\" salad option. It comes with chipotle ranch dressing, which was spicy and delicious--probably the best thing about the salad. They also skimped on my guac because they ran out, instead of just restocking it and giving me the full amount. 

After eating my meal I was really full--but an icky tummy feeling following me the rest of the day--very much like Kaitlin D's review. Based on how much I love the salads and HOMEMADE soups from locally-owned Souper Market AND the horrid parking options for a quick lunch downtown, I think I'll stick with my local peeps. And not just because they're locally-owned (so are most big box franchises, as well), but because the food is homemade, fresher and it's an all around better product."}
{"text":"Gasp--It's a chain! But it's pretty damn good, too!

I'm having a hard time describing what this place is like, except for a \"Panera\" with more soups than sandwiches. 

It's a great, quick lunch spot on the go and you can literally fill yourself up on just sampling the soups. Oh, and they're ever-changing. You never know what they'll be serving up when you get there. 

I tried the Asian Sesame soup with rice noodles and it was delish. I added a little hot sauce, but overall the taste was fresh and gingery. Yum. I also tried the southwest turkey sandwich, which was pretty dang good. Nothing spectacular, but a good sandwich. Jason got the lobster bisque, which was creamy and good! Not many hunks of lobster meat, but for the price it's pretty spot on. 

I think my favorite part about Zoup, besides the free tastings, would be the portion sizes. They're reasonable, but so much that you're eating a huge lunch. Nothing is worse than that lethargic feeling of overeating midday. They've got lots of vegetarian options and the salads looked awesome. 

Yea, it's no Souper Market or local deli. But if you're looking for a quick, yummy, healthy-ish lunch--I'd say give Zoup a try."}
{"text":"Excellent restaurant! I've not had Zoups before and I was totally pleased with the entire experience. The staff is friendly and knowledgeable and they give you a sample of any soups you want! 

I had the Twice Baked Stuffed Potato and half of a MTB sandwich... Absolutely delicious. The bread is perfect- warm, soft in the middle and crunchy outside... Mmmm!!!

Inside the decor looks a lot like Panera but don't get them confused as Panera's food pales in comparison!"}
{"text":"Great food, friendly employees, awesome management. You can't go wrong with the lobster bisque, but the mac & cheese soup is a close second for me."}
{"text":"I give them a 5 with a few caveats. After several visits and a few disappointments, I finally found the magic formula. Call them in advance and select todays soup selection. If you go when they have beef barley, you cant go wrong. Its the best of the dozen Ive tried. I would also caution about dining in when its blowing snow as there is no buffer entry door. You can sample everything theyve got, but if you somehow wind up unhappy with your visit, DJ will make it right."}
{"text":"Yum! I love having choices for comfort foods like this. I stopped in while visiting over the holiday and now I crave it! I wish there was one where I live. I loved the chicken pot pie soup and being able to sample the soup is awesome! I recommend this as a good lunch spot and I plan to be back next time I'm in town."}
{"text":"An interesting semi-fast food place. Offered about 12 soups and if I understood correctly 3 are offered everyday and the other soups are offered on a variable (rotating?) basis. They also are offered about 6 salads and 6 sandwiches. You ordered from the counter and carried you food to your table. 

I had the ham and bacon sandwich. It was a 10 inch sandwich served warm. A very good sandwich. 

They want you to taste the soup before you order. I am concerned how this works during the lunch rush."}
{"text":"Zoup! features 12 different soups every day, made in small batches so they are always fresh, as well as sandwiches, salads, and noodle bowls. You can get traditional soups like tomato basil, chicken pot pie and split pea, but also more interesting crab bisque, mulligatawny, spicy lentil with sausage, butternut squash, gazpacho, roadhouse sirloin, macaroni and cheese, etc. There are always a few vegetarian options and meny changes daily, although there are a few constants every day. Best part - you can try any of the soups before you order, so you can feel free to try something new.

The salads and sandwiches are delicious as well. Try the BLT w/ avocado for something different. Many of the soups are available with added noodles. 

Service here is great, very friendly and quick. I went to this place the first week it opened, and it has come a long way, it's efficient and one of the best lunch spots in Solon."}
{"text":"My All time Favorite Soup place. Too bad we don't have it in California.
They have the most delicious Tomatoe Bisque soup. At times they have it with Feta cheese. Absolute deliciousness.

They have different varieties of soups each day. They also have wraps and salads but my all time fav is soup and bread.

A must try if you have it in your area."}
{"text":"We found this by accident. It is a faster version of panera but with concentration on soup rather than bakery. I thought my soup was great. The sandwich was OK. I would go again if I saw another Zoup."}
{"text":"Salty!  Maybe it's my gradual liberation from sodium, and that I find I barely add salt to anything at home except eggs (and using salted butter), but I found the soups here to be soooooo dang salty.  After sampling a few - I settled on the creamier, and slightly less salty clam chowder.  It was okay, but nothing to write home about.  Price was around $7-$8ish and came with choice of bread, which was nice.  The overall ambiance is tasteful and very \"I'm a franchise\" but pleasant and clean.  The staff were friendly so no problems - but I probably won't be coming here too often purely on the sodium overload.  My quest for a good soup place up north continues!"}
{"text":"Sunday was the first time and it would not be the last. We ended up eating there again the next night. What a fantastic place. The potato soup is ok, but all the others we tried had great flavors. The Asian  and Mexican type salads were very good. The Greek sandwich was ok, I've had better. We will go back again and again."}
{"text":"Though the soup (dragon fire noodle) was tasty, it was Luke warm and little.  Also the 1/2 sandwich (southwest turkey) was tiny (like child size) and lacked luster!  For $9 I feel like I would get bigger and better.  Nothing WOW'd me.  Plus the wait was long and not one single table was available.

**I gave this establishment a second chance, and was much happier my second go.  I had a bowl of the Lobster Bisque.  It was flavorful and had big chunks of Lobster. It could of been a bit warmer, but overall good.  I decided against trying another sandwich because I really didn't care for the first in."}
{"text":"I am a big fan of zoup, but not this location. Every time I have gone in, I got bad service. When I was in the last time the employee seemed to be making a shady transaction with her friend that was not a customer. She was not interested in helping us."}
{"text":"Better value than Panera at the next plaza. I know it's a soup place, but I think the salads are just as good, if not better. My son asked for the Zoup chicken noodle soup as a birthday present! Now that is saying something. My husband at a close second, talked about the lobster bisque for three days after having a cup for lunch. Lucky to have the only one of this franchise in Pittsburgh so close to where we live."}
{"text":"The soup is fantastic. They have a good variety to choose from. Unfortunately their sandwiches are unimpressive and their bread lacks flavor. If you like soup this is your place, if you like fresh bread or flavorful sandwiches your better off going to Panera and you'll save yourself a couple bucks as well."}
{"text":"I've been to Zoup a couple of times now and I like it. Sometimes I crave a nice soup and sandwich especially in the winter time and Zoup is great for picking up a quick fix. I like their lobster bisque (mmm chunks of lobster), but the other day I had their fresh looking chunky tomato bisque with a pesto 3-cheese sandwich and oh my, it was really good! Just dunked that sandwich right up in that soup mmm. Not so much a fan of the rolls that come with the soup though. Maybe it's just the French roll that is lackluster, I will have to try the whole grain or sourdough in the future. 

Place is clean, no issue with the staff, you get to try as many soups as you want before you order which is nice. I was going to say that Zoup is a little pricey, but now that I think about it, $15 for a bowl of soup and full sandwich isn't that bad considering it is VERY filling. You can do one of their half sandwich and cup of soup deals if you have a lighter appetite/budget. Or if you're lucky you might find a coupon in the mail."}
{"text":"Do you enjoy food coma's? Does your work allow for afternoon naps under your desk? If so then you should stop by Zoup for lunch! All of the staff were patient while I took my time trying to decide what to order and they were friendly as well, even offering up all of their soup selections for me to sample. For $8.25 I was able to get a lunch combo meal consisting of 8oz of soup with a bread roll, and half a sandwich. I opted for the Turkey Club and the Chicken Pot Pie soup, both were enjoyable and very filling. And by filling I mean I just had to undo my belt and my eyes want to close for nap time. 

A co-worker got half a salad with their combo and it was still a nice size and looked tasty. I would probably go for that next time since I over did it on the carbs on my first visit and now my food baby is definitely showing. 

Just remember this is is a chain. You won't find anything fancy or fresh from the garden here, you also won't find that soup your grandmother won a ribbon for, but you will find a decent lunch at an affordable price served by some pleasant staff. 

Now if you'll excuse me I need to go run 486704691 miles."}
{"text":"Got the power quinoa salad.  Only power I got out of it was sliding my credit card through the machine. Two pieces of very small avocado in it. Lettuce was junky.  The dressing and multigrain bread was probably the best part of my lunch. 

The man that took my order was nice and caring. He offered me a cup of water when I didn't order anything to drink.  

Stopped here for lunch before a seminar. Probably be the last time I go to a Zoup.  My salad reminded me of an \"attempted\" upscale McDonalds salad."}
{"text":"Even with the 20% Yelp check-in deal, the food is still pretty pricey. You are probably paying for all the little sample cups and spoons that everyone uses, so you might as well make full use of your privilege and go ahead and try all 12 different soups. No dirty looks from the staff and they actually encourage you to do so AND with a smile.

Hubby went with a full size Sonoma salad (Romaine, spring mix, gorgonzola cheese, dried cranberries & toasted almonds. Served with raspberry vinaigrette dressing) and New England Clam Chowder. I went with the Chicken Toscana 1/2 sandwich (Grilled chicken, provolone cheese, roasted red peppers, marinated red onions, basil mayo, toasted on country French). I couldn't decide between the Cajun Chicken gumbo and the Jamaican Bay Gumbo soups. Thinking outside the box, I asked if they could combine the two. They had to verify with the manager, but I was ecstatic when they said they could (you get charged for the more expensive of the two).

Their food is fresh, flavorful, with a mix of wonderful textures. There soups are chunky and savory and come with rolls that are crusty and soft. Four stars for the food, experience and great service; subtract one star for the price point."}
{"text":"The overstuffed bell pepper was awesome three bags of oyster crackers don't forget to grab some pepper very good even though I was with Bad Company"}
{"text":"I visited for the first time today because I wanted to have a Greek salad and I work in the area. A coworker suggested I try this place. First of all the young ladies were very nice and I visited at 12 pm in the afternoon and there was only myself and another lady in there that was ordering soup. The two young ladies that worked in today here seemed nice enough, but the first thing I noticed was there was Avery tacky sign stating that they\"wash their hands.\" It made me whether there had been issues in the past concerning this places cleanliness. Anyways the young brown lady asked me if I would like to try some soup so I did and they were both very tasty. So I asked for a Greek Salad with chicken. The young brown woman told the young white woman what I wanted and she proceeds to make my salad the young brown women puts my chicken in this contraption to cook it and I notice how filthy the pants that their both wearing are.!!It was maybe 12:15 and the place wasn't busy at all. When the young brown woman starts removing my chicken from the contraption I see she is using her BARE hands to guide my chicken over my salad after she had just finished handling the cash register and I hear the young white woman urging her to use GLOVEs , which she ignores. When I get to work and open up my lunch it was filled with OLD BROWN lettuce!!! I just chucked it and had a protein bar!!! $12.00 down the drain from this place!!!! NEVER AGAIN!!!"}
{"text":"Always fantastic food- fantastic service. Just had a make-over inside- looks great... Casual..but always swamped for lunch. I love the chicken pot pie soup (served every day) but like trying different things- my husband and I LOVED the Cobb salad with grilled chicken today. Our foreign exchange students loved all the vegetarian options. Really nice, sincere staff."}
{"text":"My first time here and was looking for soup for my bf cuz he's sick. I'm glad I came to this place the staff was friendly and helpful. I enjoyed the soup and bread was fresh"}
{"text":"Perfect for lunch on a cold winter day.

Staff is always helpful and courteous. Try some free samples if you're not sure what you want!

Food is slightly expensive but worth it. It is delicious.

You can eat healthy here :)

I prefer Zoup! over Panera now."}
{"text":"Soup is king here and Zoup does it right! They have all kinds of varieties of soup and any soup lover should enjoy trying them all. They do have sandwiches as well, looked like a lunch hot spot. With the selection here, there should be enough to keep it fresh each time dining in."}
{"text":"Soups are ok.  They do provide samples as the soups change regularly.  Nothing special when it comes to their food quality, but it is fairly pricey for just soup."}
{"text":"Lentil soup was great! Veggie sammy was fresh."}
{"text":"We have been here a few times with our two 7-year-old daughters and they surprisingly love it.  I think the tuna sandwich is really good if you want something healthier.  If you don't care about watching calories or fat the pesto cheese sandwich is a must.  The kids grilled cheese is consistently tasty too.  I always secretly hope that the girls don't finish theirs so I can sneak a bite ;) .  Soups are great...I keep hoping one day there will be some kind of mushroom soup.  I have faith that one of these days it will happen!  Otherwise I think my favorite so far is the tomato basil.  You can't go wrong with the lobster bisque but it's not the best choice if you want something healthier.  In conclusion, if I had to choose between going to Zoup or Panera, I'd definitely pick Zoup so good job Zoup!!"}
{"text":"soup, salad, sandwich - basic lunch components - and these guys make a tasty, decent selection of all three - walk up to the counter and ask to taste anything before you order, then get quick, friendly service once you have narrowed it down.

this location is in a strip mall with about 10 other potential lunch spots.  only the pizza place and cheeseburger cheeseburger should even be in competition for your meal choice"}
{"text":"I know the restaurant concept and usually enjoy the soup variety. When I walked into this one at dinner time, one table was occupied-red flag! The cheerful young lady asked if I wanted to taste the soups, so I looked at them to see which ones were available. What I saw was crusty, unstirred sludge-nothing looked hot or even safely edible. I walked out, and until they come up to standards, you should, too!"}
{"text":"I dont understand why people gave this place such a low rating.  I mean what do people expect from a soup and salad place ? Its fast food soup & salad style. I mean I understand that everyone has their own opinion, but it wasnt that bad tbh.

This place is a great place to go for lunch. Its quick, easy, and very tasty. The staff was very friendly and gave great detailed recommendations. I got the chicken pot pie soup with sour dough bread.  I loved how it has the pie crust on top.  Totally recommended.

All in all hit it up!  Its good, fast, and convenient.  Did I mention you can sample all the soups you want until you find one to your liking?? + in my book!"}
{"text":"I was looking for a soup and sandwich place and Noah buddy who is the regional manager for the chain in the area and decided to give it a try. I was not disappointed. The soup was delicious the sandwich it was wonderful and I would recommend visiting Zoup. Excellent service by the staff, this is a high-quality place with high-quality food. I was impressed with a successful new concept. I will return."}
{"text":"This was my first and last visit to Zoup for lunch this afternoon. I had the 2 for special with soup and a chicken wrap. Everything tastes fresh, fast forward 1/2 an hour later and I was violently ill. I hadn't eaten anything else today and the swiftness and intensity of the nausea, vomiting, and diarrhea can only be attributed to this meal. Either improper handling or food born bacteria were likely the culprit. I'm sorry to report this and hope it was simply a one time occurrence. That being said I will not be returning."}
{"text":"Fabulous soup! A little on the expensive side, but I don't mind paying a bit more for fresh ingredients. They encourage you to try the different varieties before you make your decision. I'll be going back!"}
{"text":"I remember trying Zoup! years ago at another location & I was wishing it was a lot nearer than me because I like their soups. My wish has finally came true! 

They offer a nice variety of soups, broths to cream based, vegetarian to meat filled, there's a soup for everyone. My absolute favorite soup here is the chicken pot pie soup. It's such a hearty soup & tastes just like a pot pie. You can also ask for the crumbled up pie crust to real amp up this soup. I've had the sandwiches & salads but, they are subpar. If you want sandwiches & salad, go to panera breads. I'd stick to the soups when you come to Zoup.

Customer service is great. You're always greeted when you first come in & the employees are very helpful when it comes to answering your questions about the soups."}
{"text":"Soup and sandwiches are what this place is about. Frankly I don't know many restaurants that serve soup, so coming here I got to try something new. They put the soup at the forefront and does it ever taste good! There are a dozen choices so you have plenty of time to try them all. The sandwiches are pretty standard, and together with a soup it's about $10 which I think is good value."}
{"text":"I tried zoup for the first time.  When I walked In I wasn't really sure where to go or how it worked.  The set up was a little confusing and I wasn't the only person who wasn't quite sure where to go. Basically you can walk to the far end of the soup bar and try any of the soups you want..  after several try's I picked the lobster bisque. It was really good.. the half sandwich turkey club was okay nothing special though, they forgot to put the dressing on my sandwich and the line was too long for me to ask for the mayo. The service was kind of slow because they only had one sandwich maker and they were really backed up.  Maybe they just need to be open a little longer to become more efficient.  I will go back and give it another try because the lobster bisque was really good."}
{"text":"Have been to this location and other locations many times it is a great idea poorly executed prices are crazy portions are small sandwiches lack quality you get very little for a lot of money it is a great idea poorly executed and will lead to the mall closing soon"}
{"text":"They change their soup menu daily and have lots of soups to choose from. Everything I've had there is great."}
{"text":"We came during a big rush. I was impressed with how fast service was with just three people. The selection, as with most Zoups, is a mix of old faves and newer concoctions. The ones I had were tasty. Potato cheddar was basically a warm nacho cheese soup with potatoes. Sooo good but please don't give me a calorie count ;)"}
{"text":"Still great. Stopped in on Sunday for lunch. Got the chicken pot pie again, still wonderful!."}
{"text":"Excellent service, excellent food! They were swamped with large orders in front of us and the employees worked their tail ends off running around, working together to get everyone taken care of. I forgot to order my daughter her free Wed kids meal so i went back up to the counter to wait patiently while they assisted other customers. Gentlemen worker noticed I came back and I apologized while explaining my own error. He courteously and promptly put together a kids meal for my daughter and delivered it with a smile. Now that's service! Highly recommend and we will definitely be back!"}
{"text":"Lately I've been going to Zoup about once a week and have yet to be disappointed.  I really like how they have quite a few different soups that they are always changing up.  I always get the bread bowl, and with trying new soups and having a huge amount of bread to eat afterwards, am always very full and satisfied.  Not bad for $6.50!  

It's a clean and orderly restaurant, and like other people have said it's kind of like Panera (in my opinion tastes better) with more soup options."}
{"text":"Great service, they were very patient while I sampled soup and asked questions. Rattlesnake sausage stew and crab bisque were my favs. Lots of options!!!!! Lot of sandwichs and salads also."}
{"text":"I stopped in to this location for the third time and it will be my last. The soup is absolutely fantastic and the establishment is very clean. When I stopped in this week I ordered a bowl of the cheeseburger soup, which was amazing but the way my body reacted was not. I spent the rest of the night in and out of the bathroom. I've never experienced stomach pain (or what came out of my body as a result) like that, it was unreal. The pain and sickness has been lingering for the last two days since but has been progressively going away with every trip to the bathroom. Not sure if eye drops or bad bacteria but I'm not interested in going through that again."}
{"text":"My boyfriend and I get zoup about twice a month. We usually go to the one on Harvard, but tried this location since we were in the neighborhood. When we walked in, maybe 3 people were in there and no one greeted us. We ordered and sat down. Then they brought us out combos, which both sandwiches and one soup was wrong. I asked for them to be remade. Which took about 10 minutes, and they came and asked what our order was again. We had to say our order 3 times. Once he gave us the new sandwiches, mine was still wrong. I just didn't say anything. Shouldn't they have rang it in correctly? I understand mistakes happen. But they barely cared and then messed up again.......  I'll stick to the Harvard location!!"}
{"text":"Terrible customer service.  I got sick of waiting in line and finally left.  I was hardly acknowledged.  You're soup isn't that good to not provide good, quick service!  No \"we'll be right with you\" or \"sorry for the wait\" I'll be surprised if they're still around in this location much longer"}
{"text":"Had a great lunch here today! This is counter service ordering with a selection of 12 rotating soups daily. They will give you samples before you order. Today I had the crab bisque with the Sonoma salad and it came with a fresh tasting roll. All were delicious. The service was friendly and quick and after we finished one of the guys came out and cleared our trays. The place was very clean and the atmosphere pleasant. This is a great lunch spot or dinner take out!"}
{"text":"I am a picky eater, so I did not think that I would like the offerings of this restaurant. I was more than impressed with the associate that helped me, and explained their menu as I had never ate there. She then encouraged me to sample their soups to find one that I liked. I tried the chicken pot pie, chicken corn soup, and loaded potato. After tasting all 3 I enjoyed them all but got a cup of loaded potato, and a 1/2 southwest turkey. It was absolutely amazing. Will absolutely continue eating at Zoup from now on!"}
{"text":"Everything here is great! The service is good, the soups are unreal and even the sandwiches are top notch. I haven't ventured into the salads yet, but based on everything else, I can only assume they are great."}
{"text":"This place is delicious! I love soup and salad, but so often there aren't that many soup  options. That is not that case here. There are tons of different soups, and they will let you sample the soups before you chose.  I had the lobster bisque and it was bowl licking good! Love!"}
{"text":"Been here once before when it first opened, wasn't very impressed to begin with but decided to come back and give them a second chance. What a mistake.

The workers here are very under-trained and disjointed. Scrambling everywhere, yelling at one another, and ignoring customers.  Lineups simply doesn't exist in this place or they have zero concept of how it works, customers just walk in and bud each other because the directions aren't marked. The employees don't have time to care about it either, serving whoever is in their face first.

I ordered a seafood chowder but received a mega sodium overload; it was -extremely- salty. The soup was also borderline room temperature and tasted very mediocre. The materials used as 'seafood' tasted cheap, unfresh, and screams of 'frozen food'. They charge around $10 (after tax) per bowl. In my opinion these aren't even worth $2. 

Very disappointed with my visit. Definitely my last time here."}
{"text":"ZUPER GOOD! 

You can dine in or dine to go . You can order online and pick up as well . 

They have about 12 soups daily . They let you sample as many as you want before you order . They also have salad and sandwiches . Sandwiches come in half or full orders . They call your name when it's ready ! 

I was very pleased with both my soup and sandwich order . It was seasoned well and not with a lot of salt so you can tell they don't sit all week . 

They have lots of options for low fat, vegan , vegetarian  and gluten free as well . All the soups have labels next to them so you can tell what is what ."}
{"text":"A place that focuses on soup is not a super time in my opinion but my wife wanted to go so we did.  First observation was it was a very clean location. They have about a dozen soups to choose from that change out daily so you'll never know what's being served until you arrive. No worries as they encourage sampling a few before you decide. I decided on the Chicken Chili with hair. Wait? What. I didn't order it with hair. Why is there a hair in my soup? They apologized and replaced the cup of soup. That as well as the grilled 4-cheese sandwich was really good. It came with a piece of bread that was rather bland though. All in all it was a decent meal minus the rogue hair. Next time a solid three star is likely."}
{"text":"Tried their tomato vegetarian soup and veggie sandwich . Glad I read the reviews and one of the reviewers mentioned what to expect in veggie sandwich so wasn't surprised . But overall a healthy meal, felt full yet light. Not a formal business place but good for business travelers who want to have a quick yet healthy bite. I will surely come here again."}
{"text":"This was our first time at this Zoup - the two employees we encountered, Michael and John, we're very helpful and upbeat! We always love the food but it was made better by these two associates making ordering an enjoyable experience."}
{"text":"Zoup has really good soup and sandwiches. My favorite is the lobster bisque. They are always passing out free samples of soup, which is nice to try before buying. I honestly would eat here once a week if I could but there prices are steep. The bowl of soup is $7.50 and if you want a sandwich with that add another 7-8 bucks throw in a drink and its a 20 dollar lunch. So for now Zoup is a once in a while treat."}
{"text":"What a perfect lunch option.  We stopped by on the way to Pittsburgh and enjoyed the tremendous variety of soup.  Prices were very reasonable.  We got the half-sandwich and soup combo.  No need to upgrade to the cup... it was more like a bowl!  The half-sandwich was also huge.

Just for a moment, let's talk about taste... the bread with the soup and the sandwich was on was delicious.  I really enjoyed the toasted sandwich and the baked potato soup was tremendous.

We'll defintitely be back.  I wish there was a Zoup closer to my house."}
{"text":"My sister raves about Zoup! and convinced me to try it on my recent visit to the area. The selection of soups looked enticing, but some appeared dried out (thick crust on top) as if they had been out for too long. 

Instead of soup, I tried the Quinoa Veggie Wrap. The wrap was absolutely delicious and healthy. It was full of quinoa, brown rice, cucumber, kale, carrot, red pepper, tomato and dressed with balsamic vinaigrette. The menu states that it contains avocado, but my wrap was missing avocado. However, I felt very satisfied after eating it! 

I'll definitely be back if I'm in the area!"}
{"text":"I found this place on Yelp and liked the reviews.  I also liked that someone responds to the Yelp reviews.  It shows that they care.  I am not a big soup eater, but most of my family is.  This place peaked our curiosity.  We went there and had no idea what to order.  The staff was amazing!  We were worried about holding them up since we had no idea what to order.  They were very polite and patient.  They told us to take our time and explained what they have available.  They offered samples which helped immensely! One of my kids got a kid menu and it was a great value with a lot of food.  Others in my family got bread bowls.  They pulled the bread out of the oven, hollowed it out right there, and poured the soup in.  They also give you the piece they hollowed out to dip.  Their soup and bread were delicious.  They couldn't eat all the bread, but the soup was to good to waste.  My only complaint was my sandwich.  It was very good but didn't have much on it for $7.95.  There were no sides that came with it either.  I could have got a full sub, a side, and a drink for the same price at Subway and would have left full.  I would not order a sandwich from there again due to to price per size (value).  I would definitely eat here again, but would get a soup bowl."}
{"text":"Really delicious food but there lack of a system that makes what should be the fastest food out there take 10 minutes is something I have to dock the a star for. They have got to speed it up. I mean, how long does it take to fill a cup of soup that's cooked and sitting in the counter and grab a piece of bread and put it in a plate and ring you up? 2 - 3 minutes right? But no. It takes them at least 8-10 minutes to have your food ready. Needs to get a system redo and speed up their service. But the food is great and so ill still go back. But it blows me away each time on how long they take. And the cost ends up being kind of high."}
{"text":"I needed a quick lunch on the way out of town, and this was the most convenient stop. I had never eaten here but my two favorite things to eat are soups and sandwiches so I thought this would be a great match. The line looked long but moved quickly. You're asked if you want to sample any of their soups (tons to choose from), which is nice. I ordered the Chicken Toscana- it had a good meat to cheese ratio and was pretty good. The sandwich was a decent size, but the prices here are probably higher than they should be, especially because it doesn't come with any sides or anything. Not even a pickle (nonsense)!! If I need a decent fast lunch, I may return, but with all of the other options nearby, I won't rush back."}
{"text":"Excited that thia opened since moving from downtown area to the east side a few years ago. So fa so good. Food is great, staff are friendly and helpful."}
{"text":"Really liked this place.
The soup samples are a definite plus.  
Good choices to pick from for sandwiches, salads and soups.

I had the corn & roasted red pepper chowder and chicken toscana sandwich.
Enjoyed both quite a bit.  Chowder was full of flavour and the sandwich was so fresh and had lots of chicken.  Even the small size portions I had were filling.  So much on the menu that looks good and from first experience will likely turn out to in fact be really good means I will be back again, soon."}
{"text":"So nice so yummy  greated me right away  had me taste some soup b4 ordering its so quite in here ....much better than Panera bread....zoup is amazing"}
{"text":"Everyone is so friendly and polite and it's a huge change from Panera in the same complex. The three cheese sandwich I got was very good and it had pesto and tomato on it. The soup was also good, I got the vegetable medley only because they didn't have chicken noodle soup today. The pick two was a good deal. My whole meal came out to 9 dollars which was my sandwich, soup, and bread."}
{"text":"I love how they let you taste the soup before you buy. 

Lobster bisque 16oz $9.95 - It tasted good but didn't really blow me away like the soup I had at Soup Nutsy. I found the soup to be a bit on the salty side. There were some small chunks of lobster which gave the soup some more texture other than just flavoured liquid.

Chicken pot pie soup 16oz $8.35 - A much thicker soup when compared to the lobster bisque which I like better. Not as salty as the bisque either. I like this soup much better.

The bread which came with the soup was nice and fresh. Price is a bit on the high side though. Service was excellent. Lots of seats for dining in."}
{"text":"I've been here once but it was amazing! It's like a glorified Panera but not too pricey for what you get! They even let you taste the soups before you choose one! Great service! I hope I can make it over there again soon!"}
{"text":"I came in here for a late lunch one afternoon. Zoup is conveniently located right by the hotel I was staying at - the Cleveland Marriott East. The staff let me taste several of the soups. I decided to order three soups - in the smallest cup size they offered - so I could try different soups.

All three were very tasty - and I was filled up by the time I left!

Love this place! Would be a great place to come during cold weather season!"}
{"text":"We stopped here for lunch and I wasn't extremely impressed or disappointed. It was so average that it was forgettable. The food actually was pretty good but the prices were a little high. 

So I got the combo, the corn and crab chowder and a side Cobb salad. The chowder was probably above average, very creamy and the veggies were cooked well. Not a ton of crab and the potatoes were a little hard but all in all pretty darn good soup. The Cobb salad was ok, it was fresh and tasty but there was nothing extremely special. My husband tried some salad with strawberries and blueberries in it and that was pretty good as well. 

For each combo it was about $12 and for a side salad and about 8 oz of soup that is just kind of steep I think. They were quick and friendly and I have a feeling if you work in the area and are sick of all the other places around there, this would be a great option. They have healthy options as well so if you are trying to diet this is a great option as well."}
{"text":"The soups are great! The sandwiches I've had are good but nothing out of the ordinary. It's a great addition to the plaza for food options."}
{"text":"As a frequent guest at this Zoup location, I feel the need to write about my experience today. We often order online from the office, and go pick up our meals to bring back and eat.
Today I ordered a Chicken Fajita soup and a Southwest Turkey Sandwich (Try 2 Combo).

First off, the location is clean, has a great atmosphere, and very nice staff. Not to mention delicious soups but my experience today was below average. 

My Chicken Fajita soup was missing the garnish (cheese and tortilla) and this is now the 2nd time they've forgotten to garnish the soup. Sure the flavor was good, but I ordered that soup for a reason, and the garnish is part of that.

Usually the sandwich is top notch, today was a different story.

I ordered the Southwest Turkey with no tomato and added red onion.

When I unwrapped the sandwich, I couldn't even tell that there was any meat on it without physically opening the sandwich and looking inside. There may have been 1 MAYBE 2 thin slices of turkey on the sandwich, and to top it off instead of red onion I was given sauteed onions. 

For a $12.00 meal, I could not believe how empty,small, and thin the sandwich was. I understand they are a new establishment, but more and better training work needs to be done.

Will I go back to Zoup? Probably...although not as often. Just hoping they rectify the problems moving forward because the store has a ton of potential."}
{"text":"Snow whipping around us, my friends and I ducked into Zoup where were enthusiastically greeted. We taste tested a couple of the soups which made it harder to choose, they were ALL so good! I loved the Mexican salad as well!"}
{"text":"This place is like a poor imitation of Panera.  The concept is fine, but the execution just doesn't do it.  I had a soup and sandwich, my wife had soup and salad, and none of it was particularly good - mediocre at best.  Even the bread was barely eatable.  I won't be back. 

If you are smart, \"No Zoup for You!\""}
{"text":"Food was ok. We bought two cups of soup, two salads, and two drinks - came to $40 -_- very pricey for a soup place."}
{"text":"I've been to Zoup before back in Kitchener-Waterloo and was really glad one opened up in York Region. I decided to try this place out yesterday as I was in the nearby area.

Having arrived at around 3pm, I expected the place to be quiet, and quiet it was. The employees quickly assembled to welcome me and introduced me to the soups and sandwiches, although I already knew the whole Zoup system and how it works.

I had the MTB sandwich coupled with a lobster bisque soup for a try two combo. They're currently doing a promotion where if you spend under $15 you'll get one stamp, more than $15 two stamps, and you'll get a free try two combo if you reach 8 stamps. It was quite decent overall, however they messed up my order twice despite the fact I was the only one there. They also undercharged me and the supervisor gave the cashier quite a talking after.

For $16 with a drink, the price is quite steep for a simple soup and sandwich. I honestly didn't remember being charged so much back in K-W. It was still good, however don't expect a $10 meal here at all. Oh, and they really need to fix up their service organization, cause that was brutal on their part."}
{"text":"Who doesn't love soup when it's cold outside?! This place has so many different soups to try and you can ask to sample them to decide. I sampled a few and chose the safe route, my usual choice of French onion, yum! The mushroom soup was good too but tasted a bit too much like mushroom for me to commit. I heard the chicken pot pie soup is really good so I'll have to try that next time.

I chose to get the soup and a half sandwich. I couldn't decide between the turkey or the tuna. Here's where I made the mistake, choosing the tuna. It was not good at all. The capers in it made it worse. It was very bland. Other than that, I really like this place. A very friendly staff and fast service. I work across the street from Zoup and I'm looking forward to coming back for lunch during the winter months to warm up! A great concept!"}
{"text":"A lot of soup options that you are always able to sample.   I have tried their lobster bisque and split pea soup.  Both were great, I will definitely be back."}
{"text":"I like their soup! It is so nice to be able to try the tastes too. Service is fine, as stuff is very friendly. Only they may not be very good at busy time. The regular service gets clumsy with luck of communication between workers. But they always tries to make it up right if something goes wrong especially for customers. Someone compared with Panera but two are totally different stores. One is more driven to bakery and the other is more for soup. I like both of them in different occasions."}
{"text":"Anyone who has read my reviews know that I am not a fan of chain restaurants and rarely post reviews about them. But as places go where you order at a register, get handed a tray, shuffle to a table and fill your own drink...this place is actually pretty good compared to other fast dining options.

I ordered the chicken and sausage gumbo, 5 grain bread and washed it down with a Fresca.  Previous trips I've tried the Bison Chili, Chicken Pot Pie soup and the Lobster Bisque.  The gumbo by far is my favorite!"}
{"text":"The most rancid place I have ever eaten, and my severe food poisoning is proof. Ordered their chicken dumpling soup with half a pesto grilled cheese sandwich, and within 2 hours of eating, I was puking my guts up, among other things. I can't remember ever being this sick. Please take my advice, and don't eat here if you care about your health!"}
{"text":"Came down to try Zoup for the first time and I was pleasantly surprised. I ordered the lobster bisque via Ritual and they were able to prepare the order before I went downstairs. The service was fast and I liked how they put the soup in the bag without me asking them to. The lobster bisque was flavourful but not too heavy and it warmed my sick body. I also liked the fact the bread they provided was not stale."}
{"text":"Great customer service. I got the baked potatoes soup and a chicken Toscana, delicious."}
{"text":"I got the Lobster Bisc and it was so good!!! Along with a half Southwestern Turkey sandwhich. If you're in the mood for soup and/salad, you won't be disappointed coming here. Staff is also really great."}
{"text":"The grand opening of this place wasn't so grand. I decided to give them a second try. I am not ever going to go back. My sandwich is skimpy on the content and was served on a stale baguette. There are a lot of options in the area. Don't waste your time or money here!!!"}
{"text":"I have only been here once before, as I stay at the Hampton Inn next door. It's nice to have such a place so close to the door of the Hampton. 

Great staff and great soup. They let you try any of the soups before you buy so you can feel confident in your purchase. 

I got the Lobster Bisque soup with Pesto 3 cheese sandwich. Soup is creamy and las a good rich lobster taste. The try 2 combo is a pretty good deal but the drink is $2.29 extra, kinda pricey. 

Check in offer for a cookie! Can't beat that either!"}
{"text":"I came here a few days ago with some friends for the first time. The staff member who was helping us was kind enough to bare with us when we kept asking to try the different soup flavours. It probably helped that there were only 5 other customers in the 2 hours we hung out there... Anyway, there were so many different and yummy soup choices - it was great to see such a variety! I ended up getting the chicken pot pie soup with pie crust crumble (side portion) because I didn't want a regular or large portion as my afternoon snack. It came with a choice of a bread roll. Now, yes the soup as a side came out to $6 something, which sounds pricey but it was good and very filling for a seemingly small portion. If I'm ever back in the area again and in the mood for soup, I'll come here again for sure!"}
{"text":"I always get the lobster bisque here and I taste tested  all the soups since I have not been here for 3 years. The crawfish shrimp is a must get next time. Was super good, great soup."}
{"text":"First Zoup! experience was here. They have a nice, large eat in area. The workers were friendly. Everything was well prepared, and I even took a salad to go for later. That salad maintained very well and was still great hours later when I actually ate it. I mean, I liked it! I put it on the level of a Panera. Quick and quality food for a decent price."}
{"text":"Went here for lunch with coworkers yesterday. I really liked the way the employees work together. I didn't feel that there were enough filling vegetarian options, so I got the Greek salad in a wrap. The only redeeming factor among the wilted, aging lettuce in the wrap was the feta cheese. I also bought a brownie, which was awesome."}
{"text":"Went here for lunch today. I went at around 11:30am and there was absolutely no line. Wonder if people know about this place? I ordered the TryTwo combo with a Toscana Chicken Sandwich + Chicken Pot Pie soup (upgraded to a cup). 

Ingredients in the sandwich blended very well together. And because I ordered the TryTwo combo, the portion size I got was perfect. 

The soup was exactly what I'd hoped for. Very hearty and great for those colder days (like today).

Would definitely recommend this place. Staff was friendly and knowledgeable and gave great recommendations.

Will be back."}
{"text":"I've been here once, so this review is for one meal and an interaction with one employee. I loved it. I was greeted immediately upon entering the store. The employee then described the selections of soups and sandwiches. You can taste soups before buying, which is great. There were at least 8 to choose from. I had chicken pot pie soup, and a turkey sandwich. Delicious, however, I'm giving the place 4 stars, because it seems a bit pricey. My dinner was $12...a few bucks more than I feel it was worth, considering the portion sizes. Overall, tasty and worth returning to some time."}
{"text":"Wow, I came here a while ago and got Italian Wedding soup and thought it was okay - but I came back here today because I had a hankering for lobster bisque.  It is superb!  Just the \"cup\" size is plenty for lunch (with the bread) and not too pricey for what is typically an expensive soup.  Yum!"}
{"text":"At the tail end of this frantic Monday (burst water tank, cracked stack, malfunctioning a.c. unit - how many more water claims will happen after today's rain?), I took Waldo dog out for his after-work bio break, and while I zipped my jacket and hoped the threatening skies held off a while before releasing buckets of rain, I made a knee-jerk decision:  I would put the pooch into the car and go get some supper before heading back up to the office to tie up loose ends (and whatever additional loose screws presented themselves once I returned).

My go-to place is always busy during rush hour, so I headed over to Zoup! to pick up a salad and get myself back to work.  Only a few folks were dining there, and no one was in line.  I was greeted with a friendly, \"Have you been here before?\" (Yes, thank you) and \"Would you like a sample?\"  (Mmm, OK.)  I took a taste of the corn and crab chowder (I make a mean corn chowder, if I do say so myself), and oh, I forgot about the salad thing.  Bowl of soup and a cute loaf of bread, and ah!, just the thing to see me through the evening and this grey, damp weather.  And the stress began to melt away . . ."}
{"text":"*Visiting Pittsburgh*

Wanted some quick lunch with a friend one day, found this place. The picture of the mac and cheese soup got me in the door, but the lobster bisque made us stay. 

Not bad portion sizes for what you pay and you get a nice little hunk of bread. The soup had a good amount of meat in it, which is often lost in a lobster bisque. I just wish the bread was warm because, spreading the little square of butter on it was hard. 

Sampled the potato soup, yum and the spicy crab which I thought was just okay. 

Ultimately I'd come back again for the bisque and maybe a chance to get that mac and cheese soup. You can check what soup they have that day by going onto their website and typing in the location. They also have a stampcard for frequent visits. I live in Atlanta so I won't be able to use that, but it's a great spot for a filling, quick lunch!"}
{"text":"So many different soup options and they allow you to try them before you commit.  If you can get past the person who tries about 10 before deciding, the soup is really great.  I ordered a half sandwich, small wild chicken and rice soup.  The best part though was a 9 grain roll that came with the meal."}
{"text":"I am a vegetarian, so it is very difficult for me to find  good veg food. Tomato Basil Soup, Greek Salad and veggie wrap at Zoup were far better than my expectation. Soups are quite filling and healthy. I love their tomato basil soup."}
{"text":"I work in the area and thought I'd give this spot a try, ended up really liking it! Yes you can argue it may be a tad pricey - but you're paying for better quality food in my opinion. Sandwiches and salads are all made to order, the soup actually taste great and not like it just came straight out of a can. The workers are always pleasant! Will continue to have work lunches here! Colleagues also love it."}
{"text":"I walked into the restaurant, it was quiet like a library, people were waiting for their orders and the staff showed no urgency.  When it was my time I said clearly what I was ordering \"1 quart of vegetable broth\". The clerk looked at me as if I'm not speaking English and had me repeat it just to say \"we don't have that\".  Hello yes you do another customer even mentioned she sees it, then she said we are out. Management educate your staff the service was awful."}
{"text":"Well, Panera Bread just got put on the back burner.

I'd heard of Zoup! in passing from friends and just knew that there was a location in Southpointe but for some reason I had never been there. Perhaps it's just out of the way for me to go to lunch at, or maybe I thought they just had soup. Anyhow, today a friend asked to meet there for lunch and I agreed.

Glad. I. Did. 

I went with a combo, sandwich and soup.

I had the 1/2 Chicken Toscana sandwich which was awesome. The baguette that it was on wasn't overly hard. It the chicken on it was nice and tender. I really like the red peppers which must've been marinated and the picked onions were a nice touch. The basil mayo took it over the top. I'm glad I only had a 1/2, as it was rich.

The chicken tortilla soup was great. Lots of vegetables, it tasted fresh and loads of white meat chicken. It also wasn't overly salty. This is something I'm happy about because a lot of soups in restaurants are overly salted and it leaves you feeling thirsty the rest of the day. The soup was accompanied by a roll of your choice, either french bread of multigrain. I went multigrain and I'm glad I did. Another fresh roll that wasn't as hard a hockey puck.

I'm not sure I'll be making it back to the location in Canonsburg at Southpointe with the new Zoup! opening in Washington by the Field & Stream store, but if the opportunity arises, I'll be there. 

One thing to note about the location in Southpointe, we went at 11:30AM and there were two other people in their besides us. By 12:15, it was slammed busy. Time your visit accordingly if you can."}
{"text":"Great place to have lunch. The 1/2 sandwich, cup of soup option really hit the spot. I recommend Zoup highly!"}
{"text":"My favorite part about Zoup is waiting in line and trying wayyy too many soups! It's so nice to be able to taste a bite or two before you're stuck with a whole bowl of it.  My boyfriend and I each ordered the soup and salad combo.  I got the Greek salad, he got the Cobb salad and we both got the baked potato soup.  Everything was really good, and I had more than enough food! I actually was able to eat it for lunch the next day, which was great! The staff was also really nice and honored a really old punch rewards card that had been through the laundry a few times, so we were able to get one combo for free! Awesome spot for a delicious lunch!"}
{"text":"The best soup I've had in the Burgh. Seriously awesome soup, soup options change every day.  Try mix of Fiery Enchilada and  chicken pot pie jalapeno peppers add spice to this awesome concoction!  

Lobster bisque, New England clam chowder, roadhouse sirloin awesome too."}
{"text":"This place is amazing!!!!! I have no idea why they only have 3 stars! The people who work there are extremely nice and let you sample anything you want before making a purchase. The bread was warm and delicious and the soups were out of this world. We had the chicken pot pie in a bowl and a half sandwich and this was more than enough to fill you up! Definitely recommend this place to anyone in the mood for a good hearty meal or someone who just loves soup."}
{"text":"I get lunch here at least once a week and keep trying new things. I have literally never been disappointed! The employees are so friendly and the food is always amazing! They're TRYTWO deal is great too! For a little bit more than that fast food you're chowing down on, you can get good, real food! Seriously, if you haven't been here, you're missing out!"}
{"text":"This place is awesome, clean location and as soon as you enter the workers are friendly as willing to give you samples of soups. The soup is warm and flavorful, definitely going to be a game changer during the colder months. I also had a sandwich, while sandwiches are better down the plaza at Panera they aren't something you'll dislike."}
{"text":"For $10 I would've been happier next door at Chipotle, but I'm from out of town so always try new places.  With over 100 soup recipes that they rotate daily, I thought I would be wooed for some reason.  Just basic reheated, processed franchise food here.  Oh well!  The service was nice though; very kind staff."}
{"text":"A very under-whelming experience.  The soups are just ok.  You can tell the soups aren't made fresh (not that I was expecting them to be) -  They kind of taste like a processed mesh of blah blah blah.  But, that's what I expect from a corporate conglomerate that's shipping in soups from a warehouse in plastic bags.  Blah soup.

I ordered the crab bisque and a tuna salad wrap.  The sandwhich was tasteless.  Definitely more wrap than substance.  And what substance there was - had no taste.  I won't be going back to any Zoup - anywhere."}
{"text":"Things have not gotten any better here. The staff are an assortment of friendly but oddball and just untrained and peculiar.
The soup is as expensive as a better resto but hardly ever does it sparkle.
At the risk of repeating myself, serving only pop makes no sense at all because this is not Costco which I might even prefer. It (Costco) is certainly much better value."}
{"text":"This place has gone down hill! Used to be my favorite place but horrible service, horrible tasting food and over priced. I don't know what happened to this place but I will not be coming back to zoup every again!"}
{"text":"When your entire business model depends on one thing, you better knock it out of the park. Having said that, the soup here is inconsistent. The lobster bisque is meaty and tasty. However, the cucumber gazpacho wasn't nearly chilled enough. Other soups I've tried at other locations have been OK. It's a little pricey too considering, like Panera, I don't believe the soup is actually made on site."}
{"text":"What can I say, this place is awesome. The soup variety is great and the flavors are really good. The French bread is really amazing too. I have yet to have something that did not taste amazing. The service is courteous and prompt. I will repeat :-) happy customer !!!"}
{"text":"This was my first time trying them out and boy did they deliver! The service and knowledge was outstanding and the customer service was spot on. Very friendly and very knowledgeable and I look forward to returning."}
{"text":"I like Zoup!
They always offer a nice variety, something for everyone.
My only beef with them is that often times the soups look as if they have been sitting for too long and have developed a crust over the top.
I would like to see them stir their soups more often to keep them looking fresh and more desirable.
I love that they offer unlimited tasting so you know you can't make a poor decision.
The only downfall is you may fall in love with more than one and have to make a difficult decision.
Yesterday I had the new brewhouse cheddar.
I had received an email offer if you purchased a salad or soup you received a free side of this new soup and I really enjoyed it. I had a 1/2 Cobb salad for $5.95 
And with the free side of soup it made for a terrific lunch.
One great tip is to check out the menu before you visit they always list the soups of the day."}
{"text":"Great soup choices, my only complaint at every zoup is that they need to stir the soup more often just so they look more appealing.

I love the ability to taste all of soups ahead of ordering.
This visit I tried 3.
Ended up choosing the Santa Fe chicken chili for my husband and made a combo based on a prior recommendation by one of the staff members at the Rocky River store which was 1/3 baked potato mixed with 1/2 broccoli cheddar. They don't always have both on the same day so when they do that is often a preferred choice for me. They layer the soups and you have to mix them together to create a nice warm comfort food soup.

I unlocked a yelp check in deal to receive a free cookie upon check in which was a nice bonus.

You get to choose multi grain or French bread to go along with your soup. I have had both and they are both good choices.
Stop by and enjoy!"}
{"text":"I went to Zoup! for the first time yesterday. The soup variety is amazing, with a mix of cream based and broth based soups. The best part is you get to sample the soups which really helps in the decision making process. I ended up getting the fire roasted tomato bisque which was delicious! I paired it with a half order of the loco burrito salad. The salad was okay, the crispy tortilla chips on it tasted kind of stale but overall it was an okay salad. I thought it was overpriced however considering it was soup and salad. I ended up paying (for a side of soup and a half salad) $16. The staff were amazing! The lady at the soup counter could clearly tell I was overwhelmed by the options and spent time talking to me about the layout and the choices. I really appreciated that. The lady at the cash was also a pleasure to deal with which made the experience very pleasant. Will go back to try more soups!"}
{"text":"Tried this place for the 1st time today and it was pretty good. I ordered the shrimp asparagus dill soup and a turkey club. Im going back soon, everything was fresh and the soup just came out. I also like how you can taste any soup before you buy to see what you like. You get a fresh bun with soups and salads also. The staff was nice, the place was very clean so im going to add this to my places to get food."}
{"text":"Good soup. OK sandwiches. Friendly staff. Overpriced. It's basically a Panera knockoff."}
{"text":"I've been consistently pleased at Zoup!. There's a wide selection of soups to fit every taste or diet. As other reviewers noted, you're welcome to taste any of the soups as much as you want before you order. I particularly like their Turkey Chili, Chicken with Roasted Garlic, and Chicken Fajita soups, and usually order their Try Two! combo (side soup with half sandwich or salad). I've had both good and bad service, and have had problems even finding a seat sometimes for weekday lunch. Overall I'm a big fan and keep going back."}
{"text":"So...I was trying to be healthy but the horrible employees at Zoup in Independence thought they would try to kill me.  I asked for two kids meals and a two item combo. Yes please give me a half of a turkey club and a cup of chicken pot pie please.  These dummies give me a cup of Lobster Bisque.  WTH! I am allergic to shellfish.  I took two bites before I realized what I was eating. The second bite didn't stay down and it was a wrap for me.  Throat started closing and I am panicking in front of my kids.  I screamed what the hell did you give me and I swirled the soup to see the red flesh.  The chick looks and says what are you saying you don't want the soup?  I am allergic to shellfish! She was nonchalant about it.  I pointed in her face like CALL 911!  I call my sister to get my children.  The ambulance arrives in like 8 minutes at this point I have tried to swallow two Zyrtec pills to ge the antihistamine in me.  That is not working fast enough.  The ambulance workers hit me with the good shot in the arm.  The entire time the Zoup Employees didn't even apologize for their error.  On top of that the employee wouldn't give up the management information and she said the manager leaves at 3 pm.  Wow!"}
{"text":"This place was amazing ordered some takeout and it was so delicious! Will definitely eat here again when I am in the area! In my opinion it is definitely better than Panera Bread! I will definitely recommend to friends and family"}
{"text":"I enjoyed my Lobster bisque from here. My husband had the spicy crab and rice. It was so yummy. I would definitely recommend to others"}
{"text":"Good place for a quick lunch. I generally hate chains but am a fan of this place. Soups and salads are fresh with lots of healthy options, and you can taste each soup before buying! This location was overall pretty good, clean with nice staff...no complaints!"}
{"text":"We visit this location very often for a quick bite...to make it easy, I will list the pros and the cons. 

PROS: 
-Plenty of parking
-In Avon Commons, which is sometimes crowded, but very accessible. 
-Cafe is very large and fairly clean. 
-Staff is mostly friendly. 
-Free samples of soups are given by request. 
-Salads and sandwiches are also available...not the cheapest or the best, but they are good, easy, and quick. 
-Soup is always warm. 
-Prices are fair. 
-Line moves quickly

CONS: 
-No outdoor seating here. 
-Just fountain drinks. No vitamin water, smart water, bottled water, etc. 
-Limited vegetarian options for a \"healthy place\".
-Some soups can be left \"out of the rotation\" for long periods of time. 
-Wifi is not great. 

Overall, this place is pretty good but just does not have their stuff together as much as Panera Brea. (there is one one minute away)"}
{"text":"I work in the area and will grab Zoup for lunch occasionally.  I always get one of their delicious soups paired with a half caesar salad.  I love that you are able to taste as many soups as you want before deciding what to order.  The staff is always very friendly and i love how quick they are about getting your order out.  You get larger portions for a cheaper price compared to what you get at Panera and its honestly a whole lot better.  They rotate soups daily and seasonally.  My favorites are the chicken and kale and tortilla chicken soup."}
{"text":"I came to this place today to satiate my craving for soup and boy, I was delighted. After trying some samples, I decided to settle down for a cup of Mexican chicken soup and a buffalo chix sandwich. The flavors are amazing. I also liked the overall feel of this place and the service was super fast . This is gonna be my new go to place for soups in town..."}
{"text":"I am so happy Zoup! will be here to keep me warm during these cold winter months! I'm a soup person, even in the summer! So I may be biased, but I think Zoup! is here to stay.

They had over a dozen of soups a day and you are welcome to taste a  sample to make sure you pick something you like. I had the crab bisque and it was unique and tasty! My boyfriend had the chicken pot pie and would not stop raving about how the crumbs on top literally make it taste like a chicken pot pie!

They have a pick two option similar to Panera and I went with that. My other side was a Cesar salad, not complaints here! Can't wait to go back!

Minus one star for the service, but maybe it was just a bad day!"}
{"text":"We finished a race at the Farmpark yesterday and Zoup was generously giving away beef and barley and also 7 bean soup. They were both tasty and Great harvest bread donated rolls to dip. Great event and now we're anxious to try out the restaurant. My wife likes broccoli cheddar in a bread bowl, so stay tuned...."}
{"text":"My wife and I ordered takeout and the service was very nice.  They were able to customize the menu a bit to accommodate needs and I really enjoyed the soup sampler - helped me make my decision!  The bread is nice and fresh, very soft.  So far we've tried the cheddar broccoli, old fashioned chicken noodle and lobster bisque soups - all great!  Would come back when looking for healthy options - oh and I like the nutrition info provided on the web site for each item, good job."}
{"text":"The restaurant was clean and nice.  The soups all looked like they had been sitting there for a while.  Chicken noodle was actually good.  Sandwich that I had was very good.  The salad just ok.  Lots of brown lettuce. Not super impressed."}
{"text":"This was our first visit to Zoup. The interior was spacious and bright. Everything was very clean, including the bathrooms.

We were greeted by the very friendly staff as soon as we walked in. We were asked if it was our first visit and when we said it was, they invited us over to have some samples of soup. 

We were very disappointed to find that there were no gluten-free options for the sandwiches and wraps. However, there were a couple of gluten-free soups, so we each ordered a soup/salad combo.

We both had the roasted tomato bisque, which was very flavourful and piping hot. I had the Sonoma salad which was very fresh and tasty. I enjoyed the fact that there were cranberries, nuts and gorgonzola, although I think it could have benefited from some protein. My husband had the cobb salad and he thought it was very good, with generous portions of most of the add-ins. It could have benefited from a little bit more egg (there was only about 1/4 of an egg).

Other than wishing they offered gluten-free options for the sandwiches, we also thought it would have been nice not to have been served with disposable dishes and cutlery since we were eating in.

All in all, we enjoyed our food and look forward to returning and trying some of the other dishes."}
{"text":"I really like this location.  Fast service and the employees are very friendly.  I do not even mind traveling from Brunswick.  I enjoy the lobster bisque but also like to try the various soups when I'm feeling adventurous."}
{"text":"I actually am a fan of Zoup. I think that at this location the soup is really good. The Salads.. not quite as good. But the soup is great. They have lots of different options and the bread bowls were awesome too. I love that they let you sample the soup!"}
{"text":"Zoup has good soup. Imagine that. My favorite part actually is that they let you sample all the soups. Not going to lie sometimes they aren't so good... other times it is pretty decent. Salads are trash and a waste of money. Sourdough bread bowls are always a good idea though. That's all."}
{"text":"This was our first time dining at Zoup! And I loved it! My husband and I both ordered the soup and salad combo. We upgraded the soup size to \"cup\" since it originally comes with a \"side\" size. Really filling- great for those who want a light and warm lunch :) I will def go back to this location! Very friendly staff and clean."}
{"text":"Well they always have great soup and great service but tonight, Chase P, went above and beyond. He gave great suggestions - blend two soups and go for the bread bowl - and even served me at my table (not the norm). One of my favorite places!"}
{"text":"I love Zoup! I love that you can sample everything. I recently went feeling slightly under the weather and ordered chicken pot pie and it was delicious. This location is a bit hard to park at during the lunch hour as the parking lot is packed."}
{"text":"I never knew about this place until mid-December to be honest. I originally thought a place where soup is a staple food seemed odd; and BOY was I wrong! I had their Loaded Baked Potato soup and was amazed at the taste! I then went back and tried other items on the menu. The Veggie Wrap is awesome, and I also love the Southwest Turkey as well. The sourdough bread that comes with the soup meal is pretty great too. I haven't had a visit to this location that has been in any way disappointing to me. Since I tend to be a creature of habit when I find a place like this I don't stray far from what I like, but if their other sandwiches are like the ones I tried; then it's going to be AMAZING!"}
{"text":"I went to Zoup on Saturday Feb. 1 before the snow storm and superbowl.  There were about 12 soups and I had onion and gumbo.  They were tasty and enjoyable.  They give you bread with each soup and they had 3 kinds of bread.  The service was fast and friendly and like the ice cream stores they will give you samples of the soups gladly for asking.  If a fast service type place, you go via the line and order looking at the soups, you pay.  They later call your name and you go up and get your baskets or plates.   Like Panera which is just a door or two away.  I think they call this fast casual.  So no waitresses or waiters.  Then you bus your plates or baskets.  

A nice addition and alternative to other fast casuals."}
{"text":"Soups are awesome. Sandwiches are just okay. I love that the menu changes often.
The little main street vibe they have going on up in this part of Southpointe is really cool, but I'm sure once it's fully built and occupied, it will be even nicer. Probably harder to get to and park, as well, but so it goes."}
{"text":"First of all i think they are a little over priced for a large soup it was 13 bucks for soup that has been sitting there for a few hours over a heating element. If i pay 13 bucks for soup i want it fresh made. The service was great but just not a fan of the price and quality"}
{"text":"Out shopping with my girlfriends, which stimulated our appetites.  Two of us were craving soup so Yelped what was in the area.  Voila, Zoup!  I ordered the Mushroom Soup (or Zoup) and it was delicious.  The broth was really flavorful, lots of mushrooms and not over salted and it was served with a multigrain roll.  

If I lived anywhere near a location you'd see me here weekly.  Staff was a little disorganized, but the person at the register pulled it together and was perhaps training the others.  Kudos to her."}
{"text":"Always a great selection of soups to choose from. Can never go wrong with the Chicken Pot Pie."}
{"text":"I was in Canonsburg and decided to check out Yelp for a suggestion for lunch. I came across Zoup and I guess I didn't read the reviews too well, because I didn't realize this was a chain restaurant. I thought I was going to a country place, not a Panera with a different name. Despite that, my food was very good. I got the Lobster Bisque, per many recommendations (and a sample) with the pesto sandwich. I was impressed at the portion size because I just ordered the you-pick-two type deal. 

It was a little hard to make my way around the industrial office park to find the place, but once I did there was no problem finding parking. If I'm ever back in the area at lunch time I wouldn't mind trying this again."}
{"text":"That have a variety of soups and we chose the corn crab and the curry chicken after trying. They are great! Complimentary wheat bread are so great! The zesty chicken with bacon sandwich is very fresh. I love that. I never see the curry salad sandwich elsewhere and my boyfriend loves that too. You need to try this place if you like sandwich and soup!"}
{"text":"Had the Chicken Wild Rice soup with Turkey Club. Great flavor and walking distance from hotel."}
{"text":"If you are expecting Panera you're going to be disappointed. Sandwiches were wet and soups were cold (they had just opened). Overall a clean place, but awkward service."}
{"text":"Tis' the season for soup, er, zoup.

I particularly enjoy the variety of soup here, I think they have around 10 different soups daily.  The handsome young feller working offered us samples of whichever one we wanted to try; I felt like I was at the ice cream store.

I got a side of soup which can be paired with a half sandwich or salad.  I chose a half salad with the lobster bisque (which was FULL of lobster, yum) and it was plenty of food.  I got a fountain drink and my meal was less than $10.  I couldn't finish everything as it was a thick soup and my niece was being a 2-year old and we had to see Santa.  

I'd definitely recommend and will surely go back and try some other soups and sandwiches."}
{"text":"Delicious, Soups! Their soups were as good as I imagined and better for a 1st time experience. I picked one safe choice (The Tomato Basil ) and then something I wasn't familiar with (The Curry Thai Chicken) to challenge my culinary comfort zones. The safe choice was amazing however the Curry Thai to my surprise was almost as good...all in all both are well worth a second visit. Their Collard Green Soup didn' t have that southern charm I've become accustom to thanks to my Grandparents and Mother's cooking but other than that if asked would I go there again... it would get a Big Yep from BIG H."}
{"text":"Good quality food, welcoming envirmoent, and quick accurate service.  

I have quickly become a fan of Zoup!  It is great for lunches especially since you may order online and pick-up with a seperate service line.  I recommend using the online ordering if you can.  The line can get long at times if you have to order in the store.  Service is good at the register. Nice, friendly, and quick, however the service on the soup line could be a little better. Overall very good though. 

Highly recommend, especially for lunch."}
{"text":"I am always amazed when I come across Zoups in my travels and of course always wish they were found in more locations.  Though a chain - they have an amazing soup and sandwich selection for good prices.  Being a vegan, they always have a minimum of 1 soup I can eat, which is a plus.  All of their sandwiches can be \"pressed\" - I love a warmed sandwich with warm soup on a cold day - perfect lunch!
My favorite thing about these restaurants is the consistency of service.  They are so nice and really want you to try/test the soups they have before you pick one."}
{"text":"Yes, it's a chain - but it's absolutely delicious!  Plus, they have many more dairy-free options than Panera!  With the soup/half sandwich combo being cheaper than Panera, I call this place a huge lunch win!!!!  Yumm!  
Free samples are great - but the variety is even better!"}
{"text":"I had the chicken ceaser salad with a cup of the chicken pot pie soup. It was pretty damn good. The salad was fresh and the soup was awesome. The staff was very friendly and welcoming."}
{"text":"Love the concept of Zoup!, especially I love soups.

12 soups a day with choices that includes seafood, beef stew, vegetables and more. They even encourage you to sample even you know what you going to order already.

Tips: if you in a rush don't order sandwich and salad because they are made to order and it took mine over 15 minute to be ready.

Try Two! Combo: 

Crab Bisque ($5.25) with a choice of bread as a side size though small but delicious with a lot of crabmeat. You do have an option to upsize to a cup for $1.35 extra.

Loco Burrito ($5.50) was quite spicy, love the dressing. 

The verdict: soup is really good. I think I would definitely be back for the soup. Zoup! at this price point I expect to eat out from real bowl and plate, similar to Panera Bread, but all I got were plastic containers and utensils."}
{"text":"I finally tried this place because I work in the area and it's conveniently located. Hands down, it's waaaayyyy better than Panera (who has increased their prices and decreased their portions). There are no words for the lobster bisque. It's that good. The curried chicken salad sandwich was also phenomenal. I can't wait to try a salad the next time. Get the punch card, esp. if you intend to come here often. The employees were all incredibly friendly and I love that you can sample the soups. This is my new place for lunch. No question!"}
{"text":"I stood at the counter for about 20 minutes waiting for someone to take my order. I made eye contact with the employees so they clearly knew I was standing there, but never greeted me or said they would be with me in a minute. After about 15-20 minutes of just standing at the counter, I decided to leave because it was obvious they were never going to take my order. I would never go back here again and would not recommend this place."}
{"text":"This is a great location. The dining room and restrooms are very clean. The service is friendly and fast. Sarah was my cashier tonight and she was very sweet, offering suggestions and polite small talk. My food came out quickly and was delicious. Perfect temperature and prepared well. So often I get sloppy sandwiches from fast food places and that's not the case at this location!

I'm not really a huge fan of soup in general, but when I do want a bowl of something hot and delicious, my only choice is Zoup!"}
{"text":"I love Zoup. It is the only place I can go for food that offers a great variety of soups and sandwiches. They have excellent veggie chips as well. Even the kids ate the whole bag when I brought it home. I love the chicken garlic soup. It melts in your mouth kind of reminds me of what my Grandma used to make."}
{"text":"This is a very good soup and sandwich shop. They always have 12 different soups on display and you can taste then before you buy helped by the counter staff. I went with the lobster bisque and it was really good. I also went with a half if a turkey club that was good too. With tea and tax my bill was a $12 and change.

I enjoyed it!"}
{"text":"I can't be the only one who thinks this place is average on it's best day...
We'll start with the highlights; the staff is friendly, and the place is clean and bright. And there are all the highlights for me.
Moving on.  The soups are just not that great.  Admittedly I have only had the lobster bisque and the chicken pot pie but I wasn't impressed with either.  The lobster bisque had a decent flavor but why all the rice?   I get that rice is cheap and it's a great filler, and that lobster is pricey but this was excessive.  Now lets talk about the chicken pot pie soup, I legitimately hated it.  I disliked the topping (a lot), the potato chunks were massive, the flavor was mediocre and there was very little chicken.  Considering this is place known for soup, I am hoping the other soups are considerably better but alas, I will never know.  I would not recommend this place but if you're in desperate need of food it's serviceable."}
{"text":"Came here with quite a lot of expectations and was very disappointed. The veggie wrap in particular was a huge disappointment. It was tomato, lettuce, a tiny undetectable quantity of guacamole wrapped in a whole wheat tortilla.I couldn't even finish for it was so bland. I am no cook but I can make a much better wrap myself any day. 

The chicken tortilla soup o the other hand was good."}
{"text":"Thier lobster bisque is amazing here! I also love their grilled cheese.. I haven't tried any salads yet but they have a lot of good ones on the menu! I love this place because they are eager for you to find something that you like and will offer for you to try any soup that you want before deciding on one! Very energetic awesome place. Great for a cold day to get some warm food."}
{"text":"I was told that I would love it since I'm a soup fanatic and I was definitely disappointed by the - price (for what I got). Yes it can be too expensive for a lunch/dinner. This location is clean and modernized. It reminded me of Panera Bread.

Happy:  Since there weren't a lot of people, we were able to (free) taste the 12 soups that they had that evening. They promote themselves as having 12 different soups everyday for you to try out. At the end, I had the spicy crab rice soup and the tuscan chicken sandwich. At least the food was hot. 

Not happy:  The price was confusing and it was expensive for the size that I paid for. I even got an upgrade. The service was a bit slow and the guy at the counter didn't know the break down of my soup/sandwich combo. And he didn't know if they accept amex too. My partner's salad lacked chicken and it wasn't a big salad to fill you up. 

Verdict:  The food was good but I wouldn't go back to it. For $14 for a meal, I can eat at a restaurant and get better food and service."}
{"text":"Zoup is a nice Panera style chain soup cafe. Unfortunately there are not enough around the city. This one is laid out differently but still follows the same pattern. Each day they have a menu of different soups. Some are on a daily basis. The staff is very friendly and willing to explain everything to you.

You can sample whatever soups they are offering that day before you make your purchase. You can pair it with either half a sandwich or half a salad and you get a roll to go with it. Drinks are machine style with free refills. What they neglected to tell me but I knew from a previous visit is that they have a rewards card where you get a stamp with each soup you buy.

Today's soup for me was clearly French onion. It lacked the cheese but made up for it in the flavor. It was very hearty. I paired it with an Asian chicken salad. Nothing out of the ordinary but descent. Free WiFi is available here. Keep in mind that this is not a bakery cafe so their desserts are extremely limited. They open at 11 am.

Zoup makes a nice alternative to a sit down or take out style lunch. This location is in the Fox Chapel strip mall. The one I visited in the summer was in Canonsburg, PA. I also learned today that their 3rd location is now open in Washington, PA.

I wish they were closer since they have a nice variety of soups. You can purchase it in different sizes. Prices vary accordingly. Expect to pay in the same vicinity of Panera Bread. It's definitely my go to place when I want soup and with the weather getting colder nothing beats a good hot bowl of it."}
{"text":"If George Constanza of \"Seinfeld\" fame would have walked in here I guarantee you he would not be turned away for soup. This is truly a great place to experience different types of soups.
The restaurant is on Main St right in the middle of a group of restaurants and stores in an Industrial Park.

The staff is extremely friendly, knowledgeable, and take the time out to explain how everything works. They have 12 soup offerings per day which change daily. The soups come in 4 different sizes to either eat in or take out. You can pair it if you wish with either half a sandwich or half a salad. Fountain drinks and ice tea are available as well. You can also order ahead if you have the YELP mobile app.

The place is set up Panera style except this is not a bakery cafe. They open at 11. One of great privileges you have is being able to \"sample\" the different soups or even chili they are serving that day before you make your selection. The chicken pot pie is by far the most popular one but I decided to go with the chicken chop chop soup and half of an Asian salad. You get a choice of French baquette or whole wheat bread to go with your soup. There is a small selection of desserts but the soup is what makes it.

They do have healthy choice offerings especially if you are watching. I was very pleased with my \"zoup\" and salad that came with a ginger sesame dressing. Prices are pretty much reasonable for your selection. Free WiFi is available if you are working.

They also have a rewards program where I was given a card for future visits. Zoup is a chain but each franchise is independently owned and operated. The only other location in the Pittsburgh area is in Fox Chapel but they are currently building one down in Washington, PA.

Free parallel street parking is available and believe me it does fill up fast! Hope to return in the fall when the season changes to see what the are offering then."}
{"text":"How are you going to charge $5 for a little thing of soup? I could get a giant bowl of pho later in the day for a couple bucks more and triple the amount! And it won't be some generic corporate weird place. I am giving them the benefit of the doubt because the chicken pot pie soup is good. If my generic corporate employer decides to throw a peasant like me a bone and give me free lunch, I guess I will get the chicken pot pie. Other than that, I will go to Mustard Seed for some soup that I can choose the weight and amount. I usually pay like $2.50 and it is better."}
{"text":"I walked through the rain and ate lunch here today. The Chicken Pot Pie Soup was good. I did the pick two, which is a combo of either a sandwich, soup or salad. The Asian salad was good too. The soup is a little bit on the expensive side, but it was very hearty and filling. A cold and dreary day calls for a nice warm soup. I am sure their business goes up in the fall and winter months. A lot of corporate type characters here who will get in your way while strutting around. I try not to spend a lot of money on lunch, and $4 for a sample of soup is kind of excessive."}
{"text":"I stopped here today while in the area for work, and saw the decent reviews. I'm sure glad I did! The experience started with the employees encouraging me to try as many as I wanted of their 12 rotating soups, which they were all good! But, I ended up deciding on the lobster bisque and the veggie wrap. It was a pick two combo similar to Panera, I also got a piece of bread. Now I may just be overall sick of Panera, but this is a chain yet way better! I enjoyed my lunch, which was flavorful yet simple. I will definitely be back when in the area. It does seem to get pretty busy during the lunch hour because so close to all the corporate offices, but they handled it with ease. 
The Pittsburgh area needs more of these! I would frequent more often."}
{"text":"Great place to stop for a quick bite!  I had never heard of this place but came it across while searching for somewhere to have a quick lunch.  We were able to quickly order and there was plenty of seating.  I had the chicken potpie soup.  The serving sizes were generous and the soup was delicious.  I will definitely be back."}
{"text":"I am giving this location 4 stars based on how lovely the service was. The staff are extremely helpful, friendly and even call you on a first name basis. The cashier suggested a good portion size and made a nice sandwich selection as I was not sure which one to get. The gentlemen who was preparing the items and bagging them was SO sweet. I couldn't get over how friendly he was, I felt as though I was in someones home. The overall restaurant is neat, clean and fully stocked.

I got the lobster bisque and a 1/2 sandwich of Chicken Toscana. The Lobster Bisque was not good in my opinion at all and not something that I would order again. It tasted off in my opinion and just not what I expected. Luckily it did not go to waste as I had a hungry co-worker who actually loves that soup and ate it. The chicken toscana sandwich was actually DELICIOUS. I wish I had gotten a whole one and left the soup behind-haha.

Even though I was not a fan of the soup, because of the great service and yummy sandwich, they earned 4 stars in my books! Good services does go a long way."}
{"text":"Zoup is like a soup-focused Panera.  It's faster, hotter, healthier, and more wholesome than a lot of the other options around town.  Great for a weekday lunch.

Employees are always attentive and pleasant."}
{"text":"I love soup. Probably more than most people. My mom would make soup the first course of EVERY dinner. Winter, spring, summer, fall, didn't matter. Bean, beef, chicken, pea, tomato, beet, cabbage and on and on. We always had a big bowl before the entree. 

So a restaurant dedicated to the love of soup sounds great to me. 

I even think the actual soup at Zoup is quite good. That chicken pot pie is addictive. 

Where they stumble are in the correlating aspects. Price, serving size, and serving style.

Prices are a little high. Not hugely so but enough that I've personally seen people walk in, make a comment on the prices, and walk out.

Portions are kind of small. A bowl will not fill you up, it's not enough for an average meal. 

If you dine in, they need to make the bowls a bit nicer. At this price you should at least be served in stoneware as Panera does if dining in. 

If they tweaked these things they'd be much busier. Sometimes on a chilly evening there's only 2-3 tables occupied."}
{"text":"I kept seeing this place every time I'd go to the plaza and at last, I finally paid them a visit. I'm glad I did. 

Before coming here, I had read a review saying that lobster bisque was their favorite out of all the soups offered. For some reason, that idea really resonated with me as when I went, I only asked to try that one and it was decent as far as soup goes. I honestly wanted to try more and I know I could have but people started trickling into the place and I didn't want to hold the line up. 

Upon deciding on the lobster bisque, my grandma pointed out that they have a combo deal which seemed to give good value for the price you pay. We ordered the the lobster bisque, tuna salad sandwich and I think the asian salad for the three of us to share. Mind you, it was my two grandparents and I. I honestly think it was enough for all three of us but only because they don't typically eat a lot. 

The employees were relatively friendly and seemed to enjoy working there. I also asked for some cups to serve myself some water as well as an extra bowl to share the soup. All in all a good experience. Not a complete 5 star review because nothing really stood out in terms of food but I will come back to try the rest of their soups! 

Visited on November 16th!"}
{"text":"Customer service is good. Clean place and customers can view the soups.
Portion size is also good and price is reasonable.  Quality multigrain bread that  was served was good it was fresh and soft."}
{"text":"Located in the food court of Simcoe Place, Zoup! is one of the few places that doesn't have a massive line-up during lunch. Their menu advertises a \"try 2\" option, where you can get a half sandwich and small soup. I ordered the crab bisque and the Southwest turkey sandwich. It could have been the salt talking, but I thought the crab bisque was amazing! It was thick, savory, and had a good amount of vegetables and strands of crab meat. I also enjoyed the Southwest turkey sandwich. It had the perfect amount of turkey to tomato ratio with perfectly melted cheese on top. The ingredients provided a nice balance of savory, saltiness, and sweetness."}
{"text":"It's tough to go wrong with Zoup as it fits every occasion from a warm break in the winter to a decent sit-down lunch in the summer. Strangely, the first time I came here I ended up coming back almost 2 weeks later (if you've got the crab/lobster bisque on your mind, I highly recommend giving it a try). With all the options too, it's a great place for people of all tastes."}
{"text":"As the temperature begins to fall, the days shorten, and gray skies lead to fits of depression - this is the cure. Like walking into your grandma's kitchen, the aromas of the fresh soup will brighten any day. The soups are delicious, the sandwiches are tasty and the bread - well it's incredibly good.  During that certain time of year this place is a must. And dropping by occasionally the rest of year reminds you why you'll be back when the weather turns frigid again."}
{"text":"Can't say how much I love Zoup!! 

Every soup I've tried here is so delicious, as well all the sandwiches. For fast service and a great selection I wouldn't go anywhere else. I wish they would start replacing all the Panera's with Zoup! 

It is definitely one of the best Lobster Bisque soups I've ever had!"}
{"text":"As my famous saying around work goes...I love soup,, I love turkey....I love brad....Brad isn't important here.   But the other two-check!  I love soups!  They have a wide variety to suit anyone.  I happened to be in the area for three weeks for work, so this was a frqeuent lunch spot.   Staff is super friendly, fast and helpful.  Offering samples of soups so you can decide.  They rotate soups daily.  You can get various sizes of soups, you can pair it with a sandwich or salad.   It's fresh and fast.   Everything about this place is yum!"}
{"text":"It's really nice that you can sample all of their soups before you pick one. Most of them are really good. Lobster bisque is one of my favorites. Their salad with strawberry dressing is really good also."}
{"text":"This was my first time visiting Zoup! and it's absolutely amazing! I got the combo with half a 3-Cheese Pesto sandwich and a cup of Lobster Bisque! The sandwich was savory, juicy, and my favorite, CHEESY! The soup was nice and warm. The flavor was perfect. What a great first experience! If you love soup, I would recommend Zoup!"}
{"text":"The food is delicious and the manager could not be more gracious.  I needed to transport soup in hot weather and the manager went out of his way to package it in ice!  The staff is pleasant, the restaurant is spotless and the food certainly fills a niche!"}
{"text":"*3.5* 

Great concept! I love how you can sample all of the soups before picking. My favourite was the lobster bisque. It wasn't the BEST lobster bisque I've ever had but on a cold winter day.. This would be awesome! 

Will definitely be back :)"}
{"text":"Went in there today to get some soup after being in the hospital. Girl working was extremely helpful and super nice! Very good customer service skills!!! Keep up the good work!!! :)"}
{"text":"My husband and I went here for the first time yesterday, and we love it! If you love soup, this is the place for you!!! They have a great variety of soups and they are just delicious! We also had a chicken wrap that was incredible!! The staff was wonderful as well. They were friendly and explained the different combos and foods, and they encouraged us to sample the different soups before we made our selections. We will definitely be back. We highly recommend Zoup!!!!!"}
{"text":"Food is fine but experience would've been better if the staff stopped hitting on women long enough to get orders correct/completed promptly."}
{"text":"Me and the wife wanted something on the healthier side so decided to try this place out. It did not disappoint. Soup was great and sandwich was one of the best I have had in a long time. Don't debate just eat here."}
{"text":"So I've never had zoup before and don't live near one so I figured I would try it. I had Maureen help me and as soon as I walked in she asked if I had been there and explained the concept. She smiled and was very attentive. I didn't eat my food yet but wanted to just say how great she was! Her customer service was awesome :) thank you!"}
{"text":"Three of us went here for lunch yesterday for the first time and had all had soup.  All three were very good - the Chicken Tortilla, the Cheesy Potato and the Chicken Dumpling.

The Greek wrap that I had was good, and so big I could not eat it all.  The salad with chicken that another person ordered had a lot of chicken; the third person had a mozzarella and tomato sandwich, that looked great and was also too much to eat at one sitting.  

The staff was very friendly and efficient.  They offer to let you taste any and all of the soups.

The only drawback is that they do not have anything warm to drink and it was freezing inside!"}
{"text":"Had the lobster bisque and wrap.  
Soup is delicious with good portioning of lobster.  Flavorful , creamy n buttery.  
Vege wrap was fresh and filling. Five stars"}
{"text":"Soup was pretty decent. Had the lemon chicken basil. That said, I'd normally give 4 stars for delivering a decent product - 5 for wowing me. But I'm taking it down a peg for the bafflingly slow delivery. 

So you walk in this place and the line seems like a buffet line full of soups. Great just what I wanted for winter, a bowl of hotness and get me out of here. You'd think they'd pour you a bowl right there, pass it down to the cashier, ring you up, Bob's your uncle and you're on your merry way. Two man operation, three tops with the sandwich guy on the backboard. If you ordered a sandwich, wait a sec while the guy makes it. You'd already have your soup if you want to suck that down while you wait. 


Do they do that? Nope. The buffet style line isn't used at all, it's just like a display I guess.  For some reason there's like 8 people milling around and apparently getting in each other's way. Myself and probably 5 customers standing around waiting, probably annoying already seated folks with our forced hovering, as we stare at clearly done and ready to go orders that are sitting there on the backboard. 

What are they waiting for? A harried looking girl who is puzzling over putting the items together into orders, then bagging and tagging them. 

The temptation to reach in the well area to grab the rapidly cooling soups you know belong to you is really frustrating and as a Lean process analyst absolutely maddening. 

How you can complicate pouring a bowl of soup I'll never know, but honestly I was entertained by the floor show."}
{"text":"I like the concept, but many of their soups are really heavy and loaded with calories.  Feels like a click above regular fast food restaurants...if you want something \"comfort food\" this may satisfy you."}
{"text":"Zoup is definitely one of the best places to go for gourmet soups. It is on the pricy side however if you are looking for something warm on this cold day, zoup has what you need. I sampled the whole grain chicken and dill, very good and light. I also tried the corn and pepper chowder, creamier but very comforting. I eventually got the fire roasted sundried tomato and it was very good! Try them out"}
{"text":"LOVE this place. Soups all are homemade...nothing from a can and taste fresh and delicious.  They allow you to sample soups so you know what your getting and my favourite so far is the chicken curry.  Their salads and sandwiches are fresh and the staff as super friendly.  It's my regular place to get a quick and healthy lunch."}
{"text":"Came here the other day to use the last of my gift card. Had the chicken and dumplings soup  unreal! The hearty beef vegetable was runner up"}
{"text":"Zoup. It is this really popular lunch place in Cleveland and they have a daily changing menu of soup, sandwiches and salads every day. On this day, I had chicken pot pie soup and a chicken toscana sandwich, both of which were phenomenal. What I love is that you just get so much food and if you get a soup, you also get a nice piece of bread to go with it! 

This place is really popular at lunch time! Sometimes the line is even out the door! I recommend placing your order online and then just picking it up. It will save you so much time and they actually serve on time. 

Probably one of the best places to grab a quick lunch and they just have such great food for not very much."}
{"text":"Wow ! Several choices of delicious soups on a rainy day! I sampled several choices and decided on the Lobster Bisque ! I was torn between the chicken pot pie and the Bisque. Fresh bread, friendly service and affordable prices make for a great lunch"}
{"text":"The four stars is for just one type of soup-- the vegetable bounty soup is one of my favorite soups ever. I don't know how they make it (and I've tried to recreate it at home with no success), but it is awesome. I used to go here on the days when they had vegetable bounty (when I lived in Cleveland). I was always disappointed when I got there and it was a day without that flavor of soup. I tried many of the other flavors and found them to be fine, but nothing special. But the vegetable bounty is seriously worth going here for."}
