{"text":"I came here with my family as my first cabane a sucre experience and was not disappointed in the experience. Most everything comes with (or a variation of) maple something. The sausage is cooked in it, the eggs are, the baked beans are, the maple sugar pie, you name it and it pretty much is. I`m not sure if I`m not disappointed that the milk didn`t have it.  Anyways, this is straight traditional-Quebec-maple-tapping-lumberjack-food at its finest. You need it to stick to your ribs in true comfort food fashion? Come here for that.  The little crepes/pancakes with the maple sauce? To die for! My sister`s eyeballs almost rolled into the back of her head when she tasted it. At least that`s what I think I saw since I was approaching food coma status.  Make sure you go during the season to truly experience it, I believe that is February and what`s left of March.  Gotta go, I think my body will reject the water and salt I try to put back into it just to balance out my body`s chemistry!"}
{"text":"I go to the sugar shack twice a year on average and I've never been back to the same one twice but I will be back here next year for sure! Food selection was great and all you can eat left me full and satisfied! Went with some friends but definitely recommend it for families as well, they have outdoors activities to make the day more then just a good meal."}
{"text":"Love the food and the fun I've shared here with friends.  We've come here two years in a row now and have made it our annual \"cabane a sucre\" destination.    My favourite items are the cretons, sausage, baked beans, beets, and sugar pie, while my husband's favourite is hands down the pea soup.  Of course, you'll need to drown everything in maple syrup. I even recommend pouring it into your coffee for a major and tasty sugar high (like you'll really need more of that!).  If you're up for it, you can walk around the property and take a look at their resident critters, including some peacock, turkeys, and goats.  You can even get a pony ride if you want, though I think it's probably better suited for children than adults!  Make sure you reserve in advance and SHOW UP ON TIME, otherwise, you risk losing your reservation!"}
{"text":"This was my first sugar shack experience and I really enjoyed it! This place is huge --two rooms, each seating ~100 people, and tables can be made as small (for us, two people), or as large (12 people) as necessary. I was concerned going in that trying to get \"seconds\" (or thirds) of our favourites would be awkward when the meal is served at the table, but the helpful servers/staff are so clearly used to second/third/fourth rounds that it was not awkward at all. I'm now a fan of the 'buffet served at your table' as I think this has a few benefits I never thought about before: 1) you can stay seated, chatting with your family/friends throughout the entire meal (rather than 'pausing' conversations when different people in your party gets up to go back to the buffet), 2) related to #1 --no standing/waiting in line at all!, and 3) since you're served a little bit of everything in several stages (1st stage: soup and bread, 2nd stage: main dishes, 3rd stage: dessert...and repeat stages until you're ready to be rolled out the door) you're better able to try a little bit of everything rather than gorging on one or two main items that caught your eye in the buffet line.   Had we had little kids, or were traveling in a touristy/big group, I would likely give this place 5 stars because this place is a well-oiled machine and I can see how it would become a nice annual family tradition. But as a couple of two, all the extra 'benefits' that are likely part of the cost ($27 pp for lunch/dinner on weekends) are lost on us --pony rides, farm animals, and playgrounds. We did enjoy the complimentary tractor ride (although note: you can just as easily drive yourself on the main road) to a cider tasting/cider shop down the road, and the maple sugar on ice, though. Even though I'm not a big buffet person (I'm more of a carb- than meat-eater, so buffets never seem quite worth the cost for me), I highly recommend this place for people who have never been to a sugar shack before. It is a fun and unique experience, and the staff here will take very good care of you. But don't forget to make your reservation beforehand!"}
{"text":"I heard of this location from a coworker and wasn't expecting much but the food was classic, delicious, inexpensive and good quality. After the meal we were given tickets for maple syrup on a stick, which is a very fun and delicious QC experience to have!   The location is very beautiful with a huge play area for children. There is a nice area for sitting by the fire outdoors.   The service staff was very kind and timely. I would recommend this location for anyone close by who wants a wholesome sugar shack meal."}
{"text":"Glad to be in Quebec for maple season aka cabane a sucre time! After doing a little research, my friends and I settled on this lovely spot. Luckily we made a reservation (tip #1) because, despite it being a Thursday at 2pm, the place was packed.   Sat down and the food started arriving not long after. Bread and cretons. Pea soup. Beets and slaw. More food. Omelette and ham. Bacon and sausage. Then the sweet stuff. Pancakes, donuts, and sugar pie. I'm almost keeling over from all the fatty sweet goodness. Am I gonna get out of here alive?  Did I mention the rose apple cider we had that was amazing?   Long story short, if you want to break that fast the RIGHT way, and want to enjoy some québécois charm along the way, definitely visit this lovely spot. You won't be disappointed!"}
{"text":"'Tis the season for maple-fuelled sugar highs and pork fat-induced drowsiness. We actually selected a very bad weekend to go sugar shacking, as it was -20C without the wind factor. And the wind was definitely there.   Nevertheless, we HAD to show this wonderful tradition to an Argentinian friend who would soon return home, so we rented a car, braved the cold and drove to Mont-St-Grégoire. The drive there is rather short and easy. The road to l'Erabliere Charbonneau is lined with countless other sugar shacks, but Charbonneau is one of the best reviewed. The sugar shack's compound is rather large, comprising of a mini-farm with goats (and a llama!!), a playground, an orchard, a house dedicated to maple-on-snow, and the Charbonneau restaurant.   We didn't make a reservation, but we arrived right at opening time and got a table right away. The restaurant's food is nice, although a bit simple. Everything (except a small apple juice sample) is all-you-can-eat, which makes the ~33$/person price tag seem reasonable. For that price, you also get maple-on-snow and a tractor ride to the orchard nearby, where you can sample cider and wines. The meal has three services: 1) entrees (beets, coleslaw, split bean/ham soup, bread and pork spread, etc), 2) mains (eggs and ham, sausages, bacon/oreilles de crisse, potatoes, beef patties, beans), and 3) desserts (pancakes, maple butterscotch, \"pets-de-soeur\", sugar pie, etc.). After the second wave of food, we were already pretty bloated, so desserts threw us staight into food coma.   To wake us up, we went to see the orchard shop - which is barely 3 minutes away - but sitting in the back of that tractor in the bitter cold made it seem more like 10 minutes. The shop is quite nice, with tons of local products, maple confections, candies, pies, pickles, and, strangely, emu oil-based hygiene products (!). There was free, warm cinnamon-flavored apple juice for everyone, and free samples of ciders and wines in a little house nearby. But most of us just wanted to take a nap, so we crumbled into comfy sofas in a lobby closeby. Half an hour later, we shaked off the drowsiness to brave once again the cold and return to the main compound. There, we each had a maple taffy on ice, rushed to the warm comfort of our car and drove off. It was a very quiet drive back."}
{"text":"I was sure I had left a review for this... Oh yeah the mobile review wasn't available ! Sorry just thinking out loud. Wow, time for a new iPhone. Anyway.... If your looking for a real authentic quality sugar shack, this is the place to go. Listen to me, I'm telling you, this is DA best ! Now I'm not comparing to the 60$ something PDC which I have yet to try but Charbonneau Is authentic and you can get a 3$ off printable coupon online. I come here every year in the spring. There is a tractor ride, a little farm with a few animals you can feed, pony rides for kids, a cider tasting, and a shop to buy the local goodies. It's not just a place you go to for food ( although lets not kid ourselves...that's my main reason ) it's a place you go to for memories and a fun family experience. I've tried many sugar shacks in my lifetime so far and been left disappointed like bad recycled food, now don't take me wrong I am miss environment so recycling is sort of a religion to me but for a place you pay for to go eat,  is not really what i sign up for. Here the food is ALWAYS FRESH ! The meat pies, the maple sausages, the pickled veggies, the homemade fruit ketchup, the fluffy eggs with maple syrup, OMG leave room for desert !! I know the food is too good believe me I KNOW but you have to !!! I swear or you will be sad because the pettes de soeurs and caramel coulis ( tastes like hot melted werthers original caramels ) and crepes are to murder for, seriously you can't get that caramel coulis  out of my husband's hands, he will hurt you.  Ok enough said, now go there and enjoy as I know you will. I don't see how this place could ever score less than 5*."}
{"text":"L'Erabliere Charbonneau is definitely one of the nicer and calmer Sugar Shacks that I have been to. On the way to Mont St Gregoire, we passed many sugar shacks in the same area but were tempted to visit this one due to its good reviews. The rustic dining room has a lovely warm and homely feel to it so you can really just get comfortable and tuck in to all that heavy grub!  The food is good, great for meat/pork lovers so not much selection if you aren't a fan of pork. We were given a little 'shot' of house apple juice (not part of the all-you-can-eat) which I thoroughly enjoyed. The veggy starters were nice - coleslaw was delicious! Main course rounds were brought to the table and refilled constantly. Dishes mainly consisting of pork/bacon. I requested to have a plain omelette which I enjoyed very much with the house potatoes. The potatoes were the highlight for me, thick cut and crispy, just how I like them. My favourite part were the desserts - the sugar pie, 'pets de soeur, pancakes and donuts... so much to choose from. And of course, to add to the sugar high, you drench all of this in their famous maple syrup. Oh what a load of sugary goodness! My colleagues and I could not move after all that food so definitely come with an empty stomach and you're sure to be full all day long! The service was very good, the girls serving us were kind and friendly. They had no problem agreeing to my special requests (no pork on omelette etc).  After eating, you are given a token for your maple taffy. This is in another little barn across the main building where you can see and try the famous maple on snow!   We came on a very wet and muddy day, so I did not get round to seeing the other features at the place but some of my colleagues went around the site on the truck to see the animals and gift shop.  Overall, I had a great time and think I have had a good dose of sugar-shack food to last me another 5 years!"}
{"text":"This sugar shack was memorable because of the huge park outside! My son loved the swings and various play structures. The tractor ride was really fun for my son as well but personally I didn't enjoy having dust blown in my face the entire ride.  As for the food, I will admit I did NOT eat the food (I took my portion to go for someone else as I don't eat this type of food for healthnut reasons). The food looked pretty basic and I was surprised by the small portions that were brought for a table of 13! Yes, I know you can always ask for another round but why not bring 2 of everything (1 for each half of the table) considering our group size instead of having 13 people pass everything from one end of the table to the other.  Also, my husband said he had stomach cramps the next day and he usually has an iron stomach.  As for the dessert, I saw some brown sugar roll photos here on Yelp but we weren't served any of that. Also, the pancakes we were served were around the size of coaster, and very flat, unlike the Yelp photos.  The dance hall in the basement consisted of a bartender feeding songs from her phone into some speakers. The dance area was located in a corner next to the bathrooms (which smelled pretty bad by the end of the day) and most of the room was taken up by empty tables for some reason. I would have preferred a more open space with some ambiance for dancing. The bartender was a decent DJ albeit from her phone!  As for our overall experience, the decor is warm and inviting and we were seated on time as we had reservations. However, the charm ends there as our table was located in the pathway to the bathroom against a pillar so people had to squeeze between the pillar and our table to reach the bathroom. I was constantly trying to move out of the way and was uncomfortably glued to the table.   The service was very basic I'm not sure why we were asked to tip as from what I recall you don't tip at cabane a sucre as it's included in the fee. So, expect to tip on top of the costs.  I went here due to family obligation and my son had fun so I'm happy. However, I feel like they squeezed in way too many people and the food wasn't anything out of the ordinary.   One last thing, I didn't like seeing those pony rides where the ponies are tied to chains forced to walk in circles for probably the entire day. Why not let the ponies walk freely? Even better just have the kid sit on the pony while it's standing? These \"pony wheels\" are not what children want or need. Let them brush the pony, pet it, and take a pic and be done. Rant over!"}
{"text":"Wow wow wow wow wow! Je n'ai que des commentaires positifs à faire à propos de cet endroit excepté peut être la grosseur de la salle à manger. Nous étions un peu à l'étroit et avec beaucoup de gens autour de nous il commençait à faire très chaud. Par contre, la nourriture y est IMBATTABLE. Les plats de qualité supérieure aux autres cabanes à sucre où j'ai déjà été auparavant. Les boulettes de viande sont délicieuses, sans parler des petites tourtières en portion individuelle, les fameuses oreilles de crisse, la soupe au pois et les desserts dont j'aurais mangé davantage si je n'étais pas sur le bord d'exploser. Le prix en vaut vraiment la peine."}
{"text":"Toujours très agréable à mi-chemin entre la grosse érablière commercial et la petite familiale. La nourriture est excellente."}
{"text":"We went here several months ago when it was still pretty cold out and had such a fantastic time here. It was our first \"cabanes a sucre\" experience and was so much fun. The food was surprisingly really good. The service was wonderful. The staff was extremely nice. One lady couldn't speak English and she actually apologized and gave a little hug to my husband who asked for more potatoes and sent an English speaking waitress to him. Ha!  How very sweet was that?  I've never been to a place that put a wine bottle sized maple syrup bottle on the table, but hey no complaints here!  The kids had a blast and ate all their food which tells you how good everything was. The meal included pea soup (so yum...always thought it would be green but theirs was yellow), bread, meatballs, sausages, ham, eggs, baked beans, coleslaw.  For dessert mini pancakes, mini donuts, a sugary pastry ( not sure what it was but was hard coated in pure sugar) and of course sugar pie!!!    The greatest part was all the space the kids had to expend their sugar high.  They ran and played amongst a maple tree forest and see maple sap in the tin buckets attached to the trees.  In better weather, there's a great space to climb and be up high in the trees for the bigger kids.  The property had a mini pony ride and an animal shed that held goats and turkeys.  Not a petting zoo though so keep those little fingers off the fencing.  Especially those turkeys.  Can't really blame them, can you?  That was really my only gripe --- caged animals.  Although the ponies were super adorable, I wouldn't let my kids ride them round and round in a circle strapped to a pole.  But that's just a personal decision."}
{"text":"This place is okay... I heard it's one of the best but I wasn't amazed. It serves all of the sugar shack classics such as pea soup, maple glazed sausages, cretons, eggs, ham, beans, etc... one thing that stands out is the meat pie (tourtière) which is made in individual portions in the shape of beef patties. I didn't like the potatoes which are baked. I would have preferred mashed potatoes. The dessert is much better than the main meal. The pets de soeur is unique. I haven't seen it anywhere else. Enjoy!"}
{"text":"I was excited to go to my first sugar shack eating experience, as I had previously only eaten the syrup in the snow but not the actual meals. Its all you can eat, but honestly they give you so much food the first time around it's hard to stuff in seconds! So you start with pea soup, which I didn't enjoy much to be honest. Next is the main meal, ham, eggs, sausages, beans, meat pie, potatoes and bacon... honestly only the potatoes, sausages and beans had me excited as everything else was painfully average. The dessert however was amazing. Little donuts, crepes and sugar pie, with sugary maple syrup that tasted so creamy and excellent. Would go just for the dessert!"}
